{"name": "Sword of the Stars", "name_review": "Sword of the Stars Review", "ref": "https://www.ign.com/articles/2006/08/18/sword-of-the-stars-review", "text": "Though I'm sure the job is fraught with many more dangers, when it finally comes time for me to live out my space-faring fantasies, I'd far rather experience it from the deck of a warship bristling with laser cannons than from the rostrum of an alien senate or the sterile laboratory of a xenobiologist. Thankfully, Sword of the Stars is here to tide me over in the meantime. The new space empire game from Kerberos Productions puts the emphasis squarely on building massive space fleets and sending them to attack the ships and worlds of your enemy.  The new game features a highly customizable campaign, allowing players to conquer galaxies ranging from a few dozen to a few hundred stars in size. With full control over the number and ability of your opponents, the amount of cash, planets and techs each starts with, you can setup basic scenarios to be tackled in a single night or huge month-long epics. If you're not in the mood for the open-ended games, a variety of scripted scenarios allow for more specific setups and challenges, some of which are ideal for cooperative and competitive online play.   There are four factions to choose from here, each of which comes with unique abilities and strategies.  Each of these races can only colonize worlds that fall within a certain climate range. That means that there could be planets right on your doorstep that you can't even use but you still might need to station ships around it to keep your enemy from laying claim to it.  The Humans, not surprisingly, are relatively neutral in terms of advantages and weaknesses. Their fleets aren't particularly great at anything but they're not particularly bad at anything either. The lizard-like Tarka are a very aggressive race with powerful, inexpensive ship designs that don't require much in the way of upgrades to tackle their foes. The peaceful space dolphins known as the Liir are the exact opposite of the Tarka. Where the Tarka have the edge in basic ship performance, the Liir focus instead on technological improvements. Let them develop for a while and you'll start to be able to turn the tables on your more powerful enemies. Finally, the insectoid Hive have remarkably sturdy ships that can take a lot of damage. Their fast population growth ensures that they can get colonies up and running very quickly.   More interesting than the general advantages of each race are their unique modes of travel. The Tarka and Liir each rely on reliable engines that can take them anywhere in a hurry. The Hive travel much more slowly than the other races but they can also construct massive warp gates that allow them to travel from one to another instantaneously. The downside is that the warp gates require time to set up and must be protected from enemy destruction.  My favorite travel system is the human's Node Drive. The planets in Sword of the Stars are connected by Node Lines that the Humans can use to travel at great speeds. The downside is that you'll have sometimes have to relay between several nodes to get to a distant location. Since each race has its own way of getting around, you'll really have to put some thought into how you defend your colonies from attack.  Regardless of which drive system you use, you'll also have to keep a ready supply of tankers nearby to refuel ships as they move between colonies. It's less of a problem for the Hive but even they have to worry about running out of gas as they use their regular drives to get the warp gates into place.  A wide variety of technologies helps you custom design your fleets, outfitting them with point-defense cannons, cloaking devices, missile launchers and such. (Each time you play the game, the tech tree is scrambled up a bit so you may not get access to the same technologies that others can get. Nice touch.) The ship design interface is very easy to use and lets you swap modules in and out with some very simple pull-down menus. You'll start with some basic ships but the rapid pace of technological progress will encourage you to start working on your own designs in the earliest stages of the game. Adapting your weapons and defenses to counter your enemy's designs becomes a huge priority once you each have a few more options available.       The tactical portion of the game follows the standard RTS conventions we've come to expect. Grouping, movement, attacking and such are all going to be instantly familiar to anyone who has played an RTS game in the last five years. For some dumb reason, though, when your ships first encounter those of another alien race, your ships are set to hold their fire. Since none of the people I've ever run into have asked me over for tea and space crumpets, I have no idea why the ships shouldn't start with an aggressive stance.  Though the combat takes place on a (relatively) flat plane, I was pleased to see that the developers made a real attempt to simulate what space combat might actually be like. (We are, sensibly, overlooking the cool sounds made by the guns and explosions.) Newton's Laws reign supreme here in space, so you'll see the effect of inertia as ships drift and slide as they maneuver around their opponents.   There are no health bars here either. Instead you'll have to rely on the remarkably thorough visual damage modeling to tell just how bad off a ship is. Perhaps the coolest feature of all is that you can target specific areas of a ship. Wherever part of the enemy ship your cursor is over when you issue a fire order is the part of the ship your fleets will try to hit. This opens the door for some sophisticated tactics. Do you try to take out a small weapon on the top of the ship or do you aim for the middle of the ship where, even if you miss a little, you're still likely to do some damage? The way this all works so naturally is truly remarkable.  Early on, combat can be very indecisive with ships clashing with each other turn after turn before someone actually wins. Part of the problem is that fleets are very small in the early stages of the game, which makes it hard for them to really smash an opponent. The greater problem is that the default time limit for tactical battles is a bit short. While it keeps the action moving (especially in multiplayer) and allows you to bring in fresh forces during the combat, it's just too difficult for one side to crush another in two-and-a-half minutes. Once we moved the slider up to allow battles to last up to ten minutes, we started seeing some clear victories.   For all that it gets right, Sword of the Stars makes some maddening interface errors that could easily have been avoided. Any game in the genre that doesn't at least attempt to reproduce the convenience and clarity seen in recent games like Civilization IV is going to seem awkward and cumbersome by comparison. It's disappointing to see how frequently Sword of the Stars fails to call attention to many of the events that are essential to planning, executing and evaluating your strategy.  The biggest offense here is that there's no battle summary screen. Since the fleet combats are the basic component of gameplay here, it's just unforgivable that there's no wrap-up report at the end of each turn. It's not at all a problem for the battles you commanded yourself but if you used the auto-resolve feature, you're going to be left in the dark. Once the battle is over you'll have to hunt down the fleet in question to see how badly they've been damaged. That's assuming of course that you remember what ships were in the fleet to begin with.  There's a similar problem with fleets that have run out of fuel. The game will tell you that you have a stranded fleet, but it's up to you to actually find them on the map.  As much as I love the 3D strategic map, the fact that you can't set build orders directly from this view is a constant frustration. In order to make sure that each colony builds the right type of ships for its circumstances, you'll have to go back and forth from the build screen to the strategic map. It seems like it would be a lot easier just to have a simple pull down menu pop up so you could issue build orders while you're contemplating the threats and opportunities each colony has in front of it.  Your current research project is shown in the top left of the strategic interface. Simply mouse over the icon to see what the technology is and how far along your research has progressed. So far so good, right? But the game doesn't ever prompt you to begin a new project when the first one is completed. How much easier would it have been to have a simple window pop up to announce the completion of the project and prompt the player to choose a new technology?      There are quite a few issues like this in Sword of the Stars. While none of them ruined my enjoyment of the game, it's just an added hassle to have to search for information that should be put right up front. To be fair, some of these features had been added late in development, so I have high hopes that the developers will continue to help the game communicate more of this information to the players.  My only other real concern about the game is that it's so heavily weighted towards building and fighting with the fleets. As I said at the beginning, I tend to warmong in these types of games, so it's right up my alley. Still, Sword of the Stars just doesn't have the same variety found in games like Galactic Civilizations, Master of Orion, and Space Empires. The research tree here is little more than a warehouse full of ship parts, the concept of planetary infrastructure is entirely abstract and the diplomatic options are virtually non-existent. For some gamers, that lack of variety may work in the game's favor, eliminating distractions that would otherwise get in the way of blowing stuff up.   You can tell from the screenshots that the game looks quite good. Sure, we've seen better effects and more inspired designs in other space games, but the overall aesthetic of Sword of the Stars is consistent, quirky, and holds up well. I really have no complaints about the strategic map but I'd love to have seen a few more pyrotechnics in the battles. Some of the weapon effects are so small and so dark that you don't really get a clear sense of who's shooting at whom. The gradual damage modeling is a very nice touch that heightens the tension but the explosions when a ship is destroyed aren't quite as dazzling.   As I said before, we're long past the point of complaining about hearing sound in space. If you can get past the issue (and if you can't, what's wrong with you?), you'll really appreciate the weight and authority of the sounds of the weapons and explosions. The soundtrack and interface sounds also serve the game well but the real treasures of the sound design are the alien voices. I can't quite put my finger on it but they're perfectly creepy and are full of convincing personality. Sword of the Stars has a lot going for it. I love the slick, high-tech look of the interface. A little more functionality would be nice, of course, but the game looks much more futuristic and advanced than any other space empire game on the market. Manuevering fleets around and engaging in combat with your enemies is the whole point of the game and the developers have managed to make it fun and interesting to wage war against your enemies.On the downside, Sword of the Stars lacks many of the conveniences we've come to expect from games in this genre. At times the interface seems to be withholding things from you. Additionally, the war-heavy focus may turn off space empire fans who prefer more peaceful forms of domination.", "date": "Aug 18, 2006"}