{"name": "Bust-A-Move 4", "name_review": "Bust-A-Move 4", "ref": "https://www.ign.com/articles/2000/02/16/bust-a-move-4-2", "text": "Let me warn you right up front that this is going to be a short review. The fact is, if you've played any of the games in the Bust-A-Move series, you've got a pretty good idea of what Bust-A-Move 4 is all about. If you haven't played any of the game in the series, you're probably not reading this review. All that really needs to be said about this title is that it's another great effort from Taito gameplay-wise and that it's a pretty lousy conversion graphics-wise.   Okay, just on the off chance that there are a few puzzle game fans out there who honestly haven't heard of the Bust-A-Move games, let me give a quick summation. Bust-A-Move 4, like the other titles that came before it is a deceptively simple cross between an action game and a puzzle game that takes place in the Bubble Bobble universe. In each level, you're presented with a clump of multi-colored bubbles that you must eliminate by firing other multicolored bubbles from a small cannon. Each time you get a group of three or more bubbles of the same color touching each other, those bubbles disappear and fall of the screen, as do any bubbles that were hanging on to them. As you play, the top of your screen will push slowly towards the bottom. If it manages to push any bubbles below the bottom of the screen, you lose. While this all sounds pretty confusing, it's actually really simple in practice. Even the intern learned how to play in about five minutes.  If this sounds pretty familiar to those of you who have played the other games in the series before, it's because Bust-A-Move 4 deviates very little from the formula created by the first few titles. In the Puzzle mode, you have the choice between an Arcade mode in which you must move through a maze of different puzzles and a Story mode where you have to collect different Tarot cards by beating increasingly difficult levels. Player Vs. Computer is also split up into two modes, Story and Win Contest. In the first, you've got to beat each computer opponent in turn in order to see a tale play out. This story changes depending on which character you've selected. In Win Contest you simply see how many times you can get consecutive wins. Challenge mode is where the game gets nasty. There are five different platforms, each consisting of five different puzzles that you've got to get through. At the end of each platform, you'll be given a grade on your speed, technique and strategy. If you do well enough, you'll be able to unlock the game's Edit mode. Once you've got the Edit mode unlocked, you'll be able to create your own puzzles, a reward that I found pretty dull. Finally, there's the game's head-to-head mode, which is pretty much self-explanatory.  There are a couple of new features in Bust-A-Move. In addition to a few new characters, the game also has a new pulley system that is very challenging. In some of the game's puzzles, the bubbles are hanging from different ends of a rope. If you break or add too many bubbles on one side or the other, the rope will shift, bringing you closer to disaster. I really liked this new add-on as it created the need for a completely new set of play strategies without changing the fundamental nature of the game at all.  While I really loved this game, I have to admit that I was pretty turned off by its grainy graphics and often choppy animation. Still, the fact that the game is only about $20 and the fact that it will run on low-end computers more than makes up for the dated visuals. If you're into puzzle games, this is a title that is well worth the rather low price.  -- Trent C. Ward", "date": "Feb 16, 2000"}