{"name": "Star Fox Command", "name_review": "Star Fox Command Review", "ref": "https://www.ign.com/articles/2006/08/25/star-fox-command-review", "text": "The original Star Fox game gained its notoriety because it was the game that arguably pioneered the 3D era on consoles back in 1992. Even with that as the game's one main ~hook,~ Nintendo and its development team at Argonaut managed to pull off an incredibly memorable and amazingly fun experience, and Star Fox was strong enough to continue on as a franchise and join the likes of Metroid, Zelda, and Mario in the stable of sequel-favored Nintendo properties.   Of course, a decade and a half later 3D is the norm in game design, so any Star Fox sequel has to focus squarely on its gameplay to hook the players. Star Fox 64 is considered the one game in the series that truly ~got it,~ understanding what made the original's game design so special and advancing it forward with new elements that fit the sci-fi environment established on the 16-bit system. When Nintendo moved from N64 to GameCube Star Fox came along for the ride in a love it or hate it character-driven  adventure that barely touched upon the original combat aspects of the franchise. As a response to the gamers' demands for a true Star Fox we got the Namco-designed Star Fox Assault that offered promise in the air, but it focused far too much on clunky on-foot missions that seemed way out of place from the original concept.   In other words, Nintendo's Star Fox has had its up and downs in its near 15-year history. But the company hasn't thrown in the towel on this oddly-established universe and its zoo-like variety of anthropomorphic animals. These characters can be cool again with the right team behind them, and for that to happen Nintendo went with a development team that was there from the beginning. The result: Star Fox Command for the Nintendo DS is a surprisingly rich and faithful action game that returns the franchise to the original and successful Star Fox and Star Fox 64 game mechanics. Though some residual quirks are still in the game design, Star Fox Command works really well on the dual-screen portable and offers unique touch controls that, with a little practice and a bit of acceptance, fits the classic gameplay with some awesome precision D-pads and analog sticks wish they could offer.   You don't need to understand or have followed the Star Fox legacy to enjoy Star Fox Command, because the game has been designed in such a way that it's almost a ~restart~ of the franchise. Fox McCloud, leader of the Star Fox Team, is now a loner as his group has disbanded after the events of Star Fox Assault. Peppy's been promoted to General, Falco's off doing his own thing in the cosmos, Slippy's somewhere gettin' busy with his new Fiancee, and Krystal...well, that's where much of the story revolves. Due to a ~I love you and can't lose you~ complex, Fox kicked her out of the team --  as a result, she's off gallivanting with the rival Star Wolf team instead. The story bobs and weaves in different paths, each with a different end to the Star Fox tale, and Fox seems to get slapped around a lot due to him ousting Krystal from the team. It's a little goofy to care for a love-torn ship-flying fox, but the writers actually put together some stories that are worth following all the way to their finish.   Unlike the previous three games in the Star Fox franchise, Star Fox Command sticks with the Super NES design and keeps the characters permanently seatbelted inside their air combat vehicles. No on-foot missions, no ground running tanks. Just pure air combat, taking us back to the days of the original Super NES Star Fox. But it's not the same Star Fox gameplay: gone are the forced-forward on-rails level. Instead, the designers have worked in the free-roaming arena-style air combat for most of Star Fox Command's levels. Players fly around in a limited range area, blasting anything that looks, sounds, or acts like a bad guy. Each level has a specific enemy to wipe out, which will drop a star token to collect. Grab all of these stars and it's off to the next challenge.   Players control their craft entirely by the touch screen, which is also doing double duty as an overhead map that displays every enemy in the level. Slide the stylus around the touch screen and the aircraft will rise, fall and turn to match every subtle move your hand's making. Aiming is incredibly precise and really gives players the feeling that they're fully in control of their ship. It's not entirely perfect or optimal, though, as players will also have to control airspeed and special maneuvers using the stylus - double tapping the upper half of the screen boosts your ship into overdrive, with a double-tap on the lower half cutting the craft's speed with airbrakes. Even with practice this extra control is just a tad wonky - players have to double tap the screen and leave the stylus touching the screen in order to boost or brake while steering the ship, and there's just not enough visual cue to see that your ship's doing exactly what you want.   But the biggest culprit of the slightly loosey-goosey control is the game's ~barrel roll~ system. Barrel rolling has been a design aspect since the original Star Fox, which gives the players the ability to deflect incoming shots and attract nearby power-up items with a rapid spinning motion. Previous Star Fox games handled barrel rolling with a double tap of a shoulder button. With Star Fox Command, it's a basic left-right-left or right-left-right scribble motion with the stylus. In theory it works; in practice, not as much as it should - or, rather, it works too well. Imagine targeting an enemy to the right, then the left, then back right again. Bam, you're now in a barrel roll, wasting precious energy that could be used when you really need it. Now, much of the game actually requires a good command of the barrel roll function since survival depends on bouncing enemy shots right back at them. But nothing's more frustrating than trying to fly straight and having your ship rolling wildly when it shouldn't.    We can understand the decision for this control aspect - by putting all the craft's movement on the lower screen, all players need to do is fire the guns with an action button. Every single button, from the A, B, X, and Y to the D-pad and shoulder buttons, do exactly the same thing: fire. Leaving the thumb on one button eliminates the horrible cramping that games such as Metroid Prime Hunters does to the hand. This game does not cramp the hand, but you'll have to deal with the odd sputters of unintentional barrel rolling as well as boosts and braking that don't take on the first try.   Star Fox Command is only as challenging as what players want to get out of it. Missions can be completed in a few minutes or an hour depending on how players approach the ~strategy~ portion. Unlike past Star Fox games' level progression, Star Fox Command lays out its levels in an overhead map where players must chart out each team member's course. Some areas can be flown over, others can not. Some characters have longer flight paths than others. If you don't plot out a path properly, enemy ships can reach your Great Fox ship and end the game, so it's important to intercept them and remove them from the map. Each enemy dot is essentially a game level, and where they're intercepted determines the environment you'll be fighting and flying.     Each level can be completed with a bare minimum of enemy shooting: find the appropriate enemy, collect its star, and it's over. But the game rewards players for perfection: clear out the entire arena and you'll earn a bonus missile which can be used to simply wipe out an enemy on the strategy map with a simple tap of the magic stylus. This may seem like a superbly overpowered ability, and initially it is - players can stock up on a maximum of three missiles at any one turn and simply wipe out enemy fleets without even playing the combat missions. It's a quick way of getting through the game, but on the flipside if you're playing for high score (the game saves the highest score earned in each of its nine different paths) using the missiles is detrimental to your point tally.    Overall, the single player experience can be put on the ~easy~ side. It's not hard to properly remove enemies in the strategy portions, and after a bit of practice with the controls, understanding how enemies behave, and focusing on collecting power-ups, you'll rarely find yourself dying in a level. And even if you do happen to get taken out, there are plenty of opportunities for extra lives - we've never run out. Ever.   The single player mode can also get just a little repetitive in places because of its easy difficulty. A ~chase the missile~ mission constantly pops up in each mission that requires players to fly through rings in order to boost and catch up to a missile flying towards the Great Fox ship. These missions are easy to complete almost to the point of not being necessary, and yet players are constantly required to play through them.   But easy as it is, the single player challenge is incredibly rewarding because of the storyline. There are nine endings to Star Fox Command, and the only way to get them all is through multiple plays through. If the game was a drag to play there's be no fun in uncovering all the plotlines. But Star Fox Command's single player mode is fun, warts and all. Fans of the Star Fox series will definitely love the references to past games, from familiar locations and enemies to a boss level that's reminiscent of the Andross floating head battle. It's also really cool to play as every character within the Star Fox universe, each with their own ship of different strengths and designs. We do miss the ~save your wingman~ aspect from previous games, an element that doesn't make the cut for Star Fox Command, and it's just a shame that the level pathways are simply dicated by choices within the storyline instead of dependent on specific gameplay requirements like in Star Fox and Star Fox 64. But it's clear that the development team was intensely familiar with the original game when creating Star Fox Command.    Completely separate to the solo outing is a great and energetic multiplayer design. It's a little on the basic side - no team play, only one type of ship, and an ~everyone for himself~ challenge. But it's extremely competitive and well constructed: taking out an enemy isn't enough, you'll need to snag the star that downed pilot dropped. This ~snag a star~ desgn leaves it way open to steal someone else's kill, which can be overwhelmingly rewarding or downright frustrating, depending on whether you were the killer or the stealer. Six players can compete locally using one Star Fox Command cartridge, or you can take it online and duke it out against up to three other opponents. This is a mode that shouldn't be missed, but keep it between friends when hitting the Nintendo Wi-Fi Connection - we've experienced players dropping out after losing simply to keep their win-loss record. And unfortunately, a dropped player will reset any kills you may have earned in the match.   Star Fox Command is easily one of the prettiest 3D games on the Nintendo DS system - environments are detailed and the game flows at a smooth 30 frames per second clip.  There are bouts of slowdown in the occasional level when environments get a little too cluttered with enemies and bullets, but nothing super alarming or devastating to the overall Star Fox Command experience. Compared to the original Star Fox and its Star Fox 64 sequel, though, the visuals are stunning. On the sound front, we've got a solid soundtrack derived from the style introduced in Star Fox 64, and character vocals that are a throwback to the Super NES original: each character speaks in an incoherent garble, which sort of makes sense in context and never really seems ~wrong,~ even when every game after Star Fox on the SNES established voice-over work for all of the characters. The designers make it up to the players by adding a fun feature that allows them to record their own voice as all of the character's spoken gibberish.   It's a property with a shaky history, but it's one that I hold in high regard: the original Star Fox Super NES game is in my top ten games of all time because of the impact it had on me back in the day - it was, at the time, an amazing game to experience, both fun to watch and play. Its visuals don't hold up very well at all, but the gameplay can fight those battles in its place.Star Fox Command might offer a new and different experience, but along with some key gameplay and presentation elements the feel of the classic SNES game is intact. The stylus controls might still need some work but the core idea is sound, with accuracy and precision that previous Star Fox games - and air combat titles in general - just never offered before.It's at the very least a great start to the franchise. Bump up the difficulty, add some variety to the missions, bring back the forced-scrolling on-rails levels and the wingman-in-danger elements in a sequel and you'll have yourself the ultimate Star Fox adventure.", "date": "Aug 25, 2006"}