{"name": "My Dog", "name_review": "My Dog Review", "ref": "https://www.ign.com/articles/2006/08/30/my-dog-review", "text": "The virtual pet category is a natural for mobile, thanks to the always-on/always-with attachment we have with our cellphones. But efforts at the genre up to now have been very limited -- most games settle for minor amplifications on the premises found in Bandai's 90s pop culture phenom Tamagotchi. My Dog is the first mobile pet sim that expands the boundaries of the genre, offering a much deeper experience that may initially throw mobile gamers for a loop. Mobile gamers -- myself included -- are conditioned for instant gratification, on the accepted tenets of gaming on the platform. The bond that My Dog wants to create between man and pup, however, requires more attention than the typical mobile session. Sure, you could just log in and pet your puppy to see it smile, but to get the most out of My Dog, you must commit a decent amount of time and energy. Funny, real dogs are like that, too.   My Dog does not shy away from its obvious inspiration, the platinum-selling Nintendogs for the Nintendo DS. But while My Dog does not have all the bells and whistles that the advanced DS platform can provide, My Dog definitely captures the essence of the smash hit, providing gamers with a reasonable taste of dog ownership, including both the fun stuff (petting and play time) and the work (feeding and poop scooping).   At the onset of the game, player choose their pup from a litter, selecting gender and color. All pups essentially look the same, thanks to a singular puppy design (more on this in a minute), but you can choose from chocolate, tan, and other fuzzy hues. You're guided through the basic of puppy care by a vet. The vet explains feeding, playing, bathroom, and exercise. The vet will always be watching your progress, for better or worse. If you need a little help, or if My Dog has a new concept to introduce, the vet reappears. He'll also be there with a good scolding if you ignore your puppy for too long.   Your digital house has three ~rooms~ for the puppy to ramble through. The kitchen is where you feed and water the dog, as well as store food and treats. The living room has a box of toys (you can always buy more with your daily $10 allowance or award money) and a TV for entertaining the puppy. The outdoor yard is where you play with the puppy and give it a bath. None of these rooms is used less than the others. A well rounded rearing is important to success.   You must also take your puppy for walks around the neighborhood. The neighborhood screen is one of My Dog's weaker points -- it's not as detailed or attractive as the other screens. When the puppy goes for a walk, you just see some paw prints box the block. This is something that should be addressed in a potential My Dog 2: Dog Harder. For the neighborhood screen, you can access the pet store and the show center, where you can enter you pup in Best in Show and Agility Trails. Your standing in these contests are improved by taking care of food and bathing, as well as playtime and exercise. Money from winning shows can be used to buy toys and treats. I wish the shows were a little more interactive instead of just rewards for taking proper care of the dog. Maybe a frisbee contest or a rhythm-based agility course mini-game could be considered for a future edition.   Interacting with the puppy is a lot of fun -- if you put some effort into it. Like a real pup, your dog is easily pleased by attention, such as scratching and stroking. He'll respond with icons in thought bubbles, like smiley faces. Keep a constant eye on those thought bubbles, as that's your key for knowing the dog's needs. A water spigot means the pup is thirsty, for example. The different rooms are assigned to number keys. There is a clickable menu that appears on the top of the screen which contains options for initiating a walk or petting, plus a basic watch mode for just observing the happy puppy.   Time plays a major part in My Dog -- the game operates on a real world clock. If you need to stock up on dog food and treats, you actually have to visit the pet shop during regular business hours. There's no quick visit to the shop at 2AM for neglectful puppy owners. There are also no dog shows in the middle of the night, so if you want to enter poochie in a contest, you have to be ready during the waking hours. This may sound like a pain, but there is a solid streak of realism that runs through My Dog, and the decision to ~lock~ the game to the real world clock was a smart choice. Just like Nintendogs might have dissuaded more than a few people for getting a dog they couldn't take care of, My Dog should also offer some indication of whether or not you're dog material. If you cannot be bothered to log into the game twice a day to feed and walk a digital puppy, chances are you don't have the necessary time to raise a real dog properly. (This might explain why the Society for Prevention of Cruelty to Animals -- SPCA -- was keen on My Dog. And I-play donates a little cash to the major pet fund with every download.)   My Dog uses a clever, stylized look to differentiate itself from other dog sims. The pup is created from a collection of circles which allows for some very clever, very cute animations. The house is painted up in warm tones. The real world clock affects the look of the game. When it's 1AM in the real world, take a peek outside: the sky is dark. Nice touch.  As mentioned, My Dog really does require attention to get the most out of it. When I first fired up the game, I needed to get over my instinct to look for immediate reward -- one of the design hallmarks of mobile gaming. Instead, My Dog is played as one long arc, with daily offerings like money to buy new toys, bath time fun, and extended petting sessions. It don't need to hover over the screen for hours on end, but you must at lest check in with your pup twice a day to feed it and play with it -- even to turn the lights off at night so it can get some shut-eye. I wish the dog shows were more interactive and the neighborhood walks spruced up to match the kind of interaction you find in the house. If you've been interested in Nintendogs and hesitant to lay out the cash for a Nintendo DS, My Dog is a good alternative. And if you'd just like to take a break from the incessant stream of poker and sudoku games, My Dog might be just the thing to get your tail wagging again.", "date": "Aug 30, 2006"}