{"name": "Thunder Brigade", "name_review": "Thunder Brigade", "ref": "https://www.ign.com/articles/1999/02/26/thunder-brigade", "text": "Thunder Brigade places you in the driver's seat of a futuristic tank. Your job is to destroy the enemy--kill his tanks, blow up his buildings, teach him the lyrics to the Bonanza theme, you know the drill. The game is remarkably simple in design and this is perhaps its greatest weakness. That's really a shame because there are a few fresh ideas in the game. We've all played sims or strategy games that put too much responsibility or control in the hands of the player. These games tend to bury their action under too many details. Unfortunately Thunder Brigade takes the opposite path and offers little in terms of control and game mechanics.   The story is basic enough. With the overpopulation of the Earth, humanity began to seek out new worlds to inhabit. Before the development of the Stargate, the colonization of space was limited by the expense of transporting colonists across vast distances. The Stargate allows people to step from one world to another instantaneously. A small military coup held in the recently colonized Halon system resulted in the overthrow of the local Earth Alliance government. The coup leaders seized control of neighboring colonies and destroyed all the nearby Stargate portals to prevent the Earth Alliance from interfering. A resistance movement called the United Systems (US) has sprung up on the nearby Kildae star system and has won their first major victory over the authoritarian Halon Empire. Now all three groups are struggling for dominance in the galaxy.  Each faction has six or seven tanks and its own unique design strategy. The US tanks are built for speed and mobility and rely heavily on the latest stealth technology. Halon tanks by comparison are offense heavy, sacrificing defense and speed for raw firepower. The Earth Alliance engineers have produced designs that fill very narrow roles. Their designs are superb but lack versatility. Each tank is the peak of performance in one particular area, but very weak in all others. This excessive specialization can be a liability unless the tanks are supported by other classes.  There are four broad categories of tanks. Stealth tanks are weak in all respects save mobility. Their low-visibility makes them ideal for hit-and-run attacks and reconnaissance missions. The Battle tanks are mid-range designs with a nice balance between mobility and firepower. For defense you rely on Heavy tanks, slow but powerful machines. Even slower and more impressive in terms of firepower is the Demolisher class of tanks. These boys definitely do the job but must be supplemented with light, more agile escorts to be of any real use.  Each tank is fitted with up to six different weapons. The Rail Gun is the most common. This gun has unlimited ammo but does minimal damage. It's designed primarily for short-range action but is also an excellent sniping weapon. The Plasma Cannon is an even shorter-ranged, high-powered weapon. It has a horribly slow velocity and so is better suited for attacks on buildings than on other tanks.  The HV Rockets are non-homing weapons of poor strength. Luckily, tanks that carry them house them by the hundreds. They require no energy to operate and are therefore ideal for tanks with weak power plants. The Homing Missiles are more powerful and will follow locked targets, but these missiles come in very small quantities and so must be saved for special use.  AT Mines are good defensive weapons. They are supposedly excellent for escaping pursuit but I found them easy to avoid. So did the computer-controlled tanks. The mines are built to explode only when they sense the presence of an enemy, so lay down as many as you want. The Laser Designator is also an indirectly offensive weapon. It allows you to call in air strikes from nearby missile bases. This weapon relies on stealth and speed to be used correctly and so is usually fitted on lighter tanks. Each tank also carries a sensor array. Your sensors tell you where other tanks and structures are located. Sensors can be set to either active or passive mode. Active sensors tell you more specific information but they also give away your position to other tanks. Each tank also carries a shield battery that absorbs damage.  For some missions you may be given up to five wingmen. The game allows a respectable amount of flexibility in using these guys. They can be set like regular wingmen to fire at will, engage freely, cover your ass and so on. You can also send them out of formation on individual errands. You may specify waypoints for them or set them on permanent sentry duty. You can also send them to attack units or buildings far removed from your own location. Overall I found them to be very smart and capable.  The individual commands for the wingmen are accessed through the scenario map. The map screen allows you to view the battle from overhead. You just click on the wingman and assign him a target or waypoint. This method of controlling the wingmen is a little dangerous because the game doesn't pause while you're looking at the map screen. Luckily, there is a small screen in the lower corner of the map screen that shows the view from your tank.  The controls are few in number but somewhat tricky to operate. Playing with a standard two-button joystick poses no special problems. What was tricky for me was that the joystick only controls the heading of the tank while the thrust controls are on the keyboard. You're required to hold down the thrust key to maintain forward or backward momentum. There're no degrees of acceleration. It's merely on all the way on or off. I found this irritating as the only way to go slower is to use short bursts of speed.  The game interfaces are all scaled down so that you can spend most of your time in the action of the game. While this gives a more arcade-like feel-which some gamers prefer-it tends to detract from the realism and involvement that one might get from more complex simulations. I'm not saying that the fun of a game is directly related to the amount of effort or concentration it takes to play-often just the opposite is true. But here all you can do in your tank is move or fire. Occasionally, you'll get a wingman to boss around, but I found myself wanting more.  Although you are piloting anti-gravity, ~flying~ tanks, all this amounts to is that they float a few feet off the ground. They can make short vertical hops but are very limited in vertical mobility. The fact that these tanks float above the ground means that they handle very loosely. They tend to drift when you're turning but once you get used to this you'll find it easy to compensate.  The campaign mode only allows you to fight for the US against the Halon Empire. Why service for the two other factions is not allowed is a mystery to me. The game would have been much better if the designers had included this option. All the action takes place over three worlds in 30 missions. There's a nice balance between defensive and offensive actions. Sometimes you're trying to destroy stuff and sometimes you're trying to prevent its destruction. I found that the missions were not overly hard and even the ones that were difficult were still enjoyable. There is a substantial enough story behind all the missions so that it doesn't seem like a bunch of disconnected scenarios.  I especially liked the mission briefings (and how often do you hear that?). There's a voice over explaining the objectives to you in as clear a manner as I've heard in a long time. They really spell out your goals. Also refreshing was the addition of hyperlinks to the mission text. When the guy says you'll be facing BC110 tanks, you can click on the name and find out just what a BC110 can do. If he says you must destroy the Sensor Towers, click on the words to get a run down of what the towers look like and what they do.  Like most other games, this one gives you a score bonus or penalty based on the difficulty level you've chosen to play. I found the difficulty levels to be very well represented. The easiest is very easy and the hardest is very hard. The three levels in between strike a nice balance between victory as a foregone conclusion and a statistical impossibility. I found all three of the middle difficulties very enjoyable. Also interesting is the addition of scoring bonuses for not saving the game. If you complete a scenario without saving the game you receive a substantial scoring bonus. You get a slightly smaller bonus if you have saved only once. If you saved more than that you get no bonus whatsoever. What a great idea.  As an alternative to playing the campaigns, you may also create and play your own scenarios. You place units and assign targets and mission objectives. The scenario builder is very easy to use in terms of placing units and structures but it takes a while to figure out how to achieve balance and action within a mission. The key to this is selecting appropriate targets and objectives for each of the sides. There are twelve maps to choose from in the game offering a variety of terrains and atmospheres. All in all, the scenario builder worked better and more quickly than many others I've seen. My only complaint is that the maps are fairly small and the terrain is just generally hilly. There are no big mountains or valleys to exploit.  Thunder Brigade is genuinely a lot of fun for the first few days. The missions are interesting and engaging. The built in scenario designer is very flexible and easy to use. Although a tank design feature would make this game complete, the other features do bring a measure of depth and variety to the game. What's really lacking is an option to choose sides for campaign play. The controls and combat interface lack complexity and this may bore some players who prefer a more involved gaming experience. Those of you who don't want to be burdened with excessive controls will find this game entertaining if a little shallow.  -- Stephen Butts", "date": "Feb 26, 1999"}