{"name": "TestDrive Unlimited", "name_review": "Test Drive Unlimited Review", "ref": "https://www.ign.com/articles/2006/09/07/test-drive-unlimited-review-3", "text": "Test Drive Unlimited has gone beyond the ordinary for racing games. Most in the genre usually take place in real world locations and recreate sections of a city so that you can race through them. Test Drive Unlimited has removed all of those boundaries and mapped the entire island of Oahu with so much detail that people who have been there will likely recognize the scenery. All of the roads are there for you to drive on at your leisure or race on in pre-made or custom courses. It's expansive and seamless, allowing for near-limitless racing possibilities. Even better, the line between single-player and multiplayer racing has been nearly erased. Unfortunately, the racing mechanics and car customization don't keep up with the driving freedom, but that's not enough to keep it down.   The way that Test Drive Unlimited is presented is what impresses us most. At the top of the list is the method of finding a race, particularly for multiplayer gaming. Creating a game that blurs the line between single and multiplayer racing as effortlessly as Test Drive Unlimited does is a feat in itself. Provided you have an Xbox Live Gold account, you're placed into one of the online servers as soon as you finish the tutorial. From there, you can drive wherever you please on the island, enter missions or solo races, or choose to partake in a huge variety of multiplayer races. You'll see other players driving around on the road just as you are and can challenge them to a race right then and there by flashing your headlights. Or you can simply drive past them and pretend they're no different than the numerous AI cars that also inhabit the road. Just by turning the game on and driving around the island, you're already partaking in the multiplayer experience. The way that you can play with any of the numerous modes alongside the entire Xbox Live community is unique, extremely well done and makes the game flat out fun.     Some poor chump bought our car for way more than it was worth. There are a slew of modes to experience as well. The single-player game has missions of course, which involves driving someone or something to a particular location within a time limit or escorting an expensive car across the island without dinging it. For these you'll get huge cash rewards or coupons to purchase a wardrobe for your character. The races are split up into three main categories; timed challenges, race challenges, and speed challenges. The time and race challenges aren't anything extraordinary. You simply need to beat a group of opponents or a specific time. There are variations on the basic idea here, which include being forced to race cleanly or meet specific checkpoints. Most of the speed challenges give you several points where your pace will be clocked and you'll have to average a specific rate of travel when you cross these points (which you can do in any order you choose). Other speed challenges only require you to reach certain rapidity within the time limit under tough conditions. These challenges are great fun as they're the ones that make you do the most planning and upgrading of your cars.    Although the single-player racing is fun, the multiplayer is where Test Drive Unlimited really shines. All of the same options for racing in single-player are present in the multiplayer as well, but with a few additions. The first is that anybody can create a challenge and upload it for others to try out. We've already seen some great race courses designed and amazing times posted. You can also join an auto club, Test Drive Unlimited's form of a clan. From there, you can challenge others in your clan to a race or other clans for racing superiority. The competition is going to be first rate.   Oahu is big. Very big. Aside from the user-designed challenges is an array of races pre-made by the developers. They're good hubs for meeting up to race large crowds and the lobby system works well for quickly getting into or out of a race. We prefer the last method of competition, though, which is to cruise around looking for chumps and challenging them there on the spot. If they accept, they pick a finish marker and the two of you are off. If they decline the challenge, we suggest you do what we do -- follow them and repeatedly slam into them until they accept the race. The option for a revenge match is there too and the both of you can sit and pick marks around the island all day. The Instant Challenge option makes you feel like a kid again by suddenly challenging your friend to a race up the stairs or to the far side of the street. This system works great and we only ran into a couple of instances were cars where lagging back and forth on a street corner as we threw down the gauntlet.   It should be noted that without an Xbox Live Gold account, you'll be missing out Test Drive Unlimited's best part. The solo mode certainly has a lot to offer, but you aren't receiving anything particularly special aside from a nice island to drive around. The way online is implemented is what sets this racer apart from everything else. Without it, you may be left wondering what the big deal is.     To go along with the giant island of Oahu is a satellite map that streams in ~Google Maps~ style as you scroll around it. From the map you can warp to any previously-visited destination, view open races and their conditions, spot the locations of other online players, or check out the locations of stores or houses for sale. The map will even keep track of every road you've driven. Zooming in to your car from the map may be the coolest way to transition from an atlas to gameplay that we've seen. The camera will actually fly straight down into the streets and up behind your car, giving you the feeling of diving down into the world.    The way the cars handle has come a long way from early builds and the experience is largely enjoyable, though it isn't anything to write home about. The controls are still a little bit loose and take some getting used to. Different cars have their own unique handling, but once you spend some time with the sticks and a particular car, you'll be able to keep your ride going where you want it. The largest gripe we have with the driving is that every off-road surface feels like sand. In a game where you can create your own shortcuts, having the non-paved surface be an area where you simply drive slower and skid in circles is a bit of a letdown.    But we have a much bigger problem with the motorcycles. They feel as if they were simply tacked on so they could be included as a checkbox for advertising purposes. Most of the bikes turn worse than cars do, even at the lowest speeds. Forget about taking tight turns with any momentum or powersliding. With some huge blind spots on the analog stick present on certain bikes, the driving becomes jerky and erratic. Crashing a motorcycle around turns became a regular occurrence for us, which brings up another bad part about the bikes: the animations. Crash simulations weren't coded, so when you hit something you'll either just stop dead or skid a couple of feet. Either way, the next motion should be a spectacular crash. Instead it's a short loading pause while you're placed back on the road. Much like every other aspect of the motorcycles, the crashes feel rushed and aren't pleasing. The entire package just doesn't feel like a motorcycle and isn't nearly as fun as the rest of the game.    Motorcycles are fast, but they don't feel like bikes. There are 90 real-life vehicles included in Test Drive Unlimited with the promise of more coming via Marketplace. This isn't a huge amount when compared to some other games, but getting the money to purchase every house (so you have enough space for your cars) and the rides themselves is going to take quite some time. You can upgrade a good number of the cars, but there aren't any sort of tweaking or tuning options. Upgrading a ride is as simple as going to the proper shop and putting down the money to buy one of three improvements. It feels as if there are more options for tweaking your character than the cars... which seems backwards for a racing game. When so many of the competitions have online leaderboards, the inability to tweak our car to the exact way we want it to handle is disappointing.   As an interesting side note, Oahu apparently has a police force of about five thousand troopers (if our hour long rampage across the island is any indication). It's a wonder Duane Chapman (aka Dog the Bounty Hunter) has any work. The police will come hunt you down, but only if you get into an accident of some sort. Zipping by a cop car at 215 mph doesn't seem to faze them. A slight scratch, though, and watch out. The way the police pursue is based on a slightly broken system. The first accident will only make them look for you. If they see you, they'll give chase but give up after a short while. Get in a second consecutive accident and the cops will actually try to give you a ticket. They do this by trying to ram you off the road. See where this is going? When they hit you it registers as another accident, making more police cars come to slam into you. When you get to a certain point, they'll come indefinitely and start setting up road blocks. The fines can be upwards of $50,000 which only means you'll be cursing at the screen when a cop nails you and then fines you for their zealousness. All of this can happen within a race where you're looking to set a best time. Ugh.   Officer, we can explain everything... The graphics in Test Drive Unlimited are characteristic of any game that has had a lot of work put into it but never received the last bit of polish it needed. The most noticeable bit of ugliness is in the character models. No amount of tweaking with the character editing tools can take away the creepy, vacant look that everyone in the game possesses. Even more eerie is the complete lack of any NPCs on the entire island of Oahu. Apparently everyone who isn't out driving prefers to hide inside their houses instead of enjoying the tropical paradise they live in.    But the game is about racing, not the characters in the cars. The vehicles certainly look better than the people, though they won't win any awards when put up against the top notch racers like PGR3. The cars look too tall and thin for the road they're on, especially when the camera is pulled all of the way back. The way the sun glints off of the rooftops is another source for complaint. Rather than directly reflecting off of surfaces, it appears to diffuse before it reflects, engulfing the entire vehicle. Another bit of ugliness surrounding your vehicle is the smoke that pours out when you burn some rubber. It looks more like somebody dumped gray paint on the screen than a cloud of pollution.     Oahu itself looks fantastic and will surely capture nearly all of your attention. The lush flora that makes it a favorite vacation destination has been recreated faithfully making for some vivid scenery. Simply driving about and enjoying the scenery can be as much fun as hopping in a competition. It should be noted that the end result of playing too much of Test Drive Unlimited will be the desire to take a little trip to Oahu.    If you look on a map, Oahu may not seem like a very big place. Try driving around it in Test Drive Unlimited and you'll see exactly how many miles of road there are to cover. You can drive nearly anywhere on the island, though some places are blocked off by fences, and you won't find yourself with a loading screen until you enter a race, mission, or warp to a previously visited location. Streaming technology has come a long way and Test Drive Unlimited is a great example of what can be done with it. There are only a few issues with odd texture pop-in from the streaming engine. For the most part, the driving is seamless. You're not going to see a car or tree appear out of nowhere right in front of you. However, if you watch the sides of the road as you drive along a cliff, you'll notice some weeds or shrubs appearing later than they should. It's a minor but noticeable hitch.   Vertical synching, a problem that has plagued other 360 racers (we're looking at you Moto GP 2006), is almost entirely absent in Test Drive Unlimited. We did notice a few times when the bottom portion of the screen didn't exactly match up with the area above it, most notably when going through a tunnel, but it isn't anything that is evident on a regular basis.    Like the graphics, the animations and physics in the game also have a lack of polish, or in some instances, a lack of existence. Driving into any sort of solid object will create a brick wall experience regardless of what you just hit. Slamming into a small bush will create the same response as hitting building. If you drive your car into the ocean, there won't be a splash. Instead you'll just see a pause and loading screen while you're zipped back to the course.    These folks are downright scary looking. The sound effects in Test Drive Unlimited are almost saved by ample options for adjusting them. When you first turn the game on, you'll find that the levels for the car sounds are way too loud. You'll also hear an annoying voice from the GPS that constantly will tell you which direction you should be going in. Thankfully, you can turn the voice off, and you will once you realize that it is often faster to go the wrong way down a one way road despite the fact that the voice will be telling you to turn around every few seconds. You can also turn down the noise that the cars make which have a tendency to drown out the music and sound a lot like a lawnmower. The music in Test Drive Unlimited has a great variety of styles and works on a radio system similar to many other driving games. Unfortunately, with just over 30 songs the soundtrack doesn't have enough depth. When races can last over a half of an hour and simply cruising can last for hours, the tunes tend to repeat far too quickly.Test Drive Unlimited brings so many things to the table that weve been waiting forever to be included in a racing game. From the fact that the entire game world is essentially a lobby for multiplayer gaming to real-world open ended racing, Test Drive Unlimited gives you the option to let your imagination set the course. The game successfully brings the feel of the MMO world to the racing genre making for a unique game. The driving itself isnt the best around, especially when you get on a motorcycle. Just the way that an MMORPG can be enjoyable without an amazing combat system, Test Drive Unlimited is fun without the greatest driving experience. With a little more polish, some extra customization options, and an improved driving system, youd have a racer that could compete with the big dogs.", "date": "Sep 7, 2006"}