{"name": "ATV Offroad Fury", "name_review": "ATV Offroad Fury Review", "ref": "https://www.ign.com/articles/2006/09/07/atv-offroad-fury-review", "text": "Sony's ATV Offroad Fury has been a solid performer for the PlayStation 2 over the years -- the franchise continues with a fourth installment this fall. Mobile maker Glu's mobile edition of the game seeks to replicate the high speed and hijinx of the console original, but this quad veered off-course somewhere between the two completely disparate platforms.   Without a doubt, the best thing ATV Offroad Fury has going for it are the graphics -- this is a sweet-looking ride. The different track locations, from the mud-caked stadium floor to the lush jungle environment, were colorful and detailed. ATV Offroad Fury was tested on an LG VX8000 -- a handset known for its large screen -- and the game smartly uses almost every bit of space it provides. The ATVs and riders are substantial (this factors into one of the game's shortcomings, however) and each trick is accompanied by a solid bit of animation that really mirrors the real world maneuver. Even the audio works out well, thanks to a great title tune and fairly accurate ATV engine whines.   What's unfortunate, though, is that the game promises an Excitebike knockoff with tricks (something any gamer can get behind), but doesn't carry it off. All of the courses offer plentiful jumps, which give you ample opportunity to try out any of the eight tricks, including the holy man, stripper, and cliffhanger. Each trick requires a specific amount of hang time, so you have to goose your ATV just before flying off a jump to maximize air. If you try one of the six complicated tricks (mapped to the number pad) while taking a normal jump, you'll likely not finish the trick before hitting the ground again. Your rider tumbles off of the ATV while the other racers sped ahead. If you miss a big jump, you can still earn points by performing the two minor tricks assigned to the up and down directions on the directional pad.    All of this sounds great in theory, but the actual implementation doesn't fare so well. For one thing, the controls can get a little complicated with all of the complex tricks mapped so close to each other on the number pad (1-6). Speed and braking are handled by pressing right and left on the directional pad, so this makes ATV Offroad Fury a decidedly two-handed game. And initiating midair tricks isn't always accurate. There were times when I would press the trick button to either have nothing happen or have the trick start a few frames later, dooming the entire affair as I helplessly watched my rider slam face-first into the mud.   The size of the riders and ATVs comes into play, too, as it can be incredibly hard to maneuver when the pack bunches up -- especially around jumps. You move side to side on the track by pressing up and down, and nothing is worse than getting boxed in at the last second and fumbling with the controls. The size of the ATVs also affect landing tricks, because sometimes the other racers seem to slow down too much on the ground, forcing you to land right on top of them, which ends in a crash. The ATVs keep together for a lot of the race thanks to classic rubberband AI -- the sort you find in Mario Kart games. It serves to increase the drama, but is also irritating when you're running a perfect lap but never putting proper distance between you and the other racers. One minor screw up and they crush you.   The game features two play modes: Classic and Single Event. Classic mode charts the rise of your rider from the first time he sits down on an ATV to tackle the amateur circuit to the extreme circuit, which is tough to conquer (as you would expect). To move up in rank, you must meet specific track requirements, such as placement and trick score. Any track you win in Classic can be played in the Single Race mode later on -- and considering the number of tracks in the game, that means there's a considerable amount of content to unlock.   Winning courses dumps points into an account that you use to upgrade your ATV. You can use a stock ATV, but it's definitely better to tweak with your quad's maximum speed, acceleration, stability and tire strength. The changes you make really do affect game play, too. (Hint: It's tempting to lay on max speed and acceleration settings, but ignoring tire strength will cost you later.) You can also change the cosmetics of your ATV with a color swap tool.  ATV Offroad Fury is a major step up from previous muddy motor games, but there are a handful of issues that hold it back from a bigger score. The rubberband AI is occasionally infuriating, the size of the riders provides great detail but decreases the amount of useful space in the playing field, and sometimes the tricks don't immediately respond. That said, there is definitely some fun to be had when all of the planets align and you can run a perfect lap, hitting multipliers, landing tricks, and racking up major scores. If you absolutely love the ATV Offroad Fury series, you may get some mileage out of this, but if you want to buy a game from Glu right now, get Super KO Boxing. It's one of the best mobile games of the year.", "date": "Sep 7, 2006"}