{"name": "NHL 2007", "name_review": "NHL 07 Review", "ref": "https://www.ign.com/articles/2006/09/11/nhl-07-review-5", "text": "Pass, pass, pass, shoot.    Throughout the years, videogame hockey has boiled down to a simple gameplay formula. While graphics and sound and online play have made marked improvements, the innovations on the gameplay side have been minor, and many a hockey fan will tell you that NHL 94 remains the greatest hockey game of all time. Some will even refer to the NES classic Ice Hockey.    That's not to say hockey games have ever been bad. In fact, hockey games have traditionally been some of the best sports games on the market. It's just that year after year, it's more of the same, done a little bit better. This year, NHL 07 completely changes the way we play hockey.    The right-analog stick is your hockey stick. Move it left to bring the puck left; move it right to move the puck to your right. Press up to flick a shot. Pull down to wind up a slap shot and push up to fire it on net. Move right or left, then roll up to fire off a wrister. Passing is mapped to the right trigger. Face buttons are rarely used, unless to start a fight. It's that simple.   Hey, you! Welcome to a new way to play hockey. Sure, the right stick has been used before for canned animations of dekes. Now, almost all of the gameplay revolve around the stick, considering it's used as a hit stick on the defensive side of the puck. So how does it improve the old style of hockey gameplay? For one, it takes a bit more skill to put the puck in the net, and that's a good thing. Second, hockey games have been too reliant on the one-timer as the main method of scoring in recent years. But hockey fans know that one-timers are difficult to perform with regularity and remain one of hockey's most exciting plays. Scoring so much with the one-timer is like replacing lay-ups in basketball games with 360 dunks. Not only is it unrealistic, but you become inoculated to the excitement of the great play itself.    With the new skill stick, NHL 07 makes hockey gameplay more exciting and more realistic. You're Joe Thornton on a breakaway. The only thing that should come between you and a goal is an amazing save by the goalie. In years past, you may slow the break to wait for a teammate, make a late pass and hope for a one-time goal. Well that's not how Thornton rolls. In NHL 07, Thornton accelerates to the goal. The goalie comes out of the net, trying to cut down on Thornton's angle. Joe dekes left, then right, forcing the goalie out of position. With on last move back to the left, Thornton flips the puck top shelf past the diving goalie. That's NHL 07.    It's not a canned animation. It's you that beats the goalie. If you have an open lane toward the goal, you take the shot. Thanks to a revamped puck physics system, the puck is completely separate from the players. No longer will goalies magnetically suck the puck into a save animations. Goalies react. Sometimes the puck will hit the shoulder pad and fall harmlessly to the ice at his skates. Other times it will roll behind his back and trickle in the goal. Sometimes the puck will deflect off a teammate or an opponent and in. The developers were hoping for the same kind of organic gameplay that Konami accomplished with its Winning Eleven soccer franchise. In that, EA succeeded.    So this year the slot is prime real estate. Any player fortunate enough to find himself in the slot with the puck will light up like a kid on Christmas, knowing that a well-placed wrist shot will give his team a goal. At first, you'll find it difficult to score. You'll fumble with the stick and you'll probably flick the puck harmlessly at goal. You may even reach for a face button out of habit. NHL 07 has a healthy learning curve of at least 10 games. Heck, we've been playing hockey on buttons for so long that the skill stick feels completely backward. But soon you'll receive a pass in the slot, roll the stick right, then slightly back and then up to fire off a wrist shot with ease. There is an option to switch to old-school controls, but after you learn the stick, you won't go back.   The skill stick does what we want all sports games to do. It gives us control. You don't exploit a CPU bug. It's more than just pushing a button on a gamepad. You fake out the goalie. You wind up the shot. You score the goal.      On the defensive side of the puck, the checking system from NHL 06 on current-gen consoles has been ported over to the 360. This time it's mapped on the right analog stick, and by aiming toward an opponent you'll magnetically skate toward him and let loose one of a number of checking animations. Sometimes you stop the skater in his tracks. Other times you will knock him out of his skates, although you have to line that hit up perfectly. While this system works fine, I would have preferred a true next-gen over-haul. EA said the focus was squarely on the skill stick this year and that defense and goalkeeping will be addressed in later versions of the game.    With the new controls and puck physics, NHL 07 is a  ~sloppier~ game of hockey than we are used to. Players will miss a lot of long passes, resulting in icing calls at the other end. After a while, I actually enjoy the long pass and switching players, like switching to a receiver in a football game to manually make a big catch. Fans of last year's game and the 2K series will have to get used to the new system.    The offside AI is a bit strict. If you don't headman the puck and decide to cross the blue line yourself, you may draw an offside call. Players are taught to keep skating to the blue line and it's your job to get the puck to them or dump it into the offensive zone. Also, if you make horizontal moves around the blue line, you  may fake out your teammates and they'll rush offside. In this, NHL 07 is more realistic, yet slightly less user-friendly.   NHL 07 is a treat to look at. Visually, NHL 07 is a treat. The cutscenes and replays are gorgeous, and in close the player models look excellent. The goalie animations are excellent in particular, and you'll curse opposing goalies and praise your own after a spectacular save. The player animations are a bit chunky at times, suffering from the same skipped-frames issue that we see with the tackling animation in Madden NFL 07.    Gary Thorne and Bill Clement return to the videogame booth, their last project being ESPN NHL 2K5. The duo is still the best in the business, despite some repetitive commentary. Still, Thorne's play-by-play lends some authority to the presentation and harkens back to the old days when the NHL was broadcast on ESPN and not OLN. The sound effects are excellent. Coaches bark commands to their teams; players call out assignments and ask for the puck; the crowd rains down cheers and boos; the puck clanks oh-so-right off the post. The EA Sport Trax feature the now-standard emo and pop-punk songlist.   Off the ice, NHL 07 features only Dynasty, World Tournament and a shootout mode. The shootout is a nice tutorial on using the skill stick. When you first boot up the game, you actually jump right into the shootout to learn the game's new controls. You can also download the same shootout on Xbox Live Marketplace as the NHL 07 demo. The World Tournament is an 8 or 16 team tourney with the top international teams in the world. A notable omission that should have made the game is create-a-team feature and the free-for-all mini-games.   Dynasty mode is so deep you modify your own Canadian accent. Dynasty mode is fairly deep. A producer at EA went through the entire Collective Bargaining Agreement set out to create an accurate representation of the NHL post-strike. There are a variety of GM options, such as ticket pricing and the minors. Coaches are in charge of team development, focusing on strength, hand-eye coordination, skating and shooting. You can create a player and guide him through your franchise.   The online options are fairly thin, including the standard EA ranked and unranked match. As sports gamers, we all want to start online leagues with our friends, choosing either our favorite team or creating one of our own in a fantasy draft. We want to play online seasons, complete with stat tracking. EA showed remarkable innovation with the right stick in all of its sports titles. Now, quite simply, the company needs to improve online play.NHL 07 is a great hockey game, pure and simple. When you receive a pass in the slot, you feel the same rush of adrenaline that a star center feels. As you wind up a wrister, you know the only thing that can stop you is a great save from the goalie. With the dynamic puck physics, rebounds and deflections can change the course of a game. On a breakaway, you no longer wait for a teammate to try for a one-timer. You triple-deke and go top shelf. You beat the goalie. You feel it. Hockey has been waiting for this kind of innovation for a long time. Visually, the animations at times can be a bit chunky, but the replays and cutscenes are absolutely gorgeous, the best we've seen yet in a sports title on the 360. The commentary is solid, yet a bit repetitive. The sound effects like player chatter, the crowd and especially the puck hitting the post suck you right on to the rink and make for an immersive hockey experience. You'll blow through ten games at a time, look up and wonder where the time went. The Dynasty mode is deep and fun, including a player-development system in the minors and concession prices. EA's online mode is still terribly thin. At this point, sports gamers expect online leagues and online seasons. Ranked and unranked matches suffice, but they don't cut the mustard. On the ice, however, NHL 07 represents the first truly next-generation gameplay innovation.", "date": "Sep 11, 2006"}