{"name": "Mech Assault: Phantom War", "name_review": "MechAssault: Phantom War Review", "ref": "https://www.ign.com/articles/2006/09/11/mechassault-phantom-war-review", "text": "It's not all that surprising to see a Microsoft-published, Xbox-exclusive franchise appear on a Nintendo handheld platform -- companies have been bringing Microsoft-owned properties to the Game Boy market for years. What is surprising, though, is that a deep and engrossing franchise like MechAssault remains such on the Nintendo DS hardware -- MechAssault: Phantom War is a very faithful portable rendition of the action series, bringing the BattleTech line to the handheld system in an extensive single and multiplayer outing. It's definitely not smooth sailing all the way through, but if you can navigate through some of the development quirks along the way, you'll have a kick-butt time in this aggressive, robotic war.   Rather than take what's existed before and sandwich it all onto the touch screen handheld, the developers of the Nintendo DS version of MechAssault -- Backbone Entertainment -- had the luxury of extending the series into a brand new storyline. This Nintendo DS game has all the bells and whistles of a console game: full rendered cutscenes for important points in the storyline, incredibly well-acted voice over for radio communication, several different mechanized war vehicles to pilot throughout the extensive missions and campaigns, and an elaborate multiplayer experience with several different modes to offer a bit of variety over the simple deathmatch fashion.   The important thing is the gameplay, and the game is pretty darn fun with a good amount of challenge. Players can jump in and out of mechs almost as easily as carjackings in Grand Theft Auto, though there are very few missions in the game that require this technique in order to finish them. So unless you really want to make things more difficult than they should be, simply follow the mission's bare minimum requirements and you'll do fine. Some campaigns require nothing but getting to a location on the map as unscathed as possible, while others require a bit more turkey shooting where players need to protect a specific location against advancing armies of lumbering mechs and tanks. Scattered in the missions are some touch-screen ~hacking~ mini-games that are tougher than they look...especially in later missions.   The developers may have tried to give Nintendo DS owners the true Xbox experience on the lesser handheld hardware, but let's be realistic: the Nintendo DS is nowhere near an Xbox in power. So, don't be surprised at the ~dumbed down~ visuals like lower-resolution textures, barebones polygonal structures and somewhat simplistic mountainous terrain.  Still, even with the limited hardware, Backbone Entertainment pulled off the experience as well as could be expected, even adding some nice little ~icing on the cake~ elements like buildings toppling with a satisfying ~kaboom!~ when they take enough damage, or just enough little humans scattering around to get underfoot of the giant mech you're piloting.   The game, by default, offers mech control via D-pad/Button combination that emulates the tank-like dual joystick configuration. Because this is exclusively digital and an overly rigid way of maneuvering, you'll quickly find yourself moving to the stylus mode, where the touch screen offers the Super Mario 64 DS analog stick emulation for targeting. There's a mode for lefties and righties, and also an up/down invert toggle option. It takes a bit to get used to since players have to work within the confines of not only the on-screen circle that pops up on the touch screen, but also in the limited space that players can use this analog circle. After playing games like Star Fox Command that offer tight and direct pin-point control on the Nintendo DS, it's a bit awkward to return to an analog stick that's much more limited in its movements -- the player's targetting speed is harshly restricted by the speed attached the virtual analog stick. It would have faired much better, and given the game a bit more of an energetic feel, if players had the much more fluid control of ~mouse look.~   If this control limitation was employed based on how frequently the touch screen would be used for other things, maybe we can put a little blame on poor second screen management. There are touch screen buttons employed for important control aspects like weapon selection and defense activation. But there are two buttons on this screen that don't even need to be there -- why on earth did someone dedicate so much space on the screen to pulling up hints? Stick that on the Select button, guys...it was a waste of important touch screen functionality, especially when there's only one touch screen button to switch weapons. Which is a real drag when you've got four different style of weapons on-hand and need to constantly cycle through what you've got to pull up the most appropriate tool for the job. The touch screen also gets a little sticky in places -- specifically, swapping between views while driving in a tank will cause a lag bug that requires players to ~reset~ their stylus back on the screen before it'll recognize the touch again.   As solid as the experience is, Phantom War is not without its issues, and it does feel like the development team didn't bring their ~A~ game to the table for MechAssault: Phantom War. The prerendered movies are certainly a nice touch, but they look more like low-budget fan movies done in a freeware rendering program, or worse: an old version of Hash. The in-game 3D environments are ~acceptable~ but far from ~impressive,~ and somewhat on the clunky side when joining current generation DS games on the shelves -- everything's fine when the bare minimum's on the screen, but clutter up the view with explosions and multiple mechs and you'll get slowdown and tearing.   Easily one of the biggest letdowns of MechAssault: Phantom War is its lack of support for the Nintendo Wi-Fi Connection service, because this game would certainly kick a lot more ass if you weren't restricted to local area matches for the multiplayer. After all, the original game was one of the early titles in the Xbox line-up to support online gameplay.  It's hard to really fault the DS game for this omission, since it really isn't one -- very few games from third party companies have added the support less than a year in. Still, as we get deeper in the lifecycle of the Nintendo DS it's a feature that will be expected more and more -- MechAssault: Phantom War gets off on a technicality. And it also gets off because the development team definitely poured some effort into getting the local wireless working, and working well. The select interface uses the same clunky touchscreen menu system of the single player experience, but you'll find lots of options in there to navigate to -- deathmatch, team battle, king of the hill. And the more you do in the Solo Campaign means the more that gets unlocked for multiplayer. It's a nice incentive.As long as you're willing to bring expectations down some for this Xbox-to-Nintendo DS conversion, you're going to have a blast with MechAssault: Phantom War. Still, the quirks are hard to ignore, like its somewhat glitchy visuals, sloppy menu systems, and analog control that could have been so much better had the touch screen been utilized a bit more tightly. Even if the game had a good development schedule, MechAssault does feel just a little rushed in places. But ultimately, the end product is a cool and kickass battle, both in single and multiplayer.", "date": "Sep 11, 2006"}