{"name": "Bounty Hounds", "name_review": "Bounty Hounds Review", "ref": "https://www.ign.com/articles/2006/09/12/bounty-hounds-review", "text": "Games can frustrate for a number of reasons. Some of them get under your skin because of genuine challenge. That's the best possible scenario. Others irritate because of glaring design flaws or, along the same lines, sloppy code. Still others frustrate because they nail certain elements while almost completely failing in others. Bounty Hounds finds itself in this latter category. It excels in the areas of artistic design and technical prowess, but fails as a solid action tile due to a few gameplay issues.   In all honesty, most games suffer from lopsided quality to an extent, but it's especially bad in this case. Bounty Hounds looks and performs better than most any game on PSP. It crams multiple characters on screen almost every second of every mission, to start. Not only that, each of these enemy units looks and animates well; far better than in most third-person action titles. To top it off, the development team obviously took care to make enemy units appear unique. Everything from their armor and weapons to the way they move is undeniably impressive.    The same goes for the narrative art during many of the cutscenes in Bounty Hounds. Its characters wouldn't seem out of place in a sci-fi graphic novel, and you see everything through a filtered, documentary-style lens. The story itself is told well enough. Characters spew dialogue bubbles, like the ones seen in your average role-playing game. As for the actual plot, it does the job without getting too deep. Many of the game's subplots and twists come from older sci-fi material. Still, it's better than in most action games, and as mentioned above, it certainly has a lot of style.   But for those who don't know, here's a little recap: The story takes place far in the future. The Human race finds itself in an intergalactic relay against a variety of alien species to colonize as many planets in the galaxy as possible. Deciding they need a helping hand, the Human race hires a mercenary group known as the Bounty Hounds to eradicate alien life on planets the Humans want to colonize. They're interplanetary conquistadors, in other words, and they're tasked with slaughtering indigenous beings all over the cosmos. Now before you start thinking this sounds ethically shady, or in case you already do, just know these aliens suck anyway. They're vicious, power hungry, and deserve to die.    You start the game onboard a massive spaceship. You, as the protagonist Maximillian, live aboard the vessel along with dozens of other bounty hounds. The ship receives missions through a military contract and rockets through the cosmos delivering the bounty hounds to their objectives. Before heading down to the planet, there's lots of stuff to do and see aboard the ship. Here's where Bounty Hounds does several things absolutely right. To start, you can simply walk around the massive interior of the ship and talk to whomever you want. Fellow Bounty Hounds offer informative tidbits on the story and the ship's many functions, too.        You can then enter a pair of vendors and go shopping. You can also assign skill sets and define character progress through experience points. First, you can enter the weapons retailer. You can purchase (or find) some 500 weapons in the game, so you'll spend plenty of time here. In addition to buying weapons, which come in melee and long-rage varieties, the weapons shop also lets you modify existing hardware.  This goes for all weapons and armor. You can equip multiple weapons per arm, as well as individual pieces of armor for your head, arms, waist and legs. Taking things even deeper, you can upgrade every piece of hardware with modules you find on the field. These modules raise your defenses to the elements or lower the defenses of your foes. There's so much to find and tinker with that it's frankly a little overwhelming at first. But it's better to be overwhelmed with content than be shocked by the lack of things to do.    At the Medical Center, you can take earned experience points and assign them to specific skill sets. They split into three categories including Field, Passive and Enhancing. The field option, arguably the game's main unique feature, lets you emit a shield over your character or project one in front of you. Depending on what skills you master, this shield can increase your defenses, lower the defenses of your enemies, increase your own attack power and so on. Under the passive and enhancing skill sets, you can do everything from unlock special attacks to improve your map. The interface for all of this, including skill improvement and weapon shopping, is easy to read and navigate. As much information as Bounty Hounds presents, it's all nicely laid out.    After buying your gear and receiving your mission, you head down to various planets (four in all) and do what you do best: kill aliens by the hundreds. Here's where Bounty Hounds falls apart. For all its high points, it suffers from a handle of very poor design choices. The first, and biggest, deals with the camera. In a game as complex as this, where you fight multiple enemies constantly, you need full control of the camera. Or at least have the game do an excellent job of handling it for you. Bounty Hounds gives you neither option. It only lets you center the camera behind your character by tapping the left shoulder button. This simply doesn't work. In fact, it's a downright terrible idea.    As you run through the game's various battlefields, you constantly tap the left shoulder button trying to get the best view of the action. It rarely works. On the contrary, unseen foes shoot you constantly as you spin around wildly trying to locate them. The radar helps to a degree, as it actually paints enemy locations with colored dots. But even if you turn toward an enemy's general direction and the camera fails to achieve a lock, you'll aim square at something and still miss entirely. If this happened occasionally that'd be fine, but it happens a lot. And since you face clusters of aliens all the time, you sustain a ton of unnecessary damage solely because the game fails to offer you the means to deal with scores of adversaries.       Even something as simple as navigating the myriad caves and barren wastelands of the four alien worlds feels like a major chore. It looks and performs beautifully, but getting your bearings, if nothing else, should be like second nature. And again, that's just not the case in Bounty Hounds. Even after you plow through hordes of bloodthirsty aliens and work your way through the landscape, you still have to deal with the boss fights.   These annoy far more than ordinary enemies do since they move around so much. That may sound stupid and obvious, but when a game doesn't let you track semi-stationary targets, actually tracking something mobile is a royal pain in the ass. Plus, they deal a serious damage, so it doesn't take many bad camera adjustments (which you do often) to send you to your grave.    In addition, combat itself tends to get a little repetitive. It's fun for a while, but most enemies simply move toward you slowly and wait for you to kill them. Bosses put up a good fight, of course, but most other enemies simply get in your way instead of pose a serious threat to your health. At this point Bounty Hounds may sound like a total loss, but that's not the case. The wireless option helps keep things fresh for a while, even if some of the problems from the main game plague multiplayer as well. It's a very basic deathmatch setup, where one other player (with a copy of the UMD) fights another one-on-one on in variety of locales. It's fun yet ultimately a little shallow.   Bounty Hounds is a classic example of shoddy execution derailing a slew of great ideas. With a better camera and improved controls, it could have been a real contender. Still, as frustrating as the game can get, its enjoyable in short bursts and presents a wealth of good ideas. Beyond that, the game looks great and runs extremely well for the amount of action that transpires at any given time. Multiplayer adds a bit of appeal, but it could benefit from a few more modes in addition to the included one-on-one deathmatch.", "date": "Sep 12, 2006"}