{"name": "LEGO Star Wars 2", "name_review": "LEGO Star Wars II: The Original Trilogy Review", "ref": "https://www.ign.com/articles/2006/09/12/lego-star-wars-ii-the-original-trilogy-review", "text": "One of last year's more pleasant surprises was undoubtedly LEGO Star Wars, the TT Games-developed ode to George Lucas' incredibly popular sci-fi universe. With its unique art style, ~pick up and play~ mechanics, and the best use of a popular license that we'd seen in a long, long time, it literally came out of nowhere to win critics and consumers over with its charming mix of action and humor. With a resume like that and three movies that could still be ~LEGOfied~ remaining, a sequel was inevitable.   Eighteen months later we have it (and for the first time, on PSP). Like The Empire Strikes Back which inspired it, LEGO Star Wars II: The Original Trilogy improves on its predecessor in just about every way. Its stage design, source material, musical score, visual presentation, and jokes are all of a higher quality than they were before. There are even a number of additions that are new for the series altogether and extra mini-games thrown in just for the heck of it. In other words, The Original Trilogy is almost the perfect sequel.    Explaining how LEGO Star Wars works is actually quite simple. The main gameplay mechanics are essentially the same one-dimensional bits that make up most actioners out there (with an attack, jump, and special button available). Using basic strikes and defensive skills, players will regularly chop or blast their way through an unending army of Stormtroopers, Sand People, and Bounty Hunters while fighting the occasional boss or mid-boss every couple of levels. But that's where it's similarities to other titles ends.   What makes LEGO Star Wars truly unique is that players will be in control of at least two characters at a time, and sometimes as many as six. With a quick tap of the button, gamers can hop back and forth between anybody in their party -- be they Jedi, Rebel, Droid, or whatever -- and each of these archetypes play entirely different. So while Luke Skywalker and Obi-Wan Kenobi may be ideal for taking out large groups thanks to their jumping lightsaber attacks, only droids can access certain areas that allow you entry to the next section. Moreover, the standard blaster characters can mean the difference between life and death when fighting enemies from a distance and Traveller's Tales has done an excellent job of balancing things so that you'll have to rely on all these styles to succeed.    This combination of straightforward mechanics and a clever use of strategy is what makes LEGO Star Wars so fun to play. But character selection for battles and the occasional door access isn't all there is to it. Part of the game's brilliance is how it mixes puzzles with combat and how it makes use of the LEGO license by allowing players to build or destroy structures. Fans of the first game are no doubt familiar with this system, but LEGO Star Wars II has added a few new goodies to make the puzzles that much more elaborate and the pace that much faster. The fact that any non-droid character can now build items instead of just a Jedi, for example, encourages the use of non-force personalities more than before. Multi-screen puzzles with a couple of multi-solution outcomes are also welcome additions, while the inclusion of about a billion secrets is a good thing too.   If multiplayer is your thing, then LEGO Star Wars has that also. Just like last year's title, The Original Trilogy allows for immediate ~Drop in/ Drop Out~ two-player co-op at any time (via Ad Hoc) with a few small tweaks thrown in for good measure. Take the camera, for instance. Now it draws back much further than it use to before requiring characters to move closer to one another. There's an all-new (and extensive) character creation feature built-in as well, and it allows users of vastly different play styles and preferences to hook up however they want. Sadly, infrastructure co-op isn't supported in LSW2, and even if you're playing via Wi-Fi, if one person moves to the next screen by himself, player two is auto-transported to that location no matter what he might be in the middle of doing.    Another one of LEGO Star Wars II's new features is the removal of the ~on-rails~ vehicle sequences from the first game. Now, the vehicle segments are free-roaming within enclosed but sizeable environments and include everything from both Death Star assaults and the speeder bike sequence on Endor to the Millennium Falcon's Asteroid Chase and the classic Hoth battle. All controllable vehicles even have a variety of new attacks such as evasion tactics, positional flips, torpedo shots, and tow-cables that can latch onto rolling bombs. Oh, and yes -- these levels support two-player co-op as well.   Despite its fun, easy accessibility, and wealth of gameplay variety (18 chapters across three episodes plus bonus stages), LEGO Star Wars does run into a few snags that also plagued the original. The most obvious bit is its difficulty. Although it purports an ~adaptive AI~ in the manual, the challenge never really rises above beginner-level in any section. The real test for you here is locating all the hidden content that each stage possesses, not conquering them. Also, because of its simplistic approach, the game can get repetitive if you're not captured by its presentation and humor.    Another weird issue with LEGO Star Wars is that, despite its low onscreen activity and lack of detail, it still suffers from occasional stutter and other visual issues issues. Of all versions, the PSP edition suffers from more slow down than any of them and also leaves out the wandering NPCs in the cantina to keep from over-chugging. The good news is, that the visuals are still very good and other than the slowdown and NPC issues, the PSP is almost identical in every way.   That isn't to say that the PSP edition doesn't have a few exclusives of its own (as PSP ports always tend to). Though the Bounty Hunter side-missions found in the console editions are missing, they have at least been replaced with the option to replay boss battles from the original LEGO Star Wars (Darth Maul, Count Dooku, and Darth Vader). Granted, some of the levels have been graphically dumbed down since their appearance on set-top boxes last year, but it's still a pretty cool option to be able to go back and replay those areas. PSP owners can also revisit Original Trilogy stages in ~Challenge Mode~ -- which is a timed test to see if they can collect 10 mini-kits before time runs out. If they do so, they'll get to unlock playable characters from the original LEGO Star Wars.   Sadly, these extras do come with a bit of a price besides the visual snag as you won't be able to auto-save your progress (it's only manual). We suppose this is offset a bit by the PSP's ability to hold your progress between games, but still -- going back to save is a bit of a chore. Don't let any our concerns deter you, though -- none of theme are that detrimental to the fun of the game. After all, LEGO Star Wars II is still a pretty-looking piece of software -- if not for its art style over its technical prowess. In fact, don't let its childish appearance fool you. This is some of the best presentational stuff you'll see all year. Its humor (some of which involve actual ~laugh out loud~ moments) and dead-on recreations of familiar Star Wars situations put it head and shoulders above most other products out there, and the environments and characters are all immediately recognizable.LEGO Star Wars II is a great entry-level title for young Star Wars fans looking to expand their portable videogame horizons. Its violence is never scary, its humor is always funny, and its gameplay is always fun. Sure it's easy and simple -- and it does get hit by the repetition bug now and again -- but the bottom line is that it's a heck of a lot of fun and has a great amount of lasting appeal beyond a single play-through. Best family game this year? Probably so.", "date": "Sep 12, 2006"}