{"name": "Coffee Tycoon", "name_review": "Coffee Tycoon", "ref": "https://www.ign.com/articles/2006/09/15/coffee-tycoon", "text": "Continuing this industry's long standing tradition of picking random nouns and putting the word ~tycoon~ after them, Jamopolis Interactive has jumped on the bandwagon with Coffee Tycoon, a game whose gameplay is every bit as inventive as its title. Starting in one of five different coffee shops in five different cities (each of which offers unique opportunities and problems), players will have to manage employees, add items to the menu and buy certain business upgrades on their way to becoming the coffee czar.  There are three types of employees in Coffee Tycoon: Baristas to sell coffee, Managers to bring in customers, and Executives to buy up more stores. Each day you can adjust the proportion of your employees working in each of those three areas. When you're ready to open, you'll watch the game play through a single day and watch your profits rise and fall according to your decisions. The game requires you to achieve 1,000,000 customers in order to achieve victory.   While the concept of having more baristas to sell coffee and more managers to bring in the customers seems intuitive enough, the purpose of sending executives out to acquire more stores is a little iffy. The number of stores you can have is limited by the number of customers you have but the stores don't seem to impact your ability to sell coffee. Rather they simply serve as a limit on the amount of money you can have at one time. Apparently, the people who run these coffee shops are simply too busy to take their money to a bank.  There are a number of new menu items and business upgrades you can buy throughout the game. At the very beginning of the game, you'll barely have enough to start serving decaf or offering employee discounts. By the time your empire has reached its peak, you'll be serving caramel cappuccinos and buying ads during the Super Bowl. Each of these upgrades theoretically offers a bonus to your cash, customer and store acquisition but, in practice, they don't seem to have any effect.   Imagine how angry you'll be when you've scrimped and saved up enough money to buy the Ultimate Coffee Grinder only to discover that it doesn't provide the $100 income a day that the game says it provides. Even with the Barristas maxed out, you'll still be lucky to even get close to $100 a day.  And all your hard work can be undone in an instant by the multiple random events that occur through the day. Rather than adhering to any particular pattern, it seems that the events that affect your bottom line are completely arbitrary. Some days you'll be told that you need to obtain more stores and then a random event will pop up that removes a handful of your stores under the justification that you've expanded too quickly. There are plenty of cases just like this; some days you'll get a random message closing stores due to over-expansion and then seconds later get a random message saying you've bought up some available stores in an adjacent neighborhood.      Any attraction you may have initially had to the abstract management required in Coffee Tycoon will be ruined by the stupid random events that render your strategies moot. Balancing your employees so that you're gaining cash, customers and stores might be fun if a single day's worth of random events put you weeks ahead of or behind where you would be on your own.  What's really obnoxious is that some of these random events point to some actual strategies employed by your rivals. You'll hear about them offering coupons, hiring musical acts, maintaining cleanliness, and so forth. What the hell game are they playing? That actually sounds like it might be fun, at least compared to the roulette wheel action you're offered.   Jamopolis seems to have their act together at least when it comes to the graphics and interface. While it certainly can't make up for the lack of actual gameplay, it's nice that the game has a pleasant appearance. The four different menus are very clean and easy to read and the whole game has a colorful, cartoonish aspect to it that's very easy on the eyes.  Coffee Tycoon benefits from a subtle and entirely listenable jazz soundtrack but the interface sounds are a little too metallic and aggressive.Rather than wasting time here summarizing my criticisms, I think I'd rather do something useful and offer up a list of other things you can spend your twenty dollars on:A copy of Dragons: Lexicon TriumvirateTwenty McDonald's double-cheeseburgersA year's subscription to O: The Oprah MagazineA UHF digital indoor antennaTwo reams of extra-bright, 24lb printer paperThree sets of nylon ukulele strings300-count full-size cotton sheetsA digital pedometer17-lb bag of premium cat litter", "date": "Sep 15, 2006"}