{"name": "Rapala Trophies", "name_review": "Rapala Trophies Review", "ref": "https://www.ign.com/articles/2006/09/16/rapala-trophies-review", "text": "I had the pleasure of reviewing Rapala Pro Fishing on the PS2 in 2004 and while that game got the basics right, it lacked accessibility and polish. The PSP title exhibits both of these qualities more than other fishing games released in recent memory. While it still has faults, Rapala is a better experience on the PSP than on any of the consoles.    At the heart of Rapala Trophies is a good control scheme that makes casting and reeling easy to learn but difficult to master. And if you can't figure it out from the instruction manual a helpful narrated tutorial can be accessed through the main menu. After traveling to a choice location in their boat, players view themselves in the third person and use the analog stick to control their rod, the left trigger as the reel, and the right trigger to release the line. With the help of a color coded meter at the bottom of the screen players have complete control over how and where they'll cast.     Once cast, the camera switches to an underwater close up on the lure with a small profile view of the fisherman. This gives players a close view of possible bites while still letting them see their character's motions on the boat. There's the option to switch the camera to an over the shoulder view from above water but it's not nearly as exciting.    You use the analog stick to jib the lure back and forth until a potential trophy winner swims close enough. Hooking is accomplished by simply pulling back on the rod and then gamers must pay close attention to their line tension as they reel the fish closer to the boat. Your fishing partner lends a helping hand by yelling out tips like ~pull right~ or ~let out some line!~ He gives good advice, and the commentary doesn't feel forced or annoying. Following the direction of the fish and watching line tension is just challenging enough to be rewarding when done correctly.     Once the fish is close enough to the boat the screen switches to a quick mini-game that has players line up a net icon with a fish and hit a random series of face buttons. If you don't land the fish it's as good as gone. The mini game is a good addition to the fishing gameplay adding a change of pace and a needed jolt of excitement to a genre that can involve a lot of sitting around. After making the catch Rapala includes a Live Well that allows gamers to view each fish they've caught during a challenge and check to see if they've satisfied the level's requirements.   Trophies is a fully featured fishing experience. There's a time trial, arcade mode, tournament, and plenty of exotic locations. Of course all of the gear is licensed and there's plenty of it. As an unlockable bonus players can view excellently produced videos documenting the company's rich history. It's not a huge feature, but its one of the many small things that the game includes that makes it feel like fully realized fishing title. Unfortunately, like previous Rapala games the selectable characters are an odd mix of pre-created fisherman. I have no desire to play as some random guy, I either want to create my own likeness or take on the role of a known fishing personality.    For a fishing title Rapala offers some decent visuals on the PSP. Its realistic approach to the environment includes dense foliage and water that can be appropriately murky and filled with flotsam and animal life. Water kicked up by the boat sticks to the screen for a short time and each fish is distinctive enough to be recognized on the first or second viewing. The only real graphical glitch occurs when a fish approaches the lure from the direction of the camera. Players then sometimes get a view from insider the animal which can be both confusing and unsettling, it happens enough to be mentionable.   The sound in Rapala is mostly just delicate background noise. It kicks in a bit when fighting a big catch but mostly its just generic understated sounds and tunes. As I stated above, the voice of your fishing partner is helpful and adds to the gameplay.     Like many titles on the handheld Rapala has some hefty load times. They range from about 45 seconds when entering a level to about 30 seconds when quitting out to the menu screen. Lucky for us the developers included a multiple choice trivia game so players can test their knowledge on Rapala fishing products while waiting for the environments to load. I would've preferred a general fishing quiz rather than more brand advertisement but inclusion is certainly better than a static loading screen.    The layout of the game also means that load times aren't such a big issue. Players typically spend a decent amount of time fishing in a single environment. The time trials for example range from twelve to twenty five minutes so you can load up a River in the Amazon and then switch on your PSP periodically to meet all of the catch requirements. Rapala Trophies is very well suited for the PSP. Aside from the loading times every other aspect of the game is solid and a real improvement from the last Rapala game that appeared on PS2. If you enjoy fishing or are looking for a relaxing diversion on your PSP you should give this game a try.", "date": "Sep 16, 2006"}