{"name": "Just Cause", "name_review": "Just Cause Review", "ref": "https://www.ign.com/articles/2006/09/18/just-cause-review-2", "text": "Just Cause has all of the makings of a great sandbox game. It has a giant, open world with a multitude of environments to explore. There are a huge number of side quests to keep you occupied along with a slew of vehicles and weapons to aid you in your quest to see everything and blow it up. The trouble is that the deeper you delve into the game, the more shallow everything gets and the more prevalent the bugs and faults in the game become. There is fun to be had with Just Cause, but it doesn't last long enough to warrant more than a rental.   Aside from graphics, there aren't a ton of differences between the 360 version and the current generation builds. The storyline is the same, straight down to the cutscenes. We did notice that a few of the indoor environments were a tad smaller which made the missions a bit different, but the game experience is largely similar. The PS2 controller also works the best, especially for quickly tossing grenades and then shooting them out of the air.   Just Cause puts players in the role of Rico Rodriguez, a debonaire CIA agent with a flair for capturing the hearts of women everywhere and the skills needed for regime change. Rico doesn't exactly work as a behind-the-scenes operator. You won't be brokering deals or throwing silent support to pro-US dissenters. Nope. The powers that be prefer to send Rico in to destroy weapons caches, publicly assassinate people, and generally cause as much chaos as possible.    Now we're not sure exactly how long it actually takes to topple a dangerous government in real life. If the government of the fictitious San Esperito can be taken as an example, then the entire process takes 21 missions and can be completed in about six hours. That is, of course, if those doing the regime change ignore all of the side quests.   360 image shown: Enlisting local help is easy when you're as suave as Rico. Most people that enjoy sandbox style games probably wouldn't set out to ignore the side quests. That's half the point of playing a game like Just Cause. You're given a huge jungle world with a loose set of goals for you to pursue at your leisure. The problem with Just Cause, though, is that there really isn't any incentive to explore the world and try out the various side quests that are available. The main reason for this is that the side quests presented just aren't engaging, especially compared to the story missions. Exploring the world can be fun and there is a lot to see and cool ways to see it. But if you're not actively working on quests, then all you've got is sightseeing and vehicle hopping.      There are a number of different side quests, some of which are entertaining for a short amount of time while others seem like they were only placed in the game because other sandbox style games have something like them. The prime example of this is the racing missions. What racing has to do with regime change is beyond us, but it's in all of the other games like Just Cause so it may as well be here. Too bad you're not actually racing in these side quests. All you do is drive from one checkpoint to the next under a very forgiving time limit. No competition rides alongside you. The only difficult part of these racing missions is finding the next checkpoint which isn't always obvious.    There are other types of missions to occupy your time aside from the pseudo-racing. Two of these, the liberation and rival drug cartel attacks, are technically different, although they have the exact same layout. Each time you enter one of these, you'll have to kill some people and destroy three road blocks. At the end, you'll either raise a flag or kill the local drug boss. It's fun the first few times, but you probably won't want to do this thirty or forty times like the game expects you to. The reward for these missions is some added trust (more on trust later - trust us) from either your drug cartel buddies or the freedom fighters, along with a new place to get the next type of quest which are simply called side quests.    360 image shown: Blowing up the blockades can become tedious. The side quests can also be repeated to your hearts content. These missions involve going to a designated area and either: killing or destroying something, picking up a package, or killing someone and picking up a package that they dropped. Next you'll have to deliver the package or simply return to where you started. These missions are as generic as they come and its apparent that very little thought was put into making one feel different from another. Like the liberation missions, these are only fun the first few times you do them. After that, you'll probably  start asking yourself why you're doing the same exact thing over and over again.   The final type of side quest is the collection missions. While you travel around San Esperito, you'll notice blue dots on your mini-map. These indicate that a certain item is there waiting for you to pick up. Collecting one will prompt you to find the rest in the area. Some of these missions can be completed quickly though others leave the items scattered far too wide and the process becomes tedious.      Aside from stunting your way around the island, that's all there is to do to keep you occupied once you're done with the story quests. Your reward for completing the side quests is a little more trust amongst your drug cartel buddies or the rebel faction vying for power. Gain enough trust points and you'll move up in their ranks and gain access to new safe houses. At these safe houses, you'll get a new place to save your progress and find a new weapon and/or vehicle to use. The vehicles and weapons are more exotic than those you'll find scattered about in the game, which is the real reason to complete the side quests as saving our progress wasn't ever an issue. You won't need these new vehicles or weapons to complete any other missions - what you get through the story quests is more than adequate. The only real draw is that you'll get a new vehicle to tool around the islands on.    360 image shown: The monster truck is monster in appearance only. We just wish a little more effort was put into these bonus vehicles to make them fun. Most of them don't handle or react to collisions well enough to make the vehicles more than a passing distraction. A perfect example of this is the monster truck available at one of the safe houses. It seems like a great idea, but the oversized wheels clip straight through things. Drive it over a person and you'll see them come out unscathed on the other side. Drive it over a vehicle and you'll get almost the same reaction, though the wheels on the truck do move up as if the shocks were absorbing the collision. Come on. We want a monster truck so we can cause mayhem by smashing cars and taking jumps off of them. Driving over a car and watching it come out without a dent just isn't fun.   While the side quests aren't very appealing, the missions involved with the story are.  You can go back to do any of the side quests after you beat the game if you still want more. The 21 story quests have the variety and depth that the side quests don't. Even better, they're bookended by cutscenes that help to give you an idea of what exactly you're doing. Still, you may end up without a clear idea of what you're doing or why, but you can bet that when you get it all down you'll be rewarded by some huge explosions, tense fights, and stunt filled getaways.    360 image shown: Just Cause is fun once you get some air. Ah, the stunts. They're the main draw of Just Cause and were developed to allow you to quickly get from one vehicle to the next, easily and in style. Early on in the game, you'll be given a grappling hook that can latch on to any vehicle. Once you're attached, you can start parasailing and reel yourself in to take control of whatever you've hooked. Once you're in a vehicle, you can go into ~stunt mode~ where you'll hop out onto the roof or tail (yes, you can jump out onto the tops of planes and helicopters) in preparation for a jump. You can quickly launch yourself into the air and begin parachuting or hop onto another ride. Your parachute can be deployed and tucked away as many times as you want, even during the same jump, and won't ever get snagged - it was all designed around removing frustration and keeping stunts smooth. The aerial stunts in Just Cause are great fun, but it isn't quite easy enough to get up into a helicopter or plane without already being in the air. Even so, the grappling hook is the best part about Just Cause. So good that we wish it's role had been extended further. Why is the grappling hook limited to use on vehicles? Latching onto rooftops or cliffs and zipping up to their tops would make the escapes in Just Cause even more fun.    Another thing we liked in Just Cause is the system for calling in backup. Anytime you aren't in a fight or in an awkward area, you can call for an extraction or vehicle drop through the CIA. Extractions will allow you to go to any safe house you've unlocked rapidly, which means you'll be able to get to health, ammo, weapons, and vehicles any time you want. Vehicle drops are unlocked as you move through the game and they give you access to four sweet agency rides for when you absolutely need something that can go fast. These two additions to the game facilitate your exploration in a big way and allow you to get out of some travel that you might otherwise find boring and time consuming.    The grappling hooks small shortcomings mentioned earlier are indicative of all of the interactions with the environment. There's a lot to explore, but not enough mayhem to be caused. There just aren't enough things to be destroyed and any time you get into a good firefight, the same cop system that seems to bug us in every open world game kicks in. A little too much destruction makes the police come out in numbers so great that you'll end up killing a few of them during your escape which will only make more come. Driving away doesn't work because cop cars will keep popping up in front of you that will try to run you off of the road. The only good way to get rid of the insane number of police is to complete a mission or get to a safe house.       And then there are the bugs. In an odd way, they actually add to the experience. While the side quests don't really capture and hold our attention, interacting with the world and waiting for the next bug to pop up is fun in a B-movie kind of way. Sure, that one time when we hopped in a tank we probably weren't supposed to find that the turret was floating several feet above the vehicle. It sure was entertaining though as we drove around and tried to see which ways we could put the oddity to use. Other bugs we experienced include having side quests that were impossible to complete from the game getting confused, being loaded into the world waste deep in the ground, clipping through vehicles as we tried to stunt jump onto them and then coming out dead, and the game failing to update when we completed a mission. Rarely were the bugs game breaking, meaning that we could continue playing through the hiccups, and more often than not they made us laugh rather than scoff.    360 image shown: It sure is pretty.  The graphics in Just Cause vary wildly depending upon which system you're playing it on. Unfortunately, the same can't be said for the PS2 version. Though the load times are still significantly better than the Xbox 360 version, the world is flat out repugnant. There's also an intense fog that prevents you from seeing very far. It really takes a lot away from the game when exploration is one of the key selling points and the PS2 look does more to deter you than invite you to look around and see what you can find.   360 image shown: Island hopping is made easy through your PDA. We'll stop with the complaints after one more; the animations. There aren't many of them which makes for some stiff movement. As an example, crashing a motorcycle should make a nice tumble, but it results in the same animation as when you stand too close to an explosion: Rico arches his back and sails through the air without moving until he hits the ground, at which point he lands square on his feet and stops dead. It can be funny looking, but a good tumble would be even more rewarding.  The sound in Just Cause fits the over-the-top design. It's lively and fun with a nice Latin feel. It kicks in when you get into certain vehicles or get into a chase and doesn't ever feel played out, a very important quality in an open world game. The voice acting is spotty with some questionable accents and the dialogue is odd in an almost endearing way. Nearly everyone in the game speaks in a broken English/Spanish hybrid. Spanish words are thrown into sentences almost randomly and the result will have you chuckling after you hear it happen enough times. Newly formed Avalanche Studios out of Sweden should be given credit for a good attempt at its first game. It seems that if they had a little more time to iron out the bugs and add some polish, then they would have produced a great title. The graphics are, for the most part, quite good looking and there is a lot of fun to be had while playing through the storyline, performing crazy aerial stunts, and trying your hand at a few of the side quests. The lack of depth really comes through once you get more than about 10 hours into the game and the monotony of doing the same side quests over and over takes its toll. After that, it comes down to how much fun you can create by yourself. The ugliness of Just Cause on the PS2 also takes a lot away from the experience. If you're going to play Just Cause, you'll want to get it on one of the other platforms.", "date": "Sep 18, 2006"}