{"name": "Bejeweled", "name_review": "Bejeweled for iPod Review", "ref": "https://www.ign.com/articles/2006/09/18/bejeweled-for-ipod-review", "text": "One of the most popular mobile, PDA, and casual PC games is now a flagship title in Apple's brand new iPod gaming category. Its inclusion in the launch line-up is certainly expected -- the game is a certified bestseller on every single platform it has touched. And it may even conquer the iPod charts, too, if gamers buy on instinct. But they'll be sorry they invested $4.99 on this port, as it may be the worst of the nine-game salvo Apple launched last Tuesday to kick off the new iPod functionality.   The game play is, at this point, predictable. Bejeweled is a simple color-matching game set in a field of gemstones -- but as you clear jewels, more fall into the screen to take their place. Clearing the cascade of sparklies is impossible, though. You're rewarded instead on combos and rapid matches to earn big points during each stage's time limit. There's a reason Bejeweled has been such a mammoth success for Pop Cap -- the game is great fun.   Unfortunately, the iPod port developer hobbles any chance of mining that fun with an unintuitive control scheme. Using the click wheel, you scroll a cursor through the gem field like reading a book, left-to-right, top-to-bottom. It's a completely unacceptable control scheme that ruins advanced players' chances of nailing huge scores. If you cause a cascade while matching up a trio on the bottom of the screen that reveals a combo potential in the upper rows, you have to scroll all the way up the screen in reverse. It's unwieldy. And it makes the game decidedly un-fun. Too bad you can't just click in the cardinal four directions, but certain universal controls for all iPod game prevent access to the ~menu~ click to go up. ~Menu~ always takes you up one level in the iPod menu, just like you were listening to music.   The game looks great on the iPod screen and the attached music is definitely passable, but I suspect that those unlucky enough to download the game may stick with their own music.  Bejeweled is a poor port of an all-time favorite puzzler with the casual gamer crowd. The controls strike deep at any chance of fun, thanks to a completely unintuitive set-up. And even when you do get the hang of it, the controls still work against players going for combos all over the gem field. Seriously, take a pass and download one of the better games, like Zuma, Vortex, or Mini Golf.", "date": "Sep 18, 2006"}