{"name": "Snowboard Kids 2", "name_review": "Snowboard Kids 2 Review", "ref": "https://www.ign.com/articles/1999/03/03/snowboard-kids-2-2", "text": "Publisher Atlus released Snowboard Kids for Nintendo 64 last year and, at the time, it was an original and fun take on the snowboarding genre. The game featured a cast of big-nosed, super-deformed cute characters and an odd selection of courses -- some of which were sunny grasslands void of snow altogether. It was a cute 'B' title aimed at younger audiences and we enjoyed it.This year comes Snowboard Kids 2, created by the game's original developer Racdym and once again published by Atlus. This time around there are more characters and boards, new tracks, bosses, an updated trick system and the like. Unfortunately, bringing all of that together is the same outdated engine, dusty graphics and equally aged simplistic control system.Features: Race on a multitude of terrain, including underwater, uphill, and even through outer space. Use more than 10 power-ups to get ahead of the pack. Race your friends in the improved multiplayer mode. New control interface allows for trick combinations. All new Speed, Shoot and Trick courses to test your snowboarding skill. New boss characters. More than 18 different boards. Rumble Pak support. Four new characters. Customize each character with 5 different costumes.GameplaySnowboards Kids 2 plays much as the original did, meaning it's very much Mario Kart on ice. Players control a cast of annoyingly cute, ~deformed~ kids and race down a variety of colorful courses, all the while performing tricks for points and collecting weapons to sabotage opponents with.Snowboard Kids 2 plays identically to last year's incarnation with a few additions. The game, like the original, moves along at a decidedly slow pace and often feels a bit clumsy when compared to other snowboarding titles. To its credit, SB Kids 2 makes up for its simplistic stunt and trick system with addictive, satisfying weapons. It's always fun laughing at enemies after a few pots have been dropped on their heads, stopping them dead in their tracks. Best of all, powerups and weapons are more plentiful than they were in last year's game.A new more user-friendly interface enables players to walk around in 3D, where they are free to journey to the board shop, character shop, race select and so on. A nice little addition in itself that doesn't amount to much.Finally, players can now race against bosses, a feature that Racdym no doubt borrowed from Diddy Kong Racing. Bosses become gradually more difficult and really do work to extend the game's life a bit.Overall though, the additions are too few and far between for Snowboard Kids 2 to be viewed as anything more than an upgrade to the original.MultiplayerSnowbo 2 has the same fun four-player mode as the original. The two-player still runs a bit slow, but there is plenty of fun to be had thanks to the different weapons and defense mechanisms.GraphicsVirtually nothing has been changed over last year's game in the visual department. The same colorful but low-resolution textures of old are back for one more go around and truth be told, they look more dated than ever. Worst are the characters in the game, which are so ~super-deformed~ that they are barely recognizable as kids. Framerates, which are average in single-player mode, suffer significantly in multiplayer games. Snowboard Kids 2 looks absolutely ancient in comparison to today's second and third generation games, but it gets the job done.SoundCute, cuddly and downright annoying at times. Repetitive, happy beats make up the majority of the game's soundtrack and silly cheers and the like are a constant. Exactly what you'd expect to fill a game of this type, but be warned: You will grow to hate the music after extended play periods.In its day, Snowboard Kids was a fun little racer that wasn't bad to look at. Unfortunately, by today's standards Snowboard Kids 2 -- virtually an upgrade to the original -- just doesn't compete. The game's slow-paced racing and simplistic tricks systems, admittedly fun at times, grow old quickly and visually even last year's 1080 Snowboarding looks 100% better.Good for younger gamers, but hard-core snowboarding fans will no doubt be turned off by the game. Worth a rental.", "date": "Mar 3, 1999"}