{"name": "Vortex", "name_review": "Vortex for iPod Review", "ref": "https://www.ign.com/articles/2006/09/18/vortex-for-ipod-review", "text": "Every iPod with a screen ships with a handful of games, including a little-played Breakout clone called Brick. It's fitting that for the launch of a full-featured game service for the 5G iPod Apple has updated the game as a launch title. Vortex is essentially Brick mixed with Arkanoid, cast in a circular well that offers players 360-degree movement -- which makes perfect sense due to the iPod's primary control input: the click wheel.   Vortex even resembles the classic aracde game Tempest when you first start it up. Players control a bat that spins around the edge of a circular well, bouncing balls into a brick-filled ~vortex.~ The brick lay-outs are different for each stage, often creating fun multi-tiered arenas where clever players can bounce a ball into the thick of things and let it ricochet around, doing most of the work. Some bricks require multiple hits to be destroyed some are invincible, and others explode.   Like Arkanoid, Vortex includes several power-up icons and weapons. Multi-ball throws additional balls into the well, destroying more bricks but turning up the heat on the player to keep all balls active. Sticky bat allows the player to ~capture~ a ball and fire it off exactly where they want it to go. Guns flank the bat, destroying bricks at command. Speed icons slow the game pace or goose it up to a frantic rate. Stretch and shrink icons affect the size of the bat. All basic stuff you've seen in Arkanoid-style games, but it's still done well here in Vortex.   The game looks great, employing varied backdrops to keep things interesting. The wells can stretch pretty deep, making the lowest tiers of bricks quite small. This can prove tricky from time to time. The game soundtrack is solid, with some good cosmic techno and satisfying brick-smashing effects, but you can opt to listen to your own music while you play.  Vortex shows that when a game is created specifically for the iPod and its click wheel, good things can happen. While ports like Pac-Man and Bejeweled fuss and fumble with retro-fitting their controls, Vortex feels pleasantly organic. It's not the deepest game you'll ever play, but it's a good casual Breakout-esque game that you'll enjoy over several dozen bite-sized sessions -- it's easily one of the top three launch titles for the new iPod game service.", "date": "Sep 18, 2006"}