{"name": "World Series of Poker 2007", "name_review": "World Series of Poker: Tournament of Champions Review", "ref": "https://www.ign.com/articles/2006/09/19/world-series-of-poker-tournament-of-champions-review-3", "text": "Activision's first foray into poker with World Series of Poker didn't sit so well with us. AI and presentation issues kept us from recommending it to gamers, what with all of the other poker games on the market. With its second release, World Series of Poker: Tournament of Champions, the company has completely reversed its standing from last time around and has released what may very well be the best poker game on the market.   The core game of poker here is unchanged and fortunately left to its purest elements. You don't earn new attributes or skills or anything of that sort that essentially messes with the game of poker. After playing a certain number of hands, you will unlock a few different ~tools~, as they're called, like a hand ranking sheet and that sort of thing. These tools aren't anything but numbers and stats that veteran poker players will likely already know, so they simply act as information sheets rather than cheating devices.    The game's interface is easy to use, and there are just enough options to customize play speed and the ability to skip AI plays to make the game flow to your liking. Menu layouts are clean, allowing you to easily see how many players are left in a tournament, what position you need to finish in to take home some cash, what the blinds are and when they're raising, and so on and so forth. Much of this is often overlooked in other poker titles, and as paramount to the experience that these bits of information are, it's nice that Activision has made them so readily available.   The computer AI is generally quite solid and will make plenty of smart and strategic plays along the way. It'll check and then re-raise, slow play to the river when it thinks you have a lower draw and generally play hands the way they should or could be played. It's not perfect, however, and can sometimes make some fairly questionable calls. Every now and then an opponent will ride out a very small pair with a huge kicker, simply hoping to pair said kicker. This isn't a very smart move, and it certainly isn't smart to call a big raise with this hand on the turn and hope for a second ace on the river. Still, aside from a few small quirks like this, the computer generally plays a pretty smart and consistent game of poker.   The main career mode is rather basic and really one of the game's bigger disappointments, not necessarily because it's bad but because it's probably its weakest element. Rather than having a whole slew of games to join or some sort of calendar of events to follow, you're presented with a small set of current tournaments going on in the game's casinos. Basically, these only act as an option of what kind of game you want to play and how much money you want to risk. Aside from your (hopefully) ever-increasing bank account, it doesn't feel like there's much forward progression here through a timeline or anything of that sort.    Player visuals and animations are pretty good for a poker game, but they never play the correct amount of chips. When betting or calling, they might pick up a stack of chips and move them in, move their entire stack in and drop some off the bottom, cut multiple small stacks to count out their bet or nonchalantly toss a few chips onto the table. The animation here is great, but the problem is that this isn't connected to what they're actually betting at all, so you'll see players play one chip for a large bet or push all their chips in when they're not going all in. Had these plays been connected to the actual bet amounts a little better, this would be the most well-animated poker game around, quite easily.World Series of Poker: Tournament of Champions easily ranks amongst the best videogame poker titles out there, and depending on what you're looking for, may indeed be the best. Its AI is generally very solid, the presentation is all-around great (even if the animations don't match the bet amount in any way), and it's set up in an easy to play manner. If you're looking for a good poker title, definitely check this one out.", "date": "Sep 19, 2006"}