{"name": "Monster House", "name_review": "Monster House Review", "ref": "https://www.ign.com/articles/2006/09/20/monster-house-review", "text": "A group of kids fighting monsters with squirt guns just screams for video game. A summer movie about a group of kids fighting monsters with squirt guns necessitates a video game. Seems like the perfect situation! Developer A2M has stepped up and brought Monster House to the GBA, creating a game that rips off Zelda more than its other summer license game The Ant Bully. This game is less atrocious, even though its name suggests otherwise.   Monster House starts off with the three main characters, DJ, Jenny, and Chowder about to enter the mysterious, people eating abode across the street. The game assumes you've played the movie, so none of the characters involved are really developed. The story leading up to entering the house is nonexistent. This isn't a huge deal, since the majority of people buying the game would do so after seeing the movie. However, if someone who hadn't seen it at all, or hadn't seen it in a while wanted to play, they'd find themselves thrown into the game seemingly in the middle of the story.   The house is blocked off at nearly every pass, and players will have to explore the entire structure to reach their final destination. Players can switch between characters to explore different sections of the house. Chowder, the fat kid, has the ability to push heavy objects, Jenny, the girl, can crawls into holes, and DJ can climb up things.    As DJ and his companions try to take down the house from the inside, they'll encounter a lot of angry furniture that don't want them inside. Chairs, TVs, bookcases, lamps, floorboards, and some weird flying bug things will all try to attack the trio of water pistol commandos. We're not sure why a ghost has dozens of TVs, but players won't have time to ponder as they constantly battle the ever respawning hordes of living. Each character has a distinct weapon, each water gun having its strengths and weaknesses. Players can decide which guns they like best for which enemies, and switch between them mid-battle. It doesn't matter most of the time as the enemies are pretty easy, simply requiring the player to hold down fire for a couple seconds. Some of the bigger enemies will require players to strafe, or time their attacks. This can get a bit difficult for younger kids in the later stages, and don't be surprised if the poor kids die a few times.   Dying in Monster House has a major setback. Players are thrown from the house, and forced to start from the last save point. The problem is the save points are pretty far apart. If players forget to backtrack through the level to save, they may find themselves having to repeat half an hour of gameplay. It can become pretty frustrating to replay the same battles and complete the same puzzles numerous times.   Players will control DJ and gang through nine floors of the creepy old house. There's a lot of backtracking involved, since so many doors require keys to access them. Finding the key is a lot of work, but then players are forced to fight their way down a couple floors just to get to the door they need to open. Remembering where everything is may be a lot to ask a kid to do. The map doesn't help the situation much, since it's so poorly detailed. The only rooms labeled are the save points and there's no way to tell which entryways are locked doors or special pathways. The help feature in the game is anything but. Skull will come on through his walkie-talkie and tell you something vague and general. We never found anything he said to be of any help.   As if the gigantic living house filled with demon furniture and dozens of bathrooms isn't odd enough, players will find upgradeable parts for their water guns, new weapons, and accessories. Players start off with a camera that can freeze enemies, but soon they'll add extra water bottles for refilling the guns, slingshots, and more powerful gun nozzles to their arsenal. All the items are all hidden in the house and add a nice RPG element to the game. The items aren't necessary and usually involve a bit of extra puzzle solving or exploration to get, but it's nice to be rewarded for going the extra step.   There's a large amount of detail in every floor of the house, and it makes the experience of creeping through the haunted structure more engrossing. The colors are lively and varied, and the characters sprites are very detailed. The characters change expressions during the game and even with the small screen and miniscule characters, the emotions are well portrayed. Each of the kid's attacks is completely distinguishable, giving them all their own distinct look and feel. When players travel to the higher floors they'll be able to see the floors below, and sometimes drop down to them. It really gives the feel that the player is exploring one giant house, instead of a series of connected rooms.   Walking through the monstrous chateau is accompanied by the requisite creepy organ music. The music is pretty dull, but it works for the theme of the game and is what we'd expect. There are a lot of nice sound effects though. Floorboards creak, evil chairs gallop, water guns gush and flow. Each furniture enemy has a different sound effect, almost like an animalistic cry that makes them feel more alive.  Monster House is a welcome change of pace from the summer movie drivel that infests the GBA. The game looks fantastic and fans of the movie are sure to adore the title. It's a license title that doesn't suck, and that's a good thing. It does have its faults though. The gameplay borders on too difficult for younger kids, and can get frustrating. The large amount of backtracking and other downsides might have made this game a snore fest, but the fast paced action is sure to keep kids and maybe even some adults enthralled.", "date": "Sep 20, 2006"}