{"name": "Mario vs. Donkey Kong 2", "name_review": "Mario vs. Donkey Kong 2: March of the Minis Review", "ref": "https://www.ign.com/articles/2006/09/25/mario-vs-donkey-kong-2-march-of-the-minis-review", "text": "Mario vs. Donkey Kong 2: March of the Minis is more of a spin-off than a straight on sequel or continuation of the original Game Boy Advance title. Sure, the Nintendo DS game's been developed by the same team, and it lifts ideas, characters, and its art style established in the original title. But for this game, the designers weren't rooted down to an existing concept from the Game Boy Donkey Kong design of 1994 -- they took the loosened leash and ran, creating a very original touch-screen exclusive design that has more in common with Lemmings than it does with Donkey Kong. As clever as it is, and as much effort that has been poured into this DS puzzler, it doesn't click as a truly awesome game. Even if it didn't have to live up to the legacy of the two great games of handheld past, Mario vs. Donkey Kong 2 stands alone as merely a pretty good puzzler.   The game design revolves around an element established in the Game Boy Advance original: the Mini-Marios. These wind-up toy plumbers were a simple mechanic in Mario vs. Donkey Kong, but in this Nintendo DS sequel they drive the gameplay entirely. Gone is the platform hopping puzzle designs; now players must indirectly and directly control the Marios and the surrounding environment in order to get as many of these toys into the exit. This is all done through touch screen control: tap the individual Marios to make them move or stop, or swipe the stylus to make them reverse direction or jump depending on the touch-screen flow. Tapping on specific platform blocks will remove them from play and put them in the player's queue to use them elsewhere to fill gaps and make barriers, a mechanic that's played out in a majority of the level designs.   It's easy to see the Lemmings influence on Mario vs. Donkey Kong 2. The mini-mario toys have a mind of their own, or rather, lack thereof -- unassisted, they'll just move in a straight left-to-right or right-to-left direction until something obstructs their paths. Unlike Lemmings, though, these Marios will collide with one another and clutter things up some. If a Mario bumps into a stationary Mario, not only will it ~activate~ the stationary toy to start moving, the culprit will bounce and go the other way. It's an integral part of the design, but it's also the most unlikable element of the gameplay and clutters things up a bit much. There's too much juggling as one bounces into the next into the next, causing a feeling of panic as you try and stop them in their tracks as quickly as you can before they domino-effect into each other again and again. It'll take practice resetting the Marios in the proper order, but even when you get good at the controls, trying to wrangle a mob of toys together is a little sloppy.   The fact that this is a sequel to Mario vs. Donkey Kong makes it impossible not to compare: this game, even being so far removed in style and design, is conceptually not nearly as fun as the original. Going from direct control over one character to indirect control over a gaggle of characters is a wild development redirect that might not sit well with players who've grown to love the GBA game and Game Boy game that inspired it. On the other hand, even for those looking to get a unique experience, Mario vs. Donkey Kong 2 just doesn't feel as classic a design. The touch screen controls are pulled off well, but don't respond to cocky players' quick swipes as consistently as slow and steady ones -- the game definitely gets restrictive in how fast you can maneuver the Marios.   Most importantly, the game's a puzzle game but many levels' solutions don't really bend the mind. It's more a ~task~ game than a puzzle game, and the challenge is more about successfully navigating the Marios along the required path and collecting all the items more than it is about figuring out what that path is. And since this is a puzzle game that pushes character management, it's surprising that the upper screen used for simple data display instead of showing a zoomed-out view of the playfield since many levels require scrolling to see everything. This design omission makes a little bit of sense when the game switches to its dual-screen boss battles, but for the majority of the puzzle designs it would have been a handy addition to see the majority of the level...at least as an option.   NST did, however, give its concept a huge amount of legs by not only offering a full-featured level designer into the mix, but also throwing Nintendo Wi-Fi Connection support so players can create and trade their own creations across the globe. It's a wonderful addition because, even as loosey-goosey as the game design is, it gives endless replay thanks to players all over the planet building their own creations. There are really no restrictions in this puzzle designers other than what objects are available (they unlock as you accomplish tasks in single player mode), and the amount of save slots on the cartridge. 24 puzzles can be kept permanently, but you can send your own puzzles to the Nintendo server for anyone to check out. So make them good.   Because the game was made by NST, the game pulls from the same set of cool production tools from the team's previous DS work: Metroid Prime Hunters. The game offers a ton of well-produced full-motion video clips that tell the story of Mario vs. Donkey Kong 2 through one and two camera perspectives. There's also the simple but handy ability to turn on or off statistics tracking through the Nintendo Wi-Fi Connection. The actual game's style follows the original game's direction, which gives the game that same, somewhat awkward ~western~ feel when most (read: all) successful Mario titles have come out of Japan.  The original Mario vs. Donkey Kong is a far better puzzle game than March of the Minis is, but that doesn't make this game a bad one. It is a clever Lemmings-inspired, touch screen design with a great focus on user-submitted content to keep the game going on and on. Its similarities to the first game are only in looks; the concept goes in a refreshingly different -- but just not as successful, addictive or challenging -- direction for Nintendo DS gamers.", "date": "Sep 25, 2006"}