{"name": "Flying Toaster", "name_review": "Flying Toaster Review", "ref": "https://www.ign.com/articles/2006/09/25/flying-toaster-review", "text": "Flying Toaster is a one-button action game where you are in control of the screensaver icon. By pressing any button on your handset, you hoist the toaster aloft. Release and toaster drops back down to the bottom of the screen. At no point do you move along the X- or Z-axis. You must fly through eight stages full of obstacles like aliens, walls, and fish. While zooming through the air, scoop up bread slices for quick energy (carbs!), allowing you to keep flapping those wings. If you run low on juice, you cannot maneuver efficiently, and you'll soon see your toaster go kaput.   Your toaster can pick up other snacks, such as hot dogs and pizza. Power-ups offer skills like increased speed and invulnerability. However, look out for deadly hamburgers that give your toaster a bad case of the bloats.   If Flying Toaster sounds simple -- that's intended. The game is obviously meant as an easy-breezy pleasure, but it's just too shallow for its own good. The eight levels are short. The action is not varied -- just move that toaster up and down. I became tremendously bored with the game within just a couple levels, but slogged it out to see if things got better in the back half of the game. Sadly, they don't.   The best thing Flying Toaster has going for it are its visuals. The colorful graphics are bright and crisp -- the game looks much more fun than it plays. The music isn't too shabby, either.  I completely understand the goal of Flying Toaster -- simple action with a recognizable icon -- but the game never got off the ground for me. The mechanics are repetitive, but not in a clever, hypnotic way like Skipping Stone. The game does manage to recreate the classic screensaver with solid visuals, but that's not enough to warrant a download. Viv shouldn't give up on the flying toaster, though, because there's a better somewhere out there that the icon is better suited for.", "date": "Sep 25, 2006"}