{"name": "Barrage", "name_review": "Barrage", "ref": "https://www.ign.com/articles/1999/03/11/barrage", "text": "Barrage just goes to show you that a bad game can't be saved by good graphics. And we're talking about some very good graphics here. The two features that really kill this game are its ~flight~ model and its lack of missions. My overall impression of this game is that it belongs more in an arcade than on a PC.  I know what you're saying: ~You mean Activision made an arcade game, Steve? (insert biting sarcasm here) Yep. It's true. I honestly wouldn't mind paying 25 or 50 cents to play it a couple of times, but I just can't see buying it for keeps.  I'm still not sure what the background story for this game is supposed to be and I've watched the intro 3 or 4 times by now. Some yokel expounds on the value of the Freelancer 550, the latest hovercraft that looks like a plane. I think you're supposed to be some kind of mercenary taking this baby for a test drive. Overall, the whole intro seems more like a cheesy car commercial than anything else. If it's supposed to be a joke, that's fine but it certainly doesn't get me excited about playing this game.  The flight model leaves a lot to be desired. I guess that technically the Freelancer is a hovercraft. The fact that it looks like a plane, has an unlimited ceiling and can travel underwater makes it seem less like a hovercraft to me. You can't bank or pitch more than 45 degrees in any one direction. This limitation can really sting when you're trying to gain or lose altitude quickly or need to attack someone directly behind you.  Fortunately there are separate controls for up and down and side to side movement but I found these more confusing than useful. Although there are only two throttle controls, one key each for forward and backward, I didn't really find this to be too much of a limitation. I hate the fact that you can't set a medium speed but this didn't seem to be too much of a problem.  The arcade factor for this game is only increased by the lack of any continuity among the game levels. Each is completely unrelated to the others except in terms of sequence. They follow a strict hierarchy. They must be completed in order so you can't move on to one before you finish its prerequisite mission.  There's also a time limit to each of the missions. If you can't complete the objectives in time, then your game is over. There are time bonuses on each level, however, so you do have a fighting chance. The ticking clock in your HUD really makes this game seem like it belongs in an arcade.  As a consolation for forcing you to observe a time limit, Barrage gives you unlimited ammo and unlimited lives. The endless ammunition is great but it means that I was almost always using the homing missiles. The other weapons are useful, especially the plasma cannon, but given the jerkiness of the flight interface, the homing missiles are your best bet.  You also have shields in this game, but when they're depleted you don't die. You simply fall to the ground while the shield powers up again. This whole process takes just a second or two. The real penalty here is that the shield power up removes a certain amount of time from the clock, and it is possible to ~die~ so many times that you won't be able to complete the mission objectives.  Although the mission environments are beautifully rendered, you only get five of them. I found this to be a real let down. Given the limitations of gameplay, extra levels could only add to the value of this game. There is a tournament mode where you fly through all five levels in succession but this is a small consolation. The different difficulty levels were also disappointing. The easy level was surprisingly difficult. I was pleased that the game designers didn't necessarily equate higher difficulty levels with more enemies. Instead the enemies behave a little more intelligently on higher levels, making calculated decisions as when to attack.  The best looking level by far is Chicago, a futuristic metropolis of steel and glass. You fly through the city at night on a search and destroy mission. Thankfully, the game doesn't penalize you for 'accidentally~ killing ordinary motorists. There's a particularly promising sequence where you fly through the subway tunnel, but in my opinion it was too straight and too short.   Graphically, Barrage is incredible but even if you love arcade style shooters you'll grow weary of it pretty soon. The game definitely could be improved with the addition of new levels and a more realistic flight model. There's lots of action here but it only lasts for a short time before your only option is to try the missions again on higher and higher difficulty levels. Barrage is a great game to showcase your graphics hardware but that's all. Sadly, that isn't enough to warrant a recommendation.  -- Stephen Butts", "date": "Mar 11, 1999"}