{"name": "Fear Effect", "name_review": "Fear Effect", "ref": "https://www.ign.com/articles/2000/02/19/fear-effect", "text": "I frickin' love the Resident Evil series. It's great. But I am a little tired of it, you know? I mean, even with the brilliant looking Resident Evil Code Veronica hyping up the Webwaves, it hasn't fooled me. That game is the same exact RE formula to a Tee. It's great, but it's the same. So... So I want something new. More than just more and better looking. An adventure that's completely different. Enter Kronos Studios. From out nowhere, it seems, comes Kronos, who hasn't made a single game that's worth owning, until today.  Fear Effect won't knock Resident Evil off the survival horror map, but it takes the Resident Evil formula and prods and pushes it in new shapes and directions like a kid with Play Dough. It stretches the boundaries and switches around everything you hold sacred in a game, and tortures you into loving it. With Fear Effect, I can forget about zombies, because I have prostitutes that transform into mean-ass hell spawn. I've got my hard-bodied, gun-slinging Hana, whose special move is a fresh towel trick. I've got two other star characters, Deke and Glas, who like their fair share of killing. Plus, I can't remember a PlayStation game that took place in a distant but familiar Chinese environment that looked so rich, detailed, and gorgeous. Oh yeah, and then there's my favorite level, an imaginative, cavernous, icy blue land the Chinese call Hell. Needless to say, Kronos conjured up a fantastic game with Fear Effect. The team stayed true to its gaming principles, and it delivered one hell of a story.  Story The story behind Fear Effect drives everything. Much like a cyber punk novel, the game stars characters you don't necessarily like, but you become attached to. Hana (a former sexy prostitute, she's now a sexy mercenary), Glas (a mean square-jawed American killer), and Deke (a pie-faced, big-eyed Aussie who enjoys each death) are all harsh outlaws, with one thing on their mind, a big bag of cash. They need to return Wi-Ming Lam to her father for a payment. But of course, it's not that easy.   The 18-year-old Wi-Ming is the daughter of the president of a large powerful organization in futuristic Hong Kong, and she's run away from home. A former employee for the company has defected and has joined an underground mafia organization called The Triad. He's found her and is holding her ransom. Wi-Ming's father puts out a bounty on his daughter's head, but they must bring her back alive. Fear Effect opens up as Glas and Hana fly to roof of the Lam building, overlooking a high-rise city, a scene uncannily reminiscent of Blade Runner.   Like a tapestry of Chinese mythology embroidered with Western sensibilities, the story of Fear Effect is deep and riddled with irony and deception. You find that every 15-30 minutes or so, you switch players. As in, you play all of the characters, all the way through the game. First, you're Hana, but then Glas has to save find her, and then you're him. Later on, you're the hard-talking Deke. As the story progresses, much in the way a (good) Tarantino movie might evolve, the player gets to feel a little bit like each of these characters, wrapping you into its cocoon of horrors (sorry, I couldn't resist). Needles to say, the story is much longer and deeper than I have described, but I would rather not spoil it. Except for one thing, the game really starts picking up, and the story starts making a lot more sense, on the third disc. So, if you become semi-bored like I was in disc, hang in there. It gets much, much better -- and is totally worth finishing.   Gameplay The game, I must confess, starts off a little slow for my tastes. Spanning four discs, but by no means as large and long as say, Final Fantasy VII or VIII, Fear Effect needs a lot of space because Kronos is using streaming data, instead of the traditional RAM-upload process to transition from environment to environment. This requires a lot of space, thus the four discs. I'd say I played the game in about 10-15 hours, but it seems like about 20-30 because the first part of the game is rather perfunctory. I'd say getting used to the controls took the first disc or so, and I only mastered them when I was forced to learn the tuck-and-roll move, the 180-degree spin, and a quick toggling of the weapons menu to kill the first boss.   Don't get me wrong, after playing a lot of Fear Effect, I started playing another adventure game, and I was wishing the controls were like Fear Effect's. Without explaining every move, the best way to describe the control scheme is to throw Resident Evil's move scheme on its head. It's like everything in reverse. Except with FE, you can't stop right in the middle of the battle to casually switch everything up all nice and perfect. No, no, no. This game is realistic. You go in with what you have, son. To make a long story short, the controls are no worse than those found in the RE series, but they're not any better, and since they aren't RE controls, they take longer to get used to.  Fear Effect has swearing, nudity, and lots of blood, all of which help create its raw, urban feel. You see violence, too. There's lot of it, but it's anime, so it looks like, well, like an adult cartoon. Harmless, really. As a little aside from the carnage that takes place, I'd like to say that I died more times playing Fear Effect than in any other game, except maybe Heart of Darkness. Fear Effect is like an old-school adventure game, with bundles of trial and error gameplay techniques. You die, and then you get to play it over, hopefully a little wiser the second (or eighth) time around. Also, there are a lot of obvious save points (you know the kind that advertise ~Save Here Now or you'll be Sorry!~), which warn each time a serious event is about to happen.   While the controls bugged me, those can be fixed in the sequel. What troubled me, like I mentioned above, is how many times I died. It's not that I didn't improve (I did), but because there is so much more action, so many opportunities to die, and so little exploration, the game's pace is like a funky car, running in fits and starts. It's staggered so that there is never really an even flow of events that culminate in one especially rewarding situation. Of course, there is the ending, which is a culmination of all of that's happened, but frequent deaths cause a kind of skipping record effect. You eventually move on, but not right away, and it's noticeable.   Action and Puzzles Fear Effect is packed with action and puzzles. You face a handful of bosses in several different situations, and the puzzles are painstakingly well thought-out and abundant in variety. In many cases, the action is a puzzle or sorts. For instance, as Hana you're about to get shot, but Glas comes in, throws you a gun, and now it's you and him against bad guys with guns on one side of the screen, and a helicopter with turreted machine gun on the other side. The way out of this mess is a mixture of moving to and from point A to point B at exact times, and shooting a specified target at exact moments, too. It's kind of old-school, but it's fun, and rewarding, too.   In other situations, you are simply faced with a lot of gun-toting bad guys, who just keep coming (no doubt Eidos' influence). Handle your weapons well, tuck and roll, and you're in good stead. In another case, the camera swings into a top-down perspective, and you must face a boss, who only gives you split second while he's re-cocking his gun to scrape off some damage points. For those wondering about the zombie similarities, disc three (the River Village) has plenty of slow moving green humanoids who provide all the carnage you're going to need.   The actual puzzles themselves are sexy. There are so many of them, and so many of them that logically work into the gameplay, I just get randy thinking about them. Logic is good here. I mean, remember in RE 3 when you had to find a battery for the train inside the back of the mayor's statue? DUH! Logic? Here, you have to diffuse time bombs in your pal's chest by picking the right color combination, or you explode (I reached about 10 splattered deaths before I got it right), or walk across a glass ceiling puzzle correctly, or turn on a simple (and yet not so simple) electric ladder. The dragon puzzles and the nightmarish Hana puzzles in Chinese Hell are surely the best in the game. All these puzzles have a solid intuitive logic of their own, and as soon as you figure each out, you'll feel rewarded.   On occasion, Kronos misses a step with the puzzles, and doesn't clarify exactly how the controls affect the puzzles. In at least one instance, even though I completed the flower/tree puzzle, I had to move my cursor to a different spot to complete it, which was totally illogical in that situation. I spent an hour systematically going over the thing until I got it right, by mistake. In another example of intuitive but unclear puzzles, I never figured out the Hana in Hell puzzles, but I beat them anyway. Strange? Hell is a strange place, I guess...  Graphics The streaming data in Fear Effect creates a distinctive live atmosphere from start to finish. The backgrounds are all essentially pre-rendered animated scenes, while the characters are anime textured polygonal models. In the first disc, the city is constantly flickering with moving cars and flashing lights. In The River Settlement your boat is ransacked for what seems like an eternity by angry green ghouls, and fires, flies, heavy machinery, and moving jungles all come alive. In disc three, Madam Chen's, the weirdo tomato-chucking chefs and sliding cockroaches will give you a kick, and in the final level, the swinging, hanging corpses, the crazy kid's room, and strange hands and heads that appear to rise up from the murky lakes are all alive, creating fear and tension, distraction and, oddly enough, rhythm.   The one flaw that everyone will see in this cool concept is that the moving backgrounds and bustling environments loop, with a little flicker at the end of each. Watch a scene for about 15-30 seconds and you'll see, say, a swaying rope stop like a paused movie, and then start up again to repeat its pattern. If Kronos could avoid the flickering loop, the streaming data would be, well, pretty flawless, I guess.   The game doesn't just improve as the player progresses to the third and fourth discs, it looks better, too. The levels become more interesting in design and in concept. The fourth level, Hell, is absolutely brilliant looking, totally imaginative, and completely different than anything my dim Western education taught me. It's just awesome. There are doors that lead into invisible realms and bridges that connect empty roads, and demons popping in and out of nowhere. In one section, a bundle of sticks is struck by ~lightning~ and a huge bonfire lights up for a strange reason. In the end you find a massive structure of stairs and ruins, and only when the ~lightning~ (if that's what it is) strikes it, that you discover the actual form. The last level looks to me as if T.S. Elliot was Chinese and wrote The Wasteland -- and then illustrated it, too.    Sound The two areas of sound integral to Fear Effect are the voice-overs and the sound effects. Music here is essentially mood enhancing atmospheric layering. It's good but I don't remember it (I guess that means it worked?)   The voice-overs are good, and as long as you don't expect them to synch with the lips exactly (and that's actually purposely done, I'm told), they're perfect. The sound effects are usually pretty cool, too, and are mostly reduced to footsteps pattering on various surfaces. I like the main theme song at the title screen, too.While there are problems with Fear Effect, the overall gameplay, driven by a fantastic story, surpasses any dilemmas I had. I had problems with Resident Evil, but I got over them. Fear Effect grows on you. If anything, this is a game that gets better and better as you progress, so that when you reach the fourth disc, you're peaking at the very finest part of what's being offered, not somewhere in the middle. Fear Effect really sticks out from the crowd. It's a unique game with a rich blend of action, puzzles, and an unusual story, and in the fifth year of the PlayStation, nothing could have arrived at a better time. It's a keeper.", "date": "Feb 19, 2000"}