{"name": "NBA 2K7", "name_review": "NBA 2K7 Review", "ref": "https://www.ign.com/articles/2006/09/27/nba-2k7-review-3", "text": "Even though gamers only have one place to go for NFL football games these days, thank God the same can't be said about basketball. The boys at Visual Concepts busted their ass, and it's showing. Their basketball game this year, NBA 2K7, is determined to be the best in it's class. The team strengthened what was good about last year's title, and tightened the screws in what was lacking. The end result is a satisfy sports game that stands head and shoulders above it's competitors.  Even though the 360 version is the star of the collection this year, the current gen games turned out great. There's a nice comfort level with the controls, PS2 and xbox alike, that most of my friends and peers can't stop talking about.  The look on both consoles is top of the line for current gen standards. And seeing as they cost half of what the 360 version cost, gamers are truly getting their money's worth here.   In terms of graphics, the PS2 version is clean, but just about tad bit grainier than the xbox version - the difference is negligible. Most importantly, the game runs pretty smooth during gameplay (not so much during replays). The courts and overall environments in the PS2 version don't have the gloss and detail that the xbox version does, but this becames less important to me as I dug deeper into the game itself. Just make sure you don't watch someone play the 360 version before playing this current gen edition. The blockiness of the players will stand out more than ever. Also, that cool dynamic cloth we see in the 360 version isn't in the current gen. Now that we know what next gen faces can look like, it's tough accepting the current gen athletes. They're decent by current gen standards - no one looks too frightening - but the genuine resemblance is often dismal at best.  I also noticed that the distinguishable styles of the players aren't too apparent either, for obvious reasons. Where as the 360 version brought forth Signature Style, in where stars of certain teams are animated with certain habits, unique shot mechanics and nuances, current gen player models barely demonstrated this feature. It's there, but not as much as in the 360 version.    Isomotion has returned, and it functions are as good as ever. This is basically controlling all you player's motion, even shooting, with the analog sticks (although face button option are still there). The interesting thing about this feature is that you can pick up and play the game, having read nothing about the functionality, and do a serviceable job in a game. Waggling that analog stick in respect to what you see happening on the screen is just a more intuitive way to play the game. Once you dig in and read all of the specific moves you can execute with the feature, it really opens up the experience. Free throws work by the same principle. Simply pull back on the stick and release at the right moment. Thankfully, the tuning was sound, and I was able to take a team like the Warriors, and hang tough with the Heat on moderate difficulty. A speedy Baron Davis can pull off some impressive shots under the control of Isomotion.    Defense is pretty solid this year. The CPU makes smart decisions when playing with you and against. I know our 360 version seemed to exhibit some issues when Jonathan Miller watched his player hold the ball for the last few seconds of the game without even attempting to take a shot. But I didn't run into any of those problems when I played my current gen games. And when anyone stepped out of bounds, it was because of the intense defense I was pounding the opposing team with (toots own horn). I saw AI driving players to close open lanes to the hoops, confounding easy lay-ups and the like. This means players won't just steam roll  their way to the goal with each possession. Thinking about and running real plays and getting the ball to the open man will have a lot to do with how successful you are. This made the experience feel genuine which is what any basketball fan can appreciate.     For those that love tinkering and strategizing more intricately with their teams as they play, the added feature known as ~on the fly coaching~ is a welcomed tool. This allows users to make subs and pace decisions without pausing the game. You manage it all from the D-pad. It comes in handy by minimizing the interruption of your experience with the game.   The Association was designed to satisfy the hardcore NBA fan base. It's here that you control every aspect of the team you choose. During the simulated calendar year, there are free days that you can use to build your team. This means you can assign different practices to the entire team or individual player, which gains attribute boosts , but impacts fatigue. You can also go through a variety of individual player development drills like post defense and offense, for example. In the offseason, you can do predraft workouts with potential draft picks, and really get a sense of what the real NBA shot callers experience. This feature is insanely deep and worth the attention and time commitment.      The story mode in the 360 version, known as 24/7 isn't in the current gen versions of the game. In the spirit of games like NBA Ballers and NBA Street, this year's 24/7 mode allows you to create a baller and send him to battle the street courts of Chicago to Rucker Park. But in the current gen versions of the game, the closest you get to that is a street mode that allows you to play in the streets and play all kinds of non-NBA games. You play full court, half court, one on one, or 21. And within each of those parameters, you have various other options to choose from, like time of day, weather, and game points.   Although charging calls were toned down in the 360 version, I ran into several extraneous calls during my games on the current gen titles. If you found this particularly irritating in 2K6, take note. Current 2K7 hasn't quite escaped the charging call sensitivity of last year. I replayed my calls repeatedly, and found that something as simple as jumping straight up (vertically) for a shot will knock a defender back and trigger a charging call. And although players perform the flop all the time in the NBA, this was absolutely absurd. Jason Richardson didn't even come in contact with Wade, but he was still hit by some invisible collision and got knocked back. Don't get me wrong. One flop played well I can tolerate, but it was way too frequent.     If the games you're playing don't seem practical enough for your tastes in NBA 2K7, that is in your control. In 2K7 you can make the games as simple or complex as you want. To help point you in the right direction, 2K put in a section called My NBA in the options section. There, users will find a ton of sliders to play with and customize how the game works for them. You can tweak the success of different kinds of shots in a game, how teams perform on a whole, and how individual players play. As mentioned in an earlier preview, things like Tempo, crashing the boards, help D, passing the ball with flair, clogging the passing lanes, and whether or not the team is prone to committing fouls, are all thing promised as customizable, and they made it into the final product.   The 2K Sports online offering is as good as ever. Online leagues and tournaments, as well as standard lobbies, ranked games and leaderboards. You can play with up to 30 players in the online leagues. And even with that, there are ton of options you can set that gives you a ton of range for your games. Users can be as strict or leant as they want. Also, the actual gameplay is smooth online which is probably the best feature of all.   The commentary by Kevin Harlan and Kenny Smith is ok, but I personally have never cared that much about this feature in any sports game. More often than not, I end up turning it off anyway. But if you want the commentary dimension included in your game, just know that their comments get a little repetitive after a while. As for the soundtrack, it's hip-hop heavy from a bevy of hot acts. The xbox has the advantage of letting you use your own ripped music.  Im happy with how this game turned out. I saw some weird things like arms passing through players, and some weird things happening with the animations at times (odd collision issues) but overall, the game plays quite well. Its not hugely different from what we saw last year, but the advancements that were made were solid enough. NBA fans that own current gen consoles can hold out a little longer before they upgrade. NBA 2K7 on PS2 gives nice bang for $30 bucks.", "date": "Sep 27, 2006"}