{"name": "Splinter Cell Double Agent", "name_review": "Splinter Cell Double Agent Review", "ref": "https://www.ign.com/articles/2006/09/28/splinter-cell-double-agent-review-5", "text": "Splinter Cell Double should have been an easy to review to type -- the game features a critically lauded franchise, proven game play mechanics, and bang-up graphics. Contrasted with the first Splinter Cell on mobile, you can really track just how far mobile gaming has come in a few years, as Double Agent closes in on approximating some of the best action-platforming of the 16-bit generation. However, there is an undercurrent in Double Agent that really lessened its impact on me: familiarity.   Double Agent is as cinematic as this genre gets, but the there's no way around the fact that Gameloft has really milked this engine for all it can. Sure, they've added new moves and graphical flourishes over the years, but this games shares more than a little DNA with King Kong, Prince of Persia, and what I consider the zenith of the formula, the superlative Mission Impossible III. Now, I'm not going to go so far as to say I was bored while playing Double Agent -- because I wasn't -- but anybody that has downloaded one of Gameloft's action games before is likely to get the same feeling of ~been-there~ that I suffered.   Anybody that just got a new cellphone and is looking for their first action game download, however, is in for a treat. But it's not fair to review a game through the eyes of a newcomer, because those that have stuck by mobile gaming, and more so, stuck by Gameloft also deserve to feel the ~wow.~   There are some great moments in Double Agent that certainly do cause a smile. There are some terrific falls and shoot-outs, as well as some great moves like watching Sam Fisher straddle a chute and ride it down to the bottom, only to flatten the cranium of a bad guy (well, maybe it's a good guy, since you're a bad guy in this game -- more on that in a second). But I never got giddy like I did the first time Ethan Hunt attacked a guard by leaping over a barricade while smashing his head into it. Or the first time he grabbing an enemy by the nape of the neck and pulled him down in his pistol for a point blank kill.   The story of Double Agent reflects the twist in the upcoming console editions: Sam Fisher must go deep undercover as a terrorist to help flush out a cell. The psychological hook is how you feel about maiming and killing good people to keep your cover. After all, in the first scene, you prove your allegiance to the bad guys by breaking their leader out of prison. Many guards are dropped, and while you have a stun gun to help with the escape, some of those physical attacks look pretty brutal. It's a good direction for the story and mobile gamers should find this truncated rendition of it satisfying. After all, most people come to this medium to stack blocks, not get involved in an action epic. But those that do, are well served by Gameloft's fare.   Being a Splinter Cell entry, there is still much stealth work. Sticking to the shadows to avoid both human and security detection. Staying out of view until the last second is how you advance, such as hanging from the same ledge an unsuspecting enemy stands post on. When the moment is right, you reach up and grab him by the ankle, yanking him to his death while you pull yourself up to safe ground.   Most of the stages feature essential platforming trappings: lots of jumping and running, finding the perfect route to reach that ledge that looked too high to access in the first screen. There are collectibles, too, that can be stuffed in Sam's sack for bonuses.   Double Agent certainly looks great -- as expected from both the brand and the publisher. Gameloft has these handsets dialed in. I tested the game on two phones, a Sony Ericsson w80i and an LG VX8000. Neither handset is a slouch. The use of color and animation are fantastic. As mentioned, Double Agent is the most cinematic of the Splinter Cell series, thanks to some scripted action scenes.  Splinter Cell Double Agent is tough for me to score -- it's a good game, but it's also one we've played before. There are more cinematic moments in Double Agent, some new moves, and improved graphics -- but there isn't much going on here that wasn't done in last summer's Mission Impossible III. And the basics of the game have been seen in games reaching farther back than that, including all the Splinter Cells, Princes of Persia, and even XIII. If you're new to Gameloft, you'll certainly be impressed, but loyalists will be torn. Double Agent is definitely a game if quality, but it's familiarity stunts its effectiveness.", "date": "Sep 28, 2006"}