{"name": "NBA Live 07", "name_review": "NBA Live 07 Review", "ref": "https://www.ign.com/articles/2006/10/03/nba-live-07-review-3", "text": "Last year, NBA Live 07 tried to restore the creativity and the spontaneity to the basketball court by introducing Freestyle Superstar Controls to the game.  While the flashy moves did separate the stars from the generic athletes, it also made them extremely dominant during the games.  So it was pretty obvious that EA Sports would refine the system to hopefully make it more balanced for this year.  Unfortunately, in their quest to make the control system better, they neglected both gameplay and the basic mechanics of the sport itself.  As a result, Live 07 is a game that really should be riding the bench instead of starting this year.   Welcome to the GM's Office  Dynasty mode actually comes to the PSP this year, along with system link capability to take a spawned Dynasty file with you on the go and reconnect to the PS2 without losing any of your progress.  This year, there's a much larger focus on the draft, team dynamics and scheduling.  Players can now choose to relive the 2006 NBA draft and pick their favorite rookies to help build the future of their team.  Along with the standard assistants, scouts and trainers that players might be familiar with from the console version, you'll also need to hire a new assistant head coach to schedule team events such as practices or press days as well as check up on potential rumors that may be used to your advantage.  These can range from players potentially being traded to highly skilled coaches and staff members looking for new organizations to become part of.  As you progress through the season, you'll need to continually check in with these guys to see how well your squad is progressing, as well as what the team's particular chemistry is. Team Chemistry is important because the play of your team is affected by how high or low your rating is.  The lower the rating, the harder it is for a team to mount a comeback during a big game.     This year includes a dynasty mode. Dynasty mode also tracks the fatigue factor on your players in two ways.  The first is based off the amount of game time your players log by starting or coming off the bench.  The other is based on the amount of time that your team spends on the road, playing against opposing teams in their home arenas.  It might not seem like a major part, but going on a long stretch around the country will negatively affect the strength of your players, making them much more susceptible to injury and long stints out of the lineup.  There's something that's particularly unbalanced about this new system though, because some three or four game stretches away from home will sometimes knock out two or three of your starting five without fail.   B-Ball Diversions   One of the cool things that Live 07 has for the PSP is the inclusion of two exclusive Mini-Games, 2 Ball and Handles.  2 Ball is an arcade style mini-game where you have two shooters trying to be the first to 50 points from various zones on the court within either a timed or untimed game.  As you play, assorted power ups will appear on the court, which can boost your score, freeze your opponent in place, slow them down, or even reverse their controls.  There's also the ability to catch on fire by collecting three fire icons, which maxes out your power bar, giving you the chance to make practically any shot you take from anywhere on the court.   Freezing your opponent is just one trick in 2 Ball. The other game, Handles, is a reaction based game.  Similar to the Madden's End 2 End mini-game for the PSP, you turn the handheld sideways so it's vertically facing you.  During each stage for a level, a dial will pop up with various directions that you'll need to input with the D-Pad before your time runs out.  As you pass more and more levels, the time gets shorter and shorter, necessitating accurate button presses to be successful.  However, if you happen to need some additional time, you can hit the R button and trigger a Time Shift, which freezes time and gives you some extra seconds to finish a tricky combo.  You'll gain these special abilities if you clear an entire level perfectly.  If you manage to beat the computer in these mini-games on the various difficulty levels presented, you can unlock highlight videos of players like Vince Carter, Tim Duncan and Yao Ming.    Getting Ready For Tip-off   Basketball may be a team sport, but it's always been extremely easy to spot the stars from the generic faces on the court and the elite athletes that rose above them all in the NBA.  Unlike the console version, there are two separate versions of players in Live 07 for the PSP: Regular players and Superstars.  Regular players are the guys that are good enough to play in the league, but aren't particularly significant enough to stand out.  Superstar players, by contrast, stand out with special skills that make them much stronger players on the court, such as their shooting, defense or passing skills.  You are given the ability to switch skills on the fly by double tapping the L button, so a player that might be an inside scorer can quickly change to a playmaker or a shooter if the team needs those particular abilities.   Speaking of abilities, Live 07 features 8 skills that you potentially rotate between.  Now, these are technically the same six skills as last year (High Flyer, Scorer, Shooter, Playmaker, Power Player and Stopper), but the main difference is that now Scorers can be designated as Inside or Outside Scorers and Stoppers can be Inside or Outside Stoppers. It's not a major change, and in some ways it even feels a little like a cop out, particularly if you played last year's game, because it's only a minor adjustment of pre-existing traits.  But if you've played last year's game on the console, you'll recognize just how to pull off some of the Superstar moves, thanks to holding the L button and tapping any one of the four face buttons.   Now players have all 8 Superstar control types. Finally, players will notice that Live 07 focused on clutch players that aren't necessarily superstars, but can get in the zone and dominate a game when their team needs them most.  This feature is known as ~The X-Factor,~ and at the start of every game, one man on each team is designated as the potential game changing player.   However, you can't just have that person on the court to unlock their ability; instead, you have to keep that player involved in the flow of the game by getting them the ball, making shots and causing turnovers. As soon as these players start to get amped up, you have a choice to make: you can trigger the X-Factor which will turn that athlete into a Freestyle Superstar for at least 5 minutes or you can save it until you need to use the ability.  There is a trick to the latter option though - that X-Factor player has to remain actively involved in the offense and defense to remain in the zone. While it's nice to see that Live 07 is giving these secondary players their due, you aren't going to go out of your way to adjust your playing style just so these guys can get in the zone, particularly if they're the sixth or seventh man on the bench.     Then again, you may find that it's relatively tricky to get just about anything going for your team, thanks to the choppy gameplay found in Live 07. The inside game is atrocious, and you'll easily find yourself cursing as your ~professional athletes~ blow most of their dunk attempts.  This covers everyone from the lame players up to Superstars like Shaq, Kobe and Lebron. Maybe part of this is tied to the fact that dunks, layups and shots are all centered on the circle button, but this isn't the risk/reward system from the consoles (particularly since you don't actually have a lot of control over whether a player will dunk or attempt a layup). They can't hit a layup to save their life either.  This isn't solely tied into contested shots in the paint either; I'm talking about fast breaks where there is no defender and the damn guy can't convert on a fundamental shot.  What's worse, you may discover that if a player is in the lane, they'll sometimes try to make a shot from behind the backboard, which is automatically turned over (if it doesn't clip through the board and ricochet from the rim). This was a serious problem from last year's game, and it returns big time in Live 07, regardless of the difficulty level setting.   Good luck with the jumper, Dirk! Jumpers aren't particularly strong either, regardless of the player that you happen to be controlling or how deadly they might be from the perimeter. I took ten shots from various locations, literally releasing the ball at the same point in my jump every single time, and only made two or three of them.  These weren't all shots from downtown, mind you -- I changed them up by taking baseline shots and short range pops in front and to the side of the basket.  Regardless of where I was, the results were the same: a crappy shooting percentage.  Even stranger are the arcs for shots, whether it's a jump shot, layup or otherwise, are often wildly off the mark. For instance, there's no reason why some shots three feet away from the basket need a trajectory akin to an ICBM before they come close to the rim.  One thing that does stand out, particularly now that Live 07 has implemented the same system from the console version on the PSP is just how unbalanced the gameplay is between superstars and normal guys.  It's possible to completely dominate (and be dominated by) a team with one or two extremely skilled superstar, because their abilities are so overpowering that opposing teams are completely blown out.      Turning away from the shooting issues and onto the squads themselves, it's extremely common to see a ton of A.I. issues or glitches on your team and the computer's team. Players that are inbounding the ball will often be standing on the court when they pass the ball in, which is blatantly wrong.  During transitions, players will often run the length of the court out of bounds, making any passes to these morons immediate turnovers.  The computer will often inbound the ball to players that are either out of bounds themselves, or are in the backcourt, resulting in turnovers as well. The PSP version is particularly guilty of poor shot clock and ball management regardless of how much time is left on the game clock.  The computer will have one player hold onto the ball in one location without passing until the clock runs down to about five seconds.  Then it will either take a shot or attempt to pass to another player, which can sometimes result in a turnover or a shot clock violation.   This is extremely curious because on defense, the computer can be ridiculously overaggressive, often stripping the ball away from your players in traps and grabbing rebounds off the boards while your players simply stand around, not contesting a shot or boxing out.  I could go on and on about some of the other issues for pages, but I'll leave you with one of the largest ones around: substitutions with the fatigue meter.  Simply put, the game doesn't do it properly.  With the exception of foul trouble (and even that is questionable at moments), the game will never substitute players based on their fatigue, which isn't realistic in the slightest bit. Nor is there a radically change in their gameplay, such as easily turning the ball over or putting up a ton of air balls.  Some computer players can be completely exhausted and still annihilate your team with their shots.  It's disappointing, it's flawed, and it, along with every other problem, has to be fixed for next year if this is even going to be anywhere close to a decent title.   Technical Skills   Not the most visually stunning, but not bad either. Live is one of those games that's a mixed technical bag, particularly with the character models.  The heads on these players are simply huge, and while some athletes look close to their real-life counterparts, others are completely off.  They are modeled much better than that on the PS2 and Xbox, however, so there is a slight bonus there.  Facial aesthetics aside, the game suffers through a massive amount of visual issues, such as players that move through backboards or opposing athletes on shot attempts.  On the other hand, players do seem to have much more weight to them in the PSP build than in the consoles, and when a defender puts their body in the way of an opponent, you can actually get a sense of physical collision and adjustments made to continue the play.   Marv Albert and Steve Kerr handle the lion's share of the commentary, while Greg Anthony and Ernie Johnson take the duties for the All-Star Weekend.  The dialogue in Live 07 is actually rather decent -- Anthony and Johnson have a lot of the best lines, particularly when it comes to the dunk contest.  However, you may still notice that the play by play is still lacking, particularly in following the game action.  There are plenty of moments where Albert completely drops out, or will make a comment on a play that's easily 30 seconds or more old.  While Kerr has a lot more of the anecdotes and comments that should give the game additional perspective, the fractured timing within the game gives the accuracy and relevance much less importance than you'd think.    One thing that the PSP version of the game does which is extremely cool is the inclusion of the new EA Media center with MP3 Playback.  Not only does this let you access all of the music and video from the game's soundtrack, but it also accesses any mp3s that you may have on your memory stick.  This is seamless and easy, and the game immediately recognizes them as viable songs that you can choose to play along with or instead of the tracks in the game.  This is an excellent idea, and one that hopefully will carry over not only to other EA PSP titles, but to the console world as well.     The ESPN integration for the game, which is technically one of the coolest features for the game, is extremely nice, but doesn't go far enough.  Every 20 minutes, you get an update via ESPN radio either automatically when it's updated or when you request it.  You also have the ESPN ticker which will scroll scores and news across the bottom of the screen when you've logged on.  It's a nice addition, but it would've been nice to have the chance, once you jump on, to tailor your experience to what you're interested in.  For instance, it would be excellent if you could tailor the ESPN experience to give you highlights on specific teams or sports when you log on, giving you a little more control over what you're receiving from the servers.  Ah well, maybe next year.   Speaking of the online play though, what the hell is up with the DNFs?  I played a number of online games via infrastructure play, and while I wouldn't pause the game at all (reasoning that three minute quarters online didn't need substitutions at all), some of my competitors would or would quickly drop out after I'd established a lead.  However, instead of giving them the DNF and penalizing their account, I'd get stuck with the harmful mark on my record.  That just sucks, and ruins the entire online experience, especially if you're not one of the cheap players that can roam the online boards.While the PSP version of NBA Live 07 is much better than that of the PS2 and Xbox, it's not better by too much.  The game still has a lot of A.I. and gameplay flaws, and the domineering power of the Superstar control from last year really exerts its influence in this year's game.  On the plus side, it's great to see Dynasty mode and the EA Media Center, which should be included in many other games.  Unfortunately, dynasty mode, while nice, still won't save you from that poor gameplay experience (unless you feel like simming every single game), which is a step back from what this game could've been on the portable.", "date": "Oct 3, 2006"}