{"name": "The Fast & the Furious", "name_review": "The Fast and the Furious Review", "ref": "https://www.ign.com/articles/2006/10/04/the-fast-and-the-furious-review-2", "text": "Street racing seems to be getting hotter and hotter these days, especially in the videogame scene. Popular film franchises like The Fast and the Furious have helped push the sport into the public eye, so it wasn't much of a question that Namco Bandai and developer Eutechnyx would bring a videogame into homes to go along with the latest film, The Fast and the Furious: Tokyo Drift. While the game isn't actually subtitled Tokyo Drift, it is indeed based around Tokyo's highway system and drift racing.   The game is actually split into two basic race types: grip (or the more standard street) racing and drifting. The theory here is that you're able to play the game that you want to play; whether you want to slide around turns for style points or slam the pedal to the floor and dodge traffic, you can do it. In some ways, this works well, though it turns out that the game's attempt to balance between the two left things a little imperfect.    The issue here is that while the cars generally feel great, they don't always drive that way. The inference of weight comes through beautifully, with each and every car feeling like three thousand-pound pieces of machinery rather than paperweights on wheels. You have a great sense of speed and inertia because of this, and the power that your wheels are kicking out comes through the controller nicely.   But while the cars carry a great sense of weight and power, they seem a little too squirrelly and skittish when you get behind the wheel. This works great when you're in one of the drift races as it's easy to throw the rear end of the car around a turn and essentially strafe through a corner, but it doesn't work well when you're trying to navigate what should be relatively simple turns at high speeds. It seems like the vehicles simply output too much power to the wheels regardless of how fast the engine is spinning. Even the least powerful cars will kick and scream when you floor them, and the higher-end rides feel like they're attempting to kick off their wheels.   Even aside from this, the traction control feels like it's focused around the rear wheels rather than all four, making it difficult to dive into a turn like you should be able to do. Granted, the game does have a bit of an arcade-like feel, though there are a whole lot of simulation elements going on here that don't feel like they've come together quite right.   There's also an issue of balance with regards to the progression. While Tokyo's highway system is ~open~, you don't have access to the entire city so you'll just speed up and down the freeway to get from area to area or scope for pickup races (you can always bring up the map and skip to any major destination however). Once you've picked up a reasonably fast car, it's a piece of cake to burn any other ride in any of the speed or time-based races. Our Corvette, replete with over 700 horsepower, was earned about an hour after we started and can hit 245 when we kick in the nitrous. For most any pickup race in the game, after flashing our lights to challenge the other driver, we can simply hit the nitrous and the race is over in literally three or four seconds. Speed races are no problem because nitrous takes you to top speed so fast that you max out in no time, so the rest of the race becomes a tedious rounding of the track.    Drift races can be reasonably fun because the driving mechanics are tuned for it so well, but they're also rather easy to win. You aren't penalized in any fashion for slamming into a wall or spinning your car, so heading into a corner at full speed and racking up a ton of points while flying sideways is simple. Don't worry, the wall will stop you and let you set up for the next one.   Despite all of this, there's quite a bit to like about the game. While the driving mechanics are a little off and it's generally pretty easy, the vehicles can still be a good deal of fun to drive, especially when flying around corners. And as mentioned, their sense of weight and inertia feels great. The upgrade options are quite nice, allowing you to swap out your engine, pop in a turbocharger, intercooler and whatever else you want, all of which is reflected graphically. The visual options are great as well, allowing you to outfit your ride with a number of different body kits and slap on and customize a rather insane number of decals and paint jobs.Not a bad game by any means, The Fast and the Furious does a number of things mostly right, but only a few things very well. The driving physics are tuned too much for drifting, making the street racing sections play a little awkwardly, while the drift races are too easy because you aren't penalized for driving like an idiot. However, the cars carry a great sense of weight and presence on the street and the customization options are excellent. Try this one out if you love customizing your ride and sliding it around turns, but don't expect perfection or a whole lot of competition.", "date": "Oct 4, 2006"}