{"name": "Tiger Woods 07", "name_review": "Tiger Woods PGA Tour 07 Review", "ref": "https://www.ign.com/articles/2006/10/07/tiger-woods-pga-tour-07-review-6", "text": "While setting up my second shot on the 18th at Pebble, the cold virtual surf pounding the virtual Monterey coast below me, I can't help but feel I've done this all before. For more three years now I've tested my luck over the Pacific from the black tees. Then, my controller-rumbling as I go for the green in two, I break the hearts of Pops Masterson or Melvin Tanigawa or some other virtual caricature as I drop the next to the pin, inches away from an eagle.   Tiger 2003, 04, 05, 06 and now 07. And you know something? It never gets old.    Tiger 07: As fat as you wanna be. Tiger 07 is the definitive Tiger Woods experience, an anthology of courses, players, options, and gamemodes that so packs a disc you wonder how the team at EA did it. And while Tiger continues as the world's most fun golf game in 2007, the now-annual question pops up again: Where does EA go from here? Creative titles like Pro-Stroke Golf and Real World Golf, and a lack of recent innovation on the part of EA, are closing the gap between Tiger and the competition. Still, this only reinforces Tiger's biggest problem. When you're the best, how do you get even better?   Gameplay   Options, options, options. That's really the direction the development team has taken this year. Tiger is really as difficult as you want it to be, and on expert control settings you'll find yourself hard-pressed to break 70. That's mostly because some courses -- especially the fictional ones like Central Park -- have been Tiger-proofed, with greens that have such slope that the blazing grid lines may induce seizure. Some courses, like our old friend Pebble Beach, remain cake (maybe because we've played it for so long).   Natalie Gulbis: begin drooling. But on the higher difficulty settings, you'll find the controls unforgiving and a refreshing challenge. I've routinely shot in the high 50s on some courses in the past and those days appear to be over (at least for a few weeks, anyway). The difficulty sliders for environment, opponents and your own swing make this Tiger the most accessible and, for experienced players, the most challenging to date.   After the revolutionary dual analog system debuted in 2003, Tiger has been tweaked with a steady influx of minor putting and swing changes. This year, you can choose from both old and new, so those not in favor of the shot shaping stick to control fade or draw can use the left analog stick alone, Golden Tee style. Even the old-school putting from Tiger 03 is available, if you so desire.    The PC features the familiar mouse and keyboard approach, but you can always plug in an analog controller, if you like.    New For 07   More golfers, more courses. As far as Tiger fans are concerned with, that's all we want. EA upped the golfer total to 21, adding a few fictional characters and a virtual Annika Sorenstam. There are also 21 courses, including newcomers Aviara in Carslbad, Calif., the Falls in Vegas, the K Club and the fictional Safari Country Club. Old favorites such as St. Andrews, Bay Hill and The Highlands return as well. In all, there's a lot of content, and that doesn't even include the Team Tour.    So Many Modes   Team Tour is a cross between last season's Rivals Mode, the Tiger Challenge and fantasy football. You'll play through a number of challenges worldwide, improving your created-character's attributes along the way and earning dough to unlock courses and improve your equipment. But you also assemble a foursome to try and take out Team Tiger, improving your teammates along the way as well. It's a fun mode, though one has to wonder if it's the product of a late-night brainstorming session where the team was trying to figure out some kind of new gamemode.    Game Face: Best create-a-player ever. Complementing Team Tour is PGA Tour Season, Real Time Event Calendar, Skills 18, Battle Golf, One Ball, Bloodsome, Greensome, Skins, Stroke Play... the list goes on. The fact is that there are so many gamemodes that there are two different menus for them.    The online offerings are solid as well, including the basic quick match as well as a daily tournament. EA hosts a tournament on a different course each day and you go play alone, recording your score and moving up the leaderboards. My personal favorite is still match play against a friend -- nothing is more annoying than me yelling ~dormie!~ into the headset during a backswing.   Technically Speaking   It's in the graphics and sound department where EA showed little improvement, which is becoming standard fare for the final versions of current-generation games. The game still looks great -- it just looks as great as it did three years ago. I would never question the genius that is Feherty and McCord in the booth, but I don't think those two have recorded new commentary in a long while.    Great form.  Tiger Woods PGA Tour 07 is the greatest Tiger yet, but it's starting to feel like season five of The Sopranos. It's still the greatest show on TV, but it's starting to feel a bit stale. Maybe we have just become inoculated to the greatness; who knows? What is true is that the graphics and sound are straight out of 06, which is straight out of 05.That said, EA packed a ton of content and options onto that little disc, including difficulty sliders that will leave you bending your sand wedge over your knee. Tiger 07 is the best of the old Tiger; it's the best of the new Tiger; and it's still the best golf title on the market.", "date": "Oct 7, 2006"}