{"name": "Mortal Kombat: Armageddon", "name_review": "Mortal Kombat: Armageddon Review", "ref": "https://www.ign.com/articles/2006/10/10/mortal-kombat-armageddon-review-2", "text": "Armageddon.  Numerous cultures have a prophecy or belief about the end of the world. Some of them essentially go gentle into that good night, while others go out with a massive, cataclysmic bang.  For fifteen years, the Mortal Kombat franchise has been staving off this catastrophe, eviscerating warriors in various tournaments to determine the fate of various realms.  However, it's time has finally run out.  As a send off to the current generation of systems, Midway has gathered a huge roster of warriors together for a final climactic tournament in Mortal Kombat: Armageddon. But does the series go out with a bang, or a whimper?   The Beginning of the End   Unlike the previous two Mortal Kombat titles on the consoles, the primary thrust of Armageddon isn't about treachery, quests for power or even conquering realms. Instead, Armageddon focuses upon a dangerous scenario preordained by the Elder Gods. Inevitably, over the course of multiple Mortal Kombat tournaments, the realms would become so saturated with skilled warriors with special abilities and powers that the very safety and fabric of Earthrealm, Outworld and others would be torn apart by their constant fighting.  This fatal tipping point would lead to an apocalyptic battle that would destroy all life everywhere. As a safeguard to this scenario, the Gods established a pyramid with an elemental guard, Blaze, who would signal when the final battle for the universe would be held.     There are no alliances or friends in Armageddon. The battlefield intro of the game does a great job of setting up the sense that, literally, all hell is about to break loose with just about every single fighter in the game rushing towards each other in a windswept crater. From Scorpion and Sub-Zero renewing their contentious fight to Baraka and Kung Lao squaring off in mid-air, if you're a MK fan, you can't help but get an adrenaline charge from seeing all of these warriors squaring off before the appearance of the pyramid forces a temporary pause in the action.  What's more, the zombified Liu Kang has an excellent entrance, confronting Shang Tsung on one of the upper tiers of the pyramid by re-snapping his neck back into place before launching his attack. Finally, Blaze's bellowing roar towards the fast approaching fighters that Armageddon has indeed begun, and there doesn't appear to be anything that can be done to avoid it.   The Kompetitive Konquest   Of course, there's much more to the tournament than the primary fighters know, and that's where the Konquest mode comes in.  Retooled for the third time in as many games, Armageddon's Konquest mode does away with the simplistic tutorial fight missions from Deadly Alliance or the time specific quests and missions from Deception that players weren't even guaranteed to discover.  Instead, Armageddon takes a couple of pages from the popular spin-off title Shaolin Monks, providing a linear exploratory adventure while introducing the two newest characters to the Mortal Kombat franchise, Taven and Daegon.   You'll travel the realms in the redone Konquest mode. Taven and Daegon are the demi-god sons of Argus, an Edenian god and Delia, a sorceress with the ability to predict the future. Both men are sent away by their parents to Earthrealm and held in suspended animation by two dragons over numerous centuries to avoid detection by Shao Kahn until the time would come for them to be awakened.  At that moment, the two would then compete in a wide ranging quest to retrieve powerful weapons left by their parents for them so they would be prepared to eventually face and defeat Blaze. The winner would become the protector of Edenia, although the quest had a hidden, secondary motive: potentially averting the foretold apocalypse seen by Delia.      Players take the role of Taven as he is finally awakened and embarks on his quest, which will take him across numerous realms.  Each one is stocked with a number of potential threats, such as clan members that attack intruders and dangerous traps.  Fortunately for Taven, his parents have scattered training obelisks through the realms, which provide him with hand to hand combat and supplementary powers: he'll be able to throw a fire projectile, freeze time, explosively pound the ground and teleport away from incoming attacks, which costs energy to use.  Every now and then, he'll also gain access to weapons like swords and hammers which he can use on anyone foolish to rush him.  Like Shaolin Monks, you are able to use environmental objects to kill these minor opponents, such as impaling them on massive icicles, throwing them off cliffs and sending them into bonfires, which replenishes your energy and life bars. You're also able to perform one of four basic fatalities on these thugs, like breaking their necks or ripping them apart.   Similar to Deception's Konquest mode, players will come across various items scattered around each level.  Some of these are music tracks that will be unlocked in the Krypt, while other chests will hold alternate costumes for characters or fighter specific items, such as Kira's Knife or Hotaru's Flag.  It may seem somewhat strange to see these items around without their owners, but there's a very specific reason to search out and collect these items: each one fits on a grid that unlocks secrets within the game, such as new characters for the Kombat mode.  Players will need to be extremely thorough if they want to find every single item, because you'll often discover that many of them happen to be hidden or invisible until you get near them. However, because some sections of the game emphasize battles much more than exploration, you may find yourself exposing yourself to attacks as you search each inch of a stage for hidden chests or items.  You'll also find that after clearing some battles, you'll immediately be pushed forward, so if you haven't spent the time exploring a place, you'll lose that opportunity until you play through the entire mode all over again (or unless you reload your game from your previous checkpoint).    You'll face off against other MK opponents as well as minor thugs. Players will also notice that you'll run into and go up against a number of characters from the MK Universe in standard fights.  Similar to Deception, you'll wind up squaring off against these warriors when they feel like you've invaded their territory, threatened them or any other number of reasons.  Of course, Taven doesn't want to fight unless necessary, but he'll completely throw down to protect himself.  Unfortunately, these Konquest fights fall into two specific pitfalls, which can be somewhat of a letdown.  For one, you aren't able to perform any fatalities on these ~primary~ characters, which feels somewhat out of place in the Konquest mode, especially when you know that these fighters can do this in the standard battle mode.  The other issue is that when you beat certain characters, they'll make a point about looking forward to fighting Taven again or making sure that their paths will cross again, but they never do.  Considering that the entire mode clocks in at under 10 hours of play, it's a bit disappointing to square off against some opponent, not be able to finish them off, and then have a challenge thrown down that you'll never be able to take up.     Diversionary Kontent   When you think Armageddon, you think death and devastation.  Ancient prophecies coming true, with mountains crumbling and seas boiling.  Kart racing around tracks with super-deformed characters.  Wait, what?  Yep, Midway has included a new mini-game for Armageddon in the form of Motor Kombat., a kart racer.  Players choose from one of ten characters, including Jax, Scorpion and Cyrax, and take their unique karts around one of five tracks, all of which have individual ~fatality~-inducing traps.  These include scalding lava, bottomless pits and being crushed by rolling boulders.  As players fly around these tracks, they'll be keeping an eye out for red Koins (which they can use to unlock items in the Krypt) or green lightning bolts, which provides a speed boost to the karts. You'll also want to ride over the gold stars, which let you fire off kart-specific weapons such as Scorpion's spear or Sub-Zero's freeze ball to cause havoc to your opponents.  It's decent, but not as fun as Chess Kombat or Puzzle Kombat, the two previous diversions included in Deception.  In fact, you may wind up going through each track once or twice with your favorite racer and never look at this feature again.   New arenas, outfits and music are just some of the unlockables in Armageddon. As I said earlier, collecting items within the Konquest Mode will unlock alternate costumes and music tracks within the Krypt mode.  Armageddon's Krypt abandons the grave theme in favor of an underground dungeon with locked elements embedded in the walls, which can also be unlocked by koins that you've collected from the various game modes. Unlike Deadly Alliance and Deception, Armageddon's Krypt is the smallest one yet, with only 280 unlockable items within the hidden archive.  However, unlike the previous games, most of these secrets relate specifically to Armageddon itself -- You'll find a lot of character sketches for Konquest mode characters, fighting arenas, and even early fatality designs.  You'll also see blooper movies and concept movies.  It's nice to see, but compared to the other Krypts (which have held 676 and 400 secrets, respectively), it's feels like a little bit of an afterthought.    Round 1 -- Fight!   At first glance, the Kombat mode for Armageddon can be somewhat daunting to behold, simply because of the sheer size of choices available to you: You're immediately presented with 58 of the 62 playable characters aligned across 8 separate rows on the character select screen (The remaining four characters are unlocked by fulfilling various tasks in Konquest mode). Filling most of these slots at the top are many of the male fighters from previous Mortal Kombat titles.  These range from fan favorites like Scorpion and Sub-Zero to newer included fighters like Mavado and Bo' Rai Cho.  Immediately below them are the female warriors, such as Sonya, Kitana and Frost.  Pulling up the rear are the boss characters and more monstrous figures, such as Onaga, Shao Kahn and Moloch.   Regardless of the character you choose, each one has eight fights to win before they can claim victory over the other warriors.  Veterans of Deadly Alliance and Deception will notice a number of new fighting mechanics within Armageddon that will make them rethink their in-game strategies.  For one, the defense meter from Deception (which was relatively useless in that game) has thankfully been removed entirely.  Second, along with the three combo breakers that return from Deception, players have the opportunity to parry incoming blows by hitting block and the back direction at the same time.  This will spin your opponent around, giving you a second or two to unload a quick throw or combo on the defenseless fighter, even potentially juggling them in the air.   Aerial Kombat finally returns to the MK franchise. Juggling is actually an important tactic, because aerial combat, which hasn't really played a significant role in the game since MK II, makes a return in Armageddon.  Not only will you find some fighters landing multiple punches or kicks on an opponent in mid-air, but you can also throw some enemies down and bounce them right back up to you to continue your weightless battle.  While you won't be able to fight an entire battle in the skies, it does make those players who rely solely on jump kicks have to learn new tactics, because they will easily get sent crashing down to earth. Unlike Deadly Alliance and Deception, characters have had their fighting styles paired down from two hand to hand and one weapon style due to the sheer size of the fighters involved -- it would've been a nightmare to come up with 120 fighting styles and accurately model all of them.  In Armageddon, most characters have one martial art style and a weapon, although some of the larger ~monster~ characters have only one available to them (Onaga and Moloch in particular are ~restricted~ in this manor).   If you've become used to rotating some of your most powerful combos between all three styles, time to relearn your battle sequences. Similarly, if you're playing with a character that hasn't made the jump from the arcade games to the console games, now's the time to brush up on your controls in the practice mode. However, if you've become used to dial-a-combos or auto-chaining your moves together, you'll be relatively comfortable pulling out the special moves in Armageddon; if you aren't, you'll still be able to trigger a number of fairly painful attacks if you know when to use specific punches and kicks. Players used to the multiple areas for fighting stages from Deception will recognize some stages that will make their return in Armageddon, such as the Falling Cliffs, Nethership Interior and Hell's Foundry.  These have been joined with new stages such as the Bell Tower (where you can send your opponents ringing into a massive bell or gongs arranged around a tower), Subway (where you can fling an enemy onto the tracks of an approaching car) and Netherrealm Hell (where you can fling players crashing down onto platforms while demons scream around you).     Goro's going to meet his maker thanks to the interactive Subway environment. The last change, and perhaps one of the most intriguing ones, is the remake of the fatality system into the Kreate-A-Fatality system.  Instead of inputting a specific button combination and sitting back to watch your character kill his or her opponent, you're now given a specific amount of time to continually input a sequence of buttons to literally dismember your foe. There's a catch to the time sequence though -- as more sequences are recognized, the amount of time that you have to chain together the next move rapidly decreases.  If you don't actually perform the killing blow in time, you can actually ~fail~ the fatality.  Just about any player will be able to perform a one hit fatality, but really skilled players will be able to pump out nine or ten hit kills.  Some players will probably miss watching these fatalities instead of having to trigger them, but this is a great way of testing your timing and gauging how proficient you are at the game.    Fortunately, many of the cheap AI issues that plagued Deception and Deadly Alliance have been fixed in Armageddon.  In some ways, Onaga and Moloch are no longer the cheap behemoths that they once were now that they're playable characters, and it's much easier to go through classic cheap fighters like Goro and Kintaro.  The game still isn't a cakewalk, and Blaze will still give you a headache until you figure out how to best land blows on him with your particular character's attack set.  But as far as wanting to throw down your controller in anger -- you aren't going to experience it in the same manner with Armageddon.  What you might have an issue with is the endings for some, if not most of the characters, especially after only fighting 8 characters.  For a game that's supposed to kill off some characters and be the final culmination of the series on the current gen, it feels like a copout.  I'm not talking about trying to figure out which actual storylines from the game are probably going to carry over to the next MK title (you'll probably be able to guess once you've played through the game); Instead, I'm talking about simply watching your characters perform a kata while their ending is voiced over for anywhere between 15-40 seconds.  Why not include actual cutscenes that show certain characters getting killed or even a return to the static images that show who lived and who died?  After a while, finding out who gets trapped in a realm or people that destroy one particular thing feels a bit disappointing.   Kreating Your Own Legacy   Fortunately, you have the ability to completely undo some of the weaker endings and characters within the game thanks to the massive kreate-a-fighter mode.  Let me say that again: the kreate a fighter mode is massive.  For instance, I sat down over the course of two or three days and played through just about every single mode in the game, including beating the kombat mode twenty or thirty times straight and still unlocked only about a third of the options that you have available to you for character creation (and that was simply on the male side of the mode!).  Not only do you have the ability to define basic elements such as the physical size, appearance and facial features, you get to tailor everything from their fighting and weapon styles to special moves.  You even have the chance to choose their victory stance and write a biography for your fighter, which will be displayed upon the screen whenever you wind up beating Blaze at the end of the pyramid.   He-Man and millions of other characters are potentially creatable. This mode is insanely deep, and pretty much limited only by your imagination (and the number of profiles you create).  As you've probably seen in other pieces we've done on the game, we managed to create the Hulk, but we've also spent time creating other comic book characters, historical figures, and even co-workers.  Not only can you pit your personally made fighters against the game to see who's best, but you can also take these warriors online to see which one is best.  Needless to say, kreate-a-fighter will provide you with much more play than the initially included 62 fighters will.    Mortal Kombat: Armageddon may not be the definitive collection since it does leave some characters out, and some of the final endings may be weaker than others.  However, the inclusion of 62 total warriors is a massive achievement.  Throw in a fun, albeit short Konquest mode, a diversionary mini-game, a new fatality system, and perhaps one of the largest character creation modes we've seen, and you have a great title that will keep Mortal Kombat fans busy for months.", "date": "Oct 10, 2006"}