{"name": "Bratz: Forever Diamondz", "name_review": "Bratz: Forever Diamonds Review", "ref": "https://www.ign.com/articles/2006/10/10/bratz-forever-diamonds-review", "text": "Asked to name a brand of doll, most people would think of Barbie. The venerable blonde figurine was first manufactured by Mattel in the late 1950s, and has had a legacy of success with now nearly five decades' worth of young girls. She's been around the longest, so it's natural to assume that Barbie's still number one - but she's not. A newer, younger group of characters came onto the scene in 2001. Sasha, Cloe, Yasmin and Jade are the Bratz, the stars of an MGA Entertainment fashion-accessorizing doll line that has eclipsed the sales and popularity of Mattel's Barbie brand in less than five years. The Bratz girls have dominated in toy stores, but have also broken out of the pink plastic packaging with CDs, movies and video games. Their latest, Bratz: Forever Diamondz, is a simplistic collection of mini-game challenges strung together with a loose storyline and linear location progression - so where the girls may have their looks perfectly coordinated in those coral-colored toy department aisles, their DS debut is a definite fashion clash.   Forever Diamondz finds the Bratz entering a road trip competition, with just three days to make it from Stylesville, California to New York City. They'll need to stop in cities along the way to shop for the latest fashions and assemble a show-worthy collection, because they'll have to walk the runway to display their purchases when they arrive in the Big Apple. With a good enough showing, the team will take home the grand prize - a pair of diamond-studded go-go boots.    Any potential traveling sequences get the ax in this presentation, though, with static cut-scenes quickly moving the girls from one location to the next. There are only three stops on the trip, each of which hosts a handful of mini-game sequences. The mini-games represent the core gameplay of Forever Diamondz, and doing well in them earns money that can be re-invested in new outfits for the girls.   Most of the game designs employ stylus control, with patterns to trace projected on the touch screen - the ~strike a pose~ photo shoot competitions, snowboarding and figure skating games are handled this way. Other use the stylus for character movement, as seen in Star Fox Command - including a first-person perspective dogsled event and an equestrian obstacle course. The similarities in control style between mini-games makes it feel as if there are fewer unique events than there are, which is made worse when considering there's only about 15 mini-game designs featured altogether.   A small class of side activities starring the Bratz girls' dogs and cats serve to break the monotony, but not for long. Voice commands are used, Nintendogs-style, to communicate with the Petz in animal-based fashion shows and agility races. There's none of the depth of Nintendogs, though, and some questionable knock-off gameplay that seems put in as an afterthought - you can throw a tennis ball around with your pet puppy, but it has all the physics of a half-deflated balloon.    And in the end, Forever Diamondz is about as much fun as a sagging, helium-depleted party favor. There just isn't a lot of excitement here, and what fun there is to be had is over much too quickly - the entire game can be completed, start to finish, in about an hour. Some of the title's mini-games can be played in a two-player head-to-head mode, and outfits can be traded wirelessly from one DS to another - but even this is critically limited, with only about 25 different fashions to be found in the game.  Bratz: Forever Diamondz serves as a playable counterpart to the newest Bratz-branded straight-to-DVD movie, but there's just not much playability here. Young girls who share the Bratz characters' passion for fashion would be better off simply adding another of the dolls to their collection, rather than wasting time with this shallow array of mini-games.", "date": "Oct 10, 2006"}