{"name": "Azure Dreams", "name_review": "Azure Dreams", "ref": "https://www.ign.com/articles/2000/02/25/azure-dreams", "text": "Konami was obviously heavily inspired by Lufia II's ~Ancient Dungeon~ when it had Azure Dreams in mind.  This version of Azure Dreams is a port of 1998's Playstation game, and feels right at home on Nintendo's beloved handheld. That doesn't mean it's a great RPG -- there are a few elements here that put this game in the ~above-average~ category.  Features Search the Monster Tower or wander around town Breed and ~Fuse~ together familiars Random ~Monster Tower~ floor layouts For Game Boy or Game Boy Color    In Monsbaiya, a seemingly quaint town, everyone is gripped by the promising riches of the nearby Monster Tower.  Treasure hunters constantly come and go, and all have one thing in common:  They want to find whatever secrets lie inside the immense structure, seize the treasure for themselves, and leave alive to lay a claim to fame.  Kou, the young main character, knows all too well what perils the tower holds.  Years ago, his father was one of the treasure hunters who left to search the mighty construction.  He left one day on a journey inside never to return.  Presumed dead, Kou's father gave his family little choice but to move on with their lives -- until Kou's 15th birthday. Now that he has come of age, he is old enough to enter the tower and discover for himself what the truth is.  Along the way, monsters of all sorts will get in his way, and there will be little choice but to collect the large number of items that lay spread over each floor.  As I think of this game, I can't help but be repeatedly reminded of good ol' Lufia II.  If you've ever played it, try a little of this on your Game Boy and see if you can find much other than subtle differences.  I, for one, absolutely loved the bonus ~Ancient Dungeon~.  I swear, I must have spent over 30 hours on that Super NES game alone.  But now that the dungeon has been twisted and warped down to portable size, I don't know if this clone is pulled off quite as well.  The only two areas you are allowed to enter are the town, Monsbaiya, or the behemoth Monster Tower.  In town, your main goal will be to sell off any excess items you've discovered while searching for your father.  As your gold builds up, you are allowed to buy goods, which range from useful items to magical orbs and basic swords and shields.  Watch what you spend in town, though, because you are allowed to take only five things with you each time you enter Monster Tower.  If you don't want to sell some of your things, take them to your mother, and she will store them for you in a safe.  Unless you discount a weapon and a shield, you are really allowed to take only three things with you when you enter the humongous building.  Wait, no, that's wrong.  Chances are that you'll want to take a familiar with you, because without one, things will be much more difficult.  But wait again.  When you start the game, you may take only one with you, but as you progress, you will be allowed one more (at about Floor 10).  The more you take, the more item spaces are filled.  So really, all in all, you can take in just next to nada.  Don't whine, there are plenty of items everywhere.  It's hard to move five spaces without seeing something you can pick up and add to your inventory.  Objects of all kinds decorate the floors;  whether you're looking for something you didn't want to buy in town or not, chances are you'll find it here.  You will occasionally need to give your monsters items to replenish their MP, but HP is rarely a thing about which one needs to worry.  Certainly you'll find seeds and herbs to restore your health, but most are pointless because your hit points quickly regain simply by walking.  Some of the items you may find: Glasses:  This type of item reveals things to you.  For example, a particular type may let you view the floor's entire map, while another may let you see where traps lay.  Seeds/Herbs:  These have an effect on health, status, etc.  Bags/Oils:  These have an effect on your armaments.  ~Sand~ bags are used to temper, while ~Oils~ prevent rusting.  Weapons/Shields:  These are used to damage enemies or defend against damage to you.  Orbs:  Each of these has a limited number of uses.  When you use an orb, you invoke a special power which may damage or affect your foes' abilities, depending on the type.  Eggs:  From these, one may receive new familiars.  Other:  Feathers, bells, crystals, etc, all have different uses.  The feather brings you automatically to the next floor, the ~Tamebell~ calls a lost familiar to your side, and a Wind Gem returns you to town.  So it doesn't disappoint its players, Monster Tower is home to just a hair short of one gazillion monsters.  The place is packed with baddies in each floor, and you'll have to battle plenty if you want to advance.  Unlike most other RPG battle systems, Azure Dreams doesn't exactly have a battle menu, per se.  If you are close to an enemy, you attack it by pressing the A button or use an item.  If you choose to attack and your familiar's AI is set so it is aggressive, it will attack for you.  However, if it is made to standby, you will use whatever weapon you, yourself have equipped.  If your foe lives, it will answer with an attack of its own.  Familiars are completely devoted to serving you.  The first one you receive, Kewne, used to be your father's.  Once you are about to enter the tower for your first time, he will approach you and tell his story:  He was with your father the day he disappeared, has amnesia, and is willing to help you find him.  Familiars are absolutely necessary, because each time you enter the tower, your level is reset to 1.  However, your trusted monsters, such as Kerne, remain at whatever level they were before you exited Monster Tower.  As you search the tower, you are likely to collect several eggs.  Once you warm one, you may either send the familiar you receive back to the stable or keep him with you.  You have room for only five different creatures.  To empty a slot, it may be advisable to ~fuse~ familiars together.  From this, your monsters may be merged.  If, for example, a Wump is merged with Kewne, Kewne will be reborn with one of the Wump's special abilities in addition to his own.  Your allies come in one of three different classes:  Fire, Wind, and Water.  Each one has its advantages and disadvantages against others of different types.  For example, a fire monster would be strong against attacks from a wind monster, whereas it would be weak against a water monster.  In addition, your familiars' aggression may be customized.  In the ~Plan~ menu, you may set each particular familiar you own to a number from 1-5.  If Kewne, for example, is at ~1~, he will stand in place and do nothing.  But if he is at ~5~, he will roam around and pick fights with everything he can see.  On each floor, traps are also hidden underneath specific tiles.  Unless the proper item is used, one can never tell where they will be, and this can be annoying.  In most cased, traps are harmless.  You may be put to sleep, paralyzed, or poisoned; these are very minor.  One trap, however, could make or break things for you.  If you step on the wrong tile, your familiars will disappear until you exit the floor.  Kou isn't exactly the strongest fighter on his own and really needs the extra push that his companions give.  Once you make it to the end of a floor, which isn't very difficult to do, you are given to option to save;  other than talking to Kou's mother, these are the only places in which you may do so.  A screen appears which tells you what floor you are on, how much time you have spent total on gameplay (finally, a Game Boy game with a clock!), and other statistical information.  In addition, each time you enter Monster Tower, you will have a different experience.  The reason for this is that each time you arrive at a new floor, the one on which you happen to be is randomly chosen.  You will never know how the next area will look, nor will you know what or where the items will be.  Naturally, as you go deeper up into the tower, the difficulty of enemies will increase.  Following the common trend of portable gaming as of late, Azure Dreams also allows players to exchange monsters with one another via the Game Link Cable.  If you have a familiar that a friend is just dying to have, you can either give it to him/her or ask for money.  Although it's a nice addition, a two-player battle link mode would have been much more ideal.  Azure Dream's highpoint is that you'll never have the same adventure twice.  Because floors are random, gameplay is very unpredictable, leaving you to rely on yourself rather than memory.  Moving from one area to the next is entertaining because different items are all over.  Just knowing that something you want could be around the next turn generally leaves the player searching the entire floor, from top to bottom.  Unfortunately, it grows old after venturing through Monster Tower multiple times.  There is little character interaction, the story is ho-hum, and one will find him or herself constantly fighting a never-ending stream of monsters.  The gameplay really is not complex once the rules are learned, and ends up a bit lacking as a result.  Had there been more to do in addition to climbing the one tower, it would have been more fun.  Konami should have had more towns, more characters, and some side quests which would have helped to build the nearly nonexistent plot.  For a Game Boy game, the graphics are nice.  There are plenty of floor designs, numerous characters, and lots of enemies, each with its own appearance.  Every once in awhile when you speak with another person, the conversation will be represented by a facial image of the male or female to whom you are talking.  The visuals don't go over the top, nor does the music.  Both are standard but pleasing.    This game just screams ~Lufia II's Ancient Dungeon!!!~  Unfortunately, it's not quite as good.  That's actually a little funny to me, because Lufia II was made years ago, and the Ancient Dungeon was just something extra added in.  Despite that, Azure Dreams is still a fun game -- but Konami needs to be slapped on the wrist for stealing a great idea and making it a little bit worse.  If the Ancient Dungeon, and it alone, were ported to Game Boy, I'd purchase it in half of a heartbeat.  That was the pinnacle of random dungeon design.  This?  It's not bad, but no comparison.", "date": "Feb 25, 2000"}