{"name": "Asphalt 3", "name_review": "Asphalt 3: Street Rules Review", "ref": "https://www.ign.com/articles/2006/10/13/asphalt-3-street-rules-review", "text": "Gameloft's Asphalt racing franchise has been a consistent source of quality on mobile, especially the impressive 3D edition of Asphalt: Urban GT that kicked off Verizon's VCAST service last winter. (Gameloft also created a real-time multiplayer edition of the game that was criminally ignored.) For the third installment of this trilogy -- that's surely to be a quadrilogy around this time next year -- Gameloft assumes the street racing atmosphere that took over the driving game scene in recent years. Melding police chase elements from the second Asphalt with some over-the-top presentation, Asphalt 3 is a rock solid racer marred only by a bizarre design choice that undercuts the efforts of the mobile maker's obviously talented visual team.   Asphalt 3 stretches its street race mayhem around the globe, stopping off in exotic locales like St. Petersburg, Tokyo, and Bombay. However, with instant gratification being an integral part of the mobile formula Gameloft doesn't make you work very hard to enter the upper echelons. Within just a few races, you're behind the wheel of a quality ride like the Aston Martin V8 Vantage and have a garage full of parts to do some amateur tuning. This generosity immediately hooks the player. But to get some of the game's flashiest cars, like Lamborghini LP 640, you actually do need to put in some time.   Fortunately, with a healthy amount of tracks and race modes, unlocking the sleeker cars and motorcycles (such as a Ducati) is hardly a chore. The track length is perfect for mobile. You can burn up a challenge in just a couple minutes before getting back to the day. Modes include basic racing, the crash-'em-up Beat 'Em All where you are directed to cause a specific number of collisions that result in wrecks, Cop Chase to avoid the police, Cash Attack to see who earns the most money for performing outrageous maneuvers, and Duel mode against rivals. Since there are four challenges in each city, Asphalt 3 mixes up the different race modes offered. Some cities won't have a Cash Attack, for example. The objectives in these modes are different enough to keep things relatively fresh for players just go from one end of the game to the other.   However, you won't see the best parts of Asphalt 3 unless to perfect your techniques and re-race events to get perfect scores. The better you do in a race, the more money you earn. This money gives you access not only to cars and parts, but also women. Gameloft, the great winking objectifier, actually offers you a series of femme fatale co-pilots that join you if you have enough money to make it worth their while. These ladies do have in-race benefits to complement their gravity-defying breasts, such increases to speed and handling. (If this feature returns in Asphalt 4, I think it would be a lot of fun to include a chiseled dude.)   The police element works well. The crazier you are on the track, the more heat you attract. By the time your wanted meter is full, the police are chasing you down with numerous cruisers and setting up roadblocks. But Asphalt 3 takes this a step further and includes a news reporter (sexed-up female, of course) that follows your exploits in a helicopter. The more exciting her footage is, the more money you earn. It's silly, it's over-the-top, but it's also just part of the fun.   Asphalt 3 is a good upgrade over Urban GT 2, thanks to the extended race modes and extra goodies, but it doesn't reinvent the wheel at any point. This is an evolutionary upgrade, so fans of the second installment may get the occasional feeling of deja vu -- especially with the wanted meter. However, if you skipped numero dos, Asphalt 3 provides some eye-popping moments of amusement. The game doesn't take itself too seriously, what with the curvy ladies and a garage befitting the Sultan of Brunei, and that good will spills over from the screen.   What puzzled me most about Asphalt 3 was the decision to use polygonal objects alongside the track to populate the scenery. The backdrop is a hand drawn city vista, but as you roar down the winding lane, really basic geometric shapes fly by. For example, in the Las Vegas track, a two-toned pyramid is supposed to approximate the Luxor, but it's just ugly. So are the cube trees. With good-looking cars, bight colors, and otherwise excellent presentation, these rudimentary polygonal constructs look like leftovers from 2004 attempts at 3D. This is hardly a game killer, but it does ruin some of the graphical buzz.  Asphalt 3 is a silly, sexy racer that offers some real high-speed thrills. The amount of content in the game makes it an exceptional value, too. (Asphalt 3 kept me company this morning while waiting in line to pre-order a Nintendo Wii.) My favorite event was the Beat 'Em All, which tore a page from the Burnout playbook, but even the basic races are still a lot of fun. As mentioned, this does not significantly advance the ball from Asphalt: Urban GT 2, but I didn't get the retread vibe here like I felt with Splinter Cell: Double Agent. Racing fans should add Asphalt 3 to their garage.", "date": "Oct 13, 2006"}