{"name": "Tiger Woods 07", "name_review": "Tiger Woods PGA Tour 07 Review", "ref": "https://www.ign.com/articles/2006/10/14/tiger-woods-pga-tour-07-review-4", "text": "I am Tiger Woods.    Or I am an out-of-shape, purple-haired freak show with a bigger gut than Brando. Or I am a sexy cheerleader with a man-voice and a skin disease. Or I'm a blonde, heavy drinking, heavy-hitter that's just plain heavy.    God, I love creating characters in Tiger Woods PGA Tour 07. (That last one was actually John Daly.) In Tiger 07, EA creates the golf game that Tiger 06 should have been, with a stellar -- albeit brief -- course list, some gorgeous visuals and challenging gameplay that will have you scrambling for par. Don't believe me? Find out from Tiger himself in our IGN Sports interview.   Yes, I said ~challenging~ in a Tiger review. That's mostly due to the True Aiming system. Gone is the arrow indicator you could stick on the stick for an automatic birdie. These days, you aim for an ~area~ on the links, marked by circle as you line up your shot. How big that circle is depends on how much time you've spent on the practice green. From 200 yards out, Tiger can hit a soft four iron right next to the pin. But Blanche LaDouche, your transvestite created golfer in a brushed-cotton polo, will have an aiming area the size of John Candy.    I am Tiger Woods? This calls for course management, and not the off-the-sprinkler-head, over-the-trap, nothing-but-net course management we've seen in previous Tiger games. Off the tee, inexperienced golfers may choose to hit that three wood because the aiming area is entirely in the fairway. With the Big Bertha, on the other hand, the aiming area may include a bunker or the long grass. It's a numbers game, and you'll be forced to gamble plenty. Even if you hit a perfect shot, you have a random shot at landing anywhere in that aiming area.   On tough pin locations, you may have to aim for a safe spot on the green and two-put your way to a par. Like real golfers, you'll have to pick and choose your birdie holes; some of them just aren't possible without sinking a long, long put or getting impossibly lucky, or both.    The swing mechanics have been tweaked a bit -- fade and draw is controlled during the back swing by pulling back slightly left or right. You can alter loft on the right stick as well. The nice thing about the controls -- other than being extremely user-friendly -- is that they are as difficult as you want them to be. If you swing like Greg Norman under pressure, bump the difficulty to easy and relish in the glory. If you are more motivated, like, say, Phil Mickelson with lunch waiting, bump the difficulty up. Slight hits to the left or right will result in controller-rumbling duffs into the rough, or worse.    Putting uses the familiar grid system and can be fairly challenging on sloping greens. You'll even miss your fair share of one-foot gimmes on the fastest greens. Early on, a frustrating amount of three puts will leave you battier than David Duval.   Monty goes HD and next-gen. The learning curve is what makes the gameplay of Tiger 07 so fun. Well, maybe learning curve isn't the best phrase to use; we've all shot in the low 50s in previous Tiger titles. EA put a tremendous focus on building your character and guiding him or her through a long, eventful career. And thankfully, the career mode is as deep and fun as it's ever been.    First, there's the practice range, a fictional collection of tees, targets and holes built to frustrate and confound you. This is also where you will build your attributes in fields like power, putting, approach and recovery. For each attribute to improve, there are a number of different mini-games to play, like long-drive contests and games of T-I-G-E-R, EA's answer to basketball's Horse.      Then, there's the old Tiger Challenge, a series of 20 matches against both real and fictional golfers, like Vijay Singh and Alexi Eichelburg, a body-builder clad in a weight belt who screams like Monica Seles during a forehand. Early on, you'll have no problem taking out the likes of Pops Masterson and the rest of the push-overs, but then you'll run into guys like John Daly and suddenly end up dormie 5. There are natural obstacles you'll run into throughout the career, and you'll have to head back to the range to build up your skills. Then head to the pro-shop to purchase the latest and greatest equipment, get a tournament or two under your belt on the PGA Tour, and come back to take revenge on the Blonde Bomber.   It's an addictive set-up, to be sure, but the real fun is in the PGA Season mode. Tiger feels more like a traditional sports game than ever because of this new mode, which mirrors the FedEx Cup, complete with FedEx points, rankings and the PGA Championship at the end of the year. The PGA deserves all the credit for this as the new format allows for a playoffs and Super Bowl-like atmosphere at the end of each season. This carries right over into Tiger 07.    Nothing is a sure thing with True Aiming, unless you're Tiger. Visually, Tiger 07 is beautiful. The courses are exquisitely detailed and rendered beautifully. I was looking at a snap shot of the Old Course at St. Andrews and then in the game and the view was eerily similar. The real-life characters are some of the finest player-models in all of sports-games, led by Tiger who, thanks to the new Universal Capture, is now the most realistic model in all of videogames, period. EA nailed his mannerism, facial ticks, expressions and that trademarked smile.    EA also added in a crowd for atmosphere, so now the huge screams after a long drive can be attributed to something other than the trees. The crowd will actually track the ball in flight and walk to your next shot. Fans also act as a nice buffer on some tee shots as they are often plunked by errant drives, resulting in comical, painful reactions. As good as the crowd looks, they do some equally stupid things, like applauding during the backswing or standing in the line of fire. Fans will also be a bit robotic at times, clapping perfectly in unison and mirroring each other's movements -- no big deal, but a bit creepy.    PIP shows the agony, the ecstacy and the sun-spots in action. Still, the roar of the crowd, the funny comments from the peanut gallery and opponents alike, and the banter between David Feherty and Gary McCord make for a great tournament atmosphere with a touch of Tiger humor.   The course list now features 12 options, double the six courses of Tiger 06, which was a disappointment, to say the least. Pebble, Pinehurst, Carnoustie, Turnberry, St. Andrews, Spyglass, The Prince Course, TPC at Sawgrass, Bandon Dunes, Riviera, Firestone and Glen Abbey all make the list, and all present a different challenge. The next-gen hardware has also helped EA add a lot of variation in the terrain, so you'll notice a lot of rolling hills and interesting lies to hit from.    The golfers include Tiger, Rich Beem, Daly, Chris DiMarco, Luke Donald, Jim Furyk, Reteif Goosen, Justin Leonard, Colin Montgomerie, Ian Poulter, Adam Scott, Singh, Mike Weir, Michael Campbell, Annika Sorenstam and 10 fictional characters. You can, of course, create your own misfit, complete with positive and negative reactions, swing type, and the mohawk of  your choice in the excellent Game Face create-a-character tool.    Tiger also features ESPN Integration, including updates from ESPN News and ESPN Radio, and a healthy online mode featuring daily tournaments and a variety of game modes like one ball and battle golf.   EAs hit is stiff and nails it. Although the course list pales in comparison to the Xbox and PS2 versions of the game, you'll never need more to do thanks to an addictive and robust career mode. The courses and golfers all look amazing, while Tiger stands out as picture-perfect thanks to the new UCAP technology. But, most importantly, the gameplay keeps what we love about Tiger and adds True Aiming, which calls for course management and a bit of strategy. Finally, there is a bit of challenge built into the game and you'll have to earn every victory on tour and in the Tiger Challenge. But eventually you'll max out your stats and start plugging hole-in-ones. Hey, this is still a Tiger Woods game.", "date": "Oct 14, 2006"}