{"name": "FIFA 07", "name_review": "FIFA Soccer 07 Review", "ref": "https://www.ign.com/articles/2006/10/14/fifa-soccer-07-review", "text": "There wasn't much time between the last EA Sports soccer release and the current one -- a couple of months is not much time in development circles, especially in handheld design, so to expect a whole new unique experience in FIFA Soccer 07 beyond what was offered in FIFA World Cup 2006 back in the summer would be wishful thinking. However, FIFA World Cup was already a very solid foundation, and the tweaks applied to that engine for the new DS generation strengthen an already strong property. But because it's a modest upgrade it might not be enough to get owners to snag this new version.   The developers of FIFA Soccer on the Nintendo DS -- European-based Exient -- has been at it since day one with the property on the dual screen handheld. The team had been put to the task of trying to come as close to matching the versions of FIFA on current generation consoles and the PSP. The Nintendo DS, obviously, doesn't have nearly the hardware prowess to pull it off, but the DS development team plugged along with a version that could make DS owners proud with a version of soccer that's at least full-featured and fun to play.  Comparing the game to the Xbox, PlayStation 2, GameCube, and PSP versions is definitely a losing battle for the Nintendo DS game -- to play it you'll need to be a little ignorant to those versions and openminded to what's going on in the dual-screen portable version. But at the very least, the Nintendo DS version has enough that lets it stand on its own.   The gameplay is where FIFA 07 counts, and luckily this soccer game is still a fine playing version of the sport. Control is tight both on offense and defense, computer AI handles teammate positions well for passing opportunities, and the game's a lot more lenient on legitimate slide tackles. This last part makes things a lot more fun and aggressive -- yellow and red cards will still fly for obvious tackles, but for the most part the move is allowed a lot more in situations where it shouldn't be called.    Of course, there have been some significant additions to the Nintendo DS product to take advantage of the system capabilities. We still haven't gotten a version online yet, so here's hoping for a Nintendo Wi-Fi Connection mode for FIFA 08. But for now, the biggest addition is the game's ~custom chant~ feature you can record a voice sample and tweak it as a chant to be played at anytime during the action with a touch-screen tap. It's a simple addition that doesn't really need to be there, but hey...why not. It's fun to throw a little personal flair into games. There's also an art program to doodle up your own team logo Unfortunately, one of the greatest features from the first FIFA still has yet to make a return: the single cartridge multiplayer is still not here for 2007, which is a shame because that feature rocked in FIFA 2006 and made multiplayer match-ups much more likely than ones that require players to go out and buy a copy just to compete.   With each version the graphics have definitely improved, and it's the case with FIFA Soccer 07, and thankfully the framerate problem that plagued World Cup 2006 has been ironed out for this release. Players and stadium environments are slightly more detailed, with character animations that are a little more fluid to allow for tighter and more versatile moves on the field. It's safe to say that this year's version is the best looking edition of FIFA yet on the Nintendo DS system, even if it's still a few notches below current generation consoles due to the weaker hardware.   With the newer version, the presentation has also improved. Play-by-play commentary is still restricted to a simple library of generic voice calls, but there's more here than in past FIFA games which definitely keeps the chatter fresh with less repetition. The camera cutaways during goals and penalties are a lot more dynamic and television style, though when the camera gets in tight a lot of the visual restrictions, like low poly models and low resolution textures on the faces, become a lot more apparent.   The FIFA series started strong last year, took a slight dip during the World Cup, and now it's back for 2007. Its impact isn't as strong as the first go-around, but it's still pretty significant. It's a good continuation that builds upon the version released just a few months prior. There's still room for improvement and with the Nintendo DS continuing to gain momentum in the market a 2008 rendition next year is almost inevitable. And when that happens, we expect online play. No excuses this time.", "date": "Oct 14, 2006"}