{"name": "California Speed", "name_review": "California Speed", "ref": "https://www.ign.com/articles/1999/03/20/california-speed", "text": "Midway's California Speed, developed by Atari Games (of San Francisco Rush fame), is a Cruis'n World-esque racer with emphasis on mindless driving and lots of speed. The game originally made its mark in the arcades and, after a successful run, Midway green-lighted a port of the title to Nintendo 64. The game, believe it or not, has actually been dumbed-down for its 64-bit release.~California Speed is aimed at a younger audience,~ says Midway, and that's understandable enough. And, if we are to base our review of the game with a younger audience in mind, it's not all that bad. California Speed serves up a variety of off-the-wall tracks, unbelievably simple driving mechanics and really doesn't require any learning curve -- or skill -- to master.Unfortunately California Speed for Nintendo 64, running on a mutation of the Rush engine, does not move nearly as fast as its arcade predecessor and fails to serve up anything new in the visual department. In fact, when it comes down to it, aimed at kids or not, the game simply isn't as good as Cruis'n World before it.The Facts Running on a variation of the Rush engine. 14 selectable tracks. Short-cuts and branch-offs in tracks. Tournament mode featuring backward tracks, mirrored tracks and backward-mirrored tracks. A plethora of vehicles to choose from including convertibles, F1-type racers and even a golf-cart. Customize vehicle option (similar to that seen in Rush 2). Split-screen two-player races. Unique game endings. Rumble Pak support.GameplayCalifornia Speed plays similarly to Cruis'n World, but with less shortcuts and no stunts or flips. Racing is straightforward and virtually void of any real strategy. The idea is to move ahead while avoiding the sides of track-walls and other racers. Oncoming traffic, strangely enough, does not present a problem as players can often simply drive right through it and take absolutely no punishment whatsoever -- not even a loss of speed. Meanwhile, the driving mechanics are so easy that most of the time players don't even need to steer; Crashing into center-divides and other cars does little to deter the motion of a vehicle. Only scraping against a wall continuously will actually result in a loss of speed. To reiterate and simplify everything above, California Speed requires no skill to play. As long as players possess at least one finger and the ability to use it, they can press the acceleration button and do alright for themselves. Control, via the analog stick, is optional.Oddly, for a game that's supposed to be aimed at a younger audience, the drones (or computer-controlled vehicles) are extremely unforgiving. For example, supposing a player screws up and, say, scrapes against a wall for a loss of speed, it's almost impossible to catch up with the competition. In fact, it's rather difficult to stay in the race even if one drives perfectly.We've obviously got some problems with California Speed's gameplay, but that's not to say that the game isn't enjoyable, even if it is a guilty pleasure. For some unexplainable reason, as if to defy logic, the racer does dish out small portions of, dare we say it, fun, in the very same vein that the Cruis'n series does. The 'younger audience' may or may not take to it, but it's almost certain that older gamers will not like the way this game works.MultiplayerThe game's multiplayer experience is strictly two-player split-screen. It's just like that seen in Rush and Rush 2, only cars feel a bit faster and, of course, stunts and tricks have been trimmed down. With Cruis'n World's four-player multiplayer action, one wonders why Atari decided not to up the available players to compete.GraphicsRemember the Stunt Track from Rush 2? Think back for a minute. Now visualize the bright, overexposed, animated colors and blurry textures. Imagine multiple levels made up in a similar fashion and you've got a good idea of what California Speed looks like. Incidentally, while the Rush games used multiple levels of detail for some of their textures, Cal Speed's textures pixelate terribly when they get close to the camera.Tracks, nearly all of which are based around fantasy-themed locations (but loosely based on California locations like Santa Cruz, San Francisco, Monterey, etc.), have the same look about them that is associated with the Rush franchise; blurry, colorful and with a framerate that, while acceptable, just doesn't quite do the trick. And while that's okay with the Rush series, which offers much in the way of tricks and stunts, when speed is your focus then you've got to have a framerate that emphasizes it.Vehicles, though not exactly polygon-intensive, are well-modeled and look realistic. Unfortunately, the specular-highlighting on cars featured in Rush 2 is absent from Speed. Rather, the game utilizes the standard effects from the original Rush title. Not bad looking in its day, but hopelessly dated by today's standards.SoundCalifornia Speed's music, though wacky in nature, is still much better than what we've had to sift through in previous Atari Games efforts, namely San Francisco Rush. The jams are upbeat and original, but they're not exactly something you'd want blasting out of your stereo speakers at high volumes. Videogame music -- the standard stuff.Sound-effects are sufficient as well. Atari implemented a nice selection of different texture-specific noises, so if a vehicle rolls over bumpy grounds, players will hear the difference from regular pavement. Otherwise, expect the typical stuff; screeches, bangs, crashes and the like are all represented adequately.California Speed is not a terrible racing game, it's merely average. Simplistic, extremely easy gameplay mechanics and generic, if not below-average textures and overall graphics. Kids might enjoy the game's easy learning curve and speed, but otherwise I don't recommend it, especially with Cruis'n World -- a better arcade racer that features more options and four-player modes -- already available. California Speed is the product of Atari Games' Rush engine -- an engine that, while great in its day, needs to quietly be put to rest.", "date": "Mar 20, 1999"}