{"name": "Billy & Mandy", "name_review": "The Grim Adventures of Billy & Mandy", "ref": "https://www.ign.com/articles/2006/10/17/the-grim-adventures-of-billy-mandy-4", "text": "Anyone who's watched even a single episode of The Grim Adventures of Billy & Mandy on Cartoon Network knows the show has some serious mental issues. Whatever series creator Maxwell Atoms is smoking, we're convinced it was worth every penny, as the show's characters, situations, and overall style is totally off the wall.  From a melodramatic grim reaper to a hilarious nacho-loving character named Fred Fredburger that could be the distant relative of Futurama's Dr. Zoidberg, the show is absolutely A.D.D. friendly.  In fact, we're sure that's why the series is doing so well, and it's that same random Ren & Stimpy style in the show that we wanted to see carried over into the game.  Amazingly enough, it has been, as The Grim Adventures of Billy & Mandy is a solid button-mashing fighter, that - while not the deepest game in the world - definitely delivers the essence of the show.   For anyone not familiar with the series, The Grim Adventures of Billy & Mandy follows a style similar to PowerPuff Girls mixed with a bit of Fairly Odd Parents, adding in a dash of the aforementioned classic Ren & Stimpy.  In the premiere episode, Billy and Mandy stumble upon the grim reaper, who's stopping by to take Billy's sickeningly pathetic hamster to the land of the dead.  Though the kids aren't ready to give it up, the reaper insists, going as far as to challenge the kids to a battle over their eternal souls (in a more kid-friendly way, of course).  Amazingly enough, Grim fails, and has to hold up his agreement to be the kid's best friend forever.  From then on, it's all about random acts of hilarity and off-the-wall scenarios per usual in a children's show.   But all that really doesn't matter for the game.  Instead of making the millionth 3D action adventure, developer High Voltage went a different route, emulating 3D fighters such as Power Stone by making a free-roaming multiplayer beat-em-up.  Whether it's story mode, mission mode, or vs. mode, players will grab a character, drop them into a world, and beat the crap out of the competitors in a number of ways.     Hop on those  Each level has destructible elements, the option of turrets or traps, and multiple progression points that segue into sub-levels to keep the arenas fresh and entertaining.  Regardless of which character is selected, players can perform light and heavy hits, pick up objects or other players, perform double jumps, dash, and power up with Grim's ~Mojo~ powers to deliver huge combo attacks.  No matter who you chose, the gameplay will be centered around mashing out combos, triggering in-level events, dashing to items and weapons as they appear, and smacking the crap out of competitors.   Of course it doesn't take a genius to see where the game could become a bit shallow, as cranking out combos and running around the same levels over and over can get repetitive.  To keep things fresh, there are a ton of unlockable costumes, weapons, and gameplay modes that help the longevity of the product.  Players can attack baddies with maces, wands, halberds, swords, bones, hammers, clubs, and scythes, or fire from long distances with flamethrowers, goo cannons, mind control guns, plane-o-glass guns, and even a vacuum cleaner.  The list of total weapons grows as the game progresses, as does the ability to open up new battle modes for vs. play.     Within the vs. mode, players can select up to four different teams and any of 15 characters.  To mix things up, nine different modes can be selected once unlocked.  Some of our favorites include the classic Last Man Standing fight, which has players battling in either single or team competition to eliminate the opposition.  Other games include the ever-popular Bask-eye-Ball, Crush the Horde (which has players fighting a never-ending mass of AI baddies), Capture and Hold (multi-point king of the hill), and Skull Keeper (where everyone attacks the one holding the skull, hence the name).  The different modes add a ton of replay value to the game, and four player battles promise to be amazingly hectic.     The Grim Adventures of Billy & Mandy has a solid amount to offer fans of the series aside from the general gameplay as well.  The overall presentation is very strong, having the show's voice actors delivering 3D animated cut-scenes in story mode, and a fair amount of in-game dialogue as well.  The overall graphical style isn't as sharp as we'd like, but that's due in part to the limited power of the systems and the necessity for cell shaded artwork.  Even still, there's a ton going on at all times on the screen, and the effects and animations are still very strong, it's simply obvious that the franchise belongs on a high-res display to achieve the true look of the show.  As a final note on presentation, we love seeing Weird Al Yankovic as the announcer, as he bring a solid ~White n' Nerdy~ feel to the game.  Cheers, Alfred.  When it comes to dropping your hard-earned cash on one more GameCube or PS2 game before the holidays, you may want to really look into how much time is going to be spent with The Grim Adventures of Billy & Mandy.  On one hand, the game is very simplistic, offering a few different button-mashing attacks and some cool (but limited) interactive arenas to do battle in.  At the same time, there was a ton of work put into making this one go the distance, as there are new items, battle events, and character to unlock at every turn.  If youre looking for a single player game, Billy & Mandy can offer a relatively extensive Story mode and 45 mini events which unlock all the extras.  The game really shines in multiplayer though, which is where most gamers will find the package really being worth the cash.  For anyone unfamiliar with the show, you may want to pass this one up and save your cash for the holiday season.  Is the game a hit for youngins that are crazy for the show though?  In the eloquent words of Mr. Fred Fredburger, all we can say is YES!!  If that made any sense to you, this might just be a solid game for ya.", "date": "Oct 17, 2006"}