{"name": "Age of Empires 3 The WarChiefs", "name_review": "Age of Empires III: The WarChiefs Review", "ref": "https://www.ign.com/articles/2006/10/17/age-of-empires-iii-the-warchiefs-review", "text": "Ensemble hasn't made a bad expansion yet. Their approach has been to pile on lots more content without really trying to throw in a lot of new features. Given that last year's Age of Empires III was pretty fantastic, it's no surprise that the developers aren't inclined to shake things up too much with the latest expansion, The WarCheifs. While it gives the expansion a ~been there, done that~ sort of feel, it was so enjoyable the first time that we don't mind being there and doing that again.  Warchiefs shifts the focus from the Old World civilizations to the peoples who were already living in America when the first European explorers started to arrive. The Iroquois, the Sioux and the Aztecs are all in play now and each offers a slightly different flavor. Most missions in the campaign offer a chance to fight with and against a force composed of Native and European units. The Aztecs are only available in multiplayer unfortunately.   The Iroquois make use of a wide range of European style units, making them a nice choice for players who still want a bit of familiarity. The Sioux are like the Hun in Age of Kings, a cavalry-focused civilization with little need for complicated infrastructure. This gives them a mobility that's hard to counter. The Aztecs are almost exactly the opposite. Rather than relying on quick mounted strikes, they focus exclusively on infantry. It takes a while to get going with them, but once you get a feel for the different unit types, they're just as effective as any of the other civilizations.  The American tribes are certainly distinct from each other and from the Europeans, but we wish they had played a bit differently. Same resources, same basic unit types, same buildings, same home city concept -- it just feels like the developers changed the appearance and names of the European civilizations to fit the new American ones. Sure, we like the WarChief unit and the Fire Pits and the Sioux's lack of housing but there's nothing in any of the new civilizations that requires you to think differently about how you approach the game.  That doesn't mean that there aren't some interesting additions. The WarChief, for instance, serves as a sort of heroic explorer for the Native Americans. In addition to being able to grab treasures, the WarChief can also grant military bonuses to nearby units. This makes it much easier to make a quick treasure grab early in the game when you've only got a handful of fighting units. The WarChief even gets more powerful over time, so he can make the transition from exploration and treasure grabbing to serious fighting.   The Native American Fire Pit is an entirely new building that lets players gain some minor but notable bonuses. When you task your villagers on the Fire Pit, they'll begin dancing and generating power that can be spent to recruit new units, increase the combat damage of your units or even boost your population growth. While the individual benefits are nice to have under the right circumstances, the benefits of having a working Fire Pit are so low that you're often better off keeping your villagers assigned to regular gathering duties.  The European civilizations get some neat additions here too. The Saloon allows European players to buy mercenaries with gold. The mercenaries take a while to recruit but it's nice to have an extra building pumping out units every now and then, particularly when it offers a unit type that you don't have access to any other way. One of my favorite new units is the petard. These explosive units are really ideal for taking out big structures in a hurry. Unfortunately, the poor fool carrying the explosive is literally hoisted by his own petard and sacrificed.      European civs can also opt to declare Revolution instead of aging up to the Imperial Age. Revolts aren't to be entered into lightly however as they impact your resource gathering by converting all your villagers (current and future) into militia. Your economic home city shipments are replaced by more militia, ironclads and forts. Ownership of sufficient trading posts really makes or breaks this strategy. Still, if you can manage to pull it off, you'll enjoy a short but memorable military advantage over your enemies. You just need to be sure to make the most of it while you can.  The new campaign tells two more chapters of the Black family history. Part one revolves around Nathaniel Black and his role in the American Revolution. Part two focuses on Chayton Black's participation in the Indian Wars, from Red Cloud's War through the Black Hills War. In both chapters, the player will find themselves in some of the era's most well known battles, fighting with notable figures like Washington, Custer, and Sitting Bull.   Though both chapters are enjoyable, the second one is by far the better. There's much more ambiguity here in terms of loyalties and agendas which make the whole chapter much more emotional. You can't help but get involved as you watch Chayton struggle with his mixed Native American and European heritage while also trying to prevent a war that everyone else knows is inevitable. I particularly like how the later missions can still make you feel like you've lost even when you've managed to complete all of your objectives.  Most of the missions in the campaign follow the standard build-destroy format. You start small, establish a base, fend off early attacks from your neighbors and, once you're tough enough, go smash the heck out of your enemies. Fortunately, there are a number of twists and variations on the standard mission design by requiring you to rescue fleeing workers, escort wagon trains, earn experience points, collect tons of wood and other various tasks. There's even a mission where you work incredibly hard to get a base up and running only to discover that you're going to have to fight against it. It's quite awesome.  There are also a few missions that offer interesting resource problems. In some cases, you'll only be able to gather one resource and have to rely on trade and treasure to obtain the rest. While you can definitely rely on your marketplaces for this, the real trick to succeeding in limited resource maps is to grab and hold the trading posts. Some missions really put a priority on grabbing the posts. It can be a real challenge to hold onto them in the face of a highly mobile enemy like the Sioux.   Trading posts also feature heavily into the new trade monopoly victories available in multiplayer. Whenever a player (or team) owns more than half the posts on a map, they can buy a monopoly. Once it's purchased, the other players have a set amount of time to reduce the monopoly buyer to fewer than half of the posts on the map. While trading post attacks have always been a feature of multiplayer games, this new victory condition makes for much more anxious and wide-ranging thinking. Players who would prefer a more leisurely game can take advantage of the new computer-controlled truce periods that let everyone develop in relative safety for the first 10 to 40 minutes of a game.As we said at the beginning, Ensemble's not known for producing expansions that alter the strategies of concepts of their core games. Given the popularity and quality of the core games, who are you to argue? Fans of Age of Empires III who are just looking for more content are definitely going to be pleased with the expansion. Those who are hoping for something new or different aren't going to find it here. Some of the Native American concepts offer a nice twist, as does the inclusion of revolutions and monopolies, but to be totally honest, they could just call the game More Age of Empires III and we'd still line up to play it.", "date": "Oct 17, 2006"}