{"name": "The Legend of Spyro", "name_review": "The Legend of Spyro: A New Beginning Review", "ref": "https://www.ign.com/articles/2006/10/17/the-legend-of-spyro-a-new-beginning-review-3", "text": "Though the purple dragon began his life as an Insomniac creation on the original PlayStation, he really got a chance to spread his wings on all sorts of different platforms once Sony released him from his first-party binds. Unfortunately in future sequels the series didn't quite carry the dragon as far when he became a multi-console hero -- and last year's Nintendo DS adventure, Spyro Shadow Legacy, was an absolute portable atrocity.  But dragons are still cool, and what better way to recharge a series than to simply restart as if it never happened? I can't speak for the console versions, but The Legend of Spyro: A New Beginning for the dual-screen handheld is a surprise -- though the game shares a similar presentation to last year's awful Spyro DS game, this version is a much more solid and better constructed design, even if it strays away from adventuring in favor of its enormous focus on action.   The game may be a new beginning for Spyro's storyline, but the Nintendo DS game seems to borrow assets from last year's game. A New Beginning was handled by the same handheld studio, Amaze Entertainment, so it's not shocking to see the development team work the same 2D/3D engine into this game as it did with Shadow Legacy. However, this new version is much more polished with a tighter framerate and speedier pacing in its action. It's also a much different design as a whole -- where Shadow Legacy put emphasis on adventuring and RPG elements, A New Beginning is almost entirely action driven.   The action focus admittedly strays from Spyro's origins as a platform-slash-adventure hero, but since this game is meant to be a fresh new start for the hero, I'm willing to keep an open mind for this new direction. The game's essentially an arena brawler that emphasizes Spyro's range attack abilities -- sure, the dragon can pull off a few up-close moves when the moment calls for it, but much of this game is all about getting a bit of distance between enemies and letting them have it with a stream of fire or a powerful fireball to take them out. Later in the game players will earn Electric, Ice, and Earth attacks, and specific enemies will be weaker to certain elements so it's important to switch on-the-fly using the quick-change function of the R-trigger. This element really gives the action a lot more energy especially later in the game when you're surrounded by a variety of enemies of different weaknesses.   The overhead view makes it possible (and probable) that Spyro will be attacked on all sides by enemies. Amaze employs a very cool, Zelda-style lock-on system so Spyro can aim at specific enemies as they flood the area -- tapping the character will enable that lock on the character, or players can simply hit the L trigger to cycle through the enemies. Though the L trigger seems to be the quicker way to do it, when you realize how much touch screen function the development team threw in here, it starts to become natural and comfortable to simply mash down on the enemy with the thumb. Heck, some creatures can't be blasted with fire and ice and need to be squashed on the touch screen. Some enemies need to be flipped over by touching them first before they can be attacked. Other enemies have shields that need to be shattered by touching it. Scattered gems can be picked up either by moving Spyro over them, or touching them with your finger. Thankfully, most of the touch screen elements have been designed to be controlled without the need for a stylus.   The exception is in Spyro's gem game that appears at specific times throughout the action. To open up a crate and snag the crystal shard inside, you have to solve a puzzle that requires aligning mirrors and prisms along a grid to reflect different colors of light to specific gems. It's an easy task at first and in the early rounds it feels more like busy work. But the puzzles start to get harder as more gems and fewer mirrors and prisms are thrown into the mix. The shards you score can be used to unlock this gameplay mechanic as a standalone portion of the game.   It's a fun action game, but it's sort of disappointing that the only adventuring involved is an elaborate storyline that's strung along by a set path that can't be strayed. A New Beginning does have a bit of a role-playing game edge as players can spend earned experience points on enhanced fire-power. But that's about all the customization this designed offers -- if you're expecting some extravagant adventure in Spyro: A New Beginning, you might not appreciate this new direction.    The boss battles are admittedly a little lame and a bit of a tease. It's the only time Spyro ever takes flight in a full, 3D environment on the Nintendo DS, but the design is a disappointing throwback to the on-rails design of Namco's Starblade where you simply tap the targets to shoot at them as the surroundings woosh around you in a specific path. It's almost like we've jumped back in time to the days of the Sega CD and its countless, awful full-motion video action games, but in Spyro's case the action is all real-time...it's just locked down into a boring design that's dull and drawn out.   And though this new Spyro is a vast improvement over last year's chugfest of a graphics engine, A New Beginning still suffers a bit from an inconsistent framerate. Backgrounds are lush 2D drawings, with objects, characters, and enemies rendered well in 3D, but even as the developers work within the limitations of the DS hardware the action tends to slow down too much for comfort. It's acceptably smooth most of the time, but when the camera moves in for a tighter view on more than three or four enemies, that's when you'll see the pacing drop.  After the horrifying experience that was last year's Spyro: Shadow Legacy, I wasn't expecting much out of Spyro's second outing on the Nintendo DS -- after all, the same development team responsible for that dragonic atrocity was put to the task of ~restarting~ Vivendi's property on the dual-screen handheld. My resistance to the game melted away as I got deeper into the game -- I was a little disappointed to find out that the adventuring element was almost completely removed from the design. But I continued to warm up to the game as the action heated up. The touch-screen targeting is pretty clever, as is the way the designers change up button and touch screen control during the action. The game still needs a bit tightening up -- the framerate's a bit of a drag at times, and the boss battles are very uncreative, but overall this action-ized Spyro game is a solid and surprising design on the Nintendo DS.", "date": "Oct 17, 2006"}