{"name": "Crash Boom Bang", "name_review": "Crash Boom Bang! Review", "ref": "https://www.ign.com/articles/2006/10/19/crash-boom-bang-review", "text": "You know, most ~party~ style games get a bad rap for not being Mario Party, but with good cause because rarely does a developer match the same level of fun in its own four player mini-game/board game design. Countless games such as Sonic Shuffle, Pac-Man Fever, even the original PlayStation Crash Bash tried the formula and, ultimately couldn't come up to the mark set by Nintendo's ever-moving series. The reason Crash Boom Bang! sucks has nothing to do with any comparison to Nintendo's series. This DS game is just flat-out awful -- confusing design, boring mini-games, clunky controls, awkward animation. It's just terrible all the way through. And it isn't for a lack of trying, because Dimps clearly put some development effort into the package. It's just a bunch of bad ideas strung together with very little...no, scratch that, nothing good holding it together.   The concept behind Crash Boom Bang! is exactly what Mario Party is: a bunch of multiplayer mini-game challenges tied up with a dice-rolling board game. Players can either compete against other people who own the game, or battle against computer controlled opponents instead. But when you realize just how absolutely lame this game is in single player, it's not a very good advertisement to convince other player to put an investment down for their own copy.    First of all, the game simply drops you directly into the action and assumes you know what the hell's going on. This would be fine if it was a straightforward design, but since this board game is so convoluted with items and random events from the opposition, it does far more to confuse than to inform. Before you can roll the dice you have to look in your inventory where you can use an item...if you want to. The tutorial -- or lack thereof -- leads you to believe that you have to use these items, but the descriptions don't really tell you what they do or how to use them. What the hell's a tricycle for? Or a passport? Or a compass? Or a power crystal?   So this is all just confusion before the dice rolls for the first time. We then move into the actual control and action of the game -- the user interface is almost entirely touch screen driven, but the navigation is absolutely retarded and restrictive. And, for some odd reason, the one main control -- rolling the dice -- has to be performed by a button press. That might seem a little trivial, but when it's a game that's exclusively touch screen controls, that's just poor planning. But that simply personifies the entire package: poor planning.   Like any boardgame driven mini-game design, the spaces dictate the game to play. Land on a mini-game space and it's off to some random challenge -- and in this game, there are forty different designs. Honestly, I've seen more than a couple dozen of them and there's not a single ~gem~ in the bunch. Blow up a balloon up to a point before it bursts by huffing into the microphone. Catch falling wompa fruit by tapping the screen near its shadow. Put together a car using one of the most awkward controlling pick-up-and-drop-item interfaces ever conceived. Keep a feather floating in the air by, you guessed it, huffing into the microphone. Speed your giant sphere down a track in a sloppy trackball-controlling racer. All of them are dull, drab, pointless, and couldn't stand on their own as a ~fun~ DS challenge.   Sometimes you won't be involved in playing the game -- you'll play the part of the spectator. Here, you can take bets on who will win the game, and, theoretically, help your chosen ~horse~ or hurt that player's opponent by using the incredibly clunky and nearly broken chat program to send messages to them. What's really horrible about not being involved is that not only do you have to sit through boring challenges and wait for your turn, in single player you'll occasionally have to sit there are wait as the computer ~simulates~ the game unseen. I can certainly accept waiting in a multiplayer network, but when you simply have to sit around for the game to tally up computer opponent's score, emulating their competing with a ~Please Wait~ screen is absolutely ridiculous and unacceptable.   And the fact that games can go on forever is simply terrible design. In the single player adventure you can only move on if you snag hidden tablets scattered under random spots that can only be collected if someone lands on that space. That particular game won't end until all of them have been found...and in one instance, a game went on for several hours before every one had been uncovered. Without the ability to save a game in progress hurts this production greatly especially when you have to play through all single player modes to unlock items. That is, if you really want these lame, boring games to play outside of the main adventure.Crash! Boom! Bang! looks good, sounds pretty okay, and has had a decent amount of focus put into the multiplayer support of the Nintendo DS. It's just a terrible, terrible game with poor organization. If even a fraction of the mini-games in this product were any fun we could at least see some merit, but this Nintendo DS sends the once A-list mascot into an area usually reserved for generic, nameless furry videogame heroes for bargain budgets. Dimps is usually responsible for some significant handheld works (the Sonic series, mostly), but Crash! Bang! Boom! is easily one of the worst games on the system.", "date": "Oct 19, 2006"}