{"name": "GUN", "name_review": "Gun Showdown Review", "ref": "https://www.ign.com/articles/2006/10/21/gun-showdown-review", "text": "The Wild West.  A territory that lived up to its name, thanks to the rampant bands of outlaws, robberies and disputes settled with bullets.  It was also a place where corrupt men could gain power, run towns, and even terrorize citizens without reprisal.  Tales like these are rampant in Westerns, and many of them feature a lone stranger riding into town and ending the terror once and for all with his six-shooter.  Activision attempted to capture the drama and the action of the West last year with Gun, one man's quest for vengeance. Now this story has migrated to the PSP thanks to Rebellion in the form of Gun Showdown.   Here's a quick summary of the plot behind Gun Showdown, which is exactly the same as the console version of the game.  You play Colton White, a young man on a quest for revenge. After a sudden attack on a steamboat resulted in an explosion that claims his father's life, Colton wanders into town with only one clue: a token for the Alhambra Saloon. What quickly follows is an adventure that puts him up against a number of criminals, including a corrupt mayor, a preacher who isn't particularly holy, and a malicious former general who will stop at nothing to achieve his destiny. Along the way, Colton will shoot a bloody path across the towns of Dodge and Empire City as he discovers who killed his father, and why.   Robbing a bank is one of the new missions in Gun Showdown. In making the leap from the console to the PSP, Rebellion took a few liberties with the title to make sure that the game didn't come across as just a simple port.  For one thing, Showdown has received the ~Director's Cut~ treatment, with five brand new missions included into the game.  Fitting neatly in-between the pre-existing missions, these new tasks were initially planned to go into the initial release for the consoles and, for one reason or another, didn't make the final cut.  Their restoration adds a little additional action to the story itself, making Colton's quest a tad bit longer.  It still isn't substantially enhanced -- most players can dedicate themselves to polishing off the entire main quest in ten hours or less even with the new missions, but it's nice to see that there was an attempt to extend the gameplay, even if it was only by a little bit.   The plot isn't the only thing that's been bolstered in Showdown.  For one thing, players have a few new weapons available to them when they're taking down enemies.  Now, players have access to throwing knives for silent kills, and mines that can take down carts or be detonated from a distance.  Another change that's been made was the inclusion of a horse at the beginning of the game, Rogue.  This horse becomes Colton's for the entirety of the game, and players can whistle for the horse at any point in time to call the animal to his side.  This cuts down on the continual backtracking or roaming around on foot, and helps you navigate through the landscape of Gun much faster.  While Rogue will throw you off if you've been too rough on him, he'll run off for a while and recover his health before returning the next time you whistle.   Rogue -- Colton's new best friend. One other thing that's been tweaked is the control scheme for the game.  Obviously, the PSP doesn't have two analog sticks to control movement and the camera, so the developers had to come up with something creative to make shooting effective.  As a result, players can either decide to use the face buttons to move and the analog nub to direct the camera, or vice versa.  It's a decent system, but definitely one that you'll need to spend a few minutes getting the hang of, because it isn't necessarily as tight as it would be if the system happened to have another analog stick.  There are plenty of sections in the game where you'll simply hate the fact that the camera isn't as responsive as you'd like thanks to this system, such as in tight canyons and various shortcuts between Dodge, Empire and the Badlands.  What's more, while you can adjust the sensitivity of the camera tracking, it still might not give you the same kind of tracking that you'd hope it would when you're in the middle of a gun fight.    Tracking your opponents is extremely important when it comes to using your Quickdraw to fend off incoming attacks with a hail of bullets. Just as it was in the console game, every kill that you make in the game fills up your Quickdraw meter, which can be accessed at any time and gives you an unlimited number of bullets.  By firing off shots that hit an opponent's weapon or creating headshots, you can refill that bar faster, allowing you to stay within the mode longer.  Showdown still gives you the ability to switch targets by quickly flicking the analog nub from man to man, but thanks to some rather imprecise targeting within the game, you may find that you'll constantly need to readjust the sight once it's done.  In fact, you may attempt to lock onto an opponent, only to find the gun sight shifted over to his left or his right, which isn't particularly useful.  This is especially true for enemies on horseback, which frequently will throw the sight off and respond as if you're trying to lead your shot (usually into the body of the horse) instead of accurately picking the cowboy out of his saddle.   In some ways, technical glitches like that do run a bit rampant through Showdown.  While it doesn't render the game unplayable, there are a number of flaws that will stand out as a slightly less polished title.  For instance, some of the cutscenes that you'll watch between missions still don't have properly synched up audio and video, so you'll hear dialogue that's a couple seconds behind.  While the screen of the PSP makes the visuals of the cutscenes look great (and in some cases better than the console), some cutscenes will blur and pixelate out into large chunky textures.  You'll also notice textural ripping as the disc slowly loads some scenes, so sometimes characters will have backgrounds matted on top of their model before the scene properly displays the right footage.  There are a couple of times where you'll whistle for Rogue and notice that he's floating over obstacles or half of his body is stuck into the ground.  And while the game does manage to display the large environments of the game rather well, with only a two to three second load between some areas, you'll discover that the draw distance is much more limited, so a lot of generic textures and pop-up will abound.   Hunting bears is one of the new quickplay games in Gun Showdown. Technical issues aside, Showdown does happen to feature some extras that the console version simply didn't have.  For one, players will be able to try out six quickplay games that are designed to give you a quick burst of the world of Showdown without launching yourself fully into the story (or perhaps keep you entertained once you've beaten it).  Whether it's hunting quail or bears, suppressing Hollister's men or fending off waves of criminals, or even simply playing a round of poker, these games are a nice diversion to the standard story mode.  Apart from playing some Hold 'Em (without cheating), each one will test your reflexes as well, as each mini-game gets progressively faster and faster.   Showdown also features three multiplayer game modes via Ad Hoc play: Deathmatch, Golden Cross, and, once again, Texas Hold 'Em.  Texas Hold 'Em and Deathmatch are pretty self explanatory while Golden Cross is a kind of a variant on Capture the Flag. Whoever manages to find and grab the cross first becomes the immediate target of their opponents, and the longer they can hold onto it without getting killed, the more points they receive.  While it's nice to see Showdown pushing poker so much, it would've been better if there were other modes, like Team Deathmatch or Base Assault for the Ad Hoc play.   Couldn't there be something else included for multiplayer instead of poker? Fortunately, Showdown does score in the AI department for multiplayer.  You have the opportunity if you don't have any friends nearby to throw a couple of bots into your game and play a few rounds with them.  There are three difficulty settings for players to check out, and surprisingly, they're quite good.  Many of the bots will actively search for you, and they will land quite a few headshots on your character regardless of the difficulty level you choose.  What's more, they'll actively heal themselves or even look for additional weapons or cover from incoming fire.  Rebellion obviously put some time in on making these bots play as close to human players as possible, and it definitely shows.Gun Showdown isn't really a port, but it's not a completely new game either.  The inclusion of five new missions, exclusive quick mini-games and multiplayer is a big step in making the title feel like its a new experience for players.  The AI for multiplayer bots is also very impressive.  However, when you realize that the amount of play during the story mode hasn't really changed that much from last year's game on the console, and it has a number of issues (some from the console, and some from the migration to the PSP) the luster of the title is somewhat diminished.  However, it's still an extremely impressive translation of the game from the console to the PSP.  Shooting and western fans will be pleased with the job Activision and Rebellion have done here.", "date": "Oct 21, 2006"}