{"name": "JAWS Unleashed", "name_review": "JAWS Unleashed Review", "ref": "https://www.ign.com/articles/2006/10/23/jaws-unleashed-review", "text": "When we reviewed the console version of JAWS Unleashed almost half a year ago, we acknowledged that the game had its problems with glitches but still walked away pleased because of its open-ended ~Grand Shark Auto~ design. In other words it was mindless fun. Now that the game has been moved over to PC, however, that sentiment isn't quite as strong.   To be fair, Appaloosa's shark project does embrace its good and bad points rather symbiotically (much like barberfish and hammerheads do in real life). Though it's correct that JAWS suffers from a number of bothersome bugs, numerous camera issues, and sometimes-infuriating lock-ups, it also benefits from a number of gruesomely satisfying missions, a large environment to play around with, and unique combat maneuvers that you just can't do in any other game.    Let's start with the basics: what is JAWS Unleashed anyway? In the simplest of terms it's yet another entry in the increasingly popular line of genre-blending ~sandbox~ games. In other words, the development team has given you an entire world to explore and now it's your job to go out and play in it. And play in it you can. There are three major coasts around Amity Island with multiple environment types in each area (swampland canals, ship graveyards, traditional beaches, etc), and a number of destructible objects can be found in all of them (harbors, boats, jet skis, animals, you name it). Moreover, players can also opt to take part in story-based missions or unrelated sidequests whenever they want and continue to go on with things even after they've finished they game.   What's that I said? ~Story-based missions?~ Believe it or not, yes -- JAWS does try to tell one... painfully generic and short as it may be (the abbreviated plot: everyone wants to kill the shark... surprise!). Uninspired yarn aside, the narrative does provide the means for our friend Bruce (that's the shark) to get into some pretty interesting situations. A rampage through a Sea World-like theme park, the destruction of a pollution-causing chemical plant, and cool boss battles against things we wish we could see on Animal Planet (Great White vs. Orca baby!) are just a few of the circumstances you'll find yourself in.    In addition to the main story mode that can be started or stopped at any time after the second level, there are also 32 sidequests with three difficulty levels apiece. While not as long as the main stages, these side-missions are arguably the more entertaining ways to pass the time. Hidden collectibles, timed races, and a number of neat challenges involving eating, destroying, or a combination thereof are surprisingly addictive. Stealth killing a hapless swimmer, only to launch them into the air like a lawn dart towards a beach-based sun tent is a lot more fun than it sounds (and it already does sound like a lot of fun doesn't it?).   Keeping things interesting, JAWS also has a number of cool moves at his disposal. Besides his obvious ~weapon mouth,~ Bruce also employs a number of secondary attacks like the tail whip, the nose ram, a covert victim grab, and supplementary ~advanced ~moves that are unlocked via experience points (dive bomb splashes, corkscrew attacks, and jumping 'one-bite kills' are just a few of them). Put it all together and you have the true heart of what JAWS is: having a blast via destruction and uncontrolled consumption.    Now my shark-like instincts are telling me that with all that I've said thus far, some of you might be wondering where that ~symbiotic disappointment~ I mentioned earlier comes in. For that answer, I also ask that you remember the bit I had about the bugs, the camera issues, and the lock-ups. It's those frequent aspects that grab what could have been a very impressive underwater actioner and harpoon it downward a couple of notches. Fun and mindless as JAWS may be, it could have been a lot better thanks to a couple of rather devastating hitches. This is especially true for the PC edition since none of the console version's problems have been addressed for the update.   It's hard to say which problem is the most bothersome of all JAWS Unleashed's issues, but if we had to pick one it would be the camera -- it is one stubborn and schizophrenic little bastard. Though users have the option to choose three different perspectives (free, locked, and first-person), it frequently gets caught in weird positions making it hard to see what's going on in tight spaces or populated areas. This dilemma is made even worse in that during most missions, JAWS will find himself in tight spaces or populated areas, and the camera becomes even more problematic if you travel from the surface to underwater on a regular basis (which you will, because you're a shark!). The sad thing is that while you can certainly learn to live with this problem after an hour or so, it never goes away -- so it always feels like you're fighting the viewpoint every time you're in combat.    But where the analog sticks in the Xbox and PS2 versions made this problem tolerable, the PC edition relies solely on the keyboard and mouse. This sad fact makes controlling Bruce even more difficult and it can get frustrating to constantly try and get your bearings every time you want to rumble. Even more amazing is that Appaloosa didn't attempt to optimize JAWS for the PC at all -- menus don't have mouse support, you can't use the keyboard to name saved games, etc, etc. It borders on unbelievable.   Unleashed's bugs and glitches are almost as bad. Swim too close to some kind of structure (especially in narrow quarters), for example, and it's entirely possible (re: likely) that Bruce will get stuck on invisible polygons never to detach again -- forcing you to load from an earlier save point and thereby repeating everything you just did; this sequence is especially a pain if you had just uncovered a lot of hidden stuff prior to the need for a restart. But that's not the only glitch, not by a long shot. Required victims for missions will sometimes never be accessible at all (forcing another reload), while certain enemies will mysteriously double and triple in damage power for no apparent reason.   As you might imagine, these problems definitely take their toll and when combined with a few questionable design choices make it harder to enjoy (the overworld map, for instance, doesn't show you which missions you've completed and which ones you haven't). The visuals aren't very impressive either. Strange textures and character models occasionally make people look inhuman and unexplained showdown, pop-in, and tearing will occur with frequency. Plus, even at the highest resolutions, JAWS doesn't look much better than the low-res console counterparts. But at least the island of Amity is populated with all sorts of different life and objects and the animations for most everything are pretty good.JAWS Unleashed is one of those difficult kinds of games to pigeonhole because it has such strong plusses and minuses. What it really boils down to is ~What kind of experience are you're looking for?~ Are you a ~My ocean is half-full~ kind of a guy or a ~my ocean is half-empty~ sort of person? On the consoles, we leaned in a more positive direction because the destruction and people-eating was just so dang fun despite all the technical problems. On the PC, however, the additional troubles with the camera make it a lot more frustrating to play -- and the lack of joystick support is just baffling. That's sad stuff considering that with a little more fine-tuning, it could have been a one heck of a cool game.", "date": "Oct 23, 2006"}