{"name": "Family Guy", "name_review": "Family Guy Review", "ref": "https://www.ign.com/articles/2006/10/25/family-guy-review", "text": "Family Guy is a TV show that usually garners a love it or hate it response. It's crass, to be sure, but that's part of its beauty. The jokes fly by faster than many viewers can keep up with, and its reliance on extremely random events and flashbacks leave many scratching their head and wondering what the big deal is. Its popularity has now spawned the inevitable videogame of the same name, and unfortunately while the random humor and variety works for the show, it simply falls flat in videogame form.   The game lets you take control of three of the show's biggest characters: Peter, Stewie and Brian. The Family Guy himself, Peter, is an action-only character. Each of his levels has you pummel your way through what are almost always innocent bystanders. Brian's sections are all stealth-based, while Stewie's part in the game is a combination of shooting and platforming. All three elements unfortunately become extremely repetitive, have a fair amount of problems and offer very little fun.    Peter's action-based levels are extremely bland and at best mimic what we saw in The Simpson's arcade game years and years ago. There's a bit more of a combo system at work here, but even that feels very forced. Some characters can only be hurt by punches, and others by kicks, forcing you to switch your attacks simply so that you have a reason to use them. It doesn't help at all that the built-in lock-on system is extremely flawed, making it hard to finish a combo at times. Some enemies don't seem to have health as much as a weakness to a certain move that will finish them off, like an uppercut, but since it can sometimes be hard to finish a combo when characters are moving around, you'll just have to repeatedly pummel them to death. The only thing you'll ever do as Peter is kick and punch kids, old folks, Indians and so forth. By the time you've reached his third area, it's worn very, very thin.   Brian's missions are about as old-school stealthy as you can get. Rather than having characters randomly patrol areas, they follow very strict paths and work in patterns. In other words, his levels are largely trial-and-error with a lot of patience thrown in as you simply have to wait for some characters to finish their rounds before the coast is clear. There are a few opportunities for different tactics, sort of, as you'll be able to put on costumes and such to disguise yourself, but each area is set up to force you to do this so they're much more mandatory than optional.   Stewie's missions are the game's most fun moments, or rather, they're the least boring and frustrating. Most of the time you'll use his ray gun to dispatch foes, but in some cases you'll use his mind control ray to take over another character and use them as a distraction of some sort. Like Brian's segments, these are all forced however, though they do provide at least some small bit of puzzle solving.   Stewie's platforming sections are reasonable, if not all too complicated, but due to the game's art style it can be hard to judge depth and spatial distance between objects. It's not too much of a problem, but you'll need to be really careful about watching your shadow's placement when hopping between platforms, more so than usual.    One aspect of Stewie's sections that we had a major problem with were some sliding levels. You'll wind up flopping down on your belly and sliding through human fat, blood and other disgusting surfaces. You don't have control over speed in these sections and your level of control is quite small, allowing you to only turn a tad bit to either side. The real catch here is that when you hit a hard surface, you'll bounce off and change direction. Since your turning radius is extremely wide, it's not too uncommon for you to mimic a pinball or simply get turned around without an easy way of flipping a U-turn.   A fairly large portion of the show's humor is reliant on crazy flashbacks, often segued by a comment such as, ~This is crazier than that time that I saw Martha Stewart bobbing for hand grenades.~ The game uses these flashbacks quite often in order to include a number of mini-games. These are extremely basic and reward you with some minor power-up, like invisibility for Brian or extra upgrade bolts for Stewie's ray gun. The mini-games themselves aren't much of an issue, but they aren't tied into the game well whatsoever. While the show sometimes (read: usually) reaches really far to include them, some of the segments in the game literally come from out of left field and feel extremely tacked on. For instance, at one point you need to sneak through a police station with Brian. In the middle of the station, he stops and says, ~This is why I don't vote~, and then you need to dodge lunges from Abraham Lincoln while standing in front of voting booths. It really doesn't make any sense whatsoever and therefore doesn't carry any humor other than absurdity.Family Guy tries to do a whole lot of things, what with three different genres packed into one game, but none of them work well at all. It's repetitive, boring and even frustrating way more often than it should be. Die-hard fans of the show may find a small bit of humor here, so it might be worth renting for an hour or two if you're really bored, but certainly don't waste your money on the full purchase price.", "date": "Oct 25, 2006"}