{"name": "Winning Eleven 2007", "name_review": "Pro Evolution Soccer 6 Review", "ref": "https://www.ign.com/articles/2006/10/25/pro-evolution-soccer-6-review-2", "text": "Playing Pro Evolution Soccer 6 is like slipping on a new pair of trainers that happen to be exactly the same as your last pair. They feel instantly familiar and blissfully comfortable, but at the same time slightly different. It's the same with PES: at first it feels like you're playing exactly the same game as before, but after a few minutes you pick up on features and gameplay nuances that weren't there in previous instalments.   Of course, that's always been the case with any new version of Pro Evo. Having been a fan since PES on PSone, it's always taken me a couple of weeks to get used to any new tweaks and tricks, and it's only then that it becomes apparent it's a marked improvement over the previous game.    With PES 6, however, the differences are a lot more subtle. Unlike EA, which introduces one big new feature to FIFA every year, Konami has instead followed the path of evolution rather than revolution. In fact it's almost impossible to seperate the new version from PES 5 during your first match. The front-end and menus are different (but are just as functional, it's worth noting) and so are the cover stars - England skipper John Terry is joined by Inter Milan striker Adriano on the front of the UK box - but there aren't any great shakes to write home about when it actually comes to knocking the ball around the pitch.   Not that it's a problem: the Pro Evo series has long been considered the connoisseur's choice of football games, thanks to intelligent, realistic gameplay that encourages gamers to play as a team. That's still the case with PES 6, but now the controls have been refined, the AI brushed up and a lot of the little annoying touches - like your players backing away from the ball at crucial points in a game - have been addressed and ironed out.   Perhaps the most noticeable improvement is in the AI of defenders. Your back four now work together much more closely, playing a more intelligent defensive game and covering for players out of position. Defenders also combine as a team to regain possession of the ball: during a North London derby, Defoe broke clear of the Arsenal midfield, forcing Eboue to move across and track his run. But while the right-back was hustling for the ball, slowing the Spurs striker down, Toure stepped up and clear Defoe could fire off a shot. While this level of inter-team co-operation is nothing particularly revolutionary, it's yet another nice touch that separates PES from its rivals.       Goalies have been overhauled too: there are fewer rebounds from soft shots, so cheap tap-ins are much rarer. Even when a keeper cannot hold onto the ball they no longer palm it back out into the six-yard box, instead fisting it up the field or pushing it off to the side for a corner, which is always better that than losing out to a rubbish goal.   Team attributes are much more evident too, with many of the traits associated with specific clubs making it into the game. Take Blackburn - or Lancashire as they're called in PES - for example. Rovers may not play a graceful game of football but they battle hard in midfield, sticking the boot in aggressively and pushing players off the ball so they can feed their striker. On the flipside, teams with pace, like Arsenal, rely on the speed of their wingers and Thierry Henry to pass the ball quickly up the field, often scoring on the counter-attack when the opposition's defence is stretched. Whoever you play as, if you play to your team's strengths you'll have more success in front of goal - and that can only be a good thing.    Similarly individual player skills are more noticeable too, and not just between the best and worst teams. Play as England and Rooney's first touch will almost always be perfect, either knocking it into space or sweetly laying it off for his strike partner even if he's being hustled by defender. Crouch, on the other hand, isn't quite so deft, so you'll have to work harder to latch onto his flick-ons, especially if you're playing against a team that's strong in defence. His height is an obvious advantage though, so get Gerrard to whip in a cross from the wing and he'll stand a good chance of heading it into the net.   Having said that, scoring is by no means easy. That's partially because the defenders and goalies have improved, but also because many of the 'dead cert' goals that allowed players to score easily in PES 5 have been stripped out. One example is cutting the ball back to a striker from the goal line, which is much tougher now. The pass is often either intercepted by the opposition or hit wide, unless it lands directly at your player's feet. It's not as easy to score from a free-kick either, which is great news for dirty players who are consistently punished for fouling on the edge of the box.   Other improvements include a slight speed boost (only slight, mind) and a revamped online mode. Now up to eight players - four-on-four - can compete simultaneously, and the game no longer slows down due to lag, which greatly improves the whole online experience.In fact that pretty much summarises PES 6  its an improved experience rather than a radically new one. The controls are still delightfully responsive and tight, and theres no doubt its still the most accurate football game on PS2 - so much so, anyone who plays or watches football regularly is likely to be a better player because they understand how to create chances. You just wont be blown away by it, instead feeling happily content that Konami has taken your favourite football game and made it slightly better. In our book thats definitely a good thing.", "date": "Oct 25, 2006"}