{"name": "Avatar: Last Airbender", "name_review": "Avatar: The Last Airbender Review", "ref": "https://www.ign.com/articles/2006/10/26/avatar-the-last-airbender-review-2", "text": "Since Avatar: The Last Airbender premiered on Nickelodeon back in February 2005, its success has skyrocketed. The show has been a hit with people of all ages, and the marketing guys at Nickelodeon are milking that marketing cash cow. After Avatar action figures and Lego sets hit the scene, it only makes sense that the young Airbender get a video game. While this Avatar may not be a savior by any means, it's still a really fun action role playing game that is sure to delight fans of the show.    Avatar: The Last Airbender focuses around the story of Aang, a boy with the power to manipulate air. He also has the unique ability to harness the power of earth, water, and fire as well, making him an Avatar. Aang is destined to bring balance to a war torn nation, but for right now he's still in the training stages. Much like the show, Aang and his friends, Katara and Sokka, travel all over the nation, meeting friends and enemies alike.    One of the biggest strengths of this title is its faithfulness to the show. Playing the game feels like I was watching an episode, especially since the game starts with the actual opening title sequence to the show. The cutscenes, although simple, contain a lot of the stylistic elements commonly found in anime. There are even a few cutscenes that have full voice work from the cast, which is something rare on handheld titles. It was probably the first time I was pleased to hear Sokka's whining voice! The story is pretty basic, but there's a healthy smattering of humor throughout that makes it a lot more enjoyable. The presentation feels like the developers actually care about the license, and are fans of the show.    The game is presented in a top down 3D view, allowing the player to rotate the camera at whim. The environments are a lot more expansive than they would be if the game view was isometric. It can get hard to see sometimes, but a couple quick taps on the shoulder button clears that up right away. The 2D sprites are sharp and vibrant, maintaining the popular style of the show. All the characters are easily recognizable, and they all act differently in every facet, down to the way they walk.       The battle system is where Avatar starts to lose some air. The top down view makes it hard to line up the attacks diagonally. There's also this nasty tendency to get trapped and subsequently pummeled by the enemies. Neither annoyance makes the battles unplayable, and players are sure to quickly figure out how to best avoid situations like this, but be prepared to die a few times right from the start. The fights never have the same acrobatic flair that the show possesses, but Aang does use a few of his trademark air moves. There's also a certain satisfaction that comes with hitting a soldier with Aang's staff and sending him sprawling to the ground. Still, the battles could have been a little smoother, and the collision detection could use some tightening.    Luckily, there's a lot more to do in this game than battle. Minigames, puzzles, stealth missions, fetch quests, and exploration abound. Even with the RPG elements, players are never forced to level up for hours before they can hope to defeat a boss (though it certainly doesn't hurt).    There's a lot happening on the touch screen, though none of it is action oriented. The bottom screen is used as a menu screen. During gameplay it shows the player's party, allowing them to switch control of characters. There's an inventory bar at the top for easy access to the much needed items, and a map can be quickly pulled up to help players find their way in the sometimes mazelike levels. The touch screen is doing a lot of things at once, and the layout works very well, making it a breeze to manage the team.    One of the missed opportunities for the title is the lack of multiplayer. Even a simple two player battle arena would have been a nice addition, and the ability to play the game cooperatively would have been a dream. With a game this popular, lots of people will want to play, but it's not a title that lends itself well to showing off to friends. Multiplayer in any form is something sorely lacking from the title, and I'd love to see it worked into any future Avatar titles.   When a development team cares about the game it's making, it shows in the final product. This is apparent when it comes to Avatar: The Last Airbender. Tose software has made a solid action RPG. It's not as exciting as the show is, but I still had a pretty fun time playing it. I just wish I could be playing it with my friends. I hope that, like Aang, Tose can master their skills and blow me away next time.", "date": "Oct 26, 2006"}