{"name": "Winning Eleven 2007", "name_review": "Pro Evolution Soccer 6 Review", "ref": "https://www.ign.com/articles/2006/10/26/pro-evolution-soccer-6-review", "text": "Pro Evolution Soccer has been the dominant force in football games for almost a decade, outshining its rivals on PSone and then increasing its lead during the lifespan of PS2. Although FIFA came close, most notably with the latest instalment in the series, PES has always maintained its edge. However, the introduction of Xbox 360 has levelled the playing field, with EA using the opportunity to rebuild its football franchise from the ground up. Konami, on the other hand, has played it safe by essentially porting over the current-gen version of the game, adding a couple of next-gen bells and whistles and giving it a lick of HD paint.    As a result PES 6 on 360 doesn't look that much different to its current-gen versions, at least on the surface. You can't test your ball skills as Adriano while the game loads and the menus, although functional, certainly aren't flash. There are no player portraits during the team selection, just thumbnails of the club badges if they're licensed or, if they rank as one of PES's many faux clubs, just a made-up logo and loosely relevant name. However, while PES 6 is certainly not the virtual Panini sticker album that is FIFA, it's progressed since the last game. Admittedly, the English league still only has two official clubs - Arsenal and Manchester United - and that's unlikely to change while EA maintains the rights for FIFA. However, players who favour something a little more continental are well catered for, with licensed teams from Ligue 1, Serie A, Eredivisie and Liga Espanola all featuring. Two additional leagues also contain a mish-mash of other official clubs, from Juventus and Bayern Munich to Rangers and Celtic.    Out on the pitch, there's a noticeable difference between current-gen PES and the 360 version, although it's not so obviously next-gen as FIFA 07. It's sharper and more defined, plus the player models are more detailed, but it's not as drop-dead gorgeous as EA's game. Player animation is much the same as its PS2 counterpart and, when the camera pulls out to wide, the differences between the two are hardly that huge. Player likenesses are still better compared to FIFA though, even though they're less detailed. You can move along the starting line-up of any club and easily pick out all the recognisable players, whereas it's not quite so obvious with FIFA.   As for the way it plays, anyone familiar with PES will instantly feel at home with the Xbox 360 version. The pad layout is exactly the same, although sprint and player select are located on the left and right bumpers rather than the triggers. This takes a little getting used to, although it becomes second nature after a couple of games. Likewise, playing with the 360 pad's analogue stick isn't quite as responsive as it is using a PS2 d-pad - which is an ongoing issue we have with football games on Xbox 360. Sure, it's possible to use the Xbox's d-pad, but it's positioned awkwardly and just doesn't feel as smooth under the thumb. To be fair, playing with the stick is less of a problem the more you play, but - in our opinion - will never top a PS2 d-pad for fast, precision control.   Stringing together slick passing play is as enjoyable and easy as it's ever been in PES and the satisfaction of catching your opponent on the counter-attack with well-timed lofted through-ball still sends tingles down our spines. Actually pulling it off successfully isn't quite so easy, though. The defence in all versions of PES 6 has been improved and that's certainly the case here, with centre-backs hustling your attackers and almost always winning the ball if you hold onto it for too long. Similarly breaking away from the defence is just as difficult, even if you time the pass to your striker perfectly. The most cumbersome defender can catch up with an attacker, even if they have a couple of yards' head-start, which can be annoying when you're playing as France and have Thierry Henry up front.   Teams play together much more tightly on the whole, too. Players cover for their team-mates more, with the whole of midfield backtracking to help out the defence if you manage to break free. There's a lot more movement in attack too, with players moving up in support when the chance arises. Admittedly you still have to coax them into action some times, either by changing tactics on the fly or staggering your run so they overlap, but PES 6 still feels more attack-focused than the last game.   Having said that, it's not easy to score in PES, even more so than in the PS2 game. During our first half a dozen games, we found most shots blazed over the bar, and that's only when we managed to get past the brick wall-like defence. It's the same with headers: even if you're nutting a corner in from the six-yard box, there's no guaranteeing it'll go in, so PES 6 really isn't a game for players who don't like working for their goals.Thats always been part of PESs charm, though. Its not a goal-fest like FIFA but a much more tactical, realistic game. Its trademark tight gameplay is still intact, although it's not as sharp as the current-gen versions and the analogue stick isnt quite as direct as a d-pad. Despite this, it still offers a football experience much closer to the real thing that any other football game. Admittedly, the online mode isnt fantastic and - while it's perfectly playable over Live - it only supports one-on-one matches, which is a huge step backwards considering the online PS2 game is much more substantial. We cant help but feel a little disappointed with the presentation of the 360 version either, especially in light of the great things EA achieved with FIFA 07. However, theres no denying PES 6 is still a great  probably the best, in fact  football game on Xbox 360.", "date": "Oct 26, 2006"}