{"name": "Magical Starsign", "name_review": "Magical Starsign Review", "ref": "https://www.ign.com/articles/2006/10/26/magical-starsign-review", "text": "Part of putting out an amazingly innovative system such as the Nintendo DS is that you risk compromising strong traditional gaming in the process.  We've seen a ton of odd-ball games that have made it big in the last few years, but one thing we've been missing out on is an abundance of classic gameplay we used to see on the Game Boy Advanced.  Games like Golden Sun have been swapped out for niche titles like Phoenix Wright and Trauma Center, and while the transition has allowed for a fresh take on gaming, the system is in dire need of some traditional balance that only deep-rooted classic gaming can bring.  If you disagree, we may have lost you already.  If, however, you're looking for a game that's rooted in the ways of old-school role-playing, pushing a tried and true method while still managing to add a bit of innovation into the mix, Magical Starsign may be just the title you need to keep the ying from overpowering the yang.   Though the game may not sound too familiar to us here in America, Magical Starsign is entirely commonplace in Japan by now.  Developed by Brownie Brown, the people who brought us Sword of Mana in the states and Magical Vacation (predecessor to Magical Starsign) to Japan, Magical Starsign is a deeply-rooted traditional RPG that attempts to deliver classic leveling up and battle tactics with a re-invented battle system.  Part of the system is due in part to touch integration, while the majority is simply done with clever design.  The basic premise of Magical Starsign follows a group of six kids who depart on an adventure to rescue their teacher Miss Madeleine from a mysterious inter-galactic mission.  They don't know why their teacher has taken this dangerous mission, but the team wastes no time zipping off to the stars when it becomes apparent that something went awry.    To kick the game off, players will create their primary character, choosing either a male or female, and alliance to either light or dark magic.  From there, the created player is instantly joined by longtime classmates at the magical academy, and the team is formed.  Each member of the team focuses on a specific element of magic, with Pico as the fire mage, Sorbet focusing on water, Mokka (a portly robo-man) with earth affinity, Chai using wood, and Lassi harnessing the power of the wind.  Likewise, the created character gains strength with either light or dark magic, which is influenced by day or night battles.  Within the opening minutes of the game, the team is scattered across the galaxy (for reason's we'll let you experience on your own), and it becomes the main character's job to not only re-unite the team, but also save Miss Madeleine and thwart a galactic threat in the process.  It's a basic story, but the game's lighthearted feel and entertaining script helps keep the game fresh despite its formulaic feel.     The deal-breaker for Magical Starsign isn't in the story though, rather it relies entirely on the battle mechanic.  The entire game progresses in accelerated time, having a day cycle every 20 minutes or so.  In addition, players will make use of an astro-chart showing five orbiting planets, and wouldn't you know it, each planet has an elemental type.  In addition, the galaxy is broken into five parts, each also containing the same color and elemental affiliation as the planets.  As the hunks of rock continue orbit, planets will eventually mosey into their respective areas, giving a bonus to whatever player shares that magical affiliation.  In this way, the game's strategy is constantly being mixed up, having different players act as the group's main offense while their planet is giving off the most power.  Since each planet is in a different speed orbit, it's common to have two or three of the five characters receiving boosters at once, making the team amazingly strong.  A similar technique is used with the created player, as they get stronger or weaker whether it's day or night.  Throw in a rock/paper/scissors balance where water beats fire, fire beats leaf and so on, and you've got a game with a ton of strategy, as well as constantly changing tactics.     What's the downside?  Unfortunately, if that battle mechanic doesn't hook you, there isn't much left that will.  There are a few other gameplay quirks to master, such as the ability to switch where your fighters are placed in battle (front row players are more powerful, but back row casters can use magic to hit every enemy fighter at once rather than targeting one single opponent), or the basic touch implementation that lets you tap your player during attacking/guarding sequences to try for an added boost to the outcome, but all in all the combat stays very classical.  Players who aren't into random battles or turn-based fighting will definitely want to pass on this one, while die-hard traditional players could find themselves going over 50 hours deep into the story, powering up every character and boosting stats through side-quests.      For RPG traditionalists, however, Magical Starsign is definitely a keeper, as it's packed with a ton of awesome presentation, and great 2D style (character art is only 16X16 pixels, allowing for tons of on-screen visibility).  The game offers nearly 10 or so minutes of animated sequences that are amazingly high in quality, and are dispersed evenly throughout the game.  In addition, the two-screen setup is used in multiple ways, switching from maps/stats to a taller playfield on the fly according to the situation at hand.  The audio has the same jazzy RPG feel as Magical Vacation, which screams ~Super NES~ from beginning to end.     Another major hook in the game is the surprisingly deep multiplayer, which lets players team up with friends and take on dungeons together.  The multiplayer works like a RPG version of Mario Party, as it's every man for themselves on the global level, but the group has to work as a team to clear dungeons out and spawn more treasures for the entire group.  The game could have used a bit more direct teamwork though, as it still feels like you're running solo in a dungeon that just so happens to have other players in it.  Even still, it's a solid mode, allowing you to select and power-up any of your playable characters, earn new items and experience for the main game, and enjoy a little healthy competition.     Also included in the games multiplayer ~amigo~ mode is the ability to link up with friends and raise new creatures from eggs.  These creatures only gain experience from ~Tag Mode~, which is a quick stat-swapping program that takes each player's position in the game and applies it to experience and items for their friends.  The more people you tag with, the more experience your special characters will gain for the one player mode.  Not a necessary an essential part of the game, but definitely one of the many ways to add replay value to an already entertaining RPG.  After missing out on Magical Vacation for the Game Boy Advance here in America, its great to finally be able to enjoy the depth of the team over at Brownie Brown with Magical Starsign.  While the game is definitely a blast for hardcore RPG fans, anyone not into random battles and turn-based gameplay will want to stay away from Magical Starsign, as it is still a very traditional design.  The game has a great battle mechanic with some strong diversity and strategy elements, though its a bit too linear in its story.  The overall presentation is amazing though, and anyone looking for a true classic RPG should look no further.", "date": "Oct 26, 2006"}