{"name": "Scurge: Hive", "name_review": "Scurge: Hive Review", "ref": "https://www.ign.com/articles/2006/10/28/scurge-hive-review", "text": "More often than not, when a studio ports one of the Gameboy Advance titles to the Nintendo DS, players are going to get a DS game that just isn't up to snuff in the graphics and sound departments. Orbital Media's new title, Scurge: Hive has much of the same problems. The difference is that game is still awesome, even with the graphical discrepancies. It doesn't matter if players pick up the DS or GBA version; they're in for a really solid action RPG.Scurge: Hive is an original IP, following the adventures of Jenosa Arma, a female bounty hunter. While investigating a distress signal from a lab, Jenosa's ship is attacked and she's forced to escape to the lab itself. The entire planet is ridden with an alien species known as the Scurge, who have the nasty ability to take over practically anything.Since Jenosa has been infected by the Scurge, she has to reach various sickbays and decontaminate herself. If the infection becomes critical, she'll lose life and eventually turn into one of the Scurge itself. This idea plays a major part in the gameplay. Players have to regularly get Jenosa to the sick bays (which also serve as save points) if they want to survive. The sick bays are spaced far enough apart to really cut it close. The entire game has a panicky feel as I rushed to try and work my way through the rooms fast enough to reach the next sick bay. There can be no dawdling in this game, and Orbital has done a great job creating a game that forces players to push through it.The pace of the game never slows, partly because every room players enter are filled with enemies. There are many puzzles to solve, and areas to explore in the game, and players will have to do that while blasting away alien scum. The game doesn't give much time for a breather, especially since Jenosa constantly has to head to the next sick bay.Along the way, Jenosa acquires upgrades to her gauntlet, allowing her to more effectively fight the Scurge. Different weapons are devastating against one type of opponent, but will also be ineffective against another. Players have to switch weapons regularly and be careful where they aim. This feature really sets the game off, keeping it from becoming a mindless shooter. Scurge really forces the player to think about everything, even something as simple as shooting an alien spider in the face. I have to admit, the game can get pretty tough, even on the easiest difficulty, but that was refreshing. Both the GBA and the DS could use a solid, tough, game, geared towards an older audience. Scurge is one of the nicest looking games I've ever seen on the GBA. The Nintendo DS version however doesn't just suffer from having GBA graphics, but they actually seem to be worse. A lot of the neat mist effects, and the enemy animations are either gone or not near as polished as the GBA version. Don't get me wrong, Scurge is still a nice looking game on either handheld. Jenosa looks great, and is beautifully animated. Even her absurdly long ponytail looks great on either system. Scurge is a wonderful game to look at, but the DS version should have at least been on par with the GBA.There's only so much one can do with the sound for a GBA game, but Jacob Kaufman manages to make the most of it. The score for Scurge is one of the best parts. The music changes from room to room, and will match the situation in each one. The score is a lot more intense when players walk into a room full of enemies, and it's more soothing when inside the sick bay. It's rare that I get to compliment a handheld game's music, but Kaufman has done an excellent job, and really helps draw the player into the experience.Unfortunately for the DS version of Scurge, the developers didn't do much to add any new features. The touch screen functions as the map (which can be pulled up with the select button on the GBA). It's nice to have the map there for reference, but any time it's actually necessary the game will pull it up automatically. I would have loved for the touch screen to have the selection grid for the different weapons Jenosa can have. A simple tap on the screen would have been so much nicer than holding the R button and D-Pad.Scurge: Hive is a fantastic game, there's no question about it. But which one should gamers buy? Both games are great, but the GBA version really stands out. The graphics are stronger, and the price is cheaper. If players really want that map on the bottom screen, then by all means, go for the DS version. Even with the less polished graphics, Scurge: Hive is an excellent buy.", "date": "Oct 28, 2006"}