{"name": "Justice League Heroes", "name_review": "Justice League Heroes: The Flash Review", "ref": "https://www.ign.com/articles/2006/10/28/justice-league-heroes-the-flash-review", "text": "Final Fight wasn't fleet of foot, and Double Dragon did no dashing. What the beat-'em-up brawler genre has always lacked is speed, now made apparent as the fastest man alive sprints onto the Game Boy Advance in Justice League Heroes: The Flash. This side-scrolling street fighter pays homage to the adventures of Mike Haggar and the brothers Lee, but adds an accelerating element that kicks the fun factor into a higher gear - the fists fly faster than ever before.    It's another fine day in the DC Comics universe when an army of rampaging robots arrives to plague planet Earth. Keystone City, home of The Flash, is one of the first targets to come under attack, and the Justice League dispatches the red-suited speedster to go and defend his hometown. Players take control on the Keystone streets as the core gameplay reveals itself - but the character's the catch.    The beat-'em-up genre may be a well-beaten path, but it's never seen the footfalls of The Flash. The basic gameplay featured here is familiar (fight a wave of bad guys, move forward through the stage, fight another wave of bad guys) but in-between punches is something new - speed. Flash's superspeed allows him to dash from one enemy to another in a split-second. He seeks directly to attacking range in front of each foe with a press of the A Button - an incredibly simple but incredibly satisfying gameplay mechanic that breathes new life into the classic brawler design.    Players can have The Flash dash to a bad guy, punch him in the face, then dash across to the opposite side of the screen and punch a different guy in the face - all in less than a second. The fun of being The Flash is captured in this execution of acceleration, and luckily the design doesn't stop there in taking advantage of its leading man's potential - players can also harness the Speed Force to slow down time.    Fans of Viewtiful Joe know the appeal of slow-mo, but The Flash goes one better by maintaining normal speed himself as the world around him drastically decelerates. The slow-motion mode is multi-purposed, playing a role in both the game's combat and some puzzle-solving situations - but in the former there's a trade-off. The Flash can't use his heat-seeking A Button ability while the world's moving at a crawl. Without it, it becomes more difficult to get into proper attacking position - The Flash's character sprite is small, his reach only a handful of pixels long.       Smaller sprites are employed on purpose, of course, placing punches being the only drawback to the draw style. Less bulky characters mean more efficient use of the GBA's screen real estate, a must for this design that finds its fun in having space to run. Flash and his foes are animated well, and the game's environments look great, presented in an isometric viewpoint - beyond the opening area of Keystone City, the adventure continues to other notable DC 'Verse locales like Metropolis, Gotham City and Wonder Woman's home island of Themyscira.    Diana can lend players a hand in sticky situations by flying into the scene and wielding the Lasso of Truth, a summoning move that makes sure the other Justice League heroes aren't missing out on all the action. Superman and the Martian Manhunter can be similarly called forth for a screen-clearing super attack, and additional characters are unlocked as the adventure progresses. (Disappointing, though, is the non-inclusion of Batman in this group.)    The Flash himself also gets more powerful the further players go, with new attack moves activated partway through his journey around the planet. The game design as a whole keeps things fresh in this way, never letting a sense of stagnation or repetitiveness set in. Boss battles in particular spice things up, as players will have to make strategic use of their resources to overcome supervillains like Gorilla Grodd and Circe.    And in that's the overall feeling of The Flash - fresh. Different from any brawler to come before, and presented in a way that perfectly captures the feeling of the license. Flash fans know the only thing faster than his feet is his mouth, and quick voice clips of his signature quips keep that sense alive. Comic-paneled cutscenes convey the story along and give him more opportunity to air his likable arrogance. Unlockable extras extend the game's appeal after the world is saved - there's a Boss Rush mode that challenges players to best each big baddie in quick succession, a racing challenge where The Flash takes on Superman for the title of ~Fastest Man Alive,~ and a Making Of feature that goes behind the scenes of the game's development. This isn't the first time The Flash has headlined a game  an obscure 1992 release on the original Game Boy claimed that distinction  but this is the first time the spirit of being The Flash has truly been captured. Taking control of a superspeedster and literally running circles around enemies is a ton of fun, and players will be left with a sense of what it might be like to really wear the crimson tights. Final Fight wasn't fleet of foot, and Double Dragon didn't dash  this beat-'em-up leaves 'em in the dust, thanks to superspeeding Flash.", "date": "Oct 28, 2006"}