{"name": "Final Fantasy XII", "name_review": "Final Fantasy XII: Collector's Edition Review", "ref": "https://www.ign.com/articles/2006/10/28/final-fantasy-xii-collectors-edition-review", "text": "How often can one say, ~The wait was worth it~ and truly mean it? When is it okay to claim that, ~This is one of the best examples of [insert genre here] ever~ and not just say it for  clich's sake? But most importantly, when does a game with momentous hype and anticipation actually live up to media, consumer, and competitor expectations? The answer to all three of those questions is a simple one, ~When you're playing Final Fantasy XII.~Granted, Final Fantasy XII may not seem like a game deserving of that level of prestige in its beginning -- it starts slow (slower than your typical RPG) and can take upwards of three to six hours to get going. In this day and age of videogames hitting the ground running the moment you press start, asking users for an extra layer of patience can certainly prove trying. Nevertheless, like most great things worth experiencing, big effort means big rewards.  And big rewards are what you'll get when you travel to the world of Ivalice. Final Fantasy XII is a massive, multi-character adventure with the darkest and most mature storyline the FF series has yet seen. But unlike past titles in the franchise, there isn't a single major character pressing the action (despite what commercials or FMV introductions might have you believe) -- this is a true ensemble piece that weaves multiple webs filled with every descriptor in the book: misfortune, treachery, love, hatred... you name it, it's in there.And it all begins with an invasion. The powerful and militaristic Archadian Empire has continued its martial campaign into the previously neutral kingdom of Dalmasca. Only wanting peace for his people, the King of Dalmasca has agreed to sign a treaty granting Archadia occupational rights in exchange for the war's end. On the eve of the signing, however, Dalmasca's king is assassinated under terrible circumstances and his daughter, the princess, kills herself as a result. Flash forward to two years later and Archadia occupies Dalmasca and its people are none too happy about it. Among them is Vaan, an energetic young store worker who moonlights as a thief on the city streets. As the brother of a solider who fell during the murder of the king two years earlier, Vaan feels compelled to take back Dalmasca from the Archadians one purse at a time.  As you might imagine (and as setups like these usually go), Vaan bites off more than he can chew the day he decides to break into the royal palace during a welcoming banquet for the city's new Consul. As it happens, the Dalmascan resistance decides to take that opportunity to do the very same thing, as does a Sky Pirate (Balthier) and his companion (Fran). It's all one major snowball from there of course, and we'll leave the rest of the craziness up to the storytelling wizards at Square Enix to tell. But know this: Final Fantasy XII's plot has more ups, downs, and surprises than any other title we can remember this year.One of the reasons the story works so well (besides the support it garners from its adult dialogue, excellent voice acting, and multiple red herrings) is thanks to its inspiration. Borrowed from the offshoot Final Fantasy Tactics universe, the world of Ivalice is completely different in theme to those of previous installments. Though it still has its own brand of Chocobos, Moogles (which have been redesigned, by the way), Airships, and other Square Enix staples, its flavor is decidedly European. This newfound direction and influence goes a long way in making old hats feel new again, and this fresh approach affects everything from the style and sound of the game to what would normally be recognizable character archetypes. It's somewhat evocative of what a videogame would be like if Terry Gilliam was involved... sort of an ~Adventures of Baron Munchausen on Magicite.~    Perhaps the most admirable trait of Final Fantasy XII's narrative, however, is that its depth of character and sheer quantity of surprises continues to hit all the way to the end. Despite how much attention Ivalice has garnered in the several years since it was first announced, most players will have no idea what to expect when going in. This simply isn't the game you probably think it is, and that's goes for you even if you've seen every screenshot, watched every trailer, or read every preview. Final Fantasy XII is whole lot more than what Square first let on. That kind of surprise is truly a rare thing to behold in an era dominated by Internet spoilers and the availability of 10,000 import FAQs before software even comes out.Square Enix has kept the secret of its fiction hidden so well because, since all of your characters come together near the start, Final Fantasy XII capitalizes on the opportunity to tell you about them. There's no need, like in RPGs past, to rush through a sudden story arc in the final five hours of the game just because some new badass was introduced. Conceptualist and scenario plotter, Yasumi Mitsuno (Vagrant Story, Tactics Ogre) really outdid himself by capturing the elements of storytelling that TV shows like Lost and 24 have built a following on -- by evolving the personalities, histories, and motives of characters you already thought you knew, but didn't. There really is no limit to how many great things can be said about the story.  But enough about Final Fantasy XII's plot, we've said enough about its brilliance already. What about the game's biggest gamble, it's entirely new combat system? The short answer, if that's all you're looking for, is that it's outstanding. Completely different than the offline Final Fantasies before it, while borrowing a few things from the online-only Final Fantasy XI, FF12 benefits from a battle mechanic unlike any other. Sure, it'll take some getting used to, but boy is it worth it.Now a big mistake that many have made when coming into FF12, of course, is that the new battle mechanic is action-oriented and not turn-based. In reality, Final Fantasy XII still relies on a turn-based engine (much as the old games did), but it just disguises that fact with a clever use of time bars and simultaneous character movement. This means that the camera is now entirely free (allowing users to move their view to any angle they like) and that enemies are no longer randomly encountered -- you can see them and their behaviors in real time just as you do your own.  Once combat initiates (be it your fault or your enemy's), a quick tap of the X button brings up everything you need to go. Attacks, items, magic, and techniques can all be accessed from a single HUD window, and if you don't want to engage, holding down R2 allows you to flee (though that doesn't mean you're safe... you'll literally have to run away if you want to make it out alive). Regardless of whatever commands you may choose, however, what happens next has your typical; RPG start... that is, monster damage and speed of attack are determined by the numerical stats of your characters.But not so fast! If that's all there was to it, then Final Fantasy XII would be somewhat ~by the numbers~ in the combat department. What makes it different from the competition is also what makes it shine. To start, the enemies here actually have AI, unlike the standard ~hit me until I die~ mentality of most games in the genre. The creatures of Ivalice don't hold back at all. Even in the first few hours, players will learn for themselves that the enemies of FF12 attack in packs, run away when threatened, summon debilitating magicks whenever they can, and generally kick your ass. It's quite refreshing actually, and it adds a lot to the experience.    Another welcome addition to Final Fantasy XII is its ~Gambit System.~ Previously, this system was compared to the preset AI commands of .hack or other titles with similar ~character macros,~ but Square Enix has taken that idea to a whole new level. Using the Gambit, gamers can customize the behaviors of their partymates with an unprecedented amount of detail. In fact, you'll be able to program up to 12 separate situations that each individual character can react to and order them into a hierarchy of importance. So if, for example, you want Penelo to cast ~Heal~ on a teammate that's been wounded to the point of having only half their HP, and then immediately attack the nearest foe, you can do that. Or, you can get even more specific... if you want Basch to use Eye Drops only on Ashe once she's been afflicted with Blind, you can do that too. It's a pretty remarkable little system to say the least, and one that can be switched on and off with the tap of a button (for one character, two characters, or even all of them).  Though it may bother micromanagers, Gambits can be lifesavers in most combat scenarios -- especially those that require quick reactions and a need to focus on the conflict at hand. It's also understandable if the AI-driven behavior is viewed as an instance of the game ~playing itself,~ thereby making it less appealing for action-minded users. But while that's a totally plausible argument in theory, that doesn't make the game any fun -- and without the input of a human who can adapt to whatever situation presents itself, it would result in far too many premature deaths to make it entertaining (which is the whole point of playing a videogame in the first place). In other words, you're encouraged to use Gambits but can't fully rely on them.One area that's not as easily forgiven, though, is the fact that there are higher level or ~rare appearance~ monsters that engage you when you least expect it. This means that while you're out smashing Hyenas or other inconsequential foes in the Giza Plains, for example, that a pair of ultra-powerful werewolves may show up and hand you your hairless pelt in just a couple of hits. This can and does happen with a startling bit of frequency too, so unless you're paying attention to the battlefield at all times and are understanding of the target icons and what they mean (blue targets are easy, yellow is moderate, and red is difficult), then you can expect to die with some regularity. If you listen to all the NPC advice in the opening city of Rabanastre, however (learn and use Libra right away! It shows you enemy strengths and weaknesses), and make good use of your flee button, you'll have a much better chance of survival.  One of the most compelling additions to the Final Fantasy XII world is the advent of the License Board. Built on the same concept as FFX's Sphere Grid system, the License Board allows users to customize their characters as they level up in the exact way they see fit. The difference between the two systems, though, is that there aren't any real affinities here. FFX would start each character in specific areas of the grid and leave it up to the user to go from there; whereas FF12 puts everyone's starting point at pretty much the same spot. On a personal level, I miss the focus on ~playing to strengths~ that Final Fantasy X offered, but still found myself addicted to building a better fighter through the license board. Regardless, it encourages frequent fighting to earn said License Points, and since combat is one of the game's strengths, we're all for it.Don't think that the story and battle system are all that Final Fantasy XII has to offer, though. The game's visual engine is among the best ever seen on the PlayStation 2, and the incredible amount of detail, activity, and fluidity of everything seen on the screen at once is quite a technical feat. Each and every model, down to the most obscure NPC, has an immense level of attention paid to them -- from their clothes and facial expressions, to their walking and idle animations. It's truly an impressive sight.    This sort of high-end presentation isn't limited to only the visuals of course. As mentioned earlier, the voice acting in Final Fantasy XII is top notch and is supplemented nicely by a solid musical score (though admittedly, it isn't the best in the series by far -- IV, VI, and X blow it out of the water). Moreover, the load times (while appearing often) are almost non-existent in length -- making them a bit of a non-factor. There's also an absurd amount of extra stuff that players can enjoy about the world of Ivalice -- including a fully-featured Bestiary (complete with animal origins), a Sky Pirate's Den (that awards trophies for accomplishing specific feats), bounty hunting sidequests, Chocobo riding, airship flying, secret unlockable limit breaks (called Quickenings), and plenty more.  If you're lucky enough to have nabbed the limited ~Collector's Edition~ version of Final Fantasy XII, there's even more to get your hands on. Boasting an extra disc, the set includes a cool ~History of Final Fantasy~ documentary (which is a little light on info, but is still entertaining), an interactive art gallery, interviews with the developers, and a collection of every FF12 trailer in history. It's a fun little supplement for franchise buffs, and should give you plenty more to do even after the game portion of Ivalice has come to an end.But the big question is, ~With all this RPG greatness being thrown around, is there actually anything wrong with it?~ Unfortunately, no game is ever worry-free and with that in mind, FF12 does have a couple of bothersome (if not miniscule) issues. The fully-rotational camera, for example, can't be customized and (by default) moves in the complete opposite direction of most 3D games -- so expect a learning curve with that one. Additionally, most of the cities in Ivalice are unnecessarily large and require a lot of navigation/ backtracking thanks to the heavy amount of fetch questing that users have to endure along the way. Throw in a slight difficulty when earning money (sell, sell, sell!) and a few bizarrely-designed dungeons, and you have a couple of points of contention. Then again, the game is so blasted good that it's easy to overlook all this when weighed against the bigger picture.Final Fantasy XII is a fantastic RPG. It blows all of its PS2 competition this year right out of the water and is among the all time elite role-players ever made for the system. Kingdom Hearts, Devil Summoner, Xenosaga III, Tales of the Abyss... none of them are on the same level as Square Enix's bold and riveting move in a new direction. Whether you're a fan of the genre or not, FF12 most certainly deserves a special spot on your PS2 game shelf... put it in the front.", "date": "Oct 28, 2006"}