{"name": "Mario Hoops 3-on-3", "name_review": "Mario Hoops 3-on-3 Aussie Review", "ref": "https://www.ign.com/articles/2006/10/31/mario-hoops-3-on-3-aussie-review", "text": "Square Enix and Nintendo - a graphical match made in heaven, apparently. Mario Hoops 3-on-3 is doubtless the most polished DS game yet in the graphics department. It's a shame that the rest of the game fails to live up to the same high standard.   Four modes of play are offered - Challenges, Tourney, Exhibition and Matchup.  Challenges, as the name implies, features a handful of challenges designed to fine-tune your B-ball court prowess. The first, a very basic training mode, is likely your first port of call and will flash wildly and invitingly until you try it out. Which frankly, you'll need to because, if you're anything like us, you've already jumped straight into a game and gotten your butt handed back to you on a plate.   See, as pick-up-and-play-friendly as most DS titles are, Mario Hoops 3-on-3 is a little illogical in its approach to using the stylus. The DS is held akin to the way it is for Metroid Prime Hunters - left hand on the D-pad and L button, right hand holds the stylus. This configuration allows for maximum precision, while keeping your character moving with the D-pad.   With the stylus in hand, you can perform a multitude of actions. Although your character automatically dribbles as he or she treks the court, you can speed up that dribble by rapidly tapping the touch screen. This is critical for accumulating coins and power-ups that are obtained through flat '?' boxes on the court. Simply move your character over the top of the box and commence the tapping. Your character's arms will shift with the position of the stylus tapping, so you can actually obtain quite a fine degree of control over the position of the ball in relation to your character.   This control helps quite a bit later on, when the AI becomes really aggressive and will take swipes at your character on a whim. Defensive manoeuvres are critical too - learning to pass with a diagonal swipe and shifting characters by holding down L and directing the stylus towards another character become second nature after a couple rounds of play.   However, the AI is pathetically easy early in the game's Tournament modes. They will happily stand around, allowing you to accumulate in excess of a hundred coins or so from a couple '?' blocks before allowing you to charge up a mid-court shot by holding the stylus down for 4 seconds without interruption. Suddenly, within the space of 3 or four minutes out of five, you're up 500 coins to zilch.    In fact, it isn't until you've unlocked Square Enix's Final Fantasy characters for play that you really begin to get punished. In fact, the speed and skill of these characters put Nintendo's roster to shame and deeply unbalance the later game. They are also much more skilled than your own AI team-mates, who aren't proactive in the slightest. For shame.      Despite this, there is an undeniably fun game to be found here - the courts themselves are DS masterpieces. Square Enix really knows how to pump out the best 3D on Nintendo's handheld. Between Mario Hoops and the upcoming Final Fantasy III, this is some of the tastiest eye-candy on the system. Courts are littered with environmental hazards, such as rolling barrels in DK's level, a shifting tide on the beach, ball-stealing ghosts in Luigi's Mansion and so on.   The characters are wonderfully rendered - Mario himself hasn't looked this cool in a long time. There are plenty of effects on screen too - transparencies, excellent textures, lighting effects, all wrapped up in a buttery framerate. Particularly cool are the special shots each character can perform, activated by tapping the outline of their letter twice in quick succession - M for Mario for example. Unfortunately, as cool as they look, they are also totally unblockable and fairly easy to pull off with a bit of practice. They are definitely cheap and nasty, if very pretty.   Multiplayer modes are included - a card-free download play with limited features, such as the ordinarily single-player coin race and a 4-player battle. The multicart play is limited to 4 players, which is a shame, considering it is a 3-on-3 game.All things considered, Mario Hoops succeeds much more than it fails. It's just unfortunate that the main game's flaws are so noticeable and hamper the latter levels greatly. It is unusually beautiful and finely produced for a DS game too - the sort of game that makes the most of the DS Lite's ultra-bright and crisp display. A little more focus on the AI and balancing would've taken this game to the gold medal podium.", "date": "Oct 31, 2006"}