{"name": "Final Fantasy XII", "name_review": "Final Fantasy XII Original Soundtrack (US)", "ref": "https://www.ign.com/articles/2006/10/31/final-fantasy-xii-original-soundtrack-us", "text": "Longtime fans of Final Fantasy have gotten used to the work of Nobuo Uematsu, the masterful composer who scored the first eleven games in the series. His compositions are complex and varied, deftly able to evoke exactly the moods needed for the rich, textured stories of the Final Fantasy games.    For Final Fantasy XII, Square Enix turned to Hitoshi Sakimoto, whose equally impressive resume includes scores for Radiant Silvergun, Tactics Ogre, Vagrant Story, Gradius V and, of course, Final Fantasy Tactics. His take on the Final Fantasy universe is less cinematically informed than Uematsu's, and a little less varied. While the appropriate quiet moments do exist on the score, a good deal of the composition seems to be building to an epic battle.    This is evident from the beginning of the CD. The ~Opening Movie~ and ~Boss Battle~ selections start big and stay that way, and much of the score follows suit. In fact, it is hard to imagine the game (or any game) maintaining the non-stop epic nature of the score. Picture the Star Wars Theme playing over many of the moments of the film, and you have an idea of what we mean.     This is not to say some of the bombastic tracks aren't fun. The pace-setting ~Opening Movie~ is a great standalone piece, and tracks like ~Discord (Imperial Version)~ show that Sakimoto has range beyond the pomp and march of some of the earlier tracks.    In addition, ~Nalbina Dungeons,~ which is menacing in a quiet way, provides a good change of pace to the at times overly majestic fare. ~Chocobo Theme (FFXII Version) is another welcome selection, injecting some whimsy and fun into an otherwise serious affair.   However, the main problem with the score overall is that although it all sounds good, none of the tracks stick out in the way that FFVII's ~One Winged Angel~ did. Indeed, this sounds like music that accompanies an experience rather than one that shapes it.    The US release of the soundtrack trims the song count considerably, but this is welcome; four hours of Final Fantasy score can get a little bloated and repetitive. The US soundtrack is 31 tracks total, and this thumbnail view of the total work provides enough of a sample to sate all but the biggest fans.   The CD packaging itself is nice and should please FF aficionados. There is plenty of art from the game and the disc comes with a separate DVD featuring Angela Aki's ~Kiss Me Good-Bye,~ and a Final Fantasy XII sticker.   If you like your music stately and over-the-top, you'll love this soundtrack. If you prefer a little more ebb and flow, however, you would do well to pick up some of the previous scores.    Definitely Download  1) ~Discord (Imperial Version)  2) ~Chocobo Theme (FFXII Version)~  3) ~Kiss Me Good-Bye,~ Angela AkiSince it's possible to play as your PS2 or PC characters on the Xbox 360, it's worth picking this one up if you're seeking a graphical upgrade. Of course, that's assuming you've already been playing the game previous to this release, own an Xbox 360 and an accompanying hard drive. Otherwise, it's best to stay away. If you're a curious Xbox 360 owner looking for a new role-playing experience, know that FFXI isn't what you're used to if you've never played an MMORPG. It's a game that requires hours of dedication on a near-daily basis. This wouldn't be a problem if the game was better, but unfortunately it comes off as unnecessarily inconvenient, clunky, and just plain old on the Xbox 360. If you've never played FFXI before, this version gives you little reason to start.", "date": "Oct 31, 2006"}