{"name": "Nacho Libre", "name_review": "Nacho Libre Review", "ref": "https://www.ign.com/articles/2006/11/01/nacho-libre-review", "text": "You know, my original reaction to the announcement that Majesco would be publishing a game based on Nacho Libre was one of a dumbfounded ~what?~ Admittedly, it's a bit of a reach to create a videogame based upon a dry-humor wrestling flick, but then if they can make cellphone games based on Napolean Dynamite...sure, more power to you, I guess. At least there's wrestling to focus on in Nacho Libre, so at the very least you can have a development team fill a niche that THQ and its WWE license has yet to capitalize on the Nintendo DS.   But the final product? Nacho Libre's a real stinker. The game has merit: a unique graphic style, a variety of games outside of the main wrestling design to beef up the variety. And, hey, Jack Black's the star, and clearly the Nacho Libre license granted Majesco the ability to throw his likeness all around the product...something that other movie-based games seem to have trouble accomplishing. The problem is that the wrestling core is so unbalanced that it's simple to beat in single player, and awkward to play in multiplayer. And the mini-games are so dull and uninteresting, and one in particular just doesn't even work the way it's supposed to half the time.    While I'm definitely not among the people that loved Nacho Libre the flick as much as I appreciated the director's more popular -- way funnier -- Napolean Dynamite, I could see where some people would enjoy such a film. For a game to be based around Nacho Libre, one would hope that said game would encapsulate the feel of the movie. The movie isn't a wacky off-the-wall kind of comedy. With the exception of the occasional punch to the face in visual humor, the flick's dry and a bit subtle, the kind of movie where the lines and situations aren't immediately humorous. Definitely not a style hat you can capture in a videogame.   So, instead, Budcat went in a completely different direction. They went all slapstick. There was a bobblehead in the movie, so now everyone's a bobblehead. All the cutscenes feature characters with their heads bouncing all up and down all funny and stuff. Look! It's hilarious! Their heads are bouncing! Isn't this funny?   This style is pushed to the wrestling as well. Characters aren't 3D models -- they're bodyparts cut out and pasted together. It's a technique that Natsume did with the WWE wrestling games on the Game Boy Advance. It allows for eerily fluid animations, and in the case of Nacho Libre, the designers can manipulate these characters almost as well as a 3D model -- the viewpoint will shift around on occasion, moving from a side-on view to more of an isometric perspective at certain points in the action. And since the wrestlers are pasted on body parts, the designers work in some slapstick wrestling moves -- heads will get knocked off, arms can get pulled off. Definitely strays from the style of the movie in favor of ~let's whack the players over the head with something funny.~      I can forgive Budcat for taking the feel of the movie into a different, more extreme direction. What I can't forgive is the fact that this wrestling game hasn't been polished as well as it should have been. Once you realize the game's all about getting the grapple in before the other person, the challenge is over. Players can play the solo outing in its entirety in about an hour and unlock everything.    Of course, the game should be better in multiplayer, and at the very least the developers put in single cartridge support so that players can challenge each other in the ring. But again -- completely unbalanced. Player attributes are never on display until they're in the ring, and when a faster player enters into the ring with a stronger, slower character, the faster character can pretty much win all the time since he can get his grapple animation completed first. This game's over before it even begins.   On top of all of this, the mini-games constructed for Nacho Libre feel like they've been developed in the course of a day. None of them are any fun -- tap bees before they sting Steven, avoid cows by sliding left and right in a three-lane obstacle course, play a slide puzzle to make salad. The touch-screen basketball hoops game is almost broken, with inconsistent and wonky control that makes winning a crapshoot.I always saw Nacho Libre for the Nintendo DS as a gamble for Majesco when they made the announcement -- I mean, how can you take this oddball of a move and turn it into a desirable videogame? But hey, it must've been a cheap license to acquire; I'm sure the bidding wars on the brand weren't very heated. Or existent. There's a solid shell here in this Nintendo DS product. There are a ton of extras, and it's nice to see all these Nacho Libre elements, like snippets from the movie and publicity shots, as well as Jack Black instead of some lame look-alike that most flick-based games have to resort to. What Nacho Libre lacks is fun and balance. It's a weak wrestling game with weak mini-games to supplement it, which is a shame because it was an opportunity to sneak in there with something significant -- THQ still hasn't worked any sort of wrestler on the dual screen system yet, and it's about time that one shows up. This one misses the boat.", "date": "Nov 1, 2006"}