{"name": "Elite Beat Agents", "name_review": "Elite Beat Agents Review", "ref": "https://www.ign.com/articles/2006/11/01/elite-beat-agents-review", "text": "Ever since Parappa the Rapper popularized the rhythm genre on the original PlayStation close to a decade ago, development teams have adopted their own styles and controls to create games that focused on the player's ability to, essentially, tap to the beat. Ten years later the genre the beat goes on, with games such as Donky Konga on the GameCube, Rhythm Tengoku on the Game Boy Advance, and Guitar Hero on the PlayStation 2 taking the spotlight. On the DS front,  Nintendo last year introduced the Japanese world to Osu! Tatake! Oendan!, a touch-screen controlled rhythm game with a flair for the outrageous. Awesome as that game was, it was locked down as an import-only release for US gamers because, honestly, its design and soundtrack focused too much on Japanese appeal so much that a straightforward Western conversion just wouldn't have as much mass-market appeal as this fantastic game truly deserved.   Enter Elite Beat Agents, Nintendo of America's answer to Osu! Tatake! Oendan! New characters, new themes, new stories, new songs. The only thing that hasn't changed within Elite Beat Agents is its amazingly addictive, energetic gameplay that will truly challenge even the most practiced of rhythm fans. Though you Dance Dance Revolution freaks can bring your heart into this game, Elite Beat Agents is different enough to throw a few curveballs in your direction.   The Elite Beat Agents are a special force dedicated to helping the truly needy through the power of song. It's a ridiculous, outrageous idea but one that really sets the stage for the game's theme, and it gives the designers creative license to construct some of the most out-there situations without feeling silly. The story's told through both dance on the touch screen, as well as through manga-style comic book panels that pop up to show progress between breaks. It's hard to tell if it's a chicken or egg thing, but many storylines feel like they've been worked around the music that accompanies them: Madonna's ~Material Girl~ for a level that follows a Paris Hilton/Nicole Richie pair stranded on a deserted isle; Deep Purple's ~Highway Star~ accompanying a dog's four hundred mile hike back home.       To progress through these levels, players help the Elite Beat Agents do their thing by following the set pattern that appears on-screen, using the stylus to tap these fat numerical buttons to the beat of the song that's blaring through the speakers. Each dot is surrounded by a halo indicator that shrinks around the button to let players know when it's time to tap it. Initially it's what you want to look for, but realistically this halo is secondary to simply following the order as well as the rhythm of the song. In addition to tap buttons are drag bars where players must follow a long string by holding the stylus down and following an on-screen ~ball~ until the end of the beat. In some portions of songs, you'll have to spin a wheel as quickly as you can before the break -- this is probably weakest of the gameplay mechanics, but it does offer a different challenge on top of the usual ~tap and drag.~     Like most rhythm games, practice really does make perfect. Each song has different levels of difficulty, but each version has a set pattern, so if you screw up midway through a song, what you've already accomplished has strengthened your potential for the next try through. Because Elite Beat Agents is such a unique rhythm game, it'll be rare that you'll be able to get through most songs on the first try -- in fact, in the deeper levels, you'll be playing through the same song dozens of times to beat it. But even with this repetition, Elite Beat Agents never feels repetitive. It has this ~I can get this...one more try!~ element that's hard to shake. A specific song might kick your ass over and over again, but it's hard to get discouraged because the design is so addictive, and you'll know that kicking its ass will take just one more attempt.   And even when the game's over, it's not. Beating the game on Normal is a rewarding feat in itself, but that just opens up the hard mode as well as a couple more songs that weren't in the original play through. Getting through that challenge opens up one more track of difficulty. There are more than a dozen and a half songs in Elite Beat Agents, and if you do the math, averaging three minutes of play for each song, there's several hours of single player gaming since there's absolutely no possible way any human could complete this game perfectly in his first sitting. And even when that happens, this Nintendo DS game has a team-based four player competition mode -- if you've got multiple carts you get the whole library of songs that the host has unlocked. For those with only one copy of the game, there's a sampling of songs in Download Play. Either way, multiplayer extends an already great game further than the original Osu! Tatake! Oenden! ever did.      The game's so tightly developed as a rhythm game that it's hard to criticize such a solid and established design. Everything flows extremely well -- the designers created a touch screen environment that gives fantastic player feedback using meaty audio and visual cues. The game has such a unique, energetic presentation with awesome surprises throughout the production. The only honest critical element is in the choice of soundtrack, where some people might find songs like ~Sk8er Boi~ a little too ~pop~ or ~I Was Born to Love You~ a little too ~fluffy~ for this type of game. But the covers in this pack are fantastic -- specifically, the version of Chicago's ~You're the Inspiration~ is easily the best cover since the original 80s tune, and the designers do a fantastic job in enhancing this song to an emotional high with an amazingly heartfelt story.Westerners who've played the original Osu! Tatake! Oendan! might end up a little disappointed that the Nintendo of America version might lack the kitschy Japanese flavor with its bandana-adorned personal cheerleaders and incomprehensible J-pop tunes accomodating the quirky, lost-in-translation stories. But even with new characters, popular Western tunes, and plots that actually make sense, Elite Beat Agents retains the awesome, addictive gameplay core.And let's be honest: the Elite Beat Agents are too cool for school and could kick those pansy bathrobe-wearing cheerleaders' asses any day of the week.", "date": "Nov 1, 2006"}