{"name": "Dungeon Siege: Throne of Agony", "name_review": "Dungeon Siege: Throne of Agony Review", "ref": "https://www.ign.com/articles/2006/11/03/dungeon-siege-throne-of-agony-review", "text": "Fans of hack-n-slash games have few choices when it comes to Sony's handheld. Like first-person shooters, most developers have shied away from them. Players have a choice between Untold Legends and, well, the Untold Legends sequel. Which is strange considering the portability of action games. No matter - players have a little more choice now, thanks to Dungeon Siege: Throne of Agony.   Coming out of SuperVillain Studios, Throne of Agony takes the original Dungeon Siege formula from the PC original and tweaks it for a portable audience. And it did a good job of it, too. It still plays like a Dungeon Siege game, which should please old-time fans, but it also welcomes new players through a few critical changes. This makes Throne of Agony play differently than its predecessors, make no mistake about it, but it certainly feels like an extension of the series, and not something completely different. It also looks and sounds damn good, so it definitely shares in the high-quality presentation of its older brethren.    Chief among the changes is the way characters actually fight. Instead of simply clicking an enemy and watching the hero attack him, players now execute each blow manually by pressing the appropriate button. This makes combat far more dynamic and visceral - something that mobile gamers will really like. Throne of Agony also grants full control of characters through the analog stick. Players can access everything from magic spells and special attacks to healing items and map control from within the game. Aside from serious micro-management of items and inventory players never need to pause the action. All that matters is beating the snot out of demons and assorted evil things.   The game starts with a choice between three characters. Players can choose between the mage, fighter and ranger archetypes, and thankfully each plays very differently. After choosing a character class, the game offers secondary choice involving pets. Every bit as important as character selection, pets can greatly swing the flow of battle. The developer made them an essential part of the experience and it's therefore a super important decision. They all make sense, too: if a player choose to play a mage, for instance, their pet selection will include a total bruiser, like a giant goon made of a stone. Conversely, should someone choose the brawny fighter, then their pet selection will include a mage for healing.   And it doesn't stop there. Each pet gains experience just like the main character, so that opens a new venue of customization. Each pet, from the agile archer to the powerful mage, has their very own set of special attacks and abilities. It's entirely up to the player which attributes and techniques to enhance, which is done through a simple point system, like in the average role-playing game. Players acquire multiple pets, too. Eventually there's a small army of pets to choose from, each with individual strengths. It's then a matter of choosing the right one for a specific situation, which adds a good deal of strategy to the game. True, it would have been cool to have a greater selection of main characters, but the game makes up for it through the in-depth pet system.   Combat itself is fast-paced and just the thing for hack-n-slash fans. In addition to a character's main attack, Throne of Agony lets one assign special techniques individually. Players can define the circle and square buttons, as well as a combination of face buttons and shoulder triggers. This helps maximize the potential for each ability since they're all super easy to use.       Enemy characters use a combination of range and melee attacks, like in the PC version, so no surprises there. Discerning fans will even notice a few familiar faces in the enemy roster, too. For the most part, enemies aren't too tough. Players will roll into a dark forest or barren desert and generally lay waste to everything in site.Not so much when it comes to boss characters, which actually look pretty snazzy in Throne of Agony, but overall enemy difficulty isn't too tough. This is due to a combination of good loot, which enemies drop constantly, and the ease of which players acquire new weapons, armor and items. And again, pets help a whole lot.   Accessibility happens to be one of the most impressive things about Throne of Agony. Anyone who played the original Untold Legends knows how sluggish a game can get when there's tons of information, such as inventory, to access. This is simply not a problem here. Pressing the left shoulder button uses a healing item, while pressing both shoulder buttons uses mana potions. It's also possible to press right on the D-Pad to call up a mini-menu with important items, which includes consumables and miscellaneous stuff. This helps keep a player focused on slashing bad guys and not struggling to drink a health potion. And accessing everything happens quickly, too. It's not instantaneous, but there's very little lag.    The in-depth menu, called by pressing select, organizes objectives, maps and characters stats very well. It's a tabbed system, like in many games of this type, but the information is thankfully easy to read and easy to cycle. Sounds like an odd thing to praise, but it's something developers haven't really nailed so far on the PSP. And speaking of quests, Throne of Agony offers a ton of them.   Many of them deal with similar circumstances - players will need to investigate strange disappearances and retrieve items quite a bit. The good news is that each quest usually has a fair bit of story to go along with it. Throne of Agony rarely gives out fetch quests arbitrarily. It happens, just not as often as in many action role-playing games. Plus, the locations and environments help keep things fresh - especially the visually rich overworld map and locations found later in the game.    Throne of Agony includes multiplayer (ad-hoc wireless), which lets players join friends in the main quest. This is far better than just offering a simple dungeon to play. Every player can bring in their pets, too, so parties can get rather formidable. And yes, it's as fun as it sounds.   Throne of Agony offers the Dungeon Siege experience, albeit tweaked for a mobile audience. Combat is more dynamic and visceral thanks to these changes, though old-school fans may long for the point-and-click interface of the original. Along with great presentation and accessibility, Throne of Agony offers a lengthy quest filled memorable locations and snazzy enemies. Some of the quests will feel a little shallow, but overall the games strengths outweigh its weaknesses.", "date": "Nov 3, 2006"}