{"name": "Virtua Cop 2", "name_review": "Virtua Cop 2 (Import)", "ref": "https://www.ign.com/articles/2000/03/03/virtua-cop-2-import", "text": "Mmm. Virtua Cop. Yu Suzuki's original 3D shooter redefined light gun games, replacing the generic FMV of games like Mad Dog McCree with polygonal environments, populated with gangsters galore, exploding stuff aplenty, and boatloads of Sega in-jokes. When we heard Virtua Cop 2 was Dreamcast-bound, we rejoiced  finally, the Model 2 arcade game would get the perfect port it so rightfully deserved. Then we got to play it, and our opinion changed pretty quickly. This isn't the arcade Virtua Cop 2 -- it's a Dreamcast port of the PC port of the Saturn port of the arcade version. And it uses Windows CE. ~Uh-oh~ is right.  Let's get one thing straight  if you've never played the Virtua Cop games, you've been deprived. These are some of the best gun games ever (and direct forerunners to the House of the Dead series), and deserve to be played in all their glory on a 52~ projection screen. At the very least, the core gameplay remains in the Dreamcast version  you play as Janet, Smarty, or ~Rage,~ the three police protectors of Virtua City. All hell breaks loose as a ruthless criminal syndicate takes over the once-peaceful metropolis, and the only way to stop them is to kill them all.  One shot drops a bad guy, and shooting them in different locations yields different results (blast the gun out of their hands for the ever-elusive ~Justice Shot~). Just be sure to avoid innocent civilians, who occasionally leap into the screen, screaming ~Don't shoot me~ with a heavy Japanese accent. Breaking up the gangster slaughter are the branching pathways  there are two roads through each level, which you can select by shooting at a road sign midway through the stages.  So, yeah, the game is there  but the presentation is utterly pathetic. For starters, the frame rate of the arcade version has been chopped in half to a comparatively lethargic 30fps. If the graphics had been super-enhanced in the Soul Calibur fashion, this might have been excusable  but the game looks terrible by today's standards, and the fact that Sega couldn't get it running at 60fps is a sign of raw laziness.  ~Enhancements~ in Virtua Cop 2 are few and far between. Some of the textures are improved from the Saturn version (though many are still pixelly as hell), there's a bit more on-screen detail, and the resolution has been jacked up to 640x480. And that's where the improvements stop. All of the characters were supposedly remodeled with three times the polygons of the arcade version  but damned if they don't look worse. Characters are oddly proportioned, civilians look like blow-up dolls with misaligned textures, and even the Virtua Cops look cheesy  why are they wearing penguin pants?  Even more inexplicable are the new special effects. When you shoot a guy, lightning bolts fly out of his body, and a blue shockwave lights up the surrounding area. It's almost like you're playing Tekken, and it's totally out of place in a game like this. I also can't figure out why ninety percent of the bad guys in the second episode look identical  they're all blond-haired, suit-wearing punks with sunglasses, and there's even less variety in baddies than in the Saturn version. Inexcusable.  You want extras? Hope you're satisfied for ~Big Head Mode~ and ~Mirror Mode~ (which were present in the Saturn version), 'cause that's all you're getting. After trudging through the game, I was hoping to unlock a ~60fps Mode~ or a ~Non-suck Mode,~ but received diddly-squat.  All in all, Virtua Cop 2 is a bastardization of a classic game that deserves a lot better. I hoped that Sega would port some of their other Model 2 classics to the Dreamcast, like Daytona and Virtua Fighter 2 -- but now, I'm not so sure. Bargain basement software like this has no place in today's market, and porting Sega's notoriously bad PC lineup to the Dreamcast is a Very Bad Idea. This better not happen again, guys. -- Colin Williamson, IGNDC", "date": "Mar 3, 2000"}