{"name": "Gears of War", "name_review": "Gears of War Review", "ref": "https://www.ign.com/articles/2006/11/07/gears-of-war-review-2", "text": "Left or right?   At a crossroads on the war-torn planet of Sera, you have a decision to make. Both paths are equally dangerous, with the Locust horde armed with explosive arrows and revving chainsaws, ready to tear you to pieces, either way. No, this debate is between you and your co-op partner as you argue over who will pick up that next COG tag, secret pickups that act as currency for heralded Achievements.    It's here that you truly realize what a masterpiece Epic has created in Gears of War. Yes, it's the most gorgeous looking game on the Xbox 360, period. Yes, the sound design is worthy of awards. Yes, the game is fun as hell. But playing with a friend, as you bark flanking orders into your headset over Live, or across the room during a system-link game, or right next to you in a split-screen campaign, you realize that Epic has created the 360 game we all hoped for, and that Gears of War more than lives up to the impossible hype.     And then you snap back to reality, remember that you haven't picked up that COG tag yet, offer some kind parting words to your co-op partner, and choose to go left, because you're Marcus Fenix, and Marcus Fenix goes where ever the hell he wants to.    Badasses on parade. Emergence Day  Gears of War takes place over the course of 36 hours on the planet Sera, what was once a civilized human planet of cheerful sidewalk cafes and flower-filled parks. No more. The population did not know that underneath every major city, the Locust Horde was digging. Underground monsters, of superhuman size and strength, with filthy complexions that could rival the ugliest of teens, the Locust are fearsome creatures. And on a sunny Sera afternoon, the Locust emerged.    The loss of life was catastrophic, or so it appeared in the opening sequence. The soldiers of the Coalition of Ordered Governments, or COG, fought valiantly, but failed. As the battle slipped away, COG soldier Marcus Fenix defied orders to try and rescue his father. He was caught and imprisoned. Fourteen years passed, and the Locust have closed in. As alien creatures take over Marcus's prison, an old friend opens the cell door, gives Marcus a gun, and asks him rejoin the fight.    Yes, Gears of War is a bit light on story. You are a soldier. There are bad guys. You must kill them. If fact, the only place you'll find the story tidbits above are in the instruction manual -- Epic assumes you already know all this. Without giving too much away, Epic does touch briefly on Marcus's father and Marcus's ~sham~ of a court martial, but this shallow story is a simple vehicle to drive the action. It's the manner in which Epic introduces us to Sera that is so fascinating.    Epic chooses to show instead of tell, using superbly directed cinematic sequences and bits of informative dialogue between Marcus and his fellow COGs: old mate Dom, cocky Baird, and former Crashball star Cole. The effect is a sweet introduction to the world of Sera and to Marcus, just enough to pique our interest, but not enough to give us a resolution. (Resolutions are reserved for sequels, unless you're Halo 2.) No, we never learn what happened to Marcus's father, even though one mission brings us back to the old Fenix estate. Chapter one in the Gears of War saga is all about one simple goal: to get to an underground mine and deploy the Resonator, a COG device that will map the Locust tunnels.    Along the way, you will fight through ~survival-horror~ missions, designed simply to scare the crap out of you. And eventually, you'll fight in large, open battlefields, taking on large numbers of Locust at one time before taking on the evil Locust general. Gears is light on story, but presents a very immersive and compelling atmosphere that sucks you right into the planet Sera. Any insight into the story of the war or into our protagonist's past will have to wait for the inevitable-but-as-of-yet-unannounced Gears of War 2.    But enough about the story. Let's talk chainsaw.   Vroom Vroom  The COG Lancer Assault Rifle goes down as one of the great weapons in gaming history, right alongside Link's Master Sword and Master Chief's sighted-pistol. At first glance, there's nothing particularly special about the fully-automatic weapon -- the bullets don't do much damage and it isn't particularly accurate at long range. But as you sneak around a corner and see an unsuspecting enemy with his back to you, you quickly run up, hold down B and rev the chainsaw bayonet, carving up your opponent in a bloody mess faster than you can say ~Thanksgiving Turkey.~ The ~vroom-vroom~ sound of a purring chainsaw is both a glorious thing and frightening thing.   Unlike in Halo, where you can circle strafe and jump eight feet in the air before planting an energy sword into an enemy's face, you have to work for this chainsaw kill. The core gameplay mechanic of Gears is the cover system. To get into cover, you simply run up to a wall, a ledge, a wrecked car -- whatever -- and hit A. You will be sucked right into cover, safe from enemy fire, for the moment. From there, you can blind fire, you can pull down the L-trigger to pop out of cover and then fire, or you can perform a variety of evasive maneuvers like SWAT turns and rolls.    Among the greatest kills in gaming history. Although the system works very well, there is somewhat of a learning curve, enough that some people will find it frustrating. After playing through the first of five single-player acts, you should have the system down. Keep in mind that the use of cover is what Gears is based on, and running out in the open ala ~insert arcade shooter here~ is a one way ticket to the blood-red game-over screen. The trick is not to run, but to move from cover to cover, advancing with your partner and squad, slowly pushing the enemy back, until you train the crosshairs of a sniper rifle on an ugly Locust mug and shoot it to a bloody pulp.    It's fast tactics. At first glance, Gears looks like an arcade shooter  -- the action is, well, fast, and there are a lot of enemies and friendlies moving around the battlefield at once. But at the same time, the solid AI is performing flanking maneuvers, advancing and retreating, and executing the very basics of armed combat. As you are ducking behind a tree, waiting for an enemy to reload, it's not hard to imagine that the idea for Gears and its cover system was born in the heat of a paintball game. As such, Gears is a special blend of an arcade shooter like Halo with a healthy dose of methodical tactical shooter like Rainbow Six. Either way, it's a wonderfully fresh take on the shooter genre that plays great.      There are, of course, a few concerns. The A button does perhaps too much. While excellent for grabbing cover, holding A also triggers the ~roadie run,~ a quick sprint where the camera takes an embedded-journalist perspective, making you feel as if you are running for your life (you usually are). But often times while sprinting, you will be sucked into a piece of cover against your will because you are holding down A. You get used to it. You get better at it. But it still happens enough to frustrate you when you're bee-lining to chainsaw your roommate during a multiplayer match and find yourself stuck behind a bombed-out sedan.   Also, up-close combat can feel a bit strange. Firing from the hip is difficult as the aiming is a bit slow, even with sensitivity turned to high. Sometimes you think you've landed a chainsaw only to be miss and take a shotgun blast to the kisser. These issues aren't enough to take away too much away from the fun gameplay experience, but they do show that Gears was clearly meant to be fought from behind cover.   The weapons of Gears of War are standard fare, with the exception of a few fantastic additions. There's the head-popping sniper rifle, the flesh-exploding grenade launcher, a variety of pistols as well as smoke and frag grenades. The frag grenades don't have a very large blast radius, but if you manage to get close to an enemy, you can use the melee attack to jam a frag in his chest, then roll away and watch your foe disintegrate -- simply awesome, if you don't blow yourself up in the process.    Epic also included the torque bow, a powerful Locust weapon that fires explosive arrows. If you can wind up the bow and hit an enemy, the arrow will penetrate and explode inside your opponent. Sweet.   You'll feel right at home on war-torn Sera. The other slick new weapon is the Hammer of Dawn. By lacing the target with an infrared beam, an orbiting satellite will lock on to your signal and fire down a destructive laser from the heavens, obliterating anyone in the blast radius. You only need open sky and a direct line of site to your enemy or the cover behind which he is cowering. As the laser fires, you can drag the targeting beam around to different enemies for multiple kills. It takes time to lock on and you have to expose yourself, but it's a great kill.   Each weapon utilizes a neat new reloading method called Active Reload. When you press the right bumper to reload, a meter will appear with a sliding reticule. If you press the right bumper in the ~sweet spot,~ you will reload faster. If you hit the perfect spot, your ammo will get a small damage boost. If you miss, you will jam your gun and it will take even longer to reload. It seems strange at first, but becomes second nature down the line and a nice risk/reward mini-game in the middle of all that action.   The Campaign  Gears of War is played over five acts, comprised of 30 chapters. The journey will take you through a number of exquisitely detailed and diverse environments, like city streets, the Fenix wine cellar, a speeding train and yes, even inside a mine cart. There's even a driving mission. Some of these chapters take no time at all -- the Outpost chapter in Act 2 takes about 30 seconds. All you do is run through a house and take a phone call, then boom! Next chapter.    Typically, however, each chapter consists of a few major battles between the COG and Locust. On the easiest difficulty level, you can breeze through the game in about seven hours the first time through. Your regenerating health system is generous, to say the least. Enemies are generally stupid, standing out in the open with a common death-wish. And your weapons cause considerable damage.    Now this is how you design a cave level. Not so on Hardcore difficulty. Enemies are aggressive and will attack your weak positions. You will be flanked. You will be pinned down. Some enemies will wear helmets, protecting them from head shots from the sniper rifle. And up close, it will be you who gets chain-sawed. Yes, the Locust are a mean bunch, and beating Gears on hardcore is a gaming achievement anyone could be proud of.    And then there's Insane. Insane is, well, insane. I couldn't get past the first chapter, the training chapter the first ten times through. You are forced to perfect the cover system. You can only pop out of cover for a moment, fire a round or two, and then dive back into cover before being killed. Even drones, the dumbest and most abundant of the Locust, provide a monumental challenge. They move fast, always in cover. They are accurate, deadly and work together. On Insane, each chapter triples, at least, in length as you have to be patient, sticking your head up only for the perfect shot. Don't even get me started on the other frightening enemies, like the screaming Wretches, the brutish Boomers, the giant crabs and the elite of all Locust soldiers, the Theron Guard. To beat Gears of War on Insane will go down as one of the great gaming achievements ever, like taking down Halo 2 on Legendary difficulty.   The three difficulty settings are perfectly balanced, and while Insane and even Hardcore will stifle you time and time again, you feel a great sense of accomplishment after reaching even the next checkpoint, let alone the next chapter. And that's why you call a friend.    Two player co-op play is available via split screen, system link and over Xbox Live, and the Gears of War co-op mode ranks among the greatest of all time. After beating the game on Hardcore with a friend, you will ask, ~Halo who?~ Epic designed Gears to be a co-op game -- your partner is simply controlled by the CPU during the single-player campaign. The beauty of co-op is that you truly work together, using suppressing fire that actually suppresses the enemy, and using flanking maneuvers to defeat the Locust. Sometimes your paths will split, and Marcus will take either Baird or Cole while the co-op player, Dom, takes the other. Usually you will be able to see your partner through a window or on a platform above and you can help as needed. But most of the game you are side by side, Marcus and Dom, looking out for each other. And on Insane, you will welcome the company.      A Tiny Warzone  While co-op gameplay is fantastic, the guts of Gears multiplayer action comes in the versus mode. Versus is fun and addictive, yet it is small in scope compared to other shooters, consisting of only team deathmatch crossed with last-man-standing with up to four players per team. Epic likes the eight-player set-up and, frankly, so do we. The maps are small, yet well designed, based on areas in the single player campaign. They are symmetrical, for the most part, with special weapons like sniper rifles and Hammers of Dawn located strategically around the map.    The main mode is named Warzone, which is a basic four-on-four deathmatch. There are two variations of this mode. In Execution, you have to get in close in order to finish off opponents. Instead of a kill, enemies are incapacitated and you have about 30 seconds to rush in and dispatch them with either a melee attack, a bullet to the head, a chainsaw or a curb-stomp, a vicious kick that smashes the head down to the ground. In Assassination, the round is over when the captain of the team has been eliminated.    It's important to note that these are just variations of Team Deathmatch, and while each mode is fun in its own right, we would have liked to see team capture the flag or a fight over strategic points.   Bad Locust. Bad. Locally, you can only play split screen versus, or one-on-one. Needless to say, four players on a big screen would have been a welcome option. Via system link and Xbox Live, two profiles can sign on and share a screen, at least.   This Is Next-Gen  Visually, Gears of War is the finest looking game on the Xbox 360. The environments are huge and diverse, and all beautiful. There is a tremendous attention to detail that some gamers will never even see, like gargoyle statues on the top of a skyscraper. No structure looks the same, there are no repetitive environments, no cheap double-backing. As in Half Life 2, when you fight in a city, you feel like you are fighting in a city. The art design is wonderful, with awe-inspiring architecture, inspired by the ancient Greeks and Romans, that make you feel as if you are fighting for something important. This is a game you need to see to believe, and it even looks great on a standard-definition set.   Likewise, the sound sets a new standard. A military-themed score transitions to spooky horror music and back, always setting the appropriate mood for the action. The voice acting is gritty and foul, just like Marcus and the rest of the COG soldiers, laced with locker-room profanity. The Locust are among the more frightening creatures you've ever heard. The drones sound like demon-possessed thugs, and the Theron Guard hiss out orders like rattlesnakes. Along the way the Locust picked up a bit of English, which makes their musings even more frightening. The effects, too, are spot-on. I've never heard a head explode or a chainsaw dismember someone, but I would imagine it sounds exactly like it does in Gears of War.   Do you have what it takes? No. Gears of War is a must-have game, pure and simple. Epic has effectively created a new gaming universe, and the rich story of planet Sera holds its own with the likes of Hyrule, City 17 and the Mushroom-friggin'-Kingdom. A game so gorgeous, both visually and aurally, that is this fun to play comes along only a handful of times a console generation. There is a healthy learning curve to the cover system, but those who master it will find Epic's twisting and turning and rolling an exciting change-up in the shooter genre, a blend of fast-arcade action and basic, tactical maneuvering. The Insane difficulty level gives Gears legs months after you've finished the relatively-short campaign, and even with a friend it is an impossible, irresistible challenge. Versus is a one-trick pony, consisting of a team deathmatch with three basic variations, but damn, that mode is fun. Downloadable content is on the way, says Epic, but as it stands today, we are left wanting more. Bottom line: Gears of War is the special kind of game that makes you feel like a kid again, a sadistic little bastard obsessed with gore and chainsaws.", "date": "Nov 7, 2006"}