{"name": "Lumines II", "name_review": "Lumines II Review", "ref": "https://www.ign.com/articles/2006/11/08/lumines-ii-review", "text": "Lightning striking twice.  The sophomore slump.  Sequelitis. Whatever you want to call it, there's always significant concern about a follow up to a successful title.  Usually, this is because the game can't recapture the magic that made its predecessor so engaging, comes off as a bland carbon copy or ranges so far away from the formula of the series that it might as well be a standalone.  But there are some titles that rise above these issues to surpass their predecessors.  For example, when Lumines came out at the launch of the PSP, it was considered to be a classic title for Sony's handheld that set the benchmark for puzzle games rather high.  Well, that standard has now been redefined, thanks to Lumines II from Buena Vista Games and Q Entertainment, which provides a larger, richer and more engaging puzzle experience.   Lumines II follows the standard puzzle genre ideal of being easy to learn, but hard to completely master.  The game revolves around manipulating falling squares comprised of four smaller blocks on a playing field.  Each block has one of two colors for that stage, and you try to maneuver these blocks into position by rotating them to form squares, rectangles or larger formations of the same shade.  These are cleared thanks to a continually moving time line that scrubs the playing field of colored shapes that you've formed, adding points to your total score. Any blocks placed on top of these eliminated squares tumble down below, potentially creating combinations of new shapes.  However, any blocks that don't match up to each other will start to pile up to the top of the screen, and when there's no other space available on the playing field to drop a block, the game is over.   Lumines II: easy to learn, hard to master. It may sound like a simple concept, but there are some definite twists to the game to keep you on your toes.  For one, since the game is a fusion of both puzzles and music, the time line that clears blocks won't always run at a uniform speed.  Tied into the rhythm of the particular song for the stage (or ~skin~) that you're playing, the time line will sometimes move quickly, cleansing the field frequently. Other times, it will move much more slowly, requiring a lot more patience and skill to set up your squares and combos.  This is countered with the speed of the blocks, which slowly increase the speed at which they happen to fall and enter the playing field.  Another tweak to the game comes with the inclusion of special blocks that give you the opportunity to clear any similarly colored blocks that are connected to it by edge from the screen.  This can come in handy when you're trying to dig out of a hole or grab some extra space on the playing field. Forming these kinds of large scale combos can actually advance a player through a skin quickly, as they clear enough blocks to pass to the next stage.   Veterans of the original Lumines will be rather familiar with these mechanics, but it's what's been brought to the table this time around that makes Lumines II stand out from its older brother in significant ways.  Tetsuya Mizuguchi and his team have remixed modes from the first game with features that weren't ever included before.  As a result, Lumines II is easily two to three times larger than the original title thanks to the amount of content included. In fact, while there were only four separate selections for the original title, Lumines II comes packed with nine separate sections, each packed with content.   Beck's Black Tambourine is one of the new music videos in Lumines II. Let's first take a look at the single player mode, which holds the beefed up Challenge Mode that makes a return to Lumines II with one of three initially selectable classes.  Class B is for beginners that are starting to learn how to play the game, while A is for intermediate players and S is designed for advanced puzzlers.  Just like before, players attempt to clear as many stages as possible to unlock new skins and earn new music.  For the exceptionally good player, you can also unlock an endurance challenge runs through every skin in the game.  Lumines II still packs in lots of J-Pop and rave inspired beats, but this time around it also comes with a licensed soundtrack including songs and music video skins from artists like Beck, Missy Elliott, the Black Eyed Peas and Fatboy Slim.  Unlike other skins, players can't ~fast forward~ through music video skins by clearing lots of blocks or creating combos, so you'll be stuck with them playing entirely through till the end of that particular song.    However, if you find that there are some songs that you simply can't stand hearing or playing through, you can reorganize any unlocked skins thanks to the newly included Skin Edit mode.  This mode has one of two separate options: the first one, Single Lap, lets you create a customized playlist of up to ten separate skins to play through, giving you a top score for completing the entire cycle.  The other one, Endless Lap, lets you select or exclude whatever skins you want to play as long as you'd like.  So if you get tired of hearing Gwen Stefani or Hoobastank during challenge mode, you can make sure that you never have to play their skins ever again.   Just be prepared to play through their skins once again if you're trying to unlock new music, as the Skin Edit mode won't give you access to later songs. In fact, there's a ton of songs and skins included in Lumines II -- You'll find easily more than sixty skins through a session of every single mode if you've played through the game before, as well as more than 50 characters that you can choose to represent you during the game.   There's now a mission mode, which gives you minor tasks to try to clear, such as eliminating all onscreen blocks in one move.  This joins older features that make a return to Lumines II, such as an expanded puzzle mode, which tests how good you are at creating various shapes presented to you with the blocks, like a giraffe, a UFO or a tulip. Time Attack returns as well, giving you the option to play through 60, 180, 300, or 600 seconds on a specific skin.  So does Vs. CPU mode, where you'll square off against a variety of computerized opponents in head to head play.  Unlike the Vs. CPU mode in the original game, this mode in Lumines II feels a tad bit easier than the previous one, so veterans may feel a bit dismayed by the challenge presented there.  In fact, you may find yourself quickly tracking down a friend and jumping into the duel mode via Ad Hoc play.  This head to head play is exactly the same as it was in the previous game, although it seems to be a wee bit slower than before thanks to some inherent lag during some matches.  Considering the speed of the single player game, you may find this a tad bit disconcerting when you're in the middle of a match and you've got to adjust for a half second or so hitch up every now and then on placing blocks.   Many of the skins have new visual effects and textures. Regardless of the mode that you choose to jump into, stat fans will be pleased to know that the game's Database mode extensively tracks everything that you do within your personal profile, such as how long you've played the game, the percentage of skins that you've unlocked and even how many total times you've completely cleared an entire playing field.  The Database also gives you access to saved replays of the 60 second Time attack mode and how your best performance during a challenge or other game ranks against the top scores in the game.  Lumines II also packs in tutorials and tips for players to improve their play, Game Sharing to other PSPs, lots of customizable options, and even a demo of Every Extend Extra for puzzle fans.   Of course, one of the things that makes or breaks a puzzle game is just how repayable it is, and Lumines II solves that in two separate ways.  The first is with the Data Exchange mode, which allows players to trade created play lists in the Skin Edit mode, replay data from the 60 second Time Attack Mode, and background music from the newly included Sequencer mode.  That's right, players can now create their own music tracks to play with, complete with sound effects and background skins, giving players their own flexibility in creating new ~levels~ for the game once they become bored with the older ones.  The sequencer will provide you with a variety of tempos that you can then speed up or slow down, as well as 8 separate music sheets to place notes and effects on.  It's a great way to improve an already deep game, and while it's relatively easy to get the hang of by messing around with the sequencer, it would've been nice if there were some instructions included with the mode for novices to music editing.   Fergie, you can't eat the Lumines blocks... Lumines II is much more eye-catching than the original thanks to the redesigned visuals of every skin.  Animated backgrounds and sharper textures match up nicely with the included music videos, which are a nice addition to the series.  There are two drawbacks, however: the first is that there's no way to actually view the music videos for each skin in a separate player.  Considering that most players aren't necessarily paying attention to the background as they're playing because of how focused they are on the game blocks, they might want to watch the unlocked videos at a later time, especially if they like a specific artist.  The other issue returns from the previous title, which is that some blocks can tend to fade into or blur into some background skin effects, making it hard to see what you're doing at times.  But these problems are tempered with a slicker presentation that draws you into clearing blocks and getting into that Zen playing state thanks to the beats that pour out of your PSPs speakers or into your headphones.Sometimes it's hard to improve on a good thing, but Lumines II has managed to expand on just about every facet of the first game.  A deeper challenge mode, tons of new skins and loads of puzzles and missions are just the tip of the iceberg.  Throw in the sequencer and Skin Edit mode, plus the ability to trade playlists with friends, and you have an almost perfect puzzler.  There are still a few issues, like some easier AI and some visual issues, but for what it's worth, Lumines II is an excellent title for the PSP.  Mizuguchi has done it again.", "date": "Nov 8, 2006"}