{"name": "Medieval 2: Total War", "name_review": "Medieval II: Total War UK Review", "ref": "https://www.ign.com/articles/2006/11/08/medieval-ii-total-war-uk-review", "text": "Make no doubt about it, the Total War series has produced some of the best strategy games the PC has ever known. With its mammoth 3D real-time battles, hordes of sword-wielding troops, deep turn-based strategic maneuvering and rich, captivating historical settings, it's no surprise the arrival of a new chapter is met with crazed anticipation.   The first installment whisked us away to feudal Japan, full of honour-bound samurai and deadly Ninjas. The second outing was a mud-strewn, brutal trip to Medieval Europe where toothless peasants raised their pitchforks against proud knights. And the third, most recent incarnation was a Gladiator-style foray to Ancient Rome, where well-drilled legionnaires pitted their civilised wits against drooling, wild-eyed barbarian hordes.    For this new edition in the blood-soaked franchise we return to the dark ages, back to Medieval Europe. Only this time, we are spirited away with all the visual splendor and strategic intricacy of the Rome engine. It's the dark ages, but not as we knew it.   For those new to the whole thing, Total War games are real-time strategy combined with a healthy dose of history books. This is not just yet another click-and-drag, resource gathering RTS, of which there are countless examples. The historical trappings here are no mere window dressing to yet another StarCraft clone or Command & Conquer wannabe - the history drives the gameplay. You can't chop down trees or pick berries in the middle of a battle, with which to build more troops. Here, once you commit to battle, you have to fight with what you have.    In the game rows of knights, spearmen, archers and cavalry, all resplendently arrayed with banners flying and weapons glinting, recreate the most famous clashes of the Medieval world. From the battles between the English and French, the struggle between the Moors and the Spanish for dominion over the Iberian Peninsula and the bloody Crusades in the Holy Land, Medieval II has it all. Deeper into the game you even get to invade the New World, taking your Western weapons of war to wipe out the Incas.   Choosing your faction from the biggest European and near-Eastern kingdoms of the age, it is your task to lead them to glory and conquest over your rivals. Once you've taken your throne it's time, as ever, to plan regional domination. Much of any Total War game takes place on a large-scale turn-based map. Here your settlements are built and fortified, armies recruited and maneuvered, and emissaries, assassins and princesses shuttled around the place.     From first impressions there's little to distinguish Medieval II's strategic map from the one in Rome: Total War strategic map, but you now have the choice of building up each of your settlements as either a town or a castle. Towns (that grow into cities) are much more lucrative and grow quicker, but are not all that well fortified. In towns you can recruit units drawn from the common plebs, such as archers, militiamen and peasants. Castles (and then citadels) are seats of military power, although they're less lucrative than other settlements. Extremely well fortified, here you can build all your hardcore units: Knights, cavalry and crossbowmen. Getting a balance between fortified front-line castles and weaker - though more profitable - towns in your rear areas is one of the more interesting new challenges on offer.   Elsewhere on the strategic map, resources can now be exploited by your merchants. These are a new addition to the line-up of richly dressed non-combat units who, incidentally, all now have little in-game movies whenever they complete a mission, a la Shogun Total War. Some of these resources may well be in enemy territory, allowing for all manner of economic warfare, creating monopolies over certain resources, putting unfriendly traders out of business - nothing you wouldn't learn in any modern business school worth its salt. But while this gives you something extra to do, don't expect it to raise the strategic layer to anything approaching Civilisation.    Instead Medieval II is primarily about going to war. Drunk on your early conquests quelling unruly local rebels, no doubt your beady eye will turn further afield, greedily settling on the rich lands of your neighbours. But just as you set off on some treacherous land-grab, another new addition introduces itself - a scroll from the Pope, which plops on your banqueting table (or at least it will if you are one of the Catholic factions). ~Planning ill-advised expedition to capture Jerusalem,~ it reads. ~Please send a large army or your Papal standing will go down the swannie and the next Crusade I order will be targeted at your ass.~ Not the Pope's exact words, admittedly, but these Vatican ordered missions really keep you on your toes and make for more lively strategic planning. On top of this your own council of bishops will regularly come up with tasks for you to complete, usually revolving around vanquishing someone slightly closer to home than the Pope's unending obsession with the Middle East, with some cash on offer usually the reward.   To a large extent, it's an absolute pleasure to return to the killing grounds of Agincourt, Hastings and the Holy Land, only now with visuals that entirely outstrip the now crude presentation of the first Medieval. It's astounding to behold the massed ranks of foot soldiers and cavalry, now individually modeled to behave independently of their comrades. Now troops of the same regiments will slightly differ in their clothing and armaments, more closely resembling what these uncouth battalions would have been like in historical times. They hack, slash, batter and stab with increased gusto, and fall where they stand with an individual flourish.    The fact all the models are slightly unique - a different shield here, a novel corset there - adds to the astonishingly raw, epic feel of the battles Total War is still famed for, and in that respect Medieval II is in a league of its own. Bearing that in mind anyone with so much as a flicker of interest in strategy who's never played a Total War game should not sleep until they've got a copy of Medieval II. However, the experience for veterans of the series is slightly different.   The scope of the map takes in the same swathe of continental Europe and Asia Minor as both its predecessor Medieval and Rome before it. The interface and control system are the same as ever and the strategies and tactics required to succeed haven't shifted. As a result Medieval II isn't a giant leap over the previous games, more a natural progression.  To be honest, Total War would have benefited hugely from a total overhaul, because the experience is getting too similar to its predecessors for anyone familiar with the series. The interface is beginning to show its limitations, and the more thats added for the player to control the more cluttered it gets and the less refined it feels. An extra strategic layer that allowed for more fluid micromanagement of your forces and resources would have been welcome, enabling strategy to be more important than bureaucracy. That will all come in time, no doubt. For now, theres still nothing around to touch the class of Medieval II, but if the designers sit around on their laurels for too much longer, they may get something of a shock.", "date": "Nov 8, 2006"}