{"name": "SpongeBob SquarePants: Creature from the Krusty Krab", "name_review": "SpongeBob SquarePants: Creature from the Krusty Krab Review", "ref": "https://www.ign.com/articles/2006/11/09/spongebob-squarepants-creature-from-the-krusty-krab-review-2", "text": "This month marks two years. It's been two years since the debut of the DS - two years since two screens became Nintendo's portable norm. In that time several games have harnessed the unique potential of the device - the double display, the microphone, the touch screen. But the balance between these new features and more traditional elements, like button control, is a delicate one. SpongeBob SquarePants: Creature from the Krusty Krab rejects the old, focuses solely on the new - and loses its balance. This sponge needed to soak for about two more years.    Creature from the Krusty Krab is a name being used for several SpongeBob games this holiday season - games that share storyline and scenario, but little else. The plot finds SpongeBob and his friends victimized by nightmares, with gameplay taking place as they sleep, inside their dreams. On the consoles, the yellow man deals with these dreams in full 3D. On the GBA, it's a 2D romp through a vast variety of short gameplay designs. Here on the DS, none of the above. The name of this game is swiping.    Total stylus control is called upon here, as players guide SpongeBob, Patrick Star and Plankton (alternating in the spotlight) through 2D platforming levels. Swiping across the hero sets him to walking. Swiping down makes him stop. Swiping up will trigger a jump - sometimes. See, the swipe control is fickle. Sometimes it decides to take a break.    It's not alone in that. The tap control meant to stun enemies is equally hit-and-miss. Perhaps its inconvenient inaccuracy is intentional, as it's only in the failure of a stun attack that another DS-specific element, the microphone, comes into play.    Should a jellyfish enemy attach itself to the hero, the malicious mock mollusk will magically de- and then re-materialize on the upper screen. There, a caricature of the current character is shown in bed, snoozing soundly - until the jellyfish attacks. Players will have to blow or scream into the DS mic to scare the assassin away. The event is a cool application of the system's features - so why is it employed so rarely?    More interaction with the game's well illustrated upper screen would have been great, as graphics are one of this Creature's strong suits. The second screen does see some use, though, in a few double-tall mini-games found placed throughout the mostly 2D platforming adventure. Early on, it's object-clearing action. SpongeBob drives a hot rod and players need to tap road debris to make safe his way. Another design has Patrick soaring through the skies as Starfishman, breaking boulders that have fallen into the path of an oncoming train. In later levels, SpongeBob flies a plane and combats a giant-sized Plankton from an in-cockpit perspective.    Each of these diversions is enjoyable, but they're too few and far-between. The majority of the journey is the same old swiping design, and the same old gets old. The character-swapping is purely cosmetic, changing only the appearance of the experience - SpongeBob, Patrick and Plankton all handle 90% the same 90% of the time.       Level design, too, never seems to vary. Springboards, valves and pressure switches all show up again and again, with just the walls changing places from stage to stage. There's a focus on collectibles, but no reason given for why to care about them.     One nice touch supplementing the gameplay is the title's use of video. Fully animated short clips of the SpongeBob cartoon are used to bookend each ~episode~ of play. The tie-in to the source material is great, and the presentation is further reinforced by the appearance of some other SpongeBob characters during the adventure. The videos, however, contain no dialogue. SpongeBob himself only gets vocal a time or two, and most of the time it's just yelps and screams. The background music is energetic, but like the gameplay gets repetitive. The same song will often carry over through multiple stages.    In the end, this adventure is too much of the same, too often. SpongeBob may be better off left to dream his dreams alone. It's been two years since the debut of the DS, and some games still seem lovestruck with the portable's potential. Creature from the Krusty Krab's sole reliance on touch screen control is intriguing, but falls flat. In execution, the swiping design is too slow-placed, repetitive and frustrating for the adventure to maintain a steady sense of SpongeBob fun.", "date": "Nov 9, 2006"}