{"name": "NBA Showtime", "name_review": "NBA Showtime", "ref": "https://www.ign.com/articles/2000/03/03/nba-showtime", "text": "It's not even an argument  when NBA Showtime was conceived, it was meant to be the continuation of the classic NBA Jam series. NBA Showtime on the Game Boy Color, however, doesn't seem to be any different than what NBA Jam was on the consoles almost a decade ago, and in most cases the game doesn't even capture the playability or fun of that game. Features All 29 NBA teams 100 real players Password save Only for Game Boy Color  For argument's sake, there's no way the Game Boy Color version could ever be what the arcade game is. The original NBA Showtime is a two-on-two exaggerated game of basketball, with a slick 3D engine that's put to use in showing the outstanding motion-captured moves of all the key players of the NBA. The Game Boy Color developers had to scale back the graphics into a 2D sidescrolling game which eliminates most of the arcade game's flair and feel. But even so, if careful attention was paid to the overall gameplay, the Game Boy Color could've been a contender.  And the gameplay, quite frankly, isn't that good. In fact, the controls are sloppy at best, making it difficult to play any kind of accurate defense  moving diagonal makes your character run at a different rate than running up/down or left/right. If you're on defense, you can pretty much assume the computer's going to score, since it's extremely difficult to track players, block shots, and steal the ball away. The ~strategy~ of NBA Showtime has been eliminated in the Game Boy Color version  you can't spinmove through the defense by double-tapping the turbo button. You can't shoot alley-oops because the computer player never goes up to the hoop. You can't lay-up out of a dunk. All the special moves from the arcade weren't put into the Game Boy rendition. I won't mark points against the game by forcing you to play the game in your lap, since the arcade version had three action buttons. The developers mapped the Turbo button to the Select button on the Game Boy, so you'll need to play the game using your fingers instead of your thumb.   Nowhere in NBA Showtime for the portable do I get the sense that fans of the arcade game designed the Game Boy game. First of all, the interface is laid-out less like the arcade game and more like a basketball simulation. Right off the bat you're getting mixed messages about what kind of game NBA Showtime is. Why bother offering a playoff or season? The arcade game never had any of this  you simply picked your character, and tried to defeat all 29 NBA teams. The developers could have done a much better job of mimicking the arcade interface  you can't even create your own character, or even save your player statistics. The password only saves your season in progress. And secrets? None up front  the Game Boy version doesn't even follow the given Midway formula of the three character codes before the matchup screen.  And the worst insult  no link-cable support. That omission right there seals the game's fate as a boring, one-trick-pony, forcing you to play with three predictable computer AI opponents, instead of allowing a real competitor to enter the mix   NBA Showtime is a great game. NBA Showtime on the Game Boy is not. Midway needs to start looking at their Game Boy developments a bit more closely  sure, there's no way the Game Boy could do what the arcade does, but it could have been close. Instead, this basketball title is nothing but air.", "date": "Mar 3, 2000"}