{"name": "Warhammer: Mark of Chaos", "name_review": "Warhammer: Mark of Chaos Review", "ref": "https://www.ign.com/articles/2006/11/11/warhammer-mark-of-chaos-review", "text": "The brutal Warhammer universes made famous by the table top strategy games have been getting a lot of attention in the world of video games. The upcoming Warhammer Online will soon send the franchise into massively multiplayer territory and Relic's successful Warhammer 40,000 RTS titles have already been giving players an awesome vision of a dark future for a couple of years. Jumping on that fun wagon full of blood and guts are Namco and Black Hole Entertainment with their latest release, Warhammer: Mark of Chaos, a real-time strategy game set in the fantasy realms of Warhammer. There are some definite issues here in terms of bugs and presentation, but for the most part the game is a fun romp into fantasy strategy but isn't going to have the replayability of a real-time strategy game like Company of Heroes.    The story follows the exploits of a champion of Empire named Stefan von Kessel and a champion of Chaos named Thorgar the Blooded One. Each campaign is set during the same war but seen from different sides. Each also has the war ending differently so that the both the good and evil-doers get their time in the spotlight. The stories for both sides are pretty basic fare supported with text and voice overs between missions. While there are plot points that might be described as ~twists~, the story-telling spoils any thrill by blatantly spelling these moments out before they happen. The story is also pushed along with the occasional cutscene. Unfortunately, these cutscenes aren't particularly exciting on the Empire side of things and those on the Chaos side are only a little better thanks to some cool special effects. On top of that there's lackluster camera work and bad compression.   This is a fairly common issue of presentation in a game that starts out with such a huge bang thanks to the brilliant FMV put together by Digic. There are some nice ideas, such as the overland map showing the progress of the heroes across the terrain (there are even some effects for chaos where the ground starts bubbling at their passing) but the map is pretty boring. Burning cities, army camps, and any real animation is sorely missing. The color palette and lighting are terrific for the Warhammer universe, but there's just a lack of detail in how the fiction is presented. Empire doesn't seem desperate or particularly strong, there are never any common folk running around scared or getting slaughtered by Chaos forces, Chaos is violent but doesn't seem particularly sadistic, and most importantly, animations on the battlefield are weak. Combat is slow and surprisingly lacking in brutality and blood especially considering the fiction. They would have done well to take a look at Relic's Dawn of War series and the special animations for all of the battles. Yeah, there are a lot more units here, but it's still possible as is being shown by Creative Assembly with Medieval II: Total War.    It's a wonder considering some of the effort put into other aspects of the game. For instance, they took the army creation thing to a new level by allowing players to customize individual units with not only character, but different helmets, shields, faces, armor, and so on. The idea of having armies that aren't clones isn't a new one, but that kind of army creation system is pretty awesome for those that want to get into it.   Heck, the visuals in general are very good. All of the unit models are finely crafted pieces of art. The modeling is great and the textures on top are excellent. Seeing a group of these soldiers move around on the battlefield is awesome. Lighting and special effects add to the fun. Mighty Hellcannons pack a wallop and cause some terrific area effects and bodies to fly in the air. Many of the spell effects, even the small ones, are also very good. They do some nice things with lighting and heat shimmer effects that make magic come alive. All of this comes with a price. The framerate can drop substantially in large battles. It's hasn't ever been enough to completely ruin the fun and units will always respond to orders, even in the slowdown. If it wasn't for that weak animation, Mark of Chaos would be one of the best looking games around.    While story and presentation might not be the game's strongest suit here, the gameplay is pretty fun. It's all about large armies of Order and Chaos running around the battlefield hacking each other up in the same style of the Total War real-time tactical battles. This means aside from one of the multiplayer modes, the forces sent into battle are all you're going to get until the enemy is wiped out. This type of play makes every unit on the field that much more important and clever maneuvers can outdo overwhelming force.   Mark of Chaos uses regiments, groups of anywhere from 1 to 60 models controlled as 1 unit, which makes these large battles a bit easier to manage. Each of these formations can be faced in different directions by right-clicking and dragging the mouse in the direction they should face. Each regiment has different stances and formation options as well. Some of the groups of units also come with special abilities to make tactics even more interesting such as the cavalry's wedge formation or the Chaos marauder Warcry ability that boosts surrounding unit morale. Smart use of these abilities can make a big difference in a tight situation.    Playing around with all of these techniques is a good deal of fun but the real trick is simply figuring out what unit is good for what. There aren't really any useful mouse-over tips. While the unit fiction is interesting, I simply want to know whether my Chaos marauders or warriors are better against cavalry and what kinds of special bonuses they provide. I don't want to have to look in the manual to find out that a unit has the fear attribute or if they're good at slaying giants. That stuff should be at hand in the game.   More frustrating are some of the missing features and bugs. For some reason there's no acknowledgement from off screen units that they're being attacked. So any of your troops can be slaughtered and there wouldn't be any chance to even notice. Units also sometimes disregard attack orders and attack who they wish.   Governing all of the units is a morale rating. Morale is how good your troops are feeling about the fight. The farther the morale bar drops, the closer that regiment is to fleeing the battle. At this point they become useless to the player. Different types of units have better morale than others (Chaos has much stronger morale than Skaven) so it's important to discover that as well. Sometimes the tide of war can be turned with a few well placed abilities that are used to crush the will of the enemy even when they're holding their own in the battle. The idea of morale isn't new to games but I always find it a welcome addition in games like this. It's an important aspect of the table top Warhammer strategy game as well, so it's not really surprising to see it used here.    Supplementing these armies are hero units, which are the most powerful and deadly units on the battlefield due of their special skills and spells. Each hero can use skill points (one per level) to bolster abilities in combat, dueling, and command. Combat governs the heroes singular ability to do damage in battle. Wizards tend to have the upper hand here as they can deal out devastating spells from a distance. Bright Wizards (Warhammer's version of a fire wizard) in particular seem to be a bit over-powered. While they need a bit of protection, they can demolish an army from distance with the right accompaniment of items. Command skills are used when heroes are attached to regiments. They can grant big bonuses to the group of units and help the hero survive for a bit longer.   Dueling is probably the most interesting of the skills. These skills allow heroes to take other heroes on in 1 on 1 battles to the death. Other units get pushed out of the area and aren't allowed to interfere until one flees or dies. If a hero flees, the units in the adjacent area suffer a huge morale hit so dueling can be pretty important, especially if you're trying to take out one of those brutal Bright Wizards. Overall, the implementation of heroes here is well done, even if some of the stats associated with skills are strange such as 1% bonuses or even 0.2% increases in stats. It can be hard to tell what's useful.   Items are a big part of the hero experience as well. Each hero has several slots for equipment and a backpack for useable items. Equipment includes more armor, items that reduce recharge times on powers, add mana to the mana pool, and increase attack ratings while useable items replenish health and mana amongst other things. Sadly, during the campaign, it's a huge pain in the ass to trade items between heroes. While the manual says they can be dragged and dropped amongst the heroes, we've not been able to make this work meaning heroes have to drop items on the ground in a mission in order to be picked up by other heroes when you should be paying attention to the battle.    Before each battle players will have the chance to choose what heroes and regiments they'll take into the conflict. During the campaign, each mission has a set number of regiments that can be used during the battle. Picking the right combination of units from the overall army can be important. Of course, having the right units at all is important. Over the course of the campaign, heroes will move from location to location on the map fighting battles where regiments will gain experience and lose numbers. These numbers can be replenished by accessing the camp screen but unfortunately there's been an issue where fully healthy regiments have lost experience in the campaign map. They won't lose the upgrades, but will suddenly go down in rank which means the regiment won't have as many soldiers in it putting me at a disadvantage. This can be a big thing since regiments gain experience and can be upgraded.    Occasionally heroes will reach a town where they can purchase new units with the gold looted from dead enemies. Any replacements for regiments not at full strength can also be purchased along with unit upgrades and items for heroes. Strangely the benefits of a town stay with the army once they've visited it once. It seems like those options should only exist while actually at the town to force bigger decisions. As it is, the campaign can be pretty easy.   In multiplayer and skirmish against AI, players can choose from any unit in the chosen army set (Skaven, Empire, Chaos, Elves) and choose to upgrade them how they wish. Skirmish and multiplayer combatants will also have to worry about how many points they're spending as each hero, regiment, upgrade, and item costs a certain amount. Depending on the mode and number of players, each army will have a certain allotment of points to spend. The game limits the allotment for games with more players however, probably because of the slowdown once all of the units come together in the middle of the map. Any army (or color scheme) can be saved for future use and quick entry into battle, which is a nice feature. Those that don't want to bother with picking an army can choose from the pre-set armies created by Black Hole or have the AI choose for you on the spot. I wouldn't recommend the latter however, the AI seems to make some incredibly strange choices that can lead to disaster.    These skirmish battles can be pretty fun, especially the reinforcement maps where victory points grant money that can be spent on new units while in the battle. The main problem with these modes is that there aren't very many maps for each of the modes. For instance, for having hyped up castle sieges, there's only one siege map and it only works for two players. Mark of Chaos definitely would have benefited from a larger number of maps.   AI in general is pretty good. Very Hard AI tends to present a good challenge as it will use special abilities and spells in the right places. Most of the AI is pretty aggressive and once they see you will attack heartily. The main problem with skirmish AI seems to be in modes where there are capture points. Friendly AI never stops to capture any of the points, which can be pretty damn frustrating.Overall, Warhammer: Mark of Chaos is a pretty fun game. It's not perfect by any means and has some bugs that can be annoying, but the battles themselves offer a good variety of strategies set in a dark and brooding environment. There are some presentation issues that help the game not feel as Warhammer-ish as it could, but there's still a lot to like here with the variety of units and good use of heroes. While short of an Editor's Choice, I'd definitely recommend checking out the demos on Fileplanet if you've been interested in Warhammer: Mark of Chaos and are still on the fence. It definitely got a lot to offer.", "date": "Nov 11, 2006"}