{"name": "NBA 07", "name_review": "NBA 07 Review", "ref": "https://www.ign.com/articles/2006/11/14/nba-07-review", "text": "It can be difficult to measure the worth of a ported title to a newer, more powerful console.  Inevitably, people will make comparisons to the previous version, gauging if the transition to the new system is any better (or different) than the original game or if any glitches or bugs have been fixed between versions.  Most importantly, fans will want to know if they're missing anything by not buying the game again.  In Sony's case, their first party basketball title, NBA 07 came out less than two months ago on the PS2 and PSP, and it's helping to lead the charge onto the basketball court for the PS3.  But is this version of Sony's basketball title any better now that it's made the leap into the next generation, or should this game be benched for poor play?   Getting Ready For the Season  Apparently, the athletes in NBA 07 paid attention in digital training camp when they made the transition from the current gen to the PS3.  Simply put, both your teammates and your opponents are much smarter than they ever were on the PS2.  Players now actively run their assignments as if they're actually playing basketball, closing down lanes and sticking tight to their man or their zone.  A lot of the defensive issues, such as approaching an offensive player on an angle or immediately taking yourself out of the play on steal attempts, has been addressed.  Now, your players will slide in front of the defender and either put a body on them or throw their hands in their face, slowing down or stopping fast breaks and making quick jump shots much harder.  What's more, the AI will start to decipher what you like doing a lot faster than before, forcing you to change up your tactics during transition play.  If you like perimeter shooting, they'll start doubling up on the wings, which will make you pass the ball inside.    Players will also actively re-position themselves.  You'll see team members fighting their way out of picks, anticipating crossover moves, and shifting back for rebounds or lane adjustments during quick cuts to the basket.  Granted, every now and then you'll still be able to drive the lane or fly past a defender thanks to a quick move, but that's more attributed to that player making one mistake instead of the game consistently being unbalanced. You'll also pick up on every player on the court actively tracking the movement of the ball thanks to some redesigned head tracking for each player.  No longer is there a second or two hitch before other players turn towards the basket in response to a shot; Now, everyone on the court follows the ball and prepares to make an attempt for an offensive or defensive rebound.     Speaking of shots, the colored shot meter that Sony's basketball series has become known for has been adjusted slightly to take advantage of the speed and power of the PS3 itself.  The color meter hasn't changed at all: players releasing the shot button while the meter is in the red are still more likely to miss their attempt than actually make it, while yellow is closer to a fifty-fifty chance and green is almost guaranteed to go in.  The timing for the meter, on the other hand, has been tweaked. Whereas the PS2 version had a small hitch before the meter started filling up, the PS3 version of the game starts building immediately, forcing you to adjust when you're going to release the shot button.  It will probably take a couple of missed shots to get accustomed to the improved meter, but once you do, it'll definitely feel smoother than before. In fact, you may find that capitalizing on the included Smart Shot indicator (which gives you a heads up on the best time to take a shot) or the Rebound Hot Spot (which lets you know the best time to go up for the rock) is easier thanks to this redesigned shot meter.    The shot meter isn't the only thing that's been modified for the PS3 version of NBA 07.  Thanks to the SIXAXIS controller, players can move the controller to perform juke moves, crossover steps and spins to either side of a player.  Jukes to gain space can be performed by moving the controller either forward or backwards, which imitate jab steps or hesitation steps.  Crossovers are done by moving the controller either left or right, and spins are done by twisting the controller either clockwise or counter-clockwise.  While it makes you feel as if you're actually on the court performing the moves, the sensitivity of the controller, particularly with the crossovers and jukes, will make you rely much more on the right analog stick to accurately pull off the moves.  Spins actually work well with the controller, but it can sometimes take three or four tries to get used to the movement you need to accurately trigger a crossover or juke.  Even after that, you're not guaranteed to successfully pull it off. In fact, I found that performing a slight hesitation in the opposite direction I wanted to perform a move was one of the only ways I could trigger these moves.  For instance, to crossover to the left, I had to make a move to the right with my hands before sliding the controller in the opposite direction.    Apart from motion control issues, there are still a number of hiccups with NBA 07's gameplay, even though a majority of the problems that existed in the current gen version have been fixed. For one, the computer has clock management issues that will crop up every now and then, which don't make any sense whatsoever.  I ran into a lot of instances where teams that were down literally held onto the ball instead of taking shots and trying to decrease the lead. Similarly, I found that they weren't attempting to intentionally foul my players to send them to the line. There are now some positioning issues that have cropped up during play, such as players running on the actual sideline or making a ton of errant passes even if you've got the icon passing system up. I even ran into a couple of random bugs, such as players at the free throw line that were actually facing the scorer's table instead of the basket when they shot the ball (the ball flew on its proper trajectory).    You may also run into some problems with violations that aren't actually being committed.  For example, you may stumble into an over and back call as you're approaching half court but you haven't actually committed the backcourt violation itself.   Sometimes, you haven't even reached half court and you receive this call, while other times the ball has been passed forward, but you get flagged for an imaginary step on the line.  Finally, while fatigue has been included within the game, it actually isn't implemented in a way that affects gameplay.  You can keep your players out on the court until their stamina meter is completely drained, yet they'll still sprint along the court and make shots without an appreciable decline in their speed or shooting accuracy.      As for the rest of the game, some features have been scaled back, while others have been redesigned or eliminated completely.  For instance, the mini-games from the current gen game have been drastically reduced.  No longer do you have access to the Training Camp or Drills options in the PS3 versions; instead, there are only three mini-games to be found.  Own the Court, which is one of the better diversions the series has known, is included in the game. Claiming zones on the basketball court is simple and intuitive, and while it can be a challenge at higher difficulty levels or if you play Scramble mode (which removes a ball from the playing field, forcing you to fight for every shot), it's still the best mini-game included. The Skills Challenge and 3 Point Contest from the All Star Weekend make a return as well. Compared to the PS2, this is rather slim pickings for mini-games, but on the other hand, at least it's keeping the quality ones and losing the crappier ones. It also only serves as a mild distraction to the standard season play.  Players of the current gen version will still be pleased (or annoyed) to know that teams can still be stacked with dream team rosters thanks to the lack of trade restrictions, but otherwise, you'll still have the standard 29, 58 or 82 game seasons that you can experience.   NBA Replay, On Today...  If you are looking for The Life, the Story mode that Sony included in its past two NBA titles, don't waste your time. This goal driven mode has been completely removed from the PS3 version of the game, so there won't be any next gen drama centering around the Juco Kid or Big W (at least, not in this year's game).  In its place comes one of the strongest modes included for this, or any other sports title: NBA Replay. Replay is comprised of two separate modes: The Season and Games of the Week.  The Season mode presents players with 25 weeks of the best action from last year's actual NBA season, with two specific games in each week in their actual chronological order.  However, you're not playing these games in their entirety; instead, you're playing the key moments that made that game stand out last season. Whether that's dishing three assists with Steve Nash in two minutes, Kobe's 81 point masterpiece or another lights out performance, Replay lets you relive these moments on your system via NBA 07's goal based system.    By contrast, Games of the Week is a dynamic mode that fans of the NBA will really want to get into.  Every week throughout the entire NBA season, the team behind NBA 07 will analyze the games that happen during the current season and add up to 5 additional scenarios for players to download to their console. This will constantly provide new situations for players to test themselves in during the span of the season.  What's more, you won't be constrained by constantly playing as superstars every week, because some of the more exciting performances that get translated into challenges may come from the sixth man off the bench who lights up the boards in a game.  There should be at least three weeks worth of NBA Games of the Week by the time the PS3 launches, so you'll automatically receive a return on your investment when you connect to the NBA 07 servers. This is an excellent way to improve the replayability of a title, and hopefully more sports titles follow this example.    The designers of NBA 07 broke down each performance based on actual NBA stats to create this mode.  As a result, if you perform the basics surrounding each situation, such as making a set number of jump shots or assists, you'll wind up ~Meeting the Challenge~ of that particular situation.  However, if you're looking to prove your skills, you can attempt to complete ~The Extra Mile,~ which is a secondary list of accomplishments.  These are typically much harder to fulfill, such as not turning the ball over, preventing the other team from scoring or not missing a shot.  At the end of each challenge, you'll be evaluated on how well you did, receiving a score for each task that you passed or failed. The only downside is the limited amount of unlockable content for playing these situations: While you'll unlock some player cards for completing The Extra Mile on some challenges, the majority of this mode comes down to bragging rights for a high score, which you can post online or testing your skills in crunch situations.  Even the jerseys that are included in the game are unlocked via codes that are supposed to be released over the duration of the season.  The lack of unlockable content is disappointing, but that is diminished somewhat by the prospect of constantly playing new situations.   Get Your Shine On  Making the leap from the current gen to the PS3 definitely helped out NBA 07 in a number of ways, least of which is the graphical presentation of the title.  The PS3 version of the game constantly touts how it is in full HD running at 1080p (under the proper situations with an HDMI cable, etc), and on the proper setup it looks great.  The definition of character models is much stronger, and on court action has been massively improved, with new animations for collisions, contested shots and other situations.  What's more, there's an improvement in the emotional sense conveyed by players, particularly in their faces during a game.  For instance, you'll see grimaces cross a player's face as they concentrate on a dunk, which then relax as the ball is slammed home.    Apart from animations and facial improvements, players have received an improvement within the cloth texturing for their uniforms.  Not only is there a cloth simulation running on every character on the court and the bench, but there's additional attention paid to how the fabric moves and shifts during play and even during replays.  Details like these make the game feel look great.  It's also coupled with a new microtexturing process on player's skin to make it look a bit more realistic, although this is somewhat hampered by the game's sweat system, which can sometimes make players look like plastic.  While it's impressive that it tracks every bead of sweat on a character's body, it feels like overkill to see a player bathed in sweat shortly after tip-off.  I understand that players are going to perspire, but they're not going to be soaked 30 seconds after the game starts. NBA 07 could've remained a simple port of the current gen version, but instead, it chose to improve on a number of game features.  Game AI is stronger, the shooting mechanic is tighter, and the NBA Replay feature is one of the best modes included in a sports game in some time.  Unfortunately, the game is held back from greatness with some SIXAXIS control issues, bugs and a lack of unlockable content and modes.  Sony's first party basketball title made a huge leap forward in making the jump to the PS3, which bodes well for future games in the series.", "date": "Nov 14, 2006"}