{"name": "Marvel: Ultimate Alliance", "name_review": "Marvel Ultimate Alliance Review", "ref": "https://www.ign.com/articles/2006/11/14/marvel-ultimate-alliance-review-3", "text": "Oh Marvel, how could you let this happen? What probably sounded great on paper (take control of 10 different Marvel characters and face off against classic bosses) turns out to be one of the ugliest, most difficult-to-play licensed games to ever hit the Game Boy Advance. Marvel Ultimate Alliance isn't just bad for a superhero title, it's one of the worst handheld games ever made.    Let's start with the good in this game: there are 10 playable Marvel characters. Each character has more than 1 attack. Okay, now for the bad, or as I like to call it, 'everything else.'    The plot is laughable, with guide Nick Fury constantly giving a Seacrest-like ~Fury, out!~ before going right on to deliver more dialog. He's like the guest that won't leave. The plot has something to do with explosives and the Masters of Evil, but the dull cutscenes will probably have players skipping the story almost from the start. Presentation is very weak here, with uninspired menus, difficult-to-read text and the bare minimum done to pull players into the game. Although the roster of playable heroes has some nice choices (Blade, Captain America, Deadpool, Elektra, Iceman, Spider-Man, Thor and Wolverine, with Thing and Ms. Marvel unlockable later on), the boss list is a real mixed bag. Fin Fang Foom? And why is Galactus only 12 feet tall?    In-game graphics are all mushy and undefined. Backgrounds are repetitive and poorly-illustrated, often completely missing layers (unless that sky was meant to be pure red). They rarely get across the idea of which environment they're meant to convey, unless the game is meant to take place in what looks like some kid's first Doom mod. Level design is practically non-existent; aside from the arrows pointing me to the next, identical enemy I never got the sense that I was in any real location. Doors look the same as walls and require players to walk against them for a few seconds before warping to the next spot. Every area looks so confusingly similar that even in short levels, it's not hard to get lost.    Sprites barely resemble the superhero characters they're based on (Iceman looks like a giant blue lizard) and animation is jerky, full of 2 to 4 frame actions that are difficult to understand. There are no 'get hit' animations for the heroes, so it's never obvious when a hero is going down (unless they're already lying on the floor).    But weak graphics can be forgiven when a game has solid gameplay, right? Unfortunately, the gameplay here is even worse than the visuals. Each playable character has a small variety of horrible-looking attacks that all seem to do the same thing. In addition to the playable characters, support from other Marvel heroes can be called in (like bombs in a shooter game). These call-ins are completely unbalanced though, with some offering huge exploit and some so weak that they can't even kill a standard enemy. Just moving around proves to be the toughest challenge in the game. Every time a hero is hit or performs certain attacks, the D-pad stops responding. This means that players have to constantly let go and re-press the D-pad to move their character through each gauntlet, rather than just holding it down. This sounds like a small issue, but it makes walking each hero around like trying to drive a stick-shift for the first time: lots of stop and go, resulting in lots of frustration and cheap shots.       There are RPG elements to this game, as heroes can power up their attacks over time. Characters can also drain an attack meter to perform special attacks, or use a number of collectable weapons and tools (although I'm not sure how natural it is to have Spiderman tossing hand grenades). Levels can be revisited to continue powering characters up. It's surprising that such attention was given to the leveling up aspects in the game, while the core gameplay was left broken.    Level objectives are always boring; beat up lots of enemies who warp in achingly slow, walk forward, repeat. The only thing breaking up the monotony is a frustrating key system, requiring players to revisit previously inaccessible areas. But rather than doors simply unlocking after certain events, players are given a limited number of keys (Zelda style) that must be equipped with the select button while standing next to a door, then used by pressing the R button. It's minor, but like everything else in this game it's unintuitive and annoying.    The lack of artistic flair and playable controls might be tolerable if there was a wide variety of fun enemies to pound on. There isn't. You know a game has problems when there are more playable characters than enemies, who in this game all happen to look like generic warriors from a tabletop role-playing game. They move around awkwardly and with no real intelligence. There's very little thought given to their placement and distribution, so fighting the same enemy ten or fifteen times in a row is pretty common here (turn off that damn cloning machine!) The enemies only provide challenge in their cheap shots; attacking an enemy doesn't necessarily stop them from attacking the player, so even players who have mastered the game (if one can indeed master crap) won't be able to avoid taking damage regularly. There's also no collision between the enemies and heroes, so running up to an enemy to attack usually overlaps the two and causes a lot of air punching, while the enemy gets in even more cheap shots.    Speaking of collision, that's pretty awful too. Characters collide with walls and objects inconsistently; prepare to do a lot of D-pad wiggling to get up those tight stairs, even though many of the other sprites and objects can be walked right through as if they don't exist. Sprite priority (meaning which character or object is displayed on top of the other) is constantly handled poorly, so even when Spiderman walks behind a railing or a box, he occasionally appears on top of it. Pixel effects are often displayed in front of the characters when they should be behind, and powerups hide behind dead bodies, making them difficult to collect (the lack of audio confirmation doesn't help).    Sound effects are tinny, repetitive and scarcely used. Music is bland and passive, adding nothing to each level. There are a few unlockables such as time attack and boss rush modes, but since the game isn't fun the first time through, why would anyone want to play it again? The game is also surprisingly short (it took me under 2 hours to beat it on Normal difficulty), which given the overall quality I'd like to thank the developers for.   Picture a Game Boy Advance game that fails in almost every way, and you're still probably picturing a better game than this one. From clunky start to sudden finish, Marvel Ultimate Alliance is an ugly, unfun experience that should be an embarrassment to everyone involved in its development. Don't confuse this game with the generally enjoyable console version. Instead, pick up one of the many better Marvel GBA brawlers available.", "date": "Nov 14, 2006"}