{"name": "Trauma Center: Second Opinion", "name_review": "Trauma Center: Second Opinion Review", "ref": "https://www.ign.com/articles/2006/11/14/trauma-center-second-opinion-review", "text": "As one of the most popular cult classics on the Nintendo DS, Trauma Center: Under the Knife was a trailblazing game for the system, showing that the obscure and innovative titles were truly seeing their moment in the spotlight.  Now that the DS has seen a console evolution of sorts, Trauma Center has as well, now hitting the Nintendo Wii in the form of Trauma Center: Second Opinion.  When word got out that Second Opinion was actually a remade version of the DS title (something developers playfully refer to as a ~Wii-make~), the hardest of the hardcore gamers experienced some mixed feelings.  Would the fact that Trauma Center began as a DS title mean that it was merely a shoddy port?  Was Nintendo sending the wrong message by allowing games like Big Brain Academy - a top DS title based not on visuals, but on gameplay - to see simple evolutions in favor of high-def graphics?  While we can't speak for future titles that follow the company's Big Brain example, one thing is definitely certain after storming through Second Opinion:  It rocks.   While the most die-hard DS fans out there have already blazed through Under the Knife on DS, the game's unique niche style and presentation has undoubtedly missed a few people as an exclusively handheld title up until this point.  The world of Trauma Center follows a young hot-shot doctor by the name of Derek Stiles in his attempt to rise the ranks of the operating room, and help save the world one sickly patient at a time.  As the first mainstream surgery game out there, Trauma Center is defining its own genre, combining the hectic nature of the O.R. with a sleek anime coating.  Using the Wii-mote as your in-game hand, you'll make use of all the classic tools needed to perform a successful surgery including forceps, antibiotic gel, ultrasounds, and of course the good ole' needle and thread.  As one of the key additions to the DS version, Second Opinion also adds a defibrillator into the mix, allowing Dr. Stiles to zap patients back into business.    Of course, with a game like Trauma Center, which is essentially an upgraded version of the previous game, the question on everyone's mind is whether or not it's actually worth the extra cash. Second Opinion is definitely a game that's worth playing, whether you're totally new to the series or a longtime fan.  The sheer amount of action and drama that comes with the ER scene is awesome, and even though we've played through Under the Knife multiple times, the action is still fresh on Wii.     The reason, of course, is in the Wii remote.  When we first approached Trauma Center nearly a year ago, we were worried that the tactile control wouldn't translate well into the free space of the Wii console.  After all, the game runs in 2D space, but the controller works in all three dimensions.  Now that we've had some serious time with the game, we can tell you first hand that it's not only a solid transition, but it's actually a better overall title.  The best way to describe the final game's controls would be to compare it to a mosue setup on your PC, and it really is impressive how accurate control can get after just a few minutes of play.  Using the nunchuk to assign tools makes the action even faster as well, since there's no reason to lift your hand and search for the intended tool like in the DS version.  It isn't uncommon to switch between five or six tools in a second or two, and it's a level of speed and precision that just can't be found in a one-handed DS game.     That being said, there are still a few things that plague Trauma Center: Second Opinion, keeping it from being a perfect DS-to-Wii conversion.  The amount of voice acting in the game is still reminiscent of the pocket version, so anyone expecting more than a few lines of dialogue will be sorely disappointed.  Since the game is as much about the drama as it is the actual surgery sessions, the storytelling could have definitely used more audio, and instead players will be forced to spend a good chunk of time reading white text that runs across the bottom of their screens.  In addition, the feel of the game is still a bit too shallow for it to be considered truly revolutionary in its design.  Items such as the forceps and defibrillator are awesome, as you'll actually pinch A and B together to pinch or shove the two controllers forward to shock patients, but nearly every other tool in the game resorts to point-and-click.  The improvements made to a few of the tools is definitely appreciated, but it left us wanting more interaction, more immersion, and more depth than we got on DS, and Second Opinion is still a bit shallow in that department.   As for the graphical look of the game, Trauma Center has made a first solid step in the right direction for Wii.  The general style of the game has never been stronger, and the design allows for an arcade feel, rather than implementing a ton of needless gore into the mix.  Character art is huge on the screen (though we would have liked more variants for each cast member opposed to a few main drawings), and effects such as the ~Healing Touch~ look impressive on the screen.  While no 16:9 mode is available, the game does run in 480p, which makes a huge difference for any HDTV owners out there.  There's nothing that really blows us away in either the sound or graphical department, but the franchise has still made a solid transition to the Wii, and we find that our view on the presentation elements are the same as our gameplay impressions.  We like it, now we just want more.    Now that the Wii launch is truly underway, is Trauma Center worth another dose?  Yeah, it is.  Putting aside the fact that Second Opinion is a retelling of the DS version, the game is absolutely perfect as an introductory game for Wii players. Theres a ton of diversity in the missions, an all-new Hard mode for previous fans of the series, and an entirely new sixth chapter of the game to appease the been there, done that attitude of the hardcore crowd.  Trauma Center has a charming style, decent graphical and audio presentation, but really excels in the control department.  The franchise has been given a rebirth on Wii, and it has never been better.  Everything from interface navigation to tool switching and actual surgical actions is made easier with the Wii-mote/nunchuk combination, and that alone makes it worth your launch dollars.  Under the Knife showed players what DS was all about, and now were seeing Second Opinion doing the same thing as it ushers Nintendo fans into a new era of innovation and control.", "date": "Nov 14, 2006"}