{"name": "Cabela's African Safari", "name_review": "Cabela's African Safari Review", "ref": "https://www.ign.com/articles/2006/11/14/cabelas-african-safari-review-3", "text": "Ditching the traditional tortoise-pacing of most hunting games, Cabela's African Safari gets straight to the point. You've saved up for the big African hunting trip so let's now waste the time! Of course, with smaller hunting areas than most games of this sort, the gameplay here is all about the action and provides plenty of it. Shoot some geese, bag a leopard, and be back in time for lunch because this drops you right in.   Unless you're a genre diehard, your typical hunting game is right up there with filling out tax forms, but the feeling here is more along the lines of Duck Hunt and it's fun. There are five countries to explore and they're all packed with animals sporting some tasty-looking pelts. As for the setup: the locals have been hired to drop you off in the middle of it as fast as you can and they don't mess around. One mission starts off with you sitting in the back of a truck as you drive up along a herd on the move. It's a solid wall of animal and you can't miss. Sure there's skill in getting the best ones, but just shoot already!    Hunting for geese here is one of the best thrills in the game. Run through the grasses and they start flying everywhere. Pull out the trusty boomstick and the flying trophies explode in a flurry of feathers. This has got to be one of the first hunting games where I've busted out laughing as I just went on a total killing spree. Each of the geese-hunting trips lasted only a minute or two, but nothing delivers the feeling of pure power like going on a shotgun rampage.   The bird hunting is so goofy and fun that there's even a wing-shooting tournament. You get a couple of minutes in each of the countries to see how many birds you can take down. This is as close to the action of a first-person shooter that I've ever seen in a hunting title, and with birds flapping everywhere and the sounds of shotguns going off, that's about as good as this game gets.   The rest of the hunting is done is a similarly light style. There's some tracking, but it's not too hard to pull off. A few missions even start out with a herd stampeding towards you or a leopard just a few yards away. Both the easy and normal difficulty levels include a radar system for the animals so it's just a matter of finding a green dot and shooting it. There's even a ~hunting sense~ that can be used to slow down time and fine tune the aim. The controls for targeting are the four face buttons so this is a necessary addition.   Sometimes the hunters get hunted and there are lots of animals in here that don't like being shot at (or walked near) and they'll gladly attack on a whim. For that there's the ~adrenalin mode~ which is a lot like the hunting sense. Time slows down and if you can point your hand cannon at the gaping maw of destiny, then you can get the kill instead and keep on going.    If there's a problem with African Safari it's that it's a little too easy. The AI for the animals is easy to predict and, all too often, it's a cinch to shoot an animal, run after it, and shoot it again. Plus, the fauna rarely run too far away before they sit right back down again and relax, making for easy pickings. Almost to compensate for this, the animals never slow down if they're shot. Even the mortally wounded ones can run away. Cabela's African Safari makes videogame hunting more fun by actually treating it like a videogame instead of a simulation. With each hunt lasting only a few minutes there's no need to stress out about blowing a long chase and having to do it all over again. For those with a short attention span and an urge to go hunting, this one's for you. It's not very serious, it's more than a little goofy, but it's fun.", "date": "Nov 14, 2006"}