{"name": "Dynasty Warriors Volume 2", "name_review": "Dynasty Warriors Vol. 2 Review", "ref": "https://www.ign.com/articles/2006/11/14/dynasty-warriors-vol-2-review", "text": "The seasons change, you get a little older, and there's another Dynasty Warriors game. Like shortening of days, the Warriors games are now an established way that we know that our ball of dirt is still spinning around the sun. And like many, many other games in the series, Dynasty Warriors Vol. 2 on the PSP provides some incremental improvements, but it's still the same old game. You're a badass of the old days and you will not rest until you've secured the land and shed the blood of thousands along the way.   The console versions of the Dynasty Warriors games featured massive levels that could take ages to cross even on horseback. This bit of realism helped to establish the feeling of an epic battle as armies collided. For the PSP the missions have been chopped into bite-size chunks as the game progresses across a board game setup. Battles take place in mini-arenas with up to a couple hundred enemies. While the battles don't move from one to another like on a big map, the clock is still running and so success still depends on destroying enemies quickly.    Instead of having to kill everyone in a level, finishing a section is more about getting the key goals done. This can mean taking out an enemy leader or simply demoralizing the army. This is done faster by taking out the officers first and destroying the scrubs by the dozen. Quick battles can be a minute or two while the bigger ones can be triple that. On their own, these battles aren't a huge time commitment.   As much as the bite-size approach helps out the pick up and play aspect of the game it also emphasizes just how repetitive the mechanics can be. This is nothing new since the hack-and-slash gameplay has been a staple of the franchise from the beginning. The kill counts can be in the thousands, but the vast majority of those are thanks to the hundreds of soldiers who just stand around waiting to be taken out. They're the filler and it gets real old slashing through peasants armed with sticks who rarely fight back. Combine this with similar battle areas and the gameplay starts to feel like Groundhog's Day.   The real battles, the ones against the other officers and leaders, are spaced far out and when there's finally a good reason to put the combos to use there's still some thrill to be found but it's not enough. Instead of making the generic action feel like less of the same old stuff, the changes are in refining other aspects. It's as if the developers have given up on re-establishing the franchise and are just keeping it on life support.    The changes are more of interest to those who feel like obsessing over bullet points instead of actually playing a game. You can now choose your horse, but who cares? There's more of an emphasis on morale, which helps to speed up some matches, but it's not a huge difference. The engine runs more smoothly, the nicest change, but it's still Dynasty Warriors to the bone.Dynasty Warriors Vol. 2 cleans up its act a little bit, but it's nothing to bring back anyone who's become bored with any of the previous games. If you really want more of the hack-and-slash action, then here you go, you know exactly what to expect. The game still delivers a huge amount of gameplay, if not variety, and there's value in that, but it's time to grow up a bit, too.", "date": "Nov 14, 2006"}