{"name": "Nicktoons: Battle For Volcano Island", "name_review": "Nicktoons: Battle for Volcano Island Review [GBA]", "ref": "https://www.ign.com/articles/2006/11/15/nicktoons-battle-for-volcano-island-review", "text": "What's better than a game starring a beloved cartoon character? How about a game starring four beloved cartoon characters, with appearances from a few more? The guys over at Halfbrick and THQ Australia have developed the new Nickelodeon game for the Gameboy Advance, and it actually isn't half bad. Nicktoons: Battle for Volcano Island isn't the star game of the holiday season, but it is at least a game that parents can be justified in buying for their kids.SpongebBob Squarepants, Patrick Star, Danny Phantom, and Timmy Turner have all found themselves on a mysterious island. Turns out they're the chosen ones and must defeat the evil Mawgu before he destroys not just one universe, but multiple universes. Doesn't quite seem like the task you want to stick in the hands of someone like Patrick, but who am I to judge? Luckily, Jimmy Neutron makes a guest appearance and devises a plan. All the Nicktoons gang has to do is find pieces around the island to make the Ripper Zipper. All the Nickelodeon stars already know each other from their previous adventures in Nicktoons Unite, so introductions aren't needed. There aren't very many cutscenes to speak of. When story needs to develop, the characters will just pause in their action and converse. The dialogue is decent, and has a bit of humor thrown into it. For the most part though, the characters seem pretty level headed, and much less zany than their TV versions. Some of the crazier characters, like Patrick or Cosmo, seem almost disappointingly tame. Maybe having to save the universe forces them to mature.The island is broken up into five main worlds before the Nicktoons can go after Mawgu. Players start in a hub, with portals to all the different worlds. By beating the levels in each world, players unlock doors to proceed to the next world. Each world is broken up into a main level, and three challenge levels. The main level progresses the plot, and sometimes offers an upgrade to one of the characters, while the challenge levels have players test the new skill and collect much needed pieces of the Ripper Zipper.Each character has their own unique abilities, and players will need to use all of them to beat the levels. Switching between the characters is just a press of the L button, and each character's special ability is turned on with R. All four characters are very useful, and they all get used regularly. Danny Phantom has the ability to phase through blocks; SpongeBob can dig through dirt paths; Timmy can launch himself from hooks; and Patrick can stick to walls and float. All of the character's moves perform well, with the exception of Timmy. Controlling the launches can get tricky, especially when trying to angle him. The gameplay has quite a bit of variety within every level, and it never becomes stale. The developers have blended the platforming with puzzle solving very well. The game can get pretty challenging too, especially if players are trying to get all the powerups. A lot of the challenge comes from the bad guys. There are a few enemies wandering around the levels, but none of the characters have the ability to kill them. There's not a lot of action in this regard, but the game still manages to be fast paced and exciting.Though the game does offer a fair bit of challenge, it isn't very long. The five main worlds can be beaten in a matter of a few hours. Still, there is more after that, and each level does have stars that players can try to collect. Trying to get all of the stars takes a lot of time and patience. Even when shrunk down to little sprites, all the main characters stay recognizable and well detailed. The dialogue boxes have the character's faces next to them, but they only get one expression, no matter what they're saying. The animations are pretty well done and each world has a nice vibrant feel to it. No two worlds ever look alike.Voicework is missing from the game, which is a shame when it's a title filled with colorful cartoon characters. Not even the obligatory ~ouch~ when they character gets hurt. The music isn't stellar, but it doesn't get too annoying. Each world has its own music to fit the theme. The desert world twangs, the jungle world has a drum beat, etc.Nicktoons: Battle for Volcano Island is an example of how to do and ensemble cast game, right. Each character has different moves and is helpful to the team. Most importantly, they're all fun to play as, despite the sometimes wonky controls for a couple. The game isn't long enough to really become a great game, but for a kids game on the GBA, this one is a lot of fun.", "date": "Nov 15, 2006"}