{"name": "Sneak King", "name_review": "Sneak King Review", "ref": "https://www.ign.com/articles/2006/11/16/sneak-king-review", "text": "When we saw the first screenshots of Sneak King, we were floored. First we were taken aback by the fact that Burger King would actually sell games that were essentially playable ads. Plus, the visual appearance wasn't complete garbage. Then we took a longer look at the screens. From all appearances, this looked to be the creepiest game ever. Images of the big-headed Burger King mascot hiding in garbage cans ready to leap out at unsuspecting citizens haunted our dreams for days. Then we got the game and found out that it really is as disturbing as we feared it would be. Sneak King is a thin game and has its fair share of problems, but the brief and pointed amount of enjoyment you can get out of it makes it worth picking up.   A little rundown of the gameplay is in order. You take the role of the King and it's your task to deliver food to hungry people. The people roam around the map in set patterns and have a small Metal Gear Solid style vision cone. If they have a burger icon above their head, then they're hungry and its time for you to get food to them before they faint. This is when the sneaking comes in. If the person sees you while you are trying to deliver food, they'll lose their appetite. You would too if you turned to see the unsettling face of the King sneaking up on you. You can run around by holding down the trigger, but this will make noise and cause nearby people to turn and look at you. To get the food into the hands of the hungry, you can either sneak up behind them or you can hide and wait in a variety of places scattered throughout the environment. Each time you make a delivery, you're treated to a little dance from the King and a gurgle of thanks from the recipient.    Burgers coming your way, straight from the garbage can. The game scores you on several different aspects of the delivery. The first is how close you get to the person before handing off the food. People who are closer to fainting will score more points than those at the first rumblings of hunger. Making consecutive deliveries without being seen will give you a chain multiplier. When you make a hand-off, a bar will start filling. Tap the A button to stop it and you'll get a flourish bonus. The fuller the bar is, the more of a reward you'll get. The flourish also makes the King do a dance with more complex moves at each level of flourish bonus. The last factor in scoring is whether you sneak up behind the person or lie in wait. Popping out of a hiding place gives you more points. To get the highest score, you'll have to build up your chain and cap it off with a good delivery from a hiding place.   You'll make these deliveries across four small environments; a saw mill, a cul de sac, a construction zone, and a downtown area. Each location has 20 missions that can be started by approaching one of a series of floating newspapers. Most of the missions require you to deliver food in a specific way. For some, you'll have to deliver food only by popping out of hiding places. Others will require you to deliver food only to people at certain hunger levels. A few of the missions aren't delivery focused at all and will task you with being seen by every person on the map or finding a set number of hiding places. There is a surprisingly good amount of variety in the missions and their difficulty progresses nicely as you move through each of the areas.    The missions, even with their variety, would get old quickly if it weren't for the King's great animations. Popping out from a hiding place, pushing buttons to move environmental objects, creeping up behind an unsuspecting girl, and delivering food all look hilarious. The actions have a bit of flair, especially with the vacant smile of the King overseeing it all. These really are the only reason to get Sneak King. The disturbing way he goes about handing out food is what saves this game from being a total waste of time and vaults it into the realm of things worth checking out. That, and the 200 achievement points you can get which will surely become a badge of honor across gamer profiles everywhere.   I would not accept a meal from this guy. On paper, everything sounds pretty solid. In practice, it's pretty bare. Although the game touts interactive environments as a selling point, there are only a few places on each map where you can do something other than hide. In the lumber yard, you can lower a bridge or karate chop down a tree but that's about it. It's thin and the amount of exploration you'll do before you see everything in an area will last you all of 10 minutes. It's hard to expect a more immersive environment out of a four dollar game, but these are pretty bare even with that in mind.   As a budget title, Sneak King has a certain lack of polish. Several times we experienced game breaking bugs. On a few occasions the game simply froze, though we could still pause and restart the level. We also found our character clipping through part of the environment and becoming trapped on more than one occasion. Hopefully these, and our other gripes, can be fixed in future Sneak King titles (which will probably not exist).  It's hard to say that Sneak King isn't worth picking up. At less than four dollars, it's cheaper than every Xbox Live Arcade game. It certainly isn't a deep game. In fact, after a weekend you'll probably be done with it for good. Even so, the hilarity of watching the King creep around and then cap off a crazy dance by handing over some sort of food is worth it and you pretty much have to own it just so you can say that you do. Sneak King is far from a great game and closer to just a great marketing idea. Still it is something that should be experienced and if you love achievement points you need these on your gamer card. It will certainly make you laugh and is a great little item for showing your friends just how crazy games have become. Just don't expect the fun to last.", "date": "Nov 16, 2006"}