{"name": "Medal of Honor", "name_review": "Medal of Honor Review", "ref": "https://www.ign.com/articles/2006/11/16/medal-of-honor-review-2", "text": "Medal of Honor was once the premiere World War II franchise on PCs and consoles, later eclipsed by Activision's Call of Duty series, which recently celebrated its third outing on consoles. EA Mobile brings their WWII flagship to mobile at an interesting time, when Gameloft pretty much has the 2D side-scrolling action game formula perfected and Digital Chocolate drops an insanely clever solution to the stop-and-shoot mechanics that make a lot of mobile action games poorly paced affairs.   My biggest complaint with Medal of Honor is that it feels like a year-old action game, without the cinematic flair of a Mission: Impossible III. You must stop to shoot and this breaks up the pacing. Granted, this is a limitation of handset controls -- most phones simply do not allow mutliple button-presses at once. Only when you're lining up a sniper shot does this not feel like a bit of a drag, as you're purposefully not moving. Let me make this clear, though: Dated controls do not make Medal of Honor a bad game. It just makes it blend into the crowd much easier than I suspect EA Mobile would be comfortable with.   The mechanics of Medal of Honor should be very familiar to mobile action gamers. You can duck behind barrels to hide from Nazi thugs, climb ladders to use alternate routes, push boxes, and use a melee attack for tougher kills. And with only six stages to push through, it shouldn't take you much longer than an hour to sabotage the V2 rocket operation. EA Mobile's SOCOM is actually a superior action game to Medal of Honor, and if it's still available on your deck, it features better stealth, melee, and shooting action.   Replay value depends on how many times you want to press into Nazi territory to earn shinier medals. The faster and the more effective you are, your superior award bronze through gold medals. The shorter length may actually inspire gamers to revisit the adventure since there isn't too much of a time commitment involved.   Where Medal of Honor really succeeds, though, is presentation -- and this is hardly a surprise, considering it's published by EA. Textures look great. The lighting effects are excellent. Higher-end handsets use real lighting sources to replicate streetlights, moonlight, and fire; lower-end handsets rely on colored sets of textures to approximate this effect. I've seen both a high- and medium-end edition of the game, and while more expensive handsets certainly enjoy an extra level of polish, the mid-range version was no slouch.  EA Mobile's Medal of Honor is obviously positioned as an introduction of the series to mobile audiences, but this late in the game, I suspect discerning mobile gamers will want more than just a six-level primer. Medal of Honor certainly looks great -- but if you want a side-scrolling action game, you just cannot beat some of Gameloft's fare, like Splinter Cell or Prince of Persia. My recommendation? Pass on this edition of Medal, but don't dismiss the series entirely. I bet the inevitable sequel will feature more current mobile trends.", "date": "Nov 16, 2006"}