{"name": "Deception III: Dark Delusion", "name_review": "Deception III: Dark Delusion", "ref": "https://www.ign.com/articles/2000/03/04/deception-iii-dark-delusion", "text": "Tecmo's Deception III: Dark Delusion is the third game in its moderately popular trap-setting role-playing game series for the PlayStation. While most role-playing games have the game player take on an offensive approach to combat -- attacking enemies with weapons and spell attacks -- in the Deception series, players take on a more defensive mindset. Instead of direct weapon and spell attacks, Deception has the player set up traps in order to take on the opposition.   Deception III's story, which is completely unrelated to the previous two games, follows the story of a young 17 year old girl named Reina, who is taken captive, along with her younger brother and her mother on her birthday, and brought to the island of Alendar. Trapped on the Island, Reina learns of her magical trap building skills and this sets her off on a grand adventure that will have her set numerous traps to kill various intruders whom aim to have her killed.   The story is told through a mixture of rendered and pre-rendered sequences that generally occur at the beginning and end of each of the game's various levels. While the storyline isn't bad, per se, it is definitely hampered by a poor translation that an occasional spelling or grammar mistake. Nevertheless, it is still possible to get captivated of the game's happenings despite the shortcomings.   Gameplay  Just as was the case in the previous two games in the series, the basic gameplay in Deception III revolves completely around players setting traps to kill enemy intruders. The basic play mechanics are essentially the same as in the first two incarnations, with only a few new features added to spice up the gameplay.   The first of these additions is the inclusion of two new game modes: Trap License Mode and Expert Mode. The Trap License mode is essentially a tutorial mode where players can learn the proper techniques needed to use the game's traps effectively. While I'm sure some players may need the training mode, the chances are very good that players will have no problem jumping straight into the game's story mode without too much trouble. It's a nice thing to have in the game, but I personally found it of no real use.   The Expert Mode is a special puzzle mode that Tecmo has designed for highly skilled trap setters. It features several different levels, each with a total of 10 stages, that has the player attempt to overcome specific obstacles and challenges. It does offer some really difficult challenges, but it's definitely not the game's meat and potatoes.   The most significant addition to Deception III is that players now have the ability to create their own traps out of four different elemental types. Players can build the new traps using basic trap types, such as floor traps, wall traps, and ceiling traps, and enhancing them with different emblems, rings, and orbs. Depending on which particular emblem, ring, or orb that is used, the new traps will have different powers and reaction times.   Basically, the way things work is like this; after being introduced to the story of the upcoming stage, the player is thrown into a precarious situation where he or she must make sure that Reina doesn't get killed by the intruder(s). Players can move Reina around the room or have her run away to another room to avoid the enemies' attacks. At any point while in one of the main rooms, you can have her setup three different traps (one floor-based, one wall-based, and one ceiling-based).   While it can be fun trying to setup complex trap combinations that lead to huge combination attacks and quick deaths to the oncoming intruders, the game gets extremely repetitive, awfully quickly. The hardest part about beating the game isn't its challenge, but its tedium that will likely have many players ending their games prematurely.    Graphics Graphically, the game isn't much of an improvement over its predecessor. However, it's not a bad looking game by any means. The best adjective to describe the graphics is ~average.~ As, for the most part, the polygonal models, 3D environments, and the game's 3D objects are all standard fair as far as PlayStation games are concerned. It has relatively sharp graphics, but the areas and characters are all fairly dull in appearance.   Sound Audibly, the game has some really nice symphonic tunes, run of the mill sound effects and some horrible voices. At first, the music may actually seem quite good, but after playing the game for more than a few hours, the basic tunes that you hear get rather old and repetitive.   Deception III: Dark Delusion definitely isn't a bad game, but it's definitely not a really good game either. Tecmo has added some nice new elements to Dark Delusion, but it definitely doesn't feel like a true sequel. However, this statement can really be said about just about any PlayStation sequel that has been coming out in the recent years. In some cases, this isn't really a bad thing (~if it's not broke, don't fix it~) in some cases, but it is here. In games that are really good to begin with, like Gran Turismo, I think it's okay to create a sequel that's more of an update than a complete revolutionary step-up. However, average games need more than just a few minor enhancements.", "date": "Mar 4, 2000"}