{"name": "Defender", "name_review": "Defender Review", "ref": "https://www.ign.com/articles/2006/11/17/defender-review", "text": "Please make better use of the Xbox Live Arcade. Anybody. Classic games can be fun, but lately the Live Arcade seems like its turning into nothing more than a place for publishers to dump their games from the dawn of the arcade with slightly enhanced graphics in search of a quick buck. Midway is the latest to drop a game into this category with the early 80's arcade smash-hit Defender. While it's a decent port of the single player game and the updated control options work exceptionally well, it suffers from many common Live Arcade problems; outdated gameplay, poor multiplayer presentation, and lag-ridden online matches.  Like most games from over twenty years ago, Defender is pretty simple to learn but extremely difficult to master. How else would they steal your quarters? In the game, you fly around in a spaceship with a looped gameboard that you can scroll around, thereby coming back to your starting point if you travel in one direction long enough. Aliens fill the sky and spend most of their time shooting at you, trying to ram into you, or dipping down to abduct humans from the ground. Your job is to shoot them down and save the citizens of earth using your main gun, screen clearing bombs, and a hyperspace quick transport tool. As is usually the case in games, you get various point awards for saving people and shooting down specific types of alien craft.   This newest addition of Defender features options for playing the game either with the original appearance or new enhanced graphics. The new look does little to impress. Nothing more than filling in the outlined ground and tidying up the ships was done. You can forget about fancy looking explosions. When you compare this appearance to that of Geometry Wars, you can instantly see the difference in quality and workmanship. The same goes for the sound. More work needed to be done if we're expected to feel like we got our money's worth at 400 Microsoft points ($5 USD).   Thankfully, multiplayer support for both offline and Xbox Live is present. The offline mode wasn't done perfectly, but at least it was included unlike some other Live Arcade classic releases. The first problem with it is that it doesn't do a split screen simultaneous game and requires you to trade off turns. That's not a huge problem, but with that decision made it doesn't make sense to require two controllers to be plugged in before a multiplayer game can be started. If we're trading off turns, we can also pass the controller back and forth.  NOT SO MUCH ENHANCEMENT WORK WAS DONE.The major problems with Defender's multiplayer game come when you try to play online. Like Scramble, this game includes a co-operative mode. We complained about that mode not being co-operative since you aren't really working together, you just get your scores added. Defender takes it one step further in the wrong direction. This time you can't even see your co-op teammate's progress. That's right, a co-operative game where you have no clue how your teammate is doing other than looking at their number of lives left and your combined score. Weak. The same thing goes for the versus mode. You can't see your opponent's progress aside from their score and number of lives. Who made that call? It's made even worse by the lag we experienced in the majority of the games we played. Forget it. This Live experience is terrible.  The best part about this version of Defender is the controls. Even though most Live Arcade games perform poorly with the Xbox 360 controller, this one works admirably. The classic, though frustrating, Defender control scheme where you have to push a button to switch directions and can only steer up and down is available but it isn't the default. Instead all of the thrust and direction controls have been mapped to the left analog stick or d-pad. This works much better than the original Defender and makes the game more accessible to new players. THE CLASSIC LOOK IS HERE.The achievements were also done well. They're tough enough that all but the experienced player will have to work towards getting them all. They range from the simple ~rescue a human with a mid-air catch~ to the expert only ~lose no humans during the first three waves.~ The achievements also pull from each of the game types, forcing you to play well in each different mode, even if all of the modes play essentially the same.   Defender is a game that needed much more than what was put into it to make it worthy of a download. Like other classics on the Live Arcade, you can find it on compilations along with many other games for a cheaper average price. With the poor multiplayer options and lag-filled Live experience, there isn't anything other than leaderboards that sets this apart from other Defender releases. Hardcore Defender fans will love it just to be able to compete for the highest leaderboard score, but everyone else probably won't need to give this a look.", "date": "Nov 17, 2006"}