{"name": "Call of Duty 3", "name_review": "Call of Duty 3 Review", "ref": "https://www.ign.com/articles/2006/11/21/call-of-duty-3-review-3", "text": "Unrealized potential is one of the most frustrating things in videogames... especially when the difference between being good and being great is just a matter of details. Take, for instance, Activision's PlayStation 3 port of Call of Duty 3, the follow-up to one of last year's more compelling shooters and one of the most cinematic franchises you'll find. With its credentials and history, you'd think that it would make for quite the grand PS3 launch title -- but grand isn't a word that applies. It's still a competent and engrossing first-person experience, yes, but it ultimately falls short of what's needed to be ~special.~   Before we delve into its shortcomings, though, let's give Call of Duty 3 its credit. Developed by Treyarch (Call of Duty 2: Big Red One) and not Infinity Ward (Call of Duty 2), the game benefits from a lot of the same strengths that made COD2 so compelling on Xbox 360 -- intense combat situations, varied gameplay scenarios, and movie-like recreations of famous World War II battles. Throwing its players into the middle of a firefight and challenging you to survive is what this series does best, and that doesn't change here... even if it does have a different developer.    This iteration pays close attention to ~The Normandy Breakout,~ the summer campaign that began immediately following D-Day and the operation that eventually liberated France from Nazi claws. Unlike the last game, however, Call of Duty 3 attempts to tell a story beyond historical transition footage by showing us the war through the perspective of soldier characters from the US, Canadian, British, and Polish armies. The tale is by no means deep or intricate, but it's better than the nothing we had before (despite an abundance of stereotypical war-era personalities).   Besides the addition of characters and a proper storyline, Call of Duty has also added cinematic melee combat sequences. Executed via side-to-side shakes of the Sixaxis, the new unarmed struggles are fun little diversions from the typical shooting scenario, but happen no more than four or five times in the entire 14-chapter adventure. At the very least they're unpredictable (you never do see them coming, as they appear as surprise sequences when raiding houses or escaping firefights), and players can also use the Sixaxis to throw the butt of their gun into an enemy's face during non-scripted points.    Another new inclusion is an emphasis on vehicular driving. In Call of Duty 2, players rode along as passengers during the occasional scripted rail-shooting event and hopped aboard tanks for fully-controllable action in-between. In the Normandy Breakout, tank fights are back again but gamers are now wholly in command of their jeep's direction and can use the Sixaxis like a steering wheel to get around. Unfortunately, this use of the tilt controller is far too sensitive and makes moving around the map a twitchy chore in frustration. The alternate (and more traditional) analog control is a better option here and it makes driving simpler in every way. You'll need the extra control too -- as some of the vehicular stages are far too big and sloppily designed for their own good.   But let's be honest, the heart of Call of Duty is the shooting and COD3 has plenty of it. Levels are linear, but long -- with several moments in each that allow for a breakout of motion-picture like flair filled with explosions, screams, and gunfire everywhere you turn. Just like its predecessor, Call of Duty 3 allows users to pick up and go with any allied and axis weapon, which means that multiple rifle, machine gun, sniper, and shotgun types are theirs to command. Grenades, mounted machine guns, and the aforementioned vehicular jaunts keep things varied as well. Treyarch has even included semi-destructible environments and multiple mission paths for good measure.    There's no denying that Call of Duty 3 is fun. It's definitely ~pick up and play~ friendly and has enough differences from COD2 that it almost feels like an entirely different war. The game's online modes are entertaining too -- with multiple character classes and modes like deathmatch, team deathmatch, capture the flag and a handful of others ready for invasion. Having put in considerable time on public servers, we can tell you that it runs super smooth even when all 24 supported players are firing away at once and the maps, while limited in number, are large and well-balanced.   Based on criteria like this, it's hard to imagine COD not impressing. After all, it sounds exciting, so where are all the pitfalls? Unfortunately, they can be found everywhere... especially if you've played the Xbox 360 version released earlier in the year. A quick comparison reveals those differences right off the bat. Be it with multiplayer options and online capabilities (360 has a point system and voice support, PS3 doesn't), or the visuals (Xbox moves at a smoother framerate with few hitches, while the PS3 version stutters often and boasts a more ~washed out~ color palette).    But even if you go in never having played the Xbox 360 version, Call of Duty 3's two biggest problems are still its level design and high bug count. The former isn't as bad as the latter; final stages like The Mace, Chambois, and the Corridor of Death help us forget the more straightforward and generic-feeling earlier levels (which can still be fun, they're just familiar). The constant glitches and freeze-ups, however, are downright deplorable. In the 10 hours we spent with the single-player campaign, we had to restart a checkpoint five to six times because certain flags wouldn't activate (i.e., doors that were supposed to open didn't, walls that were supposed to break wouldn't, and characters that were supposed to die couldn't).   Moreover, soldiers that die on roofs or on top of tanks float in the air or clip through buildings with alarming frequency; grenades can go off in a crowd of people and do nothing but make noise and devastate no one; sound effects and other audio occasionally drop in and out, and can even stop working altogether for no reason. But worst of all, Call of Duty 3 can and will lock your PlayStation 3 up -- sometimes when quitting multiplayer, sometimes when quitting back to the XMB, and sometimes for no reason at all.Fans of Call of Duty 2 and the series in general will no doubt enjoy Call of Duty 3 (if they don't have access to another platform). It recreates the fury of World War II with a strong bravado and offers a shooting engine that makes single-player and multiplayer sessions equally fun. Sure it comes up a little short compared to the pacing and overall level design of COD2, but the real crime here is found with all the glitches and other technical problems that make the Normandy Breakout feel more like the Normandy Lockup. It's really too bad, because considering how good it is despite all of its problems, imagine how great it could have been without them.", "date": "Nov 21, 2006"}