{"name": "DBZ Budokai Tenkaichi 2", "name_review": "Dragon Ball Z: Budokai Tenkaichi 2", "ref": "https://www.ign.com/articles/2006/11/22/dragon-ball-z-budokai-tenkaichi-2", "text": "You don't have to be a huge anime nut to know the name of Dragon Ball.  The anime has become a household name across the states over the last decade, and the series is so popular in Japan we half expect to see Goku's head every time we glance at a Japanese flag.  Japan is all about anime, and there's no more well-known series to fans today than Dragon Ball.  In fact, that's probably the reason Dragon Ball Z: Budokai Tenkaichi 2 - the latest in interactive anime-slugfests - marks the 25th Dragon Ball game developed in Japan in the last four years.  Scary?  Definitely.     While we haven't seen them all hit stateside, there's still been a huge uprising of support, which is undoubtedly the reason why every time you glance at the shelf at your local game store there's a new Dragon Ball game waiting.  It began with the Dragon Ball games on PSX, has moved over to the Dragon Ball Z Budokai series on PS2, and is now morphing into Dragon Ball Z: Budokai Tenkaichi 2 for PS2 and Wii.  After game after game of mindless ass-kicking with Goku and the gang you'd figure our patience is wearing thin, right?  Well to all you naysayers, wait 'til next year.  Dragon Ball Z: Budokai Tenkaichi 2 may be the latest in an amazingly long-lasting franchise, but it's just as solid as its predecessors.   He's mad... Into the Word of Dragon Ball  For anyone not familiar with the Dragon Ball Z games up until this point, it's really very simple.  Players control each of the heroes and villains of the anime series, often fighting in an adventure mode that parallels the story arch of the show in some way.  The game is all about quick combos, massive in-air battles, and super attacks that make other anime fighting games look like a trip to the McDonalds Play Place.  For Dragon Ball Z: Budokai Tenkaichi 2, the main story mode is seriously massive, paralleling the entire Dragon Ball, Dragon Ball Z, and Dragon Ball GT series, allowing you to reenact every battle, every plot point, and every surprise from the world of Dragon Ball.  This opens up a ton of depth into the game, as the main Dragon Adventure is comprised of hundreds of battles, each complete with voiceovers and in-game cut-scenes before and after each bout.  Think last year's Z Battle Gate, but bigger.     The only major gripe with the newly expanded Dragon Adventure is that since the story is set in stone, a success condition doesn't always transition into how the story unfolds.  In one of the opening battles, for instance, we fought as Goku trying to defeat Vegeta.  The goal was simply to last the length of the battle without dying (as the story has Goku's friends come to his aid), but we defeated Vegeta instead.  Despite kicking the crap out of our competitor, the story cut to Goku defeated.  Obviously this is needed for story reasons, but it does make the main story mode feel a bit disconnected.  Even still, an entire adventure mode that follows the whole Dragon Ball Z lineage and is pretty impressive, and the battles stay fun throughout.   Doing Battle  Where the game really shows its overall depth, however, is in the battle system.  While not a ton of aspects have changed from the previous Budokai Tenkaichi game, there's just more overall to experience.  The sheer amount of fighters, for example, is insane, having 70 total characters from the series and all of their alternate forms, totaling over 120 ~playable characters~.  Of course there's a certain amount of stat-padding going on with those numbers, as it includes Goku, Super Saiyan Goku, SS Level 2, and SS Level 3, but when you break down all the multiple forms of Vegeta, Frieza, Ghoan, Cell, and all the other monumental fighters it's really a pretty amazing combination, and a considerable jump from last year's already packed product.     Aside from the sheer numbers, there are also a few new ways to do battle as well.  Topping off the main fighting engine are new vanish attacks and counters, which allow players to chase or evade mid-combo, adding even more speed to the already hectic fights.  There are also 16 areas to fight, taking the previous fields from Tenkaichi and adding to it.  And while there isn't an online function for the game, the Evolution Z mode (which lets you buy, sell, and equip every fighter with items and stat boosters) allows for a password generator, letting players trade codes to fight each other's created fighters from one system to another.  It may not be as in-depth as online, but it's a cool feature nonetheless.  Thrown in a new Tag Battle mode that allows for five-on-five tag fighting and you've got a game that, while very similar to its predecessors, still has a ton of fresh gameplay crammed into it.  Compared to the original Tenkaichi this one is faster, slicker, and features more fighters doing battle in larger arenas.  Can't complain about that.   Even still, the main speed and amount of strategy from the previous games hasn't really changed, leaving Dragon Ball Z: Budokai Tenkaichi as a game that really only lasts as long as its basic mechanic.  There are only two main fighting buttons - one for close range and the other for distance attacks - and aside from mashing the two of them together in different combinations the game can get a little thin in strategy.  Sure the added moves and existing blocks and counters add a bit of depth, and the in-game transformations and super attacks are definitely a blast to pull off, but the game still amounts to a button-mashing mass of DBZ fan service.  There's no way we'd recommend the game to a gamer that has no interest in the DBZ franchise, but at the same time we'd warn die-hard fans that there's no way you should miss Budokai Tenkaichi if you're a longtime fanatic.      Changing the Game  Though the game is essentially the same on Wii as it is on PS2 visually (running in 480p but not 16:9), the gameplay is a bit different for Nitnendo gamers, and it's actually a better setup than traditional control.  For Wii, players will use the Wii-mote/nunchuk combination to man the controls, using motion control for dashes and super attacks, while major fighting is still done with the A and B button.  What makes the Wii version more desirable though is the added depth for motion control.  Rather than swinging your hands around like an idiot for every punch, supers are executed with motion control and an on-screen cursor.  To pull off Goku's famous Kamehameha, for example, you keep the cursor on-screen while holding B and Z, and pulling the Wii-mote backwards and then shoving forward just like the motion.     Is it easier?  No, and that's the point.  In a game that resorts to button mashing and fast reflexes the added motion control actually helps a ton by adding necessary depth and finesse to the fights.  Rather than simply crunching a few buttons in a moment of near-death, players actually have to focus, set up for a special, and pull it off at the risk of not only failing the attack, but also looking like a total idiot in front of friends.  There's something awesome about sitting at little to no health and watching the final blast shoot towards you from across the arena, only to pull off a clutch Spirit Bomb and wipe away the competition using pure skill.  Not a mashed button.  Skill.    So is he... Of course if you want to play Dragon Ball Z: Budokai Tenkaicih 2 like a baby using a baby controller, you can do that too.  The game supports both the classic controller as well as the GameCube controller, though the instruction manual and all tutorials are built around using the Wii-mote/nunchuk controls, and that's definitely how we recommend playing.  Unless you aren't good enough.     The Style Comes Alive  That being said, fans that do pick up Tenkaichi 2 are going to be in for one hell of an experience.  The game has an awesome cel-shaded look that's been improved on over the last year, and makes solid use of the PS2 hardware.  Fighters take noticeable damage during a fight, environments crumble, battles are filled with tons of motion blur, and the special attack animations are better than ever with grandioso fanfare for the rarest attacks.  There's something captivating about pulling off a Spirit Bomb and having the game cut to a shot of Earth from space, only to have a chunk of it burst into flames, returning back to a scorched and transformed battlefield.     To add to the visual aspects, the VO work is pretty impressive as well, shoving hours upon hours of acting work into the game via battle VO, cut scenes, training tutorials, and menu interface.  And just as the previous Tenkaichi game, all the Japanese VO work from the original translation is also available in the options menu, so if you're a fan of the classic Dragon Ball voice work you'll feel right at home as well.  The overall sound production is pretty impressive, and the song list (34 tracks in all) can be played from a bonus song select mode.            Whether Dragon Ball Z: Budokai Tenkaichi 2 is worth a purchase is really up to how big of a fan you are of Dragon Ball.  The game has a ton of fan-service (not the naked kind sorry), a ton of production value, and an insane amount of options to dig through.  The sheer fact that the game can boast 120 different playable characters is just sick, and while a ton of those are super forms of main characters theres no denying the sheer depth of the games roster.  The new five-on-five tag battles are a blast as well, sending epic battles upwards of five minutes long at times (longer if youre still new at the game), while the training mode alone can take up to an hour to truly master.  Simply put, this game is absolutely stuffed with content, and if you dig Dragon Ball its a no-brainer.  The sheer speed and complexity of the controls may turn some people off, but the general combat will eventually come down to two buttons, making the game amazingly easy to learn, but nearly impossible to fully master.  This one uses every button on the controller, a good deal of motion on the Wii version, and it moves at an insane speed.  Still, for gamers that can get into it, Dragon Ball Z: Budokai Tenkaichi 2 is one of the most entertaining and fierce anime fighters around.  This is every DBZ fans wet dream.", "date": "Nov 22, 2006"}