{"name": "College Hoops 2K7", "name_review": "College Hoops 2K7 Review", "ref": "https://www.ign.com/articles/2006/11/22/college-hoops-2k7-review-4", "text": "What does a Duke student and a North Carolina student have in common? They both applied to Duke.   Yes, college basketball is back. Let the heckling, face-painting and ~Oh~ chanting begin.    In College Hoops 2K7, the latest offering from 2K Sports, you can actually create your own heckle -- er, chant, I mean. The solid brand of basketball gameplay returns as well, and along with slightly improved graphics and much-improved sound, College Hoops 2K7 is 2K Sports best effort yet. Still, the gameplay is all too familiar and, while fun, one has to wonder: Is it time for this franchise to graduate to something better? This is the same game we've been playing for years now, and it's about time 2K looked at evolving its basketball titles.     On the floor, you'll notice a whole stadium jam-packed with atmosphere. Fans jump up and down. The sound has been overhauled so you'll hear the student section scream out ~Three!~ for every long ball, ~whoosh!~ for every drained free-throw, and the old air-ball call for an opponent's shot that doesn't hit anything.  The graphics show only subtle improvement over 2K6, probably because the game was released only a few months ago. It's really the sound, along with solid commentary from Vern Lundquist and Bill Raftery, that give 2K7 the best college feel yet. And don't' forget about the player-controlled pre-game lay-up drills. I don't know why they are so much fun but they are.   The new Chant Creator takes the atmosphere one step further. Using a love-it-or-hate-it interface, you can produce a zillion combinations of ~Go! Fight! Win!~ to be played when you have the ball, when your opponent has the ball and during free throws. You can also create plenty of heckles, my favorite being: ~Give me an F! Give me a U! What's that spell? S you!~ The NCAA was smart enough to disallow the letters F and U and the words blue and ball from being put together, but you'll find plenty of ways to get around the system if you give it the old college try, which we obviously did. When you hear your chant in game, especially when playing against a friend, it's always good for a laugh.    But what matters most is gameplay, and 2K7 will be no stranger to you if you've played previous 2K Sports basketball games. Isomotion, the system of crossovers and dribble moves, have been mapped to the B and Y buttons as well as the traditional left analog stick. This does make Isomotion a bit easier to use than wiggling the stick and holding down the sprint button to drive past your opponents.     Driving past opponents, controlled by the CPU at least, is more difficult than ever. Defenders no longer break their ankles on every juke you throw out there, and too often a drive to the rim results in a collision with a defender where he simply arm-bars you backward. It's a block or a charge or some kind of whistle in real life, but not here. You can drive over and over into a defender and he'll keep pushing you away in the same canned animation. This makes for a much lower-scoring game, also thanks to decent help defense and a combination of zone formations you don't seen in the NBA.   Passing needs some work. Too often your players pass it to a player you don't want it to go to. You can call up icon passing if you like, but lanes open and close in a heartbeat and that extra half second makes a big difference. Also, players don't always react realistically when receiving the pass, particularly on post-entry passes. Too often you'll lob the ball into the post, your power-forward having created a seal on the defense. But instead of using that seal to take the pass, do a post move and work for a bucket, your player will jump out of the key to grab the pass and square up from the wing. It's frustrating when you see a player have an angle to the basket, you dish the ball, and he does an awkward move to catch the pass, eliminating that nice angle. In realty, a player would receive the pass on the run and continue right to the hoop for a score. If you've downloaded the March Madness demo on Xbox Live, you can see that EA is doing a much improved job with passing angles, and rarely do you pass to the wrong man, thanks to a small aiming indicator that appears every time you look at a teammate.     To put up a shot, you simply press the shoot button or use the shot stick, an option that gives you a few choices when going in for a dunk or lay-up. Players still miss way too many lay-ups. If a defender is remotely close to you, you are probably going to miss. This has been a problem for years and it's gotten to the point where veterans players already know which shots will go in even before they are taken. Post play has been improved dramatically, and using the Y and B buttons and some left-stick combinations will open up a whole arsenal of moves to be used on the block.    The big addition this year is a team unity feature, which moves dynamically through your season in Legacy mode and ebbs and flows on the floor during each game. With a lot of upperclassmen, clutch players and ~coaches on the floor~ (Bobby Hurley), your team unity will be through the roof. Your play, as a result, will improve and you'll look like a well-oiled machine. When you sub out your starters or your team is just playing lousy, your unity will take a hit. At times the system feels like a glorified momentum meter, but I really like the system, especially because it adds some RPG-elements to Legacy mode as you try to pimp out your team. More on that later.    The other side of the floor, defense remains largely the same as last year. You defense does an admirable job of helping out, when needed. There are some questionable switches at times, where point guards will end up on a center. There are a number of nice zone formations to use, the only complaint being that the players could be more aggressive in denying passes inside. So if you're in a 2-3 and the ball is on the left wing with a forward on the left block and the other three offensive players to the right, it shouldn't be a problem for defensive center and the forward on the ball to deny that pass inside. Too often, it is.   2K did a nice job of cutting down on the steals, a big complaint from last season. Playing on the ball defense has its ups and downs. You can cut off passes by flicking left or right on the right analog stick and you can bet into a defensive position by holding down the left trigger. The only problem is that you often feel like you can't put pressure on a ball handler. He can casually stand there and dribble the basketball in front of your face. If you go for the steal, you'll often be whistled for a reach or you'll just poke at the air. So while you're holding down the left trigger and playing tight on a point guard, it's almost as if he doesn't know you're there. In a real game situation, offensive players on the wing would pop out to help the point guard. Here, they remain in formation, running their offensive sets, and the point guard will deliver a pass nonchalantly and continue running the offense. It's great that 2K eliminated cheap steals, but it would be nice to see some way of putting real pressure on the ball. Just go back and ask yourself: What would Pitino do?    Speaking of Big Rick, he didn't make the cut of real life coaches digitized in 2K7 because his fees would be enough to buy a lifetime supply of Cardinal body paint. The same goes for Coach K, but hundreds of others are included, including Roy ~You're not in Kansas anymore~ Williams and John ~Stay away from my family John Chaney~ Calipari. There's also a ton of customization in the player creator (signature shots!) and create-a-school feature. The NIT is also included for the first time in videogame history, which is about as fun as kissing your sister.    The Legacy mode, one of the best franchise/dynasty modes in sports, is even better. The Bryant Gumbel and Clark Kellogg studio shows have been expanded from a season preview and Selection Sunday into a weekly show. While their lip synching is laughable and they move like animatronic characters better suited to entertain ankle-biters at Chuck E. Cheese's, the information is great. You've got your players of the week, coaches on the hot seat and recruiting news. There are something like 15 different elements that they can touch on, dynamically chosen by what's happening around the nation. In the same way college fans log on to ESPN.com or IGN Sports (holler!), for the latest news, so too will you enjoy checking in on not only your team but the entire country.    As mentioned, the unity feature winds its way through Legacy mode as well, so you'll have to keep your squad happy. That means keeping underclassmen in the program, balancing minutes on the floor and a good starting five, and recruiting good players. You could spend hours (the awkward menus could make it longer) tweaking out your team to get that unity boost. Sure, it's all for naught when you bolt your mid-major coaching job for a powerhouse position in the ACC.   You can also take your game on Xbox Live for typical 2K Sports options, like online leagues and tourneys -- still the best online system out there for sports titles. Despite the aging gameplay, still with its host of problems, College Hoops 2K7 is better than ever, if only slightly. 2K continues to shine in the presentation department, and the amount of options you have to tweak everything will blow you away. Visually, its a good looking sports title, although the arenas and crowd often look like high-res current-gen stuff. The sound is where 2K really excels, especially with the irresistibly evil Chant Creator. Despite the kung-fu lip synching of Gumbel and Kellogg, there is a lot of great info in the College Hoops Tonight that makes for an immersive Legacy. The team unity feature makes it even more fulfilling to pencil your team onto the tournament bracket. College Hoops 2K7 is great off the floor and good on the floor, but it could be a lot better, especially with missed lay-ups, passing and defensive pressure.", "date": "Nov 22, 2006"}