{"name": "Winx Club: The Quest for the Codex", "name_review": "Winx Club: Quest for the Codex Review", "ref": "https://www.ign.com/articles/2006/11/23/winx-club-quest-for-the-codex-review", "text": "Boy-crazy girls have enough on their minds. Does he really like me? Will he ask me to the dance? These concerns overwhelm the thoughts of female pre-teens - according to the Winx Club, that is. Herein lies a game more troubled with finding a matching outfit than saving the world from evil forces. It's Winx Club: Quest for the Codex, a confusing mixture of gameplay types and story elements that, at the end of the day, will leave you fearing for the future of the fairer gender.    It's the beginning of sophomore year at the Alfea School for Fairies. Five friends - Bloom, Stella, Musa, Flora and Tecna - reunite and share stories of their summer vacations, but trouble soon breaks up the happy occasion. An evil fiend called Lord Darkar has kidnapped six pixies, and plans to take over the world. It's up to the five girls and their newest friend Layla to reform their magical team, the Winx Club, and save the day.    At first glance, Quest for the Codex is a side-scrolling design starring the flying fairy friends of the Winx Club cartoon show. But it turns out that the flying and shooting levels are only one small piece of what's essentially a mini-game compilation. There are six Winx girls, and each of them has a game design centered on her personality. Some of them are solidly conceived and executed well. Other seem like they were thrown into the game at the last minute.    Group leader Bloom's side-scrolling shooter levels are, unfortunately, some of the game's weakest sequences. The levels through which Bloom flies are bland and uninteresting, populated by only a handful of enemies and collectible items. There's no direct progression from level to level, no major boss fights, and no sense of fun to be found - if anything, these Dragon Flight sessions are a frustration.    Flying through environments and fighting bad guys could have served to facilitate a cohesive story, but after the initial flights the game is mixed up with cutscenes and totally unrelated alternate gameplay. Stella, the fashion-mad blonde fairy, steps in to help save the world by putting together matching outfits. Seriously, evildoers, watch out - this girl knows how to pick out shoes to go with those pants.    That design is called Fashion Sense, and plays like a game of Memory (flipping over cards, two at a time, looking for a match in color). Its place in the plot in ridiculous, but it plays fairly well - as do most of the other girls' games. Flora, the botanical character, hosts a flower-shuffling design called Enchanted Garden. It's similar to puzzle games like Tetris Attack, as you use a cursor to align three or more like plants in a row to eliminate them. Musa, the hip-hop girl, stars in a Dance Dance Revolution challenge called Beat Box. Just like DDR, arrows slide across the screen and you'll have to press the corresponding directional buttons on the D-Pad when they line up with targets.       The newest girl, Layla, presents the worst design of the bunch - Liquid Laser. This mini-game is inspired by the classic puzzler Qix. You have to draw a box around an object on the playing field using a cursor, fully enclosing it on all sides to complete each level. This task takes all of ten seconds, even on the highest difficulty setting and level. It may as well have been left out of the game entirely.    But salvation comes with the last entry, Firewall. This sixth and final mini-game is brought to you by Tecna, the digital girl, and is a remarkably fun and frantic clone of the classic game Breakout. You might also know it as Alleyway - it's a game where you control a paddle on the bottom of the screen, launching and bouncing a ball into the playing field above to break blocks. This Winx-brand remix of the arcade great adds power-ups that increase your paddle size, speed up play and multiply the ball - all things that have been seen in Breakout clones before, but still incredibly satisfying to find here.    The mini-games are all over the map, in both design and quality. One thing binds them together, though, and that's a weak and sloppy style of presentation. This Quest looks bad. The girls are rendered poorly, with stray pixels surrounding their graphics in each scene. The environments are muddy. The menus are poor. The best of the bunch is, again, the Breakout clone Firewall. But one solid rendition of a classic arcade design isn't enough to justify picking up this entire package.And that's where Winx Club: Quest for the Codex leaves you in the end  fairly satisfied in a few areas, but disappointed in the rest. This mini-game collection is strung together too loosely. Its plot doesn't make much sense, and its look leaves a lot to be desired. It's no wonder Bloom and her friends spend all their free time chasing young men  they're doing whatever they can to put the reality of their lives out of their boy-crazy minds.", "date": "Nov 23, 2006"}