{"name": "Chicken Little: Ace in Action", "name_review": "Chicken Little: Ace in Action Review", "ref": "https://www.ign.com/articles/2006/11/23/chicken-little-ace-in-action-review-3", "text": "It's not hard to find a bad movie game based off a decent film. Heck, throw a dart into the Nintendo aisle at your local Toys R Us and odds are that's exactly what you'll hit. Far more rare is a game based off a crappy film that offers something special. Chicken Little: Ace in Action for the Nintendo DS is just that: a fantastic little action title that's far cooler and more enjoyable than its source material. Unfortunately, it's knocked down a few notches by the inclusion of less-than-stellar secondary modes.    Based on last year's poorly-received ~See, we can be Pixar, too!~ CG Disney film, the game wisely sidesteps the forgettable story from that film and focuses on the movie-within-a-movie, where Chicken Little and his pals were portrayed on the big screen by commanding adults in a sci-fi action film. The game follows Ace (the manly, Shatner-esque equivalent of Chicken Little) and his crew as they combat robots and alien menaces on their way to defeat the nefarious Foxy Loxy.    Players run Ace around in 8 directions with the +control pad and (taking a cue from Robotron and Smash TV) fire his blaster in 8 directions by using the A, B, X and Y buttons (with a combination like X+A used to fire diagonally). The L button uses a limited shield, which also sucks in collectable aliens (the game's currency). The R button turns Ace's gun into a grenade launcher, also with 8 directions of firing. The control scheme works incredibly well and although the levels are pretty linear, players will find themselves aiming to the sides and rear constantly as enemies spawn from all directions.    Ace begins the game with a basic, Megaman-style pea-shooter. Collectable icons however give him the use of 3 other gun types, which can be toggled between by thumbing the touch screen (similar to last year's space shooter Nanostray). Although these different weapons add a little variety to the combat, they run out pretty quickly and none are as reliable as the standard gun. It would have been nice to switch between guns more permanently, ala Gunstar Heroes. What is a huge help are modifier icons that can be picked up to modify whatever the current gun is. These icons can give any gun a spread shot, speedier firing or a variety of other useful effects.    Adding one more layer of complexity to the gun system is the ability to upgrade between levels. As Ace lays the smackdown on aliens and robots, players will regularly collect little fuzzy aliens. These add to a total and can be redeemed for permanent gun upgrades such as faster firing, more powerful firing, stronger shield and so on. Upgrading is essential as the basic weapons are far too slow and weak to really get used to. A few upgrades in, Ace is one badass chicken.    Levels and characters are all in full 3D, and some of the cleanest 3D seen on the Nintendo DS. Environments feature soft, clay-like textures that match the art design with lots of personality in their minor details. Right from the start of the game, lava waterfalls pour into deep canyons with surprising clarity. Gameplay is presented in a slightly tilted topdown perspective and plenty of objects such as canyon walls and doorway arches swing between the player and the camera to reinforce the 3D environment. Occasionally, this hurts the gameplay (such as Ace wandering behind an archway and getting assaulted by 2 or 3 robots that can't be seen) but those moments are thankfully pretty rare. Enemies also infrequently spawn right on top of the player, resulting in some cheap shots. The environments can get a little repetitive and there's definitely a sense of dj vu in some of the level designs, but it's forgivable since this never gets in the way of the frenetic action.       Ace animates with great energy, and it's a blast diving him in 4 directions while firing, watching the tiny hero perform maneuvers not seen since Chow Yun Fat and John Woo were a team. Enemies have limited animation but are pretty relentless. This is at times a pretty tough game and younger kids might have difficulty getting through some of the levels without dying multiple times. Luckily, restart points are very generous so players never have to replay too much after each death. Boss battles, although infrequent are a blast and reminded me of classic N64 encounters from games like Conker's Bad Fur Day.    Now if only the developers could have stopped with Ace, this would have been a near-perfect action title. Instead, the game alternates between three different modes: Ace's on-foot combat, Abby's space shooting from her ship and Runt's tank battling (which is pretty similar to Ace's levels, but slightly zoomed out). Abby's levels are pretty forgettable. Although the flying and shooting works well enough, these levels are nowhere near as polished or balanced as the Ace levels. Like Ace, Abby has a good variety of guns, but since she can only fire forward gun selection feels pretty limited. The enemies are also pretty lifeless in this mode.    Runt's levels are more engaging, but don't quite live up to Ace's. Roaming around in a tiny tank with a massive cannon, players can dash through enemies and fire in 8 directions. There's a very interesting system here where players can drive around targeting multiple objects (up to 5) and then release a barrage of bombs all at once. The problem is the environments and enemy placement don't really support this type of combat; it's far easier to just drive around holding the fire button down than pull off complicated multi-enemy strikes.    Music and sound effects work fine, although nothing really stands out. Sorely absent is any voice acting, especially when the lead character was voiced in the Disney film by Adam West. I expected constant quips and one-liners, like there were in the somewhat similar Playstation game Blasto. Sadly, Ace never makes a sound other than grunting when hit, and even that doesn't sound like West. Bummer.    There are 3 save slots available, as well as the option to play without saving (a nice little addition if a friend just wants to check the game out for a few levels). A wireless multiplayer mode is available in which players guide aliens around to collect objects. It's pretty dull and exactly what I didn't want in a multiplayer mode. Ace's movement and attacks in the main game are so well-handled, I was looking forward to a 4-player deathmatch full of diving and blasting, but sadly that's not available. Boy, this game came close to greatness. I'm talking Astroboy-on-GBA licensed greatness. The levels with Ace feature some of the most exciting combat available on the Nintendo DS. Unfortunately, that's only about half the game and the other modes are either lacking in comparison (Runt) or just lacking altogether (Abby). I'd still recommend the game for anyone looking for solid handheld action, and the surprisingly deep gun system works pretty well. Just expect a little filler with your quality.", "date": "Nov 23, 2006"}