{"name": "Capcom Classics Collection Vol. 2", "name_review": "Capcom Classics Collection Volume 2 Review", "ref": "https://www.ign.com/articles/2006/11/27/capcom-classics-collection-volume-2-review", "text": "Ever have the feeling of dj vu? You know... the sensation that you've seen or experienced something that just happened before? Well, with Digital Eclipse's Capcom Classics Collection Volume 2, that impression strikes us for multiple reasons -- as not only have we seen this compilation's included software in arcades nearly two decades ago, we also played it when it was released on the PSP as Capcom Classics Collection Remixed earlier this year.   But let's be accurate, Capcom Classics Vol. 2 isn't an exact a port of Remixed. Like Classics Vol. 1 and last month's PSP anthology, Classics Reloaded, Vol. 2 mixes and matches by dropping some of the Remixed titles while picking up a few from Reloaded. There are even some that weren't in any of the collections at all. Confused? It isn't surprising; the lineups of all four games combined are nearly identical -- just in different configurations.    Breaking it down to basics, though, Capcom Classics Vol. 2 does share the majority of its roster with Remixed. In fact, 15 of Volume 2's 21 titles were also available on PSP this past March. What are they? In alphabetical order, they are... 1941, Avengers, Black Tiger, Block Block, Captain Commando, Last Duel, Magic Sword, Mega Twins, Quiz and Dragons, Side Arms, The Speed Rumbler, Street Fighter, Strider, Three Wonders, and Varth. Meanwhile, the new games in this set include six selections in all -- Eco Fighters, The King of Dragons, Knights of the Round, Super Street Fighter II Turbo, Tiger Road, and a redone version of Quiz and Dragons called ~Capcom Quiz.~ Capcom Quiz is particularly noteworthy because it changes its trivia to that of the publisher itself (Onimusha, Mega Man, and general company questions are just a few of the many queries asked).   The lineup itself, though weaker compared to Classics Vol. 1, does offer a solid array of games. 1941, Magic Sword, Captain Commando, Black Tiger, Strider, and Side Arms are all must-have additions for any self-respecting arcade fan of the 1980s. Eco Fighter is also a hidden gem and Knights of the Round is essentially Final Fight with swords and an experience system. It's good to see each of them pop up again here so that newer audiences can enjoy them.    As always, presentation and emulation in compilations of this sort is of the utmost importance and the good news is that, like the PSP versions before it, the translations here have been handled very, very well. The team at Digital Eclipse has proven that it knows how to move coin-op code to home systems time and again with its previous efforts, so the move from ROM to console is pretty seamless. There isn't any noticeable slowdown, audio problems, or video hitches to speak of whatsoever (unless they appeared in the original games to begin with), and that's a big victory for a retro-pack fans who don't always get that in their collections.    Another nice plus for Capcom fans is that Classics Vol. 2 also benefits from several presentational advantages. Loading between games and menus is noticeably faster than its PSP counterpart -- taking only 5-8 seconds, with no loading to worry about again until you switch to another title. Additionally there are plenty of bonus goodies available for every game; the history of each individual title, several pieces of unlockable art, hidden gameplay tips, and audio bonuses are among them. Users can even switch between various viewing modes with differing results in every title.   Some games, for instance, will offer an original viewing option or a friendlier ~Enhanced~ mode that squeezes more information onto the screen at one time. Control configurations can be customized too, and certain cheats (like auto fire) can be switched on with the tap of a button. Component cable owners should also be pleased to note that every game in the set runs in 480p progressive scan (a nice bonus for those of us enjoying backwards compatibility).    Despite all these strong elements, however, Classics Vol. 2 does run into a number of hiccups that keep it from realizing its full potential. The biggest hurdle, of course, is that the set has an inferior game selection compared to its predecessor and competition. As fun as the titles I mentioned earlier may be, the remaining choices aren't anywhere near as compelling. In fact, the top-down brawler known as Avengers and the bizarre shooting duo of The Speed Rumbler and Last Duel skirt the border between awful and terrible. Moreover, the original Street Fighter, Quiz & Dragons, Mega Twins, Three Wonders, and Varth range between poor to okay at their very best. Sure, some of the stronger titles helps even things out a bit, but in terms of overall quality, I've definitely seen better selections out there.   It's also sad to see that neither the Xbox or PlayStation 2 versions of Capcom Classics support multiplayer oh numerous systems. With multi-system functionality already available for both PSP games, the technology to do online is certainly there -- so why not give it to us?With excellent high-level production values, superb emulation, and an easy to use interface, Capcom Classics Collection Volume 2 should please most retro Capcom fans. Having legendary fun traps like Strider, Knights of the Round and SF2 Turbo doesn't hurt either, while some of the remaining shooters like 1941 and Black Tiger are definitely worth checking out. I only wish that this version wasn't behind its PSP counterparts in terms of its multiplayer capabilities. It's almost 2007 and playing an online capable version of a 20 year-old arcade game shouldn't be a pipe dream. Even so, for you get this set isn't a bad pickup at all.", "date": "Nov 27, 2006"}