{"name": "Corvette Evolution GT", "name_review": "Corvette Evolution GT Review", "ref": "https://www.ign.com/articles/2006/11/27/corvette-evolution-gt-review-2", "text": "Racing is one of the few genres where hardcore skill is both respected and required... but Corvette Evolution GT walks all over this even when it tries to embody it. Driving skill is still necessary to dominate the competition, but with some poorly added features meant to mimic the real experience only making it a joke. In the process, a bargain title with some promise gets crippled and deserves to be forgotten.   So many different parts of the racing experience run true in Corvette. The 28 different racetracks are interesting and capably executed. The cars have distinguishing characteristics and require finessing. Observance of proper acceleration, braking, and following the all-important racing line will determine success. It all adds up to what is a decently good, if not terrifically exciting or unique, racing game.    The problems arise with different characteristics for the drivers. Beginning the career mode involves choosing a style of driver. It's a fantastic process where you get to choose just how you want the game crippled to your satisfaction. Instead of worrying about how all the cars can be modified it's much more important to worry about your own Concentration and Throttle Control. Notice the capital letters since these qualities affect how the game is altered.   In the Corvette world, intimidation is a big thing. It's even a ~Really Big Thing.~ If someone drives right behind you, you can be intimidated. This can deplete the concentration meter and if it's completely gone, you'll get a Knockout. This makes the road harder to see as the vision gets blurry and a loud breathing noise starts up. It's all meant to simulate the experience of feeling nervous with another driver breathing down your throat and it's all a fat load of crap.    The problem with the intimidation is that it can cause all sorts of artificial situations. Granted, it can be nerve-wracking to have someone right behind you, but that's the nature of the race. Watching the concentration meter go down is a reason to start driving badly as you try to avoid getting a Knockout. In a sense, this causes a premature KO and can give an opening to anyone behind you. Often it's to your advantage to block someone else's path, like on a turn (which, you know, can happen very often... dozens of times per race, for example).   The same thing can be seen in the computer drivers. Get behind them and they'll wriggle to avoid the Knockout. The odd thing, though, is that when they do get a Knockout they start to drive in a nice straight line. So there's no payoff to seeing another driver completely lose it and go off the course. The whole system is backwards and useless.    Making things worse, there are other such bogus characteristics, even if they're not as bad as the intimidation. There's the Brake Timing that allows for more effective braking and the Throttle Control that improves acceleration -- both traits that belong more in the car than the driver. Even drafting gets improved by the driver. About the only nonsense that is helpful is the Tiger Effect which allows you to roll the clock back to try and avoid a mistake you just made.Corvette Evolution GT was well on its way to becoming an all-right racer. Nothing fancy, but a decent ride for the bargain price. But with all the nonsense tacked on it becomes a joke with itself as the punch line. For some reason, the simulation of the psychological effects was given plenty of influence when they really should have been ignored. Much like this game itself.", "date": "Nov 27, 2006"}