{"name": "Bust-A-Move 1999", "name_review": "Bust-A-Move '99 Review", "ref": "https://www.ign.com/articles/1999/04/07/bust-a-move-99-2", "text": "The second N64 installment in Taito's puzzle series is finally here - and to no one's surprise, it again impresses with addictive gameplay and disappoints with dated graphics and sound: Bust-A-Move '99 (previously known as (Bust-A-Move 3 or DX).The Facts Four player head-to-head competition. All new and improved graphics. Rumble Pak support. Literally thousands of different puzzles. Challenge, CPU, and Head-to-Head modes . Contest Mode offers over a 1,000 classic Bust-A-Move puzzles. New special bubbles: star, metal, rainbow, and block. All new backgrounds Classic character animation and non-interactive sequences Eight new characters from Taito video gamesGameplayThe game is as simple as it looks and hasn't changed for years: take control of a cute little dinosaur or similar character, and shoot balloons from the bottom of the screen to the top where they stick to others. Simply line up three of the same color to make them pop.If different-colored balloons are clinging to those that pop, they drop. To hurry your attempt to clear the screen, the balloons slowly work their way to the bottom of the screen as well. When they hit the bottom, you lose. Different special bubbles, such as the Star, Rainbow and Metal Bubbles make the task a little easier, whereas ~unpoppable~ Block Bubbles hinder your progress.Sounds easy, right? The beauty of Bust-A-Move is that it's easy to get into, but hard to put down. Once you start playing against a friend, you're hooked. Although very similar to its predecessor, Bust-A-Move '99 features a few interesting new features as well as an outstanding four-player mode.The different modes are: Arcade Mode: A straight-out arcade conversion of Bust-A-Move '99. Play against the computer or a second player or compete in the puzzle mode. Very similar to last year's Bust-A-Move. Multiplayer: This is the real reason to buy this game. Play with up to four players in Time Trial and Arcade modes. Challenge Mode: Five different challenge stages, each with five rounds. An evaluation screen tells you how you did and gives you a performance grade. Win Contest Mode: Similar to Player vs. Computer, but the aim is to win as many games in a row as possible. Collection Mode: Another '99 original: Try to solve some of the more than 1,000 Bust-A-Move fan-created puzzles. Edit Mode: Create your own puzzles and save them to a Controller Pak for later use, or trade them with other player via the Internet if you have a DexDrive or similar data exchange device.If you already own last year's version of Bust-A-Move, you have to ask yourself whether the Collection Mode, Puzzle Creator and four-player mode are reason enough for you to plunk down another $40 for this upgrade. If you don't own the predecessor, then definitely give this game a try.MultiplayerIf you don't have any friends, get out of your house and find some. The different two-player modes are still as addictive as ever, but the N64 version of Bust-A-Move '99 actually goes a step further and enables four-player battles on one screen. Things get a bit tiny (especially if you have a small TV), but once you get going, there is no stopping. The four-player mode is also the one decisive factor why we recommend the Nintendo 64 version over the two-player-only PlayStation game.GraphicsAs with most Japanese puzzle games, the sprite-based graphics are rather plain and a far cry from modern 3D puzzlers such as Tetrisphere. It's the same old 2D stuff with static backgrounds and it's definitely time for an upgrade. Please, Acclaim -- give puzzle fans some more eye candy to look at with future releases. It's no question that the Bust-A-Move games are gameplay driven and graphics don't play that huge of a role, but other companies are now raising the presentation bar in the puzzle genre and it would be sad if the Bust-A-Move games were left behind. The four-player mode is already running in hi-res on the N64, how about a new look in the one-player mode as well?SoundSame old, same old. With The New Tetris poised to dazzle gamers' ears with the latest compositions of Tetrisphere music wizard Neil Voss, Bust-A-Move '99 just can't compete. It's the same Japanese-style arcade game music with ~wacky~ voice samples we have endured for years. Time for a change.Peripheral SupportBust-A-Move '99 supports the Controller Pak (save your own puzzles) and the Rumble Pak for tactile ~bubble popping~ feedback.Like its predecessor, Bust-A-Move '99 is an excellent puzzle game that will keep you entertained for ages. It's got everything Bust-A-Move fans could ask for -- a plethora of premade puzzles, a puzzle creator and even the first four-player mode in the series. Unfortunately, as well-balanced and addictive as the gameplay is, the graphics and sound are terribly outdated. Had Acclaim tried to polish the game in its presentation, it could have easily scored a 9 in our overall rating. An addictive game that no puzzle gamer should be without.", "date": "Apr 7, 1999"}