{"name": "Naruto: Uzumaki Chronicles", "name_review": "Naruto: Uzumaki Chronicles Review", "ref": "https://www.ign.com/articles/2006/11/28/naruto-uzumaki-chronicles-review", "text": "It seems Naruto will soon sit next to Dragon Ball Z in terms of popularity. It certainly feels that way, anyway. Naruto has invaded the world of entertainment through comics, television shows, toys and videogames. The latest product - Naruto: Uzumaki Chronicles - has just landed on store shelves. Unlike previous Naruto videogames, it takes a fresh approach to life as a cartoon ninja.  Where most titles in the past had players fight in arena-style combat, Uzumaki Chronicles opens things up considerably. Players can explore the world and take on missions as they see fit. There's also a bit of story throw in, though it never amounts to much. Some of the dialogue and mission objectives will make players giggle, but none of it ever qualifies as riveting narrative. Not that it absolutely needs it, but it would have been nice to see a Naruto game with some drama - even if it's of the kiddie variety. Half of the reason why kids love this stuff is because of the characters and their personalities, so it wouldn't be a stretch to add more of that into videogames.     Still, the fact Uzumaki Chronicles adds a little more depth than the average Naruto title definitely helps. Players start the game by receiving ~D~ and ~C~ class missions and work their way up the ladder. Missions in Naruto make up one of the game's highlights but also one of its biggest flaws. To start, it's cool they're there. Choosing which missions to complete helps the franchise move forward. Every mission has a little story thrown in, which also helps the franchise move past its action-only roots. At the same time, missions suffer from a lack of variety. Players have a choice, sure, but most of the time it all boils down to the same handful of tasks.   Which, of course, somewhat invalidates the choice to begin with. For the most part, players spend their time protecting a villager's assets or finding items scattered about the gameworld. But all this means is that players need to kick the crap out of everything in sight. Having to safeguard a merchant's cart of goods is cool and everything, but it should only happen a few times. Fortunately, the scenery changes as players roam from village to village, so there's a nice aesthetic break. Ultimately, it feels like there's a definite purpose to what happens during a mission, even if the objectives themselves lack depth.   On the plus side, the action itself works well. Players can execute moves, techniques and combos with little trouble thanks to intuitive controls. It's all simple stuff, like everything else in the game, but it works out fine nonetheless. Even the most complicated maneuvers will only take a few button presses. Plus, enemy AI is abysmal. In many of the earlier missions, rival ninjas or outlaws simply stand there awaiting execution. They honestly make no effort to save themselves half the time. And when they do, they'll just swing one or twice and then stop. They go down easily, so players will cut through a dozen in a matter of seconds, but a little enemy AI would have gone a long way.    To help alleviate things, Uzumaki Chronicles adds depth in the area of character growth. Players can modify a ~Skill Plate~ by earning a form of currency, known as ~Virtue~, and buying new abilities. This Skill Plate is only so big, and each new skill requires specific space, so it's cool having to budget things. Players need to decide whether they want more health and stamina for a specific fight, versus something like a powerful attack. In addition, the game also lets players permanently increase vital statistics, too. All of this adds variety and strategy to a product that could use all it can get.   Naruto: Uzumaki Chronicles takes the Naruto property forward a few steps. Letting players choose missions and explore the gameworld is a definite plus, as are additions in the area of character growth. It definitely has the right idea, but a few key factors keep it down. Enemy AI could use serious reworking, for instance, and missions suffer from a lack of variety and depth. Fans should check it out.", "date": "Nov 28, 2006"}