{"name": "Rule of Rose", "name_review": "Rule of Rose UK Review", "ref": "https://www.ign.com/articles/2006/11/28/rule-of-rose-uk-review", "text": "Let's, for a minute, assume that the tidal wave of ill-informed flapping from a bunch of attention-seeking politicians and wannabe moral guardians hadn't pushed things to the point where 505 Games - somewhat incredulously - pulled Rule of Rose from UK shelves, no less than a week after challenging the game's critics to play it themselves. Let's, for a minute, assume anyone on these shores could still waltz into a store and decide for themselves if Rule of Rose represents an industry stampeding headlong into irresponsible depravity - question is, would you want to?   Well, for all the brouhaha surrounding Rule of Rose, for all its 'controversial' subject matter and clamouring for the game's ban, there's one simple fact, almost guaranteed to ensure the game never corrupts the European masses - it's a bit rubbish. Actually, that's probably a little unfair - there's an incredible amount that Rule of Rose does very, very right. Unfortunately, there's one thing it does so desperately wrong, it may as well not have bothered with anything else.   In a nutshell, Rule of Rose sees you take on the role of nineteen year-old Jennifer, an ~unlucky girl~ (as the game would have it) as you search to uncover the meaning behind your incarceration in strange, fish-shaped zeppelin high over 1930s England. Along the way, you'll fall foul of the Red Crayon Aristocrats, a domineering clique of children with a fondness for humiliating punishments, exacted on anyone who crosses them. In case you're wondering about that 'controversial' element, it's here - with a minority of the beautifully-presented cut scenes focussing on Jennifer's torment at the hands of the Red Crayon Aristocrats. Just to get it out of the way once and for all though - is the game a obscene proponent of child torture? No, of course it isn't. There are certainly a few sequences here that'll no doubt raise an eyebrow - anyone who's played the game will probably flinch at the words 'onion bag' for ever more - but it's all presented with remarkable restraint.    You see, without wanting to give too much away, the game unfolds as a series of vignettes all representing moments from Jennifer's tortured past and, the further you proceed, the clearer her memories become. If there's one area where Rule of Rose warrants nothing but praise, it's in its attempt to present a complex psychological yarn that's certainly a step over the usual alien-encounter pap we're generally treated to as gamers. Thanks to some brilliant characterizations, a consistently intriguing, imaginative narrative and lovingly rendered locations, Rule of Rose is undoubtedly one of the most compelling, involving games we've played in a long, long time.   Where it all starts to go hideously wrong though is in the gameplay itself. As far as survival horror games go, Rule of Rose is about as traditional as it gets. You'll wander the same lonely corridors again and again, collecting objects and solving a nominal handful of barely taxing puzzles as you go. As if its general set-up wasn't antiquated enough, Rule of Rose bears all the familiar hallmarks of the genre circa-1996 and the original Resident Evil. Yup, you'll thrill at the endlessly jarring camera switches, marvel as your controls suddenly invert as a result, sending you careening into the nearest wall, and revel as you backtrack across the same area for the umpteenth time in half an hour.   That said, the game's one nod toward innovation - the inclusion of your constant companion Brown the dog, goes some way to alleviating the usual trial-and-error survival horror slog. Early in the game, you'll rescue Brown from certain doom and discover you can teach him to sniff out clues by wafting items under his nose. For example, you might uncover a letter belonging to a character you need to find - give Brown a sniff and he'll scamper obediently to the nearest door, guiding you in the direction of your goal. Effectively, this means you'll never be stuck wandering aimlessly around the environment, desperately searching for the next item or cut scene trigger. It's a brilliant way to minimise the tedium usually plaguing other games of its ilk and, what's more, Brown's a wonderful creation, infused with enough personality to make proceedings all that more emotionally involving.    Then though, it all goes horribly, devastatingly wrong. You see, the game's combat system is so fundamentally broken you'll likely want to rip the game out of your drive and stamp it out of existence roughly two seconds into your first enemy encounter. Sure, we'll go along with this whole ~unlucky girl~ shtick - it makes sense that Jennifer, thrust into her nightmare world with nothing but a tiny selection of kitchen utensils to defend herself, isn't going to be the most brutal of brawlers.   If you're going to play up your main character's vulnerability though, you should at least give her a fighting chance for survival. As it is, combat is so clumsy, collision detection so utterly dubious and successful blows landing so seemingly random, it'd be funny if it wasn't so infuriating. Jennifer's tendency to take a tumble after a hit, struggle through her revival animation then get up just in time to be smacked to the floor again doesn't help matters either. Factor in the fistful of compulsory boss battles, enforced enemy encounters and - even more perversely - frequent occasions when you have to battle corridors literally crammed with opponents and your patience is likely to wear thin pretty quickly.Its a shame that theres so much wrong with the games combat system  to the point of being game breaking - because, otherwise, Rule of Rose is a fascinating, compelling adult-orientated mystery horror. Its presentation is frequently stunning and the imagination and maturity with which it approaches its subject matter could  in the right hands  have made for an unforgettable experience. As it is, its tough to recommend Rule of Rose to anyone but diehard survival horror fans or complete masochists. If you happen to fall into the former category, theres a chance you might well find the games charms enough to see you through to the end  its story is certainly both intriguing and ultimately powerful enough to warrant a play. Everyone else though would probably be best off looking elsewhere. One more point on that controversy thing though  Jennifer regains her health by stuffing scones, biscuits and lollipops down her gob. If thats not an irresponsible message to send to the children, then we dont know what is.", "date": "Nov 28, 2006"}