{"name": "Superman Returns [DS]", "name_review": "Superman Returns DS Review", "ref": "https://www.ign.com/articles/2006/11/29/superman-returns-ds-review", "text": "The Nintendo DS has had a rough time with superheroes in the past few months. Apart from Activision's Spider-Man series games featuring comic book crimefighters have turned into unlikable messes on the dual-screen portable. Electronic Arts' recently released Superman Returns hasn't fared very well on the console side of things, so it's a good thing that the Nintendo DS version has been developed and designed independently from that Tiburon trainwreck. That doesn't let ol' Superman off the hook on the Nintendo DS -- this Santa Cruz Games-helmed project has some highflying moments but some clumsy control, repetitive gameplay, and just overly sloppy programming gives the Man of Steel another dose of gaming Kryptonite.   The DC hero's been videogame cursed ever since Superman 64 on the Nintendo 64 years ago, but honestly, there hasn't been a truly breakout game featuring the Man of Steel...ever. He's a tough nut to crack...I mean, how do you create a straightforward videogame for a guy that can pretty much do anything? He's uber strong, he flies, he shoots beams out of his eyes and huffs hurricanes through his nose. But most importantly, the guy's damn near invulnerable. So how do you create a game where the undefeatable can be defeated without really breaking character?   In Superman Returns' case, the Nintendo DS developers give Superman his most daunting enemy of all: time. In each challenge, Superman is pretty much faced with a challenge that has a looming clock ticking away, and if Superman can't complete his set task before that clock hits zero, it's pain time. Fly around town rescuing hostages, or blowing away portals that spawn enemies which need to be zapped with heat vision, or more ridiculously, fly to the Daily Planet so Clark's not late for work. Of course, this is Superman Returns, so there are movie-specific challenges, like rescuing that Space Shuttle-tethered jet before it gets away. But the designers felt that the film's plot was a little to lovey-dovey to tailor into a videogame, so they've beefed it up by interspersing past  Superman villains in the mix while Lex does his evil ~land~ situation from the flick. If you don't know these characters already, the game doesn't really explain them very well other than ~they're evil~ and that they can be defeated in a Dance Dance Revolution fight-off that's extremely easy to win.   Because each challenge has a different requirement, the controls are context sensitive to the situation...so you won't need heat vision in one level or super breath in another. But flying is key in pretty much every level, and here the controls are a mixed bag: if all you want to do is zoom around the city at top speed, the controls actually feel nice. If you need to slow things down, that's when the controls get clunky: the shoulder buttons become up and down which is something that never becomes intuitive, but is something that's important to utilize since players will need to guide Superman up and down to collect items or access certain areas in the city.   Superman is still his impervious self in Superman Returns. It's almost impossible to get the guy killed or even harmed since there's really no ~fighting~ in this game.  It's Metropolis, however, that has the healthbar. See, as the game progresses, any enemy or disaster still happening in the city will ~damage~ Metropolis, taking precious ticks away from the city's health. If that bar reaches zero, the city's overwhelmed and destroyed, and Superman is defeated. So, while the game will continue if you screw up a mission, it actually hurts Metropolis by failing at the task. And while this seems like a really good direction for a Superman game to take in a videogame, the way it's implemented in the Nintendo DS design is flawed and actually hurts the game's presentation.      Here's the deal: for every disaster still on the map after a single turn in this strategy game, Metropolis takes a point of damage. If there's an archvillain, like Metallo, Brainiac, or Bizarro Superman on the map, the city takes far more damage. So, strategically, it makes sense to go after the archvillain and take him out first. But in many cases, these villains will coexist on the map in different and remote locations, which will take Superman several ~moves~ across the tiled board. The only time you're ever really rewarded in completing a task is when you've defeated a villain, earning a bit of health for the victory. But you still get penalized for the dangers that are still in the city, so any victory points are taken away...which is something that really hurts when three enemies are wandering the map at the same time. Ultimately, this means that you'll very likely lose the game even if you're doing extremely well since the game is constantly throwing more and more disasters your way.   So, overall, even if the game has some fun in its challenges, the strategic design that ties all of them together is faulty and almost broken.    The game isn't anywhere near flawless outside of this problem, though. Superman Returns has a serious ~rushed~ feeling with some spots of inefficient programming. The game has jarring loading sequences with an extremely ugly and glitchy ~Loading~ screen that draws way too much attention to itself. The 3D engine is smooth in animation but lacks a lot of detail -- Metropolis lacks life on the DS. No cars, very few pedestrians unless the level calls for it...it's a very empty town. Even with the clean look, the programmers can't hide some limitations: the game features some pop-up in the distance, and on occasion visuals will simply disappear. And while it's certainly clever to flip Bizarro Superman levels upside-down on the upper screen, that's more annoying than it is fun.   Even with some incompetent programming issues, the game has some cool moments. The single cart multiplayer is actually a pretty fun challenge, even if it takes fifteen years to get started, and requires all players to turn off their system after the game's over. But it's not enough to save Superman Returns from the pile of mediocre videogames already plaguing the most popular handheld system of 2006.Superman Returns on the Nintendo DS didn't turn out as bad as the big screen console versions released at the same time, and isn't nearly as bad as many of the other superhero games on the Nintendo DS. But that doesn't mean the Nintendo DS version's a good game. There are some solid gaming moments here, but the glitches and flaws in the design are too large here to ignore.", "date": "Nov 29, 2006"}