{"name": "Monster 4X4 World Circuit", "name_review": "Monster 4X4 World Circuit Review", "ref": "https://www.ign.com/articles/2006/12/01/monster-4x4-world-circuit-review", "text": "A couple months before E3 of this year, Ubisoft released Monster 4X4 World Circuit, and like most mediocre games it ended up being lost in a sea of shelf space.  While the game showed some potential and a smash-mouth style to go with it, its execution came up seriously short, offering extremely one dimensional racing that had us begging for more after only a few quick minutes.  Now that it's Wii launch time, Ubisoft decided to take one more crack at the game, giving the design a bit of an overhaul and teaming it with the Ubisoft Steering Wheel peripheral much like GT Pro Series to try and add to the value of the package.  The final result:  Monster 4X4 World Circuit for Wii, a game that manages to squeeze a bit more entertainment out of an otherwise mundane control scheme by incorporating some simple motion control while simultaneously managing to drop the graphical presentation to an almost insulting level.     Monster 4X4 World Circuit is ultimately a stronger effort than the Xbox version before it, but it's still a long way from excellence.  Though we don't really consider the game to be a port, Monster 4X4 World Circuit does have a bit in common with the previous iteration.  Racers will select from a number of bulked up 4X4 trucks, enter into either a quick race, world circuit challenge, or multiplayer match, and rip around tracks inspired from locations around the world.  Taking center stage, the World Circuit mode is where the bulk of the gameplay can be found, spawning new challenges as you race week after week against rivals in hopes to pull off huge tricks, score gigantic points, and cash them in for vehicle upgrades.  All in all the design sounds like a winning formula for basic arcade racing, but in the end the game is plagued much like its previous release by not only huge issue, but a number of imperfections throughout the entire design.    For starters, the game's presentation and visual design has been greatly downgraded, as we're seeing the same vehicles from the Xbox version now scaled down to near GameCube status.  In addition, a ton of the overall style previously found in the franchise has actually been replaced, changing huge neon icons and speed-tunnels for a more modest and kid-friendly design.  The games heads-up display has a very simplistic and blocky look, the effects are a bit more basic, and many of the tiny quirks such as in-level traps and shortcuts have been taken out entirely.  On the surface the game seems to be a sequel to the version we played a few months back, but in reality it's actually a much more basic design.   On the other hand, the overall gameplay of Monster 4X4 has actually gotten a bit of a bump, and credit is due entirely to the Wii controller.  Not only is basic driving done by twisting the Wii-mote like a steering wheel, but the actual trick system makes use of basic movement as well.  While the previous game had players simply holding the analog stick in a direction as they neared the launch point of gigantic ramps, the Wii version uses actual movements to pull off stunts.  To do a backflip for instance, player swill actually swing their hands in a large forward/backward ~O~ shape as if they were actually grabbing the front of the truck and pulling it up and around in a full circle.  For corkscrews, a similar shape is done from left to right in a cranking motion, while air-spins are pulled off by quickly rotating the Wii-mote left and right.  The basic steering in the game still feels a bit slippery, and it takes a lot of movement to get a full turn out of the wheel, but it still gives off a decent rally feel to the game regardless.  As for tricking, the front/back flips work without a hitch, while a few of the more complex moves can have some motion recognizing problems.  In addition, the instruction booklet shows only flipping moves, and simply tells players to ~experiment~ to find others.  If we hadn't previously played the game under Ubisoft's direct supervision we may not have even found a few of the actions for quite a while.     As for the general feel of the game, Monster 4X4 offers some decent - but simplistic - arcade racing, while missing out on some necessary speed and difficulty.  Races feel nearly identical as you blast though the different events, having the actual world areas of Giza, Barcelona, Mt. Rushmore, and Sydney being the only major change, and even then the different locations only act as a backdrop to the competition.  Whether your blasting through the sandy desert in Thebes or doing snow-rally in Moscow the gameplay is still almost identical, offering only a few attack power-ups, speed boosts, and nitro cans to collect.  The balance between cars is also a little disappointing, as the overall speed is the most important attribute, so while points can be distributed into handling, shield, destruction, stunt, and nitro as well most players will be focusing on one main car throughout the entire World Circuit, upgrading speed as the primary objective.     All things considered though, Monster 4X4 World Circuit actually shows a lot of potential for a sequel, and if the game lands in a stronger developer's hands with a bit more time and cash to work with the franchise could actually see some time in the spotlight on Wii.  The gameplay still has some entertainment strictly in the motion control and arcade feel, and the design is already focusing on the little things such as car color, decals, and upgradeable stats for racers.  There just needs to be more focus on the core gameplay and visual presentation as well, which is something that Monster 4X4 misses the boat on far too much in this version.  Plug in a more polished racing engine with a bit more depth to the controls and all of a sudden the different locales, World Circuit races, and basic four player multiplayer improves in leaps and bounds because of it.  Monster 4X4 World Circuit follows the same route as GT Pro Series, proving that there are a few titles during Wiis launch that are out to make a quick buck rather than actually pioneering their genre on the system.  While Monster 4X4 adds more entertainment around the included wheel peripheral and an overall stronger game than GT Pro Series, it still suffers from downgraded graphics and an overall lack of style when compared to its Xbox predecessor that released just a few months ago.  The games overall control and trick system has been improved because of the Wii controller though, and even makes for a few entertaining moments during otherwise monotonous play, but the game lacks a polished feel in almost every area.  The presentation is very weak, having menu interfaces that often look more like DS art than Wii, and course design leaves little to enjoy after only a few times around the track.  Ultimately Monster 4X4 World Circuit will leave players with a generally cheap and unsatisfied feeling, as the entire production could have used more effort in virtually every facet of its execution.", "date": "Dec 1, 2006"}