{"name": "Carmageddon 2", "name_review": "Carmageddon 2: Carpocalypse Now", "ref": "https://www.ign.com/articles/1999/04/09/carmageddon-2-carpocalypse-now-3", "text": "The Carmageddon series ... there's nothing nice about it, at least in warm fuzzy terms.  The original was a violently messy game that gave life to the joke about scoring points for killing pedestrians.  It was this total disdain for life that got it banned in several countries as well as giving it instant credibility with video gamers.  We really are a sick bunch, aren't we?  Well, like it's predecessor, Carmageddon 2 was banned in several countries for its haphazard display of gory violence.  And, while the basic premise of Carmageddon 2 has remained true to it's younger sibling, the sequel definitely improves on the controls and graphics, somehow making it even more grotesquely appealing in the process.    If there's one thing you can say about Carmageddon 2 it's that the game has gotten even gorier than before.  At its core, Carmageddon 2 is a lot like other arcade racing games. You jump in your souped-up hot rod and race against a group of speed demons through varying landscapes in an attempt to be the first one to reach the finish line. Along the way you'll earn extra time and upgrade credits by passing through various checkpoints and collecting power-ups. What makes Carmageddon different is that you can also earn credits for running down pedestrians.  That's right, each living thing you mow down will earn you money that can be spent on improving the condition of your car or buying power-ups and new cars. It's more than just mindless violence though (watch as I try to justify this), extra points can be earned through particularly creative slayings, or by killing more than one person at once. Sound horrible? It is, but no matter how much I want to win a race, the races always seem to break down into repeating runs through a crowded square trying to see how many folks I can kill at once.  Money is money after all.  Control has been improved over the original Carmageddon, but the cars still feel just too darn floaty, like you're racing on some low-g planet.  I also ran into some framerate issues when I had the details turned all the way up.  While the races get a bit tedious, especially at the higher levels where it seems nearly impossible to finish a race in the allotted amount of time, the multiplay aspects actually offer up a good bit of adulterated fun.  Carmegeddon 2 supports up to eight players over a LAN or the Internet, so you can get your buddies together and pound their cars into stubby little blocks of metal.  The graphics in Carmageddon 2 have also been drastically improved over the original, with better car details, larger levels and chunkier pedestrian eviscerations.  Everything's in 3D now, and it's the little graphical touches that are the most notable improvement in the sequel. Cars now show dents where they get hit, and repeated damage can rip off your bumpers, hood or even your doors. Since all of these objects are modeled on hinges, it all looks fairly realistic when pieces hang onto your car for a few seconds before tumbling off. Objects in the world around you can be similarly damaged  light poles snap and fall, store windows smash, etc. The end result is a car and an environment that respond like real life, but this time you don't have to go to jail to find out what ramming into stuff would look like.  However, as nice as the cars and environments look, the pedestrians still appear very stiff and blocky, looking more like mannequins than actual humans.  Sure, they look better than the 2D pedestrians in Carmageddon, but they could be better.    Carmageddon 2 is good for a few quick rounds, but it just doesn't stand up over time.  Sure, it looks and plays a lot better than the original, but it's still just more of the same.  If you're looking for a game with depth, don't look here.  But if you're a sick little monkey who likes dismembering folks with the hood of your car, then you'll find some wicked (if not twisted) fun in this title.  -- Kip Merriweather", "date": "Apr 9, 1999"}