{"name": "Spider-Man: Battle for New York", "name_review": "Spider-Man: Battle for New York Review", "ref": "https://www.ign.com/articles/2006/12/02/spider-man-battle-for-new-york-review", "text": "Another year, another Spider-Man game. And while this used to be something to look forward to (Spider-Man sporting one of the best track records of any handheld superhero), the latest game from Activision and developer Torus Games will definitely be a letdown to fans of Marvel's webslinger.    Based on characters and plot elements from the Ultimate Spider-Man universe, the game pits Spider-Man against a Hulk-like version of Norman Osborne (aka the Green Goblin). The two rampage the town looking for one another, swapping the player's control between both characters in a less-successful recreation of what was done with Venom in last year's Ultimate Spider-Man games. Design-wise, this game is similar to previous installments, with Spider-Man pounding punk after punk in buildings, alleyways and half-constructed high-rises.    Combat is pretty weak in this game, though. Although both Spider-Man and Goblin have a decent number of moves, their attacks don't connect well and result in plenty of cheap shots from the enemies. Both playable characters inch forward as they attack, which causes the player to eventually overlap the enemy and stop actually hitting them. Enemies seem to have no problem connecting punches during these moments, though. The game also allows enemies to aim in multiple directions and attack from offscreen, making level progression more about luck than skill. Enemies can be killed by environmental hazards like fire and electricity, which is fun to watch but it makes collecting the powerups they drop a real pain.    Spider-Man can punch, kick, web-sling and wall-crawl just as expected. A few times I noticed a delay between landing and being able to throw a punch, which let enemies get in a few more cheap shots. Goblin's melee attacks are a joke. His basic punch doesn't extend nearly as far as enemy punches do. It's unbalanced, unfair and forces the player to rely almost entirely on his fireball projectile attack to make it through each level.    Between levels, the player is given points to upgrade their character's stats. This increases health, attack damage, web strength and so on, although the difference between a standard and leveled-up attack is barely noticeable.    In between beatings, the player needs to find and take out triggers in order to shut down electric barriers and move on. This draws attention away from the flawed combat, but hitting switches is so one-note that by the third level all fun has been drained from the exercise. Whether it's a security camera, a generator or a switch, locating an object and punching it gets boring fast. The developers added a small arrow icon to indicate where the next target is, which is the only reason I was able to make it through this maze-like game without tearing my hair out.    What really sucks is just how rarely Spider-Man's web abilities are required. Giant fans in ventilation shafts that have to be webbed to pass are cool, and there's a decent amount of wall-crawling but beyond that there's not much here that's Spider-Man specific.    There's zero enemy variation in this game, just a whole lot of generic punks and some occasional odd ghost creatures. Boss battles are pretty awful and not remotely creative. Most bosses can either be rushed (Goblin) or exploited (Silver Sable, who can be cornered on the ceiling and beaten until her health is nearly gone). Judging from the gameplay, I don't understand why Generic Punk #12 isn't leading The Kingpin, since the punk at least knows how to get a few cheap shots in on Spider-Man.    In regard to graphics, the sprites seem to be pre-rendered off cell-shaded 3D characters and actually look pretty fantastic. Animation, especially in the heroes is super-smooth and lacks that stiff, robotic movement usually associated with pre-rendered sprites. Enemies and minor characters are less memorable, and some enemies just make no sense (like the floating ghosts that weep loudly when beaten). As unmemorable as these characters are though, Spider-Man himself has never looked or animated better.    Unfortunately, sprites are the only in-game art with any polish. Backgrounds are bland and look incredibly fake. Most of the background art (especially distant buildings) is flat and boring. The level designers did an awful job throughout the game; buildings are constructed so randomly that no gamer could believe they actually function. Floors don't line up, platforms are oddly placed and ventilation shafts run all over the place.    But the greatest sin in this game was in grounding Spider-Man. The webslinger has to constantly refill an annoying web meter in order to shoot webs at badguys and wrap them up for a beatdown. In an idiotic decision, Spider-Man's web-swinging is also tied to this meter. This means that the player can swing about five times before the meter is completely drained and they fall from the sky. The player then has to wait or look for web meter powerups before taking off again. Lame! The developers took the one really fun Spider-Man gameplay mechanic and practically removed it from this game. And since most levels are indoors and cramped, even when the web meter is maxed out there isn't much opportunity for swinging around.    Menus are pretty plain, but they get the job done. The player can revisit any cutscene or level from the menu later to replay it. What goes above and beyond standard GBA fare are the cut scenes. Illustrated by comics artist Ron Lim, the cinemas are filled with quality, full-color art that's honestly more enjoyable than the game itself. The story may be a little confusing to Spider-Man fans unfamiliar with the Ultimate line of comics, but each scene is still a visual treat. Sound is pretty bland throughout and the same couple of songs play over and over. The cutscenes are completely silent for some reason.   Spider-Man: Battle for New York is a pretty forgettable game. What hurts it more than anything is that there are much better handheld Spider-Man games already available (including one from the same developer). Torus Games didn't completely drop the ball on this project, but they didn't capture that pure joy of being Spider-Man that made the webslinger's previous handheld games so fun. More swinging without restriction and less mediocre combat would have taken this game a lot further.", "date": "Dec 2, 2006"}