{"name": "Monster Bomber", "name_review": "Monster Bomber Review", "ref": "https://www.ign.com/articles/2006/12/05/monster-bomber-review", "text": "Monsters are attacking our planet, and it's up to the poor saps who bought this game to stop them! The latest offering from publisher Majesco and developer Taito (the team behind the far more charming Cooking Mama) is a boring, shallow puzzle game that ineffectively steals and combines elements from superior games like Bust-a-Move and Space Invaders, and never brings anything new to the puzzle genre.    Monster Bomber requires players to fend off descending monsters from space by flicking colored balls at them before they hit the bottom of the screen. If the ball is the same color as the monster, BOOM! That's a gameplay mechanic I haven't seen in about a week. Players form balls from one of five colored pools on the bottom screen, launching them up onto the top screen. Balls can be dragged around and aimed in any direction, or held in place to build up a charge before firing them off. Charging up a ball allows it to shove a differently-colored enemy upwards (Meteos-style) in order to reach a like-colored enemy higher up on the screen. So if a blue ball is launched into a red monster, and it hits a green monster, which in turn hits a blue monster (picture a freeway pileup) then all three monsters are destroyed. A dozen or more enemies can be taken out by a single ball with this method, and pileups can be chained together for even higher totals.    It sounds like a solid gameplay design, and the touchscreen input is responsive. What ruins it is that the enemies all wiggle around as they float down to Earth, killing any strategy in the game. The reason similar puzzle games like Bust-a-Move and Tetris Attack line up their pieces so perfectly is to allow players to think out their attacks. Because the monsters in this game shift around onscreen, strategy flies out the window. It's easier to flick balls at random or look for easy combinations than try to score big. If the monsters had descended in a structured formation (as in Space Invaders), I could see some insane combos being performed. Since that isn't the case, luck plays a larger role than skill here and all fun is drained after the first half-hour of play.    There are two modes offered in this game. Scenario Mode has players working their way up an inverted pyramid of stages. After each stage is completed, players can select from two new stages (each with its own challenge) as they work their way up the board. When players reach the top (which takes about 15 minutes), the credits roll and the game is over. However, players must climb the board several times in order to complete every available challenge.    In theory this sounds like a great way to introduce replay value to the game, but the developers were incredibly lazy in designing their objectives. Each challenge requires players to either take out a certain number of monsters, or chain together a certain number of combos, but that's about it. The only difference between most stages is numerical, such as removing 250 monsters instead of 150. Sometimes there's no variation at all; when I got to the top of the pyramid my second time, the options were ~create 4 chain explosions a total of 3 times~ or ~create 4 chain explosions a total of 3 times.~ That's right, I was asked to choose between the exact same challenge.    Objectives are also too rigid; when a chain of 4 monsters is required, the game means exactly 4 monsters. Chaining together 5 or 6 monsters does nothing, and since chain length is pretty random, completing these challenges takes far longer than it should. If a few of the challenges had combined multiple objectives, such as chains, monster count and a timer all at once, there might have been some reason to play through every stage. There are four difficulty levels, each with 20 stages in it, but it's doubtful anyone will bother playing through all of them.       Each stage unlocked in Scenario Mode can also be played in Endless Mode. Here, players fight off monsters in exactly the same way, only without an objective. The goal here is to survive as long as possible before the monsters break through the barrier. This mode also offers 4 levels of difficulty.    The game features single-cart multiplayer for up to 4 players. Sadly, there's very little interactivity between gamers. Although the tutorial claims otherwise, I didn't notice any of my combos and chains affecting the other players during gameplay. All it takes to win is outlasting the other opponents.    There are a few powerups that drop onscreen in all modes to make the game even more frustrating, as well as floating shields and vortexes on the top screen that prevent players from hitting the monsters they aim for. It would have been a good idea to make sure the core gameplay worked before introducing annoying obstacles. A vague tutorial mode and high score screen round out the features.    Music is cheerful and Mario-esque. There are nine gameplay songs, which are surprisingly varied. A welcome addition is the option to swap background music during gameplay by tapping a button on the bottom screen. Sound effects are pretty minimal, but there's really not much going on onscreen to require additional audio.    Visually, the game is bland. Although the five different types of monsters look cute enough, the interface is a generic sci-fi theme and the background images (meant to represent world landmarks for the invasion) are poorly-illustrated. Effects and animation are sparse. And although the interface is easy to navigate, confirmation is required for almost action, slowing game startup to a crawl.   Monster Bomber is a shallow game that loses its appeal almost immediately. The core gameplay makes good use of the stylus, but the aliens move around so much that pulling off combos requires more luck than skill. The game's design required tighter, more predictable patterns of movement and without it, taking out aliens is a sloppy endeavor. It's hard to recommend this game when titles like Feel the Magic offer dozens of more-polished mini-games in a single package. Even at $20, Monster Bomber is a rip-off.", "date": "Dec 5, 2006"}