{"name": "Rayman Raving Rabbids", "name_review": "PAL Wii Week: Rayman Raving Rabbids UK Review", "ref": "https://www.ign.com/articles/2006/12/05/pal-wii-week-rayman-raving-rabbids-uk-review", "text": "Michel Ancel, creator of Rayman, has finally lost it. Not his ability to create a cracking game, mind, but his marbles, because Rayman Raving Rabbids is easily the most bizarre, twisted and downright funny game we've played in a very long time. Break-dancing with bunnies, milking pigs and hog racing - it just isn't standard videogame fare, and that's just the tame stuff too. When our limbless hero has to pull worms from rotting teeth and swing a cow to see how far it'll go, you'll be properly disturbed, if not scarred for life.   But before we tackle the meat of Raving Rabbids, a quick summary: the barking bunnies have captured Rayman, dumping him in an ancient coliseum and forcing him to choose his destiny by entering one of four gateways which lead to glory or the grave, depending on his performance. Behind each gate is a challange but, rather than fighting lions and curvaceous Amazonian women, our proverbial gladiator must tackle 70 fiendish mini-games to secure his freedom. Russell Crowe never had it this tough.    Players tackle four mini-games at a time, each one reached by guiding Rayman through a different gate leading off from the coliseum's central arena. Successfully complete all four and you're challenged to a final showdown, the reward for which is a, um, sink plunger. Don't be disheartened, though; cleverly, by sticking the sucker to the wall it doubles as a rung in a ladder which leads to a window and freedom. It's a long way up though, so best get started on those mini-games then   Starting off gently, the mini-games are initially a case of completing a simple objectives within a set time limit, such as repeating a sequence in a straightforward game of memory or skipping a rope by flicking the nunchuk in time. Even the simplest tasks are given a novel twist though, thanks to the game's distorted sense of humour. For example, the sequence you must copy isn't a series of colours or shapes but the burps, farts and gurglings of four bloated rabbits. Likewise, you're not skipping in the innocent surroundings of a school playground, but a desolate wasteland ravaged by psychotic rabbits, your skipping rope a rusty chain swung by two troll-like creatures. Even the simple task of guiding a ball through a maze has a gruesome twist, because the hole-ridden surface is actually the bruised brain of a rabbit that's been battered by a spiky club. Nice.    However, while the deranged themes running through Raving Rabbids will raise a smile in even the most miserable of gamers, the mini-games are enjoyable because they're just as varied to play as they are to look at. Rayman really does make the most of Wii's motion-sensitive controllers and for that we commend Ubisoft. The game has been built around the control system rather than tacked on as an afterthought. As such, half the fun is actually getting to grips with what you've got to do, whether it's quickly shaking the nunchuk and Wii-mote up and down to milk a pig or swinging the controllers around lasso-style to hurl a cow. Other highlights include whacking rabbits with the flick of a wrist as they emerge from their warrens and rounding up hogs, by riding a freaky looking bird using the Wii-mote to glide through the air and the nunchuk to pick up the porky rogues.      But for all the variety poured on the gamer at the beginning of the game, it doesn't take long before the mini-games start to repeat. Take the disco dancing stages for example: these rhythm-action rounds appear every four games or so and while the music changes each time, you're still just shaking the two controllers in time with the music. While this is all well and good the first couple of times, it starts to grate by the time you're halfway up your makeshift ladder. Similarly, a lot of the mini-games you encounter at the start make a re-appearance later in the game, albeit with tougher objectives or a slightly different theme.   But the mini-game most guilty of serial repetition is the finale to each four-game round. Playing like a traditional lightgun game, you're dragged around a predetermined route through a themed stage that's packed with killer rabbits. Using the Wii-mote to aim the plunger gun (naturally) and flicking the nunchuk to reload, the aim is to bag the evil bunnies and rescue the captured Globox. Extra health and temporary weapon power-ups are collected by shooting them, but that's really all there is to it. Admittedly, the background changes for each round, from the Wild West to a spooky graveyard and - yup, you guessed - even a mine cart level, plus there are different Rabbids to tackle, from suicide bombers to buck-toothed Sam Fishers who nimbly avoid your plunger shots.    But ultimately you're doing the same thing time after time, and when that happens every two out of five games it starts to get a little too repetitive. Admittedly it's no different from, say, WarioWare in that respect, but it's just a bit of a shame because so much thought, care and attention has been put into making the rest of the game so varied.Theres no denying Rayman Raving Rabbids is a game thats bursting with humour, variety and personality. The control system is well-thought out too, plus the mini-games offer a balanced mix of different styles, with each as easy to pick up and as fun to play as the next. Multiplayer is a nice touch, with up to four players competing against each other or two players joining forces against the rabbits. Ultimately, though, RRR is just a series of mini-games linked by a flimsy storyline, although were not so much bothered by that because its no different in that respect to WarioWare. Also, the Rabbids are so full of character and the themes uniquely quirky it doesnt really matter that much. Whats more disappointing is that the main mini-game, the stage finale, varies very little from one level to the next, so youll find yourself desperate to zip through it just to get to the next new game. If these levels offered the same variation as the rest of the game Rayman Raving Rabbids would have been great. As it is its just good, although still one of the better Wii titles on the shelves for launch.", "date": "Dec 5, 2006"}