{"name": "Charlie Blast's Territory", "name_review": "Charlie Blast's Territory Review", "ref": "https://www.ign.com/articles/1999/04/10/charlie-blasts-territory", "text": "After a number of delays, Vatical and Kemco have finally shipped their first entry into the Nintendo 64 puzzle genre: Charlie Blast's Territory. Formerly known as Charlie Blast's Challenge, the game was developed by industry veteran Realtime Associates in conjunction with puzzle game expert Scott Kim.The Facts 3D puzzle gameplay. 3D polygonal graphics. Skinned 3D animation system. Dynamic camera (rotate, zoom, etc.) Friendly and enemy characters. Rumble Pak support. Puzzles created by renowned puzzle creator Mr. Scott Kim. Dozens of interactive objects and obstacles. 60 stages. Password support. Multiplayer modes for up to four players.GameplayBlast's Territory mixes traditional puzzle elements with Bomberman-like play mechanics. In the role of Charlie Blast, a somewhat overweight, but determined demolition export, players must destroy the greedy King of Industry's dams that block the six rivers of the Rainbow Valley. Unlike most of the other Nintendo 64 puzzle games, Charlie Blast replaces the genre-typical geometrical shapes with bombs and boxes that must be moved around on the playfield.The game is played from a 3D perspective, with the camera looking slightly down on the polygonal playfields. While the viewpoint will adjust automatically to give you the best view of the action, players can also adjust the camera to their liking and switch angles on the fly. The gameplay is simple -- especially during the earlier levels. By strategically arranging bombs and detonators that are placed on the levels, Charlie can set off chain reactions which will bring the water back to the troubled valley.The idea is to detonate all bombs and TNT crates on screen without leaving a single bomb or crate. In order to achieve this, players have to maneuver Charlie around the playfield and push around the objects in a strategic manner. Once everything is arranged, Charlie sets off the detonator -- that blast will cause a chain reaction that blows up all the explosives that are lined up next to each other. If the chain is broken, you will have to do the level again.As players progress through the stages, the puzzles become hard and harder and obstacles like cacti and spear traps eventually appear as well as new explosives, including Electric Bombs and Auto Detonators. While the gameplay initially comes across as boring and straightforward, players who invest time and stick with the game will eventually be rewarded by mind-bending puzzles. While it's far from the old 16-bit Bomberman fun, Charlie Blast's Challenge also features two respectable multiplayer modes in which players set detonators to claim territory. Up to four players can go head-to-head.Unfortunately, Charlie Blast also has its fair share of problems. Players can use either the analog stick or the D-Pad, but neither one offers dead-on control. Charlie pushes objects by simply running into them (rather than using an additional button to initiate the push), which often causes players to accidentally shift an object or push it too far. This will most likely screw up the player's strategy and result in a failure. The other major complaint we have with the game is that it tries to mix platform action to the puzzle solving. Since Charlie's movement is square-based (he can't move between squares incrementally) and he can't fall off, the addition of moving platforms and other obstacles only makes the gameplay more tedious, not more exciting.GraphicsGraphically, Charlie Blast is simple, but effective. The 3D playfields and objects are clean and colorful and the game moves along at smooth framerates. On the downside, the environments are all a bit barren and lack variety and the special effects are poor. For a game that's all about blowing stuff up, the explosions really needed to be a bit more impressive than a few frames of 2D sprite animation. But hey, it's a puzzle game -- and it definitely looks better than its tetraed-stacking and bubble-popping brethren.SoundThe music is uneventful and the sound effects, a collection of crashes, explosions and boings, are very generic. Charlie Blast Territory's developers should have invested some more time in creating sound or even voice effects that would given the game more character. Not bad, but merely average all the way through.PeripheralsIt's evident the developers had to squeeze this game into a tiny cartridge. The Rumble Pak is supported, but there was apparently not even enough room to build in some Controller Pak support. Having to write down playing card-based codes is like a throw-back to the 8-bit days.Being a fan of puzzle games, I enjoyed this game quite a bit -- despite its limitations. Like Infogrames' Lode Runner 3D, Charlie Blast's gameplay is mostly slow-paced and just never gets as exciting as many of the more frantic puzzle games on N64, like Tetrisphere or Wetrix. The gameplay mechanics are solid and the puzzles later on in the game are well designed. When I first saw the title, I expected more of a mixture between puzzle game and platformer -- a combination that would make Charlie Blast's Territory more accessible to a mainstream audience. Gamers expecting Banjo-Kazooie-style gameplay and control will be disappointed, but if you enjoy solving puzzles and your fingers are still sore from your nightly Rubics Cube sessions, give this game a look.", "date": "Apr 10, 1999"}