{"name": "Donkey Kong Jr.", "name_review": "Donkey Kong Jr. Virtual Console Review", "ref": "https://www.ign.com/articles/2006/12/06/donkey-kong-jr-virtual-console-review", "text": "'86 was pretty thin for the Big N. The NES had just been launched the previous October, but only in New York City  so most of the year of 1986 was spent rolling out the system throughout the rest of the country. New releases for established early adopters were few and far-between, so to bridge the gap Nintendo turned to their established catalog of hits.   Now remember, this was 1986. Nintendo's established catalog of hits wasn't very deep at this point. They had two places to turn to  Famicom titles from Japan that had yet to be localized, or their early '80s arcade games. They focused first on the latter, and in June presented the NES Arcade Classics Series.   Three Donkey Kong titles made the cut for the set of ~retro~ releases  the original DK, the bug-shooting spin-off DK3, and this game, Donkey Kong Jr. This was Nintendo's second big hit in the arcade scene, a sequel to Donkey Kong that turned the tables on the original's story to make Mario a villain instead of a hero. The malicious mustached man has cruelly kidnapped Donkey Kong, trapping him in a cage. It's up to DK's overanxious offspring, Junior, to navigate a series of stages and save his papa.   Donkey Kong Jr. elaborated and expanded upon the platforming gameplay that Shigeru Miyamoto had created in his first game, and did so with vines. Long, hanging vines cover the playing field and must be climbed to reach the top. Junior can shimmy his way up a single strand, or reach and grab two at a time for quicker ascents. This climbing mechanic was mirrored in later generation Nintendo games, like the Donkey Kong Country series.   The game has only four levels, after which play restarts again from the first stage. That makes this release a pretty shallow offering, and hard to justify for the expense of 500 points. The same pricetag could buy you a number of other, deeper NES hits. But at least this one's a full port (the NES version of the first Donkey Kong cuts out a stage).    Donkey Kong Jr., the character, went on to reappear a few more times after this debut  he was a driver in the first Super Mario Kart, and swung his racquet on the courts of Mario Tennis. Junior even headlined Nintendo's first edutainment game, Donkey Kong Jr. Math, a full two decades before brain training would become a hit on the DS.  The son of Kong arrives here in a complete conversion of his arcade debut, but this game's too short of an experience to recommend a download. (Nevermind that it's already been made available through Animal Crossing and as the packed-in ~launch title~ for the Game Boy Advance e-Reader just a few years ago.) It's nice to see Junior again, but save your points for more robust offerings.", "date": "Dec 6, 2006"}