{"name": "Luxor", "name_review": "Luxor: Wrath of Set Review", "ref": "https://www.ign.com/articles/2006/12/07/luxor-wrath-of-set-review", "text": "Portable gaming systems and puzzle games are meant for each other like goodness and toast. Back in high school, a friend once hot-glued his copy of Tetris into his Game Boy because he believed that there wasn't any point in putting anything else in there. Luxor: The Wrath of Set may have some extensive roots in being an online game for a while, but its trip to the PSP hasn't been so lucky. The result is something that you can use to pass the time, but it's hardly addictive enough to make you nearly miss a flight.   Luxor is a chain-busting puzzle game that shares more than a passing resemblance to Zuma. A series of colored balls enters the screen from the side or the top and proceeds to wind its way along a curvy path heading for a temple. If the colored balls hit the temple, you lose a life and start over. The way to destroy the balls is to shoot one colored ball at a time at them and create a group of three or more of the same color. When this happens, they pop and the chain collapses back to close the gap.    Naturally, just going for individual groups of balls will be the easy, and low-scoring, way out. The skill is in creating chains of groups. This is done by making sure that after one group pops, the new chain will automatically form another group and pop and so on and so on. Getting chains and combos will drop coins and power-ups. These power-ups are good for one shot or a brief period of time, but they certainly help to stem the tide of the oncoming balls. My personal favorite is the lightning blast that destroys everything it hits.   Where Zuma had a ball launcher in the middle of he screen that could rotate, Luxor has a launcher on the bottom that shoots straight up and can move left and right. The balls take a little bit of time to get to their target, so getting a perfect shot off is a matter of leading the target by a little bit. Get it a little bit off and you can easily make the situation a lot worse.   The fun of Luxor is all in the chain-effects that you can pull off. With some practice you can pull off five or six chain explosions with ease. It's a pleasant distraction, but it quickly becomes apparent that there's just no enough here to make Luxor a full game. The story mode promises 123 ~exhilarating~ levels, but many of them are copies of each other. There are so many slight variations of a level where the path zigzags back and forth that it's easy to feel like you're constantly repeating yourself.   Now, repetitive levels aren't the death of a puzzle game by any means, but a lack of tension certainly is. After playing for a few hours the only times that I found myself in a bind was when I was going for some insanely sick chain and let it get out of control. Simple pleasures drive a good puzzle-gaming experience, but Luxor is just too simple for its own good. Without any real variety there's just no motivation to dig further into it.Luxor: The Wrath of Set has been brought over to the PSP without much care in presenting the game well for those who might want more than a brief distraction. After a couple of hours, the gameplay wears thin and desire to play more withers up and dies. It could've been more interesting and the basic elements are solid, but it's all about the complete execution of the idea and Luxor just doesn't have it.", "date": "Dec 7, 2006"}