{"name": "Imperialism 2", "name_review": "Imperialism II", "ref": "https://www.ign.com/articles/1999/04/10/imperialism-ii-2", "text": "It's been a banner season for turn-based strategy games. After a long dearth, we've been presented with Heroes of Might and Magic III, Civilization: Call to Power, Civilization 2: Test of Time and Alpha Centauri. With all of these big names battling it out for what the gaming industry keeps trying to assure us is a niche market of gamers, it might seem like a weird time for SSI to try and release their slightly less well known turn-based strategy sequel, Imperialism II. After a couple of weeks with the game though, I realized that while the subject material might not be as flashy or grandiose as some of the aforementioned titles, Imperialism II not only stands up against its competition, in many ways it often exceeds it. Let's take a look at why...  For those of you not familiar with the first title in the series, here's the basic idea. You control one of six great powers (Holland, France, England, Portugal, Spain and Sweden) as they compete for control of resources, trade and real estate. In addition to these major powers, there are also a number of minor powers (Switzerland, Ireland, Denmark and Scotland are a few examples) that you can team up with in economic or physical alliances or go to war with. Each turn you move your troops on a Risk-like map, give your workers production orders, build new forts, roads and ports with your Engineers, build up production sites with your Builders, examine unexplored land for resources with your Explorers, buy and sell goods and engage in diplomacy with other foreign powers. As the game wears on, you'll get access to Spies that can keep you filled in on what your enemies are up to, Rail Builders that can increase your transport capabilities and Merchants that can purchase land from minor powers. While all of this is going on, you must also keep your researchers funded and working towards new inventions that will enable you to harness more of the land's resources, transport them more efficiently and build better troops with the results. If you think this sounds like a lot to keep up with, score one point - you're damn right it is. More intimidating still, everything in the game: resources, science, military strength, land holdings, diplomatic and economic standings and transportation ability, is absolutely vital to your survival. Screw up and you're finished.  As the game starts, most of your attention will be focused on producing the things you need to build up your empire to the point that it no longer needs to fear its enemies. Every unit you can build in the game is constructed from various goods that are acquired by getting your workers to process minerals and other resources that come into your cities through road or rail. It takes two workers and two units of resources or minerals to produce one goods unit which means that it's very important to have a large supply of basic materials and a way to get them to your cities in addition to a huge working force. This can make building an army pretty complex stuff. For example, building a knight requires 2 units of bronze, 1 unit of cloth, 2 horses and an unskilled person - this translates out to 2 units of tin, 2 units of copper (1 of each is required to produce the bronze), 2 units of cotton or wool (to make the cloth), 2 horses (which are a raw resource and don't require any production to manufacture), one man and 6 man hours. Now imagine trying to build a whole army of these guys (don't even get me started on the navy). Head spinning yet? Get ready for more. Everyone in your nation, from soldiers to the workers that are producing your goods, has to be fed. This means that in addition to building mines and ranches to gather raw resources, you're also going to need to build a lot of farms to keep 'em fed. Run out of food and your workers will start dying. Run out of workers and you won't be able to produces goods. Run out of goods and you won't be able to build and army or navy. Run out of armed forces and your country will suddenly belong to someone else.  Unlike a lot of turn-based strategy games, all of the resources and science in Imperialism translate immediately to very real and vital game advantages. About half of the scientific discoveries in the game are based around the exploitation of resources. For example - if you start the game with level two grain production, you are able to build farms capable of gathering two units of grain from an appropriate map space. If you successfully fund and research level three grain production, you'll be able to build farm that can gather three. Other advances give you access to new and improved unit types (there are over 40 different ground and sea units in the game), teach you to build railroads and town improvements, help you with your diplomacy or economy or instruct you in how to manufacture advanced goods from New World materials - cigars, refined sugar and hats. These new resources will in turn be used to appease your more educated units (apprentices, journeymen, and artisans). Each of these skilled workers can produce the output of several unskilled workers (an apprentice will do 4 times the work of an unskilled man, for example) but will stop working if your run out of the resources they demand. As you can see, the whole thing is one big interconnected puzzle that requires constant attention. Just like a real governement!  The biggest difference between Imperialism II and its predecessor is the addition of the 'New World' to the mix. Unlike the first game, in which you only had to deal with your competition on a known playing field, this time around you'll have to explore, stake a claim in and exploit a dark and untapped wilderness. To make things even more interesting, you'll also have to decide how you're going to deal with the cultures indigenous to the new country. To ignore the New World is slow suicide - it contains resources (cotton, tobacco, sugar, furs, gems, and precious metals) that are simply not available on your starting maps that you need to produce the resources mentioned above. If you don't feel good about using military force to take land away from the natives, you can send in merchants to buy land, which you will then be able to exploit for yourself. Even if you're the nicest guy in the world though, you'll eventually figure out that if you want to keep up with your opposition, you're eventually going to have to play the bad guy and grab as much land with your troops as possible.  Keeping up with your own activities isn't enough if you want to stay in control of your country. Each of the great powers in the game will be exploring, waging war, making and breaking alliances and gathering resources at the same time you are. If one of them every gets too much of an edge over you, you've had it. To keep this sort of thing under wraps, you'll need to build spies to keep a close eye on their activities and stay allied with the strongest of them though the use of the diplomacy screen. To be honest with you, although there's nothing technically wrong with the system, Imperialism's diplomacy was my least favorite part of the game. The system presents diplomatic situations to you in an accept or decline format that often isn't very clear about what the outcome of your decision will be. Many times in the game I thought I was honoring an agreement with a friend only to find that I had accidentally declared war on them. Ten turns later my game was over.  Okay, so now that I've droned on about all of the nuances of the game, the question remains - how much fun is it to play? Quite a lot actually. I spent almost every free hour for a couple of weeks glued to my screen and at a time when I have access to several big name titles. The fact that every move you make can make or break your empire may sound a little annoying, but it actually adds a level of intensity that is often lacking in turn based games. On the down side, I feel like most players who weren't already very familiar with turn based gaming would find this game to be a nightmare to learn. Even the tutorial took me three tries to complete. Fans of Imperialism may also be a little disappointed to learn that aside from some sharp new graphics and the addition of the New World (which I admit is a pretty big change), the game itself hasn't really changed all that much.  In the end, if you're a die-hard strategy fan, you've got to add this game to your library. It looks good, it plays good, and the time frame that it's set in is very different from all of the other game on the shelf. If you're new to strategy games, you may want to give this game a wide berth until you've gained a little more experience with other games of the oeuvre.   -- Trent C. Ward", "date": "Apr 10, 1999"}