{"name": "Online Chess Kingdoms", "name_review": "Online Chess Kingdoms Review", "ref": "https://www.ign.com/articles/2006/12/08/online-chess-kingdoms-review", "text": "To hearken back to the days when playing Chess was a gentleman's pursuit. If you've yearned for these days, then Online Chess: Kingdoms may be the game for you. But hold on there Lord Snoozington! Before you jump in with your Victorian suit on and a cup of tea at your side, remember that this isn't the chess your granddad played. This is Chess for the ~twenty first century,~ and that means an overhaul of the wooden figurines that we're so used to seeing. Simply put, if you were to take the movie, Searching for Bobby Fischer and then combine it with any number of eighties fantasy flicks like Labyrinth, then the end result would most likely be Kingdoms. Unfortunately, its one major problem is that despite the fact that it tries to reinvent chess visually, it doesn't offer anything that other chess games already have.   Not to say Kingdoms isn't occasionally fun or that it has the appeal of a pub toilet at closing time. On the contrary, it's attention grabbing considering its visual style. Forget about playing with traditional pieces common in a normal chessboard. In this serving of the classic game, you choose from five very different animated chess sets which make up the five kingdoms that a mysterious (almost God-like) being named Phrenos has created. They are: Order, Chaos, Magic, Reason, or Spirit. So if you've ever wanted to crush the world of order with chaos or devour the realm of reason with magic, then your possibilities are seemingly endless (until you end up in a draw or checkmate that is).    Add to this the fact that each kingdom (or chess set) has been designed with its own distinctive look and unique world that echoes what their name entails, and what we have is a game that allows for more than simple and mundane removal of lifeless pieces. Another welcome change to this portable version of the classic is the combat that occurs when two pieces come clashing together. It's not enough for the creators of Kingdoms to let displays disappear, oh no. When two pieces collide, you'll see the winning piece take their opponent's life. It's not brutal, but it offers something refreshing for those bored of the same old repetitiveness briefly seen in a normal game.   Again, the problem with Kingdoms lies not in its stylistic execution but rather in its gameplay -- it offers nothing that previous chess videogames haven't covered a billion times before. No matter what the creators do with it, there's always that one burdening factor that comes back to haunt it over and over again. Regardless of what the pieces look like, or how well they're animated, they still behave the same way.   At least the AI in Kingdoms does a fine job of challenging a range of players, from novice to master strategists. Throughout the game, would-be chess gods will need to contend with a number of defensive and offensive tactics, each of which fit well into their respective difficulty category. It's definitely challenging without seeming impossibly hard. Players of all skill levels will need to maximize the effectiveness of each move, as the AI will do the same, and do its best to build so-called ~spheres of action~ and lines of defense.   If playing solo, a player can select either classic or story mode. In classic mode, a player gets typical gameplay found in a normal chess game, save for the brief ~death scenes~ when two pieces battle. It's fun to watch, but it's the same stuff gamer's saw in Battle Chess and subsequent clones. Then there's story mode which puts players in a Stratego-type environment. Here, it's not enough to play chess - players need to annihilate enemy kingdoms questioning your supreme authority. But again, even within these modes, if a player really isn't a chess enthusiast who somehow skipped all the simulations that have come before it, there's little appeal. Players will find themselves frustrated by the time they discover only their king and a few pawns remain, though the end of the round seems nowhere in sight.   If you're not a loner, or if you've paid a bum to play with you, feel free to go for two player mode using the PSP's wireless functionality. This allows a pair of players to outwit each other for title of ~Chess Champion~ of the entire universe. For the really brave, there's the online mode. Either you'll discover how smart you really are true or you'll find that no matter what you do, a seasoned veteran is going to wipe the floor with you. It works fine, but finding a partner can take a good long while. Plus, there isn't much variety to what you can do once connected.If one picks up a copy of Kingdoms expecting to find a revolutionized and less complicated version of the classic board game, then thou are in for a long night. The rules of the game are all the same just as they were when it was invented in the fifteenth century and the myriad of videogame incarnations it has taken since. Kingdoms does offer is a new visual style to this tried and true game of wits and strategy, but as mentioned above, it's not the first time this has been done.", "date": "Dec 8, 2006"}