{"name": "Yu-Gi-Oh Tag Force", "name_review": "Yu-Gi-Oh! GX Tag Force Review", "ref": "https://www.ign.com/articles/2006/12/08/yu-gi-oh-gx-tag-force-review", "text": "The complex world of Yu-Gi-Oh card battles comes to the PSP with Yu-Gi-Oh! GX Tag Force and the resulting game is both a relief and a new source of frustration. The PSP's wider screen helps the sea of information make sense and delivers the experience of the game without having to collect any real cards. As for everything else... well, that pretty much falls apart right away.   If anything can help the next generation learn to love the world of accounting, it's Yu-Gi-Oh. With hundreds of cards that have unique connections with (and against) each other, it can be easy to get confused. This is rock-paper-scissors played in 20 dimensions at once. If anyone can truly get a grasp on it, then there's definitely a future in business for them.   So thank goodness that the interface that has been fine-tuned to allow for the massive amount of likely bewilderment. It makes text easy to read and there are plenty of sorting options to go around. Normally, creating a deck of cards to use can take hours; but since you can sort the cards any way you want, the process isn't so bad. But don't worry -- it will still take time and likely give you a vicious migraine the first time.    The battles themselves have weak animations that show players playing their cards, but this can all be streamlined in the options. It's easy to cut to the meat of the game, the card battles and the strategy, and get lost in it all. It's just that after that one moment of bliss, the game just loses it completely.   Outside of the battles, the rest of the game is focused around walking around the academy and having a lousy time. When speaking to people you have four topics to talk about and there's no real conversation -- they just enjoy it or they don't. It's not worth dealing with except that you need to befriend others so they can be your tag partner. So be nice, talk nice, and give them gifts as you try to ignore the feeling that you're taking care of a little drama queen... because you are.   With a partner, you can now do tag battles of two on two, but honestly there's no fun in watching a computer fight itself and that's exactly what this is. Instead of watching one computer play, now you get to see three and the thrill factor drops down -- way down. In fact, it falls so much so that you wonder if you're really ~playing~ in the first place. The answer is that it doesn't really matter, the story is terrible and after getting to know all of the boring characters in the game you can't wait to get the hell out of there.The core system of getting cards, sorting them out, making decks, and battling is lovely and smooth. The rest of, well, everything, is clunky and mishandled. As an extra special kick there's no online play. So whoop-de-do you're stuck in one of the most blah places on earth begging another guy to fight so that you can watch as brainless robots combat each other. Maybe this will led to a better game in the future.", "date": "Dec 8, 2006"}