{"name": "Horsez", "name_review": "Horsez Review", "ref": "https://www.ign.com/articles/2006/12/11/horsez-review-2", "text": "Tearing into the packaging for Horsez I was thrilled to see just what EA could do with a sweet urban-ified vision of horse racing. Would there be an announcer named MC Sketch-ma-Fletch calling out your sick combos? Because I was ready to bring the pain to the competition with my riding skills... I mean skilllzzzz, yo! But then I realized that this game was being put out by Ubisoft. And those horses that I thought were headbutting on the cover? Turns out they're just nuzzling like fuzzy bunnies. I can hang with the kiddies and enjoy the simple pleasures, but can Horsez deliver? For those who can only handle the goriest of details, read on.   It would be easy to dismiss Horsez as some tripe for kids since the target market is clearly different from that of virtually all videogame reviewers, but that would mean ignoring all of the weirdness and glaring problems. Do you want your kids to be entertained with horrible graphics and menu systems that leave you hanging? More to the point, do you want to walk them through this when they don't undestand what's going on? But the first question is just how quickly the crap hits the fan. Answer: right away.    In the beginning there's a pre-rendered video of a train powering along tracks under the cover of night as if this was yet another Hogwarts adventure. But then why is the video grainy and why does it not fill up the screen? Ah, must be a low-res video from an early version of the game. Damn interns mucking up the game again. But it's bound to get better, right?   Wrong. After that cinematic vomitorium, Girl Whatserface arrives in the land of the glued lips. In this mystical estate of horses and jolly good times nobody ever opens their mouth when talking. You can look for ventriloquists, but the spooky thing is that they're not there! These people can also see the future. Like when creepy old caretaker guy points at a fire that isn't happening. It's just a dark building until the girl gets there and it's a raging blaze! These guys are crazy.   If that doesn't get to you, the folks that you interact with when you're not chillin' with your horsez have a nasty habit of telling you only the briefest bit of a story for each day. Like the girl who tells you that she was raised in America. By her father. Who liked horses.  In a few weeks this conversationalist might even get a few paragraphs out. But she's still a genius as compared to the louts that run the joint.   While being a kid and sneaking into the attic, the girl needs to use her stealth to get past the administratorz. But only by running straight into their faces can you get their attention. You can try bumping into them from the front or the side or even walk four feet in front of them, but these guys just refuse to show their true feelings.  It's sad how kids are raised these days. Sometimes I cry.   Not too much time passes before you begin to wonder if the developers hated being on this project so much that they decided to sabotage it in subtle ways. Instead of placing the key to the library inside the building, the girl needs to wander outside, through the alley, and break into some other random house to get it. And then there are the doors and stairwells that lead to the next room that are off the screen. If there is a hell on earth, it is trying to find any bit of logic to the puzzles.    This epic tragedy would be passable if the horse action was top notch, but that was never going to happen. Taking care of the horse is to know the pain of meaningless, and menial, labor. Washing and scrubbing are fine, but cleaning out all the poop and hay from the stable is just cruel. And trying to do so while fighting the wobbly controls is as much fun as cleaning out kitty litter with a toothpick.   After all of this torture, riding the horses themselves is a relief if only because this part of the game isn't a complete freak show. Not that the running and jumping is exciting, it isn't, but it comes so close to approaching decent that you feel as if the heavens above have opened up and an ethereal beam of light has come down to wash your soul clean of the meanginglessness of life, death, taxes, toll booth lines, and the rest of this game. And then the horse riding ends and you know that there is just a fleeting moment before a tsunami of darkness enters your being and you get a sudden urge to secure a prescription for massively powerful antidepressants.As the mind clears with time spent away from the game one realizes that the horse riding was still crap and the horses rode like a busted up Oldsmobile from the 70s, but it was less crap than the rest. And if you want to teach the young ones to appreciate the brief flourishes of slight improvements over a typically heart-crushing reality, then Horsez is the way to go. It's a tough lesson to endure, but they will be better for it. The whole world will be better for it. And in some way, somehow, they will find a way to thank you for it.", "date": "Dec 11, 2006"}