{"name": "Charlotte's Web", "name_review": "Charlotte's Web Review", "ref": "https://www.ign.com/articles/2006/12/11/charlottes-web-review", "text": "There are few children's novels as timeless as Charlotte's Web. First published in 1952, the book has been discovered and enjoyed by over five decades' worth of young readers. An animated movie adapted the story to the silver screen in the early '70s, but it isn't until later this month that the tale will be told in live action for the first time. To accompany the new Nickelodeon film, a video game was naturally commissioned. The game arrives here on both the DS and Game Boy Advance in the form of a fairly basic action platformer, and while it doesn't tarnish the legacy of E.B. White's literary masterpiece, it certainly won't go down as a classic itself.    Wilbur is a pig, the runt of the litter. He's adopted at a young age by a girl named Fern, and is raised to adulthood. His grown-up years aren't meant to last, though, as he's destined to serve the Zuckerman family as a Christmas ham when the next holiday season rolls around. An animal house full of barnyard friends recognize his porkchop plight, and start working together to save him. Chief among these supporters is Charlotte.    Charlotte is a spider, and spins her webs to spell out messages about Wilbur  that's where the game begins. For Charlotte to do her spinning, she needs words. You'll take command of Wilbur on a collect-a-thon quest to gather them, one letter at a time, while exploring the environments in and around the Zuckerman farm.    Playing as a pig is a problem. Wilbur is naturally weighty, and doesn't achieve much loft in jumping. That's probably a pretty accurate representation of a pig's ability to leap, but it makes platforming gaming difficult  you'll often find Wilbur just barely clearly a gap, hanging over the edge and needing to pull himself up to keep from falling. Ledge grabbing, though, is hit-and-miss itself  sometimes Wilbur's hooves won't find purchase at all.    With patience you can adjust to Wilbur's shortcomings as an action hero, and set off on the quest to collect. Letters for Charlotte's webs are just one of the scattered kinds of grabbables, which also include glowing spider eggs, lost baby geese and pick-up power-ups. The power-ups Wilbur will require to fight off less-than-friendly farmland foes  he has little in the way of attack ability on his own, but can gain the chance to kick like a bucking bronco, sing enemy-repelling songs and shield himself with invincibility-granting slop troughs.    Power-ups are activated through the touch screen on the DS version, though pressing select to call them up on the GBA isn't a big hassle. The differences between the two editions of the game are really fairly negligible in the main adventure. The DS version is superior in three ways, though  presentation, interaction and game selection.    Presentation is better on the DS through that version's expanded connection to the film. Voice clips from the same actor who plays Wilbur in the film are used, and there's a better sense of cohesiveness between the two properties there. Both DS and GBA are a little scatterbrained with their representations of characters, though. Like different artists all told to try drawing the same thing, Wilbur and friends have a variety of looks throughout the game. Sometimes cartoony, sometimes realistic. It's a bit confusing why the game won't just pick one style and stick with it.    Interaction is better on the DS through some Nintendogs-like encounters with Fern in the middle of platforming levels. On the GBA she simply serves as a checkpoint and a health meter refill, but on the DS she's host to some small mini-games  brushing Wilbur's teeth, giving Wilbur a bath, feeding Wilbur buckets of slop.       Game selection continues to better on the DS outside of the adventure, where a variety of mini-games can be unlocked and played from the main menu. The GBA is home to five quick designs, including bumper cars, baby spider parachuting and a puzzler starring Templeton the rat. Templeton gets to be the playable star in later adventure levels, but he's most comfortable lazing around and gorging himself on sweets  which he can also do on the DS. The two-screen version has the same five mini-games as the GBA, but doesn't stop there. There are several more stylus-controlled game designs unique to the touch screen system's edition, some of which can get pretty fast and intense. You'd never guess that chopping fruit for Mrs. Zuckerman's famous applesauce was such a high octane event. Charlotte's Web, the book, is an undeniable classic. Kids have been reading it for over half a century, and likely still will be half a century from now. Charlotte's Web, the game, is not destined for such a grand legacy. It's a fair platformer, but its protagonist pig isn't very capable or compelling to play as. The level design, too, lacks variety  there never were a lot of scenery changes in E.B. White's original story. If you or your kids still feel drawn to making a purchase, go for the DS version. It's more fully featured than its GBA counterpart, and will remain entertaining for longer. But also consider saving the 30 bucks on the game, and spending eight dollars instead on the book that started it all. If there's a young boy or girl in your life who hasn't yet experienced it, they deserve the chance to see what over 50 years of fuss is all about.", "date": "Dec 11, 2006"}