{"name": "Star Trek: Legacy", "name_review": "Star Trek: Legacy Review", "ref": "https://www.ign.com/articles/2006/12/11/star-trek-legacy-review-2", "text": "At last year's E3, we were quite excited to see Mad Doc and Bethesda's progress on Star Trek: Legacy. Designed for the PC and the 360, the game seemed like a more accessible, prettier version of games like Bridge Commander and Klingon Academy. We confess we've always entertained delusions of being starship captains ourselves but seeing as how game reviewer isn't anywhere on that career track, we decided our best hope was to wait and live out our fantasy in virtual form. Now that the game is here, we can see that being a starship captain isn't nearly as fun as it first seemed.  But let's start with something good. It's tough to find a single story that ties together the original series, Next Generation and Enterprise (and throws in some references to Deep Space Nine and Voyager) but the game's writers have managed to pull it off quite well. You'll definitely have to draw some of your own connections between the eras if you want to follow the thread from Archer's first encounter to Picard's final showdown but it holds up well enough to provide reasonable continuity and framework for the game. Given that DC Fontana and Derek Chester are responsible for the story, it should please Trek fans.   Without giving too much away, the story starts with Captain Archer's attempts to help a female Vulcan scientist named T'Uerell. In trying to help her, he uncovers an elusive mystery that flows through to the eras of Kirk and Picard. Each captain only gets a handful of missions but they're held together by the mystery of this Vulcan scientist. We won't say more than that, but there's a definite showdown where things are (mostly) resolved.  Along the way, you'll find yourself battling against Klingons, Romulans and eventually Borg ships. While the endless space battles are kind of the point of the game, they do tend to get a bit repetitive early on. It seems like each new mission involves going to a new sector and blowing the holy hell out of everything you find. You'll have the occasional desire to use your scanners now and then or maybe transport an away team onto an enemy installation, but these are rare exceptions to the fighting that you'll usually be doing.  Once you move to The Next Generation things get a bit better. The missions here step away from the aggressive combat missions of the first two chapters to get at the heart of what Star Trek ought to be about. Though many Star Trek episodes involved some kind of ship battle, more often the main focus was on exploration, diplomatic negotiation, scientific research or supply runs. As Picard you'll have to protect a system from dangerous asteroids, seek out a Federation ship hidden in Romulan territory, and oversee planetary evacuations. After the constant shoot-em-ups of the Enterprise and Original Series missions, it's a nice change of pace.   You'll get the chance to captain each of the three Enterprises from the series as well as a variety of other Federation ships. Successful completion of mission objectives and lots of extra killing on the side will earn you command points that can be spent to add up to three other ships to your fleet. Unfortunately, the upgrade system that would allow these points to be spent to tweak each your ships' performance was scrapped.  While the system still lets you tailor your forces to your liking, there are a couple of problems with it. First, you'll have to buy ships before you find out what types of mission you're going on. Knowing whether you're going on a scouting run or a large-scale assault against an enemy starbase is definitely going to impact whether or not you load up with scouts and destroyers or with cruisers and battleships. The second problem is that the economy is a bit unbalanced. Early on, you'll be able to afford the best of the best. As you progress towards the more powerful ships of the Next Generation era, the command point rewards don't keep pace, leaving you unable to recover from losses as quickly.      The AI puts up a good challenge in terms of maneuvering but most of the time you'll be challenged more by their greater numbers or superior energy management. Most ship battles are turn and burn affairs with you and your opponent circling through each other's phaser arcs trying to get a good lock with your erratic torpedoes. The Federation ships are pretty tough so if you keep your fleet of four together and make sure to pull back when your ships get damaged, you can usually manage to take on just about any group that comes your way.  Unfortunately, some of the missions can be rather long. Since there are no checkpoints to speak of within each mission and no option to save the game during a mission (despite the readme file's assurance that you can), you may occasionally find yourself replaying an entire thirty-minute mission just because something went wrong towards the end.  And, oh! The things that can go wrong!   The first and most frequently occurring aggravation is the control scheme, both in terms of managing your own ship and in terms of giving orders to the rest of your fleet. Though we eventually got used to the mouse look and WASD steering controls, we're still not entirely comfortable with the limitations on the ship's movements. Like many space games, Legacy tends to put everything on a single plane. This may serve as the rationale for not allowing ships to roll left and right, the lack of a roll makes lining up those torpedo and phasers shot a bit more difficult than it should be. Legacy also limits your pitch as well, stopping you just short of crossing over the vertical axis, which can be very aggravating if you're tracking an object passing directly above or below you. The limited mobility is at least made more tolerable by the lack of defined shield facings.  There are no hard collisions in this game, whether you're talking about the pint-sized planets or the enemy starships. Objects that collide simply repel each other, sometimes sending each other off in oblique directions, sometimes autopiloting to a new heading, and sometimes simply warping to a new facing altogether. It's bad enough when the camera does this but when your own ship takes a new unexpected tack, it can be disorienting.  The mouse is a bit swimmy on the tactical screen as well, making it virtually impossible to select anything with any degree of accuracy. The mouse cursor jumps around so much that you'll just have to settle for sending in ships in the general vicinity of their target and then leading them by hand in the main game view. Standard RTS controls would have worked well here but our guess is that they would have been inconsistent with the Xbox 360 scheme. Whatever the reason, there's no way to select all of your ships at once, no way to order movement in the Z-axis (which really only matters in one mission), and no way to set waypoints or rules of engagement for ships you don't have time to control directly.   Happily, ships seem to do a pretty good job with the ~fire at will~ command, but you'll need to make sure that they don't stray too far from each other and get picked off one by one. In some instances, we needed the AI to show a bit more discretion in choosing its targets. In one asteroid mission, you're presented with dozens of targets at a time, only a few of which actually need to be destroyed. You can see at a glance which ones are which but the AI is clueless, requiring you to hand select targets for each one individually. We noticed on more than one occasion that the friendly AI seemed to switch targets for no reason or to freeze altogether until given new orders.  Also, though the manual says that ships automatically repair damage, we're willing to bet that it's wrong. Instead, you'll have to select each ship individually and order separate repairs for each of the five systems. We can certainly understand having to prioritize the repairs when necessary, but there's no reason that your crew should sit idle when your engines or shields are damaged.      Strangely, the visual damage modeling for the ships seems inconsistent with their actual damage level. A single torpedo can rip a huge fiery hole in the side of your ship without doing any real damage. It seems as if the textures and effects are added according to the number of times you're hit, rather than the severity of the damage inflicted, and this can lead to some real confusion about how much damage each ship has taken.  Legacy seems to suffer from other inconsistencies in the documentation. The game instructs players to use the ~left stick~ and the A button to open the subsystem targeting menu. Those of you without dual-analog keyboards will likely go searching through the manual to find the actual command. The problem is that it's incorrect there as well. Instead of saying ~left stick~ it says to press the T key. The real command is actually shift-T. (T by itself does nothing.)   While we might be willing to forgive a slipup or two like this, the game keeps them coming. Want to set your energy management? It's not shift-E like it says in the manual; it's just E. Want to use the forward and back buttons on your mouse to open repair and order menus? That's too bad because they don't work at all. It's also too bad if you want to activate your cloaking system because neither the manual nor the readme file bother to tell you how to do it. (It's an option hidden in the repair screen.) These inconsistencies are quite likely the consequence of a sloppy translation between the Xbox 360 and PC versions but that hardly excuses them or eases the frustration you'll suffer because of them.  In addition to the campaign missions, you can also try out the game's skirmish mode and multiplayer offerings. And since we haven't seen anyone playing online, let's just talk about the skirmish mode. Supporting four fleets in team-based or free for all matches, the skirmish mode finally lets players try their hand at leading the Klingon, Romulan and Borg ships that serve as enemies in the campaign. Fleets are purchased according to the same command point system used in the campaign game. Sadly, there's no option to handpick the ships used by the AI players so, if you're hoping to set up specific encounters (Wrath of Khan, anyone?), you'll just have to trust to luck that your opponent picks the right opposing force.  Fans of the series will be happy to see many of their favorite ships rendered here. The ship models are detailed and, without having subjected them to a side-by-side comparison with the ships from the shows, very accurate. The numbers on the saucers, the small lights and windows along the hull, and the glowing engine nacelles are all present and accounted for. Happily, many of the lesser-known ships are presented with just as much attention to detail. Casual fans might not notice it as much, but hardcore types will really appreciate the work that's gone into it all.   The small effects from the show are all here as well. Phaser fire, glowing torpedoes, warp stretch, and transport shimmer are all wholly authentic and really help to put you in the heart of the action. The damage textures are generally good as well, but they seem a bit overdone in places. Some of the explosions resulting from combat are quite impressive but most are a bit on the generic side.  Moving outside of the ships, the rest of the systems you'll fight in are full of planets, suns, asteroids, dust clouds, nebulae and such. While it may be a little too much at times (we thought space was supposed to be, like, black), the objects and planets in each level really help to keep you oriented during the mission. The stars glow with a very believable light that shadows everything in the level but the planets seem a bit on the small side.      One of the worse aspects of the graphics are the destruction animations for large ships and stations. They just come apart in these huge chunks that look like they were sliced off with a piece of wire. They drift and turn nicely, but they also happen to totally clip right through each other, which sort of spoils the effect.  There have also been a few texture glitches here and there. Once, when coming out of cloak, we had a Klingon ship that was covered entirely in the damaged superstructure texture. It looked kind of like that Visible Woman doll, but we're sure any coolness inherent in the image was completely unintentional.   One final note about the graphics. You can dig around in the resource files to change some of the advanced settings, but you'll definitely want to adjust the anti-aliasing to your computer's specs. It defaults to full when the game starts but that may not be appropriate for everyone.  Not surprisingly, the voice acting is spot on. All five captains from the various series reprise their roles here and it adds a level of authenticity to the game that it simply couldn't do without. Whatever your opinions are of their quality of their acting in the show aren't likely to change based on their performance here. Sure, some of the lines are a bit laughable -- at one point Archer exclaims, ~A nuclear blast? It's so simple it might actually work!~ -- but the dialogue supports the drama overall.  The game's atmosphere and Trek-cred is further enhanced by the addition of recreations of the sound effects from the shows and a suitably moody musical score. As with the other element's of the license's presentation, the game's creators have done a great job of making it feel authentic.   The PC version of Star Trek Legacy is among the most disappointing games of the year. Putting aside any expectations you might have with regard to the Star Trek license or any past associations with games like Starfleet Command, Klingon Academy or Bridge Commander, Star Trek Legacy simply cannot stand on its own as an entertaining or satisfying experience. The poor control scheme and unreliable AI combine with overly long missions and the absence of a save system to make the game one long exercise in frustration.On the plus side, fans of the Star Trek franchise will definitely appreciate the visuals, sounds and story elements. Legacy hits the right spots here, faithfully bringing the various series of Star Trek to the PC in a very convincing, consistent manner. In the end, however, the license is all this game has going for it.", "date": "Dec 11, 2006"}