{"name": "Assault Heroes", "name_review": "Assault Heroes Review", "ref": "https://www.ign.com/articles/2006/12/12/assault-heroes-review", "text": "~As the only surviving members of an elite special forces unit, it is up to you to find the secret underground lab. Go the mission alone or fight side-by-side with a comrade. More than ever, your military training, weapons handling and quick mobility will be the deciding factor in this do-or-die mission. Reveal the truth about the classified weapons program!~   Hold the presses people because we have a new nominee for Best Story in an Xbox Live Arcade game. Part ~The A-Team,~ part ~We're making fun of Contra,~ Assault Heroes features the single deepest story of any XBLA game, including not only cutscenes of cars driving around, but -- well, I guess that's it. But what cutscenes! You're heavily-armed trucks and boats being dropped into enemy territory? Riveting stuff.     All kidding aside, the 800-Microsoft-Point creation from Sierra and Wanaco games is one of the best XBLA titles on the market. Sure, it's 10 bucks, and we're so cheap we don't spend that much dough on two haircuts. But featuring two-player co-op play and a few hours of top-down, intense action that puts Ikari Warriors to shame (that's right, I said it), this is one of the few XBLA titles that we can recommend for the price.    In your trusty 4x4, you land on an enemy controlled island, as in hundreds of other games gone by, and proceed to blast. The game controls much like Geometry Wars Evolved, the must-have title on XBLA. Move with the left stick, shoot with the right. You have three upgradeable weapons at your disposal: an unrelenting chain gun good for all-around use; a scalding flamethrower great for infantry or up-close enemies; a booming flak-cannon that's slow to reload but is great at taking out bunkers and tanks.     You switch through the weapons at ease with the bumpers, and you'll get good at is as you use the flak cannon to take out huge enemies and then switch to the flamethrower to blow heat-seeking missiles, um, up.  While the ammo for the main guns is unlimited, your supply of grenades and screen-clearing nukes is not. Use them wisely, and use them on the triggers.    The enemies are numerous, featuring kamikaze suicide bombers that we like to call Al Qaeda jerks, giant tanks, mechs, infantry. Maneuvering through all the fire is a fun challenge, especially with a friend on co-op on Xbox Live or on the same console. When the life bar on your 4X4 depletes, your ride will blow up and you'll have to make do on foot with a little pea-shooter. If you choose, you could leave your ride at any time and go on foot by pressing B -- useful for getting powerups in hard-to-reach areas. In one set of missions you drive a speed boat and instead of parading around on foot you use a sweet jet ski that's hard to control but fast.    If your ride does explode, you have to duke it out on foot for about 20 seconds until your transportation respawns. If you can live that long, you don't lose a life. Usually, however, you don't live that long.    Visually the game looks good for a throw-back, top-down shooter. Trees catch fire and you can knock down telephone poles. Each enemy is distinct from the others in appearance, which helps when you train you crosshairs on Al-Queda suicide warriors that cause a huge explosion when capped. The bosses are huge and provide their own pattern-based challenges.     The sound features some nice effects and a decent score. The best that can be said is that the sound never gets annoying, which is more than can be said for a lot of XBLA titles.    Featuring a host of achievements and co-op play, Assault Heroes is a blast. The story is obviously a tongue-in-cheek play on a number of classic games and good for a laugh. With three difficulty levels -- and believe me, this game can be very tough at some points -- Assault Heroes is a challenge and one of the best XBLA titles to date.", "date": "Dec 12, 2006"}