{"name": "Rainbow Six: Vegas", "name_review": "Tom Clancy's Rainbow Six: Vegas Review", "ref": "https://www.ign.com/articles/2006/12/12/tom-clancys-rainbow-six-vegas-review-2", "text": "Gameloft follows the successful release of Ubisoft's Tom Clancy's Rainbow Six: Vegas -- a stunner on the Xbox 360 -- with a mobile edition. Following a similar plot thread, terrorists have invaded America's adult playground, players command a team of elite soldiers through ten missions of shooting, sneaking, rappelling, and sniping action. As you work your way through Sin City en route to a climatic showdown at Hoover Dam, you will use both high-tech gear and low-tech aggression to thwart the bad guys.   Vegas is loaded with promise, as new game mechanics are constantly introduced in clever scenarios, but the fact that very few are used with any degree of frequency is disappointing. Take the rappelling sequence, for example. You must drop down the side of a casino, avoiding spotlights, before time runs out. Neat idea, and it's loaded with potential. Too bad this only occurs once in the entire game. It's the same with using water for cover. Introduced in the dam levels, you can avoid detection by nearby enemies swimming under water but the moment you stop moving, you surface. Why wasn't this employed in the casino or street levels? Maybe using fountains or drainage ditches? There is a escort mission -- you lead three women to a waiting chopper -- that is very tense (and very cool), but the escort objective is only used once.   However, Gameloft makes repeat use of a sniper minigame that will remind most gamers of Konami's Silent Scope franchise -- and it's one of the best parts of the game. You control the sight of the sniper rifle, scanning a casino or skyscraper for hostiles. Arrows point you in the general direction of a threat. You'll see the terrorists as dark silhouettes and hostages as light outlines. Depending on where you shoot the terrorists, head versus chest or arm, you earn a certain number of points. To score a headshot in a hectic situation, you can hold your breath by pressing 0.   However, things get pretty hairy in later sniper levels, as terrorists do more the skulk the dark hallways -- they openly threaten to execute hostages. A skull over their head means they will shoot their hostage and a small meter indicates how long before they pull the trigger. Should you shoot at and miss the terrorist, the execution timer speeds up. There is real tension here, as you actually see the terrorist kill the hostage.   The majority of levels are designed almost like puzzles. You use a cursor to direct your two- or three-man team through the environment, watching out for terrorists. Sometimes you want to go for the kill as soon as possible, sometimes you want to use stealth, because shooting the easy target can often raise an alarm. The cursor turns into a target reticle when moved over an enemy. You can go for precise headshots to kill terrorists faster. Pressing 0 puts your men in stealth mode, replacing the target with a knife. When an enemy has his back turned, you can then sneak up and kill them silently.   Constant intel is essential for success, and when you enter interiors, you're often faced with blind doors. An exclamation point near a door means your men hear chatter inside. If there are two doors, you must decide which to use for forced entry. Often, one door presents a different solution than another. Maybe one door leads to an overturned card table you can use for cover? Fortunately, you have a snake camera that lets you peek under doors, scope out the situation, and prioritize targets. Once you position the team at a door, you can choose to enter and shoot prioritized targets, use flashbangs to blind targets, or clear out a coalesced group of terrorists with a frag grenade.   There is no one ~solution~ to getting through a level, but keen eyes will help you spy advantage points. Sometimes you can spot lockers and cabinets to hide in, allowing a bad guy to pass unsuspectingly. These are especially useful when going up against minigun-carrying thugs (these shirtless bears look like washouts from a Karnov look-alike contest) that cannot be killed head-on. One particularly interesting concept in the game -- and somewhat disturbing -- is the suicide bomber. When you shoot these terrorists, they explode. If you shoot them too close to the team, you take heavy damage. But they can be used as an offensive weapon by waiting until they run within range of a group of bad guys, such as the minigun brutes, and then shot so the blast radius eliminates multiple targets.   Even with ten levels, Vegas is still a short game. I completed it on normal difficulty in just about 1:20. And that includes trying a few sequences several times until I figured out how to pass through a room safely. I can only imagine how breezy easy mode might have been. There is a hard difficulty which I tested out, and it is indeed tougher than normal, so experience mobile gamers might want to start there.   An extra sniper mode adds life to Vegas outside the main campaign. You watch a building for terrorists and try to kill as many thugs as possible before time runs out. The more terrorists you eliminate before they kill their hostages, the more time you can keep scanning the building for targets. It's a great time killer that I sunk quite a bit into.   As expected, Vegas is a good-looking game -- it's Gameloft, after all. I played Vegas on an LG VX8000. The environments are full of details, such as papers blowing across a windy rooftop or cards splayed around overturned gaming tables. The character models are fine, but not terribly varied. You'll be shooting the same four terrorists over and over. The game employs a handful of digitized speech samples, such as ~Negative!~ and ~Clear, sir!~  Rainbow Six: Vegas is the most accessible of the mobile Rainbow Six games yet -- but this also comes at the expense of difficulty. I blew through the regular difficulty mode sooner than I had hoped, but unlike this summer's Mission: Impossible III, I didn't really want to replay the game for the sake of fun. (I did for the sake of work.) I think there are some great ideas and mechanics in Vegas, such as the fun sniper mode, but most are under-used. Some are introduced and then never revisited, which is too bad. Perhaps this was to make sure the game made it out in time for the Xbox 360 release? Regardless, Vegas is hardly a bad purchase, but it is a mild let-down. Definitely check it out as a subscription.", "date": "Dec 12, 2006"}