{"name": "Alien Crush", "name_review": "Alien Crush Review", "ref": "https://www.ign.com/articles/2006/12/12/alien-crush-review", "text": "It could be argued that Nintendo's popular NES Pinball was rendered nearly obsolete with the release Hudson's own TurboGrafx pinball game, Alien Crush. This extraterrestrial-themed pinball game offers much more than just your standard metal ball fun -- it is biological warfare as you, a humble star warrior armed only with a silver sphere, seek to do battle against a two-screen-tall monstrous menace from a galaxy far, far away. The aliens have arrived, taking the form of bumpers and plungers, launchers and traps as you attempt to flip and tilt your way to a high score.   Gameplay is conventional for a pinner: you control two sets of left and right flippers in much the same way as NES Pinball, one set on the top half of the table and the other guarding the gutter below. Unlike NES Pinball, though, you can tilt the Alien Crush table with a button press. The jostling action may save your ball from impending doom, or simply worsen an already grim situation. For the highest scores, you'll have to master the art of the bump.           Thousands more points can be found and gathered in Alien Crush's hidden bonus rooms. These separate, single-tall screens are locked and inaccessible at the beginning of each round of play, but executing specific table actions will open their doors. Once inside, you'll find targeting challenges and swarms of destructible enemies, and sometimes even ~boss fights~ that, if completed, will significantly increase your point total.   That only-possible-in-video-game-pinball convention has lived on in more recent games, as we could look at titles like Nintendo's Pokmon Pinball or Metroid Prime Pinball to see the inspiration that came from Alien Crush. This Turbo title is an important installment in the industry's pinball genre, and set the bar high for the games to come after it in later years. The only thing holding Alien Crush back today is its comparatively limited scope -- it only has one table to play, and while it is a great stage, modern gamers may want more.Alien Crush has always been a favorite among the more vocal TurboGrafx fans. Those same fans, though, would point out that Alien Crush's sequel, Devil's Crush, is quite the superior title. Still, if you prefer aliens to demons and don't mind the limited scale, then jump right in and enjoy this unique take on outer space.", "date": "Dec 12, 2006"}