{"name": "Tomb Raider: Legend", "name_review": "Tomb Raider: Legend", "ref": "https://www.ign.com/articles/2006/12/16/tomb-raider-legend", "text": "The original Tomb Raider on the PlayStation prided itself on its fully 3D world of ancient puzzles, so it's a little odd to have a continuation of that series on a 3D capable system that roots its design into a hybrid 2D engine. The design created for the Nintendo DS has the spirit of the console game and some of its charm, sure. But it definitely hasn't received the same kind of attention that the series received on the PlayStation 2, Xbox, and the rest, as it's very rough around the edges and just isn't quite a good enough supplement or replacement for the real Tomb Raider: Legend adventure.   Human Soft, the development team responsible for the Nintendo DS conversion of Tomb Raider: Legend, has been improving significantly in the realm of handheld game development over the past couple of years. The team's been responsible for titles such as  Pac-Man World 3 and the latest Scooby Doo adventure, and Tomb Raider: Legend could be its most solid product yet on the handheld. But that doesn't get them off the hook for failing to smooth out some really rough edges in the DS development of this Tomb Raider product.   For starters, the team worked in the entire storyline from the console versions of the game and tell it with the identical cutscenes used on the PlayStation 2 and Xbox games. They're edited and compressed down to fit the slimmer cartridge media of the Nintendo DS, but for the most part these cutscenes do their job telling the story and do it with the needed emotion, far better than the usual ~talking head~ text cutscenes do in most DS and GBA games. So, at the very least the game's got solid presentation even with the limitations.   The engine the team created and utilized in the Nintendo DS rendition of Scooby-Doo: Who's Watching Who has been employed in this tomb raiding adventure. On the plus side you've got smooth 3D environments mapping out the various locations and puzzles, and the engine allows the level designers to construct some elaborate puzzles that require a whole lot of climbing, crawling, and swinging, as well as crate shoving and switch flipping to gain access to other portions of the level. However, balancing it all out is the use of a 2D Lara Croft, and while the artists create a lot of frames of animation in her moves for the multiple directions she can run, jump, and climb, it still seems just a little awkward since she and the other 2D items look disconnected and appear as flat cardboard and never seem part of the environments they're in.   The developers do their best to create a decently playing Tomb Raider game in this hybrid visual environment, and for many portions of the product they succeed. The camera follows the action well because it sticks to a harsh side-scrolling motion, and the puzzle elements keep to a rigid layout so it's not hard to track where the jumps and ledges are, and what portions you're allowed to cling to. That said, restrictions still come into play: take, for example, the ability to roll, which is an element that you'll be required to perform deeper in the game. Apparently the artists only rendered a side-rolling animation, as players can't roll into the foreground or background. And while most of the ledges and jumps are pretty direct, the fact that Lara's a flat object makes it hard to gauge depth, and sometimes you'll miss that rope or ledge during a jump because it was an extra step deeper.      The gameplay sticks with the whole Prince of Persia inspiration, so the puzzle elements, while a little bit scattered in places, stays solid and challenging with a nice rise in difficulty in later levels. The secondary portion of the Tomb Raider design -- weapon combat -- is, unfortunately, not nearly as strong. In fact, it's easily the weakest part of the game design, so plastered in that it's almost unnecessary to utilize. Essentially the team thought it'd be a good idea to shove the shooting portion down on the touch screen where players would simply tap enemies with a finger or stylus to shoot them. In concept, we can see this idea having merit, but the way it's implemented it takes away from the adventure and makes things feel clumsy. Lara can only run forward and backwards when locked onto an enemy, which zooms them closer or further on the touchscreen...increasing or decreasing her weapon's accuracy. But honestly the enemies have such terrible AI routines that it's simple to take them out of play without getting a single scratch on Lara.It's the puzzle elements and the collection portion that gives Tomb Raider: Legend its challenge, not the weapon combat, but it certainly would have been nice to have a bit of focus in the latter segment of the game design. The entire product is solid enough and shows that the development studio's getting a grasp on DS game production, but the little loose ends scattered around the product are a little too obvious to ignore. If you haven't experienced the Tomb Raider: Legend story on the console yet this game's a way to check out the tale...but the DS product is no substitution for the bigger product from Crystal Dynamics.", "date": "Dec 16, 2006"}