{"name": "Activision Hits Remixed", "name_review": "Activision Hits Remixed Review", "ref": "https://www.ign.com/articles/2006/12/16/activision-hits-remixed-review", "text": "Just a few years ago Activision paid homage to its history by creating Activision Anthology, a PlayStation 2 collection of the Atari 2600 games that built the company back in the 1980s. It was one of the most impressive retrogaming productions created at the time because of the respect it paid to the company's games and their history...as well as the impact they had on the videogame market back when they were released. And to get that same effort in a handheld...well, that's even better. The quick-shot, instant gratification nature of old-school games fit extremely well in the pick-up-and-play  portable environment, and Activision Hits Remixed takes everything that was awesome in the PlayStation 2 presentation and mini-sizes it for PSP play.   So for a very attractive budget price, in Activision Hits Remixed you get perfect emulation of more than 40 games from the Atari 2600 system. The line-up? Deep breath: Atlantis, Barnstorming, Beamrider, Boxing, Bridge, Checkers, Chopper Command, Cosmic Commuter, Crackpots, Decathlon, Demon Attack, Dolphin, Dragster, Enduro, Fishing Derby, Freeway, Frostbite, Grand Prix, H.E.R.O, Ice Hockey, Kabobber, Kaboom, Keystone Kapers, Laser Blast, Moonsweeper, Megamania, Oink, Pitfall, Pitfall II, Plaque Attack, Pressure Cooker, Private Eye, River Raid, River Raid 2, Robot tank, Sea Quest, Skiing, Sky Jinks, Space Shuttle, Spider Fighter, Stampede, Star Master, Tennis, and Thwocker.    At this point in technological advancements, a calculator you can buy at Walgreens probably has enough horsepower to run Atari 2600 code. So to have that ability on the PSP isn't really all that amazing -- after all, the system already has compilations that feature emulations of arcade and Sega Genesis games, not to mention all those gray area ~home brew~ programs floating around the Internet that Sony doesn't really want you to find.   It's all in how the games are presented that really makes the Activision Hits Remixed such an impressive package. Ultimately it's just a portable rendition of the compilation Barking Lizard created under Activision's watch, but this time it's been handled by Backbone's Digital Eclipse emulation team. And while Digital Eclipse certainly based its compilation design on the PlayStation 2 version -- right down to the extra 1980s soundtrack of A Ha and the Flock of Seagulls blaring while you play --  the package is actually just a little bit better thanks to additional features that streamlines the experience.   Take, for example, loadtimes. Nothing's a bigger drag in the handheld market than a collection of titles that makes you wait as you jump from game to game. Atari cartridges very rarely broke the 4 kilobyte barrier, so the developers take advantage of this little tidbit and pretty much load every game into the PSP's memory on the first boot. This means that when you move from cartridge to cartridge, you'll instantly zip to the next game in the rack.       On the flipside, the artwork that's needed to load for the ~extras~ portion streams from the disc, so you'll encounter odd lag when jumping from one game to the next as it pulls the needed imagery. The delay doesn't hinder enjoyment of the games, but it's definitely noticeable and shows a bit of speed limitation with either the PSP's disc media or lax user interface programming.   But enhancing the quick game loads is the ~hidden~ ability to have a ~save state~ for each of the games in the pack. In other words, you could be in the middle of a heated Pitfall II session and decide that you'd rather be playing Barnstorming instead. Leaving one game and going to another will actually suspend the first game in progress automatically, which means you can simply go back to Pitfall II and continue where you left off even after playing any or all of the other Activision games in the pack within that duration. And if you save your game at the options menu, those save states will be recorded to the Memory Stick. Of course, it's easy to reset the game, too.   The PlayStation Portable compilation plays it conservatively, at least in terms of the extras that you get from the start as well as the ones you're playing for. You get the box and cartridge artwork, though it's at a much lower resolution than what the developers of the PlayStation 2 version offered up. Those classic patches will be awarded  if you hit the designated high score, scores which have been ~reset~ back to their original, challenging level...not the easy-peasy quota set in the PS2 compilation. The classic Activision commercials are here to earn as well if you perform a specific task; admittedly they look nicer played on the PSP than the PS2, but that's mostly due to the fact that the original source files are lousy and much of the compression flaws and tape crinkles are hidden well on the smaller LCD. The crazy video modes from the PS2 game didn't make the cut, however...but having the ability to play upside down or with reverse colors was a little gimmicky anyway.       You can play the games in a full-screen stretched mode, or more recommended, in the original Atari 2600 resolution, which fits in a ~window~ on the PSP screen. The developers use the extra screen real estate to have on-screen keys for what button does what, an extremely handy feature since each game's use of the Difficulty switches and start and reset toggles on the 2600 did different things. It's really nice to see their functions spelled out.   A lot of the old Activision games supported two players, so it's very important to note that Digital Eclipse pulled off two player support using the PSP's ~game sharing~ feature. A quick load to the other system is all that's needed to send every game in the pack to the system without the copy of Activision Hits Remix...even the ones that don't support two players. The host system is always in control of the connection, so if he chooses a game that's only single player, the other person simply watches the game from his system without the extra info HUD. In two player games, the connected system is considered ~Joystick 2~ and acts as such. As long as the wireless connection stays strong, the emulation in two player is perfect. Awesome.  Honestly, the only knock against Activision Hits Remixed is in the games that form the compilation; Activision games were always considered the best of the Atari 2600 best since the company was formed by some of the most talented designers and programmers of the 1980s. As well as many of these games stand the test of time -- Pitfall II is still a great old-school platformer and Barnstorming is one challenging beast -- the games today don't have the strength to overcome the rising expectations and short attention spans of gamers. Some games, like checkers and bridge, are so lame compared to what you can get for free online nowadays that you'll probably never even bother booting them up. And, once again, Kaboom just isn't playable using the traditional controls.But for a retro compilation, Activision Hits Remixed is top notch with one hell of a presentation. The quick-loading feature and its Game Sharing option are two key elements in pushing this collection into the ~recommended~ category.", "date": "Dec 16, 2006"}