{"name": "Suzuki Superbikes II: Riding Challenge", "name_review": "Suzuki Superbikes II: Riding Challenge Review", "ref": "https://www.ign.com/articles/2006/12/18/suzuki-superbikes-ii-riding-challenge-review", "text": "Suzuki Superbikes II: Riding Challenge certainly has Superbikes in it... that's completely true. But what about having a good game to drop those bikes into? Sadly, that isn't the case. Instead, these bikes are abandoned in a thorough mess where just about everything goes wrong. It's a comedy of errors and makes one wonder if the developers were really trying that hard at all.   The problems are apparent right from the beginning. The training tests are dead simple to pass. One of them only requires you to find the accelerator button and push on it for a while. The others are hardly more difficult to get through. This is light years behind any of the license tests from Gran Turismo. After this, the game begins and you realize that any shred of hope you might've had for this bargain title has jumped out the window and fallen 20 stories to its death.   Upon entering any of the races, you have the option of choosing from a few different bikes that vary wildly in horsepower. If you haven't already figured it out by now, picking the one with the fastest engine will make the race much, much easier... so much so that the races are a joke. Take the turns granny-slow and speed through the straights and you'll destroy the competition. The races get a little more interesting later, but not by much and it's doubtful that anyone will get there.    Get into the career mode you'll find out that your racer has a personal set of characteristics. These are the same traits that ruined Corvette Evolution GT and they ruin it here as well. Instead of improving the bikes, these improvements change how well your own driver handles. The throttle and braking are almost acceptable, but to have an intimidation factor is ridiculous.   The whole idea of intimidation is plainly bizarre. If you ride behind someone, you can intimidate them into making a mistake. Sounds fine, but you can be intimidated yourself and lose control as well. To make a long story short, this system penalizes players who want to use strategy in blocking other racers. Try to use a covering line in a turn and all of a sudden you'll be intimidated by the following racer and suffer a ~knockout~ where you lose control for a short while. If you listen closely you can hear the Gods of Gaming laughing at you from the ether.   It doesn't help that the bikes themselves have control issues either. They ride more like cars than bikes and lack any sense of satisfaction. And bizarrely enough, the driver can lean forward or back to help speed up or down, but the driver never moves. The effect is felt, but it's not shown. The developers just forgot to add the two pieces together somewhere.Even if Suzuki Superbikes II was a quality racer, the intimidation system would cripple it. Consider that it's a mediocre racer on its own with a clumsy career mode and there's little to no point to picking this up. This is a bargain title for a reason and it should be left to be forgotten by the ages.", "date": "Dec 18, 2006"}