{"name": "Sword of the Berserk", "name_review": "Sword of the Berserk: Guts' Rage", "ref": "https://www.ign.com/articles/2000/03/17/sword-of-the-berserk-guts-rage", "text": "I was never that tough in school. Especially in middle school  It wasn't unusual for me to be pulled aside by a couple of Calvin and Hobbes-esque bullies and beaten like a red-headed step-child for my juice money. Sure, a few atomic wedgies, toilet swirlies, and wet Willy sessions later and I'd be free to go. It wasn't the lack of juice at lunch that hurt the most  It was the disrespect. Or was it the atomic wedgies...?  Anyways, if there's one life-lesson that I've learned from the action-slasher Berserk, it's that when people get in your way, the best thing you can do is pull out your six foot long sword and hack them into pulp. It's this exact no-nonsense, no-$*%#-taking attitude that gets one-eyed bad ass Gatsu through his days with sanity intact, and I think we all have a thing or two to learn from him.  Upon first playing Yukes and Eidos' Berserk I was overcome with great feelings of giddiness and joy. It's not every day that I get to ruthlessly slaughter wave after wave of evil with a man-sized sword  And all the good stuff is there, too. Enemies are impaled, sliced in half, split vertically, and gored with no small amount of blood coming from their ripe, fleshy bodies. Yes, this is really about all there is to the gameplay, but is that really so bad? Everyone expects their games to be so elaborate these days, with all of your RPGs, in-depth action games, genre busters, adventures, etc... Where did the good, old fashioned mindless killing go? My guess is Yukes has been hoarding it all, and this game is the result of its release.  In Berserk, we get senseless violence at its best. Not only do players get to gore dozens of enemies repeatedly, but there are plenty of niceties layered on to add extra spice to the experience. The environments are varied, the enemies are interesting and well-designed, the characters are cool and there's actually a pretty ambitious storyline. Something about some virus that turns people into dangerous zombies. Or something. I dunno, but there's killing. And blood. None of this green ~mutant~ nonsense, either.  I'm talking about the good stuff. Red blood.  And boy, does it flow freely.  Perhaps the only thing more abundant in SotB is the game's storyline, which has to be one of the most engrossing, entertaining plot lines we've ever seen.  Nearly two-third of Guts' Rage takes place in in-game cinemas, and it is all so incredibly well put together, you sometime forget you're not watching an episode of the classic anime.  Granted, I was so into the action that I often found myself waiting for the cast of characters to ~get on with it~ so I could get back to the madness, but if you have a bit longer attention span than myself, you may enjoy sitting through the game's seemingly hours of cut scenes. However, some people may get bored and frustrated that their killing has been interrupted for more than a few moments. But that's not really a good gripe, as the cut scenes can be negated if you don't care at all about the storyline.  I, for one, was ready to get back to the slashin'. There's just a tad bit of method to the madness when it comes to mercilessly goring multiple enemies. While button mashing may be a viable tactic for Berserk, it's certainly not unreasonable to be a bit more tactful. The killing system is simple, but very effective. You have two attack buttons, one for slashing horizontally and one vertically. Obviously, a number of wacked out combos are available by completing various button sequences, but it doesn't stop there. Gatsu can also do the ol' charge-and-release for a particularly devastating combo, as well as a few possible aerial attacks and combos. The game makes it very easy for players to perform impressive combinations and devastating one-two blows  Some of which hurt just to watch. It's good to see that the controls aren't overly conceived, but are given the correct balance of finesse and total uncouth Virginia-style sword slingin', a blend that keeps the fighting interesting throughout the course of the game. The additional weapons thrown into the fray, arrows and bombs, mix the action up a bit while maintaining a good overall balance.  Armed with all of these abilities and provided that the player is anything but completely inept, the result is always the same  A screen full of blood. But that's not a bad thing at all.  Especially not with the way this game manages to splash it around.  Gore has never looked this good before. The graphics in Berserk are top-tier, comparable to or better than just about anything currently on the market. Characters, enemies, and scenery are incredibly detailed, maintaining a consistently smooth framerate throughout. Some of the larger enemies and boss characters are simply stunning  One such foe is a large, demon-like flying dude. Not only is this thing absolutely mammoth, but also has a whole slew of incredibly intimidating attacks and animations perfect for ruining even the most resilient of boxer shorts.  When SotB sets its mind to filling up the screen with an intimidating bit of opposition, it tends o pull it off with class.  And the same could be said of Eidos' localization of the title. The voice acting for the American port of Berserk is in a league all its own. Instead of the usual deal that sounds like a few programmers and their family members reading things lifelessly off of paper, we get dramatic, professional level acting and vocal talent. The voice over team couldn't have been assembled better, and includes a variety of hard-core actors, including talent from Eek! The Cat and Disney's Beauty And The Beast, and the over-all level of quality really shines through in the aforementioned cut-scenes.  But the game is not without it's problems. Sometimes it just seems like thing can get a little too out of hand for the game's engine to keep up. While the largeness of your sword is inherent to the gameplay, there are a few occasions when this becomes an issue. For instance, combating enemies on a narrow stair well: The player is forced to take numerous hits while his sword gets caught up on the accompanying walls. The weapon is so long that swinging it near a wall usually results in the sword hitting the wall, thus halting any follow through. This is a mild oversight that may frustrate some gamers, but, thankfully, only becomes a gameplay issue but a couple of times throughout the course of the game.  If  you can get past this fact, however, the game really has a lot to offer hardcore action freaks. Sword of the Berserk, when taken for what it is, is virtually perfect. It wasn't intended to be anything more than an intense slasher, and that's exactly what it is. The gameplay is solid, and all of the production values are sickeningly well done. The only thing I can think of that's even mildly flawed is the occasional bad camera angle  But this is very workable, and not a large inconvenience. I'd also like to have seen some two-player action, but hey, that's just me getting greedy. Berserk is a terrific slasher. If you grow weary of action games that lack any real punch when it comes to the story, if slaughtering hordes of enemies with hardly a chance to catch your breath sounds like your idea of fun, then this is just the game for you. If, on the other hand, you absolutely must have depth and technical perfection, you may want to rent this one first.  -- Matt White, berserker rage", "date": "Mar 17, 2000"}