{"name": "Equestrian Challenge", "name_review": "Lucinda Green's Equestrian Challenge Review", "ref": "https://www.ign.com/articles/2006/12/18/lucinda-greens-equestrian-challenge-review", "text": "Some girls may really want a pony, but can't deal with, or remotely afford, the real deal. So the parents can buy dolls and videogames to give some sort of semblance of the experience. Some of the games go too far and spend more time washing the stables and cleaning up poop than provide a real horse riding game. Lucinda Green's Equestrian Challenge raises the bar by making a title that, true to the title, is a real challenge and manages to have some of those real-world maintenance duties that don't get in the way.   The challenge here is to become a better rider and to develop your horse from slow to lightning fast. There is some maintenance for the horse, but this is easily taken care of. Brushing the horse and providing food and water takes care of pretty much all of the duties to keep the animal happy and ready to race. The only thing that should be noted is that to really pat the horse or brush it, use circular movements. This is never mentioned in the game, but back-and-forth movements will do nothing to clean the horse.   So with the basic duties out of the way, the main focus here is on the riding itself. The horse has several different characteristics and by completing challenges or equestrian events the player gets development points to improve the speed, stamina, trust, or other trait. So as players become more familiar with the way the game works, the horses get better accordingly.    The challenge in the title refers to the three events: dressage, cross country, and show jumping. The dressage segment is a silly and simple rhythm game where players need to hit the correct buttons in time with the music. The higher levels are more difficult, but even so this is by far the easiest, and most boring, section of the game. The real action happens in the other events, such as in the show jumping.   The goal in show jumping is to jump over a series of hurdles in a compact space. There is a set path and it has many tight turns so that winning an event means knowing how to control the horse so well that it is moving decently fast and can still hit the jumps perfectly. To get better you must learn the course to know when to pick up the pace and when to slow it down for better control. But even this is a cake walk in comparison to the true main event, cross country.   The cross country event is a race along a long outdoor path with plenty of hurdles along the way. But where the show jumping requires knowing how fast to ride the horse and maintain control, cross country throws in the extra challenge of the horse in the process. There are many straight-aways that you can gallop along, but these tire the horse out quickly. In addition to knowing the course, players must know the horse as well. Where the show jumping hints at strategy, cross country hits you full-on. If there is a challenge in the game, this is it and it rewards careful play and is very critical of mistakes.   With the cross country section so rewarding and interesting, it's a shame that the other two events, especially the boring dressage, aren't as fun. And as such, the challenge is really only in one third of the game. If the other events were ditched in favor of more cross country events the game might lost some variety, but gain in terms of longevity and truly fun challenge.Lucinda Green's Equestrian Challenge is a far more professional effort than most of the other horse-related games out there. The maintenance and training are smoothly done and the events are easy to understand. The only problem is that only one of the events is truly interesting or provides a challenge. The others look interesting but are really just fluff to fill out the game.", "date": "Dec 18, 2006"}