{"name": "SEGA Genesis Collection", "name_review": "Sega Genesis Collection Review", "ref": "https://www.ign.com/articles/2006/12/19/sega-genesis-collection-review", "text": "Sega Genesis was one of, if not the best, game console of all time. The Genesis featured knockout graphics for its time and, more importantly, exciting and innovative games. From engrossing RPGs to fast-paced action titles to addictive puzzle games, the Genesis had it all. With the glut of cookie-cutter titles on current-gen systems, it's nice to be able to go back to a time when games were fresh and exciting and the potential for virtual adventure seemed limitless. Sega Genesis Collection is exactly what a nostalgic gamer needs for a worthwhile trip down memory lane.  Featuring 28 Sega-published Genesis games and five unlockable Sega arcade games, the SGC is one of the most robust collections I've seen. Considering it retails for just $29.99, this is the best deal you'll find in any store this year. Where most collections have 30% great games and 70% crap you'd never play, the Sega Genesis Collection is more of an 80/20 split between good and bad.   Sega Genesis GamesAlex KiddAltered BeastBonanza Bros.ColumnsComix ZoneDecap AttackEccoEcco 2Ecco Jr.FlickyGain GroundGolden AxeGolden Axe IIGolden Axe IIIKid ChameleonPhantasy Star IIPhantasy Star IIIPhantasy Star IVRistarShadow DancerShinobi IIISonicSonic 2Super Thunder BladeSword of VermillionVectormanVectorman 2Virtua Fighter 2Bonus GamesAstro BlasterCongo BongoEliminator Space FurySuper Zaxxon  Among the highlights are Sonic the Hedgehog 1 and 2, Phantasy Star II, III, and IV, Ecco the Dolphin, Golden Axe I, II, and III, Kid Chameleon, Comix Zone and Vectorman. This is an incredible gathering of Genesis greats that will please those who loved these games as a kid, but also introduces newer gamers to some of gaming's true classics.  Some games do show their age. Altered Beast is a terrible game and it's hard to imagine this was once a coveted Sega title. But there are other gems which had gone long forgotten. Comix Zone, which has a slick living-in-a-comic-book style to it, seems just as inventive as when it was first released.  Without doubt, the prize of the collection are the three Phantasy Star RPGs. Phantasy Star IV is one of the best RPGs of all time, hands down, no arguments. As with all of the Genesis Collection titles, Phantasy Star IV is perfectly recreated and a sensible fit on the PSP. Though Sega didn't provide widescreen for each game (which was done for the PS2 version of SGC), the games look great on the PSP's sexy LCD screen.  It's not all perfection. A few of the choices and omissions are curious. I'd gladly trade Ecco Jr., Decap Attack or Virtua Fighter 2 (Genesis, not arcade version) for the Streets of Rage trilogy or Eternal Champions. That said, Sega Genesis Collection gathers some games that haven't been available since the 16-bit system. Even more exciting is the addition of five Sega arcade games, each easily unlocked. Super Zaxxon is available for the first time in North America. That in itself may be reason enough to drop $30 on SGC.    Gamers now have the ability to save any time in any of the games. There are also ~museum~ features on most games, detailing the history and even cheats and tips. It's not all roses and sunshine for the Sega Genesis Collection. The presentation is lacking. This is a budget title and it has received a very sparse packaging for its menus. Instead of an inventive interface that is reminiscent of the Genesis, gamers get a bland and uninspired entry system into the 16-bit world. The ten interviews included seem hastily put together and there are some oddly long load times between some menus.  The PSP has one major advantage over PS2 -- network play. SGC's Ad Hoc set-up allows nearby gamers to join even mid-game, which is particularly nice for Sonic the Hedgehog 2. The interface is simple and there's no notable slowdown or visual deficiencies in multiplayer. Sega Genesis Collection is easily the best assemblage of Sega games you can find. Though the presentation isn't quite as strong as I'd like, the sheer number of quality games makes any missteps forgivable. The graphics, while 16-bit, are as crisp and attractive as possible. If you are a fan of the Genesis, this is one collection that can't be missed. There's no doubt that at least 10 of the 32 games included will suck away a few dozen hours of your time. At $30, this is a bargain almost impossible to pass up.", "date": "Dec 19, 2006"}