{"name": "Blitz: The League", "name_review": "Blitz: Overtime Review", "ref": "https://www.ign.com/articles/2006/12/19/blitz-overtime-review", "text": "The Blitz franchise is no stranger to hard edged football with its bevy of brawls and unsportsmanlike-like fouls.  Last year, Midway set out to make an even more visceral football game with the release of Blitz: The League, a title that allowed betting on games, juicing players with steroids and performing other Cincinnati Bengal-like actions. While the initial concept was intriguing, implementing some of the features didn't work as well as it could or should have, making a great idea only a decent title in the end.  Now, a year later, Midway is bringing the game to the PSP with Blitz: Overtime, and not only have the same issues not been addressed, the limitations of the system hampers the gameplay even more.   Like the initial title, Overtime is the kind of football game that your mama warned you about.  This league is definitely from the wrong side of the tracks, with betting on games as the lightest infraction you'll encounter on, or off, the field.  Dirty hits abound in this game, and there are even some players that will headhunt the star athletes on other teams. In fact, landing these potentially career ending strikes on a player will result in a slow motion camera pan, followed by an X-ray of the injury in brutal detail, before the victim is splayed out on the field.  Needless to say, Theismann-like injuries can and will occur quite frequently in this game, forcing you to make a decision as you cart the wounded off the field: do you treat the injured, or do you juice them up?    Treating players is pretty self explanatory: depending on the severity of the injury, you'll sit a player out for anywhere from a few plays to a few games or even a season, allowing them to heal up and return without any detriment to their stats.  Juicing a player up, however, is a bit different.  Your team doctor grabs a needle, injects some substance that is neither The Cream nor The Clear, and your player gets jacked up on 'roid rage to where they ignore the pain from the various fractures, breaks or other wounds they've suffered.  There is definitely a risk in doing this, however, since a juiced up player is much more prone to injury than ever before, and if they wind up suffering another serious blow, they can be lost for an entire season.  While it's not so much a problem during a quick match, this can be devastating during the campaign mode.   Fortunately, you can attempt to evade a number of these players with a number of deft ~Clash~ moves.  By pulling the L button and hitting the right button, you trigger a slowing down of time for everyone except the ball carrier, which can help you evade a number of tackles (including some dirty hits) with strong arms, spins and jukes. Every time you successfully pull off six Clash moves on either offense or defense, you get the ability to perform an Unleash move, which lets you evade just about anything or catch almost every pass thrown to your receivers. This can be extremely useful when you're down by a few points at the close of a quarter and need to make a long bomb to a receiver who's streaking down the field.    Unfortunately, the Clash moves, which were overpowered in the console version, are just as strong in Overtime.  If players wait till the right time to trigger their Clash move, they can easily bypass any defensive formation and surrounding tacklers in any situation.  Whether it's a kickoff return, run or passing play, it is way too easy to get around computer controlled teams with this feature. Even worse, the Unleash move provides literally impossible catches due to the fact that the ball will literally warp its way into your player's hands, regardless of their position or other players in front of it.  I've seen passes literally pass through receiver's backs and defender's torsos as they are completed for touchdowns. While these issues were the same in the console version, you'd expect that a year later there might be some balancing within the handheld port, but no such luck.      You'd also hope that there would be an improvement, or even potentially an addressing of the gameplay issues, primarily if you're going against the computer on defense, but no such luck.  Whether it's the rubberband AI whose backs start mysteriously breaking tackles late in the game when they were eating turf in the first three quarters, or the atrocious defense that never adjusts to your called plays, there aren't any adjustments to fix the blatant problems that were in the console version (two separate play clocks, anyone?). What's even worse is that the game now exhibits significant loading times, and moments of slowdown or transitions that drag on forever.  Loading times for any game will usually run around 90 seconds or so, which is inexcusable.  It's great that Overtime doesn't wind up significantly accessing the UMD once a game has started, but the 90-120 second wait for a match to start is ridiculous, especially since it wasn't nearly as bad with the console version. Once you're in the game, you'll also run into some slowdown which is particularly noticeable during transitional moments (which you can't skip through) or menu screens, which make some moments drag on forever.   Campaign mode returns in Overtime, with the same plotline from the console as well: an unscrupulous team owner starts over with a new staff and team in his quest for a championship, while trying to use his influence to try to get the mayor to pass a bond measure for a new stadium.  Along the way, the drafted offensive rookie and defensive veteran have their own personal issues that they'll have to deal with, and you'll need to train your squad to conquer all three divisions of the league to win the overall championship. Some of this training will need to balance the use of legit equipment with illicit substances, which will boost stats, but potentially get an athlete busted like Lights Out Merriman. You'll also have different challenges that are presented to you during game situations, such as avoiding a number of sacks or preventing a star athlete from scoring a certain number of touchdowns, which can unlock new features or drugs for your teams.    Unfortunately, like the gameplay, the campaign mode hasn't really progressed from the gameplay from last year.  Since you're not taking on the role of the rookie, veteran or coach, you don't exactly have a connection to anyone of the stories present, which are extremely linear and only have items happen when the game wants them to.  Most of the time, you aren't even presented with an external scenario -- you play your game and if a cutscene happens to occur, so be it.  You'd expect the option to send hookers to your opponents (which is a facet of the plot, by the way) to be available all the time if you have the money for it.  Similarly, you'd expect the betting mechanic, which doesn't provide a return on your investment, to be a bit more complex.  If I put in 50,000 on a game and win, shouldn't I get more than 50,000 back?   While the level of customization in Overtime is still impressive, the number of new improvements isn't so much.  Three new teams have been included, but they're the all-stars comprised of the best players from each team in a division.  That just feels like a weak cop-out.  Similarly, while there are 30 new user challenges in the campaign mode, they're so similar to the pre-existing ones that you won't actually notice the difference at all.  What's more, since they don't necessarily unlock anything new, it's hard to not think of them as a redesign of the pre-existing challenge system.  Additionally, while the various play modes, like Lucky 7's, Windbreakers or Bonecrushers are nice variants to play with during a 2 player game, you're only able to play an opponent via Ad Hoc.  It would've been much more interesting to play via infrastructure and be able to talk smack with opponents across the web than someone standing nearby.    It is impressive to note that just about all of the extra content and movies have made the migration over from the console version to Overtime, without a significant loss in picture quality. In fact, some of the movies look a bit better on the PSP's screen, so when you're finding out who the star player is that you need to beware of, you'll probably be impressed by the video.  Unfortunately, it's pretty obvious that the video was pulled from the console versions, as the PSP's not able to render the same models.  While character models are surprisingly large and detailed for the system, many of the additional areas, like the crowds in the stadiums or players on sidelines are extremely generic textures.  In fact, it's possible to see characters without any faces during some cutscenes.  Certain details will also warp in when you least expect it, like cameras that are stuck in players or helmets that are knocked off athletes that suddenly snap on and off their skull.  The limited amount of power also demonstrates some of the game flaws during some transitional cinematics, such as big hits on players that don't actually connect to the character model at all.  I'd love to know how you pull off a face mask on a guy without actually touching his head...   At least the sound is still the same as the console version, so you'll still hear the great sound effects and smack talking complete with F-bombs, insults, and funny jokes.  There is a strange issue that will crop up here and there, which either will cause the sound to not sync properly with the video, or will literally drop dialogue or sound effects all together.  It won't happen for every game, but you may stumble into this oddly muted matchup every so often.  While Lawrence Taylor was the big draw with the voice acting as the somewhat unstable Quentin Sands, Overtime has also recruited Bill Romanowski to play the insane Bruno Battaglia.  The inclusion of Romo's voice makes the over the top personality of Battaglia come to life, and feels like an excellent touch.Just like the console version of the game, the concept of Blitz: Overtime sounds like an excellent one: transferring everything from the console version of Blitz to the PSP with a few new teams and features sounds like a great thing to take with you on the go.  Unfortunately, without any fixes being made on the title, it's practically the same game with the same problems, and the included technical issues with slowdown, loading times and other glitches don't help it either.  If you're a hardcore Blitz fan, you'll probably dismiss these issues, but otherwise, you'll find it to be a much better experience on the console than on the handheld.", "date": "Dec 19, 2006"}