{"name": "Beatmania", "name_review": "Beatmania (Import)", "ref": "https://www.ign.com/articles/2000/03/17/beatmania-import", "text": "Though the musical game remains a niche genre in the USA, it's a different story on the other side of the Pacific. Musical arcade games have hit Japan like a tsunami, ranging from the foot-moving action of Dance Dance Revolution to the maraca-shaking mayhem of Samba de Amigo. The game that started this trend is none other than Konami's BeatMania -- an arcade ~DJ Simulator~ that featured a five-key piano, and full-sized turntable for the ultimate in record-scratching realism.  The incredible  and somewhat inexplicable  success of BeatMania spawned a never-ending series of sequels, and a plethora of home conversions. But when you feel the need for DJ action on the go, who can you turn to? Fear not  your buddies at Konami's have you covered. There are two BeatMania games readily available for the Game Boy Color, but they pale in comparison to the mighty WonderSwan version  which ships with a mini-turntable controller that snaps onto the side of the unit, and provides pint-sized record-scratching action!  Here's how the game works: you select a level of difficulty, and choose a genre of music. The crowd applauds loudly in anticipation of your mad DJ skills, and the song begins. Since this particular game uses the WonderSwan's ~vertical~ setup, the five piano keys of the arcade version are mapped to the eight WonderSwan buttons at the bottom of the unit. Here's how the simplified tablature works: black bars drop from the top of the screen, and when they hit the bottom, you press the corresponding key to play the note. If you see an extra-long bar, this is your cue to reach up with your index finger and give the turntable controller a scratch.  Your success is measured in the ~Groove bar~ at the bottom of the screen  if it's at the maximum level, you're in the clear, and the crowd is eating up your performance. But if you keep missing notes, your adoring fans will turn hostile, and it's back to the DJ academy for you.  In a game like this, the quality of the music and sound effects are crucial  and the WonderSwan's sound system manages to crank out some pretty solid beats. The BeatMania soundtrack is 100% digital  every single song and sample has been digitized from the arcade version. Sure, some of the instruments sound scratchy now and then, but when was the last time you played a handheld game with vocals? I imagine there's around a half-hour of digitized music stored on this cartridge  not an easy feat. The selection of music includes everything from funk to ambient to hard-core techno  just wait until you play the remix of the Metal Gear Solid theme. And if you've got a link cable, you can hook up with your friend's WonderSwan for a DJ duel. Brilliant!  In fact, the only problems I had with the game are design issues with the WonderSwan itself. The speaker in the unit isn't exactly Bose quality, and redefines the term ~tinny-sounding~ when it tries to crank out the bass-heavy BeatMania songs. You could plug in a pair of earphones -- but there's no earphone port! In order to keep the costs of the system down, the jack is actually sold separately.   Another complaint is that some of the key combinations are remotely tricky to play, thanks to the close positioning of the WonderSwan's buttons  fat-fingered players will be up a certain creek without a paddle. The biggest disappointment is the lack of songs  there are only ten available, when the Playstation versions are loaded with dozens (though this is probably the result of limited cartridge space).  WonderSwan BeatMania is definitely a weird little niche game  and the chances of it coming out in the States are close to nil. If you find a used copy languishing on the shelf of your local import store, pick it up  chances are good you won't play anything this unique for a long time. Like DJ Konami says, make a good sound!", "date": "Mar 17, 2000"}