{"name": "Rock 'em Sock 'em Robots", "name_review": "Rock 'Em Sock 'Em Robots Review", "ref": "https://www.ign.com/articles/2006/12/21/rock-em-sock-em-robots-review", "text": "Nostalgia is a dangerous mistress, tempting you with fond memories before crushing you with the reality that some things really are not as good as you remember them. Such is the case with Mattel's Rock 'Em Sock 'Em Robots, a plastic robot brawling toy that just isn't that cool when you toss off the rose-tinted glasses. And the mobile game based on this hulk or articulated plastic? Not much better, it turns out.   Rock 'Em Sock 'Em Robots from Oasys is a very simple fighting game -- this was expected, because the mechanics of the toy was pretty simple, too. You jam on the 4 and 6 keys to punch with each arm, trying to smash the metal mug of the other robot. There is supposedly a rhythm element in here, as you try to counter the other robot's punches as the meters scroll down the screen, but I won every single fight by just jamming on the 4 key relentlessly. If you counter blows, you can use 5 to unleash a super-punch, which I did use to just see if it worked. It does, but it's unnecessary. Just jam on 4 or 6 with zero regard to any real rhythm, you'll win.   Between rounds, you'll engage in some mini-games like stacking falling robot pieces or creating a circuit. If you beat the mini-game, you enter the next round with a boost. Every five fights you leave victorious, you unlock one of the mini-games from the main menu. The idea of having to play upwards of 25 fights to unlock all of the mini-games is a frightening prospect.   This is just such a shallow, pointless exercise -- jamming on buttons does not constitute a game. Even one-button games like NOM or Skipping Stone have some sense of real rhythm or an exciting premise that keeps you glued. Rock 'Em lacks any such magic, save for a fleeting bit of nostalgia.   The production values, however, aren't bad. The music is certainly good -- I wish it accompanied a better robot fighting game. Robot models in the fighting game are fine, too. They accurately represent the original toy.  Rock 'Em Sock 'Em is boring. It draws you in with the promise of childhood fun, but let's be honest with each other here: Those plastic robots lose their appeal once you cross the age threshold of 10. There are an easy two dozen or so games I could rattle off right now that are a better deal with much more game play for the same price. Avoid.", "date": "Dec 21, 2006"}