{"name": "Dead in the Water", "name_review": "Dead in the Water", "ref": "https://www.ign.com/articles/1999/04/20/dead-in-the-water-2", "text": "Start with a little bit Jet Moto, throw in a glob of Twisted Metal, set on blend, and you've got what ASC calls Dead in the Water. This combat racing game offers all the insanity of both those classic games, while offering a dose of action all its own. It's an interesting and ambitious combination for a racing game, but for some reason the design just falls flat as the water in an icerink.  It's not that Player One didn't try  Dead in the Water has a unique feel with very stylized imagery. The action certainly is hectic enough. It's just not that fun to play. Gameplay Dead in the Water is a balls-out boat racing game set in nine different watery locations. Each track has its own obstacles, jumps, and conditions. You'll battle against 13 different characters, and they all have their own style of racing, their own boat, and their own way of putting the competition out of commission. Luckily, you've got your own weapons to deal with those bad guys, and they can be upgraded, but only if you collect enough money in the race. Money can be obtained by winning races and by smashing into certain race-side obstacles that will shatter and reveal the cash.   Dead in the Water features realistic water effects and physics  swells will push you high in the air or get in your way. If you land too fast and hard from a jump you'll be cast underwater, and that'll really slow you down. Flowing currents can also help or hinder, depending on the direction it moves.  The game also features a battle mode, very much like Twisted Metal. You just enter an open arena and try to be the last man standing  er, floating, all the while picking up weapon icons and taking out the opponents.  The biggest problem of the game is the Dead in the Water's controls. Granted, all boats have their own special abilities, like handling and acceleration, but the game just feels  for a lack of a better word  floaty. As you race around the course, the waves will kick your ship up in the air, and the only thing you can do at that point is rotate around in the air. You tend to go airborne an awful lot, which also kills the game's controls. It also makes trying to zero in on an opponent with a weapon extremely an extremely difficult task. Maybe that's just the nature of the game, but to me the game is more a chore to control than it is fun to play. Graphics Obviously for a game that revolves around water, you'd need a good water engine. The one in Dead in the Water is OK, but it's very angular, and many times it's not transparent  which is a necessity since you'll need to see where you're going when you're plunged underwater.  The rest of the effects are pretty neat, though. Mushroom clouds, transparent explosions. And the framerate remains at a relatively smooth, constant clip throughout. The front-end graphics use the PlayStation's high-resolution mode, which gives the game a sharp look in the game select screen. Sound  As you race around the circuit, your ears are pounded by the sound of generic hard rock. It isn't bad, just kind of lifeless. And during the race, you'll hear comments from your on-screen persona, as well as heckles from your enemies  a nice touch, but they tend to repeat the same comments over, and over, and over, and over....  One thing's for sure  the PlayStation isn't being skimped in the racing genre. So it'll take a very special game to grab your attention, since there's so many of them out there. Player One tried  you can tell that this wasn't intended as a B-grade title, with the game engine and stylized front-end graphics. It's just that, with all the elements put into place, the game just doesn't click as a ~great~ game. It's only ~averagely good,~ at best.", "date": "Apr 20, 1999"}