{"name": "Star Wars: Lethal Alliance", "name_review": "Star Wars: Lethal Alliance Review", "ref": "https://www.ign.com/articles/2007/01/09/star-wars-lethal-alliance-review-2", "text": "Unwrapping a Stars Wars videogame is a lot like cracking open a fortune cookie - you hope for the best but prepare for something lame. While this wasn't always the case, the recent crop of Star Wars titles hasn't fared too well critically. This goes for the PC as well as game systems. The first titled based on the venerable license to hit the PSP, Star Wars: Battlefront II, failed to make a lasting impression as well.   LEGO Star Wars II: The Original Trilogy, on the other hand, offered a rewarding experience filled with humor and action. Now there's Ubisoft with Star Wars: Lethal Alliance, an action game for the PSP starring a sultry mercenary and her sidekick robot. To start, you just need to know Lethal Alliance fares better than Battlefront II. It looks and runs better on the PSP to start, but it also has a good amount of variety when it comes to gameplay. It has a few quirks floating around but it nevertheless offers an enjoyable ride for Star Wars fans or just anyone wanting a decent action game to go.    The game takes place between Revenge of the Sith and A New Hope, an era geeks dream about often. Only the game doesn't focus on the Jedi and their struggle against the Sith. Instead, the action and narrative deals with the mercenary Rianna and her little droid as they try to steal plans for the Death Star. Turns out Rianna bumped into the Rebel Alliance sometime before the start of the game and they enlisted her aid in securing the plans. Which is totally fine by her, since the Empire screwed her badly when she was a lot younger. Throughout her adventure, Rianna rubs shoulders with numerous Star Wars figures, including bad boy Kyle katarn.  The action plays out in the third person, with control of Rianna delegated to the thumbstick. The camera isn't locked, fortunately, so you can pan it around using the two shoulder buttons. The remaining actions, like reloading and using Zeeo, have been mapped to face buttons and directional pad. Together, the somewhat limited control options of the PSP still manage to offer a very flexible and intuitive control scheme in Lethal Alliance. There's a lot you can do, both in terms of offensive and defensive tactics, and none of it is particularly hard to execute. This goes for Rianna's acrobatic prowess and skill with weapons, as well as Zeeo's numerous support abilities.  Better still, Lethal Alliance affords plenty opportunity to use it all. Most of the stages focus on action and obstacle navigation - much of which is fast-paced. You constantly fight six or more enemies at once, many times in the middle of trying to solve some kind of environmental puzzle. Fortunately, multitasking isn't a hassle here, as the stages have been designed to give you plenty of room. Also, Zeeo helps you disable or kill multiple enemies, as well as unlock doors and hack computers all while you busy yourself blasting foes.    When not shooting storm troopers, you will guide Rianna as she leaps and swings throughout stations and warehouses. In a way, Lethal Alliance plays a little like Prince of Persia or Tomb Raider, since there's plenty of ledge hanging and death-defying leaps. It's all really fun, too and never feels out of context for the character. What's more, the game has a number of on-rails sequences too add variety. And guess what - those are pretty damn fun, too. They move at a brisk pace and conjure a definite sense of urgency.   However, it's not all groovy. One negative thing about the action is that it can get repetitive after a while. While enemies do change in terms of appearance, killing them (bosses not included) is prohibitively straightforward. Also, since you encounter plenty of enemies and neutral targets (computers and doors), it's possible to get your targets mixed up. This happens most often during hectic boss encounters and it can get pretty aggravating, though it's never bad enough to make you hate the game. Apart from these issues, the game suffers from the occasional framerate hiccup. Having said that, the game runs well for the most part.   Star Wars: Lethal Alliance offers a rewarding blend of action and platforming. While not revolutionary in any way, the action benefits from a high degree of flexibility thanks to an array of attack options and a helpful robot droid. In short, it looks good, runs well and only suffers from a few glitches here and there.", "date": "Jan 9, 2007"}