{"name": "3Xtreme", "name_review": "3Xtreme", "ref": "https://www.ign.com/articles/1999/04/22/3xtreme", "text": "989 Studios is real hit-and-miss these days. Syphon Filter was fantastic, MLB 2000 is high on the charts, but 3Xtreme, well, it's more of a bomb than da bomb, if you catch my drift. With this being the third in the series, one would make the assumption that the third would be the charm. Or at least damn good. But 3Xtreme is everything that Kelly Flock said was wrong with EA in Next Generation magazine last year: it lacks innovation, fun, and the ability to convince any gamer that it's better than its previous iterations.  This sounds harsh, but one expects great things from 989 Studios, a company that brings us the exceptional Gameday year in and year out, and has the potential to be the Rare of the PlayStation world, or bigger. But with 3Xtreme, it's apparent that another game has been cranked out on late night pizza and Pepsi with little aim, passion, or focus. Numbers not gamers were mind with this stinker. Gameplay When ESPN Extreme games hit retail shelves in 1996, our former editor Adam Douglas wasn't thrilled with the game but saw its potential, as can be seen in his review. Back then, the concept of three radical sports meshed into one monster game was cutting edge. Now, three years later, it's status quo. In fact, if there isn't something especially unique about a game nowadays on PS, it'll be lost among the onslaught of other choices.   3Xtreme begs to be played with the brutality of Road Rash, and screams to be radical, hard-core, cutting edge, like any number of snowboarding games. The intro movie for the game demonstrates these aspects beautifully. Too bad the game is anything but. Instead what we get is a game by the numbers, with everything that seems right, but isn't. It's as if the developers ignored all of the little details. What happened to 22 characters on screen at once? Now we get six, and the frame rate isn't necessarily running in the high 20s. What happened to the street luge? OK, so maybe it wasn't that fun in the first place, but why wasn't it substituted with something cooler, such as a goofy flying bicycle, a lie-down bicycle, or something funny or absurd? Last, in the first game there was cross-town traffic, and characters could jump off the roofs of moving cars! How cool was that? Now we don't even get moving vehicles at all. It's as if all of the potentially cool aspects of the game have been whittled down to zip, nada, zero.  With a set number of moves per character, some of which are shared between characters, the radical qualities can be summed up before checking into the pro level of the season mode. Flips, rails slides, 360s, tail grabs, etc. are all there, but if you look in the manual, there aren't even listed by their proper names. When you buy a snowboarding game, you know that the developers understand the moves and know their names. In this manual, they're simply listed as trick 1, trick 2, trick + so-and-so. What gives?  OK, but to be completely fair, the moves as the best part of this game. Ramps litter the courses, and specially designed jumps lead into triple or quadruple gates, rails and even triple jump areas. In some cases, wildly steep jumps enable complete freedom to pull off 360s that lead into flips, tail grabs and more, depending on how good you are. The moves are easy to pull off, too. Hit the triangle or circle and a direction, or those plus R2 or L2 in combination for other moves. Everything is listed in the manual and they're a cinch to pick up.  While the tricks are pumped up in 3Xtreme, the fighting is pared down. Fights don't play much of a part in the game anymore. And if you though this uses the analog controller, think again. It's lop-sided, too. Players have to slam an opponent at least three times before knocking them out, but in the later levels, rivals will zoom up and with one pop you're taken you out. They'll zoom up from behind you (and from beyond the screen) and whack you good. So, the AI is weird, at best.  This point can be even furthered if you notice how they play against one another. Yes, they do fight one another, and that's cool. But they also do really lame stupid stuff. For instance, you'll be ripping down the course and see an opponent who's slammed into a wall - not a rail or a narrow doorway, a wall. In the next second, they'll tear by you so fast you'll wonder where the little motors on their skateboards are.  The big hit of this game is two-player mode, because once you've played through the champion circuits, time trial, exhibition, and freestyle are weak little modes that won't warrant your attention. I apparently misunderstood Freestyle, thinking I could jam around without a time limit and practice moves in specially designed areas. Ha ha! Instead I found that I was plunked into a timed course in which I couldn't reach the end even if I was fast, made all of my landings, and was a master of disaster. Freestyle? More like Freepile. Graphics Graphically, 3Xtreme is not a next-generation product, by any means. The characters and backgrounds are completely polygonal, which nicely accentuate a 3D world, and the courses are decorated well and designed particularly well for this kind of high-speed, trick oriented racing. In some cases, one can see the courses designed to avoid pop-in. Strangely, in some other courses, or parts of courses, pop-in whacks you over the head. Still, even Sports Car GT (a bad looking game) looks better than this. How come Gameday, Syphon Filter, Rally Cross, and MLB 2000 look so frickin' cool, while 3Xtreme looks like a smeared, pixely disaster, with bad frame rates and sharply jointed characters?   It's safe to say that while 3Xtreme looks better than any of its predecessors, it still looks like merde. In 1997 this might have made the grade, but not in PlayStation's fourth year. With a complete set of poor full-motion video making up the characters' moves, one is reminded of the Mortal Kombat rip-offs that made Mortal Kombat's FMV look good. Ouch. True, the characters are highly textured and skillfully designed, but they move so unrealistically, stutters and all, which players will lose sight of those little points.   Another note that should just tickle gamers is that Slim Jim is a sponsor of sorts. The ads are splashed all over the damned courses in a not-so subtle cross promotion, and apparently even that wild wacky guy ~Slim~ is hidden as a playable character.  Sound What can be said here? The music is all over the board. Ranging from grunge and hard rock, the game also lists tunes that mix house and techno styles. Ultraspank pulls off a nice intro song that appears on their debut. But other than that, there are no big name bands listed here. The music is fast-paced and edgy, perfectly suited for what 3Xtreme aspires to be.  Sound effects are a different thing altogether. Even Cro-Magnon had a wider range of grunts and yells. Every guy yells ~Ughhh!~ and the women characters share the equivalent moans. It's not a pretty set of sounds, pilgrim.  What's my opinion? Well, if you haven't already guessed, this game blows hard. Strangely, it isn't exactly a huge disappointment. We saw and played the early version and it didn't look too good then. But you never know some games pull through in the end. This one didn't.I'd rather play Street Skater, 1080, or better yet, wait for Activision's Tony Hawk's Pro Boarder. Now that is going to be a great game. I suppose the best thing that could've happened to this title is to have had the 989 team completely scrap it and build it up from the beginning, with fresh concepts and a new approach.Rent this if you dare.", "date": "Apr 22, 1999"}