{"name": "Lost Planet: Extreme Condition", "name_review": "Lost Planet: Extreme Condition UK Review", "ref": "https://www.ign.com/articles/2007/01/11/lost-planet-extreme-condition-uk-review", "text": "If you think the biting grasp of England's winters are enough to chill you to the bone, you should try living on a planet that's forever encapsulated in a blanket of ice. The arctic wastelands that provide the backdrop to Lost Planet are inhospitable to the most resilient of creatures, with even the indigenous Akrid struggling to survive in the frozen tundra if it wasn't for the pockets of thermal energy that keep their tickers tocking. Unfortunately Wayne, your alter-ego and the hero of Lost Planet, and his compatriots also need this energy to stay alive and thus brutal battle over the gooey orange stuff ensues.   Before we get ahead of ourselves though, first a bit of background. Gathering energy isn't the sole reason Wayne is on an Akrid killing spree; his father was killed by one of the Akrid's biggest, nastiest critters - a giant slug-thing called Green Eye, so Lost Planet really is just a story of revenge. Not that it's important, because the real focus of the game is gunning down every space bug that's stupid enough to wander into your gun sight.    You see, it's very much a case of kill or be killed in Lost Planet, because one of the only ways to harvest the thermal energy needed to survive is to kill an Akrid and suck up glowing goodness it leaves behind. The bigger the bad guy you cap, the more juice it leaves, meaning you can survive for longer. If you don't scoop enough goo, either because you don't pick it up quickly enough or are a pacifist with a dislike for weapons, the energy drains from the meter on your screen. Let it reach zero and the effects of the hostile weather will begin to take their toll, eating away at Wayne's health bar until he gives into the cold completely and dies. However, keep yourself topped up with the hot stuff and it'll keep you alive, by holding the cold at bay and, more importantly, soaking up any hits you take.   This energy also serves as a power source for Vital Suits - the giant armoured mechs you can climb inside and use to really give the Akrids a kicking. These robo-suits guzzle the good stuff faster than George Best and Oliver Reed put together, but they're heavily armoured, meaning you can take on the toughest enemies without getting maimed. They're also kitted out with some of the meanest weapons on 360, from chain guns that tear through flesh, rocket launchers which can take out multiple enemies and plasma cannons that deliver a highly-focused blast of pure energy powerful enough to knockout another mech in a couple of shots.    Good job too, because the Akrid are out in force. The bug-like enemies come in all different shapes and sizes, from weird tripod plants that spit explosive seeds to flying cuttlefish creatures that flit around in the air, diving bombing Wayne when his back is turned. Such weedy creatures will rarely trouble you though, with a quick blast from the default machinegun usually enough to dispatch them. Things quickly take a turn for the worse though, with the introduction of tougher Akrids whose thick, scaly hides are impenetrable to regular bullets and shotgun shells. Well, almost impenetrable. See, every videogame bad guy has their Achilles heel and the Akrid are no different, with soft underbellies to rip in, spindly limbs that can be blown off and countless other weak spots ripe for exploitation.     This is especially true of enormous boss monsters that lurk at the end of most of Lost Planet's levels. These breath-taking behemoths often fill the screen and are, without doubt, the most impressive aspect of the game, if only because they look so damn good. There's no denying the enemy design (and indeed the overall organic feel of the game) is spot on throughout, but the giant Akrids really make the most of the 360. Whether it's a massive beetle that curls into a ball and attacks by rolling over its victims or an enormous flying sting ray that drops explosive eggs, you can't help but gasp when the next big beast makes its debut. They're not particularly original - elements of Metroid Prime and even Zelda are evident throughout, both in enemy design and the way the boss must be defeated - but they work well.   It's a bit of a shame, then, that only basic strategies are needed to defeat the majority of them. Targeting weak spots is essential for bringing down some of the Akrids, but a rocket launcher and a steady supply of ammo is equally as effective most of the time. Therefore you'll never really get stuck for any length of time, because there's a plentiful supply of weapons and thermal energy around every corner and the respawn points are pretty forgiving. As a result you're likely wade through the entire single-player game in less than eight hours.    It's not the most exciting eight hours of gameplay you'll ever experience either - although there's no denying Lost Planet is a fun game, one that's well-paced and bursting with action. It's just that it's extremely formulaic, with the levels following the same design throughout - fight off swarms of smaller Akrid, climb inside a Vital Suit, tackle yet more Akrid, defeat a boss and repeat. By the time you're halfway through it feels like there's nothing more to see, especially when the only new enemies you encounter are the bosses, with everything else a carbon copy of what's gone before.Lost Planet is undoubtedly a fantastic looking game, as anyone who played the demo will attest. The enemy and mech design is brilliant, the effects - especially the smoke - are spectacular and many of the levels, especially the frozen city, are truly epic. Its enjoyable to play too, thanks to tight controls and dumb-but-decent gameplay. However, poor design decisions really drag it down: too much time is spent running around nondescript wastelands and dark caves, plus the lack of original enemies later in the game means its almost a chore trying to complete them. Cheap enemy attacks and occasional camera and slow-down issues are also evident, and while some will see this as nit-picking, they are points that need to be made, especially when it takes so little time to finish.", "date": "Jan 11, 2007"}