{"name": "Yggdra Union", "name_review": "Yggdra Union Review", "ref": "https://www.ign.com/articles/2007/01/11/yggdra-union-review", "text": "Sting is definitely a developer to keep an eye on. The minds behind the Evolution series and a ton of games that never made it to US shores got some due attention last year with their Game Boy Advance role-playing game Riviera. That game was a peculiar amalgamation of game types, wrapped up in solid presentation and lush character art. But its abstract gameplay and unconventional navigation made it as off-putting as it was interesting. Their new game, the less-pronounceable Yggdra Union, cranks everything from Riviera up a notch. It's a crazier, more exciting adventure that combines aspects of real-time strategy and card-battle games. But like Riviera, it's a little too abstract to recommend to all gamers.    The story revolves around Princess Yggdra of Paltina, who is lost in the woods after a siege on her castle. She hooks up with some thieves and warriors, and the rest of the game is spent with her working her way up the enemy food chain. It's not a particularly interesting story, and tends to focus too strongly on chatty banter that will leave most players a little apathetic toward these characters. But the story moments aren't overbearing and are mixed in well with the action. For example, when Yggdra's unit is moved adjacent to the primary enemy unit, there will usually be a short scene between the two, mid-battle.    Little triggered moments like these do well to sell the believability of the situation, which is pretty necessary because this game (like Riviera) uses abstract maps and environments. Rather than place the characters in dense settings filled with sprites and objects to interact with, everything is played on a blurry, vacant map with almost nothing other than the characters on top of it. Villages and houses are indicated by tiny icons, but navigating the lifeless environments bares more similarity to playing Risk than Advance Wars. This approach was obviously a stylistic decision on the part of the developers, but because of how abstract the environments and the characters are, it's a little hard to get sucked into this world.    During battle sequences though, this is possibly the busiest GBA game ever crafted. During a typical scene, the screen will include: animated character sprites of both combatants, their names, their fellow soldiers, animated mini-sprites of each with score, a cutscene portrait of each, dialogue word bubbles, the battlefield, rage meter, unit health, attack strength, current card with stats, unit weapon type, unit names and passive/aggressive meter. Screen space is used very economically, although on the other hand about half this stuff isn't really that useful during a battle. But this game is all about visual overkill in warfare and necessary or not, it's pretty interesting to behold.    The game uses a unique morale system in favor of relying only on hit points. When two units do battle, they fight until all soldiers from one side have been vanquished (so a unit with 5 soldiers starts the battle with 5 hit points, essentially). Once the battle is over and the results are tallied, the morale of the losing side depletes. Morale is like a broader health meter that carries over between battles. It is affected by how much a unit is shamed during a fight, and a team of soldiers won't go away until their morale is completely defeated. So barely overtaking an opposing unit will win the battle, but might only drain 10% of their morale (meaning at that rate, they'd have to be beaten ten times). But completely decimating an enemy unit while taking almost no damage to the heroes may eradicate enemy morale in a single battle.    Morale unfortunately does not replenish between battles or even chapters. Instead, objects found and earned during battle must be applied to the characters before the next fight in order to patch them up. This is a shame, since it's somewhat of a morale killer (for the gamer) to load up a save file and find the princess saved at death's door. The developers are definitely stressing the exhaustive journey aspect of the game here, but it's a little merciless.    Weapons affinity works in a rock/paper/scissors fashion, so that characters wielding a spear are better against those wielding a sword, sword beats axe, and axe beats spear. This sounds pretty trivial but turns out to be essential to winning battles. Going in on the right or wrong side of these combinations is often the single biggest determinant of which side will come out victorious.    A meter at the top of the screen can be adjusted to make the currently-controlled band of characters more aggressive or passive during battle. More aggressive warriors stand a slightly better chance of coming out victorious, however making them more aggressive depletes a meter with finite resources. The game recommends making characters more passive during battles that are going to be easily won, although I must've missed those moments because Yggdra Union is pretty consistently difficult. Success in even the early levels hinges on making only smart decisions with all units.    The most interesting gameplay element is unit formation. Taking a single unit into battle will result in only that unit taking on the enemy. However, lining up other units behind them allows those other units to come in for a second attack when the first one is done. Female-led units (like Yggdra's) must align reinforcements in a + formation (keeping the other units above her, below her or at her sides). Male-led units must align reinforcements in an x formation.       Adding even more complexity, these rules go for the enemy units, too; enemies aligned in a + or x formation (depending on their sex), can send multiple waves of soldiers at the player. So to fight effectively, it's important to not only properly line up the hero units, but take on isolated enemy units that won't bring an onslaught of troops with them. Unit formation adds a chess-like strategy element to the game, and also gives greater importance to the card-based mobility system, which is used to line up reinforcements and not just move the attacker. It's a shame the other gameplay elements Sting came up with for this game aren't as cohesive and effective as unit formation.    There is a very robust (and at times overbearing) tutorial structure that occurs over the first few stages. This is necessary due to the complicated structure of the battles. But the game does a nice job of walking the player through every aspect of gameplay, and rations up the introduction of new gameplay elements over the first few levels. Although deep, the tutorial mode can be a little too chatty at times, with characters far more verbose and witty than they need to be. And none of the dialogue can be skipped, even if it's being read for a second or third time due to losing a battle. Luckily this only affects pacing in the first few stages. Yggdra Union is an amazing accomplishment, but it's a game that I probably admired more than I enjoyed. There's no denying that this is one of the most beautiful and visually-complicated games ever released on the GBA. The gameplay is unique and inventive, but it's not always intuitive and won't be everyone's cup of tea. Real time strategy addicts looking for something new will find it here, but casual gamers would do better to start with something like Advance Wars.", "date": "Jan 11, 2007"}