{"name": "Princess Natasha", "name_review": "Princess Natasha: Student~Secret Agent~Princess Review", "ref": "https://www.ign.com/articles/2007/01/11/princess-natasha-studentsecret-agentprincess-review-2", "text": "It's obvious to everyone. Check the release lists and the store shelves, check the archive of past reviews. The majority of games you'll find are licensed, adapted from other entertainment properties like cartoons, movies and cartoon movies. It speaks to the success of the DS and Game Boy Advance systems that so many of these titles continue to appear, and Princess Natasha takes yet another stride for licensed gaming's proliferation. Not based on a TV show or feature film, Princess Natasha: Student~Secret Agent~Princess is a title adapted from an America Online Flash cartoon. Anything can be licensed these days, it seems. But you knew that. It's obvious to everyone.    What you may not know is Natasha. The series that has been entertaining an audience of AOL users for a few years now, and focuses on the adventures of its enterprisingly triple-identitied titular star. Natasha was born the princess of Zoravia, an Eastern European nation sitting half a world away. She's next in line for the throne, but her villainous Uncle Lubek wants to make himself the monarch instead. To achieve this evil aim, Lubek travels to the state of Illinois, masquerades as a school principal, and executes a variety of sinister plots to plague the local populace. Why the American Midwest? Because that's where his niece Natasha is living, herself also masquerading as someone she's not  a normal, everyday foreign exchange student.    Natasha's third and final personality is that of a spy, a likeness she adopts to counter Lubek's dastardly plans. He'll try just about anything to wear the crown, but this game finds him unleashing a horde of bouncing bubble robots to turn the native fighting Illini into mindless, listless zombies. Natasha side-scrolls her way to the citizens' rescue in this action design, but saving the day is tough when you move as gracefully as a lock-jointed action figure.    Control is at fault here with Princess Natasha, as our happy heroine has horrible hopping power and pitiful attack range. Natasha drops like a rock when she jumps, an off-putting offense since that simple action is such a gaming staple. And defeating enemies is a chore  Natasha can kick with the A Button, but the attack is always aimed low and has a very small effective hit area. She's also armed with a variety of firearms, but these too are limited. Some have small bullets and restricted range. Others don't even deal damage.    The frustrations in fighting are hurtful to the enjoyment of the game, as clearing each screen of enemies is the goal of the gameplay. That, and saving zombified citizens. Natasha's also packing around a spray canister of dezombification gas, capable of curing even the most stubborn cases of undead infection with a generous application. Feel free to skip this action, though, as it's entirely unnecessary. Zombies are automatically cleansed when you defeat each screen's set of scrubbing bubbles.    And that's pretty much it. Destroy baddies shaped like soap suds, then lather, rinse and repeat that action again and again through every succeeding stage. Princess Natasha's gameplay is repetitive, and its control and hit detection issues further drain the fun from the design. It's a shame, too, because the game actually looks pretty good.       Most poor-playing games also feature equally lacking visual, auditory and presentational elements  but Princess Natasha does these things fairly well. Fans of the online toon will recognize and appreciate the start-up intro scene, and Natasha's world is represented well. Stages are bookended by appearances from Oleg, Natasha's gadget-making sidekick, who also offers bits of gameplay advice before each level begins. The presentation is especially bold in the DS version, where large still shots of Natasha project onto the lower screen to better illustrate the action happening up top.    Graphically the game looks good, simply lacking sufficient frames to make Natasha's movements feel fluid. The speakers pump out workable, if not memorable, background music. Voice clips from key characters could have been included, but their exclusion isn't a mark against the game  the Princess Natasha show is more about appealing to the eyes than the ears, and that quality comes through here.    Fans of the franchise can likely look forward to upcoming online support for the game, as a Cheat menu is included here that asks you to type in secret codes. No doubt these passwords will see release through AOL's Princess Natasha site, accompanying new episodes of the show and fresh interactive Flash games. Games that are free, and playable in your Internet browser. AOL might not have thought that one through  its online site is already providing a wealth of fun, Flash-based Princess Natasha experiences for no charge, and now the alternative is paying 30 bucks for a tedious, tough-to-handle side-scroller? That's a situation almost as confusing as a teenaged girl with three separate selves. Princess Natasha: Student~Secret Agent~Princess is a faithful representation of its online inspiration. But the play's the thing, and this title plays poorly. It's hard to maneuver Natasha, monotonous to continuously destroy the same enemies over and over again, and difficult to deal with the hit detection to get that destruction done. You're better off saving your money, and instead pointing your browser to AOL's Princess Natasha site and checking out the free Flash games and cartoons to be found there. Free is always best. That's obvious to everyone.", "date": "Jan 11, 2007"}