{"name": "Brothers in Arms D-Day", "name_review": "Brothers in Arms D-Day Review", "ref": "https://www.ign.com/articles/2007/01/17/brothers-in-arms-d-day-review", "text": "For a while it seemed like the PSP would never get a library of first-person shooters. Coded Arms delivered a decent romp in virtual space, and Ghost in the Shell: Stand Alone Complex had some good ideas, but neither games made good use of the PSP. After these two shipped, Sony's little system got Medal of Honor Heroes, a game that finally showed what a really good FPS would be like on the handheld.   Soon afterward, Ubisoft and Activision announced their own FPS titles, Brothers in Arms D-Day and Call of Duty: Roads to Victory. The former shipped a little bit ago, though it sadly fails to elevate the FPS genre on the PSP. At this point gamers don't even care to have a revolutionary shooter on the PSP - they just want one that works well. And that's the problem with D-Day. Even with an adequate representation of elements seen in the PC versions, D-Day simply needs more to succeed as a portable FPS. It has clunky controls and muddy visuals, and the AI could use some sharpening.   D-Day takes place during the Normandy invasion and chronicles the harrowing account of two soldiers, Sergeants Baker and Hartsock. Sergeant Baker starred in the first PC game, titled Brothers in Arms: Road to Hill 30 while Sergeant Hartsock appeared in the sequel, Brothers in Arms: Earned in Blood. D-Day doesn't just borrow characters from the first two games; it takes entire missions and scenarios. Players will essentially get a ~best of~ collection with D-Day, as opposed to a new game. Not a bad thing in itself, but anyone expecting some fresh content may want to look elsewhere. Also, there are the aforementioned problems to worry about, as well.   First, the squad-based action of the original games simply doesn't translate well to the PSP - or at least not in D-Day. This has less to do with thinking through a tactical situation and everything to do with how players control themselves and their squad. Since there's only one analog stick on the system, it's difficult to keep an eye on surroundings while engaging enemies in heated gunfights. The game does include the situational awareness view, which offers a birds-eye view of the action, but this only helps coordinate tactics. Surviving can get pretty difficult when actually running around the battlefield while struggling with squad commands and a funky control scheme. D-Day offers two different schemes, but neither works all that well.   As such, all but the most experience players will die constantly. But thanks to a handy-dandy checkpoint system, that's never really an issue. Brothers in Arms is a challenging series to master, both on PC and PSP. Fortunately, the save system lets a player beat sections of a stage without too heavy a penalty when death does occur. But the secret to not dying is understanding that D-Day is not Medal of Honor Heroes - running into the heat of battle will only result in premature death. That's where D-Day's cover mechanic comes into play. It actually makes for interesting firefights because the game makes it almost impossible for a player to take the Rambo route - it's necessary to think ahead.       In short, players need to use their squad to suppress enemies. This opens the door to various flanking maneuvers the player can then carry out while the enemy is confused and huddled under cover. It's easy to see when an enemy is suppressed thanks to a red circle floating above their heads - a nice touch given many of the game's environments get rather dark.   The only problem with this 'suppress and flank' dynamic is that it tends to get a little old after a while. Players can get through many of the game's encounters by doing the same thing in exactly the same way. Maybe this would be fine if the game in general progressed smoothly, but it doesn't. Where players could execute finely tuned strategies and engage in dynamic firefights in the PC original, the PSP version offers an experience far less refined. It still works on a fundamental level, but it's simply not as fun as it used to be. Players will struggle with the controls and camera every bit as much as with the Nazis they're trying to kill.    The game also has a few AI problems, too. Most of the enemies in D-Day seem content to get shot in the face and not do too much about it. It's strange to say a game with poor AI can actually be difficult, but that's the case here. But that's beside the point. It would have been nice to see enemies react appropriately to adverse situations like they did in the PC games, but that really doesn't happen all that often. And finally, the game's visuals are very mixed bag. The game can look downright pretty at times, and at others, muddy and unimpressive. There's a good amount of detail on the soldiers and in some of the environments, but overall, D-Day could have used a little more flair.  Brothers in Arms D-Day could have been a rewarding stint on the battlefield. Unfortunately, sloppy controls and a few AI issues sabotage much of the fun. That aside, a little spit and polish would have gone a very long way. The multiplayer modes, while lending the package some longevity, still suffer from the same problems. Finally, it would have been nice to see more original content appear in the single-player campaign.", "date": "Jan 17, 2007"}