{"name": "Phoenix Wright: Ace Attorney - Justice for All", "name_review": "Phoenix Wright Ace Attorney: Justice for All Review", "ref": "https://www.ign.com/articles/2007/01/18/phoenix-wright-ace-attorney-justice-for-all-review", "text": "Phoenix Wright, Capcom's own Perry Mason, burst onto the North American scene as a Nintendo DS product. Though the character enjoyed an extremely fruitful life in Japan in at least three Game Boy Advance titles prior to his US premiere, Capcom cautiously waited it out and gave the lawyer his English debut on the dual-screen handheld.The company also cautiously released the first game, Phoenix Wright: Ace Attorney, as a limited manufacturing run that couldn't keep up with the demand of the product once word got out that the adventure was actually a halfway decent one. That success gave Capcom the thumbs up to not only send the original game into remanufacture a few months after its release, but also give the guy a second ~season~ of episodes for 2007.Phoenix Wright: Ace Attorney -- Justice For All is ~more of the same~ so all of the original game's quirks (specific puzzle solutions, illogical judicial system) stick around for the sequel, but as do the fantastically written, engaging storylines.For those that missed out on the original game's release, Phoenix Wright, as his business card suggests, is an Ace Attorney willing to put everything on the line to prove innocence and guilt in a court of law. Capcom's design combines the court room drama of LA Law with the energy of over-the-top anime -- almost going to extreme ~Street Fighter~ styles to pit prosecutors and defense attorneys in a battle. The game exaggerates so much in the court room that you almost expect to hear ~Round one...fight!~ at the start of a case.The game design harkens back to the old-school computer days of point-and-click adventures, which is definitely a genre that's fallen by the wayside as the industry's moved forward. Unfortunate that it's happened, so it's nice to have Mr. Phoenix fill that void.I think it's important to note that, even though this game is technically a sequel, Phoenix Wright is a standalone product that doesn't need the first game to be played before enjoying this one. Though you'll stumble upon a couple of plot spoilers since the game makes reference to past experiences that happened in the original Nintendo DS game, this follow-up has been designed to get you into the courtroom action right away without confusing players will all of the characters from the first game in the series. How'd they do that? By giving Phoenix a case of amnesia right before he enters the first trial in the game. A little goofy, sure, but overall it's a pretty clever start that fits the whole soap opera drama.This game is the Nintendo DS equivalent of ~episodic content,~ a practice that shouldn't be unfamiliar to anyone who's played a Capcom game in the past. The publisher's been known to milk a handful of SKUs using existing handheld technology: we got multiple Mega Man Battle Networks and Mega Man ZXs on the Game Boy Advance, and it looks like Phoenix Wright's the next Capcom recycle victim. So even in these new situations you'll recognize the same look and feel, you'll recognize reused art assets and locations.Very little's been added to the game design, apart from the inclusion of the Psyche-Lock, which is, essentially, bringing the courtroom mechanics into the secondary ~investigation~ portions of the game design. This Psyche-Lock addition definitely gives the player a bit more to do, but it's not a drastic inclusion and it doesn't change much from the previous game.The Phoenix Wright design definitely excels thanks to the excellent writing of Capcom's North American localization team. Some might groan at the insane amount of text that's in the game, so much so that you could easily put this series in the ~interactive novel~ category. But because each of the four chapters in Justice For All have been written so well with such enthusiasm and personality, they're hard to put down. The localization team is clearly at the whim of the Japanese team to construct the game's script, however, so you'll find gaping logic holes the size of a Winnebago in some chapters, and the judicial logic in the game -- while trying to be funny in some cases -- sometimes ends up frustrating because the characters are ignorant boobs half the time. It's also a little disappointing that the first case resorts to the ever- clich ~This man is left handed!~ evidence, but for the most part the cases are pretty original, and are a satisfying trip when you've accomplished your cases' tasks. But, of course, we're down to the same problem of this game that we had with the previous Phoenix Wright: the extremely linear design. It's just the nature of point and click adventures: you're simply poking down a set tree structure to get to the final solution. The puzzles will throw some tough curves at you to ensure that you won't be able to win simply by tapping blindly around the environments, but there's nothing put into the stories that encourage straying down a different paths. There aren't any dead ends and there aren't any rewards for doing anything other than heading through the strict tree structure of each case. It'll certainly take several hours to complete each case, and even more if you struck out against the prosecutor, witnesses, and the judge since you'll have to restart from the previous save point to try again.The original Phoenix Wright game was, at the very least, a really good read...like an interactive novel for your Nintendo DS. And it's the same for Justice for All -- this sequel is another fun, interesting, and engaging group of cases done in the same style and interface as the original Phoenix Wright, so if you were one of the thousands who went ga-ga over the original 2005 release you'll be happy to continue your law career in this follow up. And if you haven't played the original the sequel's been designed for you as well. It's admittedly hard to ignore the rigid structure as well as the gaping and slightly frustrating plot flaws, but it's also hard to hate Phoenix Wright because of them.", "date": "Jan 18, 2007"}