{"name": "NCAA March Madness 07", "name_review": "NCAA March Madness 07 Review", "ref": "https://www.ign.com/articles/2007/01/18/ncaa-march-madness-07-review", "text": "School pride.  Love of the game.  Athletes elevating their game when it counts to push their team to victory.  Few sports reach the fever pitch that college basketball can summon from colleges and universities around the country, especially as their favorite team strives to make it to the Big Dance. The unpredictability of Cinderella teams earning miraculous wins and ranked teams crumbling under pressure is just part of the magic behind the yearly event that fans know as March Madness. Halfway through the season, EA Sports has just released their latest installment in their college basketball franchise, NCAA March Madness 07 for the PS2. However, while the 360 version of the game makes a large step forward in terms of AI, presentation and gameplay, the current gen version of the game languishes with minimal improvements and issues that barely make the title enjoyable for sports fans.   If you've seen a hard fought basketball game, like the recent triple overtime matchup of the Cowboys of Oklahoma State against the Texas Longhorns, you know that the game is based around momentum and the flow of the game.  Just about any play can be a difference maker and any particular player can elevate their game and become the key to victory.  March Madness tries to capitalize on this with its two-tiered momentum system.  The first tier of the system is the run and momentum meters, which literally feed upon each other to establish the general excitement level of your squad.  As you start making consecutive buckets and denying your opponent, your run meter will jump up.  This, in turn, escalates the level of momentum that your team and your home crowd feels during a game, getting your team members hyped up while they're on the court.  In fact, you may hear some of your fans start chanting more as your momentum builds.    That leads me to the other aspect of the momentum system, which is the Go-To-Guy feature, a system that replaces the Senior Leadership mode present in March Madness 06.  Instead of designating one player who will be your Senior Leader throughout the entire game, players can pick and choose between a floor general, a senior leader or a star athlete. Once your momentum meter is full, you have the opportunity to trigger this feature and boost your squad's skills on the court. This means that passes are much more accurate, shots fall a bit more easily than before, and defense is a bit stronger. There's a bit of a strategic aspect to the Go-To-Guy feature, because you aren't forced to trigger it as soon as you fill the momentum bar.  Players can hold onto the feature until they need it, such as the final minutes of a game or equalize the surge that an opponent tries to make on the court.   However, once you look past some of the minor improvements, you'll run into a number of gameplay issues. For instance, calling plays does work well, and you can establish your offense or defense in various plays at any point in time.  However, the game can sometimes exhibit moments where your squad's recognition of a new play takes a few seconds before they react and adjust to the new set, which can be disastrous on defense and impractical on offense.  Even stranger is the fact that the computer AI will sometimes not react or adjust to plays; in fact, during an All-Conference difficulty game, I ran the same play during an entire game without noticing significant adjustments on the defensive side of the ball.     The AI can sometimes be skittish as well.  While using the Lockdown Stick will inevitably result in turnovers or poor passes, you may find that even star players on the opposing team are surprisingly more susceptible to a half court trap than you'd expect.  I even noticed some players from top ranked squads preferring to run out of bounds instead of fight their way through some situations. Apart from some AI quirks, a few issues from previous versions of March Madness return in this game as well.  For instance, players will still make layups from behind the backboard or find their arms phasing through the glass as they go for a dunk.     Perhaps one of the stranger problems with March Madness 07 is the inaccurate fatigue system within the game.  By default, it's turned off, but even with healthy adjustments, it's extremely difficult to find the proper balance between an accurate representation of athlete exhaustion and superhuman stamina.  Either the teams on the floor don't get tired at all, which reduces the need to sub them out (apart from foul trouble), or they're drained too quickly, with stamina bars that don't represent their actual energy levels.  This is definitely something that needs to be improved on, and as long as you take the odd fatigue levels with a large grain of salt, you may be able to look beyond this weird flaw.   If you've played the Dynasty mode from previous March Madness titles, you're probably well versed in the various activities that you'll engage in as the coach of your favorite team, such as recruiting new players, managing NCAA infractions, and preparing for upcoming games. While the gameplans that you devise for upcoming games are still too generic to prepare an adequate defense against certain teams, armchair coaches now have the opportunity to test their skills against the computer with the new Sideline General mode.  Instead of running up and down the court, you're in charge of the X's and O's as you send in plays, manage substitutions and designate your Go-To-Guys.  While it's a decent idea, it doesn't go far enough.  If all I'm doing is running plays, I want the opportunity to draw up specific sets to isolate a team's best shooter and keep them from snapping off a trey on the perimeter. I want more control isolating specific players on opposing teams with my better defenders.  While it's a good idea, it comes across almost like a demo mode or computer run simulation instead of a game feature.    While the visuals of March Madness 07 still look good for the PS2, the game engine is definitely starting to show its age.  Some mascots have extremely blocky faces and bodies, which detracts from their appearance on the court or during cutscenes.  Speaking of cutscenes, many of them drag on for far too long.  If I manage to draw a foul, I shouldn't watch my player flop on the ground, then get up and celebrate, then chest bump with a teammate, and finally watch the other teammate brush off his shoes.  If this was done in a real game, you better believe that a ref would call a technical foul there. However, many of the other animations, such as the players being defended with the Lockdown stick, running through various screens or calling for the ball look quite nice.    The sound is generally good, with chants and the crowd definitely coming to life during key moments and quieting down when the home team is playing poorly.  The weak link in the chain, however, comes from Nessler and Vitale.  Don't get me wrong, their dialogue is generally good and for the most part, they try not to repeat the same lines over and over.  The largest problem is that they'll break out a line at the wrong time.  Nessler's mentioned that I've taken a jumper when I've just finished dunking over an opposing player, and talked about poor ball handling when I've passed the ball around to players without any turnovers.While the 360 version of March Madness 07 does a lot of things right for the college game, the current gen version of the game falls short.  The largest strike against the game is the minimal improvements to last year's formula while not fixing persistent issues, such as fatigue, animation clipthroughs, and questionable AI.  While it's obvious that more attention is being focused on the next-gen versions of the game, if there does happen to be a March Madness for 08, let's hope that some of these generic issues are solved.", "date": "Jan 18, 2007"}