{"name": "Ant Bully", "name_review": "The Ant Bully Review", "ref": "https://www.ign.com/articles/2007/01/19/the-ant-bully-review", "text": "With every license in the world out there getting at least one new game to go with the next big movie, television show, or DVD release, we're no stranger to the dozens upon dozens of licensed titles that show up as ~multi-console~ releases; basically bringing the same version of the same game to every possible console, hoping to find families looking for the next step to their children's obsession. Following suit with hundreds of movies before it, The Ant Bully has released a multi-platform adventure loosely based on the film, and while it isn't quite up to par with some of the other licensed titles out there, that won't stop younger gamers from picking it up, and so Midway has added Wii controller support to the game, added a few quick tuitorials, and look to make a quick buck off the Ant Bully obsessed.     The Ant Bully follows a very familiar formula to deliver a more simplistic adventure for young movie-going gamers. The story follows Lucas ~The Destroyer~ just after he is transformed to ant size. Just like the movie, Lucas will have to learn the ways of the ant in order to be returned to his original form. You see, Lucas, much like any other well-to-do kid out there, was fond of wrecking ant hills, and in the world of The Ant Bully, actions like that are the greatest ~no-no~ of all. As punishment for his crimes, Lucas must now go through tons of entertaining activities in order to go back to his previous life. Why would he want to go back after getting to beat down beetles and using ant telepathy? Who knows, but that's just the way it is. In order to complete the necessary missions, Lucas is outfitted with various weapons such as a wooden staff, larva silk squirter, dart bow, and seed bombs. Not too shabby.   After a quick introduction to the world, players are left to pretty much fend for themselves in the colony. There are multiple areas to acquire new missions, though in an odd move the majority of the game is still linear, allowing only one mission choice at a time. As the game progresses there is a bit more freedom to the design, but for the most part The Ant Bully allows for free-roaming as a break between a pretty straight-forward design. In another unusual move, the introduction to the game offers no tutorial stage, so while the opening moments of the adventure are simple, they don't describe basic movement or control until a bit later; a peculiar design choice.   That's what you get for kicking ant hills. Rather than defaulting gameplay to the normal hop 'n bop style we're used to, The Ant Bully combines familiar play mechanics from more high-end adventure games such as Beyond Good and Evil and the Zelda franchise. The controls are very unusual for a licensed game, having Lucas jump and climb automatically depending on his surroundings. In fact, aside from context-sensitive situations (which use the A button) and weapon management, nearly all the navigation can be done with just the analog stick. It's a bit to use such a unique gameplay format, especially when offering no tutorial mode at the beginning, but it's also intriguing to see developers try new gameplay mechanics on licensed games. Not only does player movement lend itself to larger-scale adventure games, The Ant Bully actually uses Z targeting for lock-on attacks. That's right; a licensed game is making use of Z targeting. Simply pull the L trigger and Lucas locks onto the nearest enemy, focusing only on the intended target when moving, strafing, and dodging. The camera even goes into a mock-letterbox mode when lock-on is being used.    Unfortunately, The Ant Bully most likely didn't have the time or funding to create a game with the depth and polish of a full-fledged adventure game, and the execution suffers because of it. While some areas are very entertaining, specifically those based around combat, the majority of the game is filled with tedious fetch-quests. Whether it's seeking out parts for a new weapon or gathering items for food and supplies, players will be subjected to level after level of ~waypoint chasing~ gameplay. In fact, the game is actually very difficult at key points as well, as players will have to gather or protect multiple items from enemy bugs, and losing a single item means the entire mission (which can be up to 20 minutes long at times) has to be replayed. Players will be left with a game that appears to be solid, but is full of little disturbing nuances that will definitely pile up quickly.    Things get a bit worse on audio side as well, as the game suffers tremendously from sloppy acoustic presentation on nearly every front. While the game isn't amazing graphically, it does hold its own, offering strong character animations and a ton of vivid environments. When it comes to the sound design, however, the game simply falls apart. Recorded VO is a mess, overlapping, cutting off, and doubling up constantly during gameplay. Even during the extra content trailers (which were really just advertisements for upcoming licensed games) the audio mixing was horrendous, having the in-video audio nearly muted in comparison to the normal game. There's no reason someone should have to pump the volume on their TV just to watch a few extras.    Bringing it to Wii  As with all next generation launches you're going to get a few games that, quite frankly, don't live up to the title they're given.  It happened with games like Gun and American Wastleland on Xbox 360 - hardly ~next gen~ in any way, shape, or form - and it's happening again with Wii titles.  For Ant Bully, the team essentially took the existing GameCube version of the game, went back into the code, and created a simple - yet still functional - control scheme centered around the Wii remote, and to be fair, it actually works quite well.  Players control Lucas with the analog stick of the nunchuk controller, attacking with either motion on the Wii remote or the tap of the B trigger.  As with the GameCube version, the A button is used as a context-sensitive action button, and camera control has moved from the GCN's C stick over to nunchuk tilt.  When powering up for a stronger attack, players can hold the B trigger and then swipe horizontally or vertically with the Wii-mote depending on which special they want to pull off.  Overall the controls work fine, but they don't really add anything to the game that couldn't already be achieved previously.   As for the game's presentation, nothing has really changed from the GameCube version.  The game still runs in 4:3 and 480i (highway robbery), and the graphics are already beginning to show their age.  As the only major add-on to the game, action tutorials pop up whenever a new motion is learned, and while these lessons will be helpful to younger players they can't be skipped, and offer only text with a running video in the background.  No added VO, and no test to see if the player actually retained what was just shown to them.  It isn't a huge problem, as the game's controls are pretty intuitive anyways, and the same on-screen prompts will still come up for lifting and interacting with items, but the game does show all the tell-tale signs of being a quick port with such simplistic tutorials.  As a total package, The Ant Bully is a mix of surprisingly good and atrociously bad. While the gameplay is pretty entertaining at times, borrowing a few design elements form some of the best adventure games out there, fetch quests still get in the way of an otherwise amusing escapade. Graphically the game holds its own, though theres really nothing that puts the effort above and beyond other licensed titles, and absolutely nothing was done to improve on visuals for the Wii version. The audio, however, seems unpolished and unfinished, making The Ant Bully extremely annoying to not only the gamer, but anyone else in the general vicinity of the TV. Combine that with repetitive gameplay and a story mode that takes only a few solid hours to wear thin, and youve got a licensed title thats better left for rentals than a purchase. If licensed gaming is essential in your household, youre better off saving the cash and waiting for something better to come along. The Ant Bully has its entertaining moments, but the bar for licensed games is slowly rising, and this overall product just isnt up to par.", "date": "Jan 19, 2007"}