{"name": "Pirates!", "name_review": "Sid Meier's Pirates! Live the Life Review", "ref": "https://www.ign.com/articles/2007/01/23/sid-meiers-pirates-live-the-life-review", "text": "When we put together our Top 100 Games of All Time list way back in 2005, Sid Meier's Pirates! sat confidently at number six. In our estimation, only two Mario games, one Zelda title, Tetris and Sid's own Civilization III have ever bested the classic adventure romp. The game first pulled anchor in 1987 and saw two overhauls in later years on the PC, first in 1993 with Pirates! Gold and then 2004's remake with Sid Meier's Pirates!, which also saw a release on the Xbox.   The franchise has now set sail on the PlayStation Portable with Sid Meier's Pirates! Live the Life. The game is something of a mix between the PC and Xbox versions, bringing back some of the features that were stripped down for the console release, while also tweaking some of the PC's aspects, like sneaking into town. The resulting game is a classic in the truest sense of the word, a title that adheres to everything that we've loved about the franchise for roughly 20 years now. The port (get it?) did take on a few rough edges in the translation, but on the whole, it's an experience that's not to be missed.    For those who have never played Pirates! on any of its released systems, you've missed out on one of the most open-ended sandbox games that's ever been released. You begin a career (of which you'll have many) by choosing your starting year, difficulty and allegiance, either the English, Dutch, French or Spanish. Most every action you perform will alter your standing with one or more of these countries. Attack one of your enemies and not only will your country begin rewarding you with a new rank, some loot and maybe even some land, but the attacked country and possibly even its allies will turn against you.   Once a country has you on its bad side, its ships may begin attacking you at open sea and it may block your entrance into its towns. Anger a faction enough and its town may even open fire if you approach its vicinity. One of the game's coolest elements is that the ownership of towns can and will change over time. You can attack and take them over for your own country, and the computer will fight amongst itself over time. Indian tribes can also take over villages, and rogue pirates can attack and pillage towns and leave them empty.    While this sounds like Pirates! is based entirely around battles, that's not the case at all. You can make a lot of money by trading goods amongst towns or selling off booty that you've picked up from other ships. Treasure maps and the like will make their way into your hands, and the governor's daughters are always looking for a dance partner and even husband. Should you have an aversion to open warfare, you can make an entire career out of simply trading goods and looking for lost treasures.   The most important aspect of any game of Pirates! however is the management of your fleet and crew. You can pick up new seamen by either taking some on after winning a ship battle or by recruiting them at a local tavern. If you win a battle without sinking a ship you can add that to your fleet, though you need to manage your total crew count with the required hands for each ship, possibly leaving you with a small crew on your lead battle ship. You also need to make sure that your crew stays happy, and the bigger the crew, the more likely they are to become upset with ~the man~ (a.k.a. you) and attempt to take him down (a.k.a. mutiny).    Pirates! can arguably be called a collection of mini-games. Each of the actions, like ship battles, sneaking into a town, swordfights and such, are reasonably basic if not strategic, making it a very easy game to get into. You'll need a lot of skill for many of these things at the highest level, but this is where most of your notoriety will come into play.   While all of these things are rather simple, most all of them were implemented almost perfectly in their original design, adding up to make the game larger than the sum of its parts. Should a number of these have fallen short in the PSP port, especially the bigger ones like swordfights and ship battles, then the game would have come apart at the seems. Luckily, Full Fat did a mostly great job in keeping them very much intact and most of them are identical to their PC counterparts.    Swordfights, ship battles and general navigation work perfectly with the PSP's controls as these are more action-oriented tasks, and each of them work exactly as you'd find on the PC. Most of the towns and their various buildings, like the governor's mansion, tavern, shipyard and such, all work exactly as they do on the PC as well. However, these menus (as you generally just manage things) leave something to be desired here as they're just text options and don't offer the flash or presentation that we had assumed we'd find on the PSP. For instance, while in the tavern all you get is a cheap-looking line of text at the bottom of the screen that tells you what you're selecting. Sure, the place looks nice, just as it did on the PC, but in that case you were using the mouse to select who you wanted to talk to so on some (very) basic level it felt like you were exploring the tavern. Here, you're just cycling through menu options and it feels somewhat cheap.   Sneaking into towns, which was a new addition to the 2004 remake, is a little disappointing as well as you don't have complete control over your character's whereabouts. Instead, you move him between boxes, from the center of one square to the next. You can't see them, but they're there. When you move to one, your character has to move all the way into it before he'll come back, should you see a guard and want to quickly hide. This makes it a little less action-oriented, which is odd considering that the PSP is a more action control-friendly device.   The dancing also has seen a change, though it's not necessarily for the better. Instead of having to watch your partner's hands, a directional cue will scroll across the bottom of the screen and tell you what to press. The problem is that it doesn't appear until midway through the screen, so it's more of a reactionary thing than a timing one. It's not really any worse, but it's not better, either, and just makes you look at the bottom of the screen rather than the dancing.    Finding treasure has been improved here. Whereas the Xbox port had you automatically find treasure if you had a map without the need to navigate on-foot at all, the PSP game sees land travel return along with the new dangers of booby traps and wild animals that will eat your crew alive. It's the most engaging version of treasure hunting yet, and we're glad to see it.   Lastly, Pirates! on the PSP also includes an Ad-Hoc multiplayer mode for up to four players with roughly a half-dozen maps. It's rather simplistic but it can also be a great deal of fun. If you're really into the game's ship battles, as you should be, this can prove to be some good fun. Just don't rely on the PC bots to put up a realistic challenge as they like to run in circles and crash into land while also landing perfect shots. At least they're there to fill out the ocean.Sid Meier's Pirates! Live the Life is a really good port of an absolutely classic game. It's not perfect by any means, as sneaking into town and some of the presentation isn't quite as PSP-friendly as we'd hoped, but everything that makes Pirates! what it is is here and in fantastic form. The most important elements, like ship battles, exploration and such are identical to what you 'd find on the PC, which is really what matters. If you own a PSP, head to the nearest port and hand over some booty for this one.", "date": "Jan 23, 2007"}