{"name": "Mr. Robot", "name_review": "Mr. Robot Review AU", "ref": "https://www.ign.com/articles/2007/01/24/mr-robot-review-au", "text": "We hear an awful lot about vastly increased team sizes and rising development costs in the game industry these days. The move to next-gen consoles and ever more sophisticated PC hardware seems to be sending developers and publishers alike into a spin. Big teams are making big games; striving for that mega hit that will not only recoup costs but make money.   There is, however, another way. Poke around online and you'll find a busy indie development scene that's ready to capitalise on a number of crucial modern technological confluences. Firstly, digital distribution of game content has well and truly arrived - not just through PCs but consoles as well. Secondly, the Internet is not a top down system. If you create something cool, word of mouth - as opposed to advertising and point of sale presence - can get people interested. Thirdly, the Net is so huge now that it's created the concept of mega-niches. In other words, even if you create something that doesn't interest the mainstream, it's still possible to find a sizeable audience.   Take Mr. Robot for instance. It's barely a 30MB download, and eschews next-gen production values for a look that would have been at home on an early 3Dfx PC. Its gameplay mechanics are also resolutely old school, with room-based puzzles, party building, turn-based combat and levelling up of abilities, but we honestly believe it will find an audience, because it has plenty to offer. And it's cheap.     Viewed from a fixed isometric perspective (told you it was old school), Mr. Robot casts you as Asimov, a Z Class General Purpose Servitor robot aboard the Starship Eidolon. The ship's destination is a planet called Prime, and its cargo is a team of scientists and engineers that will be brought out of cryo-sleep to set about terraforming and colonising Prime. For now though, it's just the robots and a whole heap of sleeping humans, so when a number of bots start going haywire, and the sentient shipboard computer HEL-9000 starts acting strangely, well, there's obviously something afoot. Honestly though, anyone who creates a sentient computer called HEL-9000 then gives it control of an entire ship is just asking for trouble.   Mr. Robot is not a game that's going to knock you off your feet from the first screen. It's far more of a slow burn, drawing the player in with what appears to be a fairly straightforward game of room-based puzzles and platforming, before introducing its battle mechanics and RPG elements.   To that end, the game takes place in two distinct realms. The first is the sprawling layout of the ship, where you'll explore countless rooms chock full of crates to push, pools of corrosive liquid coolant to avoid, Energon pods to collect and characters to talk to. You'll also encounter robots on the fritz, whose basic AI routines you'll need to observe so you can steer clear of them; being a general purpose robot you can't take them on. This part of the game is very much about finding a way through each area, whether you have to build a makeshift set of stairs to access a walkway, or jump across a series of platforms.     Controls are very straightforward. Move your mouse around Asimov to change the direction he's facing (he can move in eight directions - it wouldn't be old school otherwise) then hold down the left mouse button to move in that direction. You can stop to change direction or simply keep the mouse button held down as you move the cursor around him, introducing a slight sense of inertia to movement. Hold the right mouse button to jump, hit shift to open storage lockers and interface with computers, and use the control key occasionally for other ancillary functions. And that's it. Simple but effective.     In addition to exploring the ship, Mr. Robot also has a distinct RPG component that takes place entirely in virtual worlds. By Ghost Hacking a robot or terminal, the game switches to a grid-based representation of the computer's system, where you can choose your path along various nodes to access CPUs, memory and other components. Every few moves along the digital highway you encounter enemies, in this case corruptions of the system, viruses and the like. At this point you enter into the battle screen - a turn-based fight to cleanse the system.   This is where Mr Robot gets really interesting, and introduces a whole host of RPG elements. Each ghost character has stats in the categories of energy, power, damage, defence, resistance and dexterity. Capabilities are enhanced in a couple of ways. Firstly through gaining EXP by defeating enemies during ghost hacks, and levelling up. Secondly through equipping ICE (Intrusion Countermeasures Electronics) abilities. Asimov has five slots - one offensive, where he can equip ICE Breakers such as viruses that can be launched to destroy an enemy, and four defensive slots: protecting the central operating routines, mind, input/output and firewalls respectively. Anything that you equip will boost a relevant stat, and obviously the further in your get, the more powerful your ICE equips become.   As you level up you'll also unlock new programs to run during battle. These are essentially your ranged and healing moves, and use up power (aka mana) to execute. Like all RPGs of this ilk, you can also use items to attack or to restore energy/power and there's even a limit break system in the form of the Extreme bar which builds up steadily throughout battles.     Of course, that's only one part of the battle picture. A short way into the game, a foxy femme-bot named Zelda is destroyed by a rogue automaton, but not before Asimov quickly downloads her memory (no doubt taking a sneaky peak at her subroutines as well), storing it on his own system. From that moment on her ghost becomes part of Asimov's party during battles, and as the game progresses you're able to keep expanding your party, equipping them with ICE abilities/stat boosts and levelling them up.   Like other games in the genre, the battle gameplay is very much a treadmill, but successfully lures you into its embrace, particularly because there's a good balance between the exploration of the ship, with its associated puzzles and light platforming, and the virtual world battles. What really ties it all together, however, is the simple but charming story and characters. It's charming in the way that many of Nintendo's titles are - the production values are deliberately retro. There's no spoken dialogue, for instance, with all conversations conveyed through pop up profile boxes. Despite this, you can't help but care, not only for Asimov and your party, but for the humans in stasis as well. It's a clever world; as much a struggle for power and control as any human system, with Asimov as the nave bot that could, caught up in the madness, trying to do the right thing.   Throughout the game sci-fi heads will pick up on a number of references to the genre. From names such as HEL-9000 and Asimov through to mention of the Prime Directive, and even core gameplay mechanics - ICE is a term popularised by William Gibson in Neuromancer, while Ghost Hacking was extensively explored in Ghost in the Shell.     The visual style suits the game to a tee, too, and like so much else in this game, is really reminiscent of an older school of console RPG design. It won't give your PC a workout, but looking behind the simple textures and grid-based rooms, the design is certainly charming and serves the game well, with some great character design in particular.   There are a few minor issues holding Mr. Robot back. The isometric perspective, for one, can be a little misleading, and the map system isn't the best - it could easily be clearer on the HUD, and more useful in the pause screen. The ghost hack battles are a little clunky animation and pacing wise, and out on the ship some gamers may find the puzzles lacking in challenge.At the end of the day, Mr. Robot is not a title to go head to head with major PC releases. It's a game that you'll play and enjoy on a budget, and a great example of what indie gaming is all about. It won't change your life, nor does it venture too far from the conventions of the genre, but this could well be a sleeper hit.Want to discuss the review? Hop on over to our forums. Oh, and you can buy the game at Moonpods site.", "date": "Jan 24, 2007"}