{"name": "Hotel Dusk: Room 215", "name_review": "Hotel Dusk: Room 215 Review", "ref": "https://www.ign.com/articles/2007/01/25/hotel-dusk-room-215-review", "text": "Anyone who's been gaming with the Nintendo DS for more than a year will probably remember Trace Memory, a hit-and-miss mystery developed by Japanese studio Cing that  masqueraded as a touchscreen-friendly point-and-click adventure. That team apparently digs the interactive novel genre as Cing has brought forth its second one on the Nintendo DS. Hotel Dusk: Room 215 follows a lot of the formula and borrows a lot of the same elements of Trace Memory, but in a package that's far more mature almost to the point where you'll wonder if you really saw ~Published by Nintendo~ on the packaging. The almost overly extensive, wordy narrative and slow pace are a little hard to ignore, but hey -- this game's supposed to play out like a good detective mystery. And it indeed does. Hotel Dusk is a great read even if it takes a while to figure out what the heck's going on.   Hotel Dusk: Room 215 puts players in the role of Kyle Hyde, an ex-cop that's hung up the badge and has taken up a freelance sleuthing gig. This one's led him to a tiny little town and an even tinier hotel called Hotel Dusk. Kyle's got his own baggage, including the hunt for his ex-partner who he believes isn't as dead as he should be. But at Hotel Dusk, an interesting web of mystery perks up, which starts with the revelation that someone else with Kyle's name stayed at the hotel just months before. Before long you're bumping into a mysterious, mute girl, a quiet, elderly lady, and a blast from the past colleague from Kyle's time in the force. All this happens while staying in a hotel room that's believed to grant wishes to people who spend time in it.   Absolutely, positively do not play this game if you're not fond of reading in videogames. Hotel Dusk's dialogue is incredibly extensive, and requires lots of interaction of the player to explore several conversation trees. Some conversations can actually end the game if you pick the wrong question or answer, so it's important to pick up on the different characterizations so you know just how to handle the interaction. The wordy dialogue is easily Hotel Dusk's biggest hang-up so you should know ahead of time what you're getting into. But if you've trained yourself with the previous two Phoenix Wright games from Capcom then you've got nothing to fear.   The game's tale unfolds through a very old-school point-and-click adventure style. It's a genre that's slowly died out over the years, but with games like Phoenix Wright hitting the scene it's a genre that's strengthening in numbers on the Nintendo DS. In Hotel Dusk players have a little more freedom than Capcom's lawyer series thanks to a more open environment and more things to do. You travel from area to area by sliding the stylus around on the map, with the other screen showing Kyle's view in full 3D. If you manage to enter an area that can be inspected, clicking on the magnifying glass icon will shift to a closer view to see and interact with items.   Hotel Dusk takes a cue from Nintendo's Brain Age and presents its storyline just like a storybook, going so far as to require players to rotate their systems and play the game in vertical fashion. Because the game's played entirely with the stylus this vertical orientation works. And yes, it's both righty and lefty friendly. The story is truly engaging even if it's a little cheap in forcing players to accept gaps in the plot. Even though you'll play as Kyle, you're never really him -- his early flashbacks force players to fill in the gaps to figure out what he's remembering. The tale's handled far better and far more interestingly than Cing's Trace Memory, which sort of collapsed towards the climax. Even with the plot issues, Hotel Dusk's story is solid all the way through.      Like Trace Memory, scattered throughout the hotel are instances of ~puzzles~ where players will have to figure out certain tasks before they can move on. In fact the designers tease players by making the first puzzle, literally, a puzzle. More specifically, a jigsaw puzzle. The puzzles get a little trickier and require a bit more thought the deeper into the tale you go. None stick out as unnatural, though some of the tasks are slightly silly and tedious...like unwinding a paperclip? Yeah.   What holds things together for Hotel Dusk is its visual style. Though you can see the development team's anime-influence that was saturated in Trace Memory, this story is a lot more neutral with mellow pencil sketch imagery that animates much like a Bill Plympton cartoon or, yes, like that A Ha video from the 80s. The 3D elements are well rendered and blend nicely with the 2D characters. It's a story with a very cool look.Hotel Dusk is a great read with interesting characters and backgrounds, and its visuals compliment the tale nicely. The puzzle elements are much more scattered than Trace Memory -- most of the player interaction is in the dialogue trees and in moving from point to point within the hotel. The game takes a long time picking up pace, but it never really speeds along. It's meant to be an interactive novel, but even so sometimes it's hard not to wish the characters would get to the point just so you can get to the next puzzle. Still, it's a significant improvement over the team's previous effort, and it's a nice revitalization of the point-and-click adventure genre on the Nintendo DS.", "date": "Jan 25, 2007"}