{"name": "NovaDrome", "name_review": "Novadrome Review", "ref": "https://www.ign.com/articles/2007/01/26/novadrome-review", "text": "If you've ever felt the urge to spend money on Xbox Live Marketplace, I don't blame you. Going into Microsoft's Marketplace is very much akin to walking into the greatest candy store on Earrth; it seems like everything is there and you want to but one of eveything. So, it gives me no great pleasure to urge you to stop, but urge you I must. Novadrome, the Buena Vista racing game created by Stainless Games, stinks. It's a big waste of money and time, not to mention winning the non-existent award for most generic, milk toast XBLA game on the system.    When reviewing a game, I often write down my first impressions. I refer back these initial impressions as I get into the review to make sure I don't get off track or balance my later thoughts. I write simple adjectives like ~controls great~ or ~excellent textures~ or ~atmospheric.~ When I wrote down my initial impressions for Novadrome I penned ~putrid,~ ~pointless,~ ~dumb,~ and ~junk.~ Those were my initial impressions. After having played several hours of Novadrome, these words still best describe it.    Buena Vista's game came out of nowhere and was quietly ushered out around Christmas time. Using Twisted Metal Black as a kind of base model, Stainless's game takes the car combat genre and dulls it down to a nice round dome. In the career mode you'll start with two cars, equipped with guns, and a simple mission: destroy as many opponent cars as possible to win points to move to the next round. Guns have limited ammo and replacement ammo must be searched for in the landscape, but gamers can just as easily ram enemy cars to destroy them. Two cars are offered to start with: A faster lighter vehicle and a slower, sturdier model. Progressing through the game into the sixth, seventh and eight rounds, I realized that no cars were unlocked for the first couple of missions and then the ones that were unlocked were no much better than the first two offered. So, unlocking new cars -- and there are up to 20 -- may have seemed like a motive up front, but once unlocked, it hardly mattered.    In the single-player campaign, the game offers 15 arenas to race in and hovers around eight AI players total. The online mode is pretty nifty in that it enables up to eight players to vie online simultaneously. That doesn't mean it's any more fun, but it's nice to see an XBLA game offer that many players online.   There are four main game modes in Novadrome: Career mode, Arcade Challenge, Free Play, and Multiplayer modes. Career offers two basic game types, rally point and destructo mode. The rally point games drop you into a badly conceived, generic landscape filled with Army Men-like robotic soldiers, herds of robotic legs, and cyber-like structures and compels you to chase after rally points that get randomly placed across the landscape. Players earn points for racing through the most rally goals, but they're equally rewarded for taking out opponent cars to snag their points, giving another option to win. This is good since getting all the rally points is not always achievable. And while I have very little to say that's good about this game, I can honestly say the AI isn't easy on you. It's not so smart as it is aggressive, prompting gamers to slam enemies and learn the rally point spawning areas to win. If you're in first or second place, enemy cars will hone in on you like sharks to chum, knocking you from first to fifth place in a second.   Destructo mode is basically a free-for-all deathmatch in which the racer with the highest points (kills) wins. In either mode, if a car is eliminated, it respawns a few seconds later. Just like the rally landscapes, the derstructo mode environments deliver the same ~cyber~ art style that might have been cool in 1998 when cyber meant cool and 3D art design was in its infancy. But now, here, in 2006, this design just looks old, unimaginative, and very much like cookie-cutter, throw-away Costco bin games. The landscapes offer hazards in the forms of gardens of explosives, enemy robots, bumbers, cones, and jumps. Some of these turn out to be helpful, such a wind tunnels, which throw a vehicle ahead at extreme speeds. The career mode essentially switches off between the two modes until you either die of boredom, slits your wrists, or you wait until the following Wednesday, when another XBLA game distracts you from playing this junk heap.   In the end, Novadrome just turns out to be a generic, vanilla action-racer with little going for it. XBLA doesn't offer too many racing games yet, so it's tempting to buy this, but even though it hardly costs anything, it's not worth the time.", "date": "Jan 26, 2007"}