{"name": "The Sopranos Bada Bing! Manager", "name_review": "The Sopranos Bada Bing! Manager", "ref": "https://www.ign.com/articles/2007/01/26/the-sopranos-bada-bing-manager", "text": "It was quite a hullabaloo when Digital Chocolate announced that it was releasing a licensed game at the tail end of 2006. The mobile maker that carved out an impressive niche as the proprietor of unlicensed games had finally ~caved.~ Would their first major licensed release (DChoc has used minor licenses in the past) be as clever and interesting as previous hits like Tower Bloxx or Rollercoaster Rush?   Bada Bing! Manager is based on DChoc's Nightclub Empire simulator. It's not quite a re-skin, but the two games share enough of the same basic mechanics that fans of the previous game will experience a bit of whiplash if they download Bada Bing! Manager. Instead of launching a line of clubs, you have been tasked with running the Bing for Tony Soprano. Instead of hiring DJs, you hire strippers. Instead of hiring a bouncer, you hire muscle. Instead of spinning a record for bonus cash, you water down drinks. You get the idea.   The ultimate goal is to earn respect within the Family, which is measured in the upper-right corner of the screen, next to an itty-bitty Tony head. He smiles and frowns, depending on your performance. Respect is earned by smooth operations, such as keeping cops out and spending money on high-earning affairs like a VIP poker game or a bachelor party for the friend of a friend. The respect meter is tied to a list of goals; this gives the game a little bit of structure. At first, you just want to have enough respect that you're trusted with buying a disco ball. But soon you'll work for the respect needed for the button that marks a made man. The final goal is to install an office for Tony himself, which will set you back $12,000.   To keep bringing money in, you can install a champagne room, hire extra waitresses, and install up to three girls on the center stage. If an undercover cop is detected, hire some muscle to make sure the ship keeps sailing smoothly. To keep the health department at bay, you hire some official's daughter as a hostess. Bribe police to keep things cool. Grease politicians to bring in a higher class crowd. You can even fill the place with some of the serial's more famous faces, Sil and Paulie, by kicking up to them. They're expensive, but once you've given them their taste, they become permanent fixtures.   And that's one place where Bada Bing! Manager definitely succeeds; you're always filling in the blank spaces in the club. You start with a dark club, one customer, and an empty pole. But by the time things get in full swing, you have flashing lights, a trio of sexy dancers, and a bar full of patrons from suits down to greasers. You really are managing the Bada Bing! and for a fan of the show, that's pretty cool.   But the game is just too front-loaded, in my opinion. Money comes too fast. Goals are met too quickly. And I understand the reason for making progression so fast and relatively easy. Sopranos fans that may not necessarily be into games will get pay-offs right away. They keep getting something new to mess around with. (~Hey, I just hired Barbi and these dudes love her!~ ~Hey, I just totally kicked up to Tony!~) But the pacing is off for the crowd that actually digs mobile games. It doesn't take very long to fill the joint, and once you've installed everything and bought your way to being a lieutenant in the Family, there's just nothing left to do but basic maintenance.   The scales are tipped out of whack by the minigame that lets you water down drinks. Once this game is unlocked, it's just too easy to jump in every couple minutes and earn a boatload of fast cash. A mark revolves around a tray of glasses, eyeballs, and 2x multipliers. You have a limited amount of time to tap OK on glasses and multipliers. If you hit an eyeball, you lose your multiplier and some cash. It's actually a fun little minigame, but with just a little practice, you'll be able to regularly earn $3,000-5,000. And then it's a cakewalk to buy up the extra goodies, keep the hostess and muscle on duty, and meet the goals.   DChoc has done a great job with the atmosphere in Bada Bing! Manager. The club looks pretty much like the set. The little dancers are not remotely erotic, but they do wiggle and jiggle for the guys that crowd the stage. The little Paulie and Sil characters that show up after you've kicked up are pretty precise, all the way down to Sil's sharky threads and Paulie's running suits. The presentation underlines DChoc's understanding and respect for the source material, and fans (and HBO) will really appreciate that.  Bada Bing! Manager is not a bad game -- it's just not a great deal for gamers that know their way around a simulator. It's too easy; money flows like water and there aren't enough setbacks to keep you on your toes. But I can see how a casual gamer that also happens to be a fan of the HBO show might enjoy this. They'll certainly enjoy it a lot more than that awful Sopranos Poker released last year. So, is Digital Chocolate's big licensed game a failure? Hardly. They show that they know exactly how to pay respect to the source material and its fans. And perhaps if they get a license where they don't understandably feel the need to appeal to the ultra-casual crowd, they'll create something we can all dig into for more than just an hour or two.", "date": "Jan 26, 2007"}