{"name": "SpongeBob SquarePants: Creature from the Krusty Krab", "name_review": "SpongeBob Squarepants: Creature from the Krusty Krab", "ref": "https://www.ign.com/articles/2007/01/31/spongebob-squarepants-creature-from-the-krusty-krab", "text": "SpongeBob Squarepants has made many stops on the smallest screen in the last few years, from a silly kart racer to a collection of minigame timed to his theatrical movie. Creature from the Krusty Krab trots out SpongeBob and his buddy Patrick for another mobile romp, again opting to go the route of simplistic minigame collection. The game is definitely aimed at the youngest set, but even purposefully pursuing players that may not demand complex game play doesn't mean they'll enjoy anything that manages colors, lights, and a little familiar music.   Creature from the Krusty Krab is composed of only five minigames (the fifth one is unlocked after completing the four-event story mode). Trouble really begins in the first minigame, which tries to go casual with one-touch mechanics. You must guide SpongeBob over a series of ledges by making him jump when he's pointing the right way. (Spongebob rotates all on his own.) You hold down the jump button as long as necessary to get him to leap over the crevices and find the lone ingredients. The rest of the breezy games employ similarly basic mechanics, such as swinging around a cliff in search of Krabby Patty ingredients or tossing a plate back and forth as the two heroes speed through an obstacle course. The last minigame of story mode has you compiling Krabby Patties at the burger stand, peeking at recipes to memorize numbers to jam into the pad before the timer runs out.   The first pass through the story mode is incredibly simple. However, you can replay the story mode over or jump into a single-event arcade room and play increasing difficult boards for the minigames, but without the addition of any new mechanics or things to do, the potential for extended entertainment shrivels like a sea sponge in the sun. The only real reward for playing is the unlocked fifth minigame. You get to control Plankton's massive machine, pressing 4, 5, and 6 to smash houses on the left, center, or right of the brute's route.   The game doesn't necessarily look bad. SpongeBob and Patrick are readily recognizable. The music cues also pretty good, too, such as the creepy variation on the show theme that goes along with the opening sequence and menu.  The fact that I was bored within minutes cannot be dismissed with: ~Well, this wasn't made for you.~ Eight-year-olds are not simpletons -- they like fun video games, too. As somebody that's played vids for well over two decades, I can distinctly remember getting into games that weren't necessarily made for little kids. Even my nephew, who hasn't been in the double-digits for very long, can figure out PlayStation 2 games. Creature from the Krusty Krab just doesn't offer much to do for any gamer, regardless of age or appreciation for SpongeBob.", "date": "Jan 31, 2007"}