{"name": "Sonic the Hedgehog", "name_review": "Sonic the Hedgehog Review", "ref": "https://www.ign.com/articles/2007/02/07/sonic-the-hedgehog-review", "text": "The most common way to die in the ruined city of the future is undoubtedly ~death by lava.~ Or to be more specific, its victims are typically bombarded by attacks from fire creatures or accidentally fall into a pit of liquid hot magma. Try to imagine, for a moment, how unbelievably agonizing that kind of extermination would be. Though brief, the pain would be excruciating before your body went completely numb as your nerve endings melted away from the extreme heat. Seconds later, it's likely that your final dying thoughts would be those of terror, regret, and eventually... nothing.   In other words, it would be a lot like playing Sonic the Hedgehog.   If you hadn't guessed it by now, the famous blue rodent's 15th anniversary didn't go over so well. In fact, the PS3 edition of Sonic the Hedgehog is one of the worst mishandlings of a big-name franchise in recent history. In truth, it's surprisingly difficult to know where to start with my list of complaints since words like ~aggravating, sloppy,~ and ~boring~ don't even begin to describe what SEGA has let loose here. I suppose the best place to start, though, would be with the most recurrent problem of the entire game, and that's with the camera and gameplay controls.    To put it bluntly both features stink. From open to close, the fully rotational camera is a disaster. It gets caught on buildings, trees, and other structures, and will frequently switch positions and angles for no reason at all. Start a conversation with one of the pointless NPCs, for example, and by the time the discussion is over, your viewpoint will have changed to a direction you're not even traveling. This whole practice is disorienting and bothersome and there's no reason for it.   The camera issues also affect action stages. When playing as Sonic himself, the angles change faster than a caffeinated schizophrenic, and when coupled with our hero's already-speedy movement, leave unnecessary deaths as a byproduct. Things are also hurt by the fact that your characters can (and will) get caught on geometry at random intervals, so don't be surprised if you're suddenly stuck on a rock or permanently attached to a building simply because you brushed up against it. Of course, the final nail in the coffin comes from a camera stick that can't be customized (and it's backwards by default). All told, these numerous troubles combine to form a giant-sized Voltron of sloppy gaming.    Again, ~sloppy gaming~ is the best way to describe this monster. Though it's mainly a platformer, Sonic does borrow the hub world idea from the Dreamcast's Sonic Adventure franchise and mixes it with ~ye olde run and jump.~ In one of its few commendable twists, the game offers a number of playable characters and each have their own powers and uses (including high speed stuff from old Blue, telekinesis-driven object manipulation from Silver, and complete vehicle destruction courtesy of Shadow). But just like in other recent Sonic games, this newest foray doesn't mix styles very well. To start, the aforesaid hub world doesn't serve much of a purpose because it challenges you with needless mini-quests to unlock the next action level. They're tedious and slow and the game would have moved along at a much better pace without it. Controlling Shadow and Silver doesn't offer an entertaining reprieve either because their stages run into just as many glitches or setbacks as Sonic's do. The game just isn't fun to play no matter who you assume.   Oh, and load times are awful too -- often taking 15-20 seconds to access a 2-3 second cutscene before using another 15-20 to go back to where you started. This happens constantly whenever any scenery changes are made, and what's even more infuriating is that these brief story points aren't even pre-rendered -- they're just alternate angles of the in-game engine that you were already using to begin with. Did I mention that most of these intermissions we're forced to wait for are only 2-3 seconds long?    Another one of Sonic's problems comes from the visuals. To be fair, the pre-rendered cutscenes do look great and have some nice direction, but once the in-engine stuff kicks off, things start to roll downhill. Characters jitter for no reason, shadows appear and disappear like crazy, and there's an enormous amount of pop-in and other bizarre glitches that scream ~rush job.~ Amazingly, there's a fair bit of slowdown and other framerate hiccups when exploring the hub town too -- sometimes occurring even when there isn't a single character on the screen.   To its credit, Sonic the Hedgehog does try to keep people interested with a number of features beyond the standard single-player game. A two-player tag and battle mode has been included, for instance, as well as multiple character ~Episodes~ and some unlockable extras that you can find along the way. The problem is that there's really no reason to play any of it at length because of the poor camera, bad controls, and a convoluted multi-timeline plot that doesn't really go anywhere.      Sonic the Hedgehog is a mess. While there are a few glimmers of hope early on when players take control of Silver and his cool telekinesis ability, it's quickly realized that the game's design never really capitalizes on it. The remaining character situations (Shadow's vehicle segments and Sonic's traditional platforming) aren't anywhere near as interesting as Silver's, and the whole game has a forced and generic feel to it. Once you saut that winning formula with a rack full of technical problems you end up with one hell of a disappointing game.", "date": "Feb 7, 2007"}