{"name": "SnoCross 2", "name_review": "SnoCross 2: Featuring Blair Morgan", "ref": "https://www.ign.com/articles/2007/02/07/snocross-2-featuring-blair-morgan", "text": "There is a certain gaming nostalgia that comes with playing SnoCross 2: Featuring Blair Morgan. Unfortunately, this is a bad thing: it's the type of nostalgia that forces you to relive all of the terrible parts of the PS1 era of gaming. Oh, you remember those parts, right? Blocky and bland level design; badly-synthesized looping music... A celebrity who agrees to add his name to the game's subtitle in exchange for a check? Yeah, how can you forget the late 90s?   But let's back up for a moment. SnoCross 2 is a budget-priced snowmobile racing title that features the aforementioned Blair Morgan (of course, you would never know it because he looks like all the other characters). The game is the very definition of ~generic racer.~ It consists of a Quick Race mode, Split-screen Multiplayer for two players, and a Career option. Money that is earned in Career mode can be used to upgrade the stats of your snowmobile (sadly they're unlicensed, but they do bear striking resemblances to real models) or buy new gear for your racer (which mainly consists of different colored stripes on clothing). Comprehensive, this is not.    Nonetheless, Career Mode is where most of your time will be spent. It's divided into a series of qualifying and championship races, and each race has some criteria you must meet to continue on. Now, don't get excited and mistake this for ~depth~ -- your goals are usually along the lines of ~win the race.~ This formula is shaken up a tad by a few ~Trick Attack~ races, but you will come to fear these for reasons that will be explained later.   Normal races control exactly how you think they do. X to go, Square to stop, R1 to power slide. When you're in the air, tricks can be pulled-off with Circle and a directional button, which then fills up a boost meter. All of this works well enough, but any enjoyment is immediately killed by the utterly terrible track design. Bland, open areas with random rocks thrown in the middle give way to looping turns that would confuse Blair Morgan himself. Ramps lead into walls, dead ends abound, and some hills cannot be climbed even though hills twice their size are no problem. Everything looks the same, and it seems like the 30+ levels were generated by an unimaginative computer who has a fetish for watching snowmobiles crash. If that's not enough for you, a somewhat cumbersome track editor is also included so you too can construct insipid, boring tracks that make no sense... though, that could still be a step up from what you start with.   ~Trick Attack~ races are even worse. You are given infinite boost and a looping track. The goal is to perform tricks and get a bigger score than the other racers. The main problem with this is that performing tricks doesn't work half the time. It's far too common to launch into the air, push the circle button, and then have nothing happen. And since it's so hard to judge distances in the game, landing a trick is half dumb luck. Get used to seeing your snowmobile land on its side for no reason and then stick to a wall. This is not exactly what you would call ~fun.~ More like ~broken physics.~   There is also a split-screen, two-player mode that maintains a good framerate, but seeing how hard it is to navigate the tracks with a full screen view, cutting the screen in half only adds to the frustration. And if you were a true friend you wouldn't put your buddy through that.SnoCross 2 will undoubtedly disappoint anyone that plays it. I wish I could tell snowmobile racing fans that they could get something out of this game, but no. In fact, the bigger fan you are, the more you will probably be disappointed. Do yourself a favor and track down Sled Storm if you really need a snowmobile fix.", "date": "Feb 7, 2007"}