{"name": "Gain Ground", "name_review": "Gain Ground Review", "ref": "https://www.ign.com/articles/2007/02/09/gain-ground-review", "text": "You wouldn't think to find a strategy game in an arcade. The slow pace, the in-depth intellectual planning, the carefully laid offensives  seems a little at odds with the quick-turnaround play encouraged by most coin-op cabinets. Didn't stop Sega. The company took two disparate concepts and merged them into one, publishing the three-player action/arcade/strategy game Gain Ground in arcades in 1988.   It was inarguably unique. You and up to two other players simultaneously attacked single screens, full of enemies, trying to reach the exit. Victory came through either evading the hordes and making a clean run into each level's exit, or toughing it out and eliminating every bad guy on the screen. A time limit counted down from 200, reminding you that yes, you were playing an arcade game, and if you weren't fast enough you'd be making another trip to the change machine for a fresh catch of quarters.   If it all sounds a bit too much like Gauntlet there, that's a valid comparison  but Gain Ground sets itself apart with its focus on proper character and ability selection. There are 20 different playable fighters to choose from, each with their own rate of traveling speed and attack capabilities. All of them have a weak weapon that can be fired in any direction  a shortbow, a pistol, something like that. But then each is also equipped with a more powerful, but more restricted, secondary fire. These include flamethrowers or grenades, even magic spells, usually slower and held back by the qualification that they can only be launched in a single direction.   The only way to know what character's best for you is to try out all 20, but your selectional quandary is partially solved for you early on. You're limited at first to only a handful of choices, and you'll need to rescue the majority of the others as the game progresses  you'll see them in the levels, little, huddled, helpless creatures in need of escort to the exit. Making contact with one makes him or her follow you. Successfully leading him or her to the exit makes him or her then actively playable.   Gain Ground's port to the Genesis, the version from which this Virtual Console edition is emulated, was compromised a bit from the arcade. You'll only get two players going at once here, for example, and the screen ratio is adjustedly adapted from what was a more vertical monitor in the coin-op machine. Uncompromised, though, is the game's sense of addictive fun. You'll likely be a skeptic at first, seeing the muddied, low-res graphics and quick-port presentation on the front end title screen. But getting into the game is a lot of fun, especially if you bring along a friend. You and your buddy will quickly find a ground-gaining rhythm, pirouetting your player characters through endless assaults of arrows, casting verbal abuse at the screen in hopes that you'll somehow dishearten the rampart-protected archers plaguing you from on high. Gain Ground will likely go overlooked by the vast majority of Wii Shop shoppers, but it shouldn't  this one's a hidden gem of ugly but addictive fun.  Gain Ground's understandably collected a cult following of fans since its Genesis release back in 1991, a large enough group to prompt Sega to revisit the title in 2004 with a PlayStation 2 remake of the design. That release only arrived in Japanese stores, meaning this VC download is the first fresh air Gain Ground has breathed in America since George H. W. Bush sat in the Oval Office. Strategy and action fans should take notice  not of the barely passable presentation or cumbersome graphics, but of the uncommon fun factor found in this mashed-up arcade combo of those two separate genres.", "date": "Feb 9, 2007"}