{"name": "Horse Riding Academy", "name_review": "Horse Riding Academy", "ref": "https://www.ign.com/articles/2007/02/10/horse-riding-academy", "text": "Gameloft's success and vast resources allow it to take chances, whether it's the board game edition of Desperate Housewives or a teeny-bopper horse riding simulator called Horse Riding Academy. Casting players as a teenage girl navigating through three terms at a prestigious equestrian school, players must not only forge a winning relationship with their steed, but also balance relationships with the other students.   Love is indeed in the air in Horse Riding Academy, but it takes a major back seat to jumping gates with grace and poise. In some respects, I'm disappointed that Gameloft did not spend more time and energy on fleshing out the social aspects of the game. The scene is ripe for a teenage soap opera of love and rivalry at a snooty equestrian academy. But you don't have too much sway over the unfolding romance, save for picking the boy deserving of your crush. The rich girl that's set to be your nemesis never poses much of a threat. Rivalries are instead just settled on the track in horse races.   The horse racing elements are solid, but not great. I usually don't like to use the number keys to control characters, but steering my steed with 1 through 9 was infinitely easier (and more accurate) than sticking to the thumbpad of the Sony Ericsson w810i I used to test the game. You press the numbers to direct your horse around the winding tracks set everywhere from neatly groomed fields to parched desert canyons. Some races are about collecting water droplets or chasing bunnies, but the majority requires you to time jumps over a series of gates. You are judged on how well you leap the gate. Depending on how close you are to the gate when you press 5 (jump), you'll be scolded for a bad jump or told your jump was anywhere between good and perfect.   Once you get the timing of the jumps down, you'll earn a few perfects on each track -- typically the third in a string of three gates. No matter how many times I played, though, I never quite got the swing of making jump when riding north. With the camera behind the horse, discerning the proper distance isn't easy. Northbound jump? Nine times out of ten I scored a ~bad~ rating. Hit too many bad jumps in a row and you fall off your horse. Perversely, this was an animation I couldn't get enough of. If watching my princess roll off the saddle and flop on the ground is wrong... you know the rest.   Between races, you get a series of minigames that teach you about grooming and feeding your horse. When feeding your horse, you use a panel to discard gloves and boots that were inhumanely mixed in with the lettuce and carrots meant for the horses. To clean hooves, you play a take on Hexic. To brush your horse, you play a little number matching game. The minigames are not that deep and I was disappointed that they're so orphaned from the main quest. Why not have the horses listen to you better if you groom religiously throughout a term? Or feed your horse a great meal the morning of a race?   I was also surprised by the brevity of Horse Riding Academy. The three terms fly by because none of the races are very long. Before you know it, you're finishing up the last few races in Japan, following a rabbit to a secret wishing tree that figures into the love story. It's just too short to be considered anything but a bad value for your download dollar.   Horse Riding Academy is actually a cute little game to look at. The backdrops are quite colorful, from the sakura blossoms of Japan to the school grounds. When you talk to another character, little portraits pop up to accompany dialogue boxes.Horse Riding Academy isn't so bad it should be sold for glue, but the whole game feels like one missed opportunity after another. Perhaps Gameloft, in seeking out a younger audience, felt the need to simplify the game. In doing so, the game is so breezy that it can be completed in under an hour. And that's even with watching the girl fall off the horse a few times. Should Gameloft consider a sequel, I hope they consider bolstering the social sim and adding more races. I think there's a market for a horse game of some sort, but Horse Riding Academy isn't a contender.", "date": "Feb 10, 2007"}