{"name": "The Warriors", "name_review": "The Warriors Review", "ref": "https://www.ign.com/articles/2007/02/12/the-warriors-review", "text": "If anything else, The Warriors proves that Rockstar knows how to port console games to PSP. Sure Midnight Club 3 suffered from god-awful load times and a few other tech issues, but for the most part, the move from set-top to portable was watertight. Luckily, The Warriors does MC3 one better and actually improves access times while also enabling the secret ~Armies of the Night~ side-scrolling mode from the beginning. Not a bad list of goodies for a title that was great fun to begin with.   A more important factor to consider, though, is how strongly The Warriors translates to a handheld format. After all, it was THE premier beat 'em up of 2005 and one of the best overall action games of that year. The good news is that, other than some control issues, it still holds up well despite playing out on a smaller screen. The enjoyable hand-to-hand combat, clever mini-games, and cool 1970s atmosphere hasn't been trimmed back at all, and at a mere twenty bucks there's plenty of content here for a scarce amount of funds.    But what does ~plenty of content~ really mean? Well on the surface, it means that it's a mish-mash of Rockstar's other games like Bully and Manhunt. To be more specific, players are treated to a multifaceted story-driven actioner that lasts anywhere from 15-20 hours. And while most of that adventure is all about going mano e mano with other New York street gangs, it's also beyond just punching and kicking. Players can steal car stereos, spray-paint neighborhoods, control fellow squad members with strategic ~War Chief~ commands, and do plenty more.   Of course, there's no denying that the main objective in The Warriors is to beat people up, and Rockstar Toronto's engine makes it noticeably fun to do so. Fortunately, the port authorities from Rockstar Leeds have succeeded in moving those original console-based mechanics to PSP with few hitches. This means that users can still grapple opponents while standing, smash them into various obstacles, and wrestle back and forth until their heart's content.   But that's just the start of it. Gamers who want to make the most of the system can also chain light and heavy attacks together for a series of different combos and chain them again into finishing throws. Special attacks can be used too, and make for neat cinematic strikes that include pounding people with elbows, knees, and other appendages. Add in the fact that you have Rage Attacks, counter moves, team strikes, projectile throws, the ability to use weapons, and different maneuvers for every Warrior, and you have more than enough reasons to want to throw down.    As good as the combat mechanics may be, however, they're just not as tight as they were on consoles. The problem is that the game was originally designed around having more action buttons and analog sticks than the PSP actually has. This definitely changes things, especially for returning fans. To the team's credit, there have been several adjustments and tweaks made to account for the fewer inputs, but the reassigned buttons and less-intuitive camera controls makes The Warriors feel a little slower and sloppier than before. Being defensive and throwing burners (aka spray-painting) in particular is much harder than we remember, and manipulating the camera angles can get hectic when you're involved in larger battles.   But even with the burden of its sometimes-frantic controls, The Warriors still works because of the depth of its mechanics and AI opponents. The CPU is aggressively brutal, loves to use team-based swarm tactics, and is made even tougher with its extremely dangerous boss battles. The only other issue to here is with general enemy identities -- if you're fighting the Boppers, they fight just like the Turnbull ACs, who fight just like the Rangers, and the Hi-Hats, etc, etc. It would have been nice to see a little more variety there.    Another one of The Warriors' strengths comes from its story. A good 80% of the game has its own original plot that takes place well before the movie on which it's based. How did a small-time gang from East Coney rise to power and get in the position of being framed for an assassination in the first place? How did Cleon and Vermin come to found the Warriors? When did Cyrus hatch his plan to create a 60,000 soldier inner-city army? The answer to all these questions and more are all taken care of before the final credits roll, and while it's not necessarily award-winning stuff, it's told pretty well.   For many, though, The Warriors' best feature is probably the ad hoc Multiplayer option (sadly, there isn't any infrastructure support). Though you can no longer drop in and out of a level at any time like you could in the PS2 version, the game still gives users the option of teaming up with a buddy in multiple modes (including the main storyline itself). And while losing the aforementioned arcade-style drop-in option may hurt things a little, having a screen all to yourself when you do play with someone else sort of evens it all out.    Visually The Warriors take a bit of a backward step as well. There is noticeable slowdown in the more crowded situations and the smaller-screen and awkward camera adjustments can make it difficult to tell what's going on during big-time brawls. Plus, let us not forget that 15 months ago when The Warriors first came out, its graphics were already a little behind the curve -- so don't expect too many details or high levels of animation when compared to other modern actioners. There's no denying, however, that the game has a great artistic style and it's cool to see some vintage 1970s signage hanging around the backdrops.Just as was the case in 2005, there's a lot to like in The Warriors. The gameplay is varied, the combat is deep, and the presentational and multiplayer extras add plenty of brownie points. Of course, the biggest issue for some many be the game's extreme level of violence (expect lots of blood, swearing, and street-level combat). However, given the source material, that shouldn't be a surprise. Principals aside, the more obvious snag for PSP users is the clunkier camera and defensive controls. But even with those hurdles, The Warriors is still a highly entertaining brawler and a worthy addition to most action fans' portable library.", "date": "Feb 12, 2007"}