{"name": "2Xtreme", "name_review": "2 Xtreme Review", "ref": "https://www.ign.com/articles/2007/02/13/2-xtreme-review", "text": "Released in 1996 on the original and still-extreme PlayStation, 2 Xtreme combines a number of extreme sports in a very extreme way by extremifying their presence in different extreme events across a number of extremely extreme locations.   As terrible as the above sentence may be, it is better than 2 Xtreme. While other games that have hit the PlayStation Store for play on the PSP have held up reasonably well over time, like Crash Bandicoot, Rally Cross or Jet Moto for instance, 2 Xtreme has decayed and rotted over time. Its resurrection was unwarranted and, honestly, we have no idea why anyone green-lit this game to be re-released.    For starters, the menu system is extremely cryptic. Where the hell do you save? When you start a racing season, why can't you view the leaderboards? Are there even leaderboards anywhere? Does the place you finish in count for anything? Who knows?   The actual events take place in a number of different cities, though each one is really only varied by the stuff you see on the side of the road. The courses are just long and winding, much like what we saw in Road Rash. That's not necessarily a bad thing in and of itself, except that the racing here isn't any fun at all. The biggest problem is that when you run into an object you don't usually topple over it, so when you stand up again you need to shimmy sideways in order to get around it. You can't go backwards, and since you're pressed right up against the thing your only option is to slide to the side. Yeah, good fun.    The one interesting aspect of its design has to do with your energy. Peddling your bike, kicking your skateboard or what have you takes energy, and when you're tired you can no longer kick. The solution to this is to crouch when going downhill to save your energy and also build up speed. This sounds fine, except that you actually go much faster downhill when crouching than kicking and it's usually hard to tell when you're going downhill. In 2 Xtreme, a downhill road is usually represented by a flat road. Sometimes. Sometimes it's just flat, but sometimes it actually is downhill. Arrgh.2 Xtreme is a little better than Extreme PaintBrawl, but that's not exactly a good thing. This is by far the worst PSone title re-released for the PSP, and there's absolutely no reason whatsoever to buy it.", "date": "Feb 13, 2007"}