{"name": "Inuyasha: Secret of the Divine Jewel", "name_review": "Inuyasha: Secret of the Divine Jewel Review", "ref": "https://www.ign.com/articles/2007/02/13/inuyasha-secret-of-the-divine-jewel-review", "text": "Sometimes it seems that game publishers and developers think the consumer is an idiot. That if they churn out some crappy title and slap a license on it, people will snatch it up. Their greedy eyes have focused on Inuyasha, a staple of the Adult Swim anime lineup. During the holiday season, bad games can get by on having a popular license attached to it, and people won't see until it's too late. Fortunately, Inuyasha: Secret of the Divine Jewel was released after, and it's easy to see that the game Art Co. and Frontier Groove developed a game that bastardizes the series worse than the FCC did with the American version edits.    The first mistake the developers made is that players don't even start off as Inuyasha. Instead, a new character named Janis is introduced. Janis is an American schoolgirl that becomes entangled with Inuyasha, Kagome et al when she falls into a well and gets transported to the feudal era. In fact the story focuses on Janis almost entirely. It really should be called Janis: Secret of the Divine Jewel - Featuring Inuyasha. Janis isn't a bad character, and the story is halfway decent, but that doesn't matter since players don't get to really ever enjoy the story. The annoyances within the game are too much for even the most diehard Inuyasha fan to bear.    In order to experience the story, players obviously have to progress through the game. Which means a whole lot of random battles in dungeons. A whole, whole lot of random battles. On average, the onscreen character will get about three, maybe five steps before the player is dragged into a monster-filled fight. Players will literally be thrown into battles ever five seconds or so. It's ridiculous, especially considering how poorly designed the battle system is.    Inuyasha's battle mechanics are so simple, they make the Pokemon games seem complicated. Each character has a few options: attack, charge, magic. A couple taps on the touch screen and boom, fight over. A few of the characters have attacks that can take out every bad guy on the screen with no problem, making the battles seem more like an exercise in tedium than any really gameplay experience. As the game progresses, no real strategy enters into the mix, since the characters don't upgrade very much (making the game pretty lame as an RPG). Players that want to actually finish the game are in for thousands of skirmishes, and the novelty wears off on the very first one.    So maybe the most dedicated Inuyasha fan can work past the simplistic design. After all, RPGs are cool because of the beautiful graphics and cool cut scenes that accompany the powerful attacks. Unfortunately, in Inuyasha: Secret of the Divine Jewel, mediocrity prevails in the way of flat, pixilated sprites and choppy animations. The dungeons within the game are bland and uninspired, a fact that becomes painfully obvious given how long they are. The overworld map is an even bigger insult, offering a flat, undetailed excuse for the world. Oftentimes it's difficult to tell what's even on the map. The most detailed parts of the games are in the battles, but even then the quality is below that of many Game Boy Advance games. The sprites are colorful but animate poorly, and everything feels really disconnected.       The story scenes suffer from the poor graphics as well, further hindering any fan's enjoyment of the game. Simple hand drawn screens with no animation accompany long scrolling text boxes that are describing far more than the pictures show. Janis tells nearly the entire story, since it's all about her.    For players that are wondering what Janis' voice sounds like, too bad. There is absolutely no voicework in this game. Hell, there isn't even enough music! The 30 second song clips actually cut out during the longer cutscenes, so players end up reading a good portion of the story in complete silence. It's almost a blessing though since the music is so grating and repetitive that players would have muted it anyway (and they still should, since it loops during all the dungeons). This game is an insult to fans of the series. Inuyasha: Secret of the Divine Jewel is an obvious attempt to cash in on the popularity of the show, without actually bothering to make a decent title that people can enjoy. The game does feature an original story, complete with a new character, and that may be enough for some people to take a look at it. However all the shortcomings of the title far outweigh anything the story could bring. This game is beyond hope, even for the most diehard, cosplaying, write-your-own-fanfiction Inuyasha fan.", "date": "Feb 13, 2007"}