{"name": "R4: Ridge Racer Type 4", "name_review": "R4: Ridge Racer Type 4", "ref": "https://www.ign.com/articles/1999/05/06/r4-ridge-racer-type-4", "text": "Can it really be almost five years since the release of the original Ridge Racer? That game was, without a doubt, the selling point for many people looking at the New Kid on The Block  in this case, it was Sony with its brand new gaming console, the PlayStation. Namco was first on board with a then-impressive port of its arcade racer, and that was it. The gaming public was hooked. Sure, it had its fair share of glitches and flaws, including only one real track  but the game showed off 3D capabilities unseen at that point on a console, and that was the selling point for many of the new system owners.  As the series continued over the PlayStation's life, going from Ridge Racer Revolution to Rage Racer, so did the graphic and gameplay quality, while still retaining the original's arcade playability. But the same complaint from the original still retained: very few tracks. And with Polyphony's Gran Turismo stealing the racing spotlight the past year, it was time for Namco to give its series a huge shot in the arm. Which is indeed what the company did when it set out to design Ridge Racer Type 4 (R4). Gameplay Take all that you've learned about Gran Turismo and throw it out the window. Ridge Racer has always been about arcade racing, and R4 is no exception. While, sure, the development team has designed a racing engine that feels energetic and realistic, the team has taken a bit of creative license when it comes to how cars react on the track. Gran Turismo kept it as real as possible  each car, modeled after a real-life vehicle, reacted as true-to-life as possible. This meant that the cars, though moving at 120+ miles per hour, didn't feel like they were cruising as fast as they should. Realism in VR  it's a bitch to use since what may be accurate may not feel right.  In R4, all that doesn't matter. Though the game's 321 vehicles aren't based on any real-world automobile, this is almost a godsend since the development team wasn't tied down with statistical details to conform to. Instead, the game flows extremely fast with an amazing amount of energy, while still keeping a sense of creative realism. Powersliding, for example, plays just as huge an element as it always did, though in real racing you'd be suicidal to try and pull off these maneuvers  if you were talented enough to do so.  R4's main mode is the Grand Prix option. In it, you assume the role of a professional racer who must decide which team to work for  there are four to choose from, and picking one essentially decides your difficulty level. The challenge is to start with a pathetic car from one of four car manufacturers (each with its own special capabilities) and as you progress through the ranks you're awarded a better car from that manufacturer with higher top speed, better handling, or both. The Grand Prix mode is segmented into eight challenges across eight different tracks, each one having a specific qualifying criteria (must finish at least in a certain position). If you fail to meet the qualification more than four times, the game is over. All the cars that you earn are yours to keep  you'll be able to save them on your memory card, and if you have a PocketStation, you can transfer your earned cars to other PocketStation owners through a downloadable application. It makes it handy to earn all the extra cars that way.  There are two main strategies in the Grand Prix mode: learning all the track curves, and learning how the computer AI reacts. A few times around the track and you'll figure out which turns are the best to accelerate through and which to powerslide around. Granted, cars with better grip can turn better without sliding, and cars with more drift can powerslide like a dream, so it's up to you to choose the path of how you plan to handle the turns on the track. Computer opponents, on the other hand, are not as bright as they can be. Once you've passed them you can easily box them out by keeping an eye on your rear view mirror  unless you're a major klutz, once you've passed an opponent they'll usually never pass you.  The game also features a two-player one-on-one split-screen mode when the Grand Prix mode gets a little old  after all, once you've gone through all four difficulty levels of the Grand Prix mode, the only reason to go through them again is to be a collector of cars.  The evolution of the Ridge Racer series is pretty obvious when you look at them side-by-side. And we guess that's what Namco's intention was when they included the original Ridge Racer in the package with R4 as a bonus disc. This disc features two versions of Ridge Racer: a 60 frames per second, high-resolution, smooth-as-silk game and the original 30 frames per second. Both versions feature JogCon support (read below), but they've also been scaled back a bit by only offering one computer opponent. Huh? We can understand the enhanced version needing to reduce the computer AI to keep up the high-resolution and high framerate, but what's up with the original mode lacking multiple cars?  R4 also comes in two packages  by itself and with the new JogCon controller. The JogCon is the first console-oriented true force-feedback steering wheel. It takes some serious getting used to, but if you give it time, controlling the cars become second nature with the JogCon. The controller will also be supported in future racing games, including Gran Turismo 2  so it may be wise to invest in the few extra bucks that's necessary to pick up the game-and-controller package. Graphics  Namco has really bumped up the graphic quality of the Ridge Racer series in R4, not surprising after the high watermark set by Gran Turismo. R4 features great lightsourcing, a smooth framerate (30 frames-per-second without a single moment where it drops below that), and detailed textures. Tracks have been arranged in such a way that scenery pop-up is kept to a minimum (except of straight-aways, but it's barely noticable). The instant replay mode after a race isn't quite as dynamic and as up to the quality as Gran Turismo, but it's certainly detailed enough to hold its own. Sound  The Ridge Racer series was all about techno-music for the background soundtrack, and in R4's case the style of music wildly ranges from house to drum-and-bass to, yes, techno. The soundtrack isn't quite as memorable as the first Ridge Racer, but it does the job of filling the audio void without overpowering the action. Engine noises also vary depending on the type of car you've earned (as well as which car's passing you on the right or left). And like all the Ridge Racer games, be prepared for an obnoxious voice-over from an unseen commentator before, during and after the race. Hey, it's all part of the series. Even with the awesome Gran Turismo out (and its sequel coming out), there's more than enough room for a game like R4. Where Gran Turismo focuses on realism, R4 puts all of its effort into action and energy. The game isn't perfect -- and once you've mastered all the courses it all just becomes a challenge of being the first kid on the block with all the earned cars. In fact, there's really only 40 or so unique car models -- the rest are simply souped-up versions with different handling abilities. So don't expect too much variety once you've gone through the Grand Prix game four times or so. Other than that, it's an awesome racer that will fill the void...until Gran Turismo 2.", "date": "May 6, 1999"}