{"name": "Monster Kingdom: Jewel Summoner", "name_review": "Monster Kingdom: Jewel Summoner Review", "ref": "https://www.ign.com/articles/2007/02/14/monster-kingdom-jewel-summoner-review", "text": "The PSP has gotten a rare and decent RPG that isn't just a port with Monster Kingdom: Jewel Summoner, but the news is so delightful and underwhelming at the same time. Sure, Jewel Summoner may be a PSP-specific role-player and hurray for that, but that doesn't necessarily make it great. Truth be told, there are as many areas to boo at Monster Kingdom as there are to cheer for it. The results are fantastically ~okay~, but at least it's unique.    What sets Jewel Summoner apart is its presentation, which includes a distinctive take on the voices, music, graphics, and the battle system. Well over 90% of the dialogue has been done by talented actors and the music is pretty good. Each of the characters also gets nice, crisp art for the conversational scenes. This is fortunate, since there's plenty of talking. In fact, there's a little too much talking -- especially in the beginning.     For the first five hours or so, expect to watch characters talk, walk a bit, talk quite a bit more, stumble about for a second, and then fall into another lengthy discussion. The storyline is interesting on its own and deals with modern issues such as the price we pay for the cheap and plentiful energy around us (no, really), but there is so much badly-written dialogue that it gets overbearing and tiring. It feels like several of the characters talk just for the sake of talking and every time they reappear on the screen it's a frantic race of button-pushing to get their uninteresting comments and meaningful pauses off the screen.    The only guy that doesn't do a lot of talking is the nearly mute and sullen lead character, Vice (who's on a path to find the Abomination that killed his mom). Since Vice is a Jewel Summoner, he uses various charms as weapons and each gem contain monsters that fight other monsters. New monsters can be gained in battle by weakening them and then capturing them in prisms for future use, much like Pokemon.     The battles are interesting in that the player's party has three characters and each one can summon one of their three monsters at a time. In each battle, the party faces one to three monsters at a time. The health bar belongs to the character, but the magic bar belongs to the summoned monster so swapping monsters mid-fight helps to give an extra bit of juice, even if you lose a turn in the process. The extra twist is that each monster belongs to one of eight elements to create battles strongly influenced by a rock-paper-scissors scenario.    The elements are broken down into two main groups: light and dark. Light gets the more ethereal elements of fire, wind, and thunder while the dark group gets the more solid elements: water, earth, and ice. Fire beats ice, ice beats wind, wind beats earth, and so on until the loop closes up with water beating fire. Monsters can also be the light or dark element itself. Mastering these elements can be the difference of a drawn-out battle versus a short one or between defeating a boss and not having a hope in the world.    To make things more complicated and interesting, monsters have elemental attacks according to their type, but can learn attacks of other elements as well. By fusing creatures with pieces of quartz, it's possible to make a fiery dragon cause a blizzard or make an earthy golem cause a flood attack. These are done by fusing them together with an unbearably slow process that can take a few long trips to the dungeon to complete. Unless you get an extra item to speed up the process it really isn't worth it.    This system is perfect for playing around with endless combinations of the perfect group of hybrid monsters, but for the most part it's not even worth it. First of all, augmenting a monster with a new power takes an extraordinarily long time unless you speed up the process with an extra item. You can clear out a few dungeons and pick up a couple dozen more monsters before the job is complete.    The other problem is that for the most part the battles are remarkably easy. Different sections of dungeons, or sometimes whole dungeons, tend to have the same types of monsters. Wander into an area with lots of fire creatures and stack up the water guys for quick wins. After assembling a couple of line-ups it's easy to clear out large areas without even thinking.    Each dungeon also has several save points that can revive your entire group to full strength simply by walking into them. This makes it dead simple to dungeon crawl to harvest the experience points and develop your monsters. It also takes much of the suspense out of each dungeon. The tense situations of worrying about how well-stocked you are and if you have enough food to survive the trip barely ever happen and that's a shame.     So as much as the battles have potential, that potential isn't fully realized. All too often the same battles happen again and again. This doesn't mean that these are similar battles, but the exact same groups of monsters will attack over and over again in their own area. Unlocking the clue to beating them once is mildly interesting. The 50th time it does start to wear on you.    All this dungeon-crawling is made more interesting by figuring out how to get through each dungeon. Plenty of secrets can be found and later on you need to use a group of skills to get out of them. It makes for some fun challenges to keep the game interesting after the battles have worn out their welcome.    What makes the game compelling overall is not the battle system at all, but really the story. The plot chokes up the first several hours of the game, but it acquires a more even balance later on. Vice never does gain a personality, but the events that unfold around him prove compelling. While Jewel Summoner doesn't soar to the heavens with unique and interesting characters or a battle system that stands the test of the full game time it doesn't fall apart either. It has a steady amount of fun that lasts for the whole game. It's a good and well-presented distraction and for something that you hope to carry in your pocket for a little while it certainly serves that purpose. This is not a game to be held up as a shining example of what RPG's on the PSP should be, but rather a good stepping-stone on the path to what could be.", "date": "Feb 14, 2007"}