{"name": "Military Madness [1990]", "name_review": "Military Madness VC Review", "ref": "https://www.ign.com/articles/2007/02/15/military-madness-vc-review", "text": "Everyone makes mistakes, emulators included. When Military Madness first went on sale through the Wii Shop two months ago, early adopters found a pretty major mistake in the form of a technical glitch   an emulation error caused scrolling in the game to stutter, scrambling the screen in Levels 4 and beyond. It wasn't unplayable in that form, but it was certainly annoying to sit through. But now it's been fixed.   Proving that patches are possible for Virtual Console games, Nintendo and Hudson are now offering a downloadable update to remove the error. Gamers who downloaded Military Madness before February 9 can find the fix available, freely, through their Wii Shop purchase histories. New customers won't have to worry, as the crack arrives pre-spackled and good as new.   And new customers there should be, because in fixed form Military Madness is an engaging and interesting take on turn-based military strategy. Nintendo fans here are likely familiar with Advance Wars. The series has been published by the Big N on the Game Boy Advance and the DS, and features unit-directing grid-based combat on the level of a much more complicated game of chess. Military Madness is made from the same mold. This game came to the TurboGrafx just as the '90s were being born, and brought with it the same style of gameplay that faithful Nintendo followers wouldn't get to experience for themselves until 2001.   There are a few key differences   Advance Wars has a square grid overlaying its tactical terrains, but Military Madness honeycombs each arena with hexagons. The setting is a bit different, too, as AW is mostly modern in its units and environments, while MM takes place in the future, on the moon. Fighting on the lunar surface doesn't make much of a gameplay difference   you'd think the one-sixth Earth's gravity might make driving a Panzer a bit of a tougher job   but there are plenty of other ways Military Madness innovates, in its way.   The first is in its terrain recognition. Your units get a bonus to both their offensive and defensive potential based on the defensibility of their position   taking the higher ground and attacking an enemy stranded on an open plain means a considerable advantage for your troops. Yeah, whatever, old news, right? Advance Wars does that too. But Advance Wars doesn't do innovation number two, which is additional combat bonuses applied by the proximity of other units.   Normally you'd think that unit-based combat is one-dimensional. One unit slugs it out with one other unit, each exchange happening independent of any others. But in Military Madness your forces get more powerful if they attack near their allies   if my tank squad attacks the enemy's foot soldiers, its assault will cause more casualties if another, friendly tank squad is sitting just one space over. It makes sense. Call it a morale boost, or flanking, or whatever, but it's just understandable that an individual phalanx of warriors would be more combat-ready if they were surrounded by a swarm of their fellows.    For true devastation, trap your opponent on either side in a pincer attack. That'll send them to the graveyard fast. Units gain experience over time through surviving multiple battles, you get a comfortable progression of difficulty and complexity as the game's campaign continues, and a two-player mode means taking on your friends in a battle of wits without having to set up any rows of wooden pawns.   It would have been hard to recommend the broken Military Madness that first debuted on December 18, plagued as it was by a simple but annoyingly persistent emulation glitch. As that's no longer a factor, the game's true value is restored. Overall Military Madness is a lot of fun, and certainly worth a look if you're a fan of turn-based, grid-based, moonbase strategy. We'll forgive Nintendo and Hudson the oversight this time, but let's hope that future VC releases don't arrive with any more technical troubles.", "date": "Feb 15, 2007"}