{"name": "Comix Zone", "name_review": "Comix Zone VC Review", "ref": "https://www.ign.com/articles/2007/02/15/comix-zone-vc-review", "text": "We all aspired to be artists, once upon a time. Slacking off in 5th grade math class, doodling little heroes and villains in the margins of your looseleaf  if only they could have come to life! In Comix Zone, they did.   Sketch Turner is a single, pony-tailed 20-something living as a cartoonist in New York City. He's hard at work one night on his latest comic book when a storm rolls into town. A clash of thunder, a bolt of lightning! Suddenly Sketch's world is flipped  the violence of the squall outside has somehow awakened his latest creation, the supervillain Mortus. The tyrant rises up against his creator, taking his place in the real world while trapping Sketch within the pages of his own graphic novel. Now the starving artist will have to become a hero, battling from panel to panel through a hand-drawn world of his own design.   Comix Zone has style to spare  it takes its creative hook and uses it perfectly, integrating the idea of being pulled into a comic book into both the gameplay and overall presentation. You play through comic pages, a panel at a time. When you come to the end of the page or a white border marking the end of the current scene, you either swing-jump over into the next part of the story or shred the paper to make forward progress. Comix Zone did the Paper Mario thing years before Nintendo's plumber.   And in the world of the comics, Sketch is an instant superhero. He can fight with combination moves that seem drawn straight out of Street Fighter  there aren't any Hadokens, but there are scattered collectible items that can be picked up and thrown. These include knives, explosives and Sketch's pet rat Roadkill, who, when sent after enemies, attacks them with a static pulse. An electric rodent? See, even Pokemon copied Comix.   It's just a shame that Sega itself never followed this game with a sequel of any sort, that it never attained the level of popularity or sales required for the brand to become a full franchise. Comix Zone was a welcome and unique addition to the 16-bit Genesis lineup, late into the life cycle for that system  it wasn't released until 1995, when the company's focus had almost fully turned to the next-gen Saturn. It could be that gamers had already migrated to the new hardware, leaving Comix Zone behind in their time of transition. Or it could be that gamers knew full well about the game, and chose to ignore it because it kept kicking their butts.   This game is brutally unforgiving. Simple side-scrolling brawler with a comic gimmick sums it all up, right? Almost. There's also the added note of a nearly constantly draining life meter. Because Sketch is made of paper when he's in the Zone, and because everything else is too, doing damage to enemies or the environment also harms the hero. They're connected through the lifeblood of the parchment, as if the loss of pieces of his hand-drawn scenes causes Sketch to have trouble breathing.   And on top of that, there are no lives in Comix Zone. No 1ups or second chances, except on very rare occasions. That means that if your draining meter drains itself out, or if you miss one jump over a bottomless pit, you're done. Game over, Mortus wins, back to the title screen done.    You'll have to have a lot of patience to forgive the Zone that failing. And depending on your personal threshold for annoyance and individual strength of resolve, you might be able to. But casual players need not apply. Comix Zone is a VC release for hardcore brawling fans that don't mind a true challenge, or those willing to accept frustration in play for the sake of seeing one of the 16-bit era's most stylishly presented and animatedly vivid game worlds.Comix Zone joined several of its 16-bit brethren in the release of Sega Genesis Collection for the PS2 a few months ago. Other than that, this is the first opportunity modern gamers have had to experience the title  definitely the first for dedicated Nintendo fans, who, in 1995, were too busy occupying themselves with thoughts of the upcoming Virtual Boy to notice any new game arriving on Sega's systems. There's a genuine appeal to the premise of Comix Zone  it's simply understood that the concept of having your own drawings come to life is totally awesome. But as you'll probably never get to do battle with your own notebook-scribbled sketches for new Mario baddies and Mega Man Robot Masters, you may want to give Comix Zone a look. It may be frustratingly difficult, but even frustratingly difficult is more fun than some of those old 5th grade math classes.", "date": "Feb 15, 2007"}