{"name": "Tank Racer", "name_review": "Tank Racer", "ref": "https://www.ign.com/articles/1999/05/06/tank-racer", "text": "You're a World Class Tank Racer racing in a race for the World Tank Racing Championships (WTRC). It's a vicious racing circuit as you'll find yourself racing against seven other highly motivated racers. To add to your racing woes, you'll also have to start each race at the end of the pack. As if there wasn't already enough racing in this paragraph, you'll need to place fairly high in each of the sixteen races just to get a shot at the WTRC Cup.  You control your tank by using the keyboard. Overall, I found them pretty unresponsive; even the ones with the best handling. They tended to respond way too sluggishly. Luckily they only get up to about 120mph. That, and the fact that they are tanks, means you don't have to be too careful about steering. There's one car parked in front of a church right on the inside of one of the turns. After three laps, the car is totally flat. Poor sap. Oh, you also get a horn but I fail to see the point of that.  There supposed to be over a dozen separate tanks that you can race in. At the beginning, you will only be able to pick from four. As you get further and further in the WTRC, you have access to better and more varied designs. Each tank is rated in one of four performance areas-top speed, acceleration, handling and grip. The introductory tanks are pretty well balanced. Usually in a game like this, there's one or two that are just totally worthless. In this game, each tank is capable of doing very well on each track.  Each tank comes with a rotating turret. This is nice for the computer controlled tanks, but for me it was next to useless. I couldn't coordinate spinning the turret around while also trying to stay on the road. In a few instances, like when someone was right behind me or right beside me, I was able to swivel the turret and score some nice shots. Other than that, the turret is hard to aim. And you certainly don't want to waste a concussion missile on a test shot.  The turret normally shoots (really it's more of a lob) a shell a very short distance down the track. While it's not a great weapon, you always have it with you. That's nicer than other games where you spend much of your time without any offensive capabilities whatsoever. It recycles slowly and has a short range. On top of that, you have no control over the elevation of the shot. Sometimes it shoots long, sometimes it shoots short. Nevertheless, it has quite a kick to it and is most useful for nudging the other tanks around the track.  Most of the weapon boosts are disappointingly familiar. You can get speed boosts, missiles, mines or a shield. There is one however, that stands out - the UFO weapon. This weapon fires an extraterrestrial marker onto another car. A UFO then swoops down onto the track, zaps the car and places it further back in the pack. The actual effect isn't that impressive, but the idea is neat.  On the subject of weapons, I wasn't really sure if the weapons ever did anything other than disorient your opponents. I don't think they actually do any real physical damage in the single player modes. There are no health bars, and no tanks are ever found as burned out hulks by the side of the road.  There are two single player modes in Tank Racer. The Cup Race is what the game is all about. The life of a World Class Tank Racer Champion is not to be envied. Sure, you get lots of high-paying endorsements and hordes of hot groupies, but you've got to keep proving yourself over and over again. And someday you'll meet somebody better than you. For me, it was my first day and, now that I think about it, I think I met seven people who were all better than me. Way better.  Anyway, the goal of the game is to win all three cups in the WTRC. Once you clear the Bronze cup, you move on to the Silver, then...ah, skip it. The point is that the game begins to change after each cup. You get more tanks to choose from, different tracks and improved power ups. Each Cup has four tanks and up to six tracks. There are also three hidden tanks that you might find as you're racing for the Cup  The other single player variant is the practice race. This is set up just like a Cup Race but you score no points. You can come here to practice any track you have placed on in the Cup Race mode. This becomes crucial to your eventual Cup victory. You can also experiment to find out which tanks have the best laps times on each of the tracks.  There are two multi-player versions as well. You can choose from the traditional Battle Mode, played in special arenas, or the even more traditional Vs. Mode. Multi-player setup is pretty painless.  The tracks are varied enough in appearance to hold your interest. Although there is a definite unity to the tracks, each seems to have it's own unique character. There's a farm , a theme park, a sort of a European villa and several others. They don't look real, but they look good. All the tracks look good and there's lots of stuff to run over in your tank. I mean, after all, it is a tank, right? You can flatten signposts, houses and chickens (technically not real chickens, not even simulated real chickens, they're just cardboard cutouts).  I was disappointed in the way the tanks looked. They were far too flat and blocky. They do show semi-realistic damage, however. It has little practical use but it's gratifying to see visible proof of your marksmanship tattooed across the ass of your enemy. The weapon effects were not spectacular. They hardly seemed to be present at all. There's something sort of underdone about them.  This is pretty average for this type of game. The tanks are slow to respond to the controls and, on some of the tracks, this is a real liability. Human players will find themselves frequently over or under-steering and losing time as a result. The computer players don't seem to have a problem with it. There are quite a few tight turns and some narrow openings on most of the tracks. Most of time you just scrape the walls until you slow down enough to regain control.  The game is still just a repackaging of so many other racing titles. There's some original thought here but not enough to make the game deserve much attention. If there had been more weapons like the UFO thing, then the game could've been a lot zanier. I don't know about you, but zany sells in my neighborhood. I think they tried to make this a slightly comical game anyway-the theme park track is a good example. If more attention had been placed on those aspects, this game would be unique and maybe even a little more fun. Not for the sake of the gameplay, but for the concept behind it.  -- Stephen Butts", "date": "May 6, 1999"}