{"name": "Invictus: In the Shadow of Olympus", "name_review": "Invictus: In the Shadow of Olympus", "ref": "https://www.ign.com/articles/2000/03/24/invictus-in-the-shadow-of-olympus", "text": "Invictus, from the Latin meaning ~unconquerable.~ That's pretty much how I feel about this game. Before I go any further I'd better get my bias right out on the table. While the rest of my friends were getting highly marketable degrees in Film or Urban Geography, I was working my way through the Classics and Ancient History programs. When I heard some of the preview information about this game, I got excited about the prospect of pointing out all the inconsistencies and inaccuracies in the game story. Tearing it a new one, as they say. Arachne can turn into a giant spider and attack your foes? Elektra shoots lightning bolts? Come on. But after I played the game for a while I discovered that these issues really weren't so offensive. I've long since abandoned the idea that mass media should remain faithful to the original ideas presented in Greek mythology. I guess part of it is that the Greeks themselves frequently reinvented their own myths in order to fit in with newer ideas and circumstances. The fact that we're still doing it thousands of years later shouldn't cause too much aggravation -- except among Classics professors, I suppose.  But like I said, that's not the issue. As I played the game, I began to realize that the game has plenty of other flaws that are far more obnoxious than merely taking liberties with the mythology. The biggest issues center on the sloppy combat controls and poor mission design. Although the game does have strong points, these tend to be obscured by the more frustrating elements in the design. This is all the more disappointing given that the idea of an RTS/RPG hybrid based in the world of Greek mythology is just about the most appealing idea in the world to me. But before we get to the mechanics of the game, let's first take a look at the reason why there should be any game to begin with.  The story certainly fits in with the general character of the myths you're already familiar with. But it begins in the more mundane world of the present. It seems that you are walking down the street on a hot day contemplating the rising disasters and catastrophes that have recently befallen the world. You are somehow drawn to a voice coming from inside a computer software store. The voice seems to be coming from one of the machines demoing a game. You find yourself seemingly drawn into the machine and into the middle of an argument between Athena and Poseidon. They are arguing over Odysseus' recent homecoming. Poseidon claims he could have prevented the hero's return had he truly wanted to. Athena takes exception to this and a wager is made. Poseidon will set before a new hero a set of trials. If the hero fails in any of these trials, then humanity is doomed to be drowned beneath the ~wine dark sea.~ If he succeeds, then, well, then humanity won't be destroyed. You'd think they'd offer something a little more concrete up to the hero, but you know how gods can be.  Guess who the hero is.  The manual states that ~basics combat in Invictus is simple.~ While the statement merely refers to the routines used to determine attack probability and damage, actually controlling the combat is far from simple. The formation controls and hot key grouping don't exactly work the way you'd think they would. I occasionally found it hard to keep my groups separate, with some groups clumping together without any particular input on my part. As for the formations, they only seem to work when you're not trying to attack anything. Once you issue an attack order, the units break formation and go charging right up to the enemy. One thing that tends to aggravate these flaws is that combats tend to degenerate into big clumps of units all mingled together. In these situations, selecting groups and maintaining formation become much more important. The fact that they work so poorly makes combat that much more difficult. You'll frequently have to pull your archers out of a fight so your melee units can get to the action. We'll get back to the units later.  The missions aren't designed so well either. Some of them seem downright pointless. Let's just take a few examples from the beginning of the game. In one mission your job is to stop some treasure hunters from killing a group of Gorgons. There are two main problems here. First off, once your units kill a treasure hunter, they'll immediately turn and start attacking the Gorgons. I failed the mission three times simply because I couldn't get my own units away from the Gorgons fast enough. Second, since the Gorgons turns units to stone (temporarily at least), some of your units won't be able to retreat from the temple once the current wave treasure hunters are all dead. Any units grouped with the petrified unit naturally run back to help their stoned buddies. This is the last thing you want and you'll constantly have to order your units away from the Gorgons just to keep them from blowing the mission for you.  In the next mission, some of the treasure hunters have kidnapped Medusa (how did they manage that, one wonders) and are preparing to sail away with her to distant lands. Your job is to stop this. I was told where I could expect to find the kidnappers and set out immediately. Upon running into a few of the kidnappers, I quickly dispatched them only to discover that another group of enemies had sailed away with the snake-haired lady. I tried again, bypassed the original enemies and encountered a lake. Since I didn't see any Medusa here, I killed some nearby enemies and was informed that I had lost the mission because the Medusa had departed on the boat. This happened a few more times. Finally I decided I would send my units to all four corners of the map in an effort to locate the elusive Medusa (I just love saying that word). Without my killing a single enemy or even finding the Medusa, I was informed that my mission had been a success. What? Even if I managed to do something essential to completing the mission, it sure escaped me.  Invictus features ten heroes, only four of which you will be able to control during any mission. These are the real backbone of your war party. Most heroes have two special abilities -- a unit bonus and an Appeal. Achilles and Hercules for instance grant defensive bonuses to all units grouped with them. Cadmus has just the opposite effect, increasing the offensive abilities of all grouped with units. Some bonuses apply only to particular types of units. Orion and Icarus boost archers, while Atalanta boosts the abilities of swordsmen. Some units have no unit bonus. They just have individual special powers. Arachne can transform into a venomous spider for the duration of the mission. Perseus can temporarily turn enemy units to stone. Electra shoots lightning bolts and Hippolyta can shoot fireballs. Each use of an appeal drains your available God Points, so use them sparingly...or hardly at all, like me.  The available units in Invictus are impressive. To begin with you will only have access to swordsmen, archers, cavalry and axemen. As you progress through the game, you'll get the chance to recruit other more exotic units into your party. Centaurs have high mobility and excellent ranged attack. Gorgons can turn enemies to stone; not too useful as a purely offensive weapon, but really great at giving you a chance to get away. You'll also be able to recruit Hydra or Cerberus. In all, there's a really good selection of units -- although for my money you just can't beat the skeleton warrior.  One of the best things about Invictus is that the units are carried over from mission to mission. As they gain more experience, they perform better. If you play anything like I do, by the time you get seven or eight missions in you'll have a huge group of battle-hardened archers and a whole bunch of novice spearmen. ~So tell me, what happened to those other spearmen? They retire or something?~ Units in Invictus are purchased from a limited pool using gold you collect from the adventures. Overall, it's good that Invictus eliminates buildings and technology and the other trappings you'd expect in an RTS. Here you're allowed to focus on developing your troops rather than dividing your attention between strategic, economic and technological elements.  The game also uses simulated 3D voxel graphics. The 3D maps can be viewed from almost any angle and almost any zoom level. Overall this is a great feature of the game but it works against you in some of the more constricted levels -- the Minotaur Maze for instance. And all the extreme zoom-ins do is let you get a good look at the blotchy graphics. The character designs are genuinely good (especially the skeleton warriors) but it's too hard to tell some of the units apart when they're bunched together. And they bunch together a lot.  This game really set itself up for a fall with me. My expectations as a gameplayer are much higher than what Invictus finally offers. Which isn't to say that it doesn't have its moments -- it does. But they are few and far between. Overall though the control scheme forces you to fight against the game to get things done. Otherwise the game would be much more fun. In the end, it's just unconquerable.  -- Stephen Butts", "date": "Mar 24, 2000"}