{"name": "Project Gotham Mobile 3D", "name_review": "Project Gotham Racing Mobile 3D Review", "ref": "https://www.ign.com/articles/2007/02/16/project-gotham-racing-mobile-3d-review", "text": "The questions are obvious: Project Gotham Racing on mobile, you say? The same premiere racing game that launched alongside the ultra-powerful Xbox 360 in November 2005? Just to clarify, the racer developed by Bizarre Creations? All completely valid queries, as next-gen (now current gen) console games don't seem like the best inspirado for a platform that many developers cannot coax 16-bit performance from even in 2007. Yet this has not daunted Glu Mobile from giving it a shot, unleashing dual versions of the game --3D and 2D -- on the decks for your digital consumption.   Well, does it stack up?   Basing mobile games on existing console franchises is akin to walking a tricky tightrope -- the fan-base might not have proper expectations going into the space (as recently evidenced by the summary dismissal of mobile on a recent Game Scoop podcast... sigh). I'm not saying that expectations must be lowered to appreciate a mobile game, but they certainly must be adjusted before going into something like PGR Mobile fairly.   The difference between PGR2D and PGR3D are great enough that the game requires two separate reviews. The 3D game sports great visuals, but the driving is somewhat sluggish compared to the zippy, but occasionally ugly 2D edition.    The review that follows is for the 3D version of the game. To read the 2D review, please click here.   PGR Mobile 3D attempts to recreate the kudos-driven game play of the Xbox series. You are granted access to a host of amazing licensed automobiles, such as a Lambo Gallardo, Aston Matrin Vanquish, and a Toyota GT-ONE, and sent around the world to exotic locations such as Cairo, Paris, and Shanghai. Each location has different events for you to medal in, such as Street Race, Kudos Challenge, and Hot Lap. PGR Mobile, like the console game, is not so much a straight racer as it is a finesse contest. Getting to the finish line only takes you halfway to success.   You start out with only enough cash to buy one car from the lower tier of vehicles and access to only a few race events. To move up in the racing world, you must finish events under a specific set of requirements. For example: To win a Street Race, you have to place above a certain cut-off point. But winning a race only earns you a certain amount of cash. To really fatten the purse, you must perform stylish driving maneuvers and earn kudos. Drifting, catching air, performing clean sections (not hitting anything), and drafting earn kudos.   The most kudos are awarded when you successfully drift around corners by pulling the hand brake (assigned to 1 and 3) and initiating a slide. If you're adept with drifting, you can rack up huge kudos in S-curves. Linking up maneuvers multiplies your kudos, too. If you perform an almost flawless race, you can exit with an easy 5,000 kudos. However, you can blow your kudos by striking a wall or another car, so you have to watch your fenders. Losing 1,000 kudos by bouncing off a rival racer can be quite disheartening.   Depending on which of the five difficulty levels you select when entering a race event -- PGR Mobile offers everything from easy to insane -- you earn different medals. A Street Race on the novice difficulty may ask you to only finish third or above, while hard demands first place. The medals mirror the Xbox 360's Achievements. You can track your hardcore PGR Mobile skills via medal counts, just like a Xbox 360 player trying to earn all 1,000 points from the console game. Achievements are one of Microsoft's greatest ideas of this generation, and it was incredibly smart of Glu to replicate those as best as they could -- without infringement -- in the mobile game.   The 3D edition of PGR Mobile offers an online component sorely missing from the 2D package. Online leaderboards track the best performance in the world cities and allow the players with the most medals to show off their dedication and finesse. Even better, players can upload ghosts of their best track runs or kudos performances for other players to download and race against. There are also unlockable features -- and we aren't saying how -- that give players a sneak peek at the upcoming PGR4 for the Xbox 360.   PGR Mobile 3D features some excellent 3D work -- even if it doesn't exactly zoom past you at a clip that approximates high velocity racing. The backdrops recreate the vistas of far flung cities while the objects that stream along the track, from buildings to bridges, are nicely rendered and detailed. The use of color is fantastic. The car models are great. The only thing that mars the presentation is a little bit of pop-up, but it has no effect on the game play.   This version does not control as tightly as the 2D game, which was disappointing. Things felt a bit floaty on the Motorola RAZR I used to test the game. It took practice to come down from the solid controls in the 2D game and score decent kudos runs. Maybe without this previous experience, I wouldn't have noticed the floating controls as much.Project Gotham Mobile Racing 3D is one of the better 3D racers I've played on a handset in some time. The controls are a little floaty for my tastes, but practice solves my complaints to a degree. The amount of content in the game helps make up for it, too. There are dozens of race events to slide through and plenty of medals to earn. Add in the online component with ghost racing and leaderboard bragging rights, and Glu has built a great finesse racer. If you have a handset that can play this game, it's worth the download.", "date": "Feb 16, 2007"}