{"name": "Jade Empire", "name_review": "Jade Empire Review", "ref": "https://www.ign.com/articles/2007/02/19/jade-empire-review", "text": "Though BioWare managed to set the standard for PC RPGs with their amazing Baldur's Gate and Neverwinter Nights series, the Canadian developer has, over the last few years, been drawn towards the Xbox as the platform of choice for their efforts. And just as they raised the bar for PC RPG developers, the studio has broken new ground in the console world with Knights of the Old Republic, Jade Empire and the upcoming Mass Effect. While PC gamers might be understandably bitter about BioWare's new console focus, we can take some consolation in the fact that the games eventually make their way back to the platform that started it all, the PC.  The PC version of Jade Empire is almost exactly identical to the Xbox version, which is to say, it's pretty awesome. The same great story and great action have been preserved here and it's all rendered with BioWare's signature polish and sophistication. The PC version does have a few new additions. To begin with, high end PCs will allow for much better graphics and considerably shorter load times. (The twenty or so loading screens that you encounter in the Arena will definitely make this apparent.) Two extra combat styles have also been included, allowing the player even more options when those pesky horse demons just won't listen to reason.   Jade Empire plays out over the course of some 20-24 hours and embraces a wide variety of themes and types from Asian history and mythology. Starting as a young but promising student in a provincial martial arts school (complete with a wise old master and numerous other characters from martial arts movies), the player will be thrown into a story involving a mysterious drought, imperial bureaucracy, palace intrigue, drunken masters, stray ghosts and dozens of other amazing elements. We don't want to give any of the specifics away, but the story is instantly captivating with enough twists and surprises to sustain your interest all the way through to the end.  Unlike a ~go where you will~ game like Oblivion, Jade Empire has a very linear and focused story. Players are taken from point A to point B with very little opportunity for side trips or a shuffling of destinations. While it can feel somewhat restrained, particularly for Elder Scrolls fans, it allows the designers to script a story that focuses more on the main character than on the world around them. As such, players of Jade Empire will feel like much more of a part of the story; they just won't feel like they have any narrative freedom.  Happily, they will have a fair degree of moral freedom. As with Knights of the Old Republic, Jade Empire continually asks the player to weight their actions and conversations towards one of two ethical extremes. Players who believe in helping the NPCs of Jade Empire will embrace the Open Palm philosophy while those who prefer to let these NPCs fend for themselves (or worse yet, actually take advantage of the helpless) will drift more towards the Closed Fist side of the spectrum. Though not technically presented as ~good~ or ~evil~ in the context of the game, it pretty much amounts to the same thing. Adherence to one alignment over the other rewards the player not only with practical rewards like money but also with new story elements and fighting styles.   It's a very satisfying system because the choices for either side are usually reasonable and compelling. We'll admit that the Closed Fist choices are a bit obnoxious at times (or openly repugnant) but that's part of the fun of roleplaying. It is, in fact, pretty much the entirety of the game's roleplaying element. There are so many of these ethical decisions throughout the game that it's very easy for a player to switch from one extreme to the other during the course of the game. Similarly, it's entirely possible for a player to occasionally make decisions contrary to their overall philosophy without completely compromising their identity.      Though the ethical choices are the main thrust of the actual roleplaying you'll find in this game, there are a few other touches that add to the RPG feel. Characters will level up and earn points to spend on their basic attributes and combat styles. The attributes are remarkably simple. Body determines your health, Chi powers certain magic abilities and Focus lets you use weapon styles or enter slow motion. These three contribute to derived stats that can occasionally influence certain conversations but it's still a very stripped down version of the system used in other RPGs.  On the other side, leveling up combat styles allows for more customization of your character and helps define who they are in the world. Whether you decide to focus on a spectacular weapon style, fling fireballs from your hands or transform into a giant demon and start ripping arms off, Jade Empire has a combat style that's just right for you. And since some styles use Chi and some use Focus and since some enemies are resistant to a whole general category of styles, you'll want to focus on at least two or three different styles if you want to stay competitive.    Unfortunately, you'll have to make that decision relatively early and you won't have a chance to pull your upgrade points out and spend them elsewhere (like you can in Marvel Ultimate Alliance). It's not a huge problem because all of the fighting styles seem equally effective. Still, it makes sense to maximize the potential of a few fighting styles rather than opting for a minor boost to several.  The two new styles in the game, Viper and Iron Palm, are well designed and fit in well with the existing styles. Personally, we found the Iron Palm style to be a bit slow when fighting against spellcasters or enemies who used rapid attacks, but it certainly does a lot of damage. The Viper style is almost the exact opposite, letting players launch a flurry of weaker blows that do poison damage over time. Of course, having two extra styles among the dozens of existing styles isn't really that exciting, but it's worth checking the two new ones out. Unfortunately, they're not available until near the end of Act 3 and are exclusive to your alignment at that time. If you're good, you get the Iron Palm, if you're bad, you get the Viper.  It's a good thing that the different styles exist because, individually, they don't offer much variety. Each has a fast attack, a heavy attack and an area attack but there are no complicated grabs or counters to use here. Even with switching back and forth between the styles, the moves can start to get a bit repetitious. There is the option to use support styles to initiate dramatic harmonic combos to help break things up a bit -- sometimes literally. On the plus side, the mouse and keyboard controls make it much easier than it is on a gamepad to switch back and forth from one style to another.   In fact, this is one of the rare cases where the mouse and keyboard controls are actually better than those on the Xbox's gamepad. Using the mouse to move the camera and the WASD setup to move, the game is remarkably easy to control. A simple targeting system lets you stay focused on your enemy in combat, letting you move easily from side to side as you fight. The mouse cursor works beautifully in the interface as well, letting you navigate menus and conversations with ease. If you happen to prefer using a gamepad, the game's support is, not surprisingly, flawless.  The AI's a bit better this time around but, still, the game doesn't provide much of a challenge at the standard difficulty level. If you're diligent in seeking out missions and maximize your experience points, you'll find it easy enough to keep up with the enemies. It's true that boss fights will require a bit more finesse but the rank and file enemies can usually be dispatched with a simple (but satisfying) round of button mashing.      We saw more enemies in the PC version than we remember from the Xbox version but, in keeping with the classic martial arts movie tradition, they still prefer to attack you in groups, so things don't get too overwhelming. In addition to the pirates, ghosts, monks and giant frogs you'll also get to fight the Rhino Demon, an entirely new creature designed just for the PC version. He looks amazing and, quite frankly, much tougher than he is.  The final piece of the gameplay puzzle is the strange little flying sequences between missions. As you move from one location to another, you'll have the option to take part in 1942-style scrolling shooter. While it makes a nice diversion from the story, it's just that -- a diversion. After building up this highly detailed, atmospheric world of Chinese myths and martial arts, the developers send you off on an arcade shooter mission. For us, it really kills the mood and just reminds you that you're just playing a video game. At least they're not as long as the Gummi Ship sequences in Kingdom Hearts.   Unrestrained by the Xbox's graphical capabilities, Jade Empire looks freaking amazing. The character models are full of life and personality, from the way their faces move when they speak to the cinematic fight choreography. Combat moves are all fluid and give a real sense of contact between opponents. Glowing trails, fancy particles and a host of other effects add an element of fantasy to the fights here and really ratchet up the excitement. The camera manages to capture the action fairly well. We had some issues where the camera would bump into objects from time to time but there were relatively rare.  The environments are no less impressive. While the overall design of the levels was good in the Xbox version, there are so many more detailed textures here and so many great atmospheric effects that the whole world seems to come to life before you. Sun-dappled forests, colorful city streets, shadowy caves and a host of other locations provide a thrilling backdrop to your exploits and help to give the game a strong sense of place.  Unfortunately, the game also makes use of some strangely grainy FMV cutscenes. Meant to highlight dramatic moments in the narrative, they just look awkward when placed next to the in-engine sequences. They don't spring up all that often but when they do they're really quite jarring.   The sounds are almost as good as the visuals. The authentic music and weighty combat effects are definitely solid and support the action of the game wonderfully. Most impressive however, is the great amount and vast quantity of voice acting. There's a lot of dialogue in this game and it's all done wonderfully, making it one of the few RPGs where you'll actually want to turn off the subtitles just so you can appreciate the acting. The few small cameos by well known actors are a nice touch as well. While it's apparently quite easy for a good RPG to turn the heads of our console editors and leave them gasping for superlatives, the fact is that the RPG market on the PC is considerably more competitive. Add in the fact that Jade Empire is nearly two years old and it's not hard to understand that the PC version isn't quite the revelation that it was on the Xbox.That said, Jade Empire is an instantly captivating experience for any action RPG fan who hasn't yet played it on the Xbox. The characters, settings and storyline are filled with fantastic details and the whole game is dripping with atmosphere. There are always meaningful and interesting choices to make throughout the game and a wide range of combat styles to explore. On the other hand, the linear missions tend to simplify the ~good~ and ~bad~ morality system and you'll need to focus on just a few combat styles in order to stay alive.Like the PC version of Knights of the Old Republic before it, Jade Empire is a remarkable RPG that, apart from better graphics and load times, really has little to separate it from the Xbox version from two years ago. If you've played it before, there's nothing here that you can't miss. If you missed the game on the Xbox, however, you're in for a real treat.", "date": "Feb 19, 2007"}