{"name": "Kirby's Adventure", "name_review": "Kirby's Adventure Review", "ref": "https://www.ign.com/articles/2007/02/20/kirbys-adventure-review", "text": "Kirby's Adventure is one of the best games to ever come from the NES. It helps that it was also one of the last -- Nintendo's 8-bit console had been on the market for nearly eight years already when the game debuted in stores, and the arrival of new releases had begun to slow down considerably. Those games that were still making it out the door benefited from the longevity of the system, as by 1993 the game programmers of the world had learned how to unleash every last ounce of power hidden inside the original Nintendo system. Kirby's Adventure was one of those late-generation games, and probably the best of them. Every programming trick and visual technique in the book was used here, and the result was fantastic. An 8-bit platformer that transcends its humble hardware, Kirby's Adventure is a journey you don't want to miss.   Kirby is a vacuum on legs. Short, stubby legs on a round, pink body, he's a mascot with a mission -- to suck. Kirby's primary method of attack is inhalation, opening his enormous mouth and sucking baddies into his body. Once there, Kirby can spit them out as projectiles, or swallow them in order to copy their unique powers.           Kirby's Adventure was the first game to feature power-copying for the hero, and there are a ton to find and use here. Swallowing a sword knight lets Kirby wield a blade. Eating a chilly penguin nets him the ability to freeze enemies in their tracks. Consuming a wheel-shaped foe transforms him into a tire himself, then able to race through levels at incredible speeds. And that's just the beginning. There are over 20 different copy powers for Kirby in all, and each one is just as fun as the last.   Some, though, have greater purpose. Kirby's Adventure is filled with secrets. Secret rooms, hidden doors. Cannons that blast you off into bonus areas. To find these places, you'll have to skillfully employ certain powers in creative ways -- like using the Hammer power to knock down posts, or the Fire ability to light a burnable fuse. Going for 100% completion is what this Adventure's all about. That, and pure Nintendo fun.   Kirby's Adventure may be one of the most pure fun games to ever come from Nintendo. It's just hard not to smile and have a good time while playing, whether progressing through the platforming levels, fighting in boss and mini-boss battles, or challenging the handful of mini-games. The mini-games, by the way, include a Crane game (like you'd see at a bowling alley), an egg-eating challenge, and a comical take on Nintendo's own Wild Gunman. Kirby has a series of Old West gunfights against increasingly difficult hombres, knocking off their 10-gallon hats with a variety of six-shooters. It's a blast.   The only negativity to level against Kirby's NES epic is its length -- because the game isn't very challenging, it can be easy to play through the entire experience quickly. But even though it's a shorter journey, Kirby's Adventure is an experience you don't want to miss. It's entirely likely you did miss it, before, at the end of the NES era. Even if you were around and gaming at the time, you had probably gone on to adopt a 16-bit console by the time Kirby's Adventure came out in 1993. But the technical prowess, perfectly tuned gameplay design and pure, unstoppable fun factor put this 8-bit opus overtop of almost any other game of that time period, advanced hardware or not.Kirby's Adventure can't be beat. Even if you own and have played through the handheld remake from years later, Nightmare in Dreamland, the original still comes highly recommended. It's Kirby in his purest, finest form. Don't miss it.", "date": "Feb 20, 2007"}