{"name": "Crackdown", "name_review": "Crackdown AU Review", "ref": "https://www.ign.com/articles/2007/02/21/crackdown-au-review", "text": "Over the last couple of months, IGN Australia has set loose upon the internet a veritable bounty of Crackdown coverage. We've outlined our 10 Reasons to play the game, we've explored the districts , and we've ranted about our co-op experiences. Why? Well, it's certainly not because we're in the pocket of Microsoft. It's because Crackdown really took us by surprise, hitting hard with a fresh take on the open-world genre that was instantly compelling and above all, fun. Here was a game that freed the player from so many of the usual shackles, instead making you feel like a super hero capable of extraordinary acrobatics and freeform violence, and giving you an enormous city filled with skyscrapers across which to prowl. It was liberating, and yet, now that it's time to shine the cold, harsh light of our analytical reviewer's spotlight onto the game, we'd be lying if we said it wasn't without its flaws. Simply put, Crackdown fails to build a compelling structure around its killer gameplay mechanics and stat system. Here's why.   Real Time Worlds present the player with a sprawling city encompassing three gang territories - Los Muertos, Volk and Shai-Gen. Each gang has a kingpin to take down, but in order weaken his operation, and thus make him easier to get to, you'll first want to take out his lieutenants. Each typically has a compound from which they operate, and the game is nothing if not freeform, allowing you to take on the bosses in any order you see fit. It's not long, however, until you realise that these encounters have little substance. Where one would assume that the gameplay mechanics and experience system would be the foundation upon which the headline act - the boss battles - are built, we found that the boss battles felt like a sideshow, something to occupy your time in between exploring the city and creating mayhem.   Gripping stuff. No, wait, I can come up with something better. How about... I can see my house from here! Sorry.  It's true that Real Time Worlds has built the layout of each boss compound so that there are a number of different ways to approach it, yet the reality is that a little scouting around and experimenting will - more often than not - yield you a direct path to the boss and close to an instant kill. Let's take the mining area in the Volk territory as an example. It's surrounded by sheer rock cliffs, leaving only one side of the compound as an entrance point. If you try and play through the area logically, by taking out the initial guards from up on the rocks then trying to make your way along the walkways from building to building, you'll come up against some steep resistance. Squads of enemy soldiers assault you, snipers with rocket launchers fire at you from atop nearby silos, and then there's a treacherous run along the excavated quarry paths to reach the cave where the boss is hiding. It's next to impossible to get through this way, as retreating to a safe point to regroup isn't an option thanks to enemies spawning in behind you. Even in the quarry you're incredibly exposed and roadblocks are set up to halt your progress.    Now compare this to the other way to complete the mission. A little leaping near the entrance allows you to skirt the entire compound. Simply walk around the top level of the quarry - which is an enemy free zone - then drop down at the entrance to the cave where the boss is waiting. We don't even need to point out how stupid it is that she's hiding in a cave filled with missiles and explosive boxes. Seriously, just fire a couple of rockets in and it's all over. But what about all those enemies outside? Well, by and large, as soon as you've killed the boss, every other enemy in the area simply disappears.   You'll note none of these screens are from boss encounters. Sigh.  Sure, in this instance you're rewarded for exploring, but what's the point of having a large compound to assault if you can just go straight at the boss? And in many cases no subtlety at all is required. I can't tell you how many times I drove into a compound and ran over a boss for an Insta-Kill, or lobbed a bunch of grenades from a few feet away while faced by little to no resistance. Actually, yes I can because there aren't that many bosses in the game. As such, they should mean something.   Part of the problem is that the bosses are essentially just grunts with a larger health bar. They're meant to be running important arms of each gang's operation - drugs, guns, intelligence etc., so should have a few tricks up their sleeves. If that means scripted sequences then so be it. Real Time Worlds definitely could have explored ways to make the boss encounters more meaningful without ruining the freeform approach of the game. For instance, there could be different scripted showdowns depending on how you approached the base, and these could be relatively simple - a survival vignette to secure the area, or a chase on foot or in a vehicle as a boss attempts to escape. All they'd need to do would be to bring a couple of defined stages into play while infiltrating a compound that must be completed before taking on the boss. Not only would this increase the impact of each encounter, it would bring a little more personality and narrative drive to proceedings.   Yet, in spite of all this, Crackdown remains a thoroughly enjoyable game. No other open-world title has taken advantage of a city's topography the way Crackdown does. The city is very much your playground, and the immensity of the buildings, combined with the fact that you can scale them and leap from rooftop to rooftop, makes exploration a whole heap of fun.   Better still, it's designed in such a way that you're driven to level up your character so you can reach that ledge, make that jump, and finally, scale the tallest buildings in the game over in the Shai-Gen's territory. As your character advances, you'll immediately notice the improvements, and the cycle begins anew.   That's just nasty. Fun fact - skinheads call kicking the crap out of someone   Agility is the critical darling of Crackdown's stat system. The greater your agility, the faster you run and the higher you jump. Raising your agility can be done in a number of ways. The most addictive method is by seeking out the 500 Agility Orbs placed on ledges and rooftops across the city. If you're anything like us you'll get sidetracked for hours, scouring every block for these precious glowing icons. Plus, the harder the orb is to reach, the greater its value. You can also earn agility by completing the on-foot races throughout the city, not to mention through gameplay - shooting enemies from a high altitude increases your agility. The agility system syncs in with the design of the city and your character's other abilities. Ledges can be grasped, so you can grab onto a window ledge of a skyscraper, then jump up and grab onto the next one. In this way it's possible to climb entire skyscrapers, and most gamers will relish the challenge of finding ways to climb the tallest buildings. It must be said, however, that some areas of the city are a little cluttered, making it difficult to work out exactly where you should be climbing. Thankfully, even if you wind up on the wrong rooftop, there'll doubtless be some agility orbs up there to make the trip worthwhile.     There are four other stats - driving, strength, firearms and explosives, and like agility, each is improved by actually using the relevant skill. Driving stats are improved by completing the various road races (which unfortunately are a little on the dull side), and by running over gang members, and will give you greater control over vehicles, as well as gradually morphing the abilities of the three Agency vehicles you can use. It's not long, for instance, until the Supercar simply scoops other vehicles up into the air, clearing your path as you drive.   Strength is levelled up by melee attacking enemies or by throwing objects at them (ah, that glorious shower of experience orbs, liberated from an enemy's corpse after you dump a car on his head), Firearms is improved by using weaponry to kill gang members, and explosives are kind of self explanatory - blow enemies up with grenades or rockets and you'll be rewarded by being able to set off even bigger explosions. You can also collect experience for all stats by finding the 300 blue orbs which are hidden throughout Pacific City.   Mayhem, mayhem, mayhem!  Whether you're assaulting a boss compound or just leaping about the rooftops, you'll encounter dense opposition from the incumbent gang of the territory. Thankfully, the combat mechanics are solid, although we would have loved to be able to cycle between targets instead of being forced to reposition the reticule then target again, as the current system can leave you targeting dead bodies or cars instead of those ten odd gang members trying to plug you. Still, the ability to target legs and arms works well, disabling enemies so you can go for the kill, while being able to target a vehicle's fuel tank is brilliant.   Mind you, if you were to have some variety of explosive-related mishap, it's no biggie. Crackdown is practically penalty free gaming. If you die, a clone - complete with all your experience, will take your place. Better still, dotted about Pacific City are a number of Agency Supply Points. Once you've captured a Supply Point, you can return to it at any time to restock weaponry, and choose to regen from it when you die. In fact, if you decide you want to be somewhere else in the city and can't be bothered making your way there, you can simply select ~Extract~ on the menu to drop down dead, then regen somewhere else. It's a simple, convenient system, but again leaves us wishing that there was more to the boss encounters to counterbalance the relaxed Supply Points system.   In any game of this size and openness, there are likely to be rough edges, and Crackdown is no exception. Some Supply Points respawn you surrounded by enemies, so if you're daydreaming, you can be dead within seconds or they could ignore you completely. Also, don't try shooting enemies from behind a low wall because instead of firing, you'll be more likely to start melee attacking the air instead. Slightly more vexingly, some items in the environment are only semi-persistent. Park a ramp truck somewhere, for instance, and more often than not if you die or leave the vicinity it will be waiting for you when you get back, but occasionally it won't. Speaking of the ramp trucks, positioning these strategically so you can launch yourself over fences or buildings is great fun, but fraught with problems. Traffic has a habit of very slowly going around it, which makes gunning at the ramp from a distance tricky. Even when you hit the ramp, there's no guarantee you'll drive smoothly up it. We had a lot of trouble launching the Agency Supercar off the damn things. None of these are gamebreaking, but show that a few more months development may have served this game well.   Of course, there's one other feature that really helps push Crackdown into must-buy territory. Co-op. Whether over system link or online, co-op is the icing on the Crackdown cake. This is a game jam packed with - for wont of a better expression - watercooler moments, and being able to share that over voice with a friend is brilliant. It's a hop in/hop out experience, and each player is free to roam the city as they choose, so you can team up to take on a boss or to challenge each other to a foot race, or you can go off and do your own thing. It's a great inclusion.   This is a world where every barrel must, by law, be filled with explosives. Makes sense to me.  Much has been made of Crackdown's presentation. No one was particularly sold on the game's cel shaded visual approach when it was first announced, but the end result has been toned down and looks fantastic. Not only does it bring a slight comic book tinge to what is ostensibly a game about being an ass-kicking super hero, but it's housed within a massive city with an incredible draw distance and nice day/night cycle. Get high up enough and you can see the towering steel of another gang's territory off in the distance. It's another way the game achieves its sense of scale.   Crackdown also comes packing some of the most gloriously over the top explosions to date. Sure, you may take your stats back a few steps by juggling civilian cars with a rocket launcher and decimating every vehicle on a city block, but it's so worth it. Not just for the explosions but for the gorgeous marriage of the game's particle and physics systems. Chains of explosions send charred remains raining down for hundreds of meters, once again reinforcing Crackdown's over the top mentality.   Theres a gaming phenomenon that a learned gaming scholar (that would be me) once coined with the term Tetris Brain. Its when  and this has probably happened to each and every one of you  youve played so much Tetris that you find yourself in a state in which shutting your eyes does nothing but yield falling Tetris blocks. Your brain rolls the theme tune around and around in your head, and everywhere you look you see chaotic patterns which need rearranging. Tetris Brain is, of course, not restricted to Tetris. It particularly afflicts puzzle game players, but excessive consumption of any genre can lead to it. Racing fans would know that taking a drive in an actual car after logging hours on a virtual racer will have you seeing ideal racing lines through traffic and around bends, while every corner becomes a fight against the perfectly natural notion that you really should be sliding sideways in a controlled drift.Crackdown also has this affect on me. Going outside after a long session leaves the architecture of Sydney looking like a playground. Tall buildings beg me to climb them, and Im convinced that should I reach the top, the warming glow of an agility orb would be there to greet me. Likewise, gaps between buildings start to look like challenges, not empty space. Its a sign that Ive played too much Crackdown, and that, despite its failings, its still a great game.Want to have your say about Crackdown? Rock on over to the  Aussie forums.", "date": "Feb 21, 2007"}