{"name": "Point Blank 2", "name_review": "Point Blank 2", "ref": "https://www.ign.com/articles/1999/05/08/point-blank-2-2", "text": "Last year, Namco released the arcade conversion of its arcade title Point Blank for the PlayStation  using the light-gun created for Time Crisis, Point Blank offered many games of reflex and sharpshooting skill for one or two players. Simplistic as it was, Point Blank was a massively fun PlayStation game, and Namco is revisiting the idea in Point Blank 2. Gameplay  Point Blank 2 isn't much of a departure from the original game  the idea is almost exactly the same: go through the game by utilizing your sharp-shooting skills and winning individual tests-of-skill. There are over fifty individual shooting levels in the game, but each requires you to aim your GunCon-compatible light-gun and shoot targets. You can also play the game with a standard controller, but take our advice: don't. It's not nearly as fun.   Just as example, here's a breakdown of some of the most unique levels in the game.  A massive flock of prancing sheep zip across the screen. Shoot each sheep to shear off his wool  it takes multiple hits to sheer off all the wool. Your quota is met when you've sheared a set number of sheep.  You have one bullet in your chamber. You're faced with a stop watch that's counting down. You must shoot the stopwatch as close to zero seconds as possible.  There are three cardboard cutouts of evil looking men, each holding a certain item (gun, teddy bear, ice cream). You'll need to shoot the man with the gun when all three cutouts are flipped toward you.  You better know your basic mathematics  you're faced with simple math questions (8  7, 2 + 3, 7 x 1), and you'll have to shoot the correct answer from a list of numbers. A quick mind and a quick trigger finger are needed here.  Ah, a pretty little house. Time to shoot out all the windows, doors, and flowerpots. Who says being a vandal is wrong? That house has to be toast in a set amount of time.  This isn't an ordinary rollercoaster  red and blue targets zoom along a track and you can only shoot your own color target.  Those damn ninja's are running rampant  shoot 'em all, but don't hit the innocent ladies.  Skyrockets are launched into the air, but they won't explode unless they're hit with a bullet. Plug as many of those fireworks as possible to meet your quota as well as to get a spectacular lightshow.  And these are just a mere handful of the 70 different games in Point Blank 2. Many of the games are tailored for two player competition  which one of the two can score the most points in the set amount of time. You can't screw up the other person (other than by actual, physical contact  like an elbow in the side), so it's completely up to pure marksmanship and a fast trigger finger.  The games are also spread over many different modes: Point Blank Castle (the standard competition mode), Theme Park Mode (a quest mode where you try and get through four theme parks of shooting games), and Party Mode (for tournament competition up to eight players). Graphics  Much like the original game, 3D isn't Point Blank 2's forte. Most all of the games have been constructed from flat sprites  on occasion a game will feature a 3D object spinning around with targets on a couple of its side. But all in all, the game will definitely not bowl you over from incredible special effects  which is just fine by me, since the games load very quickly because of their simplistic construction.  Sound Other than a few quirky Japanese-style arcade tunes and the sound of guns blaring and targets exploding, there's not much variety in this department. But hey, it's a simple arcade game, do you expect the William Tell Overture? (Wait, scratch that). I've always been a fan of light-gun games, back in the Duck Hunt days and even further than that (remember the Skeet Shooting game in the arcade where a machine projected a light on the wall, and you shot a flash at it with a ~rifle~?). Point Blank 2 is an excellent way to offer a variety of skill games in a single package, giving a good reason to keep your GunCon out with the rest of your PlayStation instead of letting it collect dust in a closet. But be warned: the challenges get extrememly hard -- much harder than in Point Blank. Keep that in mind if you've never played the original.", "date": "May 8, 1999"}