{"name": "Rugrats: Time Travelers", "name_review": "Rugrats: Time Travellers", "ref": "https://www.ign.com/articles/2000/03/25/rugrats-time-travellers", "text": "If there's ever a sure thing in videogaming, it's that a kid's game will be crappier than a doodie diaper. Barring a few lovingly crafted gems (and Nintendo's entire cannon), games made for children end up being terrible, and most often too difficult for the children the game is aimed at. Ergo, don't buy Rugrats on Game Boy Color, or any other system for that matter. All version of this TV series released so far have been loads, and the Game Boy version is no different.  Features  Based on the hit Rugrats Nickelodeon TV show. Includes theme music from the TV series by Devo's Mark Mothersbauh  Play as several Rugrats characters, including Tommy, Phil, Lil, Angelica, and Chucky. 10 levels of side-scrolling platform gaming. For Game Boy and Game Boy Color.   Rugrats: Time Travelers is a clunky side-scrolling game starring those adorable Rugrats. It seems that those darned babies have wandered into a magical toy store that has whisked them away in a magical time machine to nondescript historical epochs. Travel way back to Cave Man days and explore a cave. Venture back to Ancient Greece and explore an underwater city. Why any of this has to be seen with a time machine is unknown -- only a scant few levels have some interesting historic features.  What the game has going for it is the Rugrats characters. While the animation is choppy and the game moves slow, it is funny watching Chucky scream while riding a mine car, or seeing Tommy crawl around a level. Angelica walks with big, spindley adolescent legs, and there is even a point where Tommy dons a snorkel and bathing suit for underwater exploring. The graphics are big and bold, showing off the characters well.  Unfortunately, though, the gameplay is stiff and dull. The characters move at a snail's pace, and have no attack. There's nothing to do but just leap around and search for other Rugrat tokens -- again, for no good reason other than to finish a level. It's a simple jumping game, made even worse by the basic and confusing level design. Players will get lost all over the place, and to make things even harder for kids, there's a clock counting them out in a stage.  I had a hard time playing Rugrats: Time Travelers. A really hard time! It took me three tries to clear the second level due to the goofy level structure and short clock. Jumping over enemies is tough because of the stiff control, and while hits don't kill, they do take away the treasures you need to finish the stage. It's just a frustrating and very, very average game. Kids may like the big graphics in the game, they won't get much gameplay out of it, and they probably will never see some of the funnier scenes. Buy your own rugrat a Rugrats video instead.", "date": "Mar 25, 2000"}