{"name": "War Rock", "name_review": "War Rock Review", "ref": "https://www.ign.com/articles/2007/02/22/war-rock-review", "text": "Borrowing heavily from games like Counter-Strike and the Battlefield series, K2 Networks' War Rock delivers an online first person shooter that's hampered by unfortunate technical issues. Across its three game modes, players will split into two teams, either the Derbaran Military or NIU forces. Neither side has any real differences in terms of weapon loadout, but they do have differently colored uniforms and, depending on the game mode, different objectives. Though War Rock isn't coated in the most polished graphical luster and can't boast the best sound effects, there's a decent amount of game here, as well as a persistent online statistic system.   The game's five character classes all have their own uses, though their effectiveness largely depends on what mode you're playing. Medics, for instance, are well suited for the Counter-Strike style Close Quarters Combat mode, since they can heal themselves and teammates. Though they can't use the heavier, more powerful guns in the game, they can hold their own with MP5s. It's unfortunate that the developers decided to go with a syringe type health booster, since it requires you to be right next to a teammate to perform a heal and often results in an unintended self-heal. Had a health pack system like that in Return to Castle Wolfenstein: Enemy Territory been used, this awkwardness could have been avoided.    Then there's an engineer who carries around a repair wrench, most useful in the Battlefield-style Battle Group mode, or the slightly smaller scale Urban Ops mode in which vehicles and turrets are occasionally present. The heavy troopers, who can carry mines along with heavy machine guns and rocket launches, also tend to be more effective when vehicles are running around. The two remaining classes, snipers and assault soldiers, are effective across all game modes, one providing accurate fire from long distances and the other capable of charging into battle with assault rifles.   All classes have a standard set of starting weapons and items. Generally, you'll get a primary weapon, sidearm, grenade, bare fists, and a class-specific item. By competing in online matches, you'll earn experience to level up your profile and earn War Rock's form of currency, called Dinar. Eventually, you'll be able to use Dinar in the game's Item Shop to ~lease~ new, more powerful weaponry and items like a Desert Eagle, FAMAS, AWM Sniper Rifle, Winchester Shotgun, and M134 Minigun. For the more deadly weapon models, you'll need to meet a level requirement as well as a Dinar total. Even after dumping a ton of cash into leasing a new weapon, you can't retain them for more than 30 days, which is a strange design decision. Pumping in all that time to grind enough Dinar and experience for that shiny new Colt M4 only to have it taken away a month later seems unfair, but that's how it is in War Rock.    Once you're happy with your loadout and hop into a game, you'll see it handles itself slightly differently from a lot of other shooters out there. First off, you can roll forward, back, or to the side, accomplished by hitting Shift. This, in combination with sprinting, can help to keep your fragile self from getting punctured by too many lead pieces, and is regulated by a stamina bar. War Rock also gives you the ability to, like in Battlefield, quickly drop to a prone position, resulting in many firefights being decided by who can fall down and center their fire on their opponent the fastest. Since your character can't absorb all that much damage and headshots are pretty easy to pull off, toe to toe battles tend to be quick. In that sense, the game demands a solid set of twitch skills for players to be successful and top the server lists.   Each of the game's three modes offer one sub-mode. In Close Quarters Combat, up to 16 players can compete in ~explosive~ mode, where one side tries to plant and detonate a bomb while the other must defuse it. Urban Ops and Battle Group, which have player caps of 24 and 32 respectively, offer deathmatch modes, though in Battle Group a Battlefield-style flag captures is implemented to open up more convenient spawn points. In each mode there are a good number of maps available, though people seem to prefer specific ones. Marien seems to be the ~de_dust~ of War Rock's Close Quarters Combat right now, mostly because it offers a nice mix of cover spots and choke points through which players coagulate, filter, and fight.     If you head into a vehicle supported Urban Ops map or Battle Group mode, you'll find the machines are easy to control. On land you'll get humvees with mounted machine guns and rockets, anti-air trucks, tanks, and motorbikes, and few boats for water travel. Fighter jets are easy to pilot in the air, and it won't be long before you'll find yourself handling even notoriously tricky helicopters. Most vehicles have a few seats you can get into, including driver, passenger, and turret. Like in Battlefield, these can be rotated between with number keys. Conveniently scattered around each map are a few repair bays to patch up ruptured armor, just in case an engineer isn't present. The vehicles are modeled after real life versions such as the A-10 Warthog, K1A1 Tank, UH-60 Blackhawk helicopter, and F-15 Eagle.   War Rock happens to be a free game if you choose to download it online, but you won't be on equal footing with player who choose to play an optional fee. The game gives players the choice of paying for Bronze, Silver, or Gold membership levels, which each last 30 days. For the duration, players get a lump sum of Dinar, experience accumulation rate bonuses, access to all maps, priority login, the ability to create private and custom servers, and gold members even get a 5th weapon slot, though it can also be purchased from the item store. While the paying customers will be more rapidly acquiring more powerful weapons, you'll still be able to play for free, just at a disadvantage. There's a retail box available in stores as well, which, if purchased, bestows its own special bounties.    Though War Rock's shooting could have been more precise, the larger problem right now is frequent lagging. Quite often we had issues with the game chopping up significantly when we entered into a close range battle. The lag spikes really take away from the enjoyment this game would otherwise provide, since it renders your twitch skills totally pointless. Problems continue with the game's more advanced graphics options, such as motion blur, bloom glare, and after image, which didn't work properly one of our rigs, causing the game's visuals to be marred beyond recognition. We were running the game with a Pentium 4 3.40 GHz processor, 2 GB RAM, and a 512MB Radeon X1900, so there's no real way we should have been running into performance issues.   Eventually clan wars are planned on being incorporated into games, but as of right now the feature isn't active. Just as something to keep in mind before diving in, though the game is allegedly protected by Punkbuster right now, we still noticed a few people who seemed to be cheating.If you're sick of Battlefield or Counter-Strike at this point, War Rock isn't much of an alternative. It's an ugly game, its sound effects get annoying very quickly, and the shooting mechanics aren't very sophisticated. It's free, however, but that's about the best thing that can be said about it. Close range combat can be erratic at times, thanks to significant lagging and the frequency of headshots. With its three game modes, though, you can always move on to vehicle combat on large maps if you get sick of the smaller scale Close Quarters Combat battles. If you're really set on trying out a new shooter, definitely spring for the free download before making any purchases. It might be a while before War Rock's technical flaws are ironed out.", "date": "Feb 22, 2007"}