{"name": "GTA: London 1969", "name_review": "Grand Theft Auto: London 1969", "ref": "https://www.ign.com/articles/1999/05/11/grand-theft-auto-london-1969-2", "text": "Grand Theft Auto isn't the kind of game that's terribly popular these days, with current affairs the way they are, and Colombine High School's event still rocking the world to its core. But those of us with level heads who play games for the pure fun of it, simply must play Grand Theft Auto London 1969. Despite its rough-looking graphics and its occasionally shoddy control, GTA London 1969 is a genuinely fun game with plenty of innovative gameplay and a new, retro atmosphere, complete with great music and hilarious characters.  London 1969 is a game that requires Grand Theft Auto to play it. The Director's Cut includes both Grand Theft Auto and the add-on 1969. Gameplay Picking one of four characters, Said Vacant, Maurice Caine, Rodney Morash, or Charles Jones, players then immediately launch into performing tasks to earn a monthly paycheck. The gameplay may very well indeed be made up of simple, redundant task-driven goals, but once you get into it, GTA London is hard to put down. What drives GTA London 1969's fun-factor is the freedom of driving any car you feel like driving. Coupled with full environmental control - players can drive anywhere on the map - a monster-sized map, aggressive cops, and oddball tasks, and you've got a brilliant game.   Nobody said that it was all PC, though. GTA London breaks all of the rules (ethics and otherwise). Players can mow down innocent pedestrians, steal their cars, cause traffic jams, blow up buildings, and generally make ordinary life a total disaster. Given the recent videogame climate, this game doesn't sound very ~decent,~ or ~morally correct.~ Well, it isn't. That's what makes it so fun. (And for that matter it's the people playing the games, not the games themselves that provoke violence. But that's a whole other story...). What makes this palatable is its intentionally ribald humor and lack of realism.   Another aspect that this particular version has going for it is the ridiculous set of characters. You're first boss is a wrinkled old fart of a man, and his memorable line is, ~Remember, I'm the monkey and your the cheese grater.~ You've got to hear him say it. People on the street, cops, and hell, just about anybody your player meets is a hilarious caricature of an English person.  Graphics Visually, GTA London 1969 looks the same as the GTA that hit retail shelves last year. The biggest changes are textures, and nothing more. The textures show up in cars, parks, buildings, etc., and many parts of London are accurately represented here, so make sure to stop and smell the roses, given no cops are following you around or anything...  The perspective is still a top-down affair, and all of the controls are the same, too. Action is X, Punch is Circle, steal car is Square, and reverse is Triangle.  Sound Possibly the very best attraction to GTA London is its accurate, retro '60s sound. Each time a player steps into the car the radio starts the crazy beat. It makes one feel like doing the boogalo. DJs do their thing too, switch from female to male, and the songs they spin just reek of that groovy, good-loving time. Almost everything else is the same. Though there are a few exceptions. The characters are hilariously thick in the accent, and consciously so. It's just as much fun to hear the characters as is it is to drive the fastest car on the street. As with its predecessor, GTA London 1969 is filled to the brim with near genius gameplay, and it breaks all the rules, something that must be done once in a while in the videogame industry, especially when companies now depend on franchises more than ever. This game may appear simple - move from point A to point B - but it's the atmosphere and sheer audacity of the game that makes it such good sh%t. We reviewed this with a score of 6 last year, but that was a bit too harsh. So, we're making up a little with a higher score this time around. The pluses here are that GTA London 1969 sells for cheap, about $19.99. So for those who already have the original PlayStation game, this is a great buy. For those who missed out the first time, the Director's Cut, named in err, includes the first game and the London 1969 ~add-on.~ There's no Director's Cut about it. But just do us a favor. Either way the heavy packaging (stickers, maps, and a good manual) and price are certainly worth noting.If you're a young kid, explain the game to your parents and show it to them before you convince them to buy it. It's a safe game, but some parents may not like the overall tone.", "date": "May 11, 1999"}