{"name": "Lumines II", "name_review": "Lumines Plus Review", "ref": "https://www.ign.com/articles/2007/02/27/lumines-plus-review", "text": "Lumines stunned the masses with its incredibly addictive gameplay when it was released shortly after the PSP hit shelves in 2005. At the time the console was going toe-to-toe with Nintendo's DS and the mesmerizing sites and sound sounds of Q Entertainments puzzler was a good example of why Sony's handheld might run all over the competition. Two years have passed and the game has received a sequel and an appearance on Xbox Live. However, if your only gaming machine is a PS2 you may have yet to experience one of the better installments to the puzzle genre in recent memory. Lucky for you the Lumines 2 retains the beauty of the original release it just doesn't shine as brightly.     For the uninitiated, the premise of Lumines is simple. Squares made up of four smaller square quadrants fall from the top of the screen at varying speeds into a grid. The sections of the square are one of two colors that must be grouped with like colors to form a uniform square. This counts as a combo and is cleared from the screen by a staff bar that scrolls across the field horizontally. If the squares pile up to the top of the grid the game is over.    On paper it sounds straight forward or even a little dull, but what makes the game is that every action adds to the musical experience. The speed of the scrolling bar, the sound of rotating a block, and the colorful pulsating backgrounds, all correspond to the eclectic music offerings resulting in a puzzle game with atmosphere that often becomes hypnotic. The combination of these color schemes and songs are called ~skins~ and Lumines Plus offers a decent amount of extra skins on top of the originals from the first PSP game.      Because there are only two colors at a time there are only six possible squares that can appear making the gameplay appear deceptively easy. Smaller combos come naturally, but you won't hit really high scores until four or five blocks can be strategically clumped together for higher multipliers. There are also special blocks that appear in either color. When these blocks become part of a combo they cause all adjacent blocks of the same color to disappear with the next pass. They are the key to getting rid of multicolored piles and eventually lining up chain reactions that can clear the entire screen. A lot of planning must go into efficiently racking up big points in Lumines and the best way to master this is through the different game modes.    Challenge mode strings together multiple skins that appear for a set amount of time. As players survive each skin they unlock it for play in single skin mode. Single skin mode is exactly what the name implies so if you can't get enough of one music track or color scheme you can stick to the same one for the length of a round. Time attack forces players to complete a certain number of squares in 60, 180, 300, and 600 seconds. This is the mode that teaches players to rotate and place blocks with the most efficiency for the best possible result.    Versus mode is a split screen challenge that has two players compete on the same grid with a dividing line splitting it in half. Neither player can place blocks past this line, but by competing combos they can move the line further in their opponent's direction. This leaves less room to maneuver and speeds along a rival's demise. Versus mode can be against another player or the CPU (which is amazingly difficult) but there are no online modes at all in Lumines Plus. This is perhaps the most disappointing part of the game considering playing against a friend or comparing high scores on a leaderboard is what adds longevity to this title.    The final game type is called puzzle mode and it has players construct shapes out of like colored blocks. This is significantly harder than it sounds because the colored blocks cannot have any adjacent squares of the same color. This mode takes awhile to get the hang of and unlike Lumines 2 on PSP there are no tutorials included in Plus that help players get the hang of this challenge.    Graphically, Lumines Plus is rather disappointing. Both of the PSP versions of the game look flashy and stylized. This is in part due to the PSP's extremely sexy screen, but also because the games were designed specifically for that system. On 360 the game looked sharp in HD although the backgrounds suffered from some lower resolutions. Unfortunately, the PS2 version looks like a port with nothing added. The grid could have been expanded to fill the entire television screen and the backgrounds could have been jazzed up a little.    As with all versions of Lumines, the sound is still one of the best features. Some tracks are better than others, but each skin has a unique presentation that will keep you bobbing your head while hours of your time dissolve into color and rhythm. If you've already spent a lot of time with Lumines on PSP the older tracks are tiresome and there are some odd sound delays in skin changes but overall the tunes are solid.The core gameplay of Lumines Plus is just as attractive on PS2 as it was on other systems. However, this is still nothing more than a port of a PSP game. When you consider that the handheld version has already received a sequel with a ton of additional features its sad that nothing outside of a few extra skins made it to this release. Lumines II on PSP included a Mission Mode, Licensed Music, Skin Edit Mode, and more animated backgrounds to name a few features were missing on the console. Lumines delivers the goods on PS2 but dont be fooled by the Plus moniker, this is the least featured version of the game yet.", "date": "Feb 27, 2007"}