{"name": "MLB 2K7", "name_review": "Major League Baseball 2K7 Review", "ref": "https://www.ign.com/articles/2007/02/28/major-league-baseball-2k7-review-3", "text": "After particularly lackluster performances, athletes will sometimes wish they had a do-over in their back pocket.  That way, they have a chance to fix the mistakes that were made during a game, a series, or even an entire season.  Game companies want the same thing, especially when a title doesn't perform as well as initially believed.  When 2K Sports released MLB 2K6 last year, they were hoping to usher in the next generation of baseball.  Unfortunately, they released a game that barely fluttered across the strike zone.  But instead of forging ahead with new features slapped on top of problem filled play, 2K Sports decided to make MLB 2K7 its ~do-over~ title, focusing on fixing the previous year's flaws.   What does that mean?  Well, you're not getting the Cactus and Grapefruit leagues in this year's game.  Nor are you becoming the skipper of AA or AAA teams along with your Major League club.  Involved franchise economics and negotiations for GMs?  Strike three. Now, this may make MLB 2K7 sound like a mild roster update to the previous title in the series, even though some of the rosters are inaccurate.  For instance, David Wells and Jeff Weaver are still Free Agents, despite their respective signings with San Diego and Seattle. However, this couldn't be farther from the truth.  While many of the core elements from last year's game return, just about every aspect of the game has been adjusted in some manner.    One area that needed to be changed from last year was the baserunning. One issue with last year's game was that while it presented beautiful camera angles whenever you were sprinting along the basepaths, the ~turbo~ sprint mechanic with pounding a button would practically ensure that anyone with fast fingers could leg out a weak single that would otherwise be an easy out.  What's more, it was way too easy to bunch up players because the speed of the athlete you were sprinting with could easily overtake some of the other jogging baserunners.  Not only did this abuse the actual attributes for each athlete in the game, it made the realism of the game break down. Finally, removing the baserunning icons from a diamond and using numbers and the corners of the screen were extremely counterintuitive.   A lot of these issues have been addressed in MLB 2K7.  First of all, the baserunning icons have been eliminated in favor of a slick transparent overlay on the game action that gives you a sense of where baserunners are.  Secondly, the sprint mechanic has been eliminated.  While you can pound on the corresponding runner's button, he won't sprint off any faster than his actual stats dictate.  This makes it much trickier to make it to a bag or steal a base with a slowpoke, but you better believe that someone with wheels like Juan Pierre or Hanley Ramirez will be safe nine times out of ten for this year's game. Speaking of rounding the bases, the queuing up of bases works much better in MLB 2K7. For instance, if you hit a ball into deep left that goes to the wall and you're trying to extend the run, you can immediately pull the R-Trigger as soon as the fielder tosses the ball to the cutoff man and safely get a standing double without fear that your athlete will charge off for third.     Since MLB 2K7's advance and retreat commands are much tighter, you can even slide into a base and not be afraid that your player will pop up and make a move unless you're specifically giving him that command.  However, even with these old advancement issues fixed, you'll notice some odd hesitation steps whenever a player is rounding the bag and going for another base, even if you've queued up multiple bases. For instance, if you're on second base with a lead off and there's a solid hit into the outfield that isn't caught, you're not going to slowdown as you round third for home plate.  For some reason, every athlete has this hitch as they run, and this slowdown in speed can sometimes result in an unexpected out.     Fielding has also received a lot of attention, especially because some of the funkier issues that would crop up with players thanks to the Pure Motion Physics system.  Last year, it was extremely tricky to make cuts towards the ball or accurately get a jump on a pop fly because the game made turning and sprinting to an area on the field an extremely slow process.  In fact, if you managed to play a defensive adjustment just right and drop the ball away from a fielder, you could easily snag a single or double. What's more, some fielders would get caught in fielding animations before they tried to grab and throw the ball.   For the most part, both of these issues have been addressed in MLB 2K7.  The physics system behind turning and sprinting in the game is much sharper, and will give you the flexibility to adjust to a ball a lot faster than before. This means that it will be much easier to track down those screaming balls that make it into the gap, or make diving catches for pop ups that are just out of reach.  You'll also notice that athletes aren't as locked into animations as they were in last year's game.  It's much easier, for example, to have a third baseman grab a grounder down the line and fire it to first base for the out than watch him struggle to get it out of his glove.     There are still some odd issues with fielding.  For one, there are some strange hesitations with grabbing the ball every now and then, even though a player is in position to make the play.  I stopped counting the number of times that a shortstop was literally on top of a ball and somehow managed to miss the ball entirely, as if he's trying to barehand it and missed. The game doesn't count it as an error; instead, it registered it as if he wasn't in position to make the play at all.  Other times, with a runner on second during a pop fly, the computer will throw the ball to the catcher instead of the cutoff man, which lets the runner take third without being contested.  What's more, using the right analog stick to dive or climb walls is still a bit unintuitive.  While the hesitation isn't as bad as it was last year with diving, climbing walls will easily result more often than not in your players going face first into a wall than denying a homer. It feels like the tracking on the wall is a bit off, and even if your athlete has a foot on the wall and is timing the ball perfectly, they can (and often will) slide off and fall down.    Perhaps this has to do with the readjusted AI within the game to make the play seem much more realistic and honest to the game itself.  In previous baseball games, the computer had an unnatural way of playing a perfect, error free game.  In MLB 2K7, the AI will actually make mistakes that a human player would, which significantly adds to the gameplay.  For instance, outfielders will sometimes not communicate and go crashing into each other, causing the fly ball to go bouncing.  Similarly, players caught in a pickle may be able to actually escape the rundown because an infielder will make a bad throw or hesitate long enough for a runner to slide into a base. However, the computer still has a tendency to pull out error free play every now and then when it needs to, easily smashing balls that are outside of the strike zone for home runs or turning double plays to get back up to bat.   Unfortunately, The World Baseball Classic has been cut, meaning that international teams have been eliminated from this year's game.  Apart from that, the only changes that have occurred to the game modes are the visual facelift to the Franchise and GM Career modes.  The clean ~Franchise for Windows~ look with pulldown menus and segmented information puts the submenu data at your fingertips whenever you want it, and controlling the fate of your club much easier.  For instance, the trade finder, which simplified offering or acquiring players, was hidden in last year's game.  It's now extremely easy to jump into and change the makeup of your dugout (assuming other teams want the players you put up on the block).     Not only can you track stats like league leaders and budgetary concerns of your franchise, but you can constantly get news on the other clubs thanks to the upper right ~Buzz Box.~ Everything from trades to incredible performances scrolls through this informational area, which gives players a better sense of how the league is progressing as the season moves along. At the very least, 2K Sports should consider implementing this presentational style for its other sports titles and abandoning its cluttered menu system. If there was any criticism for the new Franchise/GM system, it would have to revolve around the ~low-level~ economy system that feels arbitrarily tagged onto the game.  The only control that you have over the money coming into the organization is by ticket prices. As a result, worrying about whether or not you've set the ticket prices too high and are collecting enough dough from your team feels extremely shallow.  Where are the radio spots, promotional nights, stadium maintenance fees or other vital organizational tasks are presented to you when you're worrying about your budget?   The improved visuals in MLB 2K7 aren't solely limited to the franchise and GM mode.  A ton of attention was paid to the various athletes within the game thanks to the so called ~Signature Style~ implemented for each player.  At the very basic level, it simply extends to whether or not a character wears baggy or tight uniforms or what their body shape looks like (including varying levels of guts for some players).  It's very cool to see the wind ripple the uniforms as you go from light to strong breeze during an inning, and the self shadowing on the character models looks great. Now, at its most detailed, Signature Style extends to everything from shin guards and gloves to rituals that each player breaks out at the plate.  We're talking about Nomar Garciaparra's wrist and elbow flap whenever he misses the ball to Derek Jeter's glove check.    Like last year, many of the faces for the athletes are good.  The detail in faces of athletes like Damon and Pujols definitely comes to mind. However, just like last year, there are still some athletes, like David Wright, who have a generic appearance. Some of the faces look like they've melted in the sun or have been fused into an amorphous blob. For example, Paul Lo Duca looks like the Phantom of the Opera.  The same can be said for the crowd, which just looks hideous. At least other presentational elements, like the television style camera angles, are simply beautiful.  Apart from K Cam, you've got the Grass Cam and Dirt Cam, which gives you a sense of being in the middle of the action.    There are also a number of visual issues that crop up during play. For one thing, players can sometimes phase through each other during slides or foul pop-ups. There are also a lot of camera issues that slows down the overall gameplay at random times. For instance, you'll pick this up during a zoom on a player stepping into the batter's box, and a strange amount of rendering passes filters over the stadiums and crowds in the stands every now and then. At first, it seems like it's a consequence of the overused blur filters on the camera lens that suddenly swing into focus, but the more you play the game, the more you notice that this happens regardless of the camera angle.  As an aside, what's up with the blimp and moon shots?  These are bland and generic camera angles that often showcase the slowdown of the game, and don't particularly match up with the rest of the gameplay.     Once again, Jeanne Zelasko and Steve Physioc provide pre-game dialogue, and are exceptional with their commentary.  It's apparent that these two have been spending a ton of time in the booth, with lots of new comments.  Unfortunately for Jon Miller and Joe Morgan, much of their dialogue is recycled from last year.  If you've played last year's title, you know practically everything they'll say from the viewer mail to the incredulous, ~You're killing me, Ump!~ Unfortunately, it also seems like there's a loop of this dialogue, so you may wind up hearing a lot of these lines in a particular game. Last year, MLB 2K6 was hamstrung by fielding and baserunning issues that hampered play.  This year, some of those problems were addressed in MLB 2K7, but others have cropped up to replace them: Odd fielding choices, hesitation steps around bases and tons of slowdown that randomly assaults the game.  That's also excluding the un-updated rosters, repetitive dialogue and other issues that crop up.  2K7 is still fun, but a number of its issues hamper the enjoyment of this title.", "date": "Feb 28, 2007"}