{"name": "Samurai Warriors 2 Empires", "name_review": "Samurai Warriors 2 Empires Review", "ref": "https://www.ign.com/articles/2007/02/28/samurai-warriors-2-empires-review", "text": "KOEI is up to its old tricks again. Unfortunately, that's a bad thing. Samurai Warriors 2 Empires, the simple action game with a smidgeon of strategy, is neither unique nor new, and sadly, there is nothing different or superior to the Xbox 360 iteration to recommend buying a next-gen version over a last-gen version.   Samurai Warriors 2 Empires is an example of KOEI's slow-going iterative development process, one that adds just enough of a tweak to legally call any new game a sequel. To date, the company has made more than a dozen games in this vein. All of them vary so minutely from the next that it's not only confusing to try and explain the differences between them all, it's relatively pointless.   This bulging list of titles is split into Chinese (Dynasty Warriors) and Japanese (Samurai Warriors) series: Samurai Warriors, Samurai Warriors 2, Samurai Warriors: State of War; and Samurai Warriors Xtreme Legends. Then there is Dynasty Warriors 2, Dynasty Warriors 3, Dynasty Warriors 4, and Dynasty Warriors 5; Dynasty Warriors 4 Hyper; Dynasty Warriors 4 Xtreme Legends, Dynasty Warriors 5 Xtreme Legends, and Dynasty Warriors 3 Xtreme Legends; and Dynasty Warriors 4: Empires and Dynasty Warriors 5 Empires. Perhaps, just perhaps, there is too much of a good thing.     Should you purchase yet another Samurai Warriors? Will this be ~the one~ to show them all up? Did the last two Samurai Warriors games turn your fingers blue by bashing the same buttons over and over again? Truth be told, Samurai Warriors 2 Empires will not wow you on either system. It will not deliver brand new gameplay or heavenly new graphics. Instead, what you will get is a strategy-infused action game that fictionalizes the Warring States era of Japan in gameplay.   There is little to no difference between the two versions, except for visual appearances. You'll get a great deal of set-up strategy, some of which is useful, some useless, a cyclical elimination system that functions a little like Risk, a decent variety of enemy classes with which to fight, and some good, old-fashioned button mashing. If you've beaten the last few Samurai Warriors or Dynasty Warrior games, Samurai Warriors 2 Empires won't do enough to warrant a new purchase. But if you have not played this type of game in a while, it warrants a look, simply because over time this brand of slogging is mildly addictive.    Samurai Warriors 2 Empires consists of a few modes of play, Free and Campaign. There is also a nice option to create your own hero, which can be leveled up in the meat and potatoes of the title, Campaign mode. It's where you'll set up invasions of other clans, defend against attacks, form short- and long-term alliances with other clans, and organize your armies. Since Dynasty Warriors 3, KOEI's Dynasty and Samurai games have enabled a second player to jump on board and play cooperatively via split-screen offline, and it's one of the game's biggest bonuses.     The Campaign mode offers you seven historic scenarios in which to engage. You'll start with regional scenarios and then move on to unification scenarios. Once you start taking over smaller territories in fights such as the Tonoku, the Kanto or the Chubu region, you reach a new stage. You'll then engage in unification scenarios including the famous battle of Kawanakajima (1561), the Unification of Kyushu (1561), the Unification of Chugoku (1561), the Unification of Kansai (1561), the Unification of Chubu (1561), the Unification of Kanto (1561), and the Unification of Tohoku (1561).   If this just looks like crazy historical nonsense, well, it's close, but it's not nonsense. Though KOEI might be guilty of repeating games 'til they're way past dead, it is very good at digging into Chinese and Japanese history and culture and re-creating past events in videogames. You'll re-live the Honnoji Incident where Oda Nobunaga met his end, and engage in the largest and most pronounced battle of its time, The Battle of Kawanakajima. KOEI recommends the famous battle of Kawanakajima (1561) for starters, and provides information on the warring factions of that year. Strange as it may seem, you can learn quite a bit of history from these games.   As suspected, the main goal of the Campaign mode is to become the most powerful clan lord of Japan, and you'll do so by forming allies with other factions, growing crops and managing money, delegating lieutenants to fight particular battles, growing your own set of skills, and increasing the strength of your armor and weaponry. The game starts off slowly, which is one of its many weak points. Unlike previous games where you'll be given a little bit of leeway to start with, here you're thrown right in to the foray. You'll have few allies and no points to your character to begin with, but after a few successful fights and enough level-up points to your character, weapons and army, the game slowly ascends into moderate fun.     Strategic elements are blended into the mix before, during, and after a fight to break up the monotony of two- and three-button attacks. The game actually has a life outside of each battle, hinting at RPG-infused strategy games from the past. For instance, you don't just pick a warrior, slog trough battle after battle, and occasionally decide to fight one battle instead another as a means of strategy. Instead, the campaign mode offers strategy, consultation, formations, delegations, and offers you the style of battle you'd like to enter into before and even during the game.   Life between battles is kind of fun. Once you've picked the right scenario, you'll then pick all sorts of things that determine the type and style of fight in which you'll engage. For settings, you'll select the rates of growth, time limits, number of new officers, officer limit, and officer deaths. You'll pick fiefs, or warlords, each with distinct characteristics. Differing character qualities range from defense ratings (1-5), harvests (1-100), and Ronin (which are rogue warriors), and finally ~Specials,~ which provide a unique ability for that particular character. Specials comprise grace, horses, potency, mines, focus, vitality, foundry, impulse, ninja tribe, karma, shop, imperial court, cavalier, trading post, and gunsmith to name a few.     All of these little micro-management techniques will either engageor bore you. If you like to fiddle with your new bladed sword by adding a new elemental attack, or find pleasure in tweaking the style of attack formation for your army before a battle, you'll like the in-between strategic details. If you just want to fight, you can, but you'll have to scroll through a lot of stuff to get into battle. And, by doing that you'll substantially lessen chances of winning a battle. After each successful battle, players receive the spoils of war. Defeated fiefs and generals can be hired or fired, money is collected into a bank account, and players then have options to pick or chose a unique set of Policy Cards. These cards offer opportunities like listening to your people to gain morale support, supplying more troops to ally armies, or learning the skills of an equestrian.    Other options include fortification (increases in soldiers for bases), Arrows (increases attack strength of allied army), Equal Start (begins the battle with roughly half of the bases on the battlefield under your control) and a few others. Each consultation costs money, but each battle is likely to bring you far more. Finally, you will pick a battle phase: invade, defend, joint attack, or join an ally. It's a strange relief to have the option to not invade, but to actually defend a base or help an ally. You'll then be offered choices to decide a tactic and a formation (wedge triangle, square, etc.) and, finally, you'll be able to fight.    Also, instead of just picking the same war chief each fight, you can switch to other clans to fight their battles, depending on whether you decide to invade or defend an area. All of the clan leaders look and play differently, from the weapons they wield to their special attacks, to their manner of attacking. For instance, one chief wields a heavy, slow axe, which is powerful once mastered. Another uses hand-to-hand combat. There is a wide variety of ancient swords, clubs, axes, daggers, and a half dozen more ancient Japanese weapons -- all depending on the character you pick or create. Unfortunately, the actual combo sequences aren't different per character. They're all easy and familiar, which is great if you've just started playing the series, but dull as a doorknob if you've played more than one game in the series.    While some folks might think all this preparation is just petty ornamentation for the same old game, there is a degree of truth to the assertion. Samurai Warriors 2 Empires still plays like the first one of its kind, Dynasty Warriors 2, but with better weapons, more powers, and a greater breadth of enemy types. The basic gameplay notion is still about plowing through enemies using simple combos and fending off hordes of enemies. The only things that make this version any different than the previous games are its breadth of enemies, the pre-game strategy, and oodles of mini details, most of which don't affect the actual combat itself.    I'll admit it, there are a few neat little extras that separate this one from the pack. Creating your own officer is pretty fun. It's also relatively deep, too, with choices to set family crests, pick voices and special skills, or choose from three existing moves sets (based on swords, spears, or naginata), or copy an existing officer's move set. Then there is the ability to form an alliance and develop that friendship in battle using multi-musou attacks. With one other officer nearby you can unleash a lighting musou, with two nearby you'll employ a freeze attack, and with three others, you'll pull off the grand dame of attacks, the wind elemental, which blasts even blocking enemies.    When it comes to combat, the game's main strategies still remain the same they have always been: 1) clobber base captains to gain morale and territory; 2) clobber one clan leader at a time to gain territory and morale; and 3) when faced with overwhelming odds, run away and fight another day. Interesting variants on those three tenets include the use of horses to fight, building up special attacks, and hiring weird and eccentric fighters such as wind ninjas, bomb-type allies, and sumo wrestlers to accompany you.    Visually and sonically, Samurai Warriors 2 Empires follows an old-school trend of KOEI's, which is to say that both graphics and sound are poorly handled.  The dialog, voice-overs and character interactions are primitive and laughable. While workmanlike on the PS2, the visuals are not improved in any way on Xbox 360. KOEI did very little to nothing in their simple port of the PS2 version to Xbox 360, and it's a shame. Pop-in and repetitive textures are everywhere. Characters fade in and out of thin air. Slowdown rears up regularly. This game looks like it did nearly six years ago, with very little in the way of visual or sonic improvements. KOEI's newest effort in its long-running series adds a few twists here and there, but the basic action stays simplistic and oh-so-familiar. The stategic elements do affact gameplay to a small degree, and the multi-musou attacks and the create-an-officer are neat extraneous additions. Unfortunately, the game's basic concept, button-mashing combat, really hasn't changed one iota since 2001. But hey, there is a two-person option for co-op play!", "date": "Feb 28, 2007"}