{"name": "Tony Hawk GBC", "name_review": "Tony Hawk's Pro Skater", "ref": "https://www.ign.com/articles/2000/03/25/tony-hawks-pro-skater-6", "text": "With the popularity of Tony Hawk Pro Skater on the console systems, it was inevitable that Activision would make the move to the Game Boy Color in some fashion. Instead of employing the help of the originators of the Tony Hawk series (Neversoft), Activision went with Japanese developer Natsume for the conversion. Obviously Natsume put two teams on the game, because the Game Boy Color version ends up only half-palatable.  Features Five courses Stunt moves Link cable support for two players Only for Game Boy Color  Tony Hawk Pro Skater on the Game Boy Color is split into two parts, a half-pipe freestyle mode and an overhead race. Both modes are used in the game's Tournament Mode, but you can access either one at any time to practice. There are three different halfpipes to choose from, and five overhead street courses to learn.  The halfpipe mode isn't half-bad. In this sidescrolling viewpoint, you simply move left and right in the slope and perform as many stunts as you can while airborne  if you're in the middle of a move when you land...bail city. Since you don't have to worry about going into and out of the background, you really only have to worry about gaining speed and pulling off the coolest combos possible. It's really basic, but oh-so-fun trying to get your guy to do a 720, an ollie, and a backflip all in the same move.  The overhead mode, on the other hand, is absolutely stupid. That may sound a bit blunt, but wait until you actually see this mode in action. As you skate in this vertically scrolling skatepark, you perform stunts when your character automatically jumps at the end of ramps. Now here's the kicker  instead of animating the sprites during a special move, the game actually pauses, loads a still screen of a skateboarder performing a stunt, shows that image for a full two seconds, then goes back to the game right where you left off. This abruptness during the game completely destroys the flow of the game  I really want to know who greenlighted this little slideshow feature so I can shake him violently. It's unfortunate that most of the game's focus is in this overhead mode.  What's worse is when you play the overhead game over the link cable mode, both systems pause when someone performs a move. When you see your character's move screen, the other player sees a generic ~look at that!~ still image for a couple seconds.  The challenge is less beating the other player to the finish, and more of how fast can you annoy your opponent with all the moves you can pull off.  I wasn't expecting much from the Game Boy Color conversion of Tony Hawk, and I didn't get much. The console Tony Hawk game is a nice, fluid, solid design, but the Game Boy Color rendition just seems too segmented. The halfpipe is loads of fun, but it can only go so far. The race is downright lame since the tricks you pull off are canned still images. I'll give this an average score simply because of the fun I had with the halfpipe, but be sure and stay away from the overhead levels.", "date": "Mar 25, 2000"}