{"name": "Horsez", "name_review": "Horsez Review", "ref": "https://www.ign.com/articles/2007/03/01/horsez-review", "text": "Ginger's on a quest. A quest to be an equestrian. She's a girl who loves horses, a girl who, in Horsez, has enrolled in a prestigious riding academy in Europe. She wants to be the very best. That's going to be difficult, though, as she lives in a game whose very best is average graphics, confusing gameplay and a heavy-handed presentation. Horsez presents a virtual world that could have inspired young men and women with dreams of becoming great riders, but it has too many flaws in its execution  those same young men and women would likely leave this title quickly, those same dreams damaged, if not destroyed.    Horsez chastises you almost immediately. Playing as Ginger on her first day at a new equestrian boarding school, you quickly meet up with the institute's resident principal and foreman. The former is a dead ringer for Captain Picard, the latter a bald and bearded beast of a man. Both characters yell at you. Clear, unmistakable verbal derision leveled at you, the player, for not doing well enough in achieving the game's goals. Games are meant to be fun  with non-player characters continually berating you in dialogue scenes, Horsez feels more like slave-driving work.    It's an aspect of the presentation that's meant to reinforce the setting of a strict boarding school environment, but it's a complete turn-off. And even if you manage to push past the intolerant text, the restrictive structure continues  Horsez requires you to schedule your gameplay activities on a chart. It's presented as Ginger filling out her weekly class and activity schedule, but in implementation it just means you're not allowed to do what you want to do, when you want to do it.    Lack of freedom in interface is crippling to what's supposed to be a virtual pet experience, a genre that really only succeeds when players get free reign and a rich array of options for playing with their pet. Horsez does have that, at its core, once you trudge your way through the muck to reach it.    You can brush and comb your horse's coat. You can clean its hooves and tend to its stables. You can use a stylus-controlled hose to give it a bath with a quick stream of soaring water, and more. Horsez's horse-care elements are done well, and are a bright spot in an otherwise dingy game. But the light doesn't last long, as care time is only one of eight activities placed on Ginger's schedule. You're quickly taken away from the more virtual pet-esque gameplay time and sent to forced socialization with NPCs, confusingly controlled training exercises, or reading.    Yes, reading. Simple, standard reading text from the screen. It's Horsez's Library mode, where Ginger must spend an allotment of points just to have the priviledge of cracking open a book and reading about various riding techniques. It's educational, sure. But to have it be required? Other modes in Horsez are unplayable until after you've spent the time to read the proper books in the library  you can't properly complete a round of Dressage mode, for example, without first reading about various gaits (horse speeds) and unlocking the stylus commands associated with each.       The game doesn't explain that to you, leaving you scratching your head in confusion if you attempt to play Dressage before spending several virtual hours in dedicated Library study. And even after unlocking the needed stylus command prompts, control is befuddlingly odd  as you and your horse walk, trot or gallop around a closed training field, circular icons swarm the screen for some untold purpose. Then, after trotting through a hovering speed marker, you've got about two seconds to trace the touch screen with a shape, like an S or a G.    If you were to find another Horsez owner, you could potentially add a bit more fun to this stilted experience by focusing on the foals. Foals, or baby horses, are the heart of another gameplay mode in Horsez, kept more separate from Ginger's academy simulation. Foal mode is more like a traditional virtual pet game, as you feed and care for your colt, train it and play with it using toys. The second player comes in if you feel like stepping into the role of equestrian salesperson, as you can auction a young horse to a friend and trade the virtual animal wirelessly to their DS.   Horsez is unfocused, doing a lot of things poorly instead of anything well. It's home to several confusing gameplay mechanics, some truly poor touch screen control implementation, and a presentation that's as off-putting and insulting as any you're ever likely to see. Stay away from this one, even if you're a horse lover  it's about as much fun as going to a real boarding school.", "date": "Mar 1, 2007"}