{"name": "Boss Rally", "name_review": "Boss Rally Review", "ref": "https://www.ign.com/articles/1999/05/19/boss-rally-2", "text": "I think there's some misunderstanding here at IGN. I think that people assume that because I'm from North Carolina that I'll actually be offended if somebody else reviews a racing game. I mean, I've done a lot of racing games lately and I'm getting jaded. I was seriously despairing of ever finding one that I might like again. And then came Boss Rally. Ah, like a ray of light in the suffocating darkness of too many...anyway, Trent has suspended my poetic license for 30 days, so I'll try to keep this literal.  This is the first racing game I've played in a while that successfully walks the line between challenge and fun. It is difficult, but the controls and the tracks are so great and so engaging that I keep going back for more. I've even gotten pretty good at it by now. It's like the saxophone, easy to play but complex enough...Ow! Sorry, Trent. Just when you think that the metaphor police have their backs turned...  The controls are definitely no frills. You drive the car with the arrow keys. If this doesn't make sense to you, look at them as you sit there at the keyboard. The rest of us will wait until you get it...  Got it? Let's continue then. You also have a separate key for the brake. I never use the brake in any other racing game I played but here it's absolutely essential. My usual tactic is to momentarily let up on the gas as I'm approaching a turn. In Boss Rally you use the brake to slide into the turns and still maintain a competitive speed. You also get a horn. I still don't get this.  For those of you who are truly gifted, you may want to select a car with a manual transmission. The automatic is nice for people who like to hold hands with their sweetie while they race, or make a sandwich or write a letter. The problem is that you can't get the acceleration out of an automatic that you can out of a manual. Lucky for you, every car comes in either a manual or straight transmission.  There's also a ~reset~ feature that allows you to drop your car on the track if you get stuck. If you wind up facing the wrong way or (gasp) laying upside down in the road, you can just hit this key and your car will be flipped right side up and deposited ever so gently (THUD!) in the middle of the track. You do receive a time penalty for this move however, so don't overuse it.  There are something like 16 cars in the game. When you first start out, you'll only be able to select from four of them. As you progress through the circuits, you'll get access to better and faster (mostly faster) cars. You can even customize them to suit each track. You can select ~grippy~ or ~slippy~ tires. This basically translates into on- or off-road. There's also a normal tire for you moderates out there. You can also adjust the softness of your shocks and steering. The steering sensitivity control is something that needs to be incorporated in most racing games. In so many of them the steering is either too tight or too loose. Here, you can adjust it to your own driving style.  Although there are only 6 tracks in Boss Rally, there are big enough and have enough shortcuts to seem pretty substantial. Unlike many other racing sims I've played lately, the tracks in Boss Rally actually seem like they were designed to be race on. It seems like in every other game, there's always a curve or a twist that's impossible to steer through at any reasonable speed. Geez, why not put in some speed bumps. Not so here. All these tracks are meant for racing and so they don't have any of those irritating traps found in other games.  That's not to say that the tracks aren't challenging. They are. And there are even some rough spots where you'll have to be careful. Actually, there are a lot of them. But none of the turns in the game are meant to stop your car dead.  The tracks are also fairly large compared to others. Most have lap times of over 2 or 3 minutes. This length keeps things from getting monotonous. When I race 5 laps on a track that I can circle in one minute, I tend to get a little bored. These tracks are also realistic and detailed. Thankfully, they don't have tons of distracting billboards, road signs or chickens lining the racetrack. That tends to make things feel a lot more open than in more claustrophobic racers.  The graphics for the tracks aren't flashy. That's what I like about them. It's simple and adds much to playability. There's enough detail so that you really feel like you're in a place but not so much that you're distracted. The little touches, like real-time skid marks and smoke coming from the tires, make this game that much more fun. There are also some pretty impressive weather effects. Apart from the handling problems, it's a real gas to drive in the snow or the rain or in a heavy fog.  The cars look good too. Each is painted with a horribly garish palette, but it fits in well with the whole racing concept. The car shadow and highlighting effects are nice but you won't notice them while you're racing. Who cares about light sourcing when they're in the middle of a race anyway? There also seems to be a unique damage texture for cars that have scraped the sidewall one too many times.  The car can be viewed from one of four different cameras. The basic 1st person view is the default. Although I normally prefer to play these games from a chase view, I found the 1st person to be the better of the two here. There's also an in-car view, basically just the 1st person view with a hood and rearview mirror, and a trackside view. If I live to be 40 years old, I'll never understand the trackside view. What the hell is it good for while you're in the race?  The music for this game is great. I'm just happy that I don't have to play another racer with a lame techno soundtrack. Apart from that, the soundtrack is the work of a talented, real-life music group known as Dragline. Someone once said that writing about music was like dancing about architecture so suffice it to say that Dragline hits a groove that perfectly suits this type of game. It's a little bit Modern English-ish but don't let that scare you. It definitely has the right energy.  The other sound effects were okay, but I actually had to go back and play the game again just so I could pay attention to them. This is less of a dig at the effects and more of a compliment to the music. It's a little unbalanced in the default mode, but you can turn the effects up a little to hear them better.  The goal in this game is to win the Championship. This consists of several seasons of a few races each. You have to pass the early stages to move on to the better cars and tougher tracks. You race against 19 other people. The AI isn't too smart, but it will try to get in your way as you're passing. Too bad, there's no damage potential in this game. The cars are all invulnerable.  Other racing options include the Time Attack. This is just what it says it is. You can also record your races and compete against yourself later in this mode. The Quick Race pits you against only one other AI racer. Both of these modes are useful for refining your skills. Don't forget to look out for the hidden shortcuts on the tracks either. Modem play is limited to two people, but other multi-player options support up to 8 players at a time.  -- Stephen ButtsI've played too many of these games not to know a good one by now. Boss Rally isn't the best but it has so much going for it that it really stands out above the rest of the crap...er, crop, that is out on the shelf now. There's no fighting and no cash system to upgrade your car. Other games justify this omission by saying that the game is focused on the race itself. This one finally has a clean enough race element to support that claim. What can I say? It's Boss..., Boss Rally.", "date": "May 19, 1999"}