{"name": "College Hoops 2K7", "name_review": "College Hoops 2K7 Review", "ref": "https://www.ign.com/articles/2007/03/07/college-hoops-2k7-review", "text": "Curse you, Missouri Tigers.   With .47 seconds in a Midwest beatdown in College Hoops 2K7, my Tigers were able to pull within two points of the St. Louis University Billikens. Another bucket would send the game to overtime or propel Mizzou to victory in one of the greatest comebacks the IGN offices had ever seen.   Somehow, Mizzou lost by nine.   I couldn't believe the self-destruction. As the nanoseconds ticked away, my players shook their heads during the stream of late fouls, head coach Mike Anderson fumed from the bench and announcers Vern Lundquist and Bill Raftery broke down the debacle.    I returned to the main menu emotionally wound-up, frustrated and angry, but all I wanted was to play again.   Welcome back to College Hoops. If you're reading this, you're probably a 2K fan and just want to make sure the ball wasn't dropped on the four-year-old franchise's jump to Sony's next generation.    I can assure you it wasn't.   The insanely deep Legacy mode with recruiting, pre-season camps and the Selection Sunday show? Intact. Lots of real college coaches such as Roy Williams, Jim Boeheim and Kelvin Sampson? They're stomping the sidelines. Online leagues, Greg Gumbel post-game shows, unlockable balls, challenges and cheerleaders galore? You can bet your bracket they're on the disc.   There's so much to the game that it's hard to talk about College Hoops and not sound like I want it to have my babies.    You know, College Hoops 2K7, I usually don't say this about video games filled with nubile, sweaty men, but you sure are pretty. Your arena floors reflect the sparkling stadium lights, jerseys and shorts ruffle as my point guard breaks to the basket and replays and cut scenes look downright mesmerizing as sweet drips and faces contort after questionable calls. Sure, when one of your players leaves the ground for a shot or block, his jersey inflates as if he was standing over a fan and some of the stadiums are a bit too generic, but those are just two small flaws, baby.    I think I love you.   Now, reader, you can mock me all you want, but you need to understand - I have basketball video game relationship baggage. I used to be in an abusive relationship with EA's March Madness. Year after year I'd buy EA's newest installment of its flashy series and end up being let down. I needed a game that would listen to my needs - namely well-rounded gameplay - but all EA would offer was an offense that revolved around holding turbo, driving to the hoop and dunking.    It's like I was from Mars, and EA was from Venus.   College Hoops understands me. If I lose in 2K's game, it's because I didn't move the ball efficiently enough, I didn't take my shot when I had it or I missed my free throws when it counted. There's a strategy in 2K's monster beyond holding turbo.   That's awesome.   Of course, like any solid relationship, there are growing pains. When 2K and I first hooked up with College Hoops 2K6, I thought the title had a good personality - tight controls with bright AI - but was let down on the overall promise. See, 2K6 promised an authentic college basketball experience but featured players that seemed as if they just stepped out of the Speed Force. Guards and centers would shoot up and down the court in a way that made every play feel like a fast break and detracted from the satisfaction of working the ball around the perimeter to the open shooter.    2K7 fixed my players' need for speed. You can hold R1 for a boost, but any other time your players are moving at a reasonable speed to set up screens and work out plays. Although the rest of the controls are pretty run of the mill, the use of the Six Axis for free throws - tilt the controller back and rotate it forward as the player shoots - takes some getting used to but ultimately is more satisfying and challenging that 2K6's similar use of the analog stick.    Getting your legacy team on a roll takes a detail-oriented eye. As you navigate your calendar and delegate which coach is recruiting what player, you also have the option to monitor your current roster. If one player is down, you might want to consider doling out one of your ten pep talks. When game day comes around, a Unity meter in the lower left corner of the screen tells you how well your team is meshing. Substitutions will either add or detract from their cohesion and that will equate to success on the scoreboard.    When your heart starts racing and your team goes on a run, be prepared for your opponents to lose composure and start bumbling - when my Tigers would get a kick start, terrible passes, bad shots and out-of-position players became the hallmark of my rivals.   The action on the court is mirrored by the clamor of the crowd. Although I could have done with a more active throng of hardcore hoop fans rather than the placid crowd in 2K7, their vocal intensity is unbeatable. Play in the house Coach K built, and the Cameron Crazies get louder and louder as the Blue Devils pull away. Head to Kansas to face the Jayhawks, and the crowd inside Phog Allen Fieldhouse breaks out their eerie chant of ~Rock Chalk Jayhawk.~If youre a college basketball fan and you own a PS3, theres really no reason you shouldnt buy this game. The Legacy mode is deep, you can create your own online leagues and when all that gets boring, you can try to make dirty chants in Chant Creator. Its the basketball title that keeps on giving.", "date": "Mar 7, 2007"}