{"name": "Kid Icarus", "name_review": "Kid Icarus Review", "ref": "https://www.ign.com/articles/2007/03/07/kid-icarus-review", "text": "Kid Icarus is a classic Nintendo title, a platformer whose titular character has gathered a cult following of fans over the past 20 years. Those fans have raised their voices for decades now, crying out for a sequel, a rebirth, anything. Any sign that their winged hero was still alive and recognized by his parent company... and other than a Game Boy sequel way back when, it hasn't come yet; but at least we have the original.   And the game itself is pretty cool. Pit's platforming adventure through Angel Land was the sister game to Metroid. Both had a lot of elements and programmers in common, but Kid Icarus stuck to a tradition style of level progression. Complete 1-1, go to 1-2, and fight a boss at the end of each fourth stage. The key difference with Kid Icarus was its orientation -- you don't side-scroll, you scroll up.   Well, okay, the second world is side-scrolling. And the dungeon levels are different. But Kid Ick's vertically laid-out levels have always been its signature, along with its lofty degree of challenge. As a little winged kid with a bow and arrow, you start this game with meek and humble status. And, as such, it's tough. You jump up the levels, enemies swarming you from all sides, platforms small and difficult to land on precisely and, to top it off, you're constantly scrolling away the ground that used to be below you.   If you should happen to mis-jump and fall into the black abyss, you're finished -- unless you have a feather. The item will save you from a plummeting doom, as your wings kick into gear and you fly back up to land on firm, floating earth. Kid Icarus has a lot of items, actually. Weird, wacky collectibles like chalices, and pencils, and credit cards. The system for earning hearts, Angel Land's currency, and cashing them in for goods in mid-level shops is odd. A lot of the Kid Icarus game design is odd. This is one of those games that made a lot more sense back in the '80s, accompanied by a tips and tricks strategy sheet, or a Nintendo Power guide. Removed from its context 20 years ago, the title just doesn't hold up as well.Kid Icarus is a tough target to hit. On one hand, it should earn a recommendation based on its history, its cult following, and the fact that its central character is finally coming back into the spotlight (through Super Smash Bros. Brawl) after an absence of so many years. On the other hand, this game design hasn't aged in as timeless a manner as many other first-party Nintendo games from the NES era. Kid Icarus is still a good game, and there's still fun to be had in Angel Land -- just don't expect heaven on earth.", "date": "Mar 7, 2007"}