{"name": "Carol Vorderman Sudoku", "name_review": "Carol Vorderman's Sudoku Review", "ref": "https://www.ign.com/articles/2007/03/09/carol-vordermans-sudoku-review-2", "text": "If you're reading this, you're either a Sudoku fan and want an honest review of this game or you're some sick bastard hoping I'll tear Carol Vorderman a new one for bringing cleavage-exposing blouses and math into video games.   Sorry to disappoint you, jerks, but this is going to be a pretty positive review because as far as video games about Sudoku go, Vorderman is tops. This title from Empire Interactive features four single-player modes including a career with seven skill levels, tutorial videos and the chance to create your own Sudoku puzzles.    With the print version of Sudoku dominating newspapers across the country, I'd like to believe most people have a grasp of how the game works, but after having to explain it to several IGN staffers and watching their heads nearly cave in, I can see that isn't the case.    In Sudoku, a square is broken into nine smaller squares and each smaller square is broken into nine mini-squares. At the onset of a Sudoku game, numbers appear in some of these mini-squares. It's your job to fill in the rest of the numbers. The numbers one through nine must appear in each column and row of mini-squares without doubling up, and the numbers one through nine must appear in each of the original nine smaller squares without doubling up.   On a piece of paper, this process involves a lot of scribbling and erasing as you backtrack to find your mistakes, but on your PSP, it's pretty simple - use the D-pad to move and the X button to select the mini-square you want to write in, the cursor moves to a list of numbers and you can press X to choose a number. If there are still multiple options for the mini-square, you can press circle when selecting an integer and a small number gets jotted in the square. You can put all the possibilities into the square and continue to work hoping the process of elimination will solve the puzzling piece.  Aside from not having to use an eraser over and over, the electronic version also beats out the newsprint standby in terms of the big picture. Green row and column highlights focus your attention on the numbers that would affect your current choice, and a grid at the bottom of the screen lets you know how many times you've used each number.   Confused? Vorderman is here to help. Aside from the assists you can turn on and off in ~Classic~ mode, Vorderman pops up the moment you boot up your system to give you a brief introduction to the game - it was originally called Latin squares - and the peppy Brit can be called upon from the main menu for more tips and tricks.   However, she never answers the most important question - who the hell is she to be telling me how to play Sudoku?!    Turns out Vorderman - no relation to the guy who iced Harry Potter's folks - is kinda like the Bob Barker of the UK. She co-hosted Countdown, a game show that tested the intellect of contestants, for more than 20 years.    For a game that revolves around the same grid screen after screen, there's a lot to do in Carol Vorderman's Sudoku. If you're flying solo in your Sudoku adventure, you can choose the classic mode and choose puzzles that range from easy to ~super-difficult;~ try the arcade mode that can put you in a race against the clock or a battle to complete the puzzle perfectly; select to start your Latin squares career and complete close to 40 puzzles as you rise form a lowly white belt to a Sudoku black belt; or ~Challenge Carol~ and try to beat more than 20 puzzles in less time than it took Vorderman to do the same.   Got a psyched Sudoku fan over for dinner? Try the multiplayer mode to see who can solve the puzzles the fastest as you pass the PSP back and forth, go head-to-head if you both have systems and copies of the game, or open up ~Sudoku Solver~ and see who can come up with the craftiest challenge.Most folks are going to think Im being too generous with my rating, but its important to recognize that Im this is a Sudoku video game. Vordermans not trying to pump out a Zelda title or something with characters and a story  this game is all about furthering the addiction that is Latin squares. If youre into number crunching for fun, this is the PSP title youve been waiting for.", "date": "Mar 9, 2007"}