{"name": "MotorStorm", "name_review": "MotorStorm UK Review", "ref": "https://www.ign.com/articles/2007/03/09/motorstorm-uk-review", "text": "There are so many crashes in MotorStorm it wouldn't surprise us if the Department for Transport started using clips of spectacular smashes for its next road safety campaign. 'Driving too fast off cliffs can KILL', the ad might say. 'Smashing into a 50-ton boulder at 30mph will leave a nasty scrape on your paintwork; at 100mph you'll DIE' could be another slogan. Only you won't cark it. Sure, you'll likely lose a few precious seconds and the battle for first place will become more of an uphill struggle, but moments after your dune buggy explodes in a shower of body panels and flaming engine parts you're back in the hot-seat and the race is on once more.   See, crashes are an integral part of MotorStorm, just as powerslides are at the very core of Ridge Racer 7. Without them Evolution's dirt racer would be a much less enjoyable, perhaps even sterile experience. As it is, they're one of the reasons why the game is so fun. Winning is great, of course, but there's so much satisfaction to be had from boosting off a ramp and flying a hulking juggernaut through the air before slamming it into a bloody great rock. What's more, the resulting car crash porn - as your vehicle disintegrates into a mess of suspension coils, brake discs and other mechanical doo-dahs - is a real testament to PS3's potential. Quite simply, videogame vehicles have never looked so good, even when they're in bits.    First things first, though. MotorStorm is a turbo-charged off-road racer whose no-frills, over-the-top gameplay sticks its fingers up at fuddy-duddy realism. You can't fiddle around with the set-up of your motor to squeeze extra power out of the engine and there aren't thousands of stick-on logos and go-faster stripes to tart your car up with. What you do get, however, is a pure-bred arcade racer that focuses on what happens out on the track, not the tinkerings of a mechanic in a garage.   The single-player race campaign is broken down into a series of individual challenges, called tickets. These are comprised of one to four races, usually set across different tracks in different vehicles. The rigid structure of the opening half-a-dozen tickets serves as a (sometimes not-so) gentle introduction to game, enabling players to familiarise themselves with the subtle differences between the handling of each vehicle type, as well as learning the basic controls. And when we say basic, we mean it: you don't really need to brake that often, so flooring the accelerator and yanking on the steering wheel is usually enough to give you a podium finish, at least to begin with.    However, there's a lot more subtlety to MotorStorm's gameplay than is first apparent. For starters, the tracks - of which there are eight - have a lot more depth and complexity compared to those in most other off-road racers. Each one is a giant, multi-routed raceway littered with obstacles. Take the opening circuit - The Grizzly - for example. The opening straight soon splits off in multiple directions, with part of the track dropping off to the side and a bridge branching off in the other direction. During your first two or three races it's likely you'll go in whatever direction your car happens to be pointing. But that's rarely the best option, because each vehicle type is particularly suited to different routes around the track.   As for the handling of the vehicles, Evolution has got it pretty much spot on for each one. Heavy trucks will happily plough through the wreckage of other cars and are great in a straight line, but they're sluggish around corners. Buggies and bikes are much more responsive but, on the downside, are more fragile and will explode if they so much as clip an obstacle. Then there are rally cars and mud-pluggers, which sit somewhere in the middle. So, if you're driving a big rig you'll want to avoid the jumps and narrow routes that snake along the higher sections of the track, instead sticking to the path that cuts through the bottom of the canyon. Likewise, if you're racing a bike you'll do best to steer clear of the muddy straights on the desert floor, not just because your tyres will struggle for grip but also because the racing trucks will make mincemeat of any spindly biker stupid enough to get in their way.     In fact the aggressive way the AI cars react, not only to you but to each other, often plays a big part in the outcome of races. If you nudge an opponent into a rock they'll come back at you, slamming into your tail until you spin off. Admittedly they're not so evil that the entire pack will hunt you down if you go around ramming other cars, but a careless side-swipe could lead to a revenge attack that costs you a win.   Nowhere is this fierce AI more evident than on some of the later tickets in the game. By the time you reach the fourth difficulty level, which is roughly 15 out of 21 tickets in, finishing anywhere near the top three - which you need to do to progress to the next round - is a constant struggle. Get embroiled with another car and you'll almost always come off worse, either losing the racing line or being wiped out completely. Even if you get ahead of the pack you can't afford to make a single mistake, otherwise the other 14 racers will be all over your backside, viciously fighting for first.    As such, playing MotorStorm on the later levels can be quite a frustrating experience, because all too often you'll be having the race of your life, only to make a mistake - a tiny one at that - on the  final bend and up out of the competition. We don't mind a stiff challenge, but when the other drivers seem to have an unfair advantage - they rarely make mistakes and will pretty much always beat you in one-on-one jostles for positions - it can be a bit annoying.   Thankfully, there's some respite to be had from other drivers in the form of the turbo boost. As anyone who's been following MotorStorm will already know, boosting out of corners and over jumps holds the key to winning races. Likewise, most will already know that if you boost for too long your engine will overheat and your car will explode. Learning when to best use turbo is a game in itself then, working out when a few precious seconds of speed boost really makes the different.   This is especially true when it comes to the online game. Rather than offering a traditional catch-up feature, MotorStorm gives any racers trailing at the back of the pack extra turbo boost which, if used correctly, gives them the chance of rejoining the front runners. In practice it works really well, with players of varying skill levels competing on a much more even playing field. Naturally it can be turned off though, in which case the turbo boost works in exactly the same way as the single-player.    In fact MotorStorm's multiplayer game is just as enjoyable as the single-player experience, possibly even more so. Admittedly the menus look a bit half-finished, but in-game every race is just as intense when you're competing against 11 other human racers as it is against AI opponents, plus you've got a better (or at least equal) chance of coming out on top in a fight for first. Nobbling other human players is infinitely more satisfying than ramming a faceless computer car too. In other words, anyone who's considering buying MotorStorm should definitely make sure they get their PS3 online, otherwise they really will be missing out on a huge, extremely enjoyable chunk of what is one of the best launch games for PS3.MotorStorm has been a long time coming but were happy to report its been well worth the wait. When we played early code back in October last year we had a feeling the single-player game was going to be something special and we havent been disappointed. Its not the fastest racer on the circuit  in fact it seems pretty lethargic at times, although switching to the in-car view really ramps up the feeling of speed  but its certainly one of the most enjoyable and best-looking. The loading times are sometimes iffy and it can take up to 30 seconds just to load a track, but once youre behind the wheel of a souped-up rally car, churning through thick mud while quads, bikes and racing trucks nudge at you from every side, you wont really care.", "date": "Mar 9, 2007"}