{"name": "TMNT: Power of 4", "name_review": "Teenage Mutant Ninja Turtles: Power of 4 Review", "ref": "https://www.ign.com/articles/2007/03/13/teenage-mutant-ninja-turtles-power-of-4-review", "text": "In accordance with Mobile Gaming Law, with a Teenage Mutant Ninja Turtles movie soon to hit theaters, there must be a mobile action game starring the four heroes on a half-shell. And so, as it is written, publisher uClick and developer Overloaded have rolled out TMNT: Power of Four across the decks to capitalize on the buzz surrounding the upcoming animated release. But unlike some recent licensed games that have delivered on the atmosphere of their source material with clever, intelligent design -- such as Warner Bros. and Universomo's 300 -- TMNT falls back on cookie cutter mechanics to deliver an underwhelming game.   TMNT is a platformer very reminiscent of the old games for the NES and SNES. You walk from left to right, using the turtles' ninja talents to swat and slice through hordes of enemies. You can switch out the turtles with a press of the left soft key, gaining access to weapons with a longer range, such as Donatello's bo staff or the close-in power of Michelangelo's nunchuks. Each turtle has a special power, and the choice of these powers represents one of the first problems with the game. Leonrado's special talent is running. Michelangelo's gift is jumping across gaps.   Wait. I thought these turtles were ninjas? Aren't running and jumping just part of the basic ninja toolset?   The action grows repetitive right away. You inch through decently detailed environments, attacking enemies until the ~Go!~ arrow says you can move on to the next segment of the level. Enemies attack on two levels, so you must press up and down to move between the parallel levels. And these bad guys are dumb. In the first level, for example, the gunmen holding April O'Neil hostage are so stupid that they will not crouch to shoot you as you crawl along the ground. Even if you are ducking five pixels away from them, ready to smash their knees with nunchuks, they will lower their weapons. Yes, I know that this is how you defeated many enemies on the NES in 1987. But that was 20 years ago.   In a later mission, you go head-to-head with more accomplished swordsmen in a mansion. These guys move a little faster, but they exhibit no more smarts than the dunderheaded gunmen. You'll find your self dying not because of their carving skills, but because controlling these pokey turtles is so frustrating. The clunky means of switching between levels and slow movement makes you a prime target for an AI-controlled enemy that needs not fiddle with an unresponsive control scheme. There is no more lethal combination than tired platforming mechanics and iffy control.   There is a driving sequence where you pilot the Cowabunga van down a street, trailed by a massive monster. (Sorry if that spoils something from the movie.) These scene is actually a bit better than the platforming. You must shake enemies via use of an oil slick. The scrolling is clean and smooth. I found myself wishing there was more driving and less platforming, but an entire TMNT racer doesn't really make much sense.   Overloaded did a solid job on TMNT's visuals. The turtles and enemies are pretty good sized with some nice detail, but having such large characters cuts down on the available game space. When you're shot or sliced by an enemy standing off-screen, that's something of a pisser. The use of color is strong in TMNT. The background music is also pretty good.  TMNT: Power of Four relies too much on basic platforming mechanics to be interesting -- and that's even to a hardcore Turtles fan. The slow movement, special moves that should be regular moves, and dim-witted enemies add to the frustration. While I appreciate that the origins of this game are in the classic console and arcade titles, this design just doesn't work for a mobile game in 2007. Save your money for a movie ticket instead.", "date": "Mar 13, 2007"}