{"name": "High Heat 2000", "name_review": "High Heat Baseball 2000", "ref": "https://www.ign.com/articles/1999/05/21/high-heat-baseball-2000", "text": "Finally, all of the baseball games are in for 1999. With 3DO and Team .366's last entry of the year, we can compare and contrast all of the game's with the eyes of a decent ump, or a least a keen talent scout. High Heat is one of those games that gets almost all of the fundamentals right, and hurls in a few goodies for extra measure. But it looks like last year's game, it's packed with its fair share of problems, and it wouldn't be our first PlayStation pick for 1999. Gameplay Using code from last year's PC title, High Heat has potential. The fundamentals are all right there. But in 1999, Interplay, 989 Studios, and EA are out there pushing the limit in look and gameplay, and they've pushed the game in new and subtle ways. Plus, they've all been available for about a month and a half. High Heat, at best, is a decent arcade-style game with a simple interface that doesn't do anything new at all. Depending on how you look at these facts, you may love or hate it. The fact is I neither loved nor hated it. It's the kind of game you don't fall in love with, you just kind of like it, sorta.   Statistically, High Heat is the kind of number crunching game that all players enjoy. It's all good with league leaders, team standings, and lots of up-to-date rosters. And for those who insist (OK, everybody does), the game includes licenses from the MLB and the MLBPA, so you can see and play as your favorite player.  The game is full of relevant modes. It's no slouch there. It's got Exhibition (play an entire game with your choice of 1-9 innings); Family Mode (all options, including pitching and fielding are completed by the AI, players just swing when batting); Season (a complete season, with computer generated stats); Playoffs (play in the post season without playing in the regular season), and Home Run Derby (Who hits farthest? Complete Home Run Derby championship).   With regard to pitching, we had problems with the game. Depending on the kind of pitcher chosen, the pitches he's capable of vary. Some throw forkballs or sliders, others hurl changeups. Curves and fastballs are available for every pitcher. That's all fine and dandy. But for the relatively fast pace of the game, the pitching is a lesson in patience. It seems like it takes years to get a pitch off, while the computer AI is as quick as Ricky Henderson (well, as quick as was back in the day). Additionally, fast pitches seem damn slow, and difficult to determine at best.  The thing about High Heat is that it's not a miserable game (though it's damn close), but it's like there's no there there. The way in which players bat is simple but not subtle. You don't get the feel of having hit a homerun when you smack one, and a single doesn't feel any different than a triple, or for that matter a homerun. Fielding is basic fare as well. Fielders could be sped up a little. It takes fielders forever to get from point A to point B.   Baseball is really a game of subtleties, and High Heat is like a dull pain, a limp sandwich, or a Fresno politician. It's a straightforward title that lacks the little details. It lacks punch. Graphics Well, if the gameplay part didn't thrill you, it's time to go home. Graphically, High Heat is the lowest on the totem pole. Interplay Sports Baseball 2000, less glamorous looking than either Triple Play 2000 or MLB 2000, is miles ahead of High Heat. With slow frame rates and less than average motion capture features, High Heat looks like somebody stole frames from the final code and then replaced them with a strobe light effect and a pixely paintbrushed set of lego players. The whole game is choppy, boxy, and crude.  With players moving jerkily around the field, pitchers barely able to move through a complete follow-through sequence, and base runners zipping around like little robots, this game smacks of old code, completely lacking the kind of realism seen in other games this year. Even EA's Triple Play, which is more of an arcade game, feels more realistic than this.   A few things did make us laugh; several animation sequences were noteworthy. When a pitcher misses what he thought looked like a strike, he throws his arms up in disgust. Another one that's hilarious is a strikeout sequence. When strike three is called, the batter, in an ugly mix of disgust and shock, glares at the ump, as if to say, ~unbelievable! You've got to be kidding me, you sucky fricken, fracken...!~ Several other animations in the batting box are only decent in comparison, but they are there. Overall, High Heat looks weak compared to everything else in this year's lineup. So, if you're an admitted graphics tart, just stay the heck away.  Sound With baseball, sound plays a tremendous part in the title's feel. There is always that underlying hum of the crowd, and it's just as much of a feel as it is a sound. The crowd has a rhythm of its own. With High Heat, that hum is monotone, like static or white noise. And while it is there, it doesn't produce the kind feel that gets players excited about playing ball. In other games, you'll hear a little scream here and there, or a fan yell out, seemingly randomly. In High Heat, the crowd is simply another part of the game that exists, but with no real impact at all.   The announcing is the same. It's there, it's relatively colorful -- and with the exception of the Home Run Derby, in which the announcer almost taunts the batter (and that is funny) -- nothing sticks out as either terribly funny, memorable, or accurate.Well, if I haven't said it all already, I'll say it again. The fact is I wanted to like High Heat more than I did, but every time I made an instinctual choice to play a baseball game, High Heat didn't get the nod. I like underdogs, too, and High Heat is certainly the underdog on PlayStation. The relatively fast arcade-style play is mixed in with a good amount of realism, but the game doesn't sway in either direction, and it doesn't do anything well that can't be found in another title.Hopefully, when next year's version comes out it's a tailor-made PlayStation title, not a rehash, port, or code from last year's game. Who knows, maybe 3DO's PS2 game will be awesome.", "date": "May 21, 1999"}