{"name": "UEFA Champions League 2006-2007", "name_review": "UEFA Champions League 2006-2007 UK Review", "ref": "https://www.ign.com/articles/2007/03/16/uefa-champions-league-2006-2007-uk-review", "text": "Considering UEFA Champions League is a tournament for Europe's football elite there's very little evidence of world class skill and dazzling teamwork in this latest franchise entry when you're out on the pitch. Players move lethargically around as if wading through syrup rather than skipping nimbly across the grass and the cream of the tournament's talent - Henry, Ronaldinho, Gerrard, Deco et al - are reduced to playing what feels like a playground kickabout rather than a tactical, skilful and flowing game of football. The Beautiful Game this is not.   Let's not get ahead ourselves though. UEFA Champions League 2006-2007 is the official game of the top-flight tournament, which this year culminates with the final held in Athens this May.    The game is based on the foundations of the competition and so includes all the teams that have the potential to qualify - all the Premiership, LFP Primera, Bundesliga, Serie A and Lique 1 clubs, as well as a handful of other European hopefuls. Players can choose to take their team through the entire tournament, working their way up through the qualifying and knockout stages and right to the final. Alternatively they can replay classic scenarios from past competitions, challenge other players over Live or hand-pick a team of all-stars to create the greatest team to ever enter the tournament.   UEFA Champions League is based on the FIFA 07 engine so the basics of a decent football game are already in place. The match selection menus and pre-game build-up is very slick, as you'd expect from any EA Sports game, plus the revamped character models and fluid, realistic animation that received so much praise when FIFA was released last year also help to give UEFA a leg-up. However, while EA has certainly made some improvements to the game engine in the past six months, a lot of the same flaws - and even some new ones - are still very much in evidence.   Nowhere is this more apparent than when you're playing a match. We've always had a problem with the Xbox 360 pad for football games because the analogue stick isn't precise enough for close ball control and the D-pad is in an awkward position. That's still the case here and any attempt to turn tightly on the ball or quickly side-step a defender usually results in you losing possession.    The off-the-ball control of your team mates isn't great either, which is bizarre considering the PS2 version of FIFA 07 got it so right. Players rarely make a run into space, so threading defence-splitting through-balls is almost impossible. Your team mates have a tendency to bunch together too, creating big holes in your formation (through no fault of your own) which the opposition can easily take advantage of.   The manual player select doesn't help matters. More often than not you'll waste much of your time cycling through every player on the field apart from the one you're actually trying to choose, because your team mates are grouped together rather than holding their positions. In fact, on a number of occasions, we watched helplessly as an opponent ran the entire length of the field unchallenged while we tried (and failed) to take control of the player nearest the ball.   Even when you do manage to get the right player, actually making a tackle is no mean feat. For starters, fouls are awarded for the slightest contact with an opponent, plus your players are slow to react when they successfully steal the ball. As a result, it's not uncommon for an opposing player to literally bulldozer his way through your defence, even if you managed to get in a couple of tackles. You see, you'll nick the ball, but rather than controlling it with a boot and passing it to safety, your player will stand rigid, allowing the opposition to steal it back and continue the attack. Admittedly it doesn't happen every time but it does have a habit of occurring at crucial times in the game, which can lead to losing a vital goal and being kicked out of the tournament. Very annoying.     It's not all bad, though. Shooting, especially heading the ball, is more consistent than it was in FIFA and once you learn not to pass the ball to a player with a defender anywhere near them you'll actually manage to get a fairly decent game of football going. Scoring a goal is pretty satisfying too, because the keepers are smart and rarely let in soft goals.   That said, it didn't take too long for us to discover an almost sure-fire way of knocking one in the back of the net. By running it down the wing, cutting into the penalty area and squaring it to a central striker just outside the six-yard box you have a 50-50 chance of scoring a simple tap-in. Sure, half the time a defender will intercept, but it's still an easy way of gaining a three or four goal advantage over the course of a match.    The ability to bag easy goals comes in handy in the Challenge mode, which is our favourite part of the game. 42 classic Champions League scenarios have been recreated, enabling players to rewrite history by jumping into the game and changing the score line. For example, when Everton trailed to Villarreal in the qualifiers of the '05-'06 competition it seemed the Toffees had no chance of going through. But you can change all that, by steering David Moyes's team to victory and dumping the Spanish side out of the cup.   The Challenge mode is a really neat addition to UEFA Champions League, not only because it features scenarios for all the different legs of the competition, from qualifying rounds through to the finals, but also because of the reward scheme it employs. Successfully complete a task and you're awarded points that, once you've collected enough, open up more challenges. In addition bonus points are given for winning in style (an extra 100 points by winning by two goals, etc), plus you're given Achievement points for every challenge you pass. Nice.   However, there are a number of small oversights in the details of each challenge that will probably bug the hell out of hardcore football fans. For example, in a challenge between Lazio and Arsenal from the 2000-01 tournament, the Gunners have just four minutes to score an equaliser that would send them through to the next round. But while the scenario is the same as the real-life game - Pires netted a goal in the 88th minute - details such as the team line-up are incorrect. For starters, Fabregas and Adebayor are out on the field, which is ridiculous considering the influential midfielder would've only been 13 at the time and the Togo striker didn't wear the Arsenal shield until 2006.   Similarly, Arsenal's knife-edge game against Wigan in 2006, in which the Gunners had to win to qualify for the Champions League, was the last ever match to be played at Highbury. Only it's not played at Highbury in the game, it's played at Arsenal's new home, the Emirates Stadium. Admittedly these are minor details but, as football fans, we found them slightly annoying, especially considering EA's usual pedigree of getting authenticity spot on.    On the subject of new modes, the Ultimate Team game is another nice addition. Essentially, it allows you to create your own dream team, by collecting packs of virtual cards. These feature everything from players and managers to kits and performance boosts, which you put together to form your team. For every game you then win using your makeshift starting 11, you receive points which can then be traded for additional packs of cards to grow your side. It's kind of like the collectible Panini sticker albums you used to have when you were a kid, but this time you actually get to take them out onto the pitch and play with your favourite players. You can even trade unwanted cards over Live.   A great idea then, but one that's ruined by the lacklustre gameplay. Controlling a team made up of the cream of Europe's football talent should have been exciting and fun, but the clunky controls and slow pace of the game strip away a lot of the enjoyment.The same can be said of the game in general  its bursting with a lot of good ideas, but the foundation on which the game sits is ultimately flawed. It doesnt play a terrible game of football by any stretch of the imagination  if you liked FIFA 07 on 360 this is more of the same, really. But the basic passing, shooting and tactical elements  the essentials, really  dont come together as well as they should. The developer wouldve been better off investing more time getting these right rather than spending it adding fancy new game modes. As much as we like the Challenge and Ultimate Team aspects of UEFA Champions League, without a solid game of football underneath it all they fall flat on their faces.", "date": "Mar 16, 2007"}