{"name": "The Godfather", "name_review": "The Godfather: The Don's Edition Review", "ref": "https://www.ign.com/articles/2007/03/16/the-godfather-the-dons-edition-review", "text": "Around this time last year, EA made its first entry into the genre of open world games with The Godfather, a PlayStation 2, Xbox and PC release that aligned players with the Corleone family. Six months later, the game made its way to the Xbox 360 with a slew of additional features and content. And now, the most famous kingpin of them all has made his way to the PlayStation 3.   The Godfather: The Don's Edition includes all of the content of the enhanced Xbox 360 version of the game, and adds a bevy of new features as well. From Sixaxis control to Hit Squads to rooftop fights to unique family compounds and more, this is a much bigger game than we saw in the initial release. Does that make it better? Most definitely. Does that make it more impressive? Not exactly. With the game's port to the PlayStation 3, one would expect a little more polish here and there, especially with regards to the visuals, and we didn't see that. Still though, this is certainly the best version of the bunch (unless you happen to prefer the Wii version's unique control scheme), so if you haven't picked up it previously, it's definitely worth a look.   Rooftop battles are one of the new additions. As a quick note, since we've covered the main elements of the game in our previous reviews, such as the story and whatnot, most of our focus here will be on the new content and the primary strengths and weakness of the PlayStation 3 version.   With both the Wii and PlayStation 3 versions of The Godfather, EA has added in a number of control options specific to their motion-sensing functionality. With the PlayStation 3 version, that means that you can now shove people around and perform various execution kills with the Sixaxis. Much of this works only okay, mostly because you can't always perform these maneuvers (usually the shoves) and you'll sometimes repeatedly shove the controller around because you think it isn't sensing what you want it to. When you are allowed to use it, the Blackhand controls are reasonably responsive, though it doesn't feel as rewarding or ~realistic~ as EA would have liked. Really, it just feels like you're suggesting what should happen and then hoping it does. As this isn't a huge part of the game since you can just shoot a guy from a distance, it doesn't really hinder or improve things in any way.   Click here to watch the trainyard shootout.   One of the small problems that revolved around the license last time around was that though you dealt with high-ranking members of the Corleone family quite often, as you ascended through the ranks it didn't feel like you had earned enough tangible support. In other words, you were still largely left to handle things on your own. That's been fixed fairly well this time around with the addition of the Hit Squad and crew members. Whether it's a single man at your side or an entire gang of mobsters, both allow you to take on other families with an army of guns. It's pretty cool to be able to march into a rival compound with four other guys around you, all of you laying down machinegun fire and laying waste to the grounds. They also both help give your money an actual sense of purpose as it didn't do much more than buy new safe houses or pay people off last time around.   The game's upgrade system has been expanded a bit. There are now eight different skills divided into two groups of overarching styles, Enforcer and Operator. There isn't a definitive order that you need to use, but once you hit 15 and 30 total points spent in either group, you'll earn a new ability. For instance, once you've spent 30 points amongst any of the four enforcer skills, you unlock unlimited ammunition for all guns.    A problem with the original release was that too many areas felt copied-and-pasted, creating a fair bit of repetition after a while. This has been remedied here in a number of ways. Firstly, there are now a number of sections that take place on rooftops, helping expand the many, somewhat bland indoor areas. More importantly though, each of the families have a unique compound that they call home, forcing you to use a different plan of attack for each one. Additionally, there are two new transportation hubs to be found and taken over, namely a freighter and a train yard. While these hubs and the compounds are but a tiny portion of the overall game, they do well to help provide a few more unique scenarios and make it feel a little more fresh. So while they're not groundbreaking in any way, they do add a bit to the experience.   Aside from these main additions, there are a handful of other tweaks and such to the game that help make the overall experience stronger, but don't do much on their own. For instance, Mobface has been expanded a little bit to offer more options, you're able to set car bombs, Mob Wars can now trigger rival families to bomb and temporarily shut down your businesses and such. Again, while none of these are exactly selling points for the game, they all do add up to make the overall package a little more engaging. It's nice to see that EA has been able to provide upgrades that actually affect gameplay rather than just provide a spot for a bullet point on a press release.   Now you can take an entire crew with you to cause havoc. Unfortunately, while most of the game's main aspects have been expanded upon or tweaked, the graphics have not. The Godfather was a reasonable-looking game on the PlayStation 2, but its visuals are simply poor for a next-generation title. Other than the high-definition output, it doesn't look like anything has been noticeably changed. Texture resolution is pretty bad, some of the effects are very last-gen (the specular highlights on vehicles point out their polygon make-up, for instance) and it really does look like you're playing a PS2 game in HD.   One thing that really couldn't have easily been fixed without a complete rework is the world layout, which is still rather frustrating. Many sections of the world are only accessible via one street, which means you must constantly reference the pause menu's map (the in-game map simply isn't situated far enough above the city). While the game does offer enough side stuff to make it feel non-linear and truly open, the fact that you often have to go on a specific route does give it a bit of a constrained feeling.   Regardless of that, there's still a decent bit of fun to be had here. The story is strong enough to get sucked into, even if it isn't all that long, and there's a lot of stuff to do on the side. Extorting businesses and such is more rewarding this time around due to all of the small additions made here and there, like how the money actually has value now, so taking over barbershops and such can be fairly addicting.The Godfather: The Don's Edition is a strong and rather noticeable improvement over the original release, though much of it does feel outdated on the PlayStation 3. EA has done a great job of expanding nearly every facet of the game, and even though only a few of these additions change the game in major ways, the overall package is a good deal better. Still, with last-gen visuals, a frustrating city layout and other issues that plagued the original release, it's still far from perfect. But if you haven't played any of the previous releases, it's certainly worth a look.", "date": "Mar 16, 2007"}