{"name": "Genji 2", "name_review": "Genji: Days of the Blade UK Review", "ref": "https://www.ign.com/articles/2007/03/20/genji-days-of-the-blade-uk-review", "text": "Some games just feel like an easy target. Let's be honest, when you've spent the best part of a year riding on a wave of unintentional hilarity, born out of historically accurate giant crustaceans and astounding 'new' gameplay mechanics, courtesy of one over-excitable Sony executive, you'd better have something mighty special in your bag of tricks to turn back the tide of public opinion.   Fighting: Something you'll be doing an awful lot of in Genji.  It's something of a relief then to see that Genji: Days of the Blade isn't the complete, unmitigated laughing stock half the internet was anticipating - which isn't to say it's much cop either, because, in truth, it isn't. What it is, is a launch title offering all the expected visual razzmatazz Sony's PlayStation 3 needs in its line-up to satiate all those polygon-hungry early-adopters, poised ready to hand over 425 big ones this Friday.   While undeniably pretty - sporting the usual roster of shiny bells and next-gen whistles we've come to expect from a console the size of a caravan and power consumption of a small principality - the sad fact is that none of that next-gen oomph has gone into creating an experience even remotely more evolved than Sony's previous Genji titles. In other words, it's tired, formulaic, repetitive and - ultimately - dull.   Kamui mode: match on-screen button sequences to fell large groups in bullet-time.  Much like its predecessors, Days of the Blade is a tried and true hack 'n' slash button-masher, with a focus almost entirely on cutting through endless swathes of dim-witted enemies determined to hamper your progress at every possible opportunity. Thankfully, some effort's gone into mixing the action up a bit this time around with the introduction of four playable, switchable characters, each offering different attacks and abilities.   Girly-faced Yoshitsune is a master of the blade, for instance, while burly Benkei prefers to skewer opponents with the massive girth of his club. Rounding off your early posse (with previous Genji boss character Buson turning up later) is Shizuka, queen of the whirly yo-yo blades. Injecting some much-needed variety into proceedings, each character's weapon roster can be upgraded with increasingly powerful additions as you progress through the game, each offering a brand new selection of devastating acrobatic moves.     In terms of unique abilities, you've got increased agility (including Price of Persia-style wall-running), super-strength environmental destruction and chasm-clearing grappling respectively. Ostensibly at least, this means you need to alternate between each character in order to overcome obstacles in your path. Unfortunately, these more puzzle-orientated moments are basic at best and few and far between, which is a shame because Genji's character-switching mechanics are both balanced and fluid.   Each character sports of distinctive range of fighting moves.  In fact, much of Days of the Blade's feature additions feel utterly arbitrary, with subtle differences between your characters fighting strengths and weaknesses made largely worthless thanks to the relative brainless ease with which enemies can be dispatched. It's no exaggeration to say that Genji's combat system is a shallow experience. Despite the numerous attack upgrades available and the strategic potential they might have offered in the right development hands, victory in combat requires little more than a permanently jittery button finger.   Some of the tedium born from the repetitive fighting mechanics might have been elevated by placing emphasis on exploration of levels. Unfortunately, these too are firmly stuck in a current-gen design quagmire, with each area you visit confined to a deceptively linear path. Worse still, engagement with the enemy invariably throws up an impenetrable barrier around your group which, alongside the frankly useless fixed camera, further exacerbates the restrictive, confined nature of progression. What's more, the frequency of enforced combat and plodding exposition slows the whole game to such a pedestrian pace, even the gloriously visceral combat can't keep excitement levels up where they should be for a game of this type.   Get on the wrong end of that and there'll be tears.  Credit where it's due though - combat looks amazing, with stunning, distinctive animations for each of your characters. True, enemy designs are limited and you'll find yourself up against the same handful of opponents en masse in each area, but, for a game that started life as a PS2 title, Genji: Days of the Blade generally looks sublime. Detailed character models abound, as does all manner of crisp, solid next-gen visual trickery. From the second level onward - with its cascading waterfalls, soft-focus daylight haze and rich foliage - the game at least feels like it's doing something with all that extra PS3 brawn.In fact, Genji's reliance on stale, formulaic gameplay is undoubtedly its biggest crime. Whether you can forgive that depends largely on what you demand from a next-gen launch day title. As an early display of the PlayStation 3's prowess, there's no denying Days of the Blade is, while perhaps not on par with some of Xbox 360's more matured offerings, something to behold - and for a certain type of gamer, particularly hack 'n' slash fans, that might be enough. However, if you're picking up Sony's latest console with the expectation of next-generation gameplay alongside a shiny lick of hi-def paint, there are better offerings arriving this Friday, far more worthy of your cash.", "date": "Mar 20, 2007"}