{"name": "TMNT", "name_review": "TMNT Review", "ref": "https://www.ign.com/articles/2007/03/21/tmnt-review-7", "text": "At the very least, I have to give kudos to Ubisoft for finally approaching the Nintendo DS and PSP handhelds as original platforms and not as ~yet another system to port a console game.~ The dual-screen version of the CG Teenage Mutant Ninja Turtles is something completely unique and not based on anything created for the PlayStation 2, Xbox 360, GameCube, Wii, and PC. It's actually something that's ambitious and not the usual fare for a turtles game, but on the same token it's a little too out there to be a good game. The core action element's fun but flawed, and the sporadic combat plays so secondary that what should be fulfilling ends up simplistic, tedious, and incredibly mundane.   The team responsible for the console versions of TMNT created what could be considered a light version of ~Prince of Persia: The Sands of Time.~ On the Game Boy Advance, the development team built an awesome side-scrolling brawler nod to the original Konami arcade series. But for the Nintendo DS and PlayStation Portable, the team went so far out of the box they almost lost it under the couch. The design is so hard to describe that it just can't fit into any analogy and be a hundred percent correct. That's why, if anything, we have to commend the handheld team for not playing it safe. It didn't work out in the long run, but we certainly appreciate the attempt.   There are two components to the gameplay established within this version of TMNT: exploration (we use that term loosely), and action. Most of the game design revolves around leaping from rooftops, banners, flagpoles, girders, window sills, and anything that you'd expect a ninja to grapple. There's very little direct control over your turtle character during these extensive segments -- the idea is to bound from point to point to point by hitting the corresponding button. If the next point in the world is to the left of the point before it, you'll have to hit the left most button. In front of the previous point, the upper most button. To the right, the right most. The idea is to give rhythm to your leaping by anticipating the next jump point and timing the button press at the landing point of the previous jump. To mix things up, there will be specific jump points that correspond to the B button as a jump as well. These are specific triggers, like a slope slide to leap off the ledge at the last possible second, or a beam to flip off of.   Now, all together, the game's meant to pull a sense of rhythm out of the player, since they're rewarded with extra boosts in speed if they time the next button press at the proper moment. If you can manage to get your character moving at a proper pace, the game has this nice, fluidic motion and energy, but at the expense of true level exploration. The problem is that with players focusing on whether the next point is up, left, right, or a Hold B jump, the rest of the world is wooshing by. The game encourages players to pick up T, M, N, T tokens scattered throughout the game, but because your attention is more on the jump points, and sometimes jump points go in different directions, so it's tough to see where these T, M, N, T tokens could be. Sure, it encourages a second or third playthrough in specific levels, but it's a flawed structure since there are many times where players could never beat a level perfectly the first time around.   The other problem comes deeper in the game where the levels get so ambitious in their design that they sort of put a hitch into the game's flow. The camera will have to skew around a corner to follow the turtle, which means that trying to figure out what location the next jump is in relation to the previous one isn't second nature...players have to guess sometimes. And other times, the designers put moving ledges at jump points, and that gets really confusing since the jump point is there within reach, but jumping to it might be an instant death simply because the player didn't wait for the platform to swing into place.   There's some merit to this style of platform jumping, and I'd be lying if I said that it wasn't any fun leaping around like a group of ninja toads. In fact, I actually like the ~racing~ aspect where you have to leap as fast as you can to specific checkpoints in the level to meet up with your brother turtle, who will hurl you across great distances. Run out of time during these mini-challenges and you might lose some precious time or an opportunity for the coveted T, M, N, or T token hidden in the level.     But any fun to be had is immediately squashed by some of the worst weapon brawling action mechanics ever developed. Players will fight one, two, or three enemies at a time at specific points in the level, and the fact that most of the time you're just hammering down on the attack button should tell you that very little thought went into this part of the game. I know this game's meant for kids, but when you can, literally, beat every boss in the game without losing a single life, that right there is just poor planning on the part of the designers.   The game's also extremely short, which could be forgiven had the designers offered some sort of incentive for players to complete each level with a perfect ranking. The game does record when a level's been beaten with a fast time, a specific jump combo string, and if all of the T, M, N, and T tokens have been created; on the PSP version you get some movie extras by doing so but in the DS edition that's been left on the cutting room floor. The only thing that adds some legs is the game's two player racing mode that's so unbalanced and flawed that it's clear that it was cobbled together at the last minute. You don't even have the ability to choose which area you want to race through with the other opponent!   The game's 3D engine is both impressive and little on the limited side. On the DS, TMNT runs at a slick 60 frames per second, with some seriously well-detailed cityscapes, sewers, and other locations. Of course, this comes at a compromise: character models, like the Turtles and their enemies, are low-poly messes that lack a bit of lighting and animation detail. And when the camera moves from its rigid track to one that has to follow a bit more dynamically, it has a hard time keeping up. But what's horrifying is what happens on the lower screen: TMNT follows the movie's storyline through the wonders of awful, pixelated, low color, talking head cutscenes that are really hard to follow.  If you want a sneak peek of the TMNT tale days before the game's release, this one doesn't do the story any justice.  Thumbs way up for Ubisoft finally taking the high road with Nintendo DS and producing something completely original for the dual-screen handheld. But I just can't be as enthusiastic for the final product; it's certainly not terrible and the rhythmic jumping action has some fun and energy, but the fact remains that the game just ends up feeling inconsistent due to sloppy storytelling and, more importantly, an absolutely awful fighting engine.", "date": "Mar 21, 2007"}