{"name": "TMNT", "name_review": "TMNT Review", "ref": "https://www.ign.com/articles/2007/03/21/tmnt-review-6", "text": "Just when you think the Game Boy Advance's life is over and merely a dumping ground for quickly developed Rugrats and Spongebob games, a game comes around to show that there's still a little bit of life left in Nintendo's handheld system. Just as the Nintendo DS development team approached its TMNT project with an original mindset, so did Ubisoft's GBA team. But in the case of the GBA, it's the way cooler product: TMNT on the Game Boy Advance is one hell of a surprise and an incredibly fun throwback to the old-school Turtles arcade game. For those that love those games, or even Double Dragon-style brawlers in general, don't let this one pass you by.   Anyone talking about videogames featuring the Teenage Mutant Ninja Turtles will eventually start waxing nostalgic about the original arcade game and its sequel, TMNT: Turtles in Time. These two games featured some crazy old-school brawling action that threw tons of enemies on-screen for players to beat up. It was shallow but rewarding in a mindless sort of way, but the lack of any sort of technique was its ultimate downfall. It had cheap mechanics that were made intentionally cheap, simply to suck quarters out of players' pockets. The re-release of the original arcade game on Xbox Live Arcade brings its cheap shallowness to surface -- it's certainly nice to romp down memory lane, but that sort of game just wouldn't fly today.   But imagine that arcade game idea, with actual depth added to it. That's exactly what TMNT for the GBA is. The designers clearly wanted to bring back that old-school feel of the original Konami arcade game, but infused a shellload of technique into the mix. Yes, it's a kick-punch-throw game like Double Dragon and Final Fight, but the design team programmed in some of the most satisfying action seen in not just a GBA brawler, but in any brawlers. It comes close to being as classic an action game as River City Ransom, if you can believe it.   In fact, I'm sure that River City Ransom was used as a reference when the TMNT team went to work on the Game Boy Advance version. This game has a really excellent amount of technique that encourages players to string together moves in order to pull off an impressive combo. A ticker on the side of the screen keeps track of how many hits you nail characters with in succession, and rewards points and experience based on how high you can get that number. It helps that the game features a satisfying combat system where players can juggle enemies upwards multiple times and kick others while the first enemies are still airborne. The moves list might be limited, but the game allows for some killer attacks -- kick enemies into each other, pick up downed enemies and throw them into a group, deflect projectiles back at the thrower...even toss a rubber tire into a mob of enemies and watch it bounce back and forth into one another.   Downed enemies will drop money which can be converted into extras, provided you get through the level with enough extra lives. You can buy a wall jump, additional offensive or defensive power, or even extend the duration of the combo strings so you can get that counter high into the double digits for kick-ass points.   TMNT's old-school gameplay is amplified by its welcome old-school presentation. All of the visuals have been drawn up using pixelart -- other than screengrabs from the movie, you'd have a hard time finding a single computer rendered object in the cartridge. That's a good thing, too; the game looks slick and well-defined in its pixel art, with some really excellent, fluid animation for the turtle characters and enemies. There's even some nice little touches, like destructible environments -- slice at a billboard or electrical panel and it'll take visual damage. There's no real reason to have this, but it gives a rigid, straightforward game design a bit more of a sense of freedom. And it's just fun laying waste to the city streets.     The overall package is incredibly fun and really challenging, but it's not entirely without fault. The biggest omission is, of course, the lack of any sort of multiplayer. TMNT does allow players to bring in a second character into the fight, but he's entirely computer controlled and used as a mechanic to build up huge combo attacks. The missing multiplayer is unfortunate, but at the tail-end of the GBA's life-cycle and the amount of people who might've taken advantage of that ability -- including the fact that DS system lack the link cable ability in GBA titles -- we can forgive its omission. And the single player gameplay is fun as hell on its own, so we won't harp on the missing multiplayer any more.   I can, however, whack the developers for leaving out a functional save system. Yes, the game certainly saves a player's progress after the completion of a level, which records money earned and experience. But when you're encouraged to head out into the streets to buy items and take part in Casey Jones's or Splinter's mini-challenges, it would have been a Very Good Thing to save this progress as well. Instead, if, between levels, you upgrade your character and earn a medal for a mini-challenge, and then head back into the missions, and you happen to die, you're right back at the last save point. Which means any or all progress you made with buying items and finishing mini-challenges must be repeated. It's a minor gripe, but one definitely significant enough to gripe about.TMNT for the Game Boy Advance is one hell of a gaming surprise, coming out at what's pretty much assumed to be the tail end of the handheld's lifespan. It's an awesome throwback to old-school game design, but with tons of flair and technique to jazz up the experience into a contemporary piece. It's easily one of the best brawling games I've played in years, and had the designers managed full-fledged multiplayer support I think we could have seen the best Turtles ever. It's damn near close, though. Don't miss it.", "date": "Mar 21, 2007"}