{"name": "UEFA Champions League 2006-2007", "name_review": "UEFA Champions League 2006-2007 Review", "ref": "https://www.ign.com/articles/2007/03/21/uefa-champions-league-2006-2007-review", "text": "Electronic Arts' sports division isn't synonymous with innovation like it was four years ago, and in this new generation of sports games the biggest sports publisher in the world has continued to struggle. Still, the Canadian development team behind FIFA has made strides in physics innovation with FIFA 07 and now with UEFA Champions League 2006-2007 it's offering something entirely different. The UEFA Champions League, which isn't well-known in America and stands for the Union of European Football Associations, is an elite league of Europe's best football players who can now be traded and played with decks of cards much in the way Magic The Gathering is played on tabletops across the world.    No, I'm not kidding. You can play soccer and soccer card battle all at once.     UEFA Champions League 2006-2007 is a unique experiment in videogame soccer inspired by Panini Stickers, a popular stick phenomenon in Europe, Magic the Gathering, and fantasy football. EA's game enables you to jump in and play plain good old footy if you want. Or you can dive into the deep, rather complicated, but potentially satisfying Ultimate Team mode, in which strategy, card trading, team building and management are key factors in winning your game. It sounds a little crazy, but in this mode you collect player, booster, and a variety of other cards to help you configure the ultimate team and, in the process, spend hours of non-soccer playing time tinkering, studying, and experimenting with team chemistry, contracts, and balance.    Does the Ultimate Team Mode boost UEFA into the stratospheres of greatest soccer games ever? No. UEFA is only a moderate improvement over FIFA 07, and along with some of its minor improvements it also carries problems that didn't exist before. But it is a unique game that is phenomenally deep if you like playing cards. A minor note for those who noticed: the Xbox 360 version is entirely different than the PS2 or PSP versions.    UEFA consists of seven modes, six of which offer actual game playing. You can jump into a single league game with Play Now, enter into the UEFA Champions League and vie for first place, or start a brand new team in Ultimate Team (which is the new card-based system). Then, just for super European soccer buffs (which is every male in Western Europe), there is the robust UEFA Championship League Challenge, which re-creates old championship games for you to re-play in all their glory. This mode won't mean jack for Americans, though it could serve as a little dip into soccer history as players can re-live famous victories or reverse painful defeats in 42 historic games. In the Lounge, gamers play offline in three match modes with as many as 19 people, while collecting specific cards to the Lounge and completing objectives. If you're into straight mano-a-mano action, you can play against others on Xbox Live in Ranked or Unranked matches, through simple match-ups or in Custom Matches with as many as seven other players.     The basic game of soccer drives it all, and for those who've played dozens of FIFA games over the years, and FIFA 07 and World Cup Soccer in particular, UEFA presents both good and bad aspects, depending on how entrenched in the game you are. On the positive side, it's the official game for the series, meaning the Premiership, LFP Primera, Bundesliga, Serie A, Lique 1 and many other European potential teams are included. Second, UEFA is very, very pretty. Few sports developers know how to capture the essence of soccer as well as EA. From the moment a game is booted up to the final whistles, EA has created a beautiful looking game that shines with slick interfaces, great-looking player models, smart motion-capture work, and accurate re-creations of individual player styles. Each game is played at night, like in real life, and the iconic star-laced soccer ball icon shines throughout the presentations. The huge stadia, the wild cheers from crowds, and the intelligent camera angles capture the sport exquisitely. The replays are particularly sweet, with new roving angles that follow player feet, providing all the best angles with which to see the game.      But in a way, we have come to expect great presentation from EA. They always get this part right. From a fundamentals standpoint, however, EA still has work to do. The game's basics are still in a rough state. In many subtle and off-putting ways, the passing, shooting, and dribbling all feel like they're in mid-developmental progress during an actual match. While the game is fully playable, getting precise passes off, scoring long shots outside the box, and getting into the nitty-gritty dribbling mechanics still feel awkward. You'll absolutely have fun on a surface level game, and after dozens of games against the computer and IGN staffers, getting a solid game in against casual players isn't an issue. But after said games, you'll also wish the controls were tighter and more precise. The Xbox 360 controller doesn't help much either, as the D-pad is poor and the analog control hasn't been honed well enough yet (which is partly Microsoft's fault in the first place, but also an additional problem that EA has to solve).    Generally, while on offense, your team will quickly slot into position and if you're like me -- picky about your formations -- you'll find that most players, if not fatigued or injured, will be there for you. The same can't be said about the defense, however. The auto-player switching functionality, at least for me, is worthless. I just turn it off. Still, even then, watching your team get threaded by a single player -- or watching a play develop in front of you and being helpless to prevent it because your men are so regularly out of position is frustrating. In other words, your players' off-the-ball intelligence of your team isn't so good. Repeatedly slamming the left trigger button to sift through the correct player while said play is unfolding also leaves a bitter taste in the mouth.    While our UK team had issues with game's tackling, I felt the marking functionality and the tackling was solid. Gamers can push their athletes right up next to their competition and jostle for control as long as they can catch up to the other player. Players don't stop cold in their tracks too often, and close contact isn't always punished with fouls. There is more mingling of feet, which is natural to the game, that doesn't actually stop the action than in previous games. Admittedly, UEFA still has issues here. The nicely evolving physics system might have something to do with that. Sometimes after a tackle the ball might erroneously change directions, as if bumped by a ghost one or two seconds after the actual tackle. I lost a game this way. I watched the play in slow motion. The tackle hit ball, some shins too, and both players stumbled a bit and stopped. The ball then appeared to hit my player's unmoving heel, got kicked toward the goal (backwards and opposite of our direction) and presented itself as the perfect pass to the opposition. They then scored. Just my luck.   Just like the above scenario, EA seemed to capture some of the game's more random and incredible moments -- in a good way. When playing as Barcelona, I was able to punch through some perfect through-passes that led my players to score. My computer controlled off-ball players beautifully received those excellent passes and converted them. . In the replays, you can see how my winger's feet were inches ahead of the opponent's. This wasn't so random as it was an example of what should happen when you're playing with the best teams. In another situation during a scuffle for control after a corner kick, an opposing player kicked the ball into his own net. It's rare and random, but realistic. And for the most part, goal keepers do an excellent job of diving, punching, and intercepting the ball to keep scoring down.      UEFA's pace has also been slowed down quite a bit, but not necessarily for the worst. After playing through the previous FIFA games, and especially compared to this year's UEFA on PS2, this game is slow, as in molasses slow. I found that while annoying in some respects -- i.e., the altered pace forced me to re-adapt some skills and just plain slow down -- the new pace compels one to make smarter passes and plays -- as opposed to gunning down the opposition's gullet every time. By picking club teams and using players such as Henry or Ronaldinho, you'll get the most out of the game's speed. By starting a new club in Ultimate Team, you'll conversely experience the game's slowest dregs and you'll howl in pain as they crawl across the screen. Call them growing pains, because when starting a club you're dealt a certain random level of middle-rung players who are neither in great shape nor move that fast. That's just part of the Ultimate Team challenge -- building your team from nothing into something. This process will also assuredly feel really slow, too.    The Xbox Live component in UEFA represents some of EA's best efforts yet in building solid and compelling online play. You can pick from quick or custom match, Ranked or Unranked games, and jump into one-on-one games or play alongside others in cooperative efforts. Online, you can play with up to eight players in a game with four players on one team and four on another, or you can go offline instead, with up to four players in any configuration (four against the computer, three on one, or two on two). When and if you take enough time to delve into the card system, you'll find that you can trade cards online, buy cards online, and use EA's servers to auction them off in an ~open~ market just like on e-Bay. If, after two weeks, the cards aren't bought, they're returned to you after which you can re-price and sell them again.With UEFA, you'll get a really neat idea that's rather foreign to soccer -- using trading cards to build a team from nothing to something. The Panini/Magic/fantasy football concept is deep and compelling and requires much strategizing and experimenting, all without kicking a single ball. For the hardcore, dedicated player, this could be incredibly appealing. For the guy who just wants a really good soccer game? Not so much. Other than the interesting new league setting (UEFA championships) and the new card system (Ultimate Teams), EA's newest game doesn't make any significant or even moderate leaps in the fundamental soccer, and it's here that the game needed the most work.", "date": "Mar 21, 2007"}