{"name": "Virtua Fighter 5", "name_review": "Virtua Fighter 5 UK Review", "ref": "https://www.ign.com/articles/2007/03/21/virtua-fighter-5-uk-review", "text": "Virtua Fighter 5 is a huge, huge game to launch with any console and we don't want to play down the significance of its arrival alongside PlayStation 3. For some people, this is going to be a weekend to remember; albeit the kind who eat-sleep-drink Virtua Fighter.   News of an Xbox 360 edition due later this year stole some of the thunder but even so, SEGA has its best chance to get Virtua Fighter in the spotlight given the drought of exclusive PS3 titles at launch. Admittedly, SEGA's standard bearer might not justify 425 for a next-gen console all by itself; leave that to Sony's MotorStorm. However this could - and we'll have a little think about whether it should - be the first Virtua Fighter that sells to the gaming masses. For once the timing is perfect.   Insanely detailed fighters and sumptuous backgrounds are the order of the day.  Everything looks good from the off and not even the hardest of hardcore can point to graphical differences between PS3 and arcade VF5. It is, quite simply, beautiful. PS3 gets the very latest version of the arcade game too (Version B, in case you're wondering), so the gameplay is beyond reproach. On that note, nothing has radically changed since VF4 however; a few extra moves have been distributed among all the characters, but otherwise the same three-button layout serves to guard, punch and kick, as it has done since 1993. Thankfully the additional dodge button that came and went alongside that Sumo guy with VF3 is nowhere to be seen, replaced in VF4 by nudging the D-pad up or down, which is far more intuitive - just the way VF connoisseurs like it. Also welcome is the return of the Ranking System introduced in 2001, later borrowed by Tekken, that awards martial arts grades and beyond to achieve god-like status.   Newcomer El Blaze is one of the more accessible characters on the roster.  Virtua Fighter 5 is the least developed of all the series when you consider the progress made between versions 1-4. SEGA's AM2 division has clung onto its perfectly level, evenly-proportioned arenas to keep bouts fair and, well, completely square. Some are fenced in, allowing for context-driven special moves. Others are walled, which can be broken down to edge fighters out of the ring and clinch victory in the face of defeat. Strategy is forever where it's at with Virtua Fighter. Speed chess, as the fans say.   SEGA only ever comes forward with two new characters for each VF revision. Since the introduction of Lei-Fei and Vanessa from VF4 and Brad and Goh from Evo, SEGA has really found its groove with newcomers Eileen and El Blaze. Both perform impressive moves without the need for players to break a sweat. Beginners won't find themselves tied up in knots as with Lei-Fei, or stabbing at buttons to squeeze blood from a stone - yes, we're talking about you, Brad and Goh. With Eileen and El Blaze, we have VF's most accessible protagonists since the Bryants, and they didn't even need tattoos. Arguably, a Mexican wrestler and a Chinese practitioner of Monkey style Kung Fu aren't destined to become household names, but let's not pee on our milestone.      The roster now features 17 characters, enough to induce agoraphobia in most VF circles. But each time the ranks swell, the fighters' contrasting styles become more apparent. This is one of the game's long-serving strengths, underrated in a climate that values quantity over quality. Just when you think Tekken has nailed similar intrigue by introducing a guy like Craig Marduk, you run into Akira, Aoi, Lion or Shun-Di and realise how much more effectively the VF crowd is defined by its diversity. Consequently, the gameplay is shaped by extreme breadth and depth of strategy, with one gigantic tick-box alongside the word 'balanced'.   There is nothing in Virtua Fighter that shouldn't belong, and it will always be this way. As to how much more or different you'd prefer is another matter. Our beef with VF5 PS3 is not that we can't have more than Tekken or Dead or Alive in terms of character selection, or even such things as ending movies or silly Easter Eggs. We're just glum that the game doesn't champion its crown jewels nearly enough.   This gold-plated room still costs less than a European PS3.  Essentially VF5 PS3 is a bare bones update of the sparse, but more effective consumer offering that was VF4 on PS2. We have precisely the same gameplay modes, with the focus on versus matches against a friend - though not online, as has been vehemently criticised, but sensibly defended by creators AM2. Quest Mode is back as the time-consuming one-player pastime; a map of a city where AI players of various skill levels await your next challenge in the arcades. One slight modification to aid beginners is that some hangouts are only populated by novice players, so you can beat their heads while learning the ropes before taking on the bad boys across town.   VF5 arenas: flat but always fair.  While you're busy grinding through these endless battles, official tournaments are announced that offer cash prizes and special items to help with the customisation of your characters. In VF4 PS2, as with the VF4 and VF5 coin-ops, this was great because you could save your data onto a card and carry it around like a precious extra soul. Loading up your glowing white ninja or sexy Sarah for approval at a friend's house was something worth fighting for, and defending their Win Ratio even more so. This feature was inexplicably lost for PS2 Evo, and even more annoyingly hasn't returned for VF5 PS3. At least VF4's training mode has survived intact, a crash course in moves and strategy that you'll keep going back to unless you have an expert friend to train you up.Everything Virtua Fighter gets right, it does so for the arcade crowd first - or, more specifically, loyal punters in Japan. With the home versions, SEGA proves time and again that it will not, perhaps cannot, entertain first-timers or reward its seasoned campaigners with thoughtful presentation. The absence of a portable save file, which made PS2 VF4 so compelling, hurts the most; the promise of real-world notoriety reduced to a one-player detail. SEGA deemed the UK arcade scene too puny for its VF5 coin-op, so this PS3 version will be snapped up by fans eager to play. But a game with such core qualities deserves more than just a fanatical following. Heres hoping the Xbox 360 version gives reason to play beyond our own bedrooms.", "date": "Mar 21, 2007"}