{"name": "Risk 2", "name_review": "Risk II", "ref": "https://www.ign.com/articles/2000/03/31/risk-ii-2", "text": "Just in case there's someone reading this who happens to be a hermit rejoining society or a stone that's just acquired the powers of sentience, Risk is a board game in which players take turns trying to take over the world. Armies are earned in proportion to the number of territories you control. These armies are used to crush your enemies until only you reign supreme as Absolute World Tyrant. Sound fun? You'd better believe it. And Hasbro's latest PC version of the game preserves everything that makes the game great.  Risk has always been one of my favorite games. I admit it. The game is so well designed and the rules so finely balanced that it seems hard to miss with a PC port. The only dangers would be in losing the social aspects of the game and presenting the players with a substandard AI. Having played the final game (and done virtually nothing else all week) I can say that the designers have minimized the first danger and practically eliminated the second. Additionally, they've included several additions that are quite striking. Not only do they not throw the game out of balance -- in some cases they even improve on the balance of the original.  The game includes two main types of play: Classic Risk and Same Time Risk. In Classic Risk, each player goes through a full turn of reinforcement, attacking and consolidation. Play then proceeds to the next player who goes through the same steps. Same Time is much more interesting. All the non-combat phases of the game round are handled for all players simultaneously. They all place reinforcements and move troops around like in Classic Risk but it all happens at once. The big difference comes during the attack phase of the round. Each player plans out all of their attacks before any troops actually engage in combat. When you've finished planning your attacks, all the attack orders are revealed.  Combat then occurs simultaneously. This is handled like in Classic Risk, with three important exceptions. First off, in situations where two armies are attacking each other across a common border (Border Clashes) the attacking units fight each other to determine which army's invasion will occur later in the attack phase. Mass Invasions are instances where more than one player is invading a given territory. In this case, the attacking armies fight to destroy the rightful owners of the territory first. Then any remaining armies battle it out with each other for ownership of the territory.  The third change to the Classic Risk model is the die used to resolve combat. Each army uses one of five 12-sided dice to determine the outcome of the battle. The more troops an army has, the higher the numbers on their die. You are therefore much more likely to kill an enemy if you outnumber him substantially. The better dice also inflict more casualties on the opposing army. Some purists might see this sort of change as sacrilege, but it actually makes the game very intense. Watching your huge army with a vicious black die whittled down to a wimpy force of three units rolling the puny white die will get you more excited than just about anything else in the game.  Which brings me to a point of contention in our office. Trent seems to think that the dice are unfairly weighted towards the computer opponent. While I agreed with him at the beginning, having played several hours of this game has changed my opinion somewhat. While there still seems to be a slight advantage on the computer's side, it's not that bad and may in fact be more due to the persecution complexes that Trent and I have carried ever since our days at St. Cecil's School for Mommy's Nervous Little Angel.  Which brings me to the best feature of the game: the battle animations. Every time you're involved in a combat, the camera zooms in on the contested territory. You see all these little guys on the map representing you and your opponents. Click the ~roll~ button to roll the dice and watch the little guys double over or fall back as they're shot. It might sound goofy but trust me, it's handled so perfectly that you find yourself still getting excited even after the hundredth time you've seen it. It not only increases the involvement you feel in the battles, but it also goes a long way to preserving the impression that these are toy soldiers.  Apart from the Tournament mode, I've won more games than I've lost.  But the sixteen opponents in the game are pretty tough to handle...at least most of them. There are various personality differences among the players and they really come through during the game. Some players are more reckless than others are and some are much more prone to ignore treaties and agreements. Overall you'll begin to see not only a difference in terms of skill level but also in terms of character.  There are three separate objectives that you can experiment with in Risk. World Domination Risk calls upon the player to conquer the world (or a portion thereof, to speed up games a little). Mission Risk gives each player a unique objective ranging from ~conquer such-and-such continents~ to ~kill player X.~ I was glad to see that the design team decided to include Capital Risk as well. In this game, each of the players has one territory that's designated as their capital. The goal in this game is to capture a set number of capitals from the other players while simultaneously maintaining ownership of your own.  Risk II also offers a new form of territory allocation. Apart from the random deal and territory grab processes, Risk II introduces a form of bidding (which they call Election for some reason). Each player has 500 points at the beginning of the process. Territories selected at random and players bid against each other to win territories. You can also use territories you already own to reduce the cost of adjacent territories. This is a nice way to ensure that you can carve out a reasonably contiguous empire at the start. Any points left over at the end of the bidding process can be traded in for extra armies.  You'll also notice as you pick territories that there are six new territories on the map. The designers have decided to add these territories as ~backdoors~ to obtain greater access across continents. Hawaii connects Asia and America. New Zealand helps get around Fortress Australia via South America. Overall, the new territory additions are extremely well thought out and really help bring even more balance to the Risk model. To offset the added insecurities of holding continents in the Southern Hemisphere, the troop bonuses have been increases as well. But if you don't like the extra territories, you can turn them off individually. You can also adjust the troop bonuses as well.  The diplomacy system didn't quite live up to my expectations but it's still pretty useful. The much-touted I-Com system wound up being pretty narrow after all. Initially the system was positioned as a way to communicate with icons instead of chat messages. That way you could play with someone from France without actually having to remember all the way back to high school. And after all, you only signed up for the class because you knew that cute girl from Algebra was going to be in the same class. You and her...speaking French...it all seemed so perfect, didn't it?  Anyway, the I-Com system offers three levels of alliance and one form of saber rattling. The first level of alliance only asks the other player to avoid attacking any of your wholly owned continents or your largest contiguous empire. Level 2 alliances allow the allied parties to attack one territory merely to gain a card. Level 3 alliances prohibit attacks on any of the other player's territories. None of this is binding you understand, but alliance breakers can expect to acquire the wrath of the injured parties. Each alliance must be reestablished at the beginning of each round as well. My biggest problem with the whole system is that the computer opponents never agree to even the most casual of alliances. They offer them to you often enough, but usually on as an attempt to divert your wrath elsewhere.  Sadly the multiplayer element is effectively limited to hotseat and LAN competitions. It's not that Hasbro didn't think to include net support -- it's just handled through the Zone. There are four rooms (two each rated by skill and whether or not you'd like to play Same Time or Classic). There's also a tournament room as well. In all there weren't a lot of people in the rooms the few times I tried to play, but that's not such a huge problem. This is a perfect game for net play and I imagine that enthusiasm will be high. My big issue is with the Zone here. I had so many lock-ups and false starts and connectivity issues that I gave up all hope that the game's going to work in that format.  Risk II puts a lot of hinkfo right at your fingertips. In addition to viewing the map with the continent colors on, you can select several other graphic representations of the state of the war. By far the most useful of these views is the Ownership view. This view colors each territory to match the color of the occupying army. It's much, much easier to make sense of the overall strategic situation with this view. The Troop Strength view colors the territories according to the number of occupying armies and the Border Threat view shows you which of your territories is most in danger from attack. Throughout the game you can also pull up an info screen that tells you, at a glance, how many soldiers and territories each player has. It also tells you how many reinforcements each player can expect and how many cards they hold. This is a nice feature that eliminates the tedious counting you'd have to do otherwise.  Once the game is done you'll be rewarded with several graphs that represent the action within the game. Even though these are all static line-graphs, they're still very interesting. You can see how many attacks each player made in the individual games turns. One of the greatest insights I had about the nature of Risk came from these screens. If you play enough games, you'll notice that the players will alternate rounds of vicious attacks with consolidation rounds. Spikes for invasions and casualties always came on the even-numbered turns. I've played the game for years and I never noticed this tendency until I saw it reflected in the graphs. Now there's nothing left to do but jump right back in and do it again.  For when you're feeling particularly ambitious, Risk II offers you the chance to play in Tournament mode against the computer. All of the variations are present at some point during this 16-tiered challenge. The AI and the initial set-ups get tougher and tougher as you progress. Try as I might, I still can get no farther than level seven. And in a brilliant move, the designers have decided that if you lose even a single battle of the tournament, you're knocked completely out of the running -- no saving your game here.  So this is a great game, no doubt about it. It has some severe flaws with the lack of save slots, narrow diplomacy system and the horrible MSN Zone multiplay service, but in the end none of that matters. The game is still a ridiculous amount of fun. No game in recent memory has had so many people crowded around my desk just to watch me play. On the first day the game came in, I dropped everything I was doing (sorry, Iron Plague) and played until I went home. Anyone who loved the boardgame will surely love this new PC version. As an added bonus, I found it's a lot harder to accidentally spill beer all over your computer monitor.  -- Stephen Butts", "date": "Mar 31, 2000"}