{"name": "IL-2 Sturmovik: 1946", "name_review": "Il-2 Sturmovik 1946", "ref": "https://www.ign.com/articles/2007/03/23/il-2-sturmovik-1946", "text": "It's a little tough to review the latest IL-2 Sturmovik expansion, 1946, simply because the title includes not only the original game but also all the expansions released so far and the Pacific Fighters content. On that score, it's a phenomenal value and one that no sim fan should be without. But rather than simply re-reviewing the original game, Pe-2, Forgotten Battles, the Ace edition, and Pacific Fighters, we're just going to focus here on the new content that longtime fans of the series will find in 1946.  The basic premise is that war between the USSR and Germany extend beyond basic Me-262 test flights into an era when jets actually see lots of operational service against each other. Trying to take down a He-162 from the cockpit of a Yak-15 isn't a story you'll read about in the history books, but that's no reason for 1C not to find a way to create the conditions for such an encounter in their latest game. Even better, they've added loads of new content throughout the rest of the game.   As if the hundreds of planes in the core game weren't enough, the new sim includes over 30 additional new late era aircraft. Some like the Ar-234 jet bomber or the N1K2 George are probably better known from appearances in other games, but the addition of the prop-driven IL-10 or the Ki-27 Nate are a little more exotic. The emphasis here though, is clearly on the jets, from the Russian Yak-15s and MiG-9s to the Go-229s and He-162s.  Whether you're familiar with the planes already or not, there's a great aircraft reference included in the installation directory that outlines all the performance characteristics of all the more than 200 flyable planes in the game. In addition to offering up the cold, hard specifications for each plane, the reference goes one better and actually lists some of the common strengths and weaknesses pilots will discover when they take to the skies.  Several large new maps have been added as well. The Manchuria map is an excellent (and plausible) setting for conflicts between the Russians and the Japanese, while the Burma map finally lets players refight some of the Flying Tigers' battles. (The addition of a flyable Ki-27 Nate makes these battles even more compelling.)   There are nine entirely new campaigns in the 1946 expansion, each of which contains anywhere from one to two dozen missions each. The new missions are actually scripted to allow for specific encounters this time around. Where the open-ended dynamic missions of Pacific Fighters showed a great deal of variability, these new missions feel a little constrained but the upshot is that almost all of the missions involve some kind of compelling engagement. We say ~almost all~ because there are quite a few missions, particularly in the VVS 46 campaign that task the player with uninteresting training and rebase missions.  Thankfully, those are the exception. Most missions have you involved in much more interesting actions. Doing high-speed bombing runs in your Arado 234 in the new The Rebel campaign is definitely a new thrill for us. Even better is the end of the IJA campaign Glowing Glory. Though it starts with the usual Hellcat scrambles in your A6M5 over the waters around Iwo Jima, you'll eventually find yourself fighting off B-29 raids over the skies of Japan.  The Sturmovik legacy lengthens with the new IL-10 campaign, Sturmoviks over Manchuria. After trying out the new Sturmovik in the final battles over Germany, you'll find yourself transferred to Manchuria where the Russians and Japanese are starting to clash. The new jets are featured in the VVS '46 and Burning Streak campaigns, giving players the chance to try out the latest and greatest jets from the Soviet and German stables. While dogfighting in a Yak-15 or a He-162 is a very different experience from the turn-and-burn tactics of the prop planes, it's no less exhilarating.      Unfortunately, the new scripted missions still fail to provide the human dimension that's been missing from the series' campaigns so far. There are interesting stories behind the briefings and leader boards you can use to follow your progress but each mission still feels a bit cold and detached from any sense of human drama. If you've ever read a fact-focused, emotionless after-action report, you understand just what's missing here.  On the plus side, the new scripted mission focus allows for much more interesting, highly detailed environments. Though the scenery can still feel a bit flat in places, there are many more objects scattered throughout the world, giving the whole game a much more realistic feel. The game also includes trenches and bunkers as specific ground targets. It's true that there was no shortage of ground targets in the original IL-2 missions but the new ones do add a little more variety to the game.   Not surprisingly, the attention to detail is commendable. Even when the game veers into the area of speculative history, things are handled as realistically as possible. The new jets are integrated into the game's alternate history timeline in a way that makes sense and the conflicts that arise from the campaigns' historical departures seem very plausible.  The rest of the features here -- AI, graphics, sound, interface -- haven't changed since the last release. The competition is still tough with a  good sense of energy management, planes are rendered down to the last rivet with all sorts of lovely moving control surfaces, and the basic mission set-up is still as convenient as it ever was. In short, if you liked those aspects of the series before, you won't be disappointed here.For forty bucks, you can't really go wrong here, particularly since this version of the game includes every expansion that the series has seen so far. It's a shame that there's not more US or UK content here, but that's to be expected. There's nothing here that's going to win over anyone who wasn't already a fan of the game, but for those of us who have enjoyed the series in the past, 1946 is a great excuse to box up all the old discs and stick them in the back of a closet.", "date": "Mar 23, 2007"}