{"name": "Medal of Honor Vanguard", "name_review": "Medal of Honor Vanguard Review", "ref": "https://www.ign.com/articles/2007/03/26/medal-of-honor-vanguard-review-2", "text": "General Patton once said ~Accept the challenges so that you can feel the exhilaration of victory.~ I followed Georgie's advice and accepted the challenge of Medal of Honor Vanguard, but all I felt was the frustration of poorly placed checkpoints and linear gameplay when my time in the service was up.   Vanguard, the latest chapter in the 8-year-old Medal of Honor franchise, puts players behind a World War II rifle as Corporal Frank Keegan, a shooter in the 82nd Airborne Division. For four campaigns, Keegan and crew run and gun through ten missions that take them from Sicily to France to Holland and to Germany.    As a video game reviewer, I realize it can seem as if all I do is swoop in and poop on people's efforts to make a great game. Although I'm about to do my fair share of No. 2 on this title, I want to make it clear that this is a fun game. I have some pretty specific complaints, but there's still the sickly-sweet dings of bullets hitting helmets, authentic weapons, big ol' explosions, detailed environments and some genuinely fun gameplay moments that make Vanguard a worthwhile addition to a Medal of Honor fanatic's collection.   If you're on the fence about the series, let's head to the latrine and discuss some of the game's shortcomings.   I'm a midrange Medal of Honor fan. I've been playing the franchise off and on for awhile, but what has kept my starving wallet away from the local game-store cash register recently is that the latest title is rarely that different from the last - there's going to be black-and-white footage with a voiceover, I'm going to keep forgetting my character's name, and I'm going to shoot a lot of people.   Yawn.   In 2005, EA tried to add some spice to the franchise with the idea of squad combat - order your team around and keep 'em healthy with med packs - and the addition of the adrenaline feature - get a lot of headshots and be rewarded with bursts of bullet-time. The bells and whistles were met with a mixed response, but you had to give EA credit for trying something different.   Those ideas have been scrapped in Vanguard.   Quit dancing! Not that Vanguard is without (limited) improvements. Now, you can listen as your men scream out the locations of enemies and as the baddies yack about the oncoming assault - their jabbering is translated onscreen. It sounds cool and adds a new layer to your otherwise disposable company, but the sounds boil down to a handful of phrases that are repeated over and over again.   Another ~addition~ to this wartime outing is EA's claim that ~the course of battle is in your hands,~ which in the company's terms means you can choose to run and beat a jerk's head in with the butt of your rifle or flank him and shoot from a distance. It sounds good on paper, but it's an idea that never comes to fruition in play because the Vanguard maps are as linear as you'd expect from a Medal of Honor title - follow the beaten path through a town and get to the next cut scene.    Once in a great while, I did find a way to get behind enemy lines and surprise the Nazi brigade, but as I began to annihilate Hitler's boys, not one of those yellowbellies turned to address me - they stuck to their programmed duty of shooting at the allies in the distance (i.e. where I was supposed to be) rather than turning to take me on. It sounds bad, but because you'll rarely get the chance to sneak up on Charlie, you'll remember stellar gameplay moments such as ducking out from behind crates to cap machine gunners rather than the botched attempts to spook the bad guys.   The game is packed with the ability to cook grenades, nine types of medals players can be awarded for feats such as landing in the drop area and completing a mission as they progress through the campaigns, and a number of traditional multiplayer modes, like deathmatch, capture the flag, etc. Not bad for $40, but the lack of online matches is a big loss for frag fanatics.    However, my biggest complaint comes with Vanguard's final campaign, ~Varsity.~ If you've read my preview (cheap plug), you've read about the first mission of Varsity in-depth - for Johnny-Come-Lately, you drop into a humongous firefight that will probably leave you bullet-ridden a couple of times. Trying not to be torn apart by sniper fire while pushing the Germans back so my men and I could take the beach was fun, but the second and final mission of Varsity wasn't. In fact, it's a bitch - and not in a good way.   See, the first three campaigns of Vanguard are laughably easy. You'll find yourself raking in Silver Stars, medals awarded for not dying during a mission, and coasting through the battles no matter which of the three difficulties you decide to roll with.    Then Varsity shows up.   I'm all for difficult games. I like to be challenged, having to think about my attack and overcoming the odds to defeat an army of enemies. However, the only enemy you'll find yourself cursing in ~The Crucible~ is the checkpoint system.    This jerk's seen his last sunset! As the finale to the game, the level is extremely long and time consuming as you crawl through a bombed-out building filled with snipers, take on a bunker filled with angry gunners and go shell-for-shell with a team of tanks. Sounds like fun, right? After a dozen attempts, you'll discover it's not. See, the enemies in Vanguard aren't smart; they're dummies that run to the exact same spot and stand where you just blew away one of their friends. When you lose to these drones, it's because you got clipped trying to make it back for bazooka ammo or because one of your own equally vapid comrades was blocking your view.    You'll play for half and hour, get killed unceremoniously by the swarms of enemies tacked on to the mission and restart the segment from a checkpoint 15 to 20 minutes back.    Argh.   More frustrating? Once, I did everything right, made it to the big tank battle near the end of the mission and the game got stuck on one of its lame cut scenes. I guess the soldier who was supposed to tell me tanks were shooting at us got stuck on a box or doorway. I was left without a way to advance and forced back to the checkpoint I'd played from a handful of times.    Ugh.My few complaints aside, if youre a Medal of Honor fan, youll dig this title  theres shooting, tanks and a multiplayer mode to keep you entertained. However, if you felt like previous incarnations of this WWII title were getting closer and closer to being dishonorably discharged, Vanguards paper-thin story, monotonous maps and upper-level frustration wont have you saluting this soldiers latest effort.", "date": "Mar 26, 2007"}