{"name": "Elder Scrolls 4: Shivering Isles", "name_review": "The Elder Scrolls IV: The Shivering Isles Review", "ref": "https://www.ign.com/articles/2007/03/27/the-elder-scrolls-iv-the-shivering-isles-review", "text": "Thinking back to March 2006's The Elder Scrolls IV: Oblivion, were there any NPC characters that really stood out? You may be tempted to drop Uriel Septim's name. But do you really remember him or his mannerisms? Or do you just remember the fact that Patrick Stuart did the voice work for a guy that got slashed to death within ten minutes of starting a game. The Shivering Isles, the first real expansion for Bethesda's fourth generation of Elder Scrolls, fills the personality void. If you wind up playing this, chances are you'll remember the name Sheogorath for quite a while after; not just because of the screwy spelling, but because the character is genuinely funny.   This isn't the first block of expansion content released by Bethesda so far. Bits and pieces of downloadable content were made available fairly regularly after the game's initial release, culminating in The Knights of the Nine compilation, which added a quest line of its own. The Shivering Isles does much more than just tack on a new quest or dungeon by delivering an entirely new realm to explore. Ruled by Sheogorath, the realm is divided into Dementia and Mania halves, each governed by their own quirky leaders, the drug-addled Duke of Mania and hyper-paranoid Duchess of Dementia. Each half has its own visual characteristics, from the bright mushrooms and polychromatic hills of Mania to the bleak swamps and knotted trees of Dementia.  IGN Insiders can see extended gameplay footage of Shivering Isles in glorious HD. Quicktime HD included.  A screaming rock door serves as the portal into this land, which pops up in Niben Bay after installation. Either an existing character or entirely new one can pass through, where you'll find such oddities as the Hill of Suicides, an NPC who gives you a quest to kill him, and a Soul Tomato.   You'll also get some fancy new armor sets and weaponry. From new enemy types and dungeons can be procured Amber and Madness Ore, which when brought to the proper smith in the main city of New Sheoth can be forged into some attractive pieces of equipment, with all the intricate detailing we've come to expect from Bethesda. Better still, these armors level with your character, so if you're still somewhat inexperienced, you can go back and forge a new set a few levels later and reap the benefits of augmented protection or increased weapon damage. Special Matrices allow magical versions of Amber and Madness items to be produced, but if you're a high level character you'll likely be applying your own enchants.   Weapons weren't left aside either, a few unique weapons pop up as you follow the main story along with some new summons, and, depending on some of the choices you make during the main quest, the armor of the Golden Saints or Dark Seducers, who guard the Bliss and Dementia halves of New Sheoth, respectively.    Though there's a decent amount of territory to explore in the Shivering Isles, the main story provides the most entertainment. Like the guild quests in Oblivion, the tasks Sheogorath hands out are varied, and rarely cause you to grumble over being slapped with a seemingly derivative fetch quest. There's a solid backstory for each, giving you ample motivation, and often the rewards snatched from an enemy's dead fingers or bestowed by Sheogorath and the various other NPCs in the main narrative are quite good. The plot itself is well told, thanks in part to Sheogorath's inane, self-contradictory outbursts that his mild-mannered servant, Haskill, will regurgitate in more digestible bits.    Throughout the course of your journey battling the Greymarch, Jyggalag, and the Knights of Order, you'll be given a significant amount of choice. The decisions you make regarding how to comply with Sheogorath's wishes have substantial and permanent effects on the game world and storyline, including determining which major NPC players live or die, what titles you receive, and ultimately what kind of specialized armor set you're rewarded with later on. By giving the player choices with real consequences, the game manages to captivate like no linear game possibly could. It works to make the virtual world seem more realistic, and make you, the player, relish a greater sense of power and individuality. Once finished with the quest line, you're also rewarded with a few interesting abilities and responsibilities which should keep this content fresh for at least a little while longer.     Outside of New Sheoth are a handful of towns, mostly consisting of three to four wooden houses on stilts. Aside from the initial quest at the starting town of Passwall, there really aren't that many interesting side quests handed out from the townsfolk. A few exceptions include one lady in Highcross who collects all the new alchemical ingredients you'll pick up throughout your travels in the new realm, and eventually asks you to start herding monsters her way. Another collector in New Sheoth trades currency for oddities, which you'll find in dungeons vaults or on corpses. Outside the town there are still number of caves and ruins to explore, which have two types of new appearances once you get underground. For anyone accosted by a strong nauseous upwelling at the sight of another Elven Ruin this is good news. The root dungeons at least look different, and the new stone ruins feel more sinister than their counterparts in Cyrodiil.    The Shivering Isles have their own version of Oblivion Gates, called Obelisks of Order, which turn out to be far less frustrating to deal with. Here the main plot doesn't require you destroy excessive numbers like with the Oblivion plane dungeons. Instead, it's just a simple matter of killing a nearby Priest of Order and dropping three Hearts of Order into the Obelisk. Throughout the course of the main plot, the number of these you're actually required to deactivate is minimal.   Enemies in the realm take on more fantastical forms, such as the gruesomely agile Flesh Atronachs and insect-like Elytra. In combination with the more otherworldly environmental designs of the Shivering Isles, it makes this expansion a refreshing diversion from Cyrodiil, which tried to mimic a realistic environment as closely as it could. Other additions include a decent number of new plants to harvest, some new spells, and a variety of more outlandish clothing.   We have a few gripes with the expansion, though they're relatively minor. The game's menu system still needs some tweaking, particularly the alchemy interface. It still requires far too many button presses or mouse clicks to add, remove, and determine what reagents go together to the desired potions. Like in Oblivion, NPC faces still look jarringly unnatural, which detracts from the otherwise eerie beauty of the Shivering Isles. We were also hoping for a sweeping new orchestral track, but alas, no such luck. The surprisingly catchy Oblivion theme and other existing scores will have to suffice. A few crashes were encountered here and there, but didn't significantly detract from the experience.   Oh, and Bethesda, where'd the horses go?The Shivering Isles is an entirely worthy addition to Bethesda's stellar fourth entry in The Elder Scrolls series. It respects a player's ability to make decisions, offers some useful armor sets and weapons, delivers a vivid, more imaginative variation of the traditional high fantasy province of Cyrodiil, and will reinvigorate that addictive itch for exploration inspired by Oblivion. If you've weaned yourself off the Elder Scrolls IV since its release, this expansion is a great excuse to jump back in, if only to experience Sheogorath's bizarre tangential meanderings.", "date": "Mar 27, 2007"}