{"name": "Tortuga: Two Treasures", "name_review": "Tortuga -- Two Treasures Review", "ref": "https://www.ign.com/articles/2007/03/27/tortuga-two-treasures-review", "text": "Abandoning creativity and originality faster than Blackbeard apparently abandoned moral decency, TortugaTwo Treasures instead wallows unapologetically in virtually every hackneyed pirate-ism to ever walk a gangplank. All the swordplay, all the gravely voiced ~Avasts,~ all the looting and the pillaging and the rum-soaked yet somehow romanticized no-goodniks, all the peg legs and the ghostly references and the voodoo and the cannon battles. Even the main character, one Thomas ~Hawk~ Blythe, wears and bears all the typical swashbuckling-rapscallion-with-an-underlying-heart-of-gold traits and garb that have adorned most every pirate hero throughout the ages. That the action-adventure game around these oh-so-stereotypical trappings is structured to leave very little room for actual adventure outside the hand-holding linear storyboard somehow doesn't seem surprising.    Yet despite its obvious shortcomings, Tortuga does not completely suck. Though it certainly won't satisfy hardcore action or adventure veterans, newcomers to either genre and those who simply aren't as serious about the whole thing or just need a ~gaming lite~ diversion every now and then may well find it delivers just enough immersion and just enough fun to make its quasi-discounted price point palatable.   As with any adventure game, Tortuga features a plotline that's supposed to keep players pushing ever forward and onward to eventual conquest. Problem is, the nature of that plot remains a bit of a mystery throughout. If there's an all-encompassing goal to be found anywhere here, it's muddled amongst a ton of triviality that continually sidetracks any momentum that may have previously been built.   In fact, it wouldn't be much of a stretch to say that developer Ascaron Entertainment (also responsible for the much classier Dark Star One) appears to have added several seemingly disconnected after-the-fact missions here and there just to give the player more stuff to do on his way to the conclusion. And, ultimately, that's actually a good thing given the context, because the Tortuga script is otherwise so funneled and so structuredand so shortthat you need all the play time you can get.   In Tortuga, there is no coloring outside the lines. Like a book, the game takes you along the route it charts, unceremoniously stopping you if you sail a ship or walk the hero outside the mildly confining and invisible physical boundaries, and forcing you to adhere strictly to the each new objective. Missions are generally quite limitedsome less than a few minutesand each is prefaced with a non-interactive FMV scene wherein the voice acting takes a backseat to the written script.    There are two distinct elements and environments to the game. Inarguably the most enjoyable and most sophisticated are those that involve sailing and ship-to-ship combat. It's hard to say Tortuga excels at aquatic endeavors because so many games do it better and with much greater complexity, but most will find life on the these not-so-high seas to be at least temporarily involving.   The key is in the visual details. Each shipand there are an impressive variety of circa-1830 nautical vessels on displayis a beautiful little recreation that truly seems to be built of individual planks, billowing sails, and hundreds or thousands of feet of rigging. The sails are particularly coolcasting real time shadows across the deck and the other sails, fluttering about in the wind, and ready to be lowered or raised whenever you feel so inclined. A single button press raises some of the sails, and additional button presses raise more, eventually getting the ship to top speed.   On the decks, little seamen and seawomen scurry about hither and thither like they really have some job to do and some place to get to. Granted, their scurrying never really takes them anywhere, and their actions don't change whether their ship is under fine or merely calmly sailing from one port to another. Moreover, they won't climb the rigging, perch themselves in the crowsnest, or even sit behind a cannon when that cannon is fired. However, they do fly through the air nicely when the nearby vicinity is blown asunder, only to land in the translucent water as potential shark bait. And the sharks do come when humans are bobbing in the water, ready to gulp down those you don't rescue. When several crewmen are chomped at once, the resulting blood smear can grow quite large.   Indeed, the translucency of the water is a welcome perk. Through it, you can see reefs and high points in the ocean bottom that can damage a shipan important facet considering you'll occasionally need to use these reefs as weapons to inflict harm upon the keels and rudders of trailing enemy vessels. The clarity of the water is so great in fact that you can usually view every spooky line of even previously sunken ships under the waves.   Spookier still are Tortuga's obligatory ghost ships. All clad in back and sporting tattered sails that drag in the wind, ghost ships are the seemingly unstoppable enemy from beyond the grave that literally sucks the souls out of your crewmen. A few too many sucked souls, and it's game over. You'll know when a ghost ship approaches because the music grows dark and horribly sinister and you'll see the accompanying gray-black fog bank. The first few times you encounter one of these schooners from hell, the effect is really quite chilling.   But you'll spend most of your time at sea battling human enemies. Sometimes it'll be ship-to-ship, sometimes your boat is pitted against an entire fleet, and still other times you'll be asked to pilot your speedy and maneuverable but frighteningly small skiff against whatever the game throws at you.    The most important weapon at your disposal is usually your own craftiness. For instance, by appearing as if you're fleeing, you can drag your rivals over hull-damaging reefs or into collisions with one of the many explosive barrels than float about like seaweed.    Even when you're duking it out mano-a-mano, you need to keep you wits. Your side-mounted cannons won't even hit the intended target unless you line yourself up broadside. Of course, your opponent is trying to do the same thing, so you really need to be careful that he doesn't take direct aim at you at the same time. Moreover, though regular cannonballs are inexhaustible, the most effective weaponswhich are purchased via trading the gold you've recoveredare not. Thusly, you need to monitor your supply of explosive barrels and ~plate breakers.~ One of the niftiest weapons isn't a weapon at allit's giant octopus bait. Drop a little of this in the water, and you'll soon see enormous tentacles rising out of the water, surrounding the closest foe and keeping him helplessly lodged in one spot until you move in for the kill. Nice.    The game's damage modeling is impressive. Once a ship has taken a few hits, it becomes pockmarked with little holes across its hull and deck and even on a sail or two. With more punishment, it emits flames and smoke and looks considerably more disheveled. Near the end of its time, it's a flaming, scarred hulk just waiting to be put out of it misery.   Nevertheless, after you've seen yourself through a few battles, it all becomes just a bit too easy. Simply, the weapon system design just doesn't offer enough manual control or realism for advanced players. Instead, the game ups the difficulty by throwing an increasing number of ships at you. And that's not a good way to keep the interest level high.   Perhaps even more irritating is the physics engine. If you've ever watched one of today's ~tall ships~ in action, you know how much work is involved and how much time it takes just to turn one of these babies around. Yet here, you can do a full 180, propel yourself from a standing start to top speed, or come to a complete stop with almost the same efficiency and proficiency of a jet-ski. And you can forget about waves or swells or wind speed or wind direction influencing anything, because none of it matters.    Tortuga's second element takes you completely away from the sea and plunks you instead on land, walking about and talking with various characters but mostly gutting virtually everyone you see. You'll find most of the cutscenes here, and you'll occasionally need to do something interesting that doesn't involve drawing your sword, such as garnering information or picking up a treasure chest and the power-ups it harbors. But it's mostly a ridiculously repetitive hack and slash fest.    Despite the fact that you'll learn new fighting moves as you go on, and despite the fact that you can perform defensive maneuvers as well as offensive, it matters not in the heat of battle. This is straight-up click-o-rama, and it just isn't a whole lot of fun. Indeed, you may find yourself in certain scenerios when you have a dozen or more baddies surrounding you and packing in so tightly that you can't even move. Still, you can claw yourself free of most of these just by sitting there, bored and uninterested, clicking your mouse button until it breaks.   The Tortuga environments and backdrops, for the most part, look pretty enough. At sea, some of the best moments are during the early evening, when the orange-hued clouds and landmasses look nothing short of dazzling. On land, the towns and villages you visit are satisfactorily ornate in their construction. Granted, you can't open doors or shatter windows or really have any sort of impact or interaction with the scenery, but that's the life of a bargain basement pirate.   As we alluded earlier, the voice acting throughout the many cutscenes is verging on criminally bad. The script is well-written enough, but there's very little enthusiasm in its delivery. The music is symphonicas it should beand it does tend to rise and fall along with the current level of drama. Ascaron clearly believes in the human voice as a key sound effect, and you'll hear lots of assorted bits of conversation, commands, and shrieks of terror throughout. And yes, with the exception of foppish Brit soldiers, almost everyone sounds like a scurvy dog.  Steer a wide berth around TortugaTwo Treasures if youre a seasoned gamer who demands either the latest technology or a seriousand lastingchallenge. If youre a fresh-faced deckhand, on the other hand, who doesnt necessarily need or want an extreme mental workout and simply enjoys a little simplistic nautical action, argh, these seas may be to your liking.", "date": "Mar 27, 2007"}