{"name": "Meet The Robinsons", "name_review": "Meet the Robinsons Review", "ref": "https://www.ign.com/articles/2007/03/27/meet-the-robinsons-review", "text": "When it comes to licensed games based on popular movies, television shows, or toys, we - along with the rest of the sane gaming community - know pretty much what to expect.  The game will borrow from its license, either following the main story directly or taking an ~other world~ approach to it, and offer the licensed characters in a tried and true gameplay design.  So it should go without saying that while Meet the Robinsons is a solid overall attempt at the ~movie game~ sub-genre, there isn't anything that's really going to blow players away.  At the same time, the game brings forth a decent blend of 3D platforming and adventure elements, is inspired well from the film, and borrows well from some of gaming's core designs.   In Meet the Robinsons players embark on an alternate quest from the main movie.  Playing as Wilbur Robinson - a headstrong future child from light-years beyond - the game takes players through an alternate story from the Disney film.  In the movie, Wilbur acts as a supporting character, but designers opted to give him the star treatment in the game, as he makes for a more adventurous and action-based character.  The game's story is set as a parallel to the movie, so core elements are taken, but the story drives itself.  In the game, Wilbur has possession of the Robinson time machine, and is using it to travel around the world through time.    Even though the story is essentially just a setup for labyrinth-based action - similar to a more kid-friendly Zelda adventure - the game's presentation has definitely taken notes from the franchise, as the game's menu interface, character performances, voices, events, and attitude is all within the Robinson theme.  You'll travel around the Robinson mansion as a main hub to the game, you'll blast around in the protectosphere, and talk with supporting cast such as Carl, Cousin Laszlo, Grandpa Bud, Uncle Art, Aunt Billie, and Wilbur's mom Franny.  The game has the look and feel of the Robinson world; something that in a licensed game is nearly as important as the game itself (especially considering the audience).   When it comes to the main gameplay, Meet the Robinsons is pretty formulaic, though what's there still feels fine.  The game's designers attempted to emulate Zelda's control layout and design, having inventory selection assigned to the d-pad and the ability to target lock and strafe with use of the L button.  Along those same lines, players will auto-jump when hitting a ledge, and be able to pull off context-sensitive moves with the A button whenever close to a ledge, near ladders, or against items that can be grabbed, pushed, or pulled.  For camera movement, the right analog stick can be used to pan around the playfield, aiming projectiles in the process with an on-screen cursor.    In general, the game is a pretty solid compilation of everything you'd expect in a third-person adventure.  Dungeons are made up of basic object-moving puzzles or platforming mazes, and each one is filled with area-specific baddies and bosses.  The game adds diversity by including a blueprint/invention system, which allows players to build new items throughout the adventure, and it does work to add some depth to the otherwise formulaic design.  The main objects include the Disassembler, an item that can rip any enemy or object into parts; the Chargeball Glove, which is a basic distance attack; and the Robinson Scanner, an all-purpose scanner used to detect hidden areas, find weaknesses in enemies, and solve puzzles.   In addition there are the Havoc Gloves and Levitation Ray, two other half-offensive half-puzzle gadgets, as well as a bunch of other hidden items such as action figures, concept art, and blueprints.  So while the gameplay is purely fundamental by design, there's enough to keep movie fans happy until it lands on DVD (thus beginning the ever-lasting single-movie marathon in houses nation-wide).   When it comes to the audio/visual portion of Meet the Robinsons, the game becomes a bit of a mixed bag, though the overall consensus is still a positive one.  The game's core animations and player actions look fluid and movie-inspired, though the game can suffer from low-poly levels and some basic character modeling.  Rather than taking shots from the film to fit between missions, however, the game features cut-scenes built from the ground up for the game by the developer, and they look pretty impressive.  Granted it's nothing on par with the original film itself, but a ton of work went into the cut-scenes from the game, and it shows.  Team that with full performances from each of the movie's cast members (including Disney's new favorite for animated film/games Adam West), and you've got a game that plays pretty basic, but has the look and feel of the movie down.Meet the Robinsons is  at its heart  a movie/game.  The gameplay is basic, but it takes inspiration from more fleshed out titles, and it all works well.  The license is the primary focus of the title (obviously), so youll spend just as much time living in the world, interacting with the characters, and watching movie-inspired cuts-scenes as you will engaging, nail-biting gameplay, but thats part of what makes the sub-genre work.  Meet the Robinsons has the overall look of the film, the original voice actors make an appearance, and as an extension to the movie its a fine choice for younger gamers or families.  Theres no true Wii functionality added in, and the only difference between versions is the poly count and graphical detail.  Theres very little true innovation in the design, but a mix of entertaining gadgets keeps the experience from becoming mundane.  All in all Meet the Robinsons is a solid effort, lacks some of the overall polish of games with a higher budget and longer development time, but it fulfills its goal of tying the film world to an interactive medium; an exact definition to what we consider a good game.", "date": "Mar 27, 2007"}