{"name": "Bassmasters 2000", "name_review": "Bassmasters 2000", "ref": "https://www.ign.com/articles/2000/03/31/bassmasters-2000", "text": "If you already own THQ's Bassmasters 2000 then please feel free to follow along with us for a moment. Open up the game's instruction booklet and turn to the 'Notes' section in the back. Now take a pen and write, ~I am a dumb-ass.~   If you haven't bought the game yet, there's still time. First, read our review of In-Fisherman Bass Hunter 64, a much better title. If you're still not convinced, please continue.   Features   Multi-player angling action for up to two players  Real 3-D lakes from the BASSMASTER Tournament Trail with outstanding water effects, realistic fish behavior and accurate terrain and wildlife  Slick TV-like presentation that immerses players in The BASSMASTERS television program  Real bass fishing advice from nine time B.A.S.S. Angler of the Year, Roland Martin  Color commentary from angling veteran Shaw Grigsby  Varied game modes and difficulty levels, from laid-back Exhibition Mode to high-stakes Tournament Mode to frenetic Speed Fishing Mode  Real fishing equipment from top industry manufacturers  A Create-an-Angler mode that allows players to create and customize male or female characters of all ages  THQ's signature ~Lure Cam~ views for an exciting underwater perspective  The only fishing game to include the BASS Masters Classic  the grand daddy of all bass fishing tournaments    Gameplay The Mass Media developed Bassmasters 2000 attempts to be a fishing simulation of sorts. The game makes use of a 3D engine for what the box describes as ~frantic arcade modes~ and action that is ~just like the Bassmasters TV series.~ All of the in-game options are present. You've got the ability to drive your boat around various lakes looking for possible catches, change tackle, use a map, and of course reel in fish depending on line tension, depth and drag. And there are some added extras too -- you can create your own angler from head-to-toe, build up your boat, change upgrade fishing equipment, and obviously compete in a small range of fishing contests. But because all of it is running on a clunky, sluggish 3D engine with no added extras and poor control, none of it really comes together as we might hope for, especially when compared to the already released In-Fisherman Bass Hunter 64.   The Exhibition Mode, the game's standard, sees your angler competing in a one-day tournament where most anything can be customized to your liking -- this includes lake conditions, equipment and the like. The idea is simple enough, catch at least five bass with a minimum weight of 14 ounces. The process is more tedious than it is fun though. You'll find yourself searching empty lakes for a any fish, and once you do finally reel one in, it may not be the one kind you're looking for. Add in the important factor that the entire hooking experience is rather dull to begin with -- void of the added details featured in the competition's game and really lacking any true sense of physics -- and you can you see why the title is not recommended.  Our favorite mode of Bassmasters 2000 had very little to do with fishing itself, and more with the process of throwing one's line out into the water. The game features a particular Casting Mode where you can practice your line throwing abilities by aiming at a number of circle targets in the water. There is a time limit and you'll only be able to extend it by successfully casting to a dozen or so circles before it runs out. As you land more and more circles, the contest becomes increasingly more difficult. Before long, circles will begin to move around the lake and disappear (if you hesitate too long before casting). It's simple, and quite frankly a little silly, but it's fun all the same.  Two-Player Mode The game features a two-player split-screen mode, but because the framerate runs so poorly during this particular aspect of the game, it's hardly playable and certainly not recommended. If you don't mind sifting through a terribly sluggish, swamp-like fluidity (or lack thereof), you'll be able to fish against a friend -- whoever reels in more fish (the bigger the better) wins.   Graphics Envision, if you will, a world where all the lakes are made of a gooey syrup far too thick to see through and the landscapes surrounding these ungodly locations seem to be caught in an alternate dimension that we will refer to as ~Blur X.~ Blur X appears to borrow elements from the third dimension for its polygonal ground, but the trees that grow upon it are as flat as the gaming mechanics that are the backbone of this thrilling fishing title. Not only that, but everything -- lakes and Blur X included -- has a look to it that seems to say, ~Why hello there. I'd very much like to achieve the first-generation appearance present in a title like, say, San Francisco Rush N64, but unfortunately this darn engine won't let me.~ Quite frankly, it's no wonder that it's so difficult to lure a fish in this game -- they can't possibly exist in these unbearable environments. Our guess is that they've all jumped out of the water and onto the landscape of Blur X, where they flopped helplessly until they died.   Sound Probably the best feature of Bassmasters 2000 is its music, which seems perfectly fitted to the fishing environments. A touch of country, a splash of Deliverance, and we've got the twang we're looking for. Actually, it comes off just right -- happy and enthusiastic, adding a little bit of color to the otherwise dark gray fishing environment. Sound effects, meanwhile, are stock -- nothing too special here, just your average splashes, thunks, dips, and a bit of commentary from Shaw Grigsby and Roland Martin -- but nothing to write home about. If you're looking for a solid fishing game for Nintendo 64, this isn't it. Rather, the experience you're after can be had, at least for the most part, with In-Fisherman Bass Hunter 64. THQ's Bassmasters 2000 is a sub-first-generation product that delivers mediocrity when it shines, and offends when it doesn't. While the game's Casting Mode is mildly amusing for a time, this is really the only aspect of Bassmasters worth bothering with. A sluggish framerate throughout the entire experience -- especially in the irritating two-player mode -- turns what could have been a half-way enjoyable simulation into a chore. The lack of true physics or ironed out play mechanics only adds insult to injury. And the graphics? Maddeningly poor would be putting it nicely.IGN64 wholeheartedly apologizes for the tardiness of our review here. If we had only rated the game earlier, we might have been able to save a few innocent folks from buying it.", "date": "Mar 31, 2000"}