{"name": "TMNT", "name_review": "TMNT 360 AU Review", "ref": "https://www.ign.com/articles/2007/03/29/tmnt-360-au-review", "text": "Is it any surprise, really, that the latest Teenage Mutant Ninja Turtles title is a giant pile of terrapin faeces? It shouldn't be - this is a licensed game based loosely around an upcoming all-ages film. Of course, when Ubisoft Montreal announced it was handling the licence, we perked up our ears. Could it be? A truly cool TNMT game - on a next-gen system, no less? And from a talented, proven developer? Sadly, this just isn't the case.   As much as it pains us to admit, as lingering fans of the almost 20-year-old series, TNMT fails on just about every level. It lacks structure, it is inexplicably ugly and poorly designed, the sounds range from screeching and buggy to broken, the gameplay is demented and the lack of co-operative play is absolutely unforgivable and damning.   It didn't have to be this way. The gameplay combines elements of another Ubisoft action-platformer - the Prince of Persia series. Like the iconic Prince, the Turtles can race along walls, ninja-style, swing from poles and rafters, double-jump, wall-jump, climb and hang from precipices. A good fit on the surface, but unlike the Persian adventures the controls are not nearly as solid, responsive or, importantly, reliable.   The default character running speed is cumbersomely slow at times, and often your turtle of choice will automatically decide that, no, he doesn't particularly want to run, so he'll start walking instead. It's uncanny. You can be 'sprinting' along and suddenly, he'll just start walking. Why?   Leaping from surface to surface works about 80 per cent of the time. However, the jump movement is much more of a vertical motion than it is a distance-crossing one. It makes avoiding trip-wires and lasers more of a hassle than it should be. The distance-leaping issue is sidestepped by taking advantage of the other mildly successful concept that TNMT runs with - the idea of a brotherly helping hand. You can tag-team at any point with another turtle - Donny, Raph, Mikey, or Leo - for either a powerful super attack when in combat, or a strange, swirling grapple that flings you across chasms. This works fairly well in practice - just double-jump towards your intended landing spot, and at the crest of the jump, tap X. Another turtle will materialise and fling you a little farther.   The tag-team grapple move is pretty nifty. Too bad it's lost in a overgrown jungle of poor gameplay.  The 'story' mode, which is essentially a disjointed 16 or so levels of repetitive, rudimentary platforming, is broken up by either inexplicably choppy snippets of film footage or comic book-style panels that are panned across. It's a strange tale too, involving not just the traditional four turtles, Splinter, The Foot and others, but the turtles' alter-egos - pointlessly armoured or veiled solo avengers, who traverse the city alone in search of wrong-doers.    Combat is a bit of a joke. After progressing every few hundred in-game metres, you'll enter an area where enemies will suddenly spawn all around you, and they must be defeated to progress past the invisible walls cordoning off your path. It's a very odd way to handle the action component of the game - it feels unnatural for these breakaway moments of combat to be interspersed with rooftop leaps of faith. It's silly, amateurish design.   B is your primary attack button, delivering hands-based attacks with whatever your turtle's default weapon is. Repeated taps of B are all it takes to unleash a continuous, flowing combo of blows that are enough to take out the mindless swarms of Foot soldiers and street thugs. Sure, you can mix things out with a kick or two with Y, but why bother? It's slow, ineffective and unnecessary, thanks to several other game-destroyingly powerful techniques. Holding down B charges up a special linked-attack, where your character will automatically target the nearest four enemies and slash or smack them for an automatic kill. As if the other auto-combo method wasn't easy enough, this one clears the area around you pretty efficiently, allowing you to ready your charge-up for the next incoming wave. Ugh.   The enemy AI is limited to say the least. They can attack or defend and walk towards you. That's about the extent of their skills. Boss battles fare a little better, but later encounters, such as an oversized-hammer-wielding monster in a circular arena feel cheap and tacky.     The cheap, tacky feel extends to the presentation. We'd like to believe that the character models, recycled, cel-shaded and turned into flat images during cutscenes, are purposely, stylistically appallingly low in polygonal detail. Or that the environment, which is equally blocky, sparse and crummy, was done in such a way for some higher artistic gain - a gain that has heretofore eluded us. The game tries to pass it off as a stylistic choice. Tries.   But the reality is, this is practically a retextured port of the Xbox or PS2 release, given a fresh pair of slacks, a widescreen smile and shoved out the door into an unforgiving and informed market. The engine, which has some very rough bump-mapping effects poorly plastered over many surfaces, frequently slows down. There are even some areas that aren't rendered properly - areas that are displayed only after you plummet over a ledge to your death, revealing a sea of untextured, unmodelled blue.    Let us assure you, the 360 should be able to push this game out without raising its heart rate, let alone break a sweat. This isn't in the realm of Gears of War. In fact, this isn't even in Kameo's, or that of any other launch title. It is arguably the most unspectacular looking next-gen game available. Lego Star Wars II showed how style and simplicity could co-exist with more graphically demanding games, even on the 360. But TMNT is something else altogether. It's a sheep in tarted-up wolf's clothing. If the wolf worked the streets, didn't get a lot of sleep and did a lot of drugs during its down-time.   Heroes in a mashed-shell. TURTLE POWER!  Then there is the sound, which is equal parts irritating and glitchy. Whoever the master linguist was who penned Mikey's line, ~Awesomely-super-sensationalistic, dude!~, that person is clearly out of synch with the rest of society. This line, and a dozen of a similar calibre are repeated over and over, each time you make it past tricky jumps or complex platforming. Often, enemies and other characters will repeat their lines over the top of their last line of dialogue, creating an unintentionally amusing 'in-the-round' effect. Well, it's amusing until the fifth or sixth layer of sound is added and the dialogue descends into unintelligible gibberish - or more so, anyway.    There is no logical reason for not implementing four player cooperative play. The swap-in, tag-team system could easily be swapped out for multiplayer games. Our best guess is that this game was absolutely pushed through development in order to make it to shelves before the film's release. As a result, it is a mish-mash of badly balanced gameplay, faulty presentation and pointless unlockable content. It's the sort of game that reviewers have been trashing since the birth of the gaming industry - the latest in a string of poorly-implemented kids fodder that fails to be fun.    Perhaps the real disgrace is that a generally dependable studio, Ubisoft Montreal, is behind this monstrosity. What happened? Is this really a game the team would stand behind? Sure, it was going to make money one way or another - it's a licence title. But that is no excuse for this kind of shill. The company was handed a great licence with lots of potential for satisfying action, kung-fu, multiplayer and likeable characters and they still sold the Teenage Mutant Ninja Turtles up the river. Or should we say, down the drain?", "date": "Mar 29, 2007"}