{"name": "God of War 2", "name_review": "God Of War II Soundtrack", "ref": "https://www.ign.com/articles/2007/03/29/god-of-war-ii-soundtrack", "text": "With a game as epic in scope as God of War II the accompanying in-game soundtrack/score had better deliver an equally epic sense of sonic deployment. In the grand scheme of things the God of War II soundtrack does just that. Whether or not you'll want to endure the pomp and circumstance outside the immersive environment of the game, however, is another thing entirely.   ~God of War II - Main Titles~ kicks things off with a stormy clash of grand orchestration and majestically ominous voices that combine commanding female thrusts and militaristic male cadences to create a maelstrom of intensity that sounds like the gods from above throwing a conniption fit of cataclysmic proportions. Meanwhile ~The Glory Of Sparta~ is sufficiently turgid, filled with crashing cymbals and more of the soldiers of doom vocalistics, here augmented by kinetic percussive lunges and surging horns and strings.    The dark and foreboding ambiance continues on ~The Way Of The Gods,~ which puts the menacing and brooding vocals on hold at first, exchanging them instead for aggressive strings. After the propulsive mood is set, the voices come slowly charging in, working in tandem with the voices to create a sense of controlled chaos. This ataxia is carried over into the next track, ~Colossus Of Rhodes,~ which again makes excellent use of scathing strings, malevolent voices (this time predominantly male). The strings, which whip out in a relentless strum really drive the song, making it like a funeral dirge on crystal meth.   ~The Bathhouse~ switches things up a tad, utilizing exotic stringed instruments to create a floating sense of acoustic etherealism. The voices are mixed so that they linger in the undercurrent like wisps of misty fog. While maintaining the same air of mystery and impending intensity of the previous tracks, this inclusion does it all in a restrained and almost muted manner.     Just as you've sunken into the false sense of detached calm that ~The Bathhouse~ has instilled, the soundtrack jumps back into forcefully dominated vocal territory with ~Death Of Kratos.~ Decidedly less militaristic in tone, the track is still no less majestic in scope and also possesses the now drogue thrust, parry, and jab stylistics that have made the score so impressively aggressive in its sonic stance. That said, the track eventually bleeds off into mystical ambiance, toning things down in terms of energy, but maintaining a certain eerie glow throughout.   Drum rolls lead into battling vocal bursts on ~The End Begins~ a title befitting the music that follows. Clashing male and female vocals do battle amidst antipathetic strings and swirls of orchestra whoo-ha. For a song that is only 1-minute and 53-seconds long it feels like an eternity. ~Typhoon Mountain~ comes with a devastating hurricane of percussion and strangely baleful tribal chanting. The song shakes things up, especially with the rolling drums and wailing voices buried underneath the demanding rhythms. The insertion of woodwinds only makes things all the more sinister.   The staunch percussive elements continue on ~Waking The Sleeping Giant,~ which uses bones rattling against wood (at least that's what it sounds like) to create an overwhelming sense of death and destruction as the strings churn and boil in tandem repose. This rhythm eclipse continues on ~Battle For The Skies,~ this time giving a fleeing sense of flight and aerial escape, mostly in response to the rapid fire cadence of the song movement itself. This is one of the more horn driven numbers, as well, the brass delivering clashing, almost atonal blurts and blasts that keep you in a constant state of tumultuous unnerve.   A sense of doom ridden gloom flutters throughout ~Exploring The Isle,~ which is all exotic woodwinds, rippling cymbals, and creepy organic sounding ambient textures. The overall effect of the song itself is one of pushing through thick, viscous mist with no idea of what is around you. Either that or stumbling through the dark bracken of some overgrown rain forest as detached voices rumble inaudible sounds in your general direction. Haunting.   The voices gain a little more clarity, but fail to lose any of their acerbity or rigid impassiveness on ~The Isle Of Creation.~ The woodwinds continue to thrust deep bass inclined notes into the ether, allowing them to intermingle with contentious drumming and more of the already familiar voices. In a surprise shift, ~The Summit Of Sacrifice~ is one of the first songs to feature harp and a delicate female voice at the onset. Naturally this state of implied bliss is quickly destroyed by rumbling bass drum and the voice turns to one of hidden menace and foreboding doom.    ~An Audience With Chronos~ is one of the better stand-alone tracks on the album, forgoing much of the aggressive intensity in favor of more colorful and introspective nightmarish syncopation. Flutes and other woodwinds drift in and out of the mix while synthesized sounds of crows and other devious fowl flutter in and out of the right and left channels. Voices are melded into swaths of sound that shift and morph with unpredictable eeriness. The entire song is one of dreadful dark side dwelling cataclysm.    The unrelenting surge of strings returns on the rather rote ~The Barbarian King Returns.~ This particular track, while maintaining strong ties to most of what has come before, really sounds as if it were ripped out of the pages of Basil Poledouris's score for Conan. Or maybe it just gives off that vibe considering that the word ~barbarian~ is placed prominently in the title. Who knows?   Detached spookiness returns on ~Bog Of Lost Souls,~ a song whose title pretty much sums up what it sounds like. Swamp gases ooze out of the speakers as the orchestra works together to create a singular drone that soon descends into thumping nocturnal emissions. Like the other ~slow~ numbers on the album, this one is all about creating a sense of inescapable and choking dread. It succeeds.   From the dread and mist emerges the bombast of ~Battle In The Bog.~ Combining elements of ~Bog Of Lost Souls~ with the arresting cadence of the more super-charged numbers on the score it creates a driving blitz of menace and mayhem. Again, the vocals drive the song along with crashing percussion and measured beats and blasts of intensity. Even though the name might suggest otherwise, ~Crossing Of The Lowlands~ continues to keep the energy levels high, bringing in measure blurts of horns and swirling elements of harp to create an unnerving sense of peril.   ~Atlas~ again returns to the amorphous textures, relying heavily on ambient noize to create a sense of detached horror, as if one were drifting aimlessly in a sea of  apocalyptic fog, lost for all eternity. This mood is quickly elevated to a sense of doom and dismay on the extremely aggressive ~Palace Of Fates,~ which again makes excellent use of drums, horns, and strings to craft an agile and intense blast of sonic fury. It tapers down a bit toward the end, but even when it gets decidedly more quiet, it's deceptively so.   The now requisite vocal thrust of doom invades ~Phoenix Rising,~ a track that signals disastrous things to come, if only through the strings, horns, and drums playing musical combat with the dueling male and female vocals. ~Ashen Spire~ is the second shortest number on the entire album, clocking in at an even 1-minute. It also may very well pack the most punch in relation to its running length. That said, it's more of the same with the voices doing mortal combat with one another as the orchestra battles valiantly in the background, picking through the dead body debris with swords of soniference.   The most majestic of themes is exposed on ~Athena,~ the one song on the album that clocks in under a minute (56 seconds, to be exact). It lays the groundwork for what could have been a sweeping movement of reprieve, but just as it gets going it's over. ~The Battle For Olympus~ continues in a similar vein, adding some strange strings (harpsichord?) into the mix in an almost Morricone sense of being. That's quickly shattered by the now requisite drums and divisive male vocals, augmented by the domineering horns.    The final two tracks take things into entirely new terrain. ~Blood of Destiny~ is a full-on metal blast of scream injected mayhem courtesy of Shadows Fall. It will shock you into submission in contrast to the rest of the album, that's for sure. Meanwhile ~Junkie XL Colossus Mix~ adds a blast of electro shock therapy to the score, blips, bleeps, surges, glitches, nodes, and schisms of chopped up vocals, orchestration, and more collide in a schizophrenic miasma.    There is no doubt that the God Of War II Soundtrack is an impressive orchestral accomplishment within the ever-growing and constantly changing arena of videogame composition. Additionally there is no doubt that the score itself is perfectly befitting the nature of the game, its storyline, and aggressive battle tactics and game play. That said, the score never really lets up and is definitely more attuned to being part of the overall gaming experience of God Of War II than as a stand alone musical experience. Of course those who are enraptured by the game will no doubt disagree and wish to own it for themselves. Be warned, however, if you should choose to immerse yourself in the score apart from the game you may very well incur nightmares of death, destruction, and mythical intervention.   Definitely Download:  1.~God of War II - Main Titles~  2. ~The Bathhouse~  3.~Typhoon Mountain~  4.~An Audience With Chronos~  5. ~Blood Of Destiny~  6.~Junkie XL Colossus Mix~", "date": "Mar 29, 2007"}