{"name": "Puzzle Quest: Challenge of the Warlords", "name_review": "Puzzle Quest: Challenge of the Warlords Review", "ref": "https://www.ign.com/articles/2007/03/29/puzzle-quest-challenge-of-the-warlords-review", "text": "Casual gamers have their Bejeweled, and hardcore players have their RPGs. Long have the two groups been content to remain separate and play their respective games. But the folks at D3 Publisher have begun a socialization experiment that may find gamers from both camps playing the same game. Puzzle Quest: Challenge of the Warlords attempts to marry characteristics of traditional RPGs with the pick-up-and-play mechanics of a casual puzzle game -- and succeeds.   All the usual suspects of classic RPGs are here: players select a character from a roster of different classes of knights, druids, and wizards; set out on quests; slay monsters; and collect experience points.  Unlike other ~normal~ RPGs, battles in Puzzle Quest are played out on the Bejeweled field. If you haven't played the PopCap game online, Bejeweled is a jewel-matching puzzle game where you flip two adjacent pieces at a time in order to create matching rows of three or more gems. As you create matches, they disappear and more jewels spill in creating more match-making opportunities. There have been many variations on this simple, addictive formula, but Puzzle Quest is the first we know of to mix in an anime art style and deep RPG mechanics.   During battles, players go head-to-head against an enemy who is playing off the same field as you. You and your opponent take turns, so your move can end up being beneficial to the enemy's, or vice versa. The four different colors of gems (red, blue, yellow, green) represent different types of mana. As you clear the field and build your reserve of each type, you can spend your mana in different combinations to cast both offensive and defensive spells. If you manage to clear four jewels at once, you'll receive an additional turn. Clear five and you'll receive the extra turn and a wild card will appear that can be used as any color of mana and multiplies the amount you receive. Skulls are peppered throughout the play field, and can be used to attack your opponent when cleared. The battle will rage on until one of the side's hit points are reduced to zero. Luckily, if you lose you can simply try again -- a feature that keeps the game from ever becoming frustrating.   Real men settle their differences on the puzzle field. It wouldn't be much of an RPG if you couldn't improve your character's stats and outfit him or her with all sorts of outlandish gear. Along with all the gems and skulls on the puzzlefield are gold pieces and experience stars. As you travel about the world map, each town has a shop selling weapons and armor. Some items require you to reach a certain level before use, however, which is where the experience stars come in handy.  While you initially receive the same amount of mana/experience/gold as gems you clear (three to five pieces), leveling up your character's stats will result in bonuses in each of those areas.   Those are the basics of Puzzle Quest's gameplay, but as you make your way through the game you'll realize that there is a lot more depth to be explored.  You can expand your hometown citadel with additions like dungeons, towers, and stables.  Each expansion grants you new abilities: once you have a dungeon you can capture your enemies; once you have a stable you can train captured monsters as mounts; once you have a mage tower you can learn spells from enemies.  You can lay siege to other castles and bring them into the fold of your kingdom.  A siege is handled on the field of puzzle, but castles will have much greater hit points than most monsters.  Defeat the castle in battle, and its citizens will begin paying their taxes directly to you.   There is quite a lot of customization available to players who choose to delve into their many options.  You can only have six spells ~equipped~ at a time, and you'll soon find yourself with dozens to choose from.  Items generally enhance a certain mana or skill, so you can pick the gear that will be most effective against a given enemy.  There are also plenty of side quests that are good for leveling up your character.  All of this is optional, though, and a casual player who isn't interested in micromanaging their characters stats can play through the game ignoring most of these extras.     Travel about the world map is handled on the touch screen.  Instead of direct avatar control, players point to the location they wish to move to.  Random battles are scarce, but from time to time a zombie or giant rat will appear and need to be dealt with.  Companions will join you on your Puzzle Quest and give you access to their specific skills.  A princess who joins you, for instance, can charm the pants off of any knights you encounter and allow you to make a surprise attack.  At first this feature seems to be of little significance, but some of these NPCs make it much easier to defeat enemies that were previously too difficult.  This creates the 'Zelda effect' of encountering obstacles which you can return to once you've gotten help from another area of the map.     Puzzle Quest includes multiplayer battles for two players who each own a copy of the game.  The characters you've been using in the single-player quest are available, and any gold and experience you collect in multiplayer will be carried over to the main game.     As fun and fresh as Puzzle Quest is, it's not quite a perfect package.  The music is repetitive and you'll find yourself quickly turning the volume all the way down.  Some of the puzzle mini-games don't receive the same graphical polish as the main battle mode.  When forging new items, for instance, mana gems simply disappear when matched instead of going out with a flourish as they normally do.  Transparent text windows occasionally pop up on top of each other, creating a mess of gibberish.  To top it off, the game did freeze up on me once.   But none of this changes the fact that Puzzle Quest is tons of fun.  Hardcore gamers need not be ashamed of their love for simple, jewel-matching fun.  Fans of deep, customizable games like Disgaea will definitely want to accept the Challenge of the Warlords.What a pleasant surprise Puzzle Quest: Challenge of the Warlords turned out to be.  The unlikely marriage of puzzle gameplay with RPG mechanics makes for one of the most addictive DS experiences yet.  While there are a handful of graphical and audio flaws, the core game is solid as a rock.  What is perhaps the most telling evidence of Puzzle Quest's fun factor is that I'll still be playing long after I've finished this review.", "date": "Mar 29, 2007"}