{"name": "Kim Possible", "name_review": "Kim Possible Review", "ref": "https://www.ign.com/articles/2007/03/30/kim-possible-review", "text": "If you sit down and watch Disney's Kim Possible cartoon free of any snobbery and derision, you're in for some good entertainment. The art style is outstanding, the writing crackles at least once per episode, and the characters are exceptionally well-fleshed out. Not bad for a cartoon about a high school cheerleader who moonlights as a secret agent with generous assists from a nacho-loving geek and his naked mole rat. With a lead villain of considerable charisma, Dr. Drakken, Kim Possible is ripe for video game stardom -- as such, she has appeared in a series of GBA, DS, and PlayStation 2 games where she kicks butt and calls upon gadgets and friends to save the day.   So, when I saw Kim Possible on Cingular's deck this week, I wondered: Will Kim go up against Shego and Dr. Drakken? Will Ron Stoppable delve into the jungle to face off against Monkey Fist? Or will somebody take the easy road and slap the secret agent in a third-tier puzzle game?   Take a wild guess.   Kim Possible is, at its core, a tile-flipping game. To reach Dr. Drakken, Kim must turn all of the floor tiles in the fifty rooms of the villain's lab the same color by stepping on them before time runs out. When all of the tiles are same, the exit opens up. Some tiles turn different colors depending how many times you step on them. The ~challenge~ is to figure out the proper path to turn all of the tiles the same color, occasionally avoiding danger from lasers and bombs. Kim can pick up batteries to power up her invisible shield and deflect laser attacks.   Every ten levels, you get a minor minigame starring the naked mole rat, Rufus. Like Sonic Jump, you press a button to vault Rufus up a screen full of cascading platforms. At the top of the level is the key for the next series of stages. This minigame is neither exciting nor really all that much to look at, especially considering how expressive Rufus is in the cartoon.   There are a few bonus items, like Shortcut boxes that instantly warp Kim out of the level or a Time Stop that freezes the clock for a few seconds, but they don't really add all that much to the game. The problem with Kim Possible is that it really doesn't try. Not every game needs to advance the ball, but at least try out some mechanics that are a little beyond 2003. The visuals aren't even that winning, with Rufus a blob of pink pixels and the game screen largely static.   The game functions, but it isn't remotely engaging. The puzzles should be the minigame in another Kim Possible game -- not the star attraction. Flipping tiles? Shortcut game mechanics like this are one of the reasons many gamers look down on the mobile scene. Resorting to a puzzle (at least it wasn't another match-three game) shows that there wasn't much effort here to do something really in line with the source material.", "date": "Mar 30, 2007"}