{"name": "NASCAR 2000", "name_review": "NASCAR 2000", "ref": "https://www.ign.com/articles/2000/04/01/nascar-2000-3", "text": "NASCAR, the sport of Kings.  Or is that horse racing?  NASCAR's a sport, at least I know that much.  Maybe it's the sport of Dukes.  Anyway, while many people find it boring and tedious to drive around in a circle 500 times, some members of our glorious civilization go nuts over a good NASCAR race.  Trust me, I work with three folks from North Carolina, so I know a little bit about how NASCAR works.  Basically there are three elements to any good NASCAR simulation: accurate physics, realistic crash models, and cheap beer (only for those of you in the stands, please).  So, with a PBR in hand, I tackled NASCAR 2000 this week to see how it stacked up against the other NASCAR racers out there.  First off, I have to say that I am a huge fan of racing games, but this game was just frustrating. It completely misses one of the driving forces behind NASCAR.  Why, oh why do people have such a fascination with watching others drive in circles really fast? Because of the crashes, that's why! Americans can't get enough of the crazy fireball flinging, tire spewing, junk flying into the stands but the driver miraculously walks away from it kind of crashes.  So now I ask the question, ~why did this game totally screw up the crash models?~ First off, yes you can crash, but you will never see any flaming cars. No, you will never see any tires flying off into the crowd and people running for cover. And guess what, no matter how badly you crash, you will always be able to drive your car away from the wreck. This actually does open up an interesting option for gameplay strategy, but I'll get into that a little later.  One of the first things I do to test out the potential for what is supposed to be a realistic racing game is to crash the car. Now when I crashed the car into the wall the hood popped off, which is a really nice effect. But that's about as far as it will go besides the smoke and the occasional random parts flying off of your car. I even turned the car around and ran at the other cars at 190 mph and hit head on with the front-runner that must have been going close to the same speed. You think that there would be a huge explosion and cars that won't be able to run any more, right? Nope. Sure, you go flipping up into the air and fall to the ground, but as long as your car doesn't land on its back, you'll be able to drive away from the accident.  Okay, enough of the rant. The no big crashes thing was really the most important mistake to me, but much to my chagrin, it didn't totally ruin the game. It's much easier to write a review for a really bad game, but as much as I wanted it to be, it just isn't that bad.  Like I said, some people may think that NASCAR games are boring because all you do is turn left.  But that's how NASCAR works.  You're supposed to go around in a circle. That's what these races are, and the guys at EA did a decent job simulating the sport with a flurry of in-game options that let you customize the game to your taste.  While we're on the subject, let's talk about what is available in the garage. Another extremely important  feature of any NASCAR game is giving the driver the ability to customize the cars in any way they see fit.  Yes, they're stock cars, but the real NASCAR guys tweak the hell out of them.  All of the options in the game seriously effect the way your car handles, and it's important to set these features to the optimum level since winning a race can come down to a fraction of a second difference in race times.  The options include tire pressure in all four tires separately, shocks, weight distribution, wedge, gear ratio, wheel chamber, rear spoiler, fuel amount, and steering lock. All of these are explained thoroughly in the manual with tips for what kind of effects each of the settings will have on your car, and it's up to you to figure out what settings fit your driving style best.  You'll really need all of the help that you can get as well, because the drivers in this game really don't let up. There are 30 different NASCAR drivers represented in the game, each modeled with a certain amount of aggressiveness and AI put in to fit each of the drivers' racing style. The differences are pretty subtle for the most part, but you'll get to know who's more likely to give you a shove from behind after a while. In addition, each of the drivers comes with a pit crew and car that is decaled authentically.  There are 18 different tracks from the NASCAR circuit that include all of the different types of tracks that grace the racing season. These include Speedways and Superspeedways that are really set up to let the cars show off their power and speed.  Short Tracks that take up about a third of the season and require a bit more handling, and Road Courses that actually require you to turn right as well as left. This confused poor Tal quite a bit. He just kept turning left into walls. Anyway, these were the most fun to me because it gave me a bit more to think about and adjust to during the race, but beware because they are also very challenging. It took me a while to actually finish a race on one of these courses. There are also some nicely designed Fantasy courses  (no, not like Candyland, just ones that don't exist) that are really very challenging. They are all Road Courses and have some pretty tough turns in them, although they make it easier to smash your opponents into the wall.  There are a few options for play including Quick Race for those who just want to jump in, Single Race Weekend for those that want to have qualifying rounds and adjustable cars, Championship Season to compete in a full season over all 18 tracks, and Race Against the King which allows you to challenge the master racer, Richard Petty. There is also multiplayer capability that allows for eight drivers to connect and race against just themselves or with computer opponents as well.  The tracks themselves are very nice, scaled and modeled very well. They really give an authentic feel to the game. The cars are nicely detailed and look okay, but they aren't as slick as cars in a game like Mobil 1 Rally.  But this isn't to say that they were terrible.  They just could have used a touch-up. And, as I mentioned before, the damage models leave a lot to be desired.  It just  doesn't live up to the cataclysmic standards that I would like to see in a NASCAR game.  Enough of the graphics, let's get down to how it plays. In simple terms, this game is difficult and frustrating. There I said it. When you start up the game, the defaults are set at a rookie level. There are a few options for turning down the aggressiveness, AI of the drivers, power of your car, and so on, but I figured that I would start myself off at the default level that they set it at. And besides that, the game is supposed to be a racing simulation, so it almost defeats the point to change all of the settings so that the other cars are slugs. I managed to place first in one race the entire time that I played the game. I think the only reason that I placed first in that race is because the track was an easy one with gradual turns so I never had to slow down. Once using the brakes or shifting gears comes into it, it starts to get remarkably tougher.  I was actually forced to restart races on countless occasions. If you screw up at all in this game, like bumping into a wall, hitting the breaks to hard, rubbing against a car so that you almost spin out, then you're basically out of the race. There is an option in the menu to turn damage off so that your car won't actually suffer the ill effects of tire or suspension damage that slows you down, but once again, if you get slowed down at all you'll get passed and the front runners will speed ahead so there will be no way you can catch them.   But there is a different way to win that really comes down to cheating. One of our techies Andrew figured this one out when he got frustrated and started merciously taking NASCAR games are what cut the consummate professionals of the games business from the fair-weather Johnsons. Oh sure, we all love reviewing the latest Mario or Zelda game simply because they're a joy to play. And while the aftermath of a wrathful game PR company isn't always worth it, there's always a gleeful release in unloading on a horrible Muppets or Rugrats game.But then a NASCAR game comes along, and suddenly you realize just how out of your league you are. I mean, a race game where you turn left and only left? What fun is that? But there are people in other parts of the country (and trust me, unless you yourself are a NASCAR fan, the fan fervor is in some other part of the country no matter where you live) who love this sport. Love it! Don't get me wrong -- I'd much rather be a fair-weather fan boy than have to wade through NASCAR games as a career, but taken in moderation and with the right frame of mind, they can be fun. And THQ's version of the EA Sports NASCAR franchise is, despite an awful graphics engine, enough fun for what it is to warrant a look for NASCAR fans. If you're just a casual race game, first off you should know never to be duped into a review by the NASCAR name ever again (need I say it again? LEFT TURNS!) and to instead check out Infogrames Wacky Races and Test Drive Le Mans. But if you're one of those guys living in wherever-the-heck you are and can't get enough NASCAR, all of the stats and licenses and realistic car options and knick-knacks and whatnot will light up your life. And even for others who fear NASCAR like all other things Southern, this pocket racer won't hurt you as much as, say, abolition of Darwinism or a nasty rodeo accident.", "date": "Apr 1, 2000"}