{"name": "Brave: The Search for Spirit Dancer", "name_review": "Brave: The Search For Spirit Dancer Review", "ref": "https://www.ign.com/articles/2007/04/02/brave-the-search-for-spirit-dancer-review", "text": "In a noble quest, Brave: The Search for Spirit Dancer, tries to bring the platformer genre alive for again for young kids, but it doesn't quite go all the way. While other platformers such as Jak and Daxter have realized that much more than jumping around is needed to be fun, Brave starts out with good intentions and then falls flat halfway through. It relies way too heavily on jumping around and little else. There are a few parts of the game that you almost want to love, but the overall feeling is definitely one of indifference.   The title character, Brave, is a young Native American who must become a warrior in order to save his village. Some gigantic fire skeleton has taken over and started turning everyone into zombies, as they usually do, and it's up to Brave to go off to find Spirit Dancer to save the day. Along the way, Brave will learn many skills such as possessing animals and shooting arrows, but none of them help him to control the wayward camera, more on that later.    This power-up looks cool, but you won't use it much. As Brave quickly grows into a warrior he learns some cool tricks. He can call out to animals and follow tracks along the ground, both of which are added nicely and help to flesh out the world. There are other areas such as canoeing and ice climbing that shows plenty of potential. Combined with an endearing art style, Brave creates a nice little reality for itself. If only this stylized comfort lasted the entire way.   The big, fat problem with all of this is that these extra features are barely given any time to develop. At best, tricks are used to find hidden items just for the sake of finding them. Some abilities are introduced and used just once or twice. Instead of learning some new trick and then finding other ways to use it later in the game, it's simply forgotten.   The combat here is very straightforward if you've ever played a game where mashing on one button is all you need to know. To be honest, the combat is all about two buttons: one to supercharge Brave and one to mash for constant attacks. Most of the combat is simple to pull off. It's really about giving the illusion of depth for younger players, but anyone who would expect a challenge in the typical battles is looking in the wrong place.   As the game gains momentum with Brave learning his abilities, it shows off its true intention: to bore you with lots of clumsy jumping. The camera system is awkward and misguided which makes the battles tricky to follow when it's zooming in on the ground or turning away from what's happening. When the game relies more and more on precise jumps later in the game the camera is the biggest opponent of all. Asking where you're going and what's going on is all too common.   The only battle that gets interesting takes place in a lava level (yes, there's also an ice level), but is also ruined by the camera. While fighting fiery demons, Brave needs to carefully dodge several attacks while striking opponents with lightning. The camera typically gets in too close to see and in these battles it's too far away to make anything out. It just never gets it right or even close to being right.Brave starts off on the right foot, but stumbles through just about every other section in the game. The whole experience is about wasted opportunity, platforming clichs, and a camera that won't quit in its attempts to make you want to plant your controller in your TV. The style is nice and, if it was developed with more care, it could've been a fun and decent platformer. As it is, it just makes you want to go and play Jak and Daxter again instead.", "date": "Apr 2, 2007"}