{"name": "Tetris Multiplayer", "name_review": "Tetris Multiplayer Review", "ref": "https://www.ign.com/articles/2007/04/02/tetris-multiplayer-review", "text": "The need for another mobile edition of Tetris is certainly worthy of debate. However, EA Mobile closes the discussion and underlines the conclusion by releasing easily the best mobile version of Tetris since Blue Lava's original back in 2003. Making this even better, this newest edition of Tetris will be the flagship edition, replacing all others floating around decks save for any variation title, such as Tetris Mania.   EA Mobile's newest Tetris offers a superlative take on the puzzle phenom with a clean interface, excellent color, and solid controls. The package is then fattened with an excellent multiplayer component and some additional single-player variations for players that for one bizarro reason or another tire of the original game.   Multiplayer is the key feature of the new Tetris. Using its own network technology, EA Mobile's online service is fantastically easy to set up and use. Once you create a simple account with user name and password (you can also use an account you may have registered for any previous EA Mobile online games), you can wade into an intuitive lobby. Within just a couple of button presses, you're waiting for a match. You won't need to wait for long, either. The game is currently live on Java-enabled handsets and after creating my account I waited only ten seconds for my first opponent. Tetris will soon be on BREW handsets and the game plays cross-carrier, so expect a massive install base.   I have timed out while waiting for a player on only a handful of occasions, but otherwise, finding a human opponent was effortless. And you don't even need to sit there and stare at the screen once you tell the game to seek an opponent. A chime and vibration indicates that a new match is about to begin.   If you have a friend with Tetris, you can search them out by just dropping their user name into the multiplayer menu. My handle is ~wholefoods~ if you are so inclined. (I needed to create an account and somebody else already had ~levi,~ so I went with the name of the nearby grocery bag.) If you have no friends online, you can seek out players with similar skill levels so you aren't mercilessly hammered over and over.   You can play two different Tetris variations online: Versus and Clash. Versus is head-to-head as you would expect. You try to clear lines as quickly as possible to dump garbage on the other player. Clash drops both players in the same well, turning the game into a tug of war. You drop pieces to make sure your opponent cannot clear a line, but hopefully set yourself up for a strong move. I primarily stuck with Versus, although Clash is certainly a workable variation. EA Mobile keeps the action moving by not making the game real-time, but stores a few moves and then sends the packet across the network. Even without an of-the-second match of bricks and line clearings, the experience is expertly smooth. There is never a queue of stored lines so deep that either player receives an unfair advantage. If you manage to hit a Tetris, you must only wait a few seconds for that garbage to go whistling through the airwaves.   Games rarely last longer than two minutes, which is perfect for mobile consumption. Almost every carrier now has an all-you-can-eat data plan, but if you are paying per kilobyte you still should watch out for data costs.   The single-player game is also quite good. Classic Tetris -- also called Marathon -- is the main event. You can also play a two-minute match called Ultra. 40 Lines is a clear forty line challenge. There is a Pass n' Play game, where you hand the phone to friends and everybody plays with the exact same queue of blocks. You can also play the two multiplayer games -- Versus and Clash -- on your own against the computer.   As mentioned, Tetris is exceptionally clean. The use of color is great, especially the red backdrop used for multiplayer in contrast to the blue backdrop of single-player or the green well of Clash. The game uses some nice blurring effects when you slam a piece into place at the bottom of your well. The music is good and the sound effects are solid.  I'd be the first to question the need for another version of Tetris on mobile, but am completely comfortable espousing the praises of this latest edition. The inclusion of smart, easy-to-use online multiplayer makes it a must-but for any puzzle gamer that likes competition. Getting into match literally takes seconds and the match length is just right for mobile. The single-player game is also rock solid -- if you need to brush up on your skills before facing the rest of the country, go here. With EA replacing previous versions of Tetris with this new version to eliminate confusion, I wholly recommend fans download this edition. It is the best version of Tetris seen on mobile thus far. Not that there needs to be another update any time soon.", "date": "Apr 2, 2007"}