{"name": "Enchanted Arms", "name_review": "Enchanted Arms Review", "ref": "https://www.ign.com/articles/2007/04/03/enchanted-arms-review", "text": "For three hours straight, I thought Erik Brudvig was insane.    As I navigated the barren maps of Enchanted Arms, listened to the title's excruciatingly bad dialogue and laid waste to a handful of lame bad guys, I thought that the 7.6 Brudvig gave the Xbox 360 version last year was the product of a drunken gameplay session or an Ubisoft/From Software mind-control device.   I kept playing, things eventually picked up, and I understood what makes the game enjoyable at times. However, it's clear that Enchanted Arms isn't the greatest RPG in the world -- hell, it might not even be that good of an RPG, period -- but it does bring traditional turn-based combat and a vast collection of colorful characters to the PS3.   Crap. We woke up dad. In the Enchanted Arms universe, there was this war between golems (magical dolls that humans used to get stuff done) and people a thousand years ago. Some devil golems showed up and made the rest of the dolls turn on humanity in an ~I, Robot~ style revolt. That sets the stage for when you boot up the game and step into the present-day shoes of Atsuma, a lazy student at Enchant University. At this point, golems are back to being used for everyday tasks, and there's even debate if the whole ~devil golem thing~ ever happened. But when Atsuma and some friends cut classes, head to the Yokohama Founding Festival and all hell breaks loose, the group quickly deciphers that devil golems aren't a thing of the past.   People join your party, Atsuma keeps having weird dreams and basically the group keeps battling for its world. Each character levels up as the game progresses, learns new skills and can be swapped in and out of the four-person battle squad. Combat occurs on a pair of 4x3 grids (one inhabited by your enemies and one inhabited by your team). The grid warfare means that each character needs to be strategically placed to take advantage of his, her or its own set of ranged and close-combat attacks -- you'll need your sasquatch golem within two squares of an enemy to allow the massive monster to beat the baddie down with its paws; and you'll need to leave your werewolf golem three squares away from an enemy to allow the creature to unleash Air Force, a ranged attack.    It's pretty typical RPG fare, and that's not a bad thing. Watching a new move in motion and trying out different golems that look like stuffed animals or creatures from the Black Lagoon are some of the best parts of Enchanted Arms.    None of this is news to you if you played or read about the 360 title. In fact, if you've been waiting for this game all these months, you probably just want to know about the differences between the two versions.    I have good news and bad news for you.   The good news is that Sixaxis controls have been added to Enchanted Arms, and they're actually pretty fun to use. Players can shake the controller to make Atsuma dance and fill a special attack meter, called EX points; shake it before unleashing a special attack to add up to 20% more to a move; the controller can also be waved to implement Atsuma's grappling hook and it comes into play in more than a few mini-games such as a pizza-eating contest.    The bad news? There's no online element to Enchanted Arms on the PS3 at all. Over on the 360, players can build their team and take the squad online to duke it out with other Enchanted Arms devotees. There's leaderboards for the battles and for the title's casino games, but not here.   Without those online features, the shortcomings that were forgiven on the 360 are all the more glaring on the PS3.   The game's plot is weak - you're out to save the world and discover the truth about your right arm, which has its own set of magical powers. The voices and script are terrible -- after being pounded by Atsuma, a bested professor tells our hero that he'll be sorry. His response: ~You know, she might be right.~   Makoto, one of Atsuma's teammates, is the worst type of homosexual stereotype. He's lisping, fawning over another male teammate, dressed awkwardly and forced to spout lines such as ~The final blow!~ in ways that will leave you feeling dirty.   What did you say about my necktie?! Additionally, the environments are bland and empty. Running around Atsuma's school will remind you more of an ancient, dusty castle than a bustling school for future Enchanters. The facial animations for speaking characters are reminiscent of a poorly dubbed kung-fu movie. And to top it all off, you'll be given lengthy instructions on the easiest of things -- climbing a ladder, swimming, etc. -- and then the exact same instructions will appear at the bottom of the screen.   That said, Enchanted Arms still found a way to keep me entertained. After you make it through the first few hours of wacky introductions to Atsuma's world, you'll get to start crafting your own golems and a new ~gotta catch'em all~ element takes over. While the majority of the golems have gone bonkers in the game, Atsuma and his squad can create their own partners based on cores found in the environment, attained from battle and bought throughout the world. Who doesn't want to fight with a pizza monster by their side or go into battle with a badass dressed in back, packing a huge sword who's named Lord Onyx?   But even with the more than 100 golems that you can collect, you're excitement is going to wane thanks to the endless stream of random battles that pop up as you try to make your way from Point A to Point B. You can choose to have the computer simulate the fights, but even then, you're left watching the colorful animations and checking your watch as gameplay becomes battle after battle.   Still, you'll keep coming back for the chance to unlock a more powerful golem for your team.Enchanted Arms is a slightly above-average RPG at best. Yes, it's the first role-player to feature traditional turn-based combat on the PS3, but there are so many shortcomings to the actual game that I can only recommend the $60 investment to the hardest of hardcore RPG fans. There's nothing here that stands out. You've done it all before.", "date": "Apr 3, 2007"}