{"name": "TestDrive Unlimited", "name_review": "Test Drive Unlimited Review [PS2]", "ref": "https://www.ign.com/articles/2007/04/04/test-drive-unlimited-review", "text": "When Test Drive Unlimited first released for Xbox 360 last fall we praised it for its seamless integration between the multiplayer and single player games, vast streaming series of roads, and great community features. Unsurprisingly, the game received a bit of a downgrade during its trip to less powerful systems and many of the features present on Xbox 360 have gone missing. The core game remains the same, though, and there are still plenty of reasons to check out Test Drive Unlimited on PS2 if you haven't had the chance to try it yet. Just don't expect an experience that feels completely fleshed out.Test Drive Unlimited is a unique game that merits a look simply for what it has done in terms of design. Labeled as a Massively Open Online Racer (MOOR), Test Drive Unlimited blurs the line between a single player and online multiplayer racer so thoroughly that it may as well not exist. Provided you have a broadband internet connection, players can hop onto the island of Oahu and drive its hundreds of miles of roadways alongside thousands of other players. Whether you want to simply enjoy the scenery as you cruise around the tropical landscape, compete against AI opponents in races by yourself, or challenge others you meet online, the choice is yours and the result is more freedom in a racing game than previously possible.So far so good. Test Drive Unlimited has a distinct lack of structure, instead allowing players to tackle the island in whichever way they see fit. After a brief tutorial, players are given the island to explore with a series of races dotted around the landscape. The races are all pretty standard with timed challenges, speed courses, and races requiring both a fast time and clean driving. The goal is to travel from race to race, each with vehicle restrictions, and win them so as to earn money, buy new cars and houses to keep said cars in, thereby enabling players to take on new challenges. It can all get a bit monotonous, especially if you're only playing offline, so it's a good thing the online aspects are in place or there wouldn't be a whole lot to this game.The cops are disabled in online mode. Nice. The Xbox 360 and PC versions give players an avatar and several mission quests they can use to help win prizes towards customizing their persona. All of this has been removed, but a few new features have been added to claim their place. The first is a set of championship race series, though there isn't really anything to distinguish these from any of the other races in the game. The most noticeable, and best, addition is a scoring system similar to the Kudos offered in the Project Gotham series. Points are given for winning races, drifting, getting air, slip-streaming, and general driving. Collect enough points and new races will be unlocked, similar to the way they were with Achievements on Xbox 360 although this system is much more fluid and sensible.The loss of the missions can be stomached, but what causes more of a stir is the removal of several online features that did wonders towards encouraging community interaction on Xbox 360 and PC. These are the auto clubs, Test Drive Unlimited's version of clans, and user created races. While you can still flash your lights at another player and take them on in an instant challenge with the finish wherever you please, specific races with multiple requirements and checkpoints can't be uploaded for others to try out. This severely limits the longterm potential of the game. Rather than allowing for unlimited user created challenges, players are stuck with the limited number of developer created lobbies and accompanying races and simple point A to point B challenges.This lack of depth comes into play much earlier than you might think. The online system consists of placing a small number of players into your immediate surroundings in lieu of a massive server with thousands of people playing. That means you'll always run into someone, but it also prevents you from easily locating a friend across the island and driving to them. Even if someone shows up in your surroundings, it doesn't mean that they'll stay there as the game constantly repopulates the cars around you. Thankfully, you can lock other players to your server and create a friend list, but this process isn't as easy as it sounds. A tedious process of finding others and a limited number of online features takes a lot away from this game that is otherwise built on solid foundations.Without a lot of community features, players will likely find themselves sticking to the single player races in hopes of upgrading the contents of their garage. But then, what is the point of being online anyways? The leisurely layout that encourages simple driving is nice, as does the process of getting to new races which requires you to drive miles across the island before entering. It's pleasant and the streaming island is a great place to explore, but more robust community tools would do a lot to bring this title to life. The graphics on PS2 obviously can't compare with the Xbox 360 or PC, but they do more than get the job done. The open and streaming world is surprisingly smooth on the weaker hardware with a solid framerate and very few issues with objects popping into view. The scenery isn't as lush or vibrant as it is on other systems making the off-road driving a bit drab, but Test Drive Unlimited holds up quite well on the PS2. The only real hitch is the satellite map, a great feature on other systems, that chugs rather poorly on the PS2.Like other versions, the physics of Test Drive Unlimited are more than a bit wonky on the PS2. There isn't any car damage and you can't flip your vehicle over creating a peculiar, elastic feel to any collisions with oncoming traffic. Driving into brush, trees, or poles also creates weird visual sensations. Hitting any stationary object will stop your car dead, even if that stationary object wouldn't have the mass or strength to stop a small child from running directly through it. A bush can stop a car moving upwards of 200 MPH dead in its tracks.This is the type of car we usually rent while vacationing. Cars feel a bit more natural on the PS2 than on the other versions of Test Drive Unlimited, and that is a good thing. With such a vast island to explore and numerous races to tackle, you'll likely spend much of your time in just a handful of the large car selection and you'll have each individual rides intricacies nailed down after roughly half of an hour. That leaves plenty of time for smooth riding. Simulation fans will find the level of customization and depth sorely lacking, but there is a bit more to Test Drive Unlimited than your average arcade racer. The motorcycles have been entirely removed from the game, but they were a sore spot anyways so we won't bemoan that loss.It's impressive that Test Drive Unlimited even works in its limited fashion on the PS2. A large portion of what made this game so good on the Xbox 360 have made it over intact and the robust engine still runs quite well with nice graphics and a fluid, streaming world.  Unfortunately, features (specifically online ones) have been removed likely due to the limitations of the platform. The whole isn't quite as good as the potential behind it and some may find the lack of direction or features wanting, but the entire package is still strong enough to warrant a look for those that don't have the option of playing it on a more powerful console.", "date": "Apr 4, 2007"}