{"name": "Silverfall", "name_review": "Silverfall Review", "ref": "https://www.ign.com/articles/2007/04/04/silverfall-review", "text": "Acquiring more powerful items has some sort of mystic connection to the human spirit, it seems. For whatever reason, fans of action-RPGs will subject themselves to thoughtless, repetitive activities for hours at a time only to get another point of fire damage on their weapon, or get a black hood instead of a white one. If this weren't the case, a game like Diablo would never have succeeded. Silverfall, like Diablo, is all about getting more powerful gear by highlighting an enemy, clicking, and repeating until your finger gets tired, you pass out, or the game pisses you off. Silverfall, the latest Diablo clone out on the market, has many qualities that may drive you to flirt with the uninstall option. It's an utterly mindless mouse clicking adventure with quests and characters fresh off the  clich assembly line, a perpetually aggravating camera system, inconsistent movement pathing, poor graphical performance, and some noticable bugs. On the bright side, it does offer a decent action-RPG foundation, loads of items to acquire and skills to learn, as well as a multiplayer mode, assuming you can get it to work.Generic might be the word that stands out in your mind while acclimating to Silverfall's game world. We've seen Trolls, Orcs, Human, and Elves countless times before. We've seen swamp, forest, desert, and cavern maps even more. That's exactly what you get in this game, as you pick one of the four races you've played countless times before to adventure across terrain you've already seen. It's not all Tolkien-esque high fantasy, however. A major theme in the game is the interplay between nature and technology, and you'll see such ideas manifest as industrial revolution era structures in towns and across the landscape.  You start the game as the city of Silverfall is under attack by some ill-tempered interlopers and temporarily take control of a super-powered mage in an attempt to prevent the evil forces' dastardly ravaging. The city is unavoidably destroyed, however, and the game kicks you into control of the low level created character you'll spend the rest of the game tricking out. With each level up you get skill and attributes points to boost magical and melee power. Among the many skills to learn in the game's rather robust skill system, you'll find armor boosts, increased damage potential for ranged and melee weaponry, numerous magical projectiles and buffs, summons, and healing spells. Specific racial traits also open up as your character progresses, though none of these we saw were particularly interesting. Depending on what kinds of side quests are completed, your loyalty swings toward nature or technology, unlocking special items for use and a range of other skills.Since narrative for quests of main and side varieties is about as engaging as a pebble, this game would require some interesting items to drop from enemies to maintain your attention. Thankfully there are quite a few, and the visual variety and differing effects are enough to keep you hunting around at least for a little while.Companions can be recruited to expedite the monster slaughter and, depending on their character skills, instructed to focus on healing, combat, or a mix of the two, and follow instructions rather well. They can also be equipped with items you grab off the ground and potions, adding to their appeal.  There are a few things this game got right, mostly by making the lands surrounding Silverfall more convenient to travel around. By opening your map there'll be plenty of icons around to quick-travel to different locations, facilitating the process of moving through old territory. Enemies have a limited auto-level function in this game, so running through previously explored areas won't always be a breeze, making the quick-travel option even more appreciated. Markers and arrows on your minimap also work to make it clear where you're supposed to be going, especially when the quest descriptions give you little to no heading whatsoever.While the map can be convenient, you'll constantly be struggling with the camera to orient yourself properly. For whatever reason, the minimap displays an arrow over your character showing which way the camera is currently pointing, not the way your character is facing. As a result, you'll be in a near constant state of camera tweaking to get your character movement, camera orientation, and quest destination coordinated, an issue made worse by the fact that the camera continues swinging around after you've released Mouse 3. You can click on the minimap to move your character around instead, but once you get out into the fields the enemy density is too high, requiring you to make more precise movement clicks on the main screen. Add in some occasionally erratic character pathing and you'll likely be touched by the urge to punch your monitor.     Dying in Silverfall is handled similarly to Diablo. Taking too many hits respawns you in a town and forces you to retrieve your stuff back at the spot you died. Your tombstone's location is recorded in the minimap to facilitate recovery. If you die on the way out to get your stuff, the game spawns another tombstone, and you can tell the game to highlight either one through your quest log if you so choose. To avoid this recovery hassle, it's possible to insure yourself at a town, but you probably won't be doing this every time because of the inconvenience of trying to find the proper NPC. What's really perplexing about this system is why your armor and weapons aren't auto-equipped on your character when you retrieve a tombstone. More often than not, you die at a spot where enemies are mulling about, meaning you're going to take a few hits to reclaim your items. Instead of the game reequipping you automatically, you need to instead open your inventory and reapply all the items manually, leaving you particularly vulnerable to attack in the process since you'll be wearing no or at least weakened armor.Though there are many parts of Silverfall sure to frustrate, such as the physics system that permits items dropped from monsters to tumble irrecoverably into nearby pits and ponds, the game at least got the core action-RPG elements right. As silly as the concept is, the game manages to generate that addictive urge to find better equipment, topple more powerful enemies, and then hope those enemies drop better equipment to defeat even more powerful enemies. To add some variety, the game gives you to the options to reorient your character's statistics and abilities whenever you like (assuming you've got the cash), which allows you to experience all the game has to offer without starting all over again. Silverfall can be pretty, even if the environments are generic, and the areas are populated with some interesting looking creatures. Unfortunately it doesn't perform all that well, especially if you try to use the over-the-shoulder camera view. We experienced a fairly regular and sometimes major hit to the framerate, in addition to extremely lengthy loading times.  Unfortunately this game can't compensate for its bugs with innovative gameplay because there is no innovative gameplay. This program crashed numerous times at various points though we didn't lose all that much data as the game is continuously overwriting the same save file. At one point, one of our active companions stopped responding to us, meaning we couldn't give him battle orders or tell him to get out of the party. We were stuck with him on auto-heal, the last order we'd given him before the screw up, which was rectified after we reloaded the game. We also had a number of issues with the online component, which allows players to adventure cooperatively or fight each other. If you got this game through digital download (as opposed to the retail box or steam), the game has issues with updating to the 1.16 patch, which means you somehow need to find someone running the 1.15 patch to play online. Beyond that there were numerous connection problems and lag issues once finally in a server, so from what we could tell you shouldn't be considering this game for its online component.This game needs a few more patches before it can really be called stable. Considering it doesn't really do anything new for the action-RPG genre, and screws up aspects of the genre games released a decade ago were doing quite well, there's little reason to involve yourself. It gets most of the fundamentals right, however, so it's not a complete waste. It can be a visually appealing game when the framerate isn't having epileptic fits, and offers standard action-RPG gameplay, but that doesn't excuse its numerous flaws. Go play the Titan Quest expansion instead.", "date": "Apr 4, 2007"}