{"name": "TestDrive Unlimited", "name_review": "Test Drive Unlimited Review [PSP]", "ref": "https://www.ign.com/articles/2007/04/05/test-drive-unlimited-review-psp", "text": "When Test Drive Unlimited first released for Xbox 360 last fall we praised it for its seamless integration between the multiplayer and single player games, vast streaming series of roads, and great community features. Unsurprisingly, the game received a bit of a downgrade during its trip to less powerful systems and many of the features present on Xbox 360 have gone missing. The core game remains the same on the PSP, though, with the entire streaming, load-free island of Oahu in the palms of your hands.Test Drive Unlimited is a unique game that merits a look simply for what it has done in terms of design. Labeled as a Massively Open Online Racer (MOOR), Test Drive Unlimited blurs the line between a single player and online multiplayer racer so thoroughly that it may as well not exist. Provided you have a broadband internet connection, players can hop onto the island of Oahu and drive its hundreds of miles of roadways alongside thousands of other players. Whether you want to simply enjoy the scenery as you cruise around the tropical landscape, compete against AI opponents in races by yourself, or challenge others you meet online, the choice is yours and the result is more freedom in a racing game than previously possible.So far so good. Test Drive Unlimited has a distinct lack of structure, instead allowing players to tackle the island in whichever way they see fit. After a brief tutorial, players are given the island to explore with a series of races dotted around the landscape. The races are all pretty standard with timed challenges, speed courses, and races requiring both a fast time and clean driving. The goal is to travel from race to race, each with vehicle restrictions, and win them so as to earn money, buy new cars and houses to keep said cars in, thereby enabling players to take on new challenges. The upgrading and car customization is very limited, with the game instead focusing on simple driving. While the single player game can get a bit monotonous on the consoles, having it on a handheld is much more palatable. Simply cruising around the island exploring and entering a race here or there is relaxing and enjoyable. It's a good thing that this portion of the game holds up so well on the PSP, because the multiplayer portion of the game doesn't. Does this model come with power seats?The Xbox 360 and PC versions give players an avatar and several mission quests they can use to help win prizes towards customizing their persona. All of this has been removed, but a few new features have been added to claim their place. The first is a set of championship race series, though there isn't really anything to distinguish these from any of the other races in the game. The most noticeable, and best, addition is a scoring system similar to the Kudos offered in the Project Gotham series. Points are given for winning races, drifting, getting air, slip-streaming, and general driving. Collect enough points and new races will be unlocked, similar to the way they were with Achievements on Xbox 360 although this system is much more fluid and sensible.The loss of the missions can be stomached, but what causes more of a stir is the removal of several online features that did wonders towards encouraging community interaction on Xbox 360 and PC. These are the auto clubs, Test Drive Unlimited's version of clans, and user created races. While you can still flash your lights at another player and take them on in an instant challenge with the finish wherever you please, specific races with multiple requirements and checkpoints can't be uploaded for others to try out. Rather than allowing for unlimited user created challenges, players are stuck with the limited number of developer created lobbies and accompanying races and simple point A to point B challenges.Our experience with the multiplayer game wasn't very enticing either. You can play online with a WiFi connection or through an AdHoc connection. Both are limited to four players, although the servers on a WiFi game will repopulate the area with a randomly changing assortment to create the feel of a more populated island. Still, races only have four cars and we found a good number of our challenges and meetings with others to be laggy with cars skipping around and popping in and out of existence.Even if someone shows up in your surroundings, it doesn't mean that they'll stay there as the game constantly repopulates the cars around you. Thankfully, you can lock other players to your server and create a friend list, but this process isn't as easy as it sounds. A tedious process of finding others, a limited number of online features (and players!), and a lagging experience make the multiplayer game far from ideal.The graphics on PSP obviously can't compare with the Xbox 360 or PC, but they do more than get the job done. They even look better than the near identical PS2 version. After seeing game upon game have problems loading levels, the streaming island of Test Drive Unlimited feels like a gold nugget in a pan of mud. You can drive straight around the island and not see a loading screen - no small feat for a game on the PSP. Even when the load screens do come up for warping to a previously traveled area or starting a race, the turnover time is quick and painless. The technology here is fantastic and really adds to the experience. The only visual knock on the game is that the interior view, present in every other version, is absent on the PSP.Like other versions, the physics of Test Drive Unlimited are more than a bit wonky on the PSP. There isn't any car damage and you can't flip your vehicle over creating a peculiar, elastic feel to any collisions with oncoming traffic. Driving into brush, trees, or poles also creates weird visual sensations. Hitting any stationary object will stop your car dead, even if that stationary object wouldn't have the mass or strength to stop a small child from running directly through it. A bush can stop a car moving upwards of 200 MPH dead in its tracks. The streaming world is a breath of fresh air on PSP.Cars feel a bit more natural on the PSP and PS2 than on the other versions of Test Drive Unlimited, and that is a good thing. With such a vast island to explore and numerous races to tackle, you'll likely spend much of your time in just a handful of the large car selection and you'll have each individual rides intricacies nailed down after roughly half of an hour. That leaves plenty of time for smooth riding. Simulation fans will find the level of customization and depth sorely lacking, but there is a bit more to Test Drive Unlimited than your average arcade racer. The motorcycles have been entirely removed from the game, but they were a sore spot anyways so we won't bemoan that loss.Test Drive Unlimited was originally built around the idea of removing the distinction between single and multiplayer racing. Unfortunately, most of what made that idea so fresh and unique doesnt hold up well on the PSP. On the plus side, the impressive technology and solid racing make this game worth a look anyways. Driving around Oahu on a handheld is pleasant in its look and relaxing in its feel. The idea of a Massively Open Online Racer didnt quite come through, but the end result on the PSP is a solid racing game even if it doesnt match up in terms of content or structure with the PC or Xbox 360.", "date": "Apr 5, 2007"}