{"name": "Prince of Persia: Rival Swords", "name_review": "Prince of Persia: Rival Swords AU Review", "ref": "https://www.ign.com/articles/2007/04/05/prince-of-persia-rival-swords-au-review", "text": "Back when I was at Crazy Go Nuts University, I took Time Travel 101, and you know what the first thing I learnt was? Don't go back and try to rewrite history. It doesn't matter if it's for a 'special lady' or if you finally came up with the perfect witty retort for a conversation that morning, because the end result will always be the same - you'll get bitten in the behind. The second thing I learnt was that most time travellers wouldn't be seen dead in a DeLorean or phone booth, but that's less relevant to the task at hand. The issue of tinkering with causality, however, that's a lesson the Prince could do with hearing. His comedic misadventures up until this point represent a veritable textbook on 'what not to do when you have control over time'. I mean, his shenanigans in Sands of Time meant he'd cheated death and his fate, which set the Dahaka - a.k.a. the guardian of the goddamn timeline - on his ass. So what did he do then? He fiddled with time some more and prevented the Sands from ever being created. And yes, right from the opening of Rival Swords, it's clear that the Prince has stuffed up once again.   The Prince and Kaileena (the Empress of Time) return to Babylon, only to find the Vizier still alive and the city in flames. Worse still, spiteful city planners have obviously overrun the town hall, and the Prince finds himself unable to make even the simplest journey from point A to point B without being forced to run along walls, leap over gaps, avoid rusty rotating blades and operate arcane machinery. It's not long before the Sands are unleashed once more and it's time for the Prince to do what he does best - use the mystical Sands to try and clean up his mess.   You will get hop-ons.  If all this sounds familiar, that's because Rival Swords is really just The Two Thrones on PSP. Sure, there are some casual nods towards new content - you can hop straight into chariot races from the main menu for instance, and there are multiplayer maps that you can race through against a friend, hitting switches to activate traps and obstacles in the other person's game as you go, but really, if you've played The Two Thrones there's nothing much for you here.   And if you haven't? Well I'll leave that conclusion for a little bit later in the review. First, we need to talk about the game. If you've never played a Prince of Persia game, the most important thing you need to know is that the core of the gameplay is movement. The Prince is joyfully acrobatic. As mentioned before, getting from point A to point B is never simple, but that's what makes the series so much fun. Levels are designed around long athletic runs. You may run up a wall and jam your sword into an anchor point, then launch into a wall run, jump across to a ledge, shimmy along it onto a narrow beam, jump across to a narrow gap between two walls, slide down the gap, drop onto an unsuspecting enemy and, finally, stab him in the throat. All in one graceful sequence. The Prince has a huge array of movement options, and every area combines them in different and satisfying ways. And yes, if you screw up and fall to your doom, you can always rewind your mistake (provided you have sand in the tank) and try again. As the game progresses the Prince also gains the ability to slow time and execute ~Sand Wind~ and ~Sand Storm~ attacks.   The Prince doesn't get even, he gets stabby.  Combat plays a significant role in the game, but this time a stealth component has been added in the form of ~Speed Kills~. See that guard staring off into the distance, day dreaming of his wife and spawn? Sneak up behind him and the screen will narrow in, indicating that with a press of the triangle button, followed by timed presses of square, you can snuff him out without a fight. Speed Kills are one of the highlights of combat, with a number of brutal animations to enjoy - including taking out two guards at once. Levels will often have optional paths the Prince can take above enemies, so he can literally unleash brutal death from above.   Part of the main narrative thrust of Rival Swords is the inner turmoil of the Prince. A short way into the game he's infected by the Sands of Time, leaving him with a glowing arm embedded with razors, and a nasty, selfish voice in his head. At regular intervals during the game this split personality manifests itself as the Dark Prince - a faster, more powerful, more ruthless version of the Prince. These sequences shift up the gameplay nicely; the Dark Prince wields a chain whip called ~Daggertail~, which brings with it new combos and movement abilities, such as swinging on grapple points. Since the Dark Prince is a corruption of Vanilla Prince (not to be confused with Vanilla Ice), he's also constantly losing health, so the player needs to keep up a steady stream of kills to recharge their health bar.    Another new gameplay component introduced in Rival Swords are the chariot race sequences. Here you'll steer the Prince along a linear path, avoiding crumbled ruins, hitting jumps (yes, in a chariot), ramming other chariots and fighting off Sand monsters looking for a free ride. They're a nice diversion from the action, and the game offers up four chariot races to beat from the main menu, but honestly, they're not a significant inclusion.   Ultimately, Rival Swords represents a Prince of Persia gameplay 'best of'. It combines both the original game's emphasis on movement with The Warrior Within's focus on combat, and you know what? It's not a bad combo. That said, the combat is definitely the weaker element, often bogging the pace of the game down with rinse and repeat battles. Still, both the Prince and the Dark Prince have a host of combos and acrobatics moves at their disposal, and the ~Speed Kills~ system helps bring some spice to slitting throats.   Emo Prince:   The controls have been adapted fairly well, following very much in the footsteps of the last Prince of Persia PSP game, Revelations. Camera control is the main sticking point - the player needs to hold the left trigger to do just about anything involving the camera, which feels a little awkward. Thankfully, tapping left on the d-pad centres the camera behind the Prince, and in most situations the camera control won't pose too much of a problem - although it does have a tendency to jump around and put enemies out of frame at times. It's also a little annoying that you can invert free look and rotation, but not the Y axis for the third person camera.    Back to the question I posed earlier. If you haven't played The Two Thrones, is this a good place to start? Frankly, if you can get access to a PS2, Xbox or GameCube, there is no reason to play this game on PSP. It's certainly still playable, but the brilliant movement mechanics and fun level design are let down by the technical execution. Simply put, the game feels like it was shoehorned onto PSP, with a rough frame rate, presentation and audio.   Beige and brown... they're the new, erm, colours.  Granted, it's a less powerful system, but Rival Swords really doesn't do the PSP's hardware justice. While many areas of the console versions were a little drab, Rival Swords fails to impress just about everywhere. The Prince looks spindly, the texture work is plain and flat, the blood has gone AWOL, and most importantly, the lower frame rate makes the movement feel less fluid. It also takes a bit of a hit when there are multiple enemies on screen. There are still some small flourishes in the visuals that help to bring this rather plain looking world to life, such as a flock of birds being disturbed and flying away as you climb atop a ledge, or smoke billowing on the horizon, and the animations are still solid, but it's not enough to prevent this game from tumbling over the brink into the abyss of mediocrity.   The sound - despite a good soundtrack - is even worse. The effects are terrible and hugely repetitive. Fighting an enemy, for instance, is like aural water torture - the same grunts replayed over and over, gradually gnawing away at you, while the Foley work completely fails to do its job - the sound effects are weedy one moment, sparse the next, and fail to give the combat any kind of oomph. The sound mix is jarring too - dialogue and effects drop out then kick back in, often out of sync.   Rival Swords is yet another port to PSP that we really didnt need. It adds nothing significant to the original game, and while still being playable and fun, takes a step backwards in just about every respect. If the only gaming device you own is a PSP, you could do worse than Rival Swords, but for everyone else, you can safely give this one a miss.Want to have your say? Rock on over to the  Aussie forums.", "date": "Apr 5, 2007"}