{"name": "Fighting Force", "name_review": "Fighting Force 64", "ref": "https://www.ign.com/articles/1999/06/03/fighting-force-64", "text": "Jealous N64 owners have finally caught up with PSXers with the arrival of Fighting Force 64, one of the most popular fighting titles of 1997.  The game offers a whole lot of what made the PlayStation version a hit, but the fact that it's 1999 will probably dull a lot of the shine on Crave's 3D fighter. On the bright side, if you absolutely drooled over the finger-blistering fun of the arcade hit Final Fight , FF64 could be just what you need to stop the saliva from slipping.  The Features:   Fully interactive 3D environments. Use objects like trash cans, tires and bottles as weapons. Conventional weapons like knives, axes, guns and bazookas. 25 explorable levels with 5 boss levels. Two player cooperative mode. Multiple paths through each level. Four characters with unique fighting attributes   Gameplay The storyline finds our dark champions of justice trying to stop the evil apocalypse plans of Dr. Zeng. It seems the good doctor was a bit miffed that the new millennium didn't bring with it the destruction of the world. So with an evil sneer on his face and a horde of minions at his disposal he decides that destroying the world is a tough job but somebody's got to do it. So with vigilante Hawk Manson, dashing P.I. Mace Daniels, strongman Ben ~Smasher~ Jackson and Zeng's illegitimate little girl Alana on your team, you set out to punch the mad scientist's ticket.  FF64 moves and operates just like the original, it just takes a little longer than we're used to. It seems chasing down and beating down bad guys just isn't as much a priority anymore because the heroes can take their time reaching their targets, overrun them when they try to get there quickly or sometimes turn their backs on them altogether in the middle of the fight. In all fairness, FF64 requires the player to master movement in a 3D environment so that they may kick butt effectively. We don't have a problem with this necessarily, but the speed of the game can make this very frustrating. When you use one of the slower characters like convict ~Smasher~ Jackson, you will have to catch yourself from breaking the analog stick because you'll be bending that thing so far in your efforts to get him moving.  The weapons and interactive environments add a lot of fun to the game, since it seems that the only things that can't be whooped on are the buildings. Early in the game you'll get a chance to test your might by knocking the chassis out of a big bad guy van. The weapons also require some 3D fighting proficiency since you will sometimes turn your back on enemies or be just a a little off when you try to line up a bazooka blast or a pistol shot. A Z-button lock-on of sorts would have helped a lot. Picking up tires or trash cans and tossing them at evil henchmen is a video game standard at this point. We were impressed by smacking the soda machine for a few cans of carbonated health and then finishing off the exact change eating monster with a few roundhouse kicks. Then there's the destruction of the ATM so that you can use the freed monitor as a handy projectile to knock the bad guys' blocks off. When you're not using any part of the environment to whoop @ss, you'll have a variety of punches, kicks, combos and a health depleting power move that should be used sparingly.  Control The control is easy enough to manage and it just takes some practice to coordinate your reaction time with the character reaction time. More than once, we would hit a button to execute a move and the bad guys would beat us to the punch, literally. Special moves can be executed with a combination of A, B and the Z trigger. With Hawk, we sometimes had trouble with the safe flying kick or shoulder rush and the life force draining super spin kick. The button combos for each of those moves are similar but a little to unreliable for our tastes.  The same-screen two player cooperative mode is a welcome sight to have on the N64. However, after a few times of getting pummeled while being hidden behind a wall or truck, you may just opt for a solo adventure. Even though there can be a problem with the camera ending up in a bad place, with plenty of practice, you and a buddy should be serving up justice like some pros.   Graphics We've already mentioned the sluggish controls but the characters themselves look pretty good. There's a little too much slowdown and PSX-style jagginess going on at times but that could be due to the overall dated look and design of the game. Remember, graphics in nearly all games have gotten better in the last few years. It can be hard to figure out exactly what items you're picking up as you advance through the levels. The pistol looks a little flat while it's on the ground and it can be hard to tell if you're using a 2x4 or a baseball bat on your opponent's noggin. The overall graphic presentation is accurate to the original game but just nothing outstanding.  Sound The punches and kicks sound fairly typical with different sounds for misses, hits and direct hits. The screeching tires, gunshots and bazooka blasts all sound pretty good and add to the gritty tough guy feel to the game. There is some weird futuristic midi battle music that keeps you company along the way that will really make you pull your hair out if you're exposed to it for too long. We figured this went with the whole apocalyptic no-hope-in-the-future theme of the game, where you as a hero have to overcome that dark soulless feeling in order to save some hope for the future. Either that or it's just easier to jam into the cart.Core and Crave managed to put together a fine version of a game that was a lot of fun a few years ago. While this is an accomplishment, it just seems like it comes too late to really get excited. It's not the game's fault that it was dropped from its original publisher, Eidos, when it was so close to completion last summer. But, with FF64 finally here, the buzz has been completely wasted and a dated, predictable fighting game just has too much working against it to really fly like it could have just a year ago.", "date": "Jun 3, 1999"}