{"name": "Syphon Filter", "name_review": "Syphon Filter Review", "ref": "https://www.ign.com/articles/2007/04/05/syphon-filter-review", "text": "When Syphon Filter was released in 1999, 989 Studios and Eidetic provided a new twist to the stealth action genre. Unlike the fantastical characters of the Metal Gear Solid franchise that often boasted superhuman abilities, Syphon Filter was grounded in reality. Its main characters were government agents trying to prevent a terrorist attack that could bring the world to its knees.  The title spawned three sequels on the consoles and last year's award winning Dark Mirror on the PSP.  Now, the original is being released on the PlayStation Network for the PSP, but does Syphon Filter still hold up after all these years?   The story behind Syphon Filter is one that, especially with the current global climate, feels as if it could be ripped from the headlines.  Gabe Logan and his partner Lian Xing, governmental agents with the CBDC, are tasked with investigating a lab in Costa Rica rumored to be producing a deadly biological virus without any cure known as Syphon Filter.  A terrorist known as Erich Rhoemer has been trying to create large quantities of the viral weapon to wreak havoc all over the globe. Gabe and Lian attempt to infiltrate the lab and stop Rhoemer before he can use the WMD.  Unfortunately for the duo, Rhoemer and his associates kill a government agent, detonate the facility, and escape.  Days later, the criminal makes his demands known to the world in Washington D.C., threatening to devastate the capital and its inhabitants if his demands aren't met.  It's up to Gabe and Lian to help defuse this threat, track down Rhoemer and his henchmen, and save the world from the Syphon Filter Virus.   If you're lucky, you might be able to pull off a head shot. With Lian acting as your communications army from home base, players take on the role of Gabe and act as a one man army, accomplishing various objectives like diffusing bombs or protecting fellow agents.  However, missions are rarely that simple, and you'll wind up acquiring a number of secondary tasks that you'll have to complete to finish the level.  Unsuccessfully completing any goal given to you will immediately result in a failed mission, forcing you to try to be extremely careful as you maneuver your way through every battlefield you find yourself in.  This definitely adds a level of challenge to the game, as well as a number of puzzle solving elements, as you'll progress through a stage, only to find that you need to deactivate some threat or acquire something to proceed.  Unfortunately, it's also a double edged sword, because controlling Gabe isn't exactly the easiest thing to do: his running style is somewhat spastic, and his turning radius is akin to a tank on ice.  His stealth moves are marginally better.  In other words, it can be tricky to use the directional pad to make him move exactly the way you want him to, especially if you need to avoid running into fire, escape explosions or run after targets.    Speaking of targets, Syphon Filter will throw a large number of enemies at you, each with varying kinds of firepower that you can pull from their dead bodies.  Unfortunately, the combat issues with the original game feel particularly exacerbated on the PSP 8 years and two consoles later.  For one thing, the enemy AI in the game is both extremely stupid and (for the most part) a horrible shot.  It's possible to stand right next to a masked gunman firing round after round at you and have every single bullet miss.  Other times, they'll simply stand in place and fire at you, without moving around or ducking out of incoming fire.  When you compare this to last year's Dark Mirror, with intelligent enemies that sought cover and could give you a fair firefight, you realize just how far the series has come, but how boring the combat was (and is) in the original game.   Now, at times, you're not much better, because while you're given the ability to manually target an enemy (potentially lining them up for a head shot), tracking and getting them within your sights can be difficult for a surprising reason: the directional pad and analog stick on the PSP is much more responsive than the old PSX controllers ever were.  As a result, you'll find your sights veering off in one direction or another when you're just trying to line up an opponent for the kill.  It's much easier to simply rely on the game's auto targeting instead of the manual aim. Either you do that, or you can just rush an enemy and barbecue them with the taser until they catch on fire, which works much better than any pistol.   Good luck finding these objects in Syphon Filter's dark environments. The visuals of Syphon Filter aren't particularly helped on the PSP screen, especially with the vertical letterboxing format that every PSX emulated title has been processed through.  For one thing, the original title was extremely dark in some areas, which could make you miss certain passageways you'd need to take or items you needed to grab.  On the dark LCD screen of the PSP, it's even harder to pick up, even with Gabe's flashlight.  In fact, you may find yourself walking past areas you need to get into two or three times because you haven't seen them. The bland environmental textures and clipping problems where Gabe literally phases through the ground, walls and character models really stand out on the PSP, which shows off some of these gaffs in sharp detail. At least there is a mild plus with the new presentation -- texture seam tears are harder to pick up on, and the animated cutscenes between missions look a lot better on the PSP's screen than they did on a TV.For its time, Syphon Filter was an engaging stealth action title that lasted at least ten hours and provided an intriguing story to adventure through.  8 years later however, the title has been eclipsed by other titles it inspired, including its true PSP sequel, Dark Mirror, which provides sharper visuals, multiplayer, multiple difficulty levels and tighter controls.  If you're looking for a bit of nostalgia, or you really need to see how Gabe Logan was introduced to the gaming world, grab this title. But if you're looking for a true Syphon Filter experience on the PSP, pick up last year's Dark Mirror.", "date": "Apr 5, 2007"}