{"name": "Last Call", "name_review": "Last Call", "ref": "https://www.ign.com/articles/2000/04/05/last-call", "text": "Last Call seemed too good to be true -- alcoholic education and a videogame in one? I understand how typing tutors work, but this one was completely beyond my realm of comprehension. Last Call doesn't exactly hit the mark in terms of gameplay, but for the price point it's at least as fun as the six beers you'd be able to buy at your local pub for that price.  You play as a big city bartender in the game, and it's your job to get your clients responsibly inebriated in record time. Unlike games like Tapper, Last Call actually has you making real mixed drinks using a recipe book and a measurement counter that keeps track of exactly how much you've poured of each type of liquor. As you take an order from a customer (after checking their ID, of course), the recipe book pops open to the page containing the currently ordered drink. Though you get extra bonus time for not using the recipe book, it's a lifeline until you can memorize some of the orders. As the levels progress and things get harder, you'll find that you must memorize some of the drinks, or at least the location of the alcohol at your bar in order to fill orders in time. Each level has a tip limit that you must pass in a certain amount of time in order to progress to the next level -- get there sooner, and you'll be treated to a bonus round, which consists of being able to find specific items in the bar in a short amount of time. Not only does it make you extra money, but it will teach you the locations of the drinks quickly.  While you're learning to sling liquor like a pro, you'll be entertained by the customers themselves, who range from self-conscious models and paranoid UFO heads to Superchick, a talking hedgehog, and a gay robot. All of them have lines and actions that will have you distracted with laughter while trying to pour perfect mixtures, and consistently add a heavy dose of charm and humor to the game. In another nice touch, their drinks also match their personality. The stock broker may want a perfect Cosmopolitan, while the caveman just wants a swig of simple scotch and soda.  The characters look great but get a bit chunky, and move in the same chunky manner, to boot. While the full-screen mode looks a lot better, the recipe book ends up taking vital viewing space, meaning that to play a real game, you have to have the action in a smaller window. While that works in terms of gameplay, shouldn't the characters have been a little bit smaller to accommodate all the information? Fortunately, the smooth lounge tunes with their swooning saxophone and piano jingles will erase all such nasty thoughts from your head.   Did I mention that this game was done in Macromedia Director? For all the funny animation, snappy lounge music, and crisp characters, it feels consistently clunky when it comes to gameplay. Using and serving drinks doesn't react quite as quickly as you'd expect it to, and the depth is definitely hampered by the media as well. You're stuck in the same bar, and though there are a good cross-section of characters that waltz into the bar, you're more than likely to hear the same phrases repeated every time you see them. As you get farther in the game you'll hear odder things, and see new characters, but it's definitely not as dynamic as your average video game. The drinks are plentiful, however, and you'll always find new drinks that you never even knew existed while you play. Since it's the best part about the game, it's appropriate that the designers have given you a party keg worth of drinks from which to choose from.  Last Call is a simple pleasure, at best, but depending on how much you like alcohol, it may just be a perfect  purpose. Knowing how to make a perfect Manhattan on the fly may not be all that beneficial to some people, but to me it's become vital. Personally, I've been writing some of them down and bringing them to the local bar, but that's just because I'm lame like that -- and because I think everyone needs to know what a Screaming Orgasm tastes like at least once in their life. Good idea, fun game, worthwhile budget-sized purchase.  -- Vincent Lopez", "date": "Apr 5, 2000"}