{"name": "3D Ultra Minigolf Adventures", "name_review": "3D Ultra Minigolf Adventures Review", "ref": "https://www.ign.com/articles/2007/04/18/3d-ultra-minigolf-adventures-review", "text": "For many of us, miniature golf conjures memories of adolescent birthday parties, too many corn dogs, greasy arcade tokens and a free game if you hole out on the 18th. While there are no parties, corn dogs and tokens in 3D Ultra Mini Golf Adventures, Sierra's new XBLA title does a nice job of creating wacky holes that are a 10-year-old course designer's dream.   There are three 12-hole courses in the game: Old West, Classic Carnival and Outer Space. The sole single player mode is a tournament, in which you can play three different rounds: Traveler Course (the first six holes from the three courses), Explorer (the final six holes from each), and Adventure (all 36 holes). Since this is just a real confusing way of saying that the single-player options are very thin, let's hope the holes themselves are fun.     Lucky for you, they are. While some are simple and others complicated, each hole has some way to score a hole in one. On the Old West course, the simplest of the three, this is usually hitting your ball off just the right wooden box at just the right angle with just the right amount of power -- just like you play at your neighborhood Putt-Putt. When you get to the Carnival and Outer Space courses, you'll have to be a bit more creative. One hole features a Pirate Ship ride that you have to hit under. Another hole is a giant pinball machine that you play to guide your ball with flippers to the hole. In outer space, you'll play on an asteroid with its own gravity, and you'll have to avoid craters and circumnavigate the entire rock. Cool.    We're not going to get all nit-picky and complain about your golfer needing a space suit out there. But you can suit up one of four characters in a few different outfits. That's as far as the customization goes here. Sierra could have made better use of the Vision Camera, like Uno. The differences between each character are purely cosmetic, but you can choose between three different control setups: analog (like Tiger), hold-and-release, and three clicks. It was a great move by Sierra to include all three, the standard control schemes for golf games on the market today.     Controlling your golfer is another matter. The power meter is broken into green, yellow and red zones, and it takes a long while for it to become intuitive. Sometimes you putt in the green and you are too short; other times you hit the same shot with yellow and you overshoot the hole by a mile. There's no real feedback system here, so you'll have to guess with each shot, improving along the way.    It sounds difficult because it is. But that doesn't mean that 3DUMGA (no good acronym here, is there), isn't fun. Again, the hole-design is challenging, but you'll log plenty of hole-in-ones, each time getting that giddy little feeling of joy in your little tummy. You would think that the game would lose steam after you discover how to hit a hole-in-one on every hole, but many of these shots are so hard to replicate that you will just as easily go triple bogey the next time through. Of course, with enough rounds under your belt, we're sure we'll see some scores in the 20s for a round of 18. That's because we believe in you.    When you've mastered those holes, you can jump into a rudimentary course editor and create your own holes. The options are a bit slim -- you can't throw in a windmill or rocket, for example. You can choose from a variety of tee boxes, greens, ramps, straights curves and junctions and piece something together, then play it before you save it. Still, it could use some of the crazier options seen in the regular game, like pipes and cannons and pirate ships. We love pirate ships.   Multiplayer and online are solid modes as well. That's because there are power-ups scattered around each hole, things like free shots that deduct a stroke from your count or Vacuum Hole that sucks your ball right in. With four players, things can get pretty heated when you land your shot next to the hole, trigger your electro blast, and shock the next player OB when he rolls near your ball. And as there are no ball markers, you can hit other players' balls away from the cup too -- something we've always wanted to do.    Visually, the game looks nice, with a lot of detail stuffed into the cartoony holes. There are some strange camera issues -- you can switch to a bird's eye view but you can't move the camera or trigger a second flyover. The sound consists of three themed songs, one for the Old West, Carnival and Outer Space, that don't annoy you for at least a few hours -- high praise for an XBLA game.   In the end, it's a bit pricy at 800 Microsoft Points, but 3D Ultra Mini Golf Adventures is a fun multiplayer game, especially on a Saturday night with a favorite beverage nearby. Don't believe us? Check out the demo on XBLA and give it a go for yourself.", "date": "Apr 18, 2007"}