{"name": "Virtua Fighter 2 [Genesis]", "name_review": "Virtua Fighter 2 Review", "ref": "https://www.ign.com/articles/2007/04/19/virtua-fighter-2-review", "text": "Hardware transitions are tough. There's a nebulous span of a year or so, around the time the industry upgrades to each next generation, where projects still in development often lose their way. They have to make a choice  complete development on the current hardware, then go to market as the old machine is on its last legs. Or, alternatively, shut down and retool, undergoing a delay to arrive instead on the new, more powerful system. Neither is that bad of an option, as we've seen positive examples of both in Nintendo's shift from the GameCube to the Wii. But 11 years ago, Sega was stuck in a situation where one of its most important IPs still managed to lose its way  Virtua Fighter 2 on the Genesis.   Now that right there should be enough for most readers. Virtua Fighter 2, on the Genesis? Is that even possible? The answer is no, of course, and this game proved perhaps better than any other in the past that hardware transition times can be dangerous to navigate.        Virtua Fighter 2 was an arcade phenomenon. The sequel to the first-ever 3D fighting game, VF2 took the pioneering polygonal graphics of its original installment and refined them  the game was one of the best-looking, best-playing and smoothest one-on-one brawlers of the age. It was a huge hit for Sega, who sought to capitalize on its success by porting it to a home system. Which they did, faithfully, in an excellent conversion for the 3D-capable Sega Saturn in 1995.   But not everyone had a Saturn. Many Sega players had been slow to make the transition, burned as they'd been by the company's string of other failed and abandoned hardware pieces in the mid '90s. The core Sega player was still living on the Genesis  so Sega brought Virtua Fighter to them.   Virtua Fighter 2 arrived on the Genesis in 1996 in an excessively watered-down, nearly unrecognizable port that failed to capture even a hint of the magic of the arcade original. Genesis couldn't do 3D, and 3D was almost the entire hook for the Virtua Fighter series. Genesis couldn't handle all of the moves, or the combos. Or even all of the characters. What arrived on Sega's 16-bit system may have said Virtua Fighter 2 on the box, but what was found inside was anything but.   And now, history repeats itself. The compromised, crippled down-port of VF2 is what's now arrived on the Virtual Console, and it seems Sega and Nintendo are hoping no one notices. But it would be hard not to. This edition features 2D sprites in place of 3D models, condemning it by comparison  the sprites can't hope to match the fluidity of the original three-dimensional fighters, and don't. The animations here come off as stilted and jerky.   The move selection is limited and shallow. Even forgoing comparisons to VF2's arcade version, the game as it exists here doesn't hold up against 2D contemporaries  Capcom's Street Fighter 2 is superior in variety, and the versions of it available on both the SNES and Genesis by the same year offered much more in gameplay, character selection and overall fun. This version of Virtua Fighter 2 does support two players, but you'd be hard-pressed to convince any of your friends to play it with you for long.    An options menu allows you some freedom in customizing your experience, which helps the game a bit. You can adjust the length of each players' life bars, and even set them to infinity - creating invincible characters at your whim. You can change the time limit on each match, the number of rounds it takes to win in each, and you can access a sound test to play around with the background music and character voice effects. So Virtua Fighter 2 isn't without any redeeming qualities. It does hold some entertainment as a basic, 2D, 16-bit fighter from the Genesis age.The problem is that it never belonged in that age, and it's just too difficult to have any real fun with this version knowing how inferior it is to the real Virtua Fighter 2. So don't be fooled into downloading this one for any reason  it's not worth its 800 Point asking price, and there are far better options in the fighting genre available now, and scheduled to come in the future for the Virtual Console.", "date": "Apr 19, 2007"}