{"name": "Time Stalkers", "name_review": "Time Stalkers (aka Climax Landers)", "ref": "https://www.ign.com/articles/2000/04/06/time-stalkers-aka-climax-landers", "text": "is different from pretty much any other role playing game you've ever played.  In fact, in some respects it's probably not best to call it a standard Japanese role playing game in the vein of Final Fantasy or Grandia, despite the presence of menu-based battles, hit points, and experience.  It's obvious that Climax attempted to do something different here, and they've certainly succeeded at that.  However, there are a few holes that weren't fixed before the game shipped, and they manage to take away considerably from the experience.  You assume the role of aimless wanderer Sword who one day stumbles upon an ancient book.  Upon reading the book, Sword is whisked away to a peculiar fantasy world that may just end up being the sum of its parts.  This world is constructed of different pieces, each from what appears to be a different place and time.  At one end of the world is a fairy-tale house atop a turtle shell that's floating via three giant balloons.  Right next to that is a town straight out of modern day Japan, complete with a convenience store and residents named ~Yoshimori,~ ~Shiori,~ and ~Kahori~ (my names may be wrong, but you get the point, and readers in the know will recognize the ~Aoi Tori~ refenence).  What's the deal with this world, and why was Sword brought there?  You're going to have to figure that out the hard way.  Unfortunately, any revelations about the nature of the world are made all the less dramatic by the horrible way in which the story is told.  The translation itself by Sega is passable at first, although it becomes confusing towards the end, but I'm specifically referring to the game's attempt at getting by with the barest minimum of dialogue and dramatic sequences.  I wish the characters would converse with one another just a bit more, and that they'd have something of greater substance to say, but as it is, the story and character development sides of Time Stalkers are less interesting than a tag-team lecture by mom and dad.  If you've played something like Legend of Oasis and its five or six lines of dialogue, you'll recognize the problem.  I do wish the story behind the world were more compelling, as the world itself is a masterpiece of design, and the person who thought of having a world constructed of contrasting pieces needs a big, fat raise.  The world is colorful, smoothly constructed, and has cleverly placed holes where new pieces of land periodically appear.  Ignoring the horrid camera, which often makes seeing where you're going impossible (think the Japanese version of Blue Stinger, only on a much worse scale), you'll always find yourself anxious at the chance of exploring a new region.  The individual segments are tiny, and they don't come anywhere near to adding up to a Final Fantasy-sizze world, but they're certainly adequate, and fit the game perfectly.  Even better are the personalities you encounter through the game, some playable and others in Non Player Controlled (NPC) form.  They all fit the part for their region of land, and Sega of America has given them the occasional laugh-out-loud line.  You'll find natives in the jungle area, traditional Japanese folk (being their hardworking selves) in the small-town Japanese area, and bunny people in the fairy-tale area.  It's particularly fun when the different characters stray beyond their regular piece of land, which happens all too rarely, unfortunately.  The playable characters also arrive from different eras of time and space, and are nicely modeled (although somewhat first-generation in blockiness).  Climax has tapped back into its past and brought back characters from its different games.  The too-sure-of-himself Sword is original to the game, but you'll also see characters from Land Stalker, Lady Stalker, and the Shining series (some of which have, unfortunately, never made the trip stateside).  And before anyone asks, ~Lady~ is from ~Lady Stalker,~ the Japanese-only Super Nintendo counterpart to Land Stalker.  As unique as the world and the characters that populate it are, I'd go out on a limb and state that the game itself is even more unique.  This ain't your standard role playing game, and the game's problems center around some of the features Climax cooked up just not working as well as one would like.  First up is the game's dungeon system.  You'll find around nine multi-leveled dungeons throughout the course of the game, and like Sting and Ubi Soft's Evolution, you simply proceed from bottom to top via randomly generated floors.  Unlike Evolution, though, these dungeons and their floors are short enough so that you don't want to stop playing mid way through.  Just like Evolution navigation through the dungeons is simplified through an auto-map which makes it quite clear where you're going.  One unique feature of Time Stalkers is a search system where you have to tap a search button over clearly marked areas of the map in order to seek out items.  Characters have a hunger meter, which depletes each time you tap the search button, and if a character finds himself starving, he'll no longer be able to seek out items, until a means of replenishing hunger is found.  This is usually not too difficult, as the game tends to be quite liberal in placing items throughout the dungeon.  Of course, the dungeons aren't just comprised of floors with items strewn about.  There are also enemies to be found, and you fight these creatures in the tried and true tradition of menu based battles, with a few twists.  Characters have HP, MP, and the rarely seen ~Vigor~ meter.  In Time Stalkers, standard moves drain the vigor meter, which is apparently meant to make your choice of attacks strategic, although this never once affected me in battle.  You'll also find that groups of enemies can surround you, so you'll have one set of enemies attacking from your front and another set attacking from behind.  More interesting than either of these is the aggression meter held by enemies.  In Time Stalkers, not all the enemies attack you.  Most of the times you encounter an enemy running about an area of a dungeon, it's up to you to initiate the attack.  It's all based on the enemy's level of aggression.  Actually, I rarely encountered an enemy who would willingly attack me, so I had to be the jerk most of the time - something that was kinda hard, as the enemy designs tend to be super cute!  So why would you go about initiating fights when you could just make your way to the top of the dungeon without conflict?  Well, the boss at the end of the dungeon tends to be the aggressive type, so getting past him is an impossible task unless you have a powerful set of heroes.  The game actually has an interesting feature in how your characters power up.  In addition to gaining post-battle experience (through a complicated system of multipliers that even a math major like myself couldn't figure out), you're given the option of updating certain stats at the end of each floor.  Increase your attack strength, increase your defense - it's all up to you.  Unfortunately, I stopped caring about how I upgraded my characters in Time Stalkers once I realized that any experience I gained, any buildup in stats I incurred, were removed once I cleared a dungeon.  That's right, once you've finished up a dungeon, your character's experience resets back to one, and all stats reset back to their default.  Your characters do evolve throughout the course of the game by rising in class and earning new skills, but these skills tend to be inaccessible until the character has reached a certain level, something that has to be redone in every dungeon.  I stopped caring about building up a good character, and this is from someone who took his Final Fantasy VII characters all the way up to 9,999 hit points.  I don't know Climax's reason in implementing this silly system, but I'd certainly like to be on the recieving end of a funny story some day.  It may seem to this point that Time Stalkers is just a poor man's RPG with a cool world and awesome cast of characters, but that's because I haven't mentioned the game's best feature, its enemy capture system.  In Time Stalkers, you build up a party of characters and journey into a dungeon in order to fight, just like in every other RPG from Dragon Slayer to Dragon Quest, but it's a bit different this time around.  Instead of a party of multiple heroes, a Time Stalkers party always consists of just one main hero paired with up to two enemy creatures that you've captured and made into your pets.  Whoa there . . . rarely has a statement needed more clarification than the above.  When in battle, you're given the option of capturing an enemy creature and storing it in little tubes.  You can capture and carry seven at a given time, and you're meant to turn these creatures into trusted members of your party.  In other words, you use them in battle like you would a normal character, by selecting moves from a menu, and they, like any other character, can level up and gain additional skills.  The captive enemies can be taken out of the dungeon once you've cleared it, and can be named, stored in a pen, and raised in a VMU mini game.  Alas, like the main characters, the enemy creatures loose all experience and level-ups when you exit the dungeon.  However, I found it utterly cool when a creature that I'd used for two straight dungeons learned a new spell, and I suddenly has a powerful attack that could be used to assist the spell casting hero that I took into the following dungeon with me.  This means of capturing enemies and using them is right next to the unique world as one of the game's best features.  Unfortunately, due to the limitations placed on the game, it's severely underused.  The game is, in its primary quest, just too short.  There are only nine major dungeons throughout the course of the story, and it's impossible to barely tap the character skills, both for enemies and characters, through these.  The game does try to fix up the problem by featuring an innovative mini-quest system.  You speak to a bunny character called Noiman, who assigns you jobs throughout the dungeons.  Get to a certain floor, find a particular item, kill a certain number of characters, fight a new boss . . . succeed at any of these quests, and you'll find yourself with gold and new items as rewarded by Noiman, and, of course, all the standard rewards of going above and beyond in an RPG (which, as mentioned, Time Stalkers limits to just new skills).  While I like the inclusion of the mini quests, I was hoping to have a lot more to the game proper, forcing you to at least reach a certain level of mastery over the game.  There are some other problems on top of these.  The game has a silly limitation where you can't carry more than four items into any dungeon.  The result?  Any item you earn in a dungeon is all but useless, except for selling in the outerworld.  Once again, your attempts at exploring the dungeons are made all the more meaningless.  The game also has a totally rushed feel to it, with a graphics engine that's at times more buggy than the Saturn version of Daytona.   In addition to the down-right strange camera of the over world (I'm not going to mention the even stranger default camera of the dungeons, as you can use a much better view point if you so wish), you'll also find a helpful feature where sections of the dungeon go transparent in order to allow you to see better.  That's fine, but the actual transition to transparency is so ugly and unrefined that I often found myself utterly confused.  One dungeon towards the end almost had me nauseous with the popping in and popping out of objects - and I'm being perfectly serious. Time Stalkers has some awesome ideas behind it, but it has too many problems to really recommend above your standard RPG on the PlayStation.  Currently, EGG is still the only real worthwhile RPG on the system, and it's of the action variety.  I actually enjoyed Time Stalkers a bit more than Evolution, primarily due to the title's original ideas.  I'd definitely recommend that you hold off your cash until the real role playing games hit the system, later this year or early next year.  With a bit more work, Climax could've had its game mentioned in the same category as those.  -- Anoop Gantayat, IGNDC", "date": "Apr 6, 2000"}