{"name": "Star Wars Racer", "name_review": "Star Wars Episode 1: Racer", "ref": "https://www.ign.com/articles/2000/04/06/star-wars-episode-1-racer", "text": "Star Wars games seem to be under a curse. While some of the PC titles are gaming classics that hold up to the test of time (Tie Fighter and Jedi Knight come to mind), the console offerings have not been so lucky. From the abysmal Phantom Menace, to the horrendous Jedi Power Battles, there has not been a great console Star Wars game since the 16-bit days.  When Episode 1 stormed theaters last summer, LucasArts naturally released a couple of games based on the movie. The PC and PlayStation received a sub-par adventure game, while the PC and Nintendo 64 were given a racing game based on the Pod Race sequence in the movie. The game was relatively well received, and sold pretty well. Now, almost a year later, Episode 1 is being released on video, so Dreamcast owners get their shot at being a Pod Racing champion.  You'd figure that would give Lucas, a first-time Dreamcast developer, all the time they needed to catch up to the machine's capabilities and make a solid effort out of this title.  Funny how things aren't always as they seem.  It turns out that while this isn't the worst racer on Dreamcast it could have easily been so much better.  One of the title's largest problems is that Dreamcast owners get a year old title with absolutely no improvements to the graphics. If you've seen either of the previous versions, you have seen this one. Blocky character models, simplistic tracks, fogging, draw-in, and blurry textures do not belong on the Dreamcast. One look at Star Wars Episode 1 Racer: Arcade, and it's painful to look at this one.  Even on the PC this game was nothing more than a super high-res N64 title, and LucastArts has basically taken the PC version and tossed it onto a Dreamcast GD-Rom. Worse yet, the game is only running at 30fps, which is very noticeable in a high-speed racing game such as this.  With all the power of the Dreamcast, you'd think that someone could have pumped this year old PC and N64 title to 60fps. This is supposed to be the next-next generation, here, folks!  The PC influence actually shows through even in the menu screens, where the developers kept the same blurry fonts. While they looked all right on a PC monitor, they become very hard to read on a TV screen.  Hmm . . . was someone forced to meet a deadline in order to have their game ship simultaneously with a certain major video release?  Hmm . . ..  Of course, they couldn't screw up the sound track, right? Star Wars games  always tend to excel at music, after all.  With the exception of Force Commander, almost every title has kept John Williams' classic scores intact, and Racer is no different, as all the music comes directly from the film score, and of course is great. Furthermore, unlike the N64 version, you'll find the music playing throughout the race instead of just fading in and out, something that certainly helps keep the motiviation level up during a run.  Unless, of course you don't enjoy the music - but then, you simply aren't human.  Unfortunately, the sound effects don't fare so well. First off, each Pod in the movie had unique engine sounds, but in the game they all sound about the same. Also, Jake Llyod returns as Anakin via voice taunts that get so annoying that you will just want to die.  Regardless of all superficial issues, the core game is still relatively fun.  You're able to choose from multiple racers, each with their own strengths and weaknesses, and by racing through the game, you can earn money to upgrade your Pod as well as unlock new characters. Also, Pit Droids are available to maintain and repair your Pod in between races. The depth of racing to win money to buy new parts from Watto is very fun and is one of the most redeeming parts of the game.  Load time does sorta get in the way of the game's flow, however, as it's longer than you'd expect - people expecting a fast Dreamcast gaming experience may find themselves annoyed at the problem.  In a strange twist, the default controls aren't very intuitive, but thankfully there is an alternate control method that allows you to use the trigger buttons to roll the Pod left or right.  Really, though, it's hard to understand why the alternate method isn't the default, and I fear for the kids who don't figure out that you can change the control scheme.  Thankfully, the DC controller proves to handle a game designed with the N64 controller in mind just fine. View changes are handled via the D-Pad, while everything else is pretty intuitive (with the alternate control method).  LucasArts did add one new feature to the Dreamcast version, and that is the ability to post your best times online. Watch while I jump for joy. Sure, minimal online support is better than so support, but it would have been nice for a few more extras such as an exclusive track or characters. They had a year, after all.  Overall, Episode 1 Racer isn't the worst Star Wars game (Rebellion, Force Commander, The Phantom Menace, and Jedi Power Battles are worse), but the graphics are nowhere near the level that is expected on the Dreamcast, and there isn't really anything here that we haven't already played on the N64 and PC. Developers need to stop shoveling graphically inferior titles onto GD-Roms and just tossing them into the market. Rayman 2 shows that a game can be multi-platform and still look absolutely amazing on each system it hits. Why is it that we have to settle for this?  On a parting note, here is what the development team says in the back of the instruction booklet:  ~The Sega Dreamcast Racer team would especially like to thank the PC and N64 Racer teams without whose work this version would not be possible.~  Hmmm.  -- Jeremy Conrad is a Boba Fett wanna-be.", "date": "Apr 6, 2000"}