{"name": "Bust-A-Move Bash!", "name_review": "Bust-A-Move Bash! Review", "ref": "https://www.ign.com/articles/2007/04/25/bust-a-move-bash-review", "text": "Bust-A-Move (or Puzzle Bobble, if you're so inclined) has seen countless iterations across multiple platforms over the years, including the arcade version, which we've surely dumped dozens of quarters into.  Upon hearing of a new Wii edition, we were genuinely interested, as the prospect of Wii-integrated controls into the Bust-A-Move universe was a promising one.  Uh oh. Remember the time you found out there was no actual tooth fairy, and all along it was really your dad dressed up in drag? Wasn't it incredibly disappointing and scarily disturbing?  Well maybe you don't remember that particular memory, but you can surely imagine the feeling of shock and awe.  This is how you'll feel playing this game. BAM Bash feels, most unfortunately, like a step backwards for the series.  Sure, it is most difficult to improve on a nearly perfect formula, but you would hope the developers could retain what works and weed out what does not.  This, sadly, is not the case.   For anyone unfamiliar with the franchise, players fire bubbles into other clusters of bubbles, hoping to score massive combos.  Bubbles pop when one color is shot into a cluster of two or more bubbles of the corresponding color.  Occasionally special ammo is loaded into the barrel, like the flame bubble that detonates on impact, or the star bubble that clears the screen entirely of one specific color.  Strategy comes into play when certain bubbles can't be hit by a direct shot - the player must bank the blast off the side or top of the screen instead.  There are four gaming modes including puzzle, endless, versus, and shooting. The gameplay is fast and furious, and is reminiscent of classic Bust-A-Move fare, but many inherent flaws, including the awkward control scheme, make the game difficult to enjoy.   There are two main control configurations: gun and baton.  The gun version requires that you point the remote at the screen and move it to aim the bubble shooter. The sensitivity is far too high (with no adjustment option), and in the intense gaming campaigns, you'll often fire inaccurately or simply not quickly enough.  There is a variation of this control-type that gives you an aiming reticule to see exactly where the bubble will fire.  The second control type, the baton, works much better in theory, but not in practice.  By holding the remote upright with the thumb over the infra-red sensor and the index finger on the B button, the player tilts the remote from side to side to aim.  While very precise and more intuitive, it puts an incredible amount of strain on the wrist as it is constantly rotating.  After playing for 20-30 minutes our wrists were already feeling the pressure.      On top of that, the nunchuk employs the same functionality as the baton control scheme, so switching up play styles won't help a bit while in this control mode.  We suppose it's some consolation because now you can get Carpal Tunnel in your left wrist to balance out with the right.  Desperate for a satisfying Bust-A-Move fix we switched over to the Classic Controller, but were disappointed once again by no joystick support.  Ironically, despite being a Wii game with specialized Wii controls, the most comfortable control is found using the D pad on the Classic Controller.  Sure, it feels ~last-generation~, but at least it works.   Graphically the game isn't really all that terrible, but it's incredibly distant from anything that the Wii is capable of.  Without hyperbole, the game could easily have appeared on Dreamcast. Don't get us wrong, Dreamcast games looked great, but it's been seven years since the Dreamcast version of the game, and the visuals don't look all that different. Relatively static backgrounds slide back and forth across the horizon not in any attempt to complement the game, rather, seemingly only to distract the player.  Sure, the game doesn't really need anything spectacular graphically in order to function, but the lack of an attempt at 3D backgrounds (at the very least) can only be inferred as laziness on the part of the developers.     Despite lackluster backgrounds, there are tons of levels in Puzzle Mode - 500 of them.  This would surely quench the thirst of the rabid Bust-A-Move fan, but you may need to use the Classic Controller to avoid serious injury.  There is an everlasting challenge in Endurance mode where the stream of new bubbles is endless, and the pursuit of a high score is impetus to continue. Yet even with 500 levels in Puzzle Mode, and the aforementioned Endurance, the real fun is to be had in the multiplayer! Right? We hope?   Promising exhilarating action for up to eight players simultaneously, Majesco talks some big talk, but walks a staggering walk.  Using a combination of Wii remotes, nunchuks, and Classic Controllers, as many as eight people are thrust into the action at once onto one giant bubble board.  Wait a minutewhere are the split screens?  Why are we all firing at the same bubbles?  Oh, there's a simple answer for that: the developers are sadistic.  There exists no classic versus mode in the game (isn't that what Bust-a-Move is most famous for?).  Instead, 2-8 players fire at once into a giant array of bubbles.  Making matters worse, there are no scores, simply rankings, so there is no way to ascertain who is in the lead and by how much.     Multiplayer bouts can be won by simply firing randomly into the mix of bubbles.  Due to the fact that there is no way to actually lose (if the bubbles reach the dreaded red line at the bottom, they simply fall off), and with powerups like the ~slider~ which seek out bubbles of the same color -- button-mashers have as good a chance as any.  In Bust-a-Move.  What has the world come to?  And don't bother playing with more than four people.  Even with four, things are far too chaotic with combos and explosions happening everywhere at any time, all the time.  It becomes increasingly difficult to differentiate who did what, and victory resides in the realm of luck far more often than that of skill.   Shooting mode is even worse than the multiplayer and feels terribly tacked-on.  Bubbles move across the screen at random and the player must point with the remote and fire at each bubble.  What makes it more challenging is that there are four colors of bubbles, and you can only burst the color bubble that your reticule is selected to.  By pressing a different direction on the D Pad, the reticule changes, and the corresponding bubbles can be burst.  This mode is more frantic and frustrating than fun, and really is no more than a glorified ~point and click~ operation.The reason we addressed the Shooting Mode last is because we feel it exemplifies the game as a whole.  Poorly implemented, tacked-on, and lacking inspiration  like the controls, which lack ergonomic foresight  the developers put very little effort into creating a truly Wii-nique title (that's a synthesis of ~Wii~ and ~unique~  incredible).  Sure, there is a boatload of levels to blast through, but having to resort to using the Classic Controller's D Pad simply made us think of playing this game on other systems (or on the arcade cabinets just feet from our desks).  Exacerbating an already dire situation, the multiplayer mode is devoid of fun due to its emphasis on chaos rather than skill.  With controls that deter, rather than add to the gameplay, lackluster graphics, and a shoddy multiplayer mode, few will find this incarnation of Bust-A-Move does the least bit of justice to the franchise.", "date": "Apr 25, 2007"}