{"name": "Calling All Cars!", "name_review": "Calling All Cars! Review", "ref": "https://www.ign.com/articles/2007/04/25/calling-all-cars-review", "text": "While high-definition graphics, true 7.1 surround sound support and full-featured online functionality are all obvious benefits of this latest console generation, one of the most exciting new venues that these systems has allowed is downloadable games. Be it via Xbox Live Arcade, the Wii's Virtual Console or the PlayStation Network, all three systems give gamers the ability to download small games with an arcade focus.   As of yet, Sony hasn't had any major hits on its system that could stand toe-to-toe with the best of what we've seen on Xbox Live Arcade. flOw is totally unique, but it's also very short and certainly isn't for everyone. Games like Mortal Kombat II, Lemmings and such are fun, but we've seen them before. And don't get us started on Super Rub-a-Dub. So when it comes to original content, Sony hasn't yet had a title that could hold up against Live Arcade's best.   Catching him is easier than snagging a lazy fly ball, but keeping him is a different story. Until now, that is. Calling All Cars is Sony's first truly original, must-have title on the PlayStation Network, and it bests just about everything there is to be found on Microsoft's online arcade center. The game is just about as fun as any downloadable game could hope to be and while it isn't perfect, you'd be hard-pressed to find a better party game anytime soon on any system.   If you haven't been keeping up with the game, Calling All Cars is extremely simple by design. Playing as rogue copper of some sort against up to three other opponents, the single goal of the game is to capture a criminal and escort him to jail. Each level (aside from the last) has a number of different ways to lock up said criminals, and the more difficult the task, the more points you'll score. While you might earn a single point by driving him through a garage-esque drop off point, you also might earn two points for launching off a ramp and driving through a second-story spot or even three points by navigating a winding incline to the jail's roof.   It sounds simple, but when faced with knowledgeable opponents (or the tougher AI levels), it can be really tricky. Jail sections will open and close, ramps will raise and lower and one jail will even freeze over on occasion, forcing you to hunt down a moving paddy wagon and transfer the criminal while on the move. Roaming helicopters that sometimes hover about will net you more points than the jails, but keeping steady under the chopper while other cars try and steal the criminal can be a tough, tough task.   The hammer sends a criminal flying. And to make matters trickier, Calling All Cars' three weapons make sure that those without criminals are often armed and ready to knock him loose again. Again, though the setup is relatively simple, actually delivering the baddies is anything but easy.   Calling All Cars was clearly designed as a multiplayer game, and this is where it truly shines. With all the player options you could ask for (four player split-screen, four player online support, two player split-screen while online and text and voice support), you're able to recreate a party atmosphere even while you're at home alone. As is often the case, it's still most fun when you have four players in the same room, but if you've got three or four folks online using headsets, it's a trash-talking marathon.    And it's this trash talk that's a major ingredient to the game's success. Each time a new criminal is spawned, he quickly becomes a hot potato, bouncing between cars faster than you can say ~Book 'em, Danno!~ Swipes will happen mid-air right before passing through the jail, netting the thief a couple points the victim was sure were to be his. When this sort of thing happens, it's impossible not to scream bloody murder, and therein lays the game's excitement. Really, every time we've seen someone pick up the controller and jump in a round, the screaming and yelling begins and doesn't let up until the match is over, and that's a great thing.   While the game is undoubtedly fun, it certainly isn't perfect. For starters, there are only four maps. A somewhat legitimate argument can be made that Calling All Cars lives and dies by its action and not its environments, much like a fighting game does. While this is true to a certain extent, it's hard not to wish that at least a couple more maps had been included. Even only two more would have been a 50% increase in content. Granted, each of the four maps are really damn fun and offer different hurdles to overcome, changing how you have to play the game, but the selection still feels small.   See that train? Yeah, you can use one of them as a ramp to net baddies. The limited number of maps is really our only gripe with regards to the multiplayer aspect of the game, but the single-player portion has a number of problems. While you'll spend much more time with the multiplayer than you will the single-player, you'll need to drop in a solo game in order to unlock a number of the game's nice selection of cars.   The first issue is that the computer AI can do things that you can't, specifically with regards to the magnet. While it does happen to perfectly time hammer smashes and missile launches, those two weapons are at least avoidable. The magnet, however, is not. When you use it, you make use of the right analog stick and have to keep it honed on an opponent for a few seconds in order to steal their criminal. It's not an easy thing to do. The AI makes it look easy though by actually locking on to your car. It'll follow you off ramps and won't budge when you try and cut tight corners or whatever. It's simply impossible to break away, and there's nothing you can do about it.   The second issue we have is that the Tournament mode, which simply works you through the four levels one-by-one, doesn't actually fit the definition of ~tournament~. Rather than amassing a point total and hopefully coming out on top in the end, you must win each round in order to advance. This means that if you're really good at three of the levels, but have a hard time getting the criminals into the choppers and paddy wagons in the fourth stage (which doesn't have a physical jail), then you can't actually win. Had this mode been called Arcade instead of Tournament, it would have negated our argument against the mode's Webster's definition, but it still wouldn't have felt very fair.   Come rain or snow, criminals are always on the loose. Aside from the limited number of maps, we have absolutely no complaints about the game's multiplayer. It practically defines ~action-packed~ and will force even silent gamers to start talking trash and scream at their TV. While the single-player portion is far from perfect, the multiplayer is extremely fun and makes Calling All Cars the best game on the PlayStation Network.", "date": "Apr 25, 2007"}