{"name": "Battle Lode Runner", "name_review": "Battle Lode Runner Review", "ref": "https://www.ign.com/articles/2007/04/26/battle-lode-runner-review", "text": "Lode Runner is old -- ancient by industry standards. He's a character whose birth can be marked back almost 25 years ago, back in the early '80s when arcades still ruled the gaming world and few had heard of a company called Nintendo. He's a wizened, venerable mascot character who, over the years, has come and gone again and again, on a variety of systems, in a variety of forms. But though he's been around longer than most modern gamers have been alive, good old Lode still has a few new tricks up his sleeve -- it's Battle Lode Runner.   Most people reading this have never played this game before. Not in North America, anyway, and not on any previously released domestically available hardware platform. That's because this specific installment in the Lode Runner series was previously only released in Japan before. Thanks to Nintendo's Virtual Console service, however, US gamers can finally give it a go.           That said, Battle Lode Runner isn't spectacular, but it isn't particularly bad either. It's a good representation of what the series has always been about. Gold.   In Battle Lode Runner's Puzzle Mode, you guide the lone runner through a series of puzzle/action stages. Each level is laid out with bricks, ladders, ropes and gold bars. Collecting each bit of blinging bullion causes a stage-exit ladder to appear, which you're tasked to reach and ascend before the stage's enemy forces can chase you down and tag you. Your only method of offense -- really, the only thing you can do other than move -- is to dig holes.   Lode Runner can cause the block one square below (and to his immediate left or right) to disappear, ~digging~ it out of existence for a temporary period of time.  Enemies that walk over the then-missing block will fall into the hole and you'll be able to walk across their heads, safely avoiding their deadly touch. You'll also have to use your digging powers to create paths and shafts down through multi-tiered layers of brickwork to reach any buried gold bars that might be lurking underneath.   There's an Edit Mode that allows you to lay out your own puzzle levels yourself, if you tire of the game's set and standard array. There's also a Battle Mode, as Battle Lode Runner is one of many TurboGrafx games to support up to five human players at once. Once you've recruited a group of extra players and pads, you can choose from Survival, Escape and Tag Match game types. Survival is an every-man-for-himself free-for-all, similar in ways to multiplayer Bomberman but not nearly so intuitive or fun. You'll be able to collect power-ups like speed upgrades and the infamous control-confusing skull icon, as you seek to be the last man standing. Escape is similar, but the goal is to find a piece of gold before the other players and climb the exit ladder first. Tag Match is the same as Survival, you just play it in teams of two people apiece.Wise old Lode Runner has been making puzzle/ action fans play ~just one more~ for almost two and a half decades now, and though Battle Lode Runner isn't the most exciting title in the series, it does have the occasional burst of fun. Just don't expect much more.", "date": "Apr 26, 2007"}