{"name": "Muncher", "name_review": "Muncher Review", "ref": "https://www.ign.com/articles/2007/04/27/muncher-review", "text": "Tossing elements of Snake and Pac-Man into a blender and hitting frappe might not exactly sound like a recipe for a successful and endearing mobile game, but GenPlay's Muncher is a surprisingly good play.   As a multi-segmented caterpillar, you duck and dart around a maze full of mushrooms than stand-in for pellets and chew up segments of enemy caterpillars. How do you know they are bad caterpillars? Because they aren't as colorful as you. And by sticking within simple, accessible parameters like this, Muncher becomes an instantly enjoyable game, even if its graying mechanics aren't anywhere near the neighborhood of innovative.   Worming your way around a series of mazes, stretched across several brightly detailed worlds, you munch on mushrooms that add additional segments to your ever-lengthening body and unlock necessary power-ups. A blue lightning bolt gives you a speed boost that proves incredibly useful when your caterpillar's segments drag an easy twenty behind its head. Fire turns you temporarily invincible, allowing you to plow into enemies head-first. The freezing power-up brings enemies to a stand-still, making them easy targets for your voracious, well, muncher.   To escape a stage, you must munch enough to fill the butterfly meter at the bottom of the game screen four times. Once the butterfly icon is fully illuminated, you can chow down on an exit flag.   Unless you are invincible, you can only defeat enemies by chewing them up one segment at a time from behind or by slamming into their sides and cutting them in two. This is a good way to make a lengthy enemy caterpillar a smaller threat, but you'll miss out on chewing up all of those extra segments from behind. In the opening stages, the enemy caterpillars aren't especially bright and become easy targets. By stage three, though, they are downright predatory, working together to back you into a corner and swipe at you from the sides.   Muncher adds a few extra elements to the mazes as you dig deeper -- such as making the levels stretch beyond the borders of the screen. This is indeed a smart move, as the relatively small screen of your mobile would prevent GenPlay from crafting some genuinely nice sprites and environments. You must also look out for holes in the ground that can be filled by nudging an object into them.  Muncher is a nice bit of mobile entertainment, despite not advancing the ball in any way, shape, or form -- but in works in spite of trafficking in well-worn mechanics. I found myself returning to the game several times just to try another stage or two because it demanded so little. I-play's David Gosen talks at great length about bite-sized gaming, and that's exactly what Muncher provides. And it looks cute as a button while doing so.", "date": "Apr 27, 2007"}