{"name": "Spider-Man 3", "name_review": "Spider-Man 3 Review", "ref": "https://www.ign.com/articles/2007/04/27/spider-man-3-review-8", "text": "Peter Parker must fight not only external evils like Sandman, but also come to terms with his own aggression in the third chapter of the filmed Spider-Man saga. It looks like riveting stuff -- the idea of a superhero unhinged has enormous potential -- but until the theatrical bow on May 4, we'll just have to make due with this earlier-than-expected mobile game.   Don't worry about spoilers. Not only do you likely have a pretty good idea of what to expect from the teasers, but the story elements of the mobile game are also completely useless. Perhaps developer Javaground was prevented from giving away too much, but the game provides such a fractured plot that they should have not even bothered with motivation and just dumped you straight into the web-slinging.   As Spider-Man, you have access to a limitless supply of web juice. This means you can swing around the levels as much as you like, soaring over rooftops to get the drop on a series of non-descript thugs begin boss encounters. Although the stages are sometimes cramped -- this is when you're supposed to concentrate on wall-crawling -- the developer was wise to give Spidey plenty of open-air situations so you can make good use of the game's best (by far) feature.   Worse off is the combat, especially against the low-level bad guys that make Manhattan such a seemingly dangerous place to live. When you get in close to a menacing crook, just pound on the OK button to execute a series of painful thwacks. If you can get in a string of hits, you have an option to go for a combo move by matching an arrow displayed over the thug on the directional pad. Double-tapping OK from a slight distance sends out a volley of webbing that grabs the bad guy. Pressing away from the now-wrapped enemy sends him flying across the screen. If you can throw him into a crate, you'll do more damage than if you just hurled him back to the ground.   As you progress, you learn a handful of new moves, such as the Spider Stomp and a pile-driver. However, save for a few boss encounters, these moves are disposable. You can push your way to the finish line with just the basic move set.   After a couple stages in the red-and-blue uniform, Spider-Man suddenly finds himself encased in the black suit. (Again, the plot explanations are horribly lacking.) Given over to anger, Peter Parker now keeps himself powered-up by causing damage to enemies and the environment. Breaking a box, for example, releases a black blob that fills his health meter. The black suit makes you more powerful, but the thugs enjoy a stamina boost at the same time, too.   The game is punctuated with some boss encounters, starting with Harry Osborn as the second edition of the Green Goblin. Later in the game, you'll face off against the Sandman and Venom. There are also a handful of levels that offer secondary objectives besides just ~beat up everybody.~ You must save a set number of citizens from falling debris, for example.   My beef with the game is that, save for the web stuff, it plays like so many other side-scrollers. Walk up to the bad guy, jam on the OK key to dish out damage, and then move on to the next one. At least the levels are the right size; you can push through one in just a couple minutes. There is the ability to go back and replay stages, but honestly, I can't think of a single one I'm just dying to experience again.    I downloaded the game on a Sony Ericsson w810i. The game looks just okay. Spider-Man himself has an odd gait. The bag guys are color palette-swappers. The stages have a fine amount of detail, though, and I liked the little touches, such as window lights coming on when people hear the web-slinger near their homes. The game's music and sound effects are decent.  The problem with Spider-Man 3, though, is that is simply going through the motions. Save for the web-slinging, the game doesn't strike out to be anything more than a movie tie-in side-scroller. There are a handful of fun moments, but not enough to warrant a download.", "date": "Apr 27, 2007"}