{"name": "Castlevania", "name_review": "Castlevania Review", "ref": "https://www.ign.com/articles/2007/05/01/castlevania-review", "text": "Simon Belmont's legacy began in Japan in 1986 and graced the Western market in 1987.  Armed with nothing but his whip and wit, Belmont traversed various creepy locales in his quest to make sure the undead were informed of ~the good news~.  Unfortunately, for them, meeting with the Cross and other religious imagery was far more upsetting than enlightening.  But Belmont cares not for the religious ideals of these foes as he has so efficiently slain them across countless platforms.  Like many releases on the Virtual Console, Castlevania and its sequels have been re-released for many systems; the original NES classic was ported to the GameBoy Advance.  Why Nintendo chose to release Super Castlevania IV for the VC before the original NES incarnation is a mystery.  More importantly, however, is that fans of the series now have the opportunity to play both, and the one that started it all can now be had for the reasonable price of 500 Wii points.          Objectively analyzing Castlevania is a somewhat daunting task.  With some calling Castlevania IV a ~remake~ of the original classic, the improved version remedied several flaws and drastically improved gameplay mechanics.  For example, the updated version allowed players to cast the whip in eight directions and jump to and from staircases.  Of course, hindsight is always 20/20, and it is unfair to judge the NES title based on what its successor accomplished so incredibly well.  What results from these very basic controls and maneuverability is an often overly demoralizing gaming experience, with the game being ridiculously difficult at times.  However, judging the game for what it is, and not what it lacked compared to its ultimate sequels, Castlevania is a great throwback to the glory days of the NES.   Loosely based on Bram Stoker's Dracula, Simon Belmont slays bats, Mermen, flying Medusa heads, dragons, and other manifestations of PURE EVIL.  Initially armed with a leather whip, the weapon can be upgraded to a morning star, and subsequently an elongated morning star.  Special items, upgrades, and health reside in bricks and candlesticks.  Such items include holy water that ignites the ground in front of enemies (sounds like the ground is the real sinner here), a clock that stops enemies in their tracks, and a cross that eliminates every baddy on the screen.  The player will often implement every conceivable upgrade and item as there is an incessant onslaught of enemies hell-bent on Belmont meeting his demise.      Graphically the game definitely shows its age 20 years later, but still highlights the graphical prowess of the NES.  The soundtrack and effects are quite good - famously so.  The music in the Castlevania series is epic, catchy, and atmospheric.  Despite the limitations of the NES' sound hardware, the tunes' strengths still shine through.  Something that has been omnipresent throughout the series is Konami's propensity to create that eerie, creepy atmosphere - and the graphics and sound do an excellent job achieving those ends.500 Wii points is an excellent price of admission for this NES classic.  The game blazed the trail for its hugely successful successors, and exemplified challenging and rewarding gameplay.  It gets a little tricky from here on out, though.  Super Castlevania IV, for only 300 Wii points more, seems like a smarter purchase, as it improves on almost every facet of the NES original, including mechanical and graphical upgrades.  If you've already (smartly) downloaded Super Castlevania IV, are looking for an even greater challenge, and want to see where the series gets its roots, then give this one a download.  For newcomers, however, frustrations may be more efficiently inhibited by downloading the SNES version first.", "date": "May 1, 2007"}