{"name": "Pillow fight", "name_review": "PIllowfight Review", "ref": "https://www.ign.com/articles/2007/05/01/pillowfight-review", "text": "Some games, you know just from title whether you want it or not. I-play's Pillowfight is one of those games, blessed with such a perfectly descriptive title that provides everything you need to know about the game. There are scantily-dressed girls fighting... with pillows. Goose down pillows, to be clear.   Developer Capybara Games conjures up a fluffy fight club for light-minded mobile entertainment. Using a single thumb on your handset's directional stick or pad, you swing and feign with five other comely lady fighters. Nothing is to be taken seriously here. You duel with cheerleaders, French maids, and leather mamas in such sordid locations as a Coyote Ugly-esque bar and an exotic dance joint.   The whole thing is a frothy goof aimed not at hardcore fight fans, but the casual gamer with both a sense of humor and Bejeweled fatigue. As such, the game mechanics and control scheme are incredibly simple. You don't have an arsenal of moves. You have only three attacks, including a power swing (up), a low blow (right), and super-move (OK) accessible only when you fill your adrenaline meter by landing a volley of hits. The key to success in the beer-soaked arena is to learn your opponent's patterns and then counter when the time is right. The S&M dominatrix, for example, will rear back for a big swing, giving you ample warning to dodge (left). If you successfully dodge the attack, the dominatrix leaves herself vulnerable for a second. Go for a power shot and knock her senseless.   You cannot just pound on the directional pad to unleash a flurry of shots without consequence. You have a stamina meter that drains with every swing, but slowly regenerates. If you zero it out, you cannot make any shots, leaving yourself open for a right good smack to the puss. Saucy.   In this respect, Pillowfight is actually a fighter-puzzle hybrid. Prepping for the perfect moment to unleash the super-move is kind of like prepping the well in Tetris for the long, skinny piece. When the time is right, you can clean four lines. In Pillowfight, when the time is right, you can knock that sassy little minx of a maid to the mat. Getting the hang of this give-and-take is pretty easy, thanks to a smart learning curve, but Pillowfight only wears the kid gloves for so long. The second season of your burgeoning pillowfighting career really turns up the heat.   Pillowfight contains an extensive amount of achievements that add points to your fighter's career score. The more points you earn by earning these achievements, such as Aggression (KO within 30 seconds), the more extra content you earn. As you work your way up the ladder, you unlock itsy-bitsy new costumes and powerful pillows that punch a wallop. After a few matches, you also start unlocking extra modes, such as a survival match and a territorial match. In the latter, you fight not to empty out your opponent's health meter, but to push them off the bartop.   If I could complain about anything -- it's that you cannot select your own character. You play as the same chick with the same moves for the entire game and this really clamps down on replay value for gamers that want to squeeze more than a couple hours out of their mobile games.   The ladies of Pillowfight are nicely drawn, but it's their animations that really charm. The French maid will do a little twirl and try to push you back with her fanny. The cheerleader jumps into the air, ready to rah-rah. It's a fun game to look at, especially because it stops short of exploitative. This is just sexy fun -- not Girls Gone Wild grotesque. The game is accompanied by some light music and effects.  I-play and Capybara have achieved something special here -- a casual fighter that isn't light on game play. The accessible controls open up the game to anybody, but the hidden achievements and escalating difficulty really put some meat on the bones. Hardcore players might still find it too light, but the intended audience will have a gas. Only a curmudgeon could bitch about this game. It's silly, sexy, and most importantly, fun.", "date": "May 1, 2007"}