{"name": "BurgerTime Special", "name_review": "BurgerTime Special Review", "ref": "https://www.ign.com/articles/2007/05/03/burgertime-special-review-2", "text": "There's comfort in a McDonald's hamburger -- it's a total known quantity. The same can be said for Hudson's new edition of the arcade classic BurgerTime, sub-titled Special to hint at revamped graphics, new stages, and additional food foes, such as earns of corn and nacho chips. All fans of BurgerTime need to know is that this newest edition delivers on the exact gameplay that made the arcade original an enduring favorite. So if you're down with Chef Peter Pepper, you will be well served by BurgerTime Special.   For the uninitiated, BurgerTime is an old quarter-muncher starring the aforementioned chef. Pepper is condemned to roam a series of ladder-filled mazes and stomp condiments on to waiting bottom buns. His task is complicated by mean-spirited foodstuffs, such as a wiggling frankfurter and a walking fried egg. A fast blast of pepper freezes these anthropomorphic snacks, allowing players to either make a fast getaway or finish traipsing across a bed of lettuce, sending it -- and the delectable denizen -- plummeting down the screen.   Really, the game was a lot of fun. And, more importantly, it still is.   Hudson's Special changes up the scenery by offering a series of new mazes complete with backdrops. (The original was set against a black field.) The rogue's gallery features familiar faces at the get-go, but soon Pepper must also deal with tougher enemies, such as a chili pepper and a nacho. This murderer's row of eats presents a smarter challenge, as the corn is better about following Pepper and the chili is completely unfazed by your dash of pepper. The nacho is loco, erratically moving around the maze. Other than these new additions, the gameplay remains largely the same.   I tested the game on a Sony Ericsson w810i. The game really pops off the screen, thanks to the use of bright colors and funny little sprites. The classic theme is also revisited for this new mobile edition.  BurgerTime Special is a great download not only for fans of the original game -- of which there are still plenty -- but mobile gamers looking for a great taste of the glory days of the arcades. The new additions are legitimate improvements. While I'm always glad to have a great game just on mobile, I hope Hudson considers the Live Arcade or Wii Virtual Console as a next stop for this good revision on an old fave.", "date": "May 3, 2007"}