{"name": "Centipede & Millipede", "name_review": "Centipede & Millipede Review", "ref": "https://www.ign.com/articles/2007/05/03/centipede-millipede-review", "text": "As a young lad I dreamt of the pitter-patter of a hundred little feet. For a brief time, I was obsessed with Centipede. The arcade classic charges you with clearing a virtual garden of pesky spiders and, of course, the long-bodied centipede that crawls across the screen quickly approaching your garden gnome. That's right, you play as a garden gnome with a laser. God bless the '80s. Tragedy struck my wonderful childhood memories with the release of Centipede & Millipede on Xbox Live Arcade. The simple joys of a trackball and a sticky ~shoot~ button are now forever soiled by this poor XBLA offering.   For 400 Microsoft Points (US$5), you get both Centipede and Millipede. Each comes with classic (AKA cool) modes and enhanced (AKA total garbage) modes. For only five bucks, it might not seem like a bad deal to pick up two memorable arcade games. Don't throw down your Microsoft Points so fast. Centipede & Millipede don't translate perfectly to a 360 controller and the additions made by developer Stainless Games are unwarranted and poorly implemented.   Let's first talk about the good to be found in this bite-sized download. That would be the classic versions of Centipede and Millipede. The two games are very similar, with Millipede basically a 1.5 version of Centipede. I've never been fond of Millipede, since it just tries to throw in more crap on top of the original Centipede to make it appear like a brand new game. Both are enjoyable, even if the experience is often short-lived. These were, after all, games designed to eat up quarters. Even champions of Centipede don't have particularly long game sessions.   The enhanced versions are the New Coke of Xbox Live Arcade. The classic versions perfectly recapture the graphics and sound that I remember so fondly from my youth. The only issue is with the lack of a trackball. The speed of your gnome is not as fast as in the original arcade version, which does slightly hamper your effectiveness. Still, I didn't have any real problems using the 360 controller instead of a trackball. Sure, it would be great for MS to release a trackball peripheral for the half-dozen arcade games it would be good for, but the regular controller serves well enough.   Things completely fall apart once away from the classic versions. The enhanced modes are abysmal. To make the graphics appear more spectacular, the mushrooms, centipede and spider are all bigger. That means the board is technically smaller than before, but has larger objects. That's a pretty big deal. It doesn't help that every shot fired produces obnoxious explosions. The overdone effects are, however, a perfect compliment to the atrocious soundtrack.   To round things out, both classic and enhanced modes can be played on ~Throttle Monkey~ speed. I've been told that as a representative of IGN I can't advocate the use of illegal drugs, but I'll assume that some combination of prescription medication could give the proper boost to your cerebral cortex that allows you to successfully play a game at this speed. Throttle Monkey is Centipede in hyperdrive. It's a little ridiculous, but far more amusing than either enhanced mode.  I've never understood the pricing for some of the arcade games on Xbox Live. Some might consider $5 a good deal for two old (and very similar) games. I can't help but play the enhanced versions and think that these worthless add-ons drove up development costs and therefore the price. If there's a diehard Centipede fan out there, perhaps $5 is a small price to pay for the love of an old game. But if you do choose to download this twofer pack, do yourself a favor and stay far away from the enhanced modes.", "date": "May 3, 2007"}