{"name": "FIFA Soccer 64", "name_review": "FIFA Soccer 64 Review", "ref": "https://www.ign.com/articles/1997/04/02/fifa-soccer-64", "text": "I was really looking forward to a soccer game on the N64 (being a member of a soccer-crazy nation who has lived four years in an emerging soccer-crazy nation, I am perhaps a little Fussball / football starved here in my US exile). And with EA Sports' pedigree of fantastic 16-bit FIFA titles, it seemed like the right company to give me exactly what I wanted. ~Seemed~ is the word...Let's start with the good stuff:Options: The first thing that you will notice is the usual EA Sports array of options: length of match (up to 90 minutes), screen text language (English, French, German), Arcade or Simulation mode (in arcade all teams are basically the same), weather, clock, fouls (on/off), offside (on/off), injuries (on/off), time display, auto replay, music and SFX. There are a bunch of different play modes, too, ranging from Friendship game (one match only), over League Mode to Tournament. You can choose either from a listing of international teams, or select from a number of teams within the respective leagues (unfortunately only in the case of Germany, France, England, Italy and the U.S.).There are five different controller configurations: novice, simple, semi-pro, pro and complex (the highest one also means there is no computer assistance, the lowest one is more forgiving).You can choose from eight camera settings ranging from the zoomed-out Telecam to the TV-like shot switching FIFA 64 Cam. There is also a PIP (picture-in-picture) camera that can give you either a separate view in a small window or a radar. EA also included team management configurations, where you can determine your strategy and formation for the game (pick from six formations and five strategies), fine-tune the field positions of your individual players and create your team's line-up.Graphics: The plethora of charts and stats has already become a staple for EA Sports games, but in FIFA 64 they cannot hide a weak game engine. When you start the actual match, everything still looks fine. The stadium looks pretty nice, the polygonal players animate smoothly and they seem to be wearing all the right uniforms. Kick off. Then the trouble starts: The framerate.I played FIFA right after Blast Corps and it's hard to understand why a game that at times shows detailed bridges, buildings, ravines, clouds, a helicopter and your vehicle on one screen can scroll so smoothly, whereas FIFA 64 with a flat texture-mapped lawn and a few players stutters along worse than a close-up tracking shot in a Super-8 film. We're all used to seeing soccer on TV with cameras panning at a nice 30fps and although FIFA at times manages to give you a pretty close approximation of the real thing, as soon as it starts scrolling -- we're back in our living rooms wondering why this game wasn't delayed for fixes. Things get even worse when you switch on the PIP monitor, and it seems that the scrolling is only tolerable when the camera is zoomed out all the way (Telecam).The sad thing is that the motion-captured player animations aren't really all that bad, but when the game moves, they too look like they're out of a low budget animated feature.Control: The control is loose at best and feels rather sluggish. In the first half hour of playing, I always thought I was pressing the wrong button for switching players. The truth is that there is an annoying delay from when you press your button to the time your player is switched. It would have been nice to have an optional sound effect (like in Gretzky 64) to tell you whether your switch worked or not. If it wasn't so slow, this would not be an issue at all. In a strange turn of events, although you can use the analog stick, FIFA doesn't support analog movement.The ball physics are a little strange at times. The ball has a tendency to abruptly stop rolling. In the beginning I gave up on a long shot that was heading right to the edge of the playfield, only to find that the ball would slow down right before the line -- which looked really unnatural.Canadians will probably be overjoyed to know that their teams can be found under ~United States of America.~ And for some reason a number of team names sport odd abreviations (typos?). For instance, Dsseldorf is called Dsseldrf under the English language setting, but when you switch the game to German it's spelled out in full. I'm always amazed at the sloppy spell checking in games and manuals (no, Bavaria's team is not called ~BMnich~), but luckily the German and French language settings are more accurate (and most people don't care anyway).Sound: Nevertheless, FIFA 64 is not all that bad. It manages to be very entertaining -- and the sound is really great. The game is the first N64 title to be ~officially~ in Dolby Surround sound (logo on title screen). The crowd cheers and calls sound very real and there are no sudden changes that make them seem unnatural. It really sounds like a true soccer match. The commentators are almost always right on time (something that doesn't happen often in CD games, for example) and their sentences are neutral and varied enough not to annoy (who could ever forget Gretzky 64's: ~Robin Hood and his merry men...~). Although the ~nicely on the chest~ bit is getting a little old.Gameplay: As with almost every sports game, there is a lot of fun to be had with two or more players, but the slow, unimpressive graphics and equally sluggish gameplay really ruin the experience for me. The sad thing is that the game had immense potential, and simply looks rushed. If the programmers had gotten more time to complete the game, this could have been so much more.I would recommend buying this only if you can't live without a soccer game and need one now. OtherwiseI'd say, make it a Blockbuster Night and wait two months for Konami's International Super Star Soccer(Perfect Striker), which beats FIFA 64 in all categories -- and doesn't even need a second half-time forit. What a disappointment.", "date": "Apr 2, 1997"}