{"name": "Rock City Empire", "name_review": "Rock City Empire Review", "ref": "https://www.ign.com/articles/2007/05/04/rock-city-empire-review", "text": "Digital Chocolate's budding Empire franchise makes a detour into downtown Rock City, turning the one-time nightclub management sim into a tour of duty in the metal bar scene. Instead of just overseeing one club, players must now juggle three exploding rock venues, giving the game a serious infusion of depth or difficulty, depending on your ability to keep booking new talent to please ever-fickle tastes, buy new equipment, and keep the staff happy. It's a smart evolution for the Empire franchise -- this is not an easy re-skin like The Sopranos Bada Bing! Manager.   As mentioned, the biggest change is the introduction of two additional clubs, unlocked by earning fame points. Fame points are awarded for meeting objectives. Opening these new clubs certainly increases your revenue stream, but it also really pulls your attention in several different directions -- especially when that third club comes into play. It seems like every time you turn around, something at a club other than the one on your screen demands your immediate attention. Maybe a new band must be booked because the rockabilly kids have rolled into town and they just aren't digging hair metal. Or the bouncer has quit -- again.   One could argue that this newfound franticness combats the complaint that Nightclub Empire was too easy when you had a real handle on the scene. I'd argue that it could pose a turn-off to the most casual of players, because mobile gaming isn't about the repeat punishment often found in console gaming.   Digital Chocolate also gives Rock City Empire more structure by adding a 100-day time limit to the game. Within the set amount of time, you must open all three clubs and hit all objectives. If you fail, you still get a nice pat on the head and the encouragement to try again, playing against your previous game. If that sounds like too much of a time-sink, don't worry -- the 100 days can be completed in about 80 or so minutes. DChoc knows not to demand too much of your time. There's a fine line between casual and chore, and fortunately, it seems more and more developers/publishers firmly understand where that is.   Save for these additions, Rock City Empire follows roughly the same formula as Nightclub Empire. You start out with a fleabag club, a pocket full of cash, and very few patrons. You must install equipment, such as dance floors and speakers, to foster interest in the joint. With a little more money in the bank, you roll out advertising. As the place gets crowded, you must hire a bouncer to keep troublemakers at bay. And, of course, you must hire bands that match the people pumping and shaking on your dance floor.   There are only four bands in Rock City, down from Nightclub's six DJs. Music styles include eighties rock, rockabilly, punk, and the so-called Nu Metal. You must watch the costumes of your patrons to match bands. Torn denim? Eighties rock, my friend. Unfortunately, the music is not nearly as memorable as the tunes from nightclub Empire, which all deserved to be ringtones.   But while the band count is lower, the new equipment is firmly better. You can install video screens and spark machines to really juice your clubs into rock destinations. Thanks to the new gear, Rock City has much more visual panache than Nightclub. You can also purchase insurance to safeguard against disaster, which does indeed happen in the Rock City.   Just as Nightclub Empire had a scratching mini-game that gave you the chance to earn extra money, Rock City also offers money-making side event -- a necessity to buy high-priced gear and throw costly events. It Rock City Empire, you have a guitar-themed mini-game that follows a pick down a never-ending fret. You must hit the OK button in time with the markings on the fret to make spare change. If you hit several, you're ~on fire~ and earn even more coin. This is perhaps the highlight of the game, and not just because it represents a chance to really squirrel away some big money. It's a hell of a lot of fun and could very easily be blown out into its own game.  Rock City Empire succeeds in many of the same ways as Nightclub Empire, such as the immediate impact of your purchases. Your clubs are always evolving, giving you a real visual measurement of your progress -- especially when you spot the growing lines outside your clubs. The Guitar Hero-esque mini-game is a lot of fun. The game has more structure than Nightclub and the addition of two extra clubs -- which must be run simultaneously -- gives the game extra depth. With this depth, though, comes added difficulty that could veer into frustration for the ultra-casual set. If you can handle Diner Dash and Cake Mania, though, you can handle the three clubs.Rock City is a natural evolution for the Empire series and I'm extremely curious to see where Digital Chocolate goes next with the franchise. Maybe Sunset Strip Empire? Late Night Talk Show Empire? Whatever they choose, playing Rock City Empire is a good way to spend the wait.", "date": "May 4, 2007"}