{"name": "Monaco Grand Prix Racing Simulation 2", "name_review": "Monaco Grand Prix Racing Simulation 2", "ref": "https://www.ign.com/articles/1999/06/09/monaco-grand-prix-racing-simulation-2", "text": "Le Grand Prix de Monaco was born in April of 1929. Over the past 70 years it's undergone some changes. The track today is just over 3km. You race 78 laps (you can reduce this if you like) and best time wins. You'll be driving the fabulous F1 racer that all the kids are talking about these days. The game offers a great F1 experience on one of the most prestigious tracks in the world. Better than that, you also get 16 other world class tracks to try. There's a great deal of variety here, but you'll need a lot of patience to get at all of it.  I'll spare you the history of the race itself. I will say that the manual gets deep regarding this subject. There's a lot of hinkfo about the race itself and a neat timeline that gives you some insight into what happens at Monaco in the days preceding the race. Despite it's being only a few short pages, this introduction made me feel like I was in the know as far as Monaco goes. I have a much better appreciation of the race itself now. But enough about that crap. Let's talk about the game itself.  Controlling the racer is fairly simple. It's plain racing. All you do is steer, shift and accelerate. Steering is pretty tight but that's more a feature of the F1 than a weakness of the game. What really irritated me was the failure of the downshift modeling. Since the turns in this game can be severe, you really need good downshift control. You're approaching a turn at 200mph and you need to drop some speed quickly. In most racers, you just pop the car into 3rd or 2nd and you immediately slow down. In this game the decrease in speed is much more gradual. The combination of downshifting, steering and braking is a little hard to manage.  You can view the car from a ton of views. Only four are practical for racing. There's the cockpit view and three helicopter views. Apart from these there are numerous ~director~ views. These are not too practical for racing, but are useful in the replays. You can watch any of your races from any of these angles. You can even switch the cameras from car to car to see how the real professionals do it.  There are several different modes in which to race. You begin, if you're smart, with the training levels. The first of these is a simple practice mode. You, alone, on the open track. If you really suck at this, perhaps you could move on to the Demonstration level. Here you just watch a computer controlled car as it speeds around the track. This gives you a chance to identify the lanes and gears that you must use to win the race-or even come in next to last in some cases. Finally, there's an Apprenticeship level that combines the two other training levels. You follow a lead car around the track matching its speed and direction.  Once you feel like you no longer suck, you can move on. The Time Attack is just like the time attack in every other racing game. Here you can also race against ~ghost~ opponents. These are merely recorded versions of your other attempts on the same track. There's also a Simple Race mode where you can jump into the action without much forethought and without any harsh consequences. There are also some prearranged scenarios that will test your ability to rise above technical limitations as you race with a malfunctioning car. Other scenarios stress the ability to work in concert with the other driver on your team.  You can set up a Championship season all your own with customizable circuit and opponent lists. There's also a Career mode where you start out with a crap car. At the end of each season, your performance is evaluated and if you've done well enough, you may get the option to race under a new contract. The better racers get the better teams and the better cars.  But the real point of this game is to race in the Grand Prix-after all, it's not called Monaco Time Attack Racing Simulation 2 is it? Now that I mention it, I better double check that...nope, it's not. It's Grand Prix, baby. Even here there are several types of races. First off, you get two practice laps to test your car settings. Hopefully, you've done this work in the Simple Race or Time Attack modes. Then there's a Heat to determine starting positions. On the day of the race, you can run a few warm-ups to fine tune your car. It's also useful if the weather is not what you expected. Once you pass all these levels-and it's not necessary to do them all-you're ready for the race itself.  So you go ahead and race the Grand Prix and you still suck. What's wrong? You haven't tuned your car correctly. Grab the manual, Kyle. You're gonna need it. Your two main problems are that you haven't balanced the handling of the curves and you haven't found the proper trade-off between speed in the curves and speed in the straightaways. To fix this problem, you'll need a lot of patience and an eye for details. There are no less than 13 separate systems on each car that you can adjust. You control the gear ratios, the dampers, wheel alignment and brake balance. For every possible weakness on the track, there's a mechanical solution.  The manual does a really fine job here. It spells out each modification and explains how it affects car performance. Let's say that you've identified your problem-we'll get to how you do that a little later. Your rear tires are slipping in the turns and you know it's because your wheel travel is negative-i.e. your tires are not in contact with the track. This can be solved by adjusting the suspension. Specifically, you'll want to adjust the dampers. To increase the load weight on the wheel-and thereby their contact with the road-you'll want to soften the rebound factor of the rear wheels while stiffening those in the front. If on the other hand, the car shakes a lot after travelling over a bump, you'll do better to stiffen the bump on all four of your dampers. I was surprised at how many factors can be adjusted in each area. I'm glad the game also has a print set-up function. This way you'll get a hard copy of your set-up that you can refer to.  So how the hell do you know that you have negative wheel travel or zero load weight? In a word, telemetry. After you've completed at least one lap, you can access the telemetry data. This is a graphic representation of your car's performance during the lap. The various graphs show you, among other things, speed, braking percentages, steering angles and gearbox ratios. As you pull up each chart, you can see how well (or poorly) you did on each section of the track. You can then use this info to tune your car to the demands of that track. Once again the manual does a remarkable job of guiding you through this process. And believe me, it's a process and a half. Maybe even two processeses.  Once you get the car balanced, you can run several laps and view them all on the telemetry screen. This gives you an insight into how to race each portion of the track. Experiment with a few speeds and gears. The telemetry data will show you how to approach each section of the track to maximize re-acceleration time or braking. This requires a lot of patience however, because you will, ideally, only change one factor at a time. If you change too many, it may be difficult to determine what each individual change does to the car's performance.  If you still suck, try playing the game on an easier level. There are two broad versions of this game. In the realistic mode, you can set some of the handling hazards and select the computer to aid your driving. You can also set the level of your opponents. There are three categories and they're spaced pretty well. The easy guys are pretty bad while the expert guys will stomp all over you and your momma. You can play the game on super easy mode, but the main feature of this mode is that the computer automaticaly brakes for you. If you're approaching a turn too quickly, your car will begin to slow down to a more managable speed. For me this was very frustrating but it lets you know what speeds are reasonable for each turn.  The manual also does an amazing job of outlining the individual circuits. For each of the 17 tracks, you get a thorough description, some very helpful strategies (not just ~hug the corners,~ or ~pass on the outside~). The manual suggests several starting places for car modification. It also suggests driving style for each of the parts of the track. A map of each track is included which shows you the ideal gear and g-force (I loved that cartoon) for each section of the circuit. Anybody can drive fast and straight. In the end, the winner is the guy who can get through the turns with as little trouble as possible.  In terms of design, the tracks are great. In terms of look, they're not so good. The actual layout of each presents some tough challenges to the Grand Prix racer. Each track has its share of long, straight lanes and tight, harrowing turns (called ~chicanes~ by those in the know). Usually, by the time you've maxed out your speed in the straightaways, a nasty turn is coming up. It's not unusual to see the other racers slow to a crawl to get through some of the turns. I suggest you do the same. In addition to the Monaco track, you'll be able to race on any of up to 16 other circuits. These are all quite distinctive and fun. For simple and straight racing, try Italia or Canada. For a tougher challenge try Osterreich or Australia.  You'll be able to pay real close attention to the tracks because there's precious little to look at otherwise. Although the tracks are fleshed out in terms of scenery and background, most of the trackside objects seem pretty flat and lifeless. There's not nearly enough in terms of detail and color to compete with some of the other racers that are out now. The amount of stuff lining the tracks is surprising, but none of it has any real substance. I think, overall, that that's a trade-off for the smooth gameplay. Anything more detailed would probably slow down the framerate to an unacceptable level.  The cars look fantastic. All the details are sharp and stand up to close inspection. Some of the more extreme camera angles really show off the car design. The shapes are all remarkably smooth-none of the blocky polygons found in some other racers. In fact, the realism of the cars tends to make the cartoony aspect of the tracks even more apparent. Car effects such as skid marks and smoke from burning tires add a lot to the experience. Good lighting, three varieties of weather and four times of day help put you in the game.  There's even a retro 50s mode where you can race old school cars. You know, from back in the day. Unfortunately there are only four car types and one track for this 50s mode. And there are no weather effects, either. Despite the limitations of this level of play, it's a lot of fun. One word of caution however...these cars were built before many of the more practical modifications were available. After a few laps around Green Hell in these babies, you'll be begging for the responsiveness of the new F1s.  The game ships with a customizable map and sound editor. You can change the bitmaps for the cockpits, circuits and cars. That's the theory at least. I couldn't get it to work at all. As for the sound editor...eh. It's fun, but it only holds your attention so far. Homer saying ~D'oh!~ in place of the usual crash noise is humorous but only the first few times you hear it. Since I'm not willing to go out and record my own car sounds, the best I can do here is switch out the voice sounds with old clips from Foghorn Leghorn cartoons.  The multi-player option allows up to 8 players via modem. Set-up for this play is pretty basic but good luck finding competitors. A safer bet is the two player split screen version. It's a little cramped when sharing controls but the feeling of racing head to head is worth it.  On the sdubject of net play, UbiSoft has promised that they will be updating their website with all sorts of new scenarios for the game but I haven't seen any yet. In fact, it's pretty hard to navigate the site at all, much less find a specific resource. There's also supposed to be a new game service coming up where you can rank yourself with other drivers from all over the world. All I know about it at this point is that it's not yet implemented.   -- Stephen Butts", "date": "Jun 9, 1999"}