{"name": "Winx Club: Join the Club", "name_review": "Winx Club: Join the Club Review", "ref": "https://www.ign.com/articles/2007/05/08/winx-club-join-the-club-review", "text": "With Sony's focus of the PSP on males in their teens, twenties and thirties, it's interesting that Konami would bring a game based on Winx Club to the system, a television show aimed at young girls. While the license doesn't really match, neither does the content as Winx Club: Join the Club is plagued with simplistic mini-games that require enormous load times to play. In other words, this is almost exactly the wrong game to bring to the PlayStation Portable.   Indeed, Winx Club: Join the Club is a collection of mini-games, each with very basic control schemes and goals. From a racing mini-game to a memory challenge to a Luxor ripoff, none of the games here are at all engaging. In fact, the only reason that anyone would be at all interested in what's on the screen is if they're a fan of Winx Club, and necessarily the biggest fan the world has ever seen, in fact.   Goody. A new version of Memory. The game does include a number of clips from the show, though sadly they're poorly compressed and without any sort of supporting context or anything to tell you what's happening. In other words, if you've never seen the show, you won't understand a damn thing that happens, like why these fairy girls are all of a sudden riding in spaceships one minute, fighting witches the next and then promptly studying for exams.   On the plus side (sort of), there are tons of unlockable items (like furniture, clothes and such) that you can use to customize some of the rooms in Alfea Dorm and the Winx members. It's not really all that great as it doesn't tie into the actual gameplay at all, so unless you really like to manipulate chairs, it's not worth it.   Far and away the biggest problem with the game is its load times. Taking nearly 90 seconds between some screens, no single load is quick and given the short time that you're playing these simple games, you wind up spending more time staring at loading screens than you do playing the game. There are moments of painstaking waiting to be had here, so unless you're a fan of lines at the DMV, nothing found here is worth waiting for.   Homework is just as exciting as this game. Winx Club: Join the Club is a poor collection of simplistic mini-games with terrible load times. Fans will find clips and such from the show, but they're much better off with a DVD set of said cartoon.", "date": "May 8, 2007"}