{"name": "ArmA: Combat Operations", "name_review": "ArmA: Combat Operations Review", "ref": "https://www.ign.com/articles/2007/05/10/arma-combat-operations-review", "text": "Nearly ten years ago, games like SWAT, Delta Force and Rainbow Six began to shift the shooter genre towards greater levels of realism and accuracy. While the core concept of realistic military shooters has grown into some very interesting directions since then, few games have tried to capture the massive scale, limitless freedom and ever-present danger of the modern battlefield. One of the most promising efforts in that direction was 2001's Operation Flashpoint. Though it captured the key qualities of a battlefield simulator, a confusing control scheme, lackluster graphics engine and unforgiving difficulty frustrated many gamers' attempts to enjoy the things the game got right.  Here we are six years later with ArmA: Combat Operations, a game that is Operation Flashpoint's sequel in all but name. (And if they were going to change the name, couldn't they have come up with something better than ArmA?) The new game benefits from exactly the same strengths and suffers from exactly the same weaknesses as the original game, which is all the more distressing given the time that's passed since Operation Flashpoint was first released. Naturally, there will be players who can look past the performance and the graphics issues to revel in the merciless combat model and open design, but gamers used to the more cinematic, linear approach of games like Call of Duty or even Ghost Recon will likely find the whole experience more frustrating than fun.   Rather than thinking of ArmA as an action game, think of it as a highly detailed, very accurate military simulation. Numerous vehicles and weapons are included in the game, and in the largest concession to fun over realism, the player can actually jump into any vehicle -- from hatchbacks to A10s -- and take control of them. Some missions see you taking a lone-wolf approach while others put you alongside a large squad, either as the leader or one of the rank and file.  The conflict in this case is a fairly predictable East vs. West affair. The player is one a number of US soldiers on the Atlantic island of Sahrani. They're currently pulling out of Sahrani after providing military instruction to the Southern Sahranis. Just as the last of the US forces are preparing to leave, South Sahrani comes under attack from her aggressive, Warsaw-equipped Northern neighbors. Now it's up to the player, and the other US forces, to hold off the invasion until reinforcements arrive and the counter-attack begins.  The main campaign covers the story from start to finish across a few dozen missions. They range from the platoon-sized defense of friendly towns to lone wolf sabotage missions behind enemy lines. Each core mission in the campaign includes a few secondary missions that you can take beforehand to gain a slight edge by denying the enemy key reinforcements when you undertake the core mission. Stupidly, most of the secondary missions are solo affairs where you're tasked with taking on a much larger force all by yourself. It's often less aggravating and less challenging just to take on the core mission right away.   On the plus side, the mission design is great. Each of the encounters here feels like a real military operation and not like a game level. The entire island is spotted with cities, docks, airports, mountains, forests and you'll have the chance to explore a lot of it on the ground and in the air. Though there are an awful lot of stone walls placed around, the cities themselves are very convincing. Buildings, streets and vehicles are placed intelligently. Sure, you'll find the odd truck parked on a tombstone here and there, but otherwise, the layout of each level shows that some thought went into creating a realistic location.      This scale and sense of life is a definite high point in the game's favor. The same can't be said of the AI. Civilians run each other over in the streets and then get out of their car and walk off into the desert. Some inhabitants of the island (and indeed some of your own squadmates) will find themselves unable to negotiate even simple obstacles. Though the civilians steer clear of the more noisome military operations, shooting one of them doesn't seem to matter much to the other pedestrians. (We couldn't resist.)  Beyond the basic single player campaign, there are a number of one-off missions that you can jump into any time you like. Multiplayer and a rather extensive and convenient editor extend the life of the game considerably. Of particular interest is the potential to have dozens of players cooperating together online to undertake a specific mission.   Unfortunately, as realistic as the environmental design is, the vehicle physics and controls leave a lot to be desired. Large trucks can accelerate to forty or fifty miles per hour in a matter of seconds, while the twitchy helicopter controls leave no room for error when flying low and make it all but impossible to line up shots against moving targets. You can easily turn your head to look out the window of the smaller cars but, for some reason, when you're driving a bus, your neck stops working.  Driving itself isn't too bad (although the collision model is very basic). Where the game really needs some help is in the helicopters and airplanes. It's great to have a joystick to help out when driving these vehicles, but even so, there are so many controls that you won't feel really effective until you've been at it a few hours. This is a consequence of trying to model controls for infantry combat, land vehicles, boats, helicopters, and airplanes all on one keyboard.  Eventually you'll also have to make use of a number of squad commands to direct the actions of your teammates. Your fellow soldiers are usually smart enough to act appropriately under the circumstances, but you'll have to make sure to assign them specific targets, formations, movement and rules of engagement to make the most of them. Unfortunately, the game is too sophisticated to make use of the simple context-sensitive point and click method found in games like Rainbow Six or Brothers in Arms. Having to spend a few extra seconds to get a move or fire order across can really spell the difference between success and failure in some of the hairier firefights.   And the firefights definitely get hairy here. It's not uncommon in our experience to have to play through a mission several times before finding the magical combination of skill and luck that carries you through to success. The main problem (aside from the lethality of the weapons, of course) is that the enemy AI has a preternatural awareness of your position. Now, they won't be able to spot you if you're actually hiding all of your body behind cover, but if even one fingertip/earlobe/shoelace is sticking out into their field of view, they seem able to spot it instantly from hundreds of yards away. Combine that with their amazing marksmanship and the deadliness of their bullets and the game crosses over from challenging to unbalanaced. And this is on the easier of the game's two difficulty levels.  One nice concession to the game's insane difficulty is the inclusion of checkpoints. If you die, you'll only need to go back to the last checkpoint to begin again. These typically occur after a major objective is completed and they can be a real time saver. Still, given the vast distances you'll have to cover between most objectives, reloading a checkpoint usually means a few extra minutes of walking or driving to get to the action. One welcome new feature is the addition of a save system that allows players to have one active save point throughout the mission. You can overwrite the save as often as you like, which is a very nice touch.       Strangely, the graphics really don't seem to have changed much since the original Operation Flashpoint. Some elements still stand out as quite good, but they're still inconsistent. Some character or vehicle models, for instance, look great, while others are muddy and blocky. There are specific animations for climbing ladders or crawling on the ground, but no animations at all for getting into and out of vehicles. Vehicles explode with a satisfying bloom of fire and smoke, but there aren't any in between damage states for vehicles; they're either showroom new or charred hulks.  Performance seems to be a big issue as well, particularly on Vista. We've struggled to find the right balance between the quality of the visuals and a consistent framerate. We're beginning to think that it doesn't exist. This is particularly distressing given the fact that the game doesn't look that much better than the original Operation Flashpoint.   Apart from the gratuitous obscenities, the voice acting in the cutscenes is generally quite good. There are also bright spots during the missions themselves as you get audio cues leading you to new objectives -- although being informed that your extraction boat has been destroyed and you'll have to steal a helicopter from an enemy base in order to escape doesn't exactly qualify as a bright spot. The downside is the radio chatter. It's clear that the radio communication used in the game is pieced together using separate audio files for each word. As a result, each radio message sounds like...a message...from...the...Moviefone...guy.  The effects are sometimes a bit thin but they're put to excellent use regardless. Hearing bullets whiz by your head and impact the ground behind you really brings the experience to life. What's even better is that the sounds you hear reflect the battle situation around you. Many times we marveled as the positional audio gave us an awareness of things we couldn't see. Crouching behind a wall and hearing enemy troops patrolling on the other side, or racing to set up an ambush just as a church bell rings out to announce the arrival of the convoy, or wondering how your allies are faring as shots ring out a few blocks away -- all these moments reflect the excellent way that the audio is used in the game.   It's no surprise that the very qualities that makes ArmA so appealing to its core fan base makes it frustrating and all but unplayable to most other gamers. The fanbase will excuse clumsy controls, reading into our complaints that we are the ones who are deficient. Let me say to them now that that is not the case. They're on surer footing however when it comes to embracing the difficulty level of the game and in looking past its dated graphics. It's true that there's more satisfaction found in completing an ArmA level than a Call of Duty level, but it's equally true that ArmA has elicited a stream of obscenities from me that I haven't uttered since before I had an impressionable one-and-a-half year old living in my house.In short, ArmA's adherence to realism and accuracy in terms of weapons and world design is highly commendable and hopefully will inspire other developers in similar directions. It is undoubtedly one of the most realistic military shooters available. On the other hand, that's hardly a justification for such unforgiving difficulty and it's certainly not supported by the game's visuals.", "date": "May 10, 2007"}