{"name": "Messiah", "name_review": "Messiah", "ref": "https://www.ign.com/articles/2000/04/08/messiah", "text": "A couple of my friends were complaining about Messiah's general platformy-ness when they picked up their copies at the local software mart, and on the first couple of hours of play, I just assumed that that was some metaphor for ~we're just really bad at anything that doesn't consist of clicking a mouse.~ The game throws out some original, fun concepts with a sly sense of humor, something that's been sorely missed in Shiny's absence over the last couple of years, and for a while I couldn't understand what they were going on about. But as I got farther into the game, I began to wonder if the it was ever going to get larger than it seemed to be, and if you were ever going to get a chance to really explore the great environment that the team created. Sure it's fun to mess around with bodies and set people on fire and all, but isn't it all over too quickly? Maybe it's just us. Shiny never promised anything more than a fast-action platformer, did they? That's the problem -- nobody can seem to remember.   Thanks to the fact that our old EIC, Trent, actually worked on Next Generation during the now-infamous Messiah issue (September 1997, for those of you counting), I've managed to grab a copy of the original Messiah preview, and decided to see just how close the final product came to all of Shiny's original promises. For the most part the piece is a giant ode to the engine, which is appropriate since at that point the game was still a glorified technology demo. The game was right on target for Spring of 1998, and the piece is appropriately impressed with the character models, which were supposed to change the way we look at character detail in videogaming. In a standard Perry style the man of Shiny goes on to propel Messiah into the stratosphere as a game of epic proportions, with the visuals to match. No game could live up to the promises that Messiah first offered up, but overall it seems as though even the promises don't seem as great in 2000 as they did in 1997-8. A lot of games have been released since then, and the world of Messiah just doesn't seem so, well, shiny now.   Taking over a rat can give you a false sense of excitement.   I'll just let you know right now that when you first jump into a rodent and traverse a fantastic mini-maze, you'll get the impression that you'll never be sure what's going to happen next in the game. Add to that a great puzzle involving filling a recycling vat with, uh, new fleshy recycling material, and you'll even begin to think that the designers will be pushing the possibilities of body-swapping to their limits. Too bad the entire universe is built around your wings and you feet instead of your brain. There's very little interaction to be had, and as the game progresses, the joy of flipping between bodies begins to fade into using them simply as a set of living keys, opening specific doors or using specific items while in a certain body. You never find out new information, you rarely get special interaction, and you never get a sense of adventure while filling a body. But are they fun? Definitely. You'll still get a kick out of using a sniper shot, or just being in a pink afroed sex worker. Certain characters will give you access to special weapons, while other just get you treated nicer by the public at large. Other characters have smart tricks like the radiation worker, who can pick up isotopes and carry them into public areas to cause everyone else to gag and, well, die.   The humor's intact when it comes to gameplay, as well as a nice sense of style, but where's the tight action? Fighting consists of a few nice tricks like being able to sneak up behind characters and strangle them, but when it comes to gunfights, the game will have you cursing more often than not. The AI is incredibly tight, which means that characters will dodge, make tactical decisions, or just plain hide depending on your ~power~ rating compared to them. As a baby they'll run up and attack, but jump into a commander and they'll run back and hide from you. It's great stuff, but there are times when you wished they were a little less perfect. The sometimes awkward controls have you strafing and attacking like in Quake, only an alternate universe Quake where everyone has perfect aim, and where it takes you 10 times as long to pick up a new weapon. The basic plan to win is to just run up to someone guns blazing, get blown out of their body, and then jump to the nearest character. Sometimes it works, but a lot of the time it just gets frustrating to hop from body to body, getting killed every two seconds. Gunfights never play out very nicely, and you quickly realize that the only fighting tactic is not to really fight at all.  The baby's always fun, however, especially when getting used to the flying style, which is very similar to Joust (as promised in the Next Generation issue).   When you're not fighting, you'll spend a whole lot of time jumping on moving platforms, which is where the whole ~platform~ issue comes in. My friends actually meant literal platforming, meaning that you'll begin to spend more and more time jumping from moving walkway to moving walkway to floating elevator, and so on. It's the platform equivalent of the large maze in an adventure game, and it becomes tedious very quickly, especially when you're forced to stay in a body in order to take the character somewhere special. Instead of trying to push the puzzle aspects further, or at least flesh out characters, the game actually becomes more about hopping and using characters as keys than about solving interesting tasks. This wouldn't be half as sad if it wasn't for the fact that the first few sections of the game show off so many of the options that they could have worked even further as the game progressed.  But how's the baby's bum?  The graphics are still stunning, especially when you see animated movies stretched across billboards, or on moving, curved screens. I haven't seen this trick used to this extent before, and it was very impressive. The environments are nice and dense, with great transparency effects, interesting textures, and some funky design aesthetics, especially when it comes to characters. The characters, despite their great designs, have become the biggest fault of the game -- which is ironic given that three years ago they granted Shiny bragging rights. Polygons have become so detailed on PC titles in our modern millennium that seeing the stretchy textures of the Messiah characters looks like a botched experiment. While originally designed to fix problems with gaps between joints with polygonal characters, what it actually does is stretch and deform textures as you move around a level, meaning that when you stare at someone, you may just see a texture on their back sway back and forth over their shoulder blades. And let's not even talk about the shadows. It's acres away from being bad, but it's just as far from being innovative.  The sound is a handful from the same mixed bag. The sound effects and voices are  humorous and well placed, particularly the gurgling chots and the incredibly funny Bob, who seems to have changed from a wise-assed Joe Pesci type to a sweetly voiced four year old kid (literally), who provides more than a bit of comic relief. The music can drive you nuts at time though, especially during fights, when the same crunchy guitar riff plays over and over again during the entire battle, until you want to kill everyone just to get the music to stop. At first it's a nuisance, but later it can drive you absolutely nuts, especially when it crops up every minute or so.    Tell me a story.  The story seems to have taken the offramp a few exits earlier than the originally proposed plot as well, which during those pre-2000 days was going to concern Bob as a savior arriving two years early too early for the millenium, seven seals of the apocalypse, and a dark lord bent on unleashing armageddon early. Unfortunately what it's been replaced with is a series of hijinx that never quite connect, and rarely add up to anything interesting. Bob's been tossed on earth to ~make things right,~ in the most generic sense of the word, and Satan is now on the moon, having been brought there accidentally by scientists doing inter-dimensional experiments. And that's about it. There are constant plot updates that give you vague directions on where to go next, but you rarely get a sense of why you're doing it. Near the end of the game, because of [spoiler stuff I won't mention], it gets even more confusing as to why you're getting guidance and clues at all. Just as the original MDK had a great backstory that was never actually used in the game itself, it seems as though all of the great ideas promised in Messiah are never utilized when it comes to playing the game itself.  There's still a lot of fun to be had in the game, and I would say that if you're a fan of platformer/puzzle type action, then you'll enjoy a lot of the ingenuity involved with some of the tasks, but as a package it just doesn't hold up. The game is short enough to disappoint, and the ideas that seemed so brilliant in the first few levels just aren't held up later in the game. And to top it all off, some people have had problems with the second audio disk, as well as getting the game to work correctly with Voodoo cards. It ran well on my TNT2 card, but had some problems with BMP mapping and texturing on two other machines in the office, despite using the readme to fix the problems. The game has some really, really fun moments, and the ideas and design of the world shine brightly. Unfortunately, because of the complications and letdowns, the game is a disappointment overall. But with some of the depressing titles I've played over the last few months, I could do with disappointments such as this more often.  -- Vincent Lopez", "date": "Apr 8, 2000"}