{"name": "Pac-Man", "name_review": "Pac-Man Review", "ref": "https://www.ign.com/articles/2007/05/15/pac-man-review-2", "text": "Pac-Man is one of those classics that nearly everyone has played at some point in their lives. Due to its overwhelming success in arcades in 1979, the game spawned sequels, spin-offs (often unofficial), and firmly entrenched itself in popular culture. Simplicity and addiction at its core, Pac Man -- while inherently repetitive -- always delivers as a fun and rewarding gaming experience. However, this comes with one caveat: paradoxically, because of its very success, there are so many versions and opportunities to play it since its release that opting for the old NES version may not be the most prudent purchase.   For those not acquainted with the premise of the game (or perhaps also unfamiliar with the wheel or the discovery of fire), the player controls Pac-Man, a very hungry yellow blob, as he attempts to eat dots scattered about a maze -- all the while avoiding getting devoured himself by evil ghosts. By grabbing energizers at the corners of the maze, the ghosts become vulnerable and can subsequent fodder for Pac Man's snapping jaws.    Eating them in sequence yields more points, but it is not necessary for completing the level. Once all the dots are eaten, the level is cleared, and a new round begins. Unfortunately, other than the game speed increasing and the duration of the energizers decreasing, there is no variation from one stage to the next.   Of course, the game was the first of its kind and it would be silly to fault it for not having varying maze design like its successor, Ms. Pac-Man. Nevertheless, when reviewing old school releases such as this, one must look at the big picture: while a faithful port to the arcade original, there isn't anything that really beckons you to play it. There are even web-based Pac Man clones that can be accessed through the very internet browser you're reading this with. Alternatively, the controls are very tight and rewarding, so that's a plus.It's highly probable that anyone that would be interested in this latest may very well already own the game as part of a collection on another system, or perhaps even an original arcade unit.  As already mentioned, this is a truly respectable and accurate port of the original.  Yet if it's already present in your gaming library, there's really no need to get it again.  Further, much to the chagrin of purists, some even argue that Ms. Pac-Man is an all-around better game anyway.", "date": "May 15, 2007"}