{"name": "Midtown Madness", "name_review": "Midtown Madness", "ref": "https://www.ign.com/articles/1999/06/12/midtown-madness", "text": "Racing games have become a dime a dozen on the PC and, to be perfectly honest, most of them suck (just ask our very own Stephen Butts ... he's been the delegated racing reviewer for about three months because we've all gotten sick of them around the office and, well, he's the new guy so he has to take a few kicks in the belly).  Well, with Midtown Madness, Microsoft and Angel Studios has broken the mold and has offered up a lot of fun at the office lately, so much that the console freaks (specifically Matt and Craig) are starting to see the PC in a whole new light.  Midtown Madness takes place in the windy city, Chicago.  Angel Studios has done a great job of portraying a decent portion of the downtown area, with Lakeshore Dr. and I-90 forming the borders of the playing field, and there are lots of famous landmarks on the map.  Those of you familiar with Chicago will have no problem making your way from Wrigley Field to Soldier Field, and you may even want to make a stop at Navy Pier on your way.  Admittedly, some portions of the city do look very generic, but overall the downtown portion of Chicago is portrayed very accurately and the designers did a great job of mixing authenticity with smooth gameplay.   While the landscape is realistically modeled, Midtown Madness doesn't rely heavily on driving authenticity; this game's all about fun.  There are no gear ratios to mess with, no tires to pick from, no shocks to adjust.  Instead you just pick a real-world car and go.  In the early races you can pick from a brand-spankin' new Volkswagen Beetle, a stylish Cadillac Eldorado, a city bus, a super-fast Panoz Roadster, a powerful Mustang GT or a meaty Ford F-350 (which I hear is built Ford tough).  Depending on your performance during the race, you can unlock even more road-ready vehicles, like a Panoz GTR-1 racer, a classic '68 Mustang, a Mustang Police Cruiser and even a behemoth Freightliner Century Class C120 trailer truck.  Now that's real power.  Each of the vehicles drives as you would imagine they would.  The Mustang and Panzoz types are fast but fragile, the bus and trailer truck are slow but can bust through traffic jams with ease, and the Beetle and Eldorado fall somewhere in between.  There are four different ways to drive in single play.  You can take a leisurely cruise through the city, checking out the sites, or you can compete in either a checkpoint, circuit or blitz race throughout the streets of Chicago.  Except for the circuit races which make you stay on a charted course, you have free range in the city streets, so it's not always about who has the fastest car, but who can find the quickest route to the finish line while still passing under all of the checkpoints.  And there are plenty of shortcuts to find in Midtown Madness.  There are unmarked alleyways, tunnels and even a few storefronts that you can bust through.  The city of Chicago is populated with pedestrians as well as other cars who are going about their daily business as you speed around them.  Other cars will stop at red lights, use their blinkers when taking a turn and even put on their hazards when they get in a wreck.  And those of you worried about violence in videogames will be glad to hear that the pedestrians always dive out of the way of oncoming cars, so no blood is spilled in Midtown Madness.  Angel Studios has also included variable weather and time options so you can race at night in the snow if you wish, and snow will actually accumulate over time so your driving dynamics will change as more snow builds up on the roadways.   The multiplayer aspects of this game are absolutely superb and Midtown Madness has been the cause of several sleep-deprived nights for the IGN staff because we've been too busy playing to go home and bed down for the night.  You can play with eight people over a LAN or the Internet and, while we did run into a few lag issues where what we saw on one screen didn't necessarily happen on someone else's screen, the game is extremely fun nonetheless.  Somewhat disappointing is the lack of traffic in the multiplayer game, but it keeps the game running smooth and cuts down on latency as much as possible.  While you can opt to challenge other gamers in traditional racing, the most fun of the multiplayer modes are the Gold Rush matches where you all go after a big gold brick that has been dropped somewhere in the city and try to get it back to the appropriate checkpoint.    There's a lot to like in this game, but there are a few minor problems that mar an otherwise fantastic game.  For starters, when you're racing in the single play mode the cops will only go after your car, leaving the computer-controlled cars alone.  This is particularly frustrating when you're in the lead and the cops knock you into a wall ending your game.  Another problem I ran into was occasional narration skipping before the start of the race.  But these are just qualms, and there's nothing in the game that really stands out as glaringly wrong.  In the end, Midtown Madness is an entertaining racer that will keep you glued to your screen in a mad dash to the finish.  The best thing about this game is the feeling that you're racing in a real city instead of just driving around on a flat circle.  Midtown Madness comes highly recommended.  -- Tal Blevins", "date": "Jun 12, 1999"}