{"name": "Mind Quiz", "name_review": "Mind Quiz Review", "ref": "https://www.ign.com/articles/2007/05/17/mind-quiz-review", "text": "Ubisoft as a publisher has a very interesting position in the Nintendo DS market. They put out cheap versions of popular games. The kind of game that somebody's grandmother accidentally buys as a gift for little Suzy because Dogz is the same thing as Nintendogs! But what happens when the cheap knockoff game is based on a title that is already a bargain priced game? Well when it comes to the Sega Toys developed Mind Quiz, the result is a game that is about as helpful to a person's brain as that bad guy from Scanners.    Mind Quiz has the stamp of approval from Dr. Osami Kajimoto, and was supposedly developed using his Advanced Trail Making Test. The good doctor makes no appearance in the game, unlike the disembodied head of Brain Age's Dr. Kawashima. Instead, players are ~guided~ through the game by a weird little white man with a rainbow for a brain, and his dog. Guided is used loosely since neither character does much in the way of helping you. It's more like they're just always in the freaking way. In fact, a large number of the minigames center on helping the dog not die, or keeping him from going somewhere. It's ~fun~ because the dog is cute or something.    Players start the game by taking a couple tests. Well, they take one test, in three slightly different formats. Players tap numbers and letters on the touch screen, very similar to one of the Brain Age tests. The difference is that the number touching test is the only test. Somehow by how fast the player can hit numbers, Doc Kajimoto and his rainbow-brained Igor companion can figure out how big of an idiot the player is. The game throws random percentages about brain relaxation, and alertness, then tells the player how old their brain is, but not so much in the way of explanation. There are overly long descriptions that will explain about how the player's brain is dull or tired, and then give them a brain age of 23. Is 23 good or bad? Shouldn't a 21 year old male have a brain around there? But there's no time to question the results, because now it's time for exciting training to help get that poor schmuck of a brain into gear!       See, Mind Quiz attempts to make the idea of a brain-workout fun, by having players do multiple tasks at once. For instance, a few of the games involve players trying to solve simple tasks, while keeping the little mutt out of the top screen. Why did anyone think that playing with a rudimentary slide puzzle, while simultaneously babysitting an unruly dog was fun or stimulating? The games have no obvious benefit. At least with Brain Age or Big Brain Academy, basic math was involved in many of the games, so there was an obvious benefit to getting good at them. In Mind Quiz, math is rarely involved, nor is any other obvious form of mental capacity. Players sit there and tap on dogs as they run across the screen, or blow into the microphone to make the dog float in the air, or help the dog throw bones at the rainbow-brain dude. Then after it's done, the game tells the player that they improved their brain somehow. The games are sometimes poor rip-offs of Brain Age games, and other time poor rip-offs of Big Brain Academy games. For players that had trouble yelling ~blue~ into their DS microphone, imagine the frustration of having to yell ~strawberry~ and get the game to recognize it.    When Mind Quiz starts off there are only five training sessions to play. The game selects recommended training sessions to play, based on the test scores the player got that day. By completing the recommended tasks, a new game is unlocked. At this rate it takes weeks to unlock all the games, providing the player does it every day. But the fact of the matter is this game isn't fun, so doing it every day feels like a chore. It's like paying to have extra homework every day.Mind Quiz might be worth the tedium if there were noticeable results. After all, this is an educational game. It doesn't have to be loads of fun if it's turning people into geniuses! Unfortunately, it's hard to tell if the results are improving since the breakdown is somewhat cryptic. There's only one definitive result I got from this game, and I'm breaking my writing style and switching to first person to say it: After a full week of playing this game, I developed migraines. That's it. My scores never went up. In fact they seemed to decline slowly. The demon-spawn rainbow-brain man and his hell hound gave me headaches and called me stupid for a week. The smartest thing anyone could ever do is to never buy this title. And I didn't need a PhD to figure that out.", "date": "May 17, 2007"}