{"name": "WipEout XL", "name_review": "Wipeout XL", "ref": "https://www.ign.com/articles/1996/11/27/wipeout-xl", "text": "When the first WipeOut came out for the PlayStation last year it was heralded as groundbreaking by critics and gamers alike. WipeOut wasn't just a great new game, it was a cultural phenomenon. WipeOut incorporated elements of popular culture, namely techno music and designer-esque logos, into a futuristic racing game, making it at once fantastic and progressive. The result was nothing less than brilliant.  Now one year on, Psygnosis has unleashed the obligatory sequel. It's everything the original was and more. Once again, the overall presentation of the game is simply amazing. Designer's Republic, those techno album cover geniuses, have been brought back to design the weapons and team logos and they're as stunning as ever. The music is even better than the first. Instead of using in-house for the US version like the first, Psygnosis have licensed actual tracks from The Prodigy, Underworld, The Chemical Brothers, and others. They really have created a whole little world inside that rotating disc. XL has made significant improvements over the first game as well. While the first game had only four competitors at any given time, XL has 12 ships going at it. The AI has also been upgraded, so not only is the racing more competitive, the level of combat has also been stepped up. New weapons increase the combat potential, including new rockets, a smart bomb, and an ~earthquake~ bomb, that sends a tremendous ripple down the track. It has to be seen to be believed!  Also new is a damage meter that marks how much shield you have left. Any hit from an opponent's missile or heavy collision with a wall will reduce your shield. Pitting will repair the lost shield, but takes away valuable time. Not only does the pit feature add to the gameplay, it gives the game a little touch of realism. Sure, you're driving futuristic hover-crafts, but you still need to pit!  WipeOut XL is probably the best racing you can buy for the PlayStation. The graphics are absolutely gorgeous, with some of the best light sourcing and effects ever. The control is smooth, the gameplay is fast, and the music is just awesome. It's games like this that make you proud to be a PlayStation owner.", "date": "Nov 27, 1996"}