{"name": "Steel Horizon", "name_review": "Steel Horizon Review", "ref": "https://www.ign.com/articles/2007/05/18/steel-horizon-review", "text": "I have a friend in the Navy. Serving as an engineer on a submarine, his life is lived below the waves. Underwater, for weeks at a time. Sometimes months. He never gets to see the sun. I don't hear from him often, but when I have he's told me that, more than anything, he's just plain bored. He's locked up down there, in a windowless metal shell, floating with the tides and just having absolutely nothing entertaining to do. After playing Steel Horizon, I think I can relate.    We'd all expect a life in the Navy, a life lived out on the open sea commanding mighty vessels in combat, to be exciting. To be engaging, to be memorable. But it's just not the case at all. And it's not the case in this game. Steel Horizon claims to be a deep, involved strategy game based on the naval warfare of World War II. But this title has no depth at all. Or, at least, none you'd still be awake to discover, if and when it surfaced.    The game casts you as a captain. You're the son of a famous officer, introduced to your first command in the middle of the Allies' legendary conflict against the German and Japanese Axis powers over six decades ago. You get to choose your fleet's flagship at the start  either a battleship, a destroyer, or a submarine. The choice is an important one, as your flagship is the only vessel you're allowed to upgrade and modify as your campaign marches on.    Your campaign, then, gets underway with a string of slow-paced, simple missions that play out more like tutorials. It's a bit odd and frustrating, as the game offers an entirely separate tutorial mode that new players can check out to learn the basics  once you've started the campaign proper, you'd probably like a bit less hand-holding and a bit more action. Hand-holding's what you get, though, as your second-in-command and your off-site commanding admiral chime in at every possible opportunity to tell you what to do and when.    You don't have a lot of actions to choose from, anyway. Steel Horizon's gameplay plays out on a grid of squares, as you shift your ships around each stage's locked-in area engaging enemies, capturing port cities and defending the lives of your sailors. Grid-based strategy is familiar to players of titles like Advance Wars, but Steel Horizon does a few things differently than that game  individual units, for example, are really groups. Each one can contain up to eight different ships, mixed and matched between a variety of vessel types or sailing with a solid compliment of eight of the same. How you fair in battle can greatly depend on the make-up of your unit groups  if you have one unit made up of eight battleships, it will prove much more intimidating to enemies than a slapped-together group with a single battleship, two subs, four hospital boats and a cruiser.       Once a battle begins, Steel Horizon's style of play takes a sudden shift. The turn-based grid goes away, replaced with a real-time radar. This is where everything falls apart. The positioning, movement and exploration aspects of Horizon's turn-based half are simplistic, but they work. The real-time battles, though, are a convoluted mess. Your ships are entangled in a mashed-up melee of explosions and jetting torpedoes, and it's incredibly difficult to even tell what's going on. You're given some control over the chaos, but issuing movement and attack focus orders seems to do very little to effect the outcome of each engagement. The battle ends when one side's ships are all sunk, or after 60 seconds have passed. Either way, you're left scratching your head.    The graphics do little to calm the madness, only adding to the frustration with their unattractive ship models and environments, and severely lacking, overly pixelated explosion effects. Horizon's visuals are muddy at best, and though the swinging camera featured during combat sequences is smooth, it serves little purpose. It's hard to tell the difference between all of your look-alike, same model ships, and inconsequential anyway when the battle ends itself in less than a minute.    If you overcome the frustrations of the interface, don't mind the poor presentation and can stand the non-player characters' unnecessary and overbearing advice, Steel Horizon does offer a fairly lengthy campaign with a decent story. And, redeemingly, the game offers some more fun in its multiplayer mode, as having a human opponent in control of the opposing fleet makes the experience much more like the game of high seas chess it must have originally been envisioned to be. Horizon's wireless requires each player to have his or her own game card, though, and your friend might not be your friend much longer if you trick them into buying this one.   Steel Horizon has come to the Nintendo DS from Konami, a trusted, long-time publisher on Nintendo systems known for the quality of its catalog. But the house that brought us Castlevania and Lunar Knights lost its way this time. Steel Horizon's set-up had the potential to offer solid, straightforward naval strategy, like playing chess with an aircraft carrier instead of a rook and bishop. But the battles are just a mess, marring any aspirations of the game's simple, but workable turn-based half of play. We'd expect more from Konami, and you'd expect much more if you played this game. So don't waste your time  life in the Navy is just too boring.", "date": "May 18, 2007"}