{"name": "Meet The Robinsons", "name_review": "Meet the Robinsons Review", "ref": "https://www.ign.com/articles/2007/05/18/meet-the-robinsons-review-2", "text": "Movie games don't have to be good. While it may be sad, the consumer public has accepted that when a videogame is based on a movie, it will likely be mediocre at best. Time constraints, budget, big, heartless, corporate publishers, whatever the reason, people don't get their hopes up. But when the guys at Altron manage to make a game, based on Disney's latest CG film Meet the Robinsons, that actually looks, sounds, and plays well, there's hope. Unfortunately the game barely lasts longer than watching the movie. Shame Altron doesn't have a time machine to fix that.    The Meet the Robinsons game's plot differs dramatically from the movie's. Whereas the film focused on Lewis' adventures through time, the game stars future-kid Wilbur Robinson as he tries to stop the evil Bowler Hat Guy from changing the future. As Wilbur tries to chase Bowler Hat Guy through the past, he inadvertently causes a ripple effect that messes up the future, forcing him to go back and fix it. The game's levels are the various terrible futures Wilbur accidentally creates. The story is actually just as, if not more interesting than the movie's plot, and has a very Back to the Future feel to it. It is a little weird that it doesn't match the film's story, which could cause some confusion for youngsters, but the overall effect is an original game that isn't predictable to people that saw the movie.    Meet the Robinsons is a pretty basic 3D run-and-gun style game. There aren't a lot of platforming elements to speak of. Wilbur jumps automatically when he runs off the edge of something. The focus of the game is more on the destroying of robots and upgrading various gadgets. There is a surprising amount of depth with the gadgets. Players can unlock new items by finding character cards scattered around the levels. The items can then be upgraded to three different levels by collecting gems found in nearly every area. It would have been nice if they made more of the gadgets integral to the game. There are only a few that players really need, and only three can be equipped at a time, so there isn't a lot of incentive to switch them out. Still it's nice to have the option to switch up the way the game is played if the mood arises.    The action stays fast paced during the game, due to the enemies constantly respawning whenever the player enters an area. If the player dies, Wilbur is sent all the way back to the start and has to fight his way back. It can be an annoyance that the levels don't have checkpoints, but they are easily traversed, despite their large size, so it doesn't take long to get back. Plus it's going to be rare that players even die. The enemies are fairly easy, especially after upgrading the weapons, and health pickups are scattered all over the levels. It keeps the difficulty at just the right speed for the target audience. There's plenty of action and gunplay (with robots, so no death), but it's easy to stay in control. The top screen constantly displays the player's current mission, so he or she knows exactly what to do at all times.    While players can run around and shoot robots all willy-nilly, the developers have also included a lock-on system that makes use of the DS' touch screen. By tapping an enemy, Wilbur will lock on to it, strafing in a circle as he fires. It's definitely helpful, since the camera is controlled by the L and R buttons and can be a little slow sometimes.       Meet the Robinsons makes good use of 3D, and actually rivals many of the other 3D DS titles on the market. The weapon effects are very cool, and the character models, however few there are, move fluidly. Wilbur runs, shoots, jumps and rolls with grace that many N64 games couldn't match. The framerate stays up even during the action sequences, and the environments are colorful and detailed. There aren't very many different elements to the levels, so they repeat themselves over and over, causing the later levels to feel very similar to the first few.    Not that there are many levels to even make a comparison. Meet the Robinsons comes in at around a criminally short five and a half hours of gameplay. There are five levels, and they're all pretty easy to beat, making the game just whiz by. It's a shame too because for a movie game, this one is one of the better ones out there. Meet the Robinsons is a really surprising game in the sense that it doesn't completely suck. See, it's a game made about a family film that doesn't follow the film. It starts one character, and it's really simplistic. Yet somehow the guys at Altron managed to make a game that is actually pretty fun. They just needed to make more of it since Meet the Robinsons is, at best, a half a day game. There could easily have been more there with the whole time travel storyline. It's tough to say whether Meet the Robinsons is worth buying, even for someone that really enjoyed the movie. For a tyke that is itching to shoot up the place, but has parents that don't want the bloodshed it may be a just the thing. Kind of like the Robinsons themselves. Nowhere near perfect, but still delightfully fun.", "date": "May 18, 2007"}