{"name": "Battleship / Connect Four / Sorry / Trouble", "name_review": "Battleship / Connect Four / Sorry! / Trouble Review", "ref": "https://www.ign.com/articles/2007/05/18/battleship-connect-four-sorry-trouble-review", "text": "Rivalries rarely last. The game industry is proof of that, as companies can be archenemies one day, and handshaking partners the next. Even Mario and Sonic have buried the hatchet, and are scheduled to appear in a game together soon. Yes, rivalries, now matter how heated, always come to an end  even between such timeless brands as Parker Brothers and Milton Bradley. Talk about the game industry, those two names were almost the entire game industry by themselves, years before video games caught the public's eye. Parker Brothers brought the world such games as Risk, Clue and Monopoly. Milton Bradley had Candy Land, Scrabble and Axis & Allies. For years they warred against each other, until, inevitably, the conflict concluded. A ceasefire was signed, and both brands are now owned and operated by Hasbro.    Making a game compilation like this one possible. Battleship / Connect Four / Sorry! / Trouble brings together four classic board game favorites, two apiece from each of the old rivals' libraries. All four are fun and timeless designs that lend themselves well to casual, on-the-go play on the DS. And, combined together, they make a worthwhile collection that merits some consideration for players who might like a break from other, faster, louder gametypes.    Sorry! and Trouble are the Parker Brothers contributions, and are two different takes on the same idea  it's you against up to three others, taking pieces around a circular track from a starting point to a home zone. Trouble is the simpler of the two, as movement is controlled by a single die encased in a plastic bubble. Roll a six to launch a piece onto the track, then try to take it all the way around the circle without any of your opponents' pieces landing on it and sending it back to the start.    Sorry! is more complicated and strategic, as the game is controlled by drawing cards from a deck. The cards instruct you when you're allowed to launch a piece, when to move and how far, and can also send your opponents' pieces sailing back to the beginning, even when they're just inches away from the safety of the home zone. It's part luck, but also part strategy, as several cards give you a choice between different actions. Sometimes it's the smartest move to send one of your own pieces backwards.    Both Sorry! and Trouble use the upper screen of the DS for a 3D view of the board and the pieces moving around it, while the touch screen presents a static 2D layout of the full playing field. The presentation is suitable, visually, but the audio cues can be annoying  a too-excited announcer calls out the name of each color on each turn, and little sound bites like taunting laughter and ~D'oh~ exclamations are peppered throughout to reinforce in-game events. These, thankfully, can be turned off.    Connect Four comes from Milton Bradley, and is the most limited game, visually. There's not a lot to work with, though, as the game's set-up is a simple, yellow grid and a handful of black and red checkers. You take turns against another player, dropping your color of checkers into one of the columns in the grid, from above. The object is to complete a sequence of four of your color in a row, either horizontally, vertically or on the diagonal  while at the same time making sure your opponent doesn't accomplish the same. It's an easy concept to grasp, but the game can be more strategic than you might first realize. This digital version reinforces that, as the AI opposition seems strongest and smartest in this game, as compared to the other three on offer.    And, finally, Milton Bradley's Battleship. The classic game of grid-based naval combat gets top billing in this collection's title, and rightfully so  it's the oldest and most venerable of the four. It's also the one of the four to have also appeared in past Destination Software collections on Nintendo portables, even as recently as the holiday season of '05. Then, it was a part of Monopoly / Boggle / Yahtzee / Battleship, and its presentation was lacking. This time, it's much improved.       Battleship has risen to the top in this DS encore by way of a strengthened look and feature set. The game plays the same  you set up five ships on a grid, then take turns with another player or the game's AI launching missiles at each other's array of squares. You win when you've successfully found the hidden location of each of your opponent's five vessels and taken them out with multiple strikes. Some ships go down quickly, like the patrol boat, which can suffer only two hits. Others are bulkier, though, as the largest can sustain five blows before sinking.    Battleship's look is improved over its previous appearance on the DS, as now board-to-board combat takes place in full 3D, with missiles launching and arcing over the gap between the players' boards and landing in the opposing ocean. You can choose from four different admiral avatars, and choose to either directly place each of your ships yourself or have them set for you, randomly. The most notable upgrade over the '05 edition, though, is the new inclusion of Salvo Mode. Also known as Speed Play, Salvo Mode lets you launch one missile each round for every ship you still have afloat. The alteration gives Battleship much more strategy and immediacy, and makes playing it a lot more fun.    All four games have proven their staying power over the years by their continued popularity in traditional, physical form. And all four translate well in digital interpretation here on the DS. Not so easily translated, though, is the spirit of human competition. For such simple games, you'd expect that single-card multiplayer might be included. But, it's not. Destination Software's previous collection headlined by Monopoly offered at least some single-card play, but this time around every player will need his or her own copy of the game, for every included title. Battleship / Connect Four / Sorry! / Trouble retails at a budget-minded MSRP of $19.99, making it a bit less of a blow to consider investing in multiple copies, but the extra effort to make the games run off just one card would have added a lot of value to this package. It's great to see a set of games like this come together, from two different companies, with a long, storied history of competition against each other. And it's great that the selection is strong  Battleship, Connect Four, Sorry! and Trouble may not all be board games on the A-list, but they're all certainly solid titles. The presentation that brings the four together is equally solid  still not spectacular, but certainly improved over past compilations we've seen from this publisher. It would have been nice to see more effort go into making multiplayer a priority, as being able to play some of these classics through Nintendo Wi-Fi Connection or even just running local wireless off a single card would have made this release much more attractive. But as it exists, this one's still worth consideration. As a casual break from other DS titles, or as a simple gift for DS-owning friends.", "date": "May 18, 2007"}