{"name": "Bakuretsu Muteki Bangaioh", "name_review": "Bakuretsu Muteki Bangaio (Import)", "ref": "https://www.ign.com/articles/2000/04/11/bakuretsu-muteki-bangaio-import", "text": "Remember when you first played Sonic Team's NiGHTS: Into Dreams?  Come on, be honest, you were just a bit on the disappointed side, weren't you?  It wasn't clear, after all, what you were ~supposed~ to do.  In fact, comments from Sonic Team suggested that you weren't necessarily ~supposed~ to do anything.  You could play the game any way you wanted.  Of course, that wasn't true.  We all know the real way you were supposed to play through NiGHTS, and when you first connected an infinite link (probably in Eliot's Snow Dream), you realized Sonic Team's brilliance.  Suddenly, the game had a whole new meaning, despite the fact that prior to your revelation, it hadn't seemed like anything beyond just a free-roaming 2D flight game.  So, I'm playing Treasure's latest, Bakuretsu Muteki Bangaioh on the N64, and I'm of the opinion that while a pretty unique shooter, it just doesn't really come together into a classic gaming experience.  You pilot the Bangaioh, a super-powerful robot, through 40+ stages of free-roaming 2D shooting, with your goal in each level to find and destroy the boss.  Along the way, you run into opposition from various enemies, ranging from gun turrets to opponent mechs, and when you're not shooting down these aggressive enemies you can also blast buildings, cars, and basically anything lining the levels.  In addition to shooting in all directions, you have available to you two modes of fire, Mami Mode and Ricky Mode.  The former fires straight laser blasts that repel off walls, while the latter launches heat seaking missiles.  It sounds like a pretty generic shooter, and I made my way through half of the N64 version of the game and a few levels from the Dreamcast game thinking that while certainly a solid title, Bangaioh wasn't really anything special, certainly nothing on the level of a Gunstar Heroes or Yu Yu Hakusho.  And then, I saw the light.  Literally.  I was playing through, I believe, level ten, and I made so many things simultaneously blow up on screen that for a few moments, everything became flooded by white.  It was the most confusing moment I've ever experienced in a game, but boy was it incredible, similar to that first huge link in Nights, or maybe the first time I connected an extended aerial rave move in X-Men VS Street Fighter.  I suddenly understood just what Bangaioh was all about.  Making the screen fill up with explosions is one of the main parts of the Bangaioh experience, and if you can't do that every now and then, you're not playing the game correctly.  In fact, the game keeps track of the number of simultaneous explosions going on around the screen, and when the number reaches around two hundred or so, the text displaying the number triples in size.  For each one hundred simultaneous explosions, you're awarded an energy item which restores a bit of your energy, and it's placed where the one hundredth explosion occurred.  Get five hundred explosions on screen simultaneously, and the explosion meter lights up with ~MAX!~, and you're awarded with an invincibility item.  It's pretty obvious what Treasure was hoping you'd do in this game.  So how exactly do you go about getting all these simultaneous explosions?  By destroying a huge number of enemies and other objects, of course.  A shooting game isn't really a shooting game without a super-bomb feature of some sort, and Bangaioh is no different.  Treasure has made the Bangaioh bombing feature so innovative, though, that it's probably the central area in the game.  In the Dreamcast version, the Bangaioh has a bomb meter that functions like a super meter in a fighting game, in that it slowly fills up as you strike enemies, and it goes through a maximum of five levels in power. In the N64 version, the bomb meter fills up by collecting the fruit left behind by buildings and cars, but there are no levels.  When you release a bomb by tapping the right shoulder button, shots blast out in all directions from the Bangaioh, and you loose one level on your meter.  The trick involves the number of shots that fire out from the Bangaioh when releasing a bomb.  You'll always release a minimum of forty shots, but that number will increase to as much as four hundred depending on the number of enemies in your immediate surroundings.  If you can time the attack so that you're completely surrounded by enemies, you'll fire hundreds of shots and take out just as many enemies.  There are also those rare moments where you'll get so many enemies in your immediate surroundings that you'll release the maximum number of shots - a momentous occasion, to be sure, and Treasure's made it all the better by making the screen dramatically stutter.  Boy does it feel good.  Isn't that amazing an amazing idea?  You're basically being rewarded for holding your fire until you're about to be attacked.  In many cases, that's the best way to make the most number of explosions occur on screen, and you'll probably find yourself doing some apparently silly things, like letting yourself get surrounded by enemies, risking death with each moment.  The game is intense for those who play it trying to make it intense - just as NiGHTS is one of the most intense experiences in the gaming world, but only if you play the game with L-I-N-K-S stamped on your forehead.  There are actually other things to Bangaioh beyond just the explosions, though.  You'll find puzzle elements, where you need to figure out how exactly to progress through a level, and various other bits of brilliant level design that make perfect use of the Mami and Maxi modes of play.  Consider the whole super ultra bomb thing to be the frosting.  Sure, the cake would be okay without it, but with that one element above it, even Betty Crocker would be proud.  In moving the game from the N64 to the Dreamcast, Treasure has changed a few things here and there.  In addition to the obvious graphical upgrades (the comparison pics below show just how dramatically improved things are), and the updgrade to CD quality sound, giving the game one of the coolest soundtracks around, the gameplay has been modified considerably.  You're still moving the Bangaioh around, taking out enemies, and unleashing bombs, but the rewards for huge explosions are different now.  In the N64 version, getting a one hundred combo would bring up a menu allowing you to select a power up to either raise your weapon power, your weapon lastability, or gain back a bit of energy.  As mentioned above, the only thing you're rewarded with in the Dreamcast version is the energy.  It turns out that the power ups have been eliminated from the Dreamcast version entirely, and while I do miss them, playing the game without them makes for a harder experience.   What has remained the same in both versions, as with all Treasure games, are those things that have made myself and many others die hard fans of the group of ex-Konami developers.  The characters, from the hero Ricky Maxi and the heroine Mami Maxi all the way to the various villains, are first rate designs, and they hold the typical Treasure wackiness that we've come to expect.  Although the DC version features a few extra voice samples, and a few frames of extra animation for their in-game pictures, the N64 and Dreamcast versions are very similar.  You'll find the same still-frame intro, with the same exact pictures, as well as the two pictures for when you complete a level.  The in game cinematics, when you speak to M-Ko and a new DC-exclusive character, are the exact same, complete with the pixelization for the zooming still frames.  But, you're probably not going to care too much about these presentation problems, when you're having the time of your life making billions of things explode on screen.   Some have said that Bangaioh is one of those love or hate games.  I beg to differ.  For fans of action-shooting, Bangioh is a game that you either love, or just don't understand yet. The Dreamcast version is slightly superior to the Nintendo 64 one (especially in price), but overall, the gameplay experience and fun they deliver are virtually identical.", "date": "Apr 11, 2000"}