{"name": "Ultimate Board Game Collection", "name_review": "Ultimate Board Game Collection Review", "ref": "https://www.ign.com/articles/2007/05/21/ultimate-board-game-collection-review-2", "text": "Recent board game iterations on Xbox Live Arcade have been successful, and the Nintendo DS has the most excellent Club House Games, so it is only fitting that the PSP have its own collection of digital parlor games.  We wish we could tell you that Ultimate Board Game Collection was the perfect anthology for the PSP, but unfortunately it's a poor man's Club House Games that lacks a compelling single-player experience.  Publisher Valcom brought the collection to the PlayStation 2 last summer, and while the PSP version doesn't fare as badly, there just isn't enough content to warrant playing most of these games more than once.   Ultimate features 24 well- and lesser-known games divided into five categories:   All-Time Favorites - Backgammon, Checkers, Chess, Chinese Checkers, Reversi  Words & Numbers -- Anagrams, Dice, Kakuro, Sudoku, Word Cubes  Puzzle Games -- Concentration, Enigma, Jigsaws, Mahjong  Family Favorites -- 3-D Tic-Tac-Toe, Naval Battle, Parcheesi, Quattro, Snakes and Ladders  Strategy Games -- Dominoes, Go, Mancala, Gomoku, Shogi   Most of these titles are time-tested classics that people have played for ages, and a handy tutorial can be accessed at any time for the games you're not familiar with.  The problem is that most of them are multiplayer-centric and Ultimate Board Game Collection doesn't provide enough incentive to play in single-player mode against the computer.  Games like Parcheesi are extremely simple, and without the camaraderie that comes with playing against another human being you're stuck watching the computer spin the wheel and move its pieces around the board (whee!).  Developers A.I. Factory and Mere Mortals could have made the experience more engaging by providing some eye candy, but the entire presentation is bare bones with very generic visuals.  Luckily, load times are acceptable and getting into and out of a game is a breeze.   The sound is another area the developers didn't spend enough time on, as the entire soundtrack consists of a handful of short tunes that cycle over and over.  While some of the tunes are catchy and distinctive, they're all around 30 seconds long.  So playing a game is like listening to the same four or five song samples in the iTunes music store on repeat.  Thankfully, Ultimate supports custom audio tracks, so you can play your own mp3s off your Memory Stick Duo.  Jigsaws and Concentration allow the use of personal photos, so you can use your own images to spice up the bland atmosphere.   Ultimate Board Game Collection includes at least one standout game: Dice.  Players roll dice to create hands as in poker.  But each roll must be assigned to a hand, so you'll have to strategize and decide which hand will give you the most points for that particular roll.  Gameplay continues until all hands are assigned a roll and a score.  Dice is the one game in Ultimate that provides a satisfying single-player experience.    There is a trophy system that aims to provide some incentive for playing single-player.  Like achievements on the Xbox 360, each trophy must be unlocked by completing a specific task: crown three pieces in a game of Checkers, for instance, or promote a pawn in Chess.  But players don't receive anything for unlocking trophies, and there aren't any leaderboards with which to share your accomplishments, so the feature fails to provide much motivation for playing alone.   Ultimate Board Game Collection does become more enjoyable when playing multiplayer, and game share is available for five of the titles if your friends don't own the game.  If they do, ad-hoc wireless mode allows every game in the collection to be played multiplayer.  But most of these games are aimed at children, and kids are more likely to own a Nintendo DS than a PSP, so we have to wonder who the Ultimate audience might be.This game could prove enjoyable to younger kids who don't know any better.  But for most of us, there are better casual game collections with more compelling titles and more of a balance between single- and multiplayer.  With the exception of Dice, these games are likely to put you to sleep.", "date": "May 21, 2007"}