{"name": "Metroid 2", "name_review": "Metroid 2: Return of Samus", "ref": "https://www.ign.com/articles/1999/06/15/metroid-2-return-of-samus", "text": "Many of you will have heard of this game, it being a member of one of Nintendo's big-name series. In terms of popularity, the Metroid franchise is right up there alongside Mario and Zelda, and is also the one that is crying out the loudest for a 64-bit update. This, though, is -- unusually -- a direct sequel to the NES original, following on immediately from bounty hunter extraordinaire Samus Aran destroying the Metroid mother-brain. More of the lethal aliens have been found on what is believed to be their home-planet, Zebes, and it is up to you, as Aran--- probably the first major role of a woman in a video game, incidentally -- to hunt them down.  At an immediate glance, you'd be forgiven for thinking that this is just another platformer with guns in. It is, however, a much tenser, more exploration-intensive affair than other efforts, filled to the brim with secrets and extra items, plus that typical, elusive, Nintendo sheen.   Features  Single player only. One HUGE world, loosely split into several .stages. Three different endings. Plenty of extra moves to find.  Brilliant sense of atmosphere.  Lots of hidden passages.  On-cart battery back-up.   The Game In what is a refreshing departure from the norm, this game has only one large -- very large -- level. It contains numerous dark, spooky-looking tunnels, inducing a brilliant feeling of claustrophobia as you make your way deeper below the planet's surface and into the alien's lair. You start off by your ship, which you can return to at any time for a quick energy and missile top-up, but from then on you are pretty much on your own.   However, some of the tunnels and passageways are blocked by what looks like lava. Every so often though, you'll bump into a Metroid or two (they are in addition to the normal, standard enemies -- in what is a nice touch, a counter at the bottom tells you how many Metroids remain in the game), each one at a different stage of development. The ones near the start are small and just try to fly into you; later on they become huge and can shoot fire. Pressing 'select' will switch to your missiles, and killing the Metroids you encounter in one section of the game will cause an earthquake and clear the surrounding tunnels of the lava, allowing you to penetrate further. In this way the game is loosely structured into several maze-like stages.   At the beginning, all your wimpy-looking figure can do is jump, shoot, and roll along the floor as a small ball, the controls proving extremely responsive. This is where one of the game's best factors comes into play -- the areas are extremely exploration-intensive, each nook and cranny searched rewarding you with something new. If you look hard enough then you will find all sorts of upgrades -- a spinning jump attack; mines that you can drop as you roll; a special suit that can absorb twice as much damage; an ice-beam that freezes your enemies into extra platforms. There are so many new abilities, and the best thing is that you don't have to find them all. More pickups will increase the amount of missiles you can carry, or add an extra length to your energy bar. In this way it is very much like Zelda, exhibiting many of the exploration and character-developing features that makes that series so popular.    The graphics here are slightly average, which doesn't come as much of a surprise when you consider the game's age. Though there is some variation, the walls are too ~samey~, resulting in much confusion as you wander through identical tunnels in a vain attempt to find out just where on each you are meant to go next. Most of the time the background is a simple black, but occasionally some organic-looking tendrils and vine-like formations make an appearance. You might say that the game looks too sparse too often. However, on the other hand the bleakness helps to maintain a superbly tense atmosphere, really making you feel as though you are all alone in a dark, alien world -- along with a story line straight from the Alien films, this gives the game a great feeling that you cannot find anywhere else on the console.   The sprites are a different story, being both large and well animated, Aran especially. The game also looks extraordinarily beautiful when played on a Game Boy Color, despite the fact that it was made in black and white. The colors are sharp and varied; the sprites are yellow and red, the water a light blue, and the walls a deep, organic turquoise. Overall the visuals suit the game very well, despite being a tad plain.    Sound can best be described in a similar way to the above. A lot of the time there is no music, just a steady beat, but when you get into certain areas a slow, moody tune begins to play in the background. Towards the beginning you will hear a light, adventuring melody, which is quickly replaced by darker samples, becoming urgent and fast-paced as you encounter a Metroid. It's strange, but once again the lack of aesthetic detail boosts the game's distinctive atmosphere no end, the music playing at just the right times. The sound effects are good too -- the gun sounds meaty, and the aliens make nice noises as they die. This has to be the only Game Boy game that I could genuinely describe as tense.    The game also has a lot of gameplay value, due in no small way to its impressive non-linearity. Once you are in each 'section' you can search in any direction and kill the Metroids in any order that you want. Though it is advisable, you don't even need to find half of the items or upgrades to finish the game, and because of this the game plays perfectly. You won't explore for ages because you have to, but because you want to, and the sense of reward that you'll feel when you find something is boosted because of this.   It is fun going around shooting things mindlessly too, and the shock that will run through you as you bump into the Metroids and watch them throw themselves at you (and morph as they do so) is great. The blandness and the creepy music all add together to create a superb game with a masterful atmosphere. My only complaints are that it can get a little tedious slogging back through cleared sections, and the devious design ensures that when you first rush out to explore a new area you will get lost. Despite this, it is such an easy game to play and get drawn into.  There are also three endings, depending on how long you take to get to the end. This ensures longevity, especially as you must complete the game in less than two hours to see the best ending! To do this you will need to know the whole game inside out, which, considering the size of the thing, is no easy task. This is a very good game, full of the renowned Nintendo magic: a classic in many ways. It is also very cheap, so if you manage to find a copy then there is no excuse not to buy it. It has great gameplay, heightened by the superb suspense and tension, and a lot of replay value. Go get it!", "date": "Jun 15, 1999"}