{"name": "Pirates of the Caribbean: At World's End", "name_review": "Pirates of the Caribbean: At World's End Review", "ref": "https://www.ign.com/articles/2007/05/22/pirates-of-the-caribbean-at-worlds-end-review-4", "text": "It's blockbuster movie season and you know what that means -- it's mediocre licensed videogame season. Spiderman 3 is a disappointment and Shrek the Third is a real troll. Before we get to Surf's Up, Transformers, Harry Potter, Fantastic Four and Ratatouille, we have Pirates of the Caribbean: At World's End, hitting theaters this week and swashbuckling its way on to the Xbox 360 and the PlayStation 3.    It's a shame we have to lump At World's End in with the typical crappy-movie-game set because the universe that Disney and Depp created should provide excellent subject matter for videogames. We have giant squids, cannons, pirate ships, sword play, giant whirlpools and enemy hammerhead shark people -- it's all there. And while At World's End does a fine job of capturing the essence of the films, the repetitive gameplay drags down what could have been a fine effort from Disney Interactive Studios and developer Eurocom.    This isn't as fun as it looks. At first glance, At World's End is a gem, a treat to look at. Some of the environments look downright perfect like the lush, green Port Royal and the decks of the Black Pearl. The character models were created with the help of Industrial Light and Magic and are some of the best we've seen: Jack Sparrow, Elizabeth Swann and Will Turner are striking, and Davy Jones is slimy and creepy. They move well too, with a smooth animation system that works just as well in the middle of a vicious sword fight as it does with the subtle bobbing of Sparrow's dreadlocks. As for framerate, the 360 version runs smooth, while the PS3 is a jaggy mess that chugs along in slow motion.    The sound is well done, for the most part, with a cinematic score that sounds as if it's ripped straight out of the films, and sound-alike actors that do a serviceable job of not only Depp and Bloom, but minor characters as well like Barbosa, Rigetti and Pintel. The sound effects themselves become annoying in about three seconds as the sound of swashbuckling as been reduced to constant moans and groans. Still, the atmosphere, the look and the score really pull you into the Pirates universe -- a treat for fans of the film. Disney even managed to capture the whimsical, over-the-top mannerisms of Jack himself.   At least the character models look great. Unfortunately, that's where the fun ends. The gameplay is a mix of mindless collecting, mindless combat with touches of simple platforming thrown in for good measure. A typical mission is Port Royal, where you run around the town trying to find Wanted posters of Will so you can rip them down. After finding the last poster, you'll have to fight through a handful of Redcoats by hitting the attack button over and over again. As you do so, Jack will start to parry with the enemy until the enemy is somehow stunned and inexplicably turns around and stares at the ground. At this time, Jack can finish him off by punching him in the back of the head or slicing him once more. This is fun for about the first four enemies and you realize that this is the base of the entire combat system.    You can grab enemies and throw them around, sometimes out of windows or off the side of the Pearl. You can punch them in the face and knee them in the family jewels. You will occasionally throw daggers, grenades and fire a pistol. You can build up a swordsmanship meter to unlock special finishing moves that are vicious. Each character has their own set of four moves, but they too become monotonous as the game moves forward. It's someone strange that you fill the meter by using non-repetitive combat, but the entire combat system is repetitive. After battling countless numbers of generic foes, you then take on a boss in duel mode.     The duel mode could have been an exciting swashbuckling mini-game. Instead it's a slow motion gimmick in which you jam up and down on the stick to counter your opponents' thrusts with slow-motion thrusts of your own. No, the combat in At World's End is basic hack and slash with a pirate's accent. Arrrrrgh!   There is some decent platforming -- dodging poison darts on an island filled with cannibals; avoiding the kraken tentacles as you balance on beams in the hold of the Pearl; climbing the rigging of the ships up to the crow's nest. Still, it's all very basic and lacks the panache of Ninja Gaiden wall jumping. Another strange fact: Jack Sparrow apparently cannot swim. If he falls into the sea it's game over.   You will kill this guy a million times. Sixaxis control on the PS3 is limited to tilting the controller as you balance on the beam, which is done simply and easily with the left stick on the 360. Still, any fun that could have been had on the rigging of a ship or cave-jumping in the islands is marred by silly collection quests in which you, for example, have to find five bottles floating around a desert for no apparent reason whatsoever. If Johnny Depp has to undergo lame collection quests in the flick, At Word's End is in a lot of trouble.   As for multiplayer, you can jump in on two-player duel mode locally, unlocking characters and locations from the single-player game. You may also play six levels cooperatively or competitively as you try to kill all the generic enemies -- but this time on split screen! Sadly, it's probably more fun to swab the decks on a Singaporean dung heap. Pirates of the Caribbean: At World's End has the atmosphere and look of a great pirate game, but that's about it. While the sound and characters help capture the essence of the Disney trilogy, the shallow gameplay is too much to endure for the seven or so hours it takes to complete the game. Let's put it this way: if came down to playing this game for seven hours or walking the plank, it would be a tough choice. Save your hard-earned cash for a barrel of rum and consider a rental.", "date": "May 22, 2007"}