{"name": "Taito Legends Power-Up", "name_review": "Taito Legends Power-Up Review", "ref": "https://www.ign.com/articles/2007/05/23/taito-legends-power-up-review", "text": "The compilation is nothing new to the PSP. If you get the urge to play a throwback title, SEGA Genesis classics, the entire run of Metal Slug and a plethora of arcade favorites from Midway and Namco are waiting for you at the local game store.   Now, Taito Legends Power-Up wants to come home with you too.   Packed with 21 classic games such as Space Invaders, CamelTry and Elevator Action, Power-Up brings an additional four revamped titles to a UMD near you with some pretty positive results.   My sword's bigger. To begin with, the D-Pad and the PSP face buttons are as responsive -- if not more so -- than their classic counterparts, and the scheme is customizable. If you don't dig square being the primary action button, you can reassign the controls on the fly for each of the games. If you don't like the screen being centered on the PSP display with dead space on the sides, you can rotate the image to be centered or stretched lengthwise on the widescreen. If the game screen isn't a traditional arcade cabinet size, stuff such as Legend of Kage, you can keep it centered, make bigger and stretch it to take up the whole display.   With the sheer number of games in Power-Up, it's easy to run the gamut of subject material. Elevator Action has the main character racing to the ground floor while shooting it out with black-suited bad guys, Qix has you drawing boxes and avoiding moving obstactles, and Ki Ki Kai Kai casts you as a priestess out to repel ghosts, but the action doesn't end there. The Power-Up also includes: Space Invaders Part 2, NewZealand Story, Crazy Balloon, Chack 'n Pop, Lunar Rescue, Phoenix, Balloon Bomber, Alpine Ski, the Fairyland Story, Rastan Saga, Raimais, Kuri Kinton, Space Dungeon,  Space Chaser and Return of the Invaders.   The four revamps -- Crazy Balloon 2005, Balloon Bomber 2005, the Legend of Kage 2005 and Cameltry 2005 -- stay true to the source material while mixing in brand new visuals. Crazy Balloon 2005 has new obstacles for you to maneuver your rubbery friend around, and Kage still has you brawling with ninjas in a side-scrolling adventure. Each looks polished, but the jump in generations seriously handicaps their difficulty. Whereas the original Balloon Bomber was a race to take out falling bombs before they eliminated the landscape and left your tank stranded, Balloon Bomber 2005 is a cakewalk of scooting underneath falling obstacles and taking out the enemy.   Although they vary, load times aren't a problem in the title. You can get to most of the games within about 15 seconds, but more detailed graphics and controls such as the ones in Kuri Kinton take about 20 seconds while Legend of Kage 2005 took about 30 seconds to get to the title screen and an additional seven to get to the first stage.   Which way do I go?! However, the biggest sticking point with Power-Up is the promise of multiplayer action and the complete failure to live up to that promise. If you were skimming Power-Up's box in the store, you'd think you'd found a PSP standout. The back cover boasts PSP headset support, GameSharing and Wi-Fi compatibility.   Immediately, images of playing your buddy in a cross-continent game of Space Invaders while chatting it up about the day's events spring to mind, but they're dashed when you go on to read ~ad-hoc.~    I'll let you digest that for a second.    According to the game's box, you can only play with a friend if you're in the same room, but you can use the headset. Maybe you keep chatting if one of you goes to the bathroom or to make a sandwich or something. However in practice, even that limited ad-hoc/headset idea falls apart. When Destineer says ad-hoc, it means GameShare. You can send a buddy one of the 21 arcade games, but the catch is you can't play them in said arcade game. You send it, your friend gets it, and your interaction is over. They play their level, and you can do whatever you want. If you actually want to battle a bud in a two-player mode, you've got to pass one PSP back and forth.    Are you kidding me? That's not a bad feature or way to play, but the box alludes to so much more. Where does the headset figure into this combination? I tried everything I could think of, and my tests point to the headset only being compatible as earphones. If you've been looking for these arcade titles, Taito Legends Power-Up is worth your $20. Each of the games runs smoothly, features crisp controls and should satisfy anyone who has been aching to play Lunar Rescue on the bus. However, the fudged features and in-room only multiplayer are big issues considering that there's a handful of compilations out there letting folks play each other online at will.", "date": "May 23, 2007"}