{"name": "Ratchet and Clank: Size Matters", "name_review": "Ratchet & Clank: Size Matters AU Review", "ref": "https://www.ign.com/articles/2007/05/24/ratchet-clank-size-matters-au-review", "text": "After the excellent Daxter PSP outing last year, it's now Ratchet & Clank's time to shine on handheld. No bug busting for these two heroes though. Their new adventure is quintessential Ratchet & Clank. You'll run around shooting stuff, buy new weapons and level them up, and play a variety of mini-games along the way. It's a compelling mix by and large, although not without significant weaknesses to go alongside the many strengths.   Size Matters, like all the best Ratchet & Clank titles, is a collection-fest, but in the best possible sense of the term. The gameplay is a heady mix of plat-bat (platform-combat duh) and acquisition, and you're on a constant quest to eek out every bolt you can from every crate, smashable object and downed foe in the game. Bolts are spent on new weapons, ammo and gadgets - some of which help you collect more bolts (such as the Bolt Grabber and Box Breaker). Huzzah - the acquisition cycle begins anew! Seriously though, the currency system is one of the foundations of this series and is just as compelling in this new instalment.    As you'd expect, Ratchet starts the game armed with his trusty wrench and rapidly builds up a formidable arsenal of ranged weapons. Better still, each weapon levels up through use; the Lacerator, for instance - the game's basic but very useful blaster - eventually upgrades to be dual wielded, and your arsenal can also be honed by buying various attachments from the vending machines spread throughout the game's worlds. You can boost the Concussion gun (the game's shotgun), for instance, so it has a bigger spread and can charge up a number of rounds to be fired at once. Other weapons? Well, they range from your standard issue flamethrower (the Scorcher) and sniper rifle (the Sniper Mine) through to more whimsical instruments of death, such as the Suck Cannon, which can suck up smaller enemies and fire them right back, and Agents of Doom, which is a mobile robot attack squad. Granted, they're little tykes, but it's still cool sending off mini-robots to smack your enemies in the ankles.      As often happens in action games you'll definitely find yourself favouring a few core weapons over the rest, but at least the level system means that there's an incentive to use them all - even if it's only to see what happens when you've fully levelled the Bee Mine Glove up (hint: it unleashes dogs with bees in their mouths, and when they bark, they shoot bees at your enemies). Speaking of levelling weapons up, this is a game that's designed for multiple playthroughs. You can only level so far the first time around, but when you play through again in Challenge mode, you're able to buy Titan versions of each weapon which can then be levelled up to create an uber arsenal.   Of course, Ratchet & Clank isn't just about weapons - it's also about gadgets, and Size Matters throws quite a few in your direction. I'd love to tell you that these are an interesting addition to the game, but honestly, they're just not. The Hypershot, for instance, is used for swinging from grapple points, so instead of jumping across a gap you can swing across. Six out of ten: useful, but it's really a basic platforming component. There's the Shrink Ray, which is used at certain doorways - shrink yourself down and grind some rails to surf the mechanism and unlock the door. Five out of ten: the grinding is an okay distraction, but never particularly challenging. Then there's the Polariser, which is a fancy way to press certain switches. Two out of ten: totally unnecessary. The last one I'll mention (there are a handful more) is the Sprout-O-Matic, which is very much the definition of a gimmicky gadget. You use it to water certain plants which will then jump out of the ground and follow you. Water the sandpit that's usually a few metres away and the little bugger will take root, becoming any number of things - a vine ladder perhaps, or a plant with a fruit that you can whack with your wrench to blow a hole in a wall or become a grapple point. These don't amount to puzzles, just busywork. Two out of ten: zany for the sake of zany without adding anything to the game.    Okay, not sure where that whole 'mini-scoring' system came from. It just felt right so I went with it. While it may seem unfair to take elements such as the gadgets and analyse them separately, the reality is that the development team has this incredible core gameplay to work with, but I'm not convinced they've really done enough that's interesting or compelling with other elements in the game. And there are a lot of them. Not only is there a heavy platform influence, but the game is constantly shifting things up through mini-games, both optional and otherwise. Some are fun enough distractions: the aforementioned Grind Rails; manning a turret as Clank to defend Ratchet from robot spiders as he hacks into a door; the space shooter sections as Giant Robo Clank (punch Giant Robo Clank!); and even the Lemmings clone that you'll whip through in a matter of minutes. Others, however, don't fare so well. There are the hoverboard races, with their drunken controls, drunken camera mechanics (they sway a lot) and drunken course design. (Although it is pretty cool to race against a hippie version of the Paddlepop Lion). I also really disliked the robo-trumble deathmatch arenas - all the fun of terrible vehicle controls and ramming AI opponents repeatedly.   Take into account the fact that the main game won't take long to beat - and isn't all that hard, and you'll see why I'm not raising both thumbs in the air and giving a goofy reviewer's grin. In gameplay terms Size Matters just doesn't quite capture the same magic as the PS2 titles. It's close, but not quite there. Thankfully, the same can't be said for other aspects of the game. The characters are as endearing as ever, backed as they are by an amusing storyline and entertaining, well delivered, dialogue. The visuals more than hold their own in the move to PSP - Ratchet looks fantastic, the animations on all the characters are full of life and personality, and while the game's worlds aren't all that awe-inspiringly complex, they fit perfectly into the visual canon established on PS2. The music, also, serves the game well, ranging from moody orchestral arrangements to more sci-fi electronica.     Even the controls have been well adapted for PSP, allowing you to strafe enemies and switch weapons/gadgets smoothly, not to mention busting out the usual platform antics. The only issues really come from the camera. It can be a little slow to move in the heat of the action (although hitting L and R together centres it behind Ratchet), and if you're in an enclosed space and strafe near a wall it can tighten right in on Ratchet which can be a bit disorientating. Minor quibbles really.Size Matters is an impressive PSP debut for the Ratchet & Clank series. It packs in all the action, platforming, mini-games, secrets and upgrades that the series is known for, and is entertaining from start to finish. That said, some of the mini-games are a letdown, the platforming could be more interesting and overall, this isnt as challenging as wed like. Still, the replay value is there, and if you have friends who are Ratchet fans, theres also four player multiplayer to check out.Want to have your say? Rock on over to the  Aussie forums.", "date": "May 24, 2007"}