{"name": "Tomb Raider Anniversary", "name_review": "Tomb Raider: Anniversary UK Review", "ref": "https://www.ign.com/articles/2007/05/25/tomb-raider-anniversary-uk-review", "text": "With the next generation of consoles now finally all present and correct, we can start enjoying what they have to offer. Hundreds of enemies onscreen at once - as already seen in Dead Rising. Even bigger gaming worlds to explore and become immersed in, like Elder Scrolls IV and the forthcoming Grand Theft Auto IV. Sequels to much loved franchises - Killzone, Metal Gear Solid, Mario -  will be bigger, prettier and - hopefully - better than ever.    It's a testament then, to how good Tomb Raider already was back in 1996, that Crystal Dynamics have created a game like Tomb Raider: Anniversary using firstly, the old-gen PS2, and secondly, a virtually unchanged plot and environments. Of course, visually it's a million miles away from the original's blocky faced Lara and grainy grey tombs, and the new environments are at least five times bigger. But, at its heart, it's the same game remade - a pure platformer, with clever puzzles and the occasional gun battle against curious wild animals. No twenty tiger battles or motorbike chases have been added just because they can be.   Many puzzles from the original return, albeit in devious new guises.  What made Tomb Raider so good all those years ago was the tense, isolated atmosphere it created. Perhaps because the technology didn't allow for pits full of growling grizzlies, instead the scares came from misjudging one-slip-and-you're-dead jumps and the tension from being trapped in vast caves with only the occasional bat or collapsing pillar for company. Almost every jump carried with it the fear of falling, and every medipack collected was preceded by several minutes of ledge shimmying and swinging across chasms.     Remaking such a game must have been a decision fraught with uncertainty for Eidos. Exactly how much would a generation of gamers now used to big green arrows pointing the way forwards respond to being plonked in crypts full of mazes, hidden passageways and impossible-seeming puzzles? Would they stand for being trapped in complex levels like St Francis Folly, desperately shifting blocks, pulling switches and searching for keys for hours on end?    Combat, as always, is the weakest link in Tomb Raider's charms.  But Crystal Dynamics have remade Tomb Raider with the benefit of hindsight, experience and a solid Tomb Raider: Legend engine tucked in their micro hotpants. As a result, Anniversary looks and plays as robustly as you could hope for on the PS2 and almost all of the problems the original suffered - namely those mercilessly spaced out save points and also, of course, the limitations of grid-based jumping - are long gone.    What hasn't gone is the feeling of isolation. The only games that have truly captured much of a sense of loneliness and tension in recent years have been of the survival horror genre. Tomb Raider: Anniversary conjures the same feelings. It does it by using virtually no background music - the only sound accompaniment to your adventure is the sound of your struggle. Lara cries out with the exertion of a big jump, and when she slams into the side of a rock. You begin to pick out good and bad sounds. Good - the hollow thud of Lara connecting safely with a wooden pillar. Good - the sound of her grunts and shuffles as she shimmies around a stone ledge that you weren't quite sure was a ledge when you jumped towards it. Bad - Lara's feet slipping as she balances on the tip of a narrow post. Only pressing triangle quickly will prevent her falling to her death.     The design of the levels is easily comparable in quality to the superb dungeon in Zelda games, although there's the added complication of often not knowing what you're supposed to be doing. Often, exploring will uncover switches and pressure pads - their uses only becoming apparent as you progress, coming together like a giant jigsaw puzzle. Until you've worked out the direction of the exit, a level is purely about exploration and experimentation. Working out why you need to drop the water level, how you reach an isolated platform and where the last vital key is located.    Often you'll miss a crucial artefact and need to backtrack through large areas of a level again. There's no straightforward path through, and no clear objective on a list. This makes for a game which is often baffling but ultimately rewarding, especially when you begin to appreciate how well thought out many of the puzzles are. At one point, you reach four identical looking doors, but each one can only be opened using a subtly different approach. Such obstacles clearly slow you down, but the trial and error of working out how to get through them is the whole point of the game.     WIth the Legend engine behind it, Anniversary's acrobatics are an absolute joy.  Of course, trial and error gaming has its frustrations, and Anniversary does suffer at times. Some of the riskier jumps can appear impossible, and require precision lining up, so you give up on them only to find out an hour later they were possible after all. By the time you reach the third environment of Egypt, the game has introduced some pretty merciless timed traps and swishing razor wire which, in a more linear game, would only need to be navigated once, but in Tomb Raider you might need to do two or three times if you've missed a switch in a previous room.    Also, the entirely open nature of the levels means you often don't know if you're moving in the right direction. The generously placed checkpoints then work against you, as you're always returned to the last one you went through. This is particularly annoying when you fall but survive, only to walk through a checkpoint and undo ten minutes of platforming.     Gratuitous bum shot and a couple of guns.  As has usually been the case in Tomb Raider games, while the platforming is an effortless pleasure (bar a few awkward camera moments), the combat is, in comparison, quite clumsy. Even when locked onto one of the beasts that patrol the tombs, pouncing when you're least expecting it, its hard to tell if your bullets are actually doing them any damage. The best - if a bit spineless - way of dealing with most enemies is to climb the nearest pillar and shoot them from the safety of the top of it. Most are dumb enough to run around on the spot in easily sniped circles.Complaints about cameras and combat aside, Tomb Raider: Anniversary deserves some attention. The Tomb Raider series has been moving away from what it began as in 1996 with varying success and, while no one wants to see a series staying the same for ten years, Anniversary sticks to what it does best and ends up outdoing every Lara game thats been made since. Some might consider it a bit too retro  a game stripped of multitudes of weapons and featuring no upgrades or stats, just a basic health bar  and certainly the boss battles could have done with some next-gen beefing up. But still, Lara is back on great form, and re-imagining a ten year old classic has clearly been a risk worth taking.", "date": "May 25, 2007"}