{"name": "Striker Pro 2000", "name_review": "Striker Pro 2000 Review", "ref": "https://www.ign.com/articles/2000/04/11/striker-pro-2000-review", "text": "After barely escaping with all my faculties intact after perusing the dreadful arcade footy feast Virtua Striker 2, I was apprehensive to tackle another Soccer game so soon. While I've always enjoyed EA Sports' FIFA series and Konami's International Superstar Soccer, the glut of horrible striker games over the last few years has jaded me more than I'd like to admit. Alas, before I could give it a second thought along comes Rage and Infogrames' own shot at worldwide football, Striker Pro 2000. ~Here we go again,~ I thought...   But wait! There's actually some fun in here! What is this, some kind of conspiracy? Is this a cruel joke to toy with this reviewer's sensitive emotions? In fact, it isn't, and for the first time in what seemed like years (oh wait, it HAS been years), I wasn't swearing at my television screen cursing the sport of Soccer and all it represented. Striker Pro 2000 had me genuinely interested. Cool!   Originally released in Europe as UEFA Striker, SP2K was a big hit among sim-freaks overseas. Although not as popular as the aforementioned V-Striker 2 (why, I have no idea), UEFA managed to grab the attention of many a DC gamer anyway. Starved for a good representation of their favorite pastime, fans bought UEFA like hot cakes on a Sunday morning and soon spawned a following similar to that of SEGA's own line of sports titles here in the U.S. Though it isn't as polished or flashy as those games, Striker Pro can still hold its own.    Foremost on the list of positives has to be team selection. Over 70 teams are yours for the taking, including hidden squads that have to be unlocked in unique training sessions. Granted, real players and franchises are absent but the depth of Striker Pro's editing feature will quickly remind you that it's no big deal (how many Americans can actually name 10 international footy players anyway? Yeah, that's what I thought). Assuming that it makes a difference to you, you can arrange teams in any division you like, rename them, change their uniform designs and colors, and basically create your own league from scratch. I've always loved features like this in Baseball sims, and to see it in a soccer game is good news.   Teams aren't the only customizable options. Everything from the weather to the stadium you're playing in can be adjusted and modified. Snow, rain, sunshine, or whatever can be chosen at the press of a button. Penalties, game rules, and game length can be modified too, and before you realize it, the perfect situational soccer game is yours to command.   The gameplay model is refreshingly simple. There's a button to pass, shoot, sprint, and do all the other things you'd expect to pull off, and while it's not as fast paced as other titles in the genre, a speed adjustment here, and a difficulty setting there and boom, you can have a quick little session to your liking. The only problem I found with the controls is what seems to be a problem in most soccer games over the past few years and that's shooting. As has become commonplace, the CPU rips into your goalie like he's a medium rare steak as your teammates try the same action with less positive results. Fortunately, the netkeepers are a solid bunch and surviving those close games aren't as hard as you'd think.   Graphically, Striker Pro is rather impressive. Player detail is pretty high, and watching a team race from the locker room, run up the stairs and gather on the field is very realistic. Subtle weather conditions and various field textures help create a believable world of European football. I've discovered a bit of a bad touch, though, as my discerning eye has picked up on some prominent sparkle in the crowd and stadium visuals. Not an earth shattering revelation to most, but ever since I first played the original Ridge Racer on PlayStation all those years ago, my subconscious has picked up a silent disdain for the effect. Still, it's a much better effort than V-Stinker 2's colorful shod.   Accompanying the splendid pupil massage is the audio. Using three separate announcers (Jonathan Pearce, Ron Atkinson, and Ruud Gullit), a ~straight-from-the-television~ set ambiance follows each game. Repetitive as some of the commentary may be, the way that each sportscaster interacts with the other one (especially during the beginning, halftime, and end portions of the match) is worlds above the crappy synthesized speech we've grown accustomed to. But I do have one question: what happened to the rest of the sound effects? Other than a constantly-buzzing crowd of drunken fans, there isn't much to speak of.Easy to play, yet hard to master, Striker Pro 2000 is a solid attempt at Dreamcast Soccer. While the sport still has a ways to go in popularity here in America, gamers looking for a bit of international flavor and an eerily accurate recreation of European television needn't look any further.  The only thing missing is an endless barrage of cheese documentaries from the BBC -- oh well, perhaps next year.", "date": "Apr 11, 2000"}