{"name": "Mortal Kombat: Armageddon", "name_review": "Mortal Kombat: Armageddon Review", "ref": "https://www.ign.com/articles/2007/05/25/mortal-kombat-armageddon-review", "text": "Mortal Kombat: Armageddon represents the pinnacle of Midway's fighting franchise, the culmination of all the warriors, stadiums and control mechanics that have made the series a fan favorite over the years. The Wii version of the game is a port of the already-released PlayStation 2 and Xbox incarnations, which have been available for almost 10 months. This port features one additional character, but otherwise the content - all the gameplay modes and nearly all of the options - is identical. There are two key differences, though. The first is that the Kombat on Nintendo's system dons new gesture-based controls - you can fight with quick flicks of the Wii remote, if you so desire, although it's not a requirement. The other big separator is that despite coming late to the game, Armageddon for the Big N's little white box arrives without an online mode, as the previous builds had.  Armageddon is packed full of fighters - more than any other version -- and it is this saturation of the warriors that becomes the backbone of the new storyline. In an attempt to keep the hordes of fighters locking themselves in battle forever and threatening the safety of both the Earthrealm and Outworld, the Elder Gods devised the ultimate tournament at a pyramid with an elemental guard, Blaze, where the final competition for power, glory, and all other things that fighters seek could be held. The storyline is, of course, merely a setup for the non-stop brawling action that follows, but it does fit well within the Mortal Kombat universe, if you're a purist, and it's also told well, if you value production values. A crispy-clean and beautiful opening cinematic showcases the battle of the warriors and how each will risk limb and life to gain access to the top of the Elders' fated pyramid.   Simple flicks of the Wii remote are all that's needed to fight in the Wii game.  The Wii version of Armageddon features some 64 characters, including one exclusive warrior: Khameleon. If you've been a Nintendo as long as you have a Mortal Kombat one, you might recognize the female fighter from her debut appearance in N64's MK Trilogy. She remains one of two reasons to buy Armageddon on Wii if you don't own it for another system already, the other, of course, being the new gesture controls. Just about every major brawler to appear in the franchise over the years is featured in playable form in Armageddon, from Scorpion, Liu Kang, and Smoke, to Meat, Bo' Rai Cho, Baraka and Raiden. The roster is impressively huge and each character comes complete with a unique set of animations, not to mention the ability to switch between two hand-to-hand and one weapon-based fighting style on the fly. It's been toned down since Deception due to the ridiculously large amount of playable characters.  The roster of fighters is impressive.  The title plays like nearly every Mortal Kombat before it, meaning fast and frenzied. In contrast to a series like Tekken, Armageddon's fights enable for intense projectile-based combat even as they encourage melee battles. You will rarely have a chance to breathe, let alone pause, but button-mashing won't get you far since only the skilled player will learn the advanced combos and master the fatalities. The mechanics are responsive and the gameplay fun when you're playing with the classic controller or alternatively with the GameCube controller. Both are fully compatible with the Wii iterations and you can plug them in at any time and compete against friends who are using the Wii remote and nunchuk. For that reason alone, we could recommend Armageddon to Wii owners even if the remote controls were absolute junk. As it turns out, they're not.  The new gesture-simplified fights are for many going to be the main draw to this incarnation of the project and when they are working as you'd like them to they do indeed effectively make playing Mortal Kombat much easier. To perform special character moves with the Wii remote all you have to do is hold down the B trigger, make a left to right, or up and down, or half circle motion, and then release. Liu Kang will fly across the screen kicking. Raiden will dive at opponents. Bo' Rai Cho will vomit at their feet. The list goes on. We were somewhat surprised to find that the gesture system does feel good and is responsive. Using very minimal movements, you can flick out left/right motions and carve half circles into the air even as the Wii remote dangles from your lap. It is in a way refreshing to play Mortal Kombat this way and it is on some level intuitive, too. We're positive that gamers who didn't grow up with the franchise would prefer this method of play to the traditional one. And yet, there are some quirks. The game seems to understand and translate our motions 95% of the time, but occasionally our movements go unregistered, which is problematic given the nature of such high-speed battles where every move counts. The bigger problem is that standard high/low punches and kicks are performed with the D-Pad on the Wii remote, which is uncomfortable, to say the least.   Players used to the multiple areas for fighting stages from Deception will recognize some stages that will make their return in Armageddon, such as the Falling Cliffs, Nethership Interior and Hell's Foundry. These have been joined with new stages such as the Bell Tower (where you can send your opponents ringing into a massive bell or gongs arranged around a tower), Subway (where you can fling an enemy onto the tracks of an approaching car) and Netherrealm Hell (where you can fling players crashing down onto platforms while demons scream around you). The selection is overall more than adequate.     The last change to the franchise as a whole, and perhaps one of the most intriguing ones, is the remake of the fatality system into the Kreate-A-Fatality system. Instead of inputting a specific button combination and sitting back to watch your character kill his or her opponent, you're now given a specific amount of time to continually input a sequence of gestures (with the Wii remote) or buttons (with the others) to literally dismember your foe. There's a catch to the time sequence though -- as more sequences are recognized, the amount of time that you have to chain together the next move rapidly decreases. If you don't actually perform the killing blow in time, you can actually ~fail~ the fatality. Just about any player will be able to perform a one hit fatality, but really skilled players will be able to pump out nine or ten hit kills. Some players will probably miss watching these fatalities instead of having to trigger them, but this is a great way of testing your timing and gauging how proficient you are at the game.  Half circle motions like these result in special moves.  In addition to the Kombat fighting modes, Armageddon features a robust Kreate a Fighter, an adventure-style Konquest option, in which you play as Taven and progress through a storyline complete with a huge bounty of collectibles and periodic fights. Then there's Motor Kombat, which is like Mario Kart except with MK characters and gore. All of the above extras arrive purely as bonus content and do not detract from the experience. The controls in Konquest are rough and some of the story/dialogue is cheesy, but die-hard fans will still enjoy it, particularly for the unlockables. Motor Kombat, meanwhile, is mindless entertainment; incidentally, you can turn the Wii remote on its side and control it classically, which is a welcome touch. Sadly, Chess Kombat and Puzzle Kombat from Deception - too unexpectedly engaging inclusions - are not back for Armageddon.   It's too bad that - and this omission is sorely missed - Armageddon for Wii lacks an online mode altogether due almost certainly to Nintendo's slow start in readying an infrastructure and providing developers like Midway with the proper tools and documentation to utilize it. It's a good excuse, of course, but that makes little difference to consumers who want it and we have therefore been forced to ding the final score of the game because of its absence.  Armageddon on Wii looks about the same as its predecessors. Models are acceptably detailed and animation is quick and fluid; environments are pleasingly varied in design and they are also fairly interactive, which means you can toss opponents out of arenas and they'll crash through walls and windows, revealing other fight areas below. The particle effects, particularly for blood, are too spectacularly over the top for our tastes, but we're sure fatality seekers will love them. The whole experience runs at a constant 60 frames per second in both 480p and 16:9 modes on Wii, although Midway's version of widescreen is slightly faked; it cuts off the far sides of the screen.It has arrived late, but the Wii version of Mortal Kombat: Armageddon is still fun and still a very deep fighter. The new gesture based controls seem like a bad idea, and yet in practice they feel responsive and satisfying to perform most of the time. Very occasionally, your movements won't be recognized, which is troubling. It may just be that our gestures are performed inaccurately, but of course that also means the majority of novice players will undoubtedly encounter the same issue and thus it still remains. Thankfully, you can use either the classic controller or GameCube pad as an alternate at any time, even when playing against someone who prefers the Wii remote and nunchuk. Armageddon is otherwise the same game as its predecessors on PS2 and Xbox plus one new character, Khameleon, and minus an online mode. The additional fighter is welcomed, but she hardly makes up for the lack of online play, which is why Armageddon has received a lower score on Wii than its counterparts. Even with a lower score, this is Wii's best fighter and we can safely recommend it to any franchise fan.", "date": "May 25, 2007"}