{"name": "Chuzzle", "name_review": "Chuzzle Mobile Review", "ref": "https://www.ign.com/articles/2007/05/29/chuzzle-mobile-review", "text": "PopCap is no stranger to the mobile scene -- it's ultra-popular casual games have been ported from the PC to handsets for some time. But now the casual giant is taking its mobile fate into its own hands with the release of their first internally developed and published title, Chuzzle Mobile. Chuzzle Mobile is built on the successful 2005 PC/web release that garnered numerous awards. According to PopCap, Chuzzle was also one of the firm's most requested games to get the mobile treatment.   Really? Chuzzle was the most requested?   That's not a slam against Chuzzle itself -- the game is rock-solid and still fun to play in spite of the spate of match-three puzzlers that crowd the mobile decks. But considering PopCap's cavernous library of casual greats, Chuzzle isn't exactly the boldest debut for the new mobile publisher. Between Bejeweled, Jewel Quest, Collapse, and the eighty bazillion other match-three puzzle games, Chuzzle feels too safe and too familiar. Of course, PopCap has already licnesed out a number of its bestsellers to other companies, such as the aforementioned Bejeweled, Zuma, and Insaniquarium. So, Chuzzle it is.   Chuzzle Mobile fills the screen with colorful fuzzballs, each equipped with an expressive pair of googly eyes. Much like Bejeweled, the goal is to group like-colored Chuzzles into trios (or more) to earn points. Every Chuzzle eliminated from the well, though, is replaced by more cascading furballs. But the method of lining up the Chuzzles is a bit different. Instead of swapping pairs, you must sliding entire rows and columns of the Chuzzles. And each move must result in at least a matching trio or the sliding won't stick.   As you push deeper in the game, different Chuzzles are dropped into play, such as a rainbow-colored puffball or a giant Chuzzle that takes up four spaces. Some Chuzzles get locked into place, forbidding you from sliding either the row or column the Chuzzle occupies. You must bring the matching Chuzzle to it in order to unlock the row/column. If you can rack up combos -- multiple Chuzzles trios blipped off-screen with a single move -- you earn mega-bonuses. You can earn ~shuffle~ bonuses when reaching point thresholds, mixing up the Chuzzles so you don't reach a stalemate. When you make enough matches to fill the meter along the bottom of the screen, you move on to the next puzzle.   The game is, of course, quite playable. It's a classic ~just one more~ kind of casual game, much like PopCap's previous big hits such as Bejeweled. (Speaking of which, consider checking out the new edition of Bejeweled with an excellent online multiplayer component, published by EA Mobile.) But, I must confess my general fatigue to the match-three formula. Fortunately, Chuzzle Mobile has an extra mode that alleviated some of the same-ness I felt was creeping into the game: Mindbender.   Mindbender offers the player a series of color patterns that they must create with a screen full of Chuzzles. You need to slide columns and rows to replicate the pattern. Same puzzles can be solved with just a handful of moves, while later puzzles require thinking several moves in advance. Big hint: Don't forget that two same-colored Chuzzles on opposite ends of a row are actually a side-by-side pair when you move the entire row. This mode is actually my favorite part of the game, as there's a certain satisfaction gathered by nailing a complex puzzle that has a definitive end, not just surviving an onslaught of new pieces, like Tetris or Bejeweled.   In addition to the regular game and Mindbender, PopCap includes a Zen mode that just lets you enjoy making matches without any stress, obstacles, or time limits. There's also an extra-hard mode for Chuzzle fanatics that can breeze through the normal game. And, yes, it's impressively difficult.   Chuzzle looks great, full of bright colors that pop off the screen. The little fuzzy Chuzzles are cute, thanks to their little eyes that dart around the screen or look at you pensively. The music and sound effects are also quite good, especially the sound of a popping Chuzzle.  Chuzzle Mobile is a very playable mobile puzzler, but as I mentioned, by releasing it amongst a field of match-three imitators, the game feels like part of the pack rather than a standout. This formula has been well worn and, in fact, it's close to being driven into the ground. But even though the match-three formula is familiar, Chuzzle Mobile still executes it with aplomb. So, essentially you must decide whether or not you want another match-three puzzler. If you're still down with match purple to purple, well then Chuzzle Mobile will likely offer many, many sessions of mobile fun.", "date": "May 29, 2007"}