{"name": "Donkey Kong Country 2", "name_review": "Donkey Kong Country 2: Diddy's Kong Quest Review", "ref": "https://www.ign.com/articles/2007/05/29/donkey-kong-country-2-diddys-kong-quest-review", "text": "The sequel to Rare's spectacular hit Donkey Kong Country was inevitability. Donkey Kong Country 2: Diddy's Kong Quest more than delivers in its ambitious aim of equaling and sometimes exceeding the standard set by its predecessor. Released at the end of 1995, as the title suggests, Diddy's on an all-new quest and is joined by his lovely female companion, Dixie, as they enjoy lush locales with a charming sailing and pirate's motif, challenging levels, and an all-around engaging gameplay experience.   Diddy and Dixie set out to rescue Donkey Kong from the clutches of the evil Kaptain K.Rool and encounter a flurry of foes along the way with some making a return from the original DKC, and others making debuts. The gameplay is constantly challenging and the level design equally complex. Scattered throughout DKC2's stages are a plethora of bonus levels and Easter Eggs (with collectible coins as rewards). Players should notice that the levels quickly increase in difficulty, encouraging a ~trial by fire~ design. Thankfully, the highly-responsive controls that Rare finely tuned for the original DKC have been integrated once again.           DKC2 also looks and sounds a lot like its forerunner, which certainly isn't a bad thing. The atmospheric orchestrated soundtrack returns, providing catchy and eerie tunes alike. Donkey Kong Country boasted some of the most beautiful graphics ever seen on the SNES, and DKC2 does justice to that reputation. Highly detailed multi-layered backgrounds, smooth and unique character animations and designs are mixed with a vibrant and varying color palette that provides a feast for the eyes.    While playing a lot like DKC1, there are also many additions that arguably make the second installment better than the first. By pressing select, Diddy and Dixie can swap between their roles as the dominant character. Diddy is faster, but Dixie has the ability to glide in the air using her pigtails, making her a better choice for airborne maneuverability. Players now have the ability to both ride on and transform into animals during the regular stages, and not just the bonus rounds. Some features are also absent, like the ability to find hidden items in the ground, or ride the giant steel barrel.    While some gamers may find the gameplay challenging (compared to many games over the last decade), others may find the difficulty to be inhibiting or discouraging. There will be times where it takes a couple dozen tries to get past a fairly simple section of a stage. However, smart and engaging level design makes passing these areas very rewarding, and any frustration experienced is swiftly soothed by the incentives that follow it.If you love action-platformer games then Donkey Kong Country 2 is a no-brainer. There is a strong chance that you've already played the remake/ port on GBA so you may already know how it plays. Consequently, it's easy to recommend spending cash on this to anyone who enjoys the genre. Who doesn't love blasting out of barrels and collecting bananas?", "date": "May 29, 2007"}