{"name": "Mercury 2: Mercury Meltdown", "name_review": "Mercury Meltdown Revolution UK Review", "ref": "https://www.ign.com/articles/2007/05/30/mercury-meltdown-revolution-uk-review", "text": "Given that this is the third iteration of the blob-based puzzle sequel, you'd be forgiven for a moment of eye-rolling distain at what might initially appear to be yet another PS2 port with Wiimote controls shoe-horned in. However, thankfully, developer Ignition's got a trick up its sleeve, before you sink into your own personal quagmire of despair. Actually, it's quite a significant trick too, seeing as Mercury was originally designed for motion controls back during its PSP conception. In other words, with the advent of the Wii, Ignition is finally getting a chance to revisit its original vision for Mercury Meltdown - and, happily, it works.   Essentially, the series is a tilting-maze puzzler, not totally dissimilar to SEGA's Super Monkey Ball games. However, thanks to some fiendishly creative level design and smart game mechanics, the Mercury titles are much deeper affairs - with the need to guide your oozing blob to the nearest exit the least of your worries.   Colour plays a vital role in progression - so get spraying those balls!  As you delve into Mercury Meltdown Revolution's monstrous bag of stages, you'll encounter teleports, switches, platforms, levitators, coolers, heaters, shunters, zappers and countless other progress-hindering contraptions. Here, it's not simply a case of finding your way from point A to B - you need to juggle multiple blobs, switch states and mix colours, amongst other things, to reach your target. As important as platform antics are to success, there's an equal focus on flexing the old grey matter.   In fact, it's this perfectly balanced, elegantly implemented game design that made earlier PSP iterations, such compulsive, essential purchases for puzzle fans. Happily then, Mercury Meltdown Revolution is no different - and even benefits somewhat from additional stages and re-jigged level orders to smooth out some previously frustrating difficulty spikes. Of course, for all Revolution's similarities with previous versions of the game, there's one major difference here.   Teleporters, conveyor belts and colour switches - and that's just for starters.  As noted earlier, Ignition's original ambitions saw some experimentation with motion-sensing for its first PSP game. Now though, Nintendo's exotic controller configuration has made those original intentions a reality. What's more, Ignition has managed to create a control system so natural and refined that it's fairly obvious this is what the developer had in mind all along. Holding the remote horizontally (and eliminating all of Monkey Ball Wii's wrist-twisting discomfort instantly), stages accurately follow your tilts, offering exactly the right degree of responsiveness.   Elsewhere, the d-pad conveniently provides access to camera rotation, 1 and 2 zooms in and out from the action, while a combination of the minus button and tilting activates - slightly awkwardly, it has to be said - free-look mode. Admirably too, Ignition has also provided support for the Wii's Classic controller, should analogue-flexing be more your style. It's testimony to the developer's skills too that neither input device has any significant advantages over the other.   Yup, stages can be as horribly complex as this one looks.  Unfortunately, for all its good points, we still have a few minor grievances with Mercury Meltdown Revolution - many of which have been carried over from the earlier PS2 version of the game. For a start, despite some restructuring of level order, Revolution is still an incredibly tough game. While real puzzle aficionados will likely revel in the challenge Ignition presents, the difficulty curve ramps up much too quickly - mere hours into the game and you're tasked with some frighteningly demanding mental and physical obstacles. Thankfully, frustration never lies with either control scheme, but that doesn't make proceedings any more palatable for less-dedicated players. It's a shame that Ignition starts tightening the screws so early as many players are unlikely to stick with the game long enough to experience its sizeable level roster.   Another irritation is the complete absence of any type of multiplayer mode. Bizarrely, despite the inclusion of a handful of variable-quality 'Party Games', it's strictly a solo affair. Multiplayer was missed on PS2 but here, on a console practically designed for social gaming, it's even more unforgivable.That said, if you're in the market for an ingeniously-crafted, exceptionally challenging puzzler, then Mercury Meltdown Revolution does come recommended. There's certainly no doubting the quality of the main single-player mode and the entertainment value it offers for dedicated players. However, Ignition's failure to flesh out Mercury Meltdown Revolution for the Wii audience does, ultimately, seem like an unfortunate missed opportunity.", "date": "May 30, 2007"}