{"name": "Pirates of the Seven Seas", "name_review": "Pirates of the Seven Seas Review", "ref": "https://www.ign.com/articles/2007/05/30/pirates-of-the-seven-seas-review", "text": "Disney releasing a Pirates of the Caribbean: At World's End mobile game just in time for the movie release is a textbook case in synergy. Gameloft choosing the exact same moment to drop their own pirate-themed game, Pirates of the Seven Seas? That's drafting. It's a classic NASCAR strategy, to gain speed by sliding behind another car that's blocking natural resistance, only to leapfrog them when they get the first chance.   And that's what Pirates of the Seven Seas does.   The game is a side-scroller action game starring a pirates, a bevy of lusty ladies, and a horde of zombie pirates. It's loaded with death-defying stunts, like riding down sails with a dagger and doing a flip off a mast just to bring a sword down on a zombie skull. Jungles must be tamed, ruins need to be navigated, and pirate ships cleared of rampaging enemies. You'll have some minor puzzle solving, but the majority of the game is all about using your sword and pistol as instruments of pirate justice.   Gameloft juices the game with some acrobatics, such as a hookshot that lets you swing across chasms or employ the Price of Persia's wall-run technique. You can slide down ropes and slice an enemy from above in a single move. And this actually points to one of my issues with the game -- and the engine itself. It's one thing to simplify controls since we're dealing with a rig that isn't exactly as responsive as a Xbox 360 controller or a Wii Remote, but at time it feels like the game is playing itself. Case in point: I jumped to a ledge with zombie, and without any further buttons watched my pirate pull himself up, swing around then slash the zombie.   The inclusion of the wall-run also underlines the fact that Pirates of the Seven Seas in built with the same side-scrolling engine that powers Prince of Persia, Splinter Cell, King Kong, and Mission: Impossible III. It's a sound engine that let Gameloft create some compelling action games with a high bit of finesse, but we're now dealing with diminishing returns. If you've played several Gameloft action games -- and sales figures hints that mobile gamers certainly have -- Pirates of the Seven Seas will feel very familiar. If this is your entry point, though, you'll definitely be surprised at the smooth action and entertaining gymnastics.   Between the side-scrolling action levels, you'll discover that the lead pirate was indeed one of the pioneers of surfing. Much like a shooter, you move your surfing pirate through an endless summer of jumps, gold coins, and zombies. This is pretty fun and it does serve to break up the action antics and puzzle-lite play.   Pirates does suffer from a lack of longevity -- only eight levels. If you play the game on the lowest difficulty level, you'll run from one end to the other in just over an hour. Goose the difficulty so the boss battles are something of a challenge and you'll have a better time collecting all of the gold doubloons that decorate the levels.   Pirates of the Seven Seas is an extremely attractive game -- especially for fans of classic 2D side-scrollers. The animations are excellent, such as when you slash a zombie and then finish it off with your flintlock. The use of color is also fantastic -- the high seas have never looked more inviting.  Gameloft was savvy to release their Pirate game at the same time of Disney's Pirates of the Caribbean movie -- free advertising. The game is a better swashbuckler sim than the mobile version of At World's End, but since it's based on the aging Splinter Cell-Prince of Persia engine, the game does indeed feel a little paint-by-numbers. ~Replace the prince with a pirate! And turn those palace guards into zombies!~ Nevertheless, the game is still a breezy actioner that provides a handful of thrills, but missing out on this voyage of the Seven Seas isn't going to inspire any death regrets.", "date": "May 30, 2007"}