{"name": "Carmageddon", "name_review": "Carmageddon", "ref": "https://www.ign.com/articles/2000/04/11/carmageddon", "text": "It doesn't use the Game Link. Carmageddon on Game Boy Color does not use the Game Link Cable feature.  Now, pardon me for ranting -- I'm sure some of you are sick of IGNpocket's ceaseless tirade against developers who don't take the time to utilize the oft-negelected Game Link Cable function -- but Carmageddon only had two things good going for it on the PC side. One was the extreme gore, which can only be halfway represented on the Game Boy Color (and has thusly been done only halfway in this game, making it not at all good). The other was the networked gameplay, which was exciting and fun. This Game Boy Color game is neither of those things. Carmageddon is scrap.    Features   Free-roaming race gameplay.  18 unique road rash racing machines.  AI with five functions, including attack and explore.  Wandering zombies to run over.  Available for Game Boy Color only.   For those uninitiated in Carmageddon action, here's a brief explanation of how to play. Your job is to get behind the wheel of a vehicle, drive around, run over people, and hit check points along the way. Do this for a while and you can play another track, and then another, and then another...  On the PC, Carmageddon was a short-lived thrill, where people could be killed, cars could be destroyed, and races were more about slaughtering pedestrians for cash than actually completing laps. On the Game Boy Color, that's still the basic concept, but the trill is gone because of the small scale graphics. Gore just doesn't come across very well on a pocket system (except maybe Robocop vs. Terminator on Sega's Game Gear). In Carmageddon, Titus has even chickened out farther. The gore is lessened by the lame graphics, but its still there. You run over people with a little splat, and sometimes they get stuck on your bumper for a while (which seems like a game glitch rather than a feature, but sometimes it's sort of funny). The thing is, now these are zombies, and you're supposed to kill them because of this new Maximum Overdrive plot twist. They might as well have changed the people to bugs, because that's all they look like. The fun in driving over jerks just isn't here.  And what's left is Carmageddon. The same Carmageddon nobody really liked, but played because of the gore. Racing in this game isn't racing -- nobody else seems to be competing against you, and even though there are ~five modes of AI, including attack and explore,~ the other racers don't have any other purpose except to get in your way.  So it's a boring game, but at least it steers well, right? Sadly, no. The developer SCI did a nice job with the collision detection (you can weave through trees if you know what you're doing, and there's none of that background / foreground collision depth perception problem seen in other Game Boy Color games (including BattleTanx, which we also reviewed today). The problem is, the steering is crummy. There are only eight degrees of turning, so without graduated frames of animation and driving vectors, steering is an awful pain. The game compensates some by allowing the car to slide a bit (like shifting lanes), and the power sliding in a sharp turn is realistic, but anytime you make a turn in this game, you'll end up turning too fast, too soon, too sharply, and straight into a wall. Some games just don't belong on the Game Boy. This is one of them. It has some nice ideas and programming tricks as far as collision detection, differing car controls, and game speed, but it's never fun. Even running down zombies is bland. When we heard this game was being done for Game Boy Color, we never expected it to work. Needless to say, we weren't surprised by this one. The again, I suppose the best it could be would be Carmageddon, so no wonder this is so lackluster.", "date": "Apr 11, 2000"}