{"name": "UFO: Afterlight", "name_review": "UFO Afterlight Review", "ref": "https://www.ign.com/articles/2007/06/01/ufo-afterlight-review", "text": "Frequent readers of IGN know what a long shadow X-COM casts over the whole genre of squad-based, tactical alien invasion games. While games like Fallout, Silent Storm and Jagged Alliance have managed to offer up the squad-based, tactical part, it's taken a long time for developers to try their hand at the alien invasion part while also incorporating X-COM's base-building and overall strategy components. Fortunately, we're seeing more and more games following that model. Most aren't very good, but they're headed in the right direction.  UFO Afterlight is just such a game. Building on the lessons learned in UFO Aftermath and UFO Aftershock, Afterlight (which is actually a real word) offers up the goods in terms of concept -- xenophobic alien hunts, futuristic research and manufacturing paths, base management, labor and resource allocation and pretty much anything else that the head of a self-sufficient, futuristic, alien-fighting force might enjoy. In this case however, too much repetition in the battles and a cumbersome base interface make Afterlight somehow less than the sum of all its parts.   Fans of the series who remember the heroic struggle we fought in the previous game might be surprised to discover that this sequel opens with humanity in virtual exile on Mars. The Reticulans have sent the cryogenically frozen race of Earthlings to a small territory on the Red Planet. A few dozen Earthlings who happen to be awake serve as the soldiers, engineers and scientists for the new installation. Unfortunately, there are other races living on Mars (and a surprisingly large number of them), who don't take a liberal view towards this recent immigration.  Your scientists and engineers will have to take up arms alongside your soldiers to fight back alien encroachment, expand humanity's territory (though force, if necessary), secure essential resources and basically do all the other things that humans are known for -- living, laughing, loving and hosting backyard cookouts. While the fight for survival is a worthy goal, UFO Afterlight doesn't really go far out of its way to tell you what the whole point of all this is. This isn't a big problem at first but you're eventually told that the thousands of humanicicles will be thawing out soon and if you haven't ~won~ they'll die. Talk about pressure. Whether that victory requires the complete eradication of all other Martian life, the discovery of a new technology or the forging a new diplomatic alliance is up to you to discover.  The story plays out in conversations between your various department heads and the leaders of the various alien organizations you encounter. Each conversation points out new opportunities and obstacles that you'll have to confront as you progress through the game. In some cases, you'll open up negotiations with a previously unknown faction, and in other cases, you'll learn about new production opportunities. Though the dialogues are meant to highlight scripted moments during the campaign, you're still free to play the game however you like. Word to the wise: rapid military expansion is always a good idea.   To ease the management burden you'll only have a single base this time around. Staffed with soldiers, scientists and engineers (and some remarkable folks who happen to combine two of those roles), the base will be your home for the whole game. Here you'll assign research priorities, manufacture new tools and weapons, and send out teams to explore, improve, attack or defend the various territories around you.  The fun thing about this part of the game is that you never have enough personnel to keep the base running at peak efficiency. You'll have to reassign engineers to help construct new base facilities, and take researchers away from an important project so they can build a resource-collecting structure along your frontier. You may even have to send an engineer out with a combat team to investigate alien sabotage to your water supply. Trying to decide which tasks should receive priority is really the point of the strategic game, especially once your manufacturing and research options open up.      The problem though is that the game forces you to manually shuffle the personnel around. While deciding on project priorities is essential, moving each individual worker from one installation to another is just busy work. It's especially galling when you've got important projects assigned and people are just hanging out in the residential pod simply because you forgot to reassign them after training or a survey mission. It gets even more aggravating because the game shows which researchers and engineers are working in the base but it's not apparent which ones are tasked with heading out to improve neighboring territories. You have to spend time searching for that information yourself.  The whole base interface is like that. It has a vast number of screens but you really have to dig deep to find the information you need at any given moment. Once you get the hang of it and at least know where to look, it's a bit easier but the game doesn't go out of its way to tell you what's going on or what you need to do. The research screen is a great example of this. Though it tells you in general what each technology does, you have to discover by trial and error which ones are actually going to give you a practical benefit. I don't mind that when it comes to alien technologies but my scientists should at least be able to tell me which advances are required to communicate with earth or build new pods.   Each of your base personnel are rated in a number of physical and mental characteristics which determine how good they are at shooting, dodging, running, spotting and a whole host of other critical combat tasks. Additionally, you can train your troops in a variety of disciplines to help them use different types of weapons, gain access to more mobility options in their armor, seek cover, and so forth. For the non-combat personnel there are even training areas that grant them bonuses to certain types of research or construction tasks. As each character gains experience, they gain the ability to improve their traits and train in new areas.  Since you won't have many folks at your disposal, you'll have to develop each person into a specialist of sorts. One soldier might have learned to crouch and run in their armor and has such a good understanding of a particular alien's anatomy that he always gets a bonus when fighting them. Another soldier might have decided instead to focus on using exotic weapons and heavy armor. Conveniently, the skill and training areas for each soldier are shown on the equipment screen, so you know immediately who should get the laser cannon and who shouldn't. We appreciate that the game preserves your soldiers' equipment assignments from mission to mission but it seems stupid that a soldier has to reequip everything when they change armor types.  The tactical battles are interesting, particularly once you start to encounter the rolling death balls and the psi-crazy Reticulans. Played out in a pause-able real-time format, the game includes loads of optional event triggers that you can use to halt the action when something significant happens. Since they're all on by default, your first few combats will be jerky affairs. We preferred to turn them all off and simply use the spacebar to pause the action when necessary. The levels are generally small enough that you can keep a good eye on what's going on at all times.   Most of the levels come with some significant vertical elements in the form of catwalks, cliffs, valleys, pits and so forth that you can use to get the drop on your enemies. Unfortunately, the early enemies aren't bright enough to move against you in any sort of indirect way, so most combats consist of lining up all your soldiers in an area where they can't be attacked from the rear or the sides and simply marching through each level taking out the enemies one by one. The stance and engagement commands aren't really needed to succeed here, but they're hard to use anyway, so we consider that a bonus.      Things definitely get much more difficult in the latter half of the game, not because the enemies get any smarter but because they have some particularly nasty tricks they can throw your way. The increased level of danger is initially enjoyable but it's a bit of a fantasy, really. The trouble is that you have so few soldiers at your disposal that it's suicide to press on in the campaign after losing a couple of soldiers. Rather than carrying on and trying to rebuild after a loss, it's almost essential that you reload the game and try to refight the battle so that your soldiers all come back alive.  Some might dislike the slightly cartoonish aspect of the graphics but we found it very refreshing. The art direction is great all around and the bold colors and broad visual designs definitely give the game a visual style that stands out from the crowd. The early levels are definitely a little monotonous with the red sand and all, but things switch up eventually. The level layouts are still a bit predictable but at least the textures are new. Some of the more advanced weapons' effects are impressive but you won't be relying on those quite as much as you will those that have less inspired visual elements.   As we said before, nearly every level has some cool vertical element that makes it feel more like a real location than a flat game level. The canyons, cliffs and scaffolds add a lot to the tactical options and the visual appeal of each level, but they also play hell with the game's camera. Dipping down into gulleys and pits based on the camera's location rather than what it's focused on, the camera can sometimes frustrate your attempts to see what the hell is going on. Otherwise, it allows for lots of freedom of movement and lets you get as close or as far from the action as you'd life.  The sounds in UFO Afterlight are sad. Weapon sounds are thin and not at all impressive enough to provide that extra level of drama that the battles need. The music is bizarre and not in the usual Phillip Glass sci-fi way. This music really doesn't suit the character of the game at all. Some gamers will feel the same way about the voices. Like the visuals, they're a bit cartoonish. There were only a few unit acknowledgements that stood out for us as obviously inappropriate but even the better ones are used so often that you'll soon find yourself reaching to turn down the volume of your speakers.   In the tactical department UFO Afterlight doesn't compete with games like Silent Storm or Commandos 3, so the only thing that sets it apart from them are the overall sci-fi setting and the inclusion of more strategic gameplay. If that's what you're looking for, then you'll definitely enjoy your first few days with the game. We certainly did. Ultimately though, the lack of variety in the battles and the time lost wrestling with a less than convenient base interface will dampen your enthusiasm. For those who have a yen for this type of game, it will do but only until something better comes along.", "date": "Jun 1, 2007"}