{"name": "Need for Speed: Porsche Unleashed", "name_review": "Need For Speed: Porsche Unleashed", "ref": "https://www.ign.com/articles/2000/04/12/need-for-speed-porsche-unleashed", "text": "EA's latest Need for Speed title Porsche Unleashed isn't just a racing game with cool cop chases anymore. The fifth in the series proper, Need for Speed Porsche Unleashed highlights an unprecedented amount of Porsches in one title, but also highlights a massive amount of gameplay options, customizations, and play modes. So many that the title feels like several games in one.  With all of these good things packed into its core, Porsche Unleashed has become something else. It's transformed into several games, and with this latest version, it has grown out of its cop-chasing days to become a mass-market racer with no real reliable feeling, identifying characteristics, or similarities with former games of the series. It's a whole new beast. So, is this a new stage in the series' evolution? Or is it merely a mass-market attempt at trying to please too many focus groups?   Gameplay The phenomenal variety of racing you get from Porsche Unleashed is a good thing. Players can dive into Quick Race Mode and play several kinds of racing without even looking at the manual. Quick Races include Race (head to head racing), Time Battle (race for the best time), Chase (avoid the cops in a limited time frame), and Capture the Flag (nab three flags before your opponent), and all enable from one to four players to complete via the multitap, a first in the PS Need for Speed series.   A solid variety of cars are instantly available, ranging from the 356 B 1600 to the 914 1.7 to the 550 A Spyder to the 911, 924, 944, and 928, some with turbo options, to the 911 GT3, Porsche's most recent racer. It's fat, folks. What's more is that when you play through certain modes in the game, such as Factory Drive, you unlock new cars in Quick Race. You can race more than 70 different Porsches in this game. That's an awesome fact, just on its own.   There's only one catch -- you have to like Porsches. A whole lot. Otherwise, you're screwed. NFS Porsche Unleashed rid itself of any of those other ~unnecessary~ car licenses, such as Corvette, Ferrari, Lamborghini, Mercedes (bah!), and in the attempt to differ itself from ~other~ racers out there with lots of licenses (Cough! Cough! Gran Turismo2, cough!), which don't have the exclusive Porsche license, it's become the one and only hotbed of videogame Porsches. So...let's just hope you like Porsches. A lot.   There are lots of cool little options, too. These options enable you to customize your race, and include changing the level of difficulty, opponents (on or off), lap choice, player number, car selection, name change, and color change. Another simple but sweet concept change that EA has finally learned is to make fast(er) menus. Jeez! Finally. NFS 3 and 4 were terribly slow. This new, sleek, mostly-text based menu is quick, uncomplicated and logical -- except for one spot. The biggest flaw is the four-player car select mode. Four people fight to scroll up or down a menu forcing their opponent's cursor off the screen as they make their own choice. It's a cat fight for who can choose first! Reowww! Bad EA! Bad!   What distinguishes NFS from all other NFS games are the Evolution and Factory Drive modes. Evolution is split into three eras, starting way back in the 1950s and leading up until the present. In Evolution the concept is to enter competitions, weekend races, and tournaments (similar to those found in High Stakes) to earn money to buy better cars. Used or new cars are available and again, a wide variety of cars are there for the pickin'. You race through three classes (A, B, C) in each Era, and only after you have won first in each can you progress to the next era, each signified by its own era video. A percentage marker illuminates how much of the game you have beaten. Evolution makes sense, and is a lot of fun to play. It's highly organized and focused. In fact, it's an entire game on its own. The similarity to Gran Turismo's set up is still prevalent, but because it's so damn ~Porsche-y~ is seems different. But it's not.  Factory Drive is another cool mode, but it feels like an amalgam of other game concepts. It has Gran Turismo's medal system going, but here you earn fancy cars by achieving certain goals, and it has R4 Ridge Racer Type 4's RPG aspect going, as you speak, via text, with Porsche employees who set goals for you to achieve. I liked this mode a lot. You drive extremely fast Porsches in car tests hoping to beat set times, and when you win three or four in a row you earn a new, extreme fast, powerful car, that becomes available in your Quick Races mode. Factory Drive is a lot of fun, but again it feels as if it should somehow be more integrated into the whole of the game. It's a much different mode than anything the NFS series has done before.   Which leaves us where? I mean, what happened to killer cop chases? What about the High Stakes aspect? Porsche Unleashed is a bunch of great modes that all feel different and have different aims. It's five mini games squished into one. It's not anything like the former four games, and because of this fans of the series are going to be split. Some will hate it, and some will love it.   My biggest problem with Porsche Unleashed is that it doesn't feel like a whole game. It feels like a game decided by committee, with lots of little focused sections that have little to connect them except Porches and the name NFS. Just like Gertrude Stein said about Oakland, ~There's no there there.~ That's the problem with NFS Porsche Unleashed. You could call it any other name, and nobody could identify it as Need For Speed.   Graphics When I first plopped the final reviewable disc into the PlayStation, I had mixed feelings. A few of the biggest complaints that High Stakes had aimed at it was its low frame rates, slow menus, and the overall lack of punch that Hot Pursuit had. Usually EA is very systematic about how its handles its sequels, and I figured that these issues would be addressed and handled. Few of them were.   The frame rates are spotty at best. They seem to average around the low to mid 20s, occasionally hitting the high 20s (i.e. 27-29 frames per second). Of course with one car on the road, everything runs pretty quickly. The cars all take damage, a cool aspect from High Stakes that's still here, and EA claims that this damage that affects gameplay. I didn't notice it if it does. So maybe EA simply couldn't reach 30 FPS with each car taking damage, and they chose one over the other. Either way, the frame rates affect the sense of speed, which appears to be good in same areas and worse in others. I'm not talking about the four-player mode either. The single-person game is what I'm talking about.   Graphically, the cars look great in the menus but they look pretty rough in just about every single area. While the car textures aren't the problem, their course and jagged edges are. They and everything else are pixelated as hell. The environments are pretty much scattered with sprites and bland buildings, deserted deserts, and uninteresting European villages. That wouldn't matter so much if they all fit together without any screaming white seams, splitting through every 100 feet and making you feel like it's all about to explode under the thin textures surfaces floating over a small sun.   OK, so you might love the graphics. And if you do, do me one favor. Just compare this game with High Stakes and Hot Pursuit and you'll see the difference. You won't miss the fact that Porsche Unleashed is an overall inferior graphic game to both. This game doesn't suck graphically, but after four NFS games, in the fifth year of the PlayStation, you expect more.   The course design is also mystifying. The game is packed with simplistic straight-aways that are totally boring even with the fastest cars. And then all of a sudden you reach the 90-degree turns. This game is packed with sharp, unforgiving 90 turns. Wha?You have pretty much heard my opinion if you have read the whole article. But if you couldn't handle all those words I'll recap: Porsche Unleashed is a set of mini-games with no cohesive center. The game tries to do too many things, and honestly, with the exception of the pared-down cop chases, the game does them well. But I simply don't feel that I have played Need for Speed after spending 10 hours with it. That's not good. EA should split the game in half, like it should have done a long time ago. Make the cop chases an entirely separate game and split it from the core series. That way long-time fans can still enjoy the series and EA can somehow distinguish the game from its burly competitors. As for the graphics, they appear to be worse than the last two games in the series. So in the end, do I like the game? Yes and no. In some ways it's awesome -- the Porsches, the variety, the modes. In some ways, no -- pared down cop chases, awkward course design, and patchy graphics. This is a tough one. You may love it or hate it, but it's worth playing to find out.", "date": "Apr 12, 2000"}