{"name": "PuzzleScape", "name_review": "Puzzle Scape Review", "ref": "https://www.ign.com/articles/2007/06/04/puzzle-scape-review", "text": "Among videogame genres, the puzzle category seems to be particularly vulnerable to copycat clones.  Whenever a Tetris or a Lumines is released, there are bound to be games that give us a strong feeling of dj vu as those blocks are dropped and jewels are matched.  Sometimes this isn't an entirely negative phenomenon, however.  A game that liberally borrows from a proven formula could provide you with additional hours of the gameplay you previously enjoyed.  Such is the case with Puzzle Scape, a game that bears more than a passing resemblance to Lumines but adds its own twist on musical block-clearing.   Upon first glance it's easy to mistake Puzzle Scape for the PSP's other game where players arrange 2x2 groups of blocks in front of trippy backgrounds along to techno music.  But while Lumines requires players to arrange blocks before they land, Puzzle Scape flips the action to the cubes on the ground.  The screen holds up to 16 blocks horizontally and 13 vertically.  If a stack of blocks reach the top of the screen, the game is ended.  A row of blocks materializes one by one along the top of the drop zone in time with the music.  When all sixteen have appeared, they drop into the bin as a row.  Meanwhile, the player is swapping blocks horizontally in order to create 2x2 squares of same-colored pieces, which will then disappear and allow any blocks above to fall into the empty space they leave behind.   Remind you of anything? Once a 2x2 cube is created, additional blocks of the same color can be added to the group to be cleared in a chain reaction.  The group will explode within a couple seconds if nothing else is added, though, so you'll often be racing against time to add as many same-colored blocks as you can before the explosion is triggered.  A good amount of strategy is involved when arranging groups of blocks to be cleared: in order to get as big a group as possible, you must avoid creating a 2x2 square until you're ready to blow the whole thing up.  You can rack up huge combos if the aftermath creates additional groups as blocks fall into place.   The music in Puzzle Scape is above average techno/dance music, but it lacks the interactive quality found in Lumines.  We found ourselves enjoying the tunes, especially through headphones, but it would have made the gameplay more engaging if our actions affected the music.  Instead, the audio is simply a soundtrack, although an impressive one.  The game's creators describe the backgrounds as ~interactive,~ but it is unclear what interactivity, if any, is taking place.  You won't notice the background much while you're busy clearing blocks, anyway.  After a scene is completed you have the option of saving the background animation and taking screen captures for your PSP's wallpaper.   There are two basic modes in the single-player game.  'Architect' deals out objectives for the player to complete such as creating a chain of 20 green blocks, or composing four 2x2 squares of white blocks.  If you can accomplish all objectives within any of three target time limits you'll earn a gold, silver, or bronze medal, which unlock additional scenes on which to play.  'Artist' mode is more of a free-play type of game where players advance levels as in Tetris and try to build a high score.   Along with the colored pieces there are special blocks that occasionally fall into play.  The Joker blocks, marked with a star, are like a ~wild card~ and can be linked to a chain of any color.  The Blockers, however, obstruct the movement of pieces both horizontally and vertically.  Blockers cannot be moved or exploded -- they are here to stay.   As you're rushing to fulfill objectives in 'Architect' mode, you may find you don't yet have enough pieces to complete the required task.  Pressing the triangle button will toggle 'rush' mode which accelerates the speed at which new blocks fall.  It's a handy utility to quickly fill your screen with useable blocks, but don't forget to turn it off or the stacks will reach game-ending heights rather quickly.   Power-ups add a twist to familiar gameplay. Puzzle Scape includes a host of power-ups to help you build massive chains and combos.  As you clear groups a power meter will fill on the left side of the screen.  The bigger chains and combos you eliminate, the faster the meter will fill.  Once the meter is topped off, one of your available power-ups will be randomly added to one of the PSP's triggers (you can hold up to two power-ups at once).  A new profile will have just three power-ups available, but medals unlocked in 'Architect~ mode will make available a total of 12.  The variety of special abilities include Assimilation (changes all blocks of a certain color to the color of player's choosing), Eradicate (eliminates all blocks of a certain color), and Nuclear Bomb (destroys everything on screen, even Blockers).   To rack up those high scores and power meters, bonuses can be achieved by clearing blocks quickly and in large numbers.  The Mayhem bonus is received when at least three explosions are triggered within one second intervals.  Clear Color is awarded when all blocks of a color are removed from the playing field.   Unfortunately, Puzzle Scape's multiplayer games can only be played if every participant has a copy of the game.  If all your friends do have copies you can play with two people in Co-op mode and work together to clear blocks, or with up to eight people in versus Duel or Bomb Run modes.  In Bomb Run players race to explode a predetermined amount of blocks.  There are no power-ups in any of the multiplayer modes.Puzzle Scape isn't quite as deep as some recent puzzle offerings, but there is some solid gameplay to be found within this UMD.  The music is better than your average electronic fare, and an engaging visual style will keep your eyes from getting bored.  It lacks that addictive quality that is present in all great puzzle games, however.  After a few hours of play we weren't exactly compelled to keep honing our Scape skills or unlock another scene.  It's a competent title to have in a puzzle fan's collection and should provide some occasional entertainment.", "date": "Jun 4, 2007"}