{"name": "Miner 2049er", "name_review": "Miner 2049er Review", "ref": "https://www.ign.com/articles/2007/06/05/miner-2049er-review", "text": "If you remember the magazine Electronic Games, the Commodore 64, and Duran Duran's ~Rio,~ then you're undoubtedly acquainted with the trials and tribulations of Bounty Bob. This platformer is a classic in every sense of the word, earning kudos from the day it launched, including a Game of the Year award from the aforementioned magazine in 1984. And it deserved it.   Miner 2049er for mobile is a pixel-perfect recreation of the original. As a huge fan that owned it on the Commodore 64, I can attest to its incredible adherence to the source. Twenty-year old strategies that saved the day worked like a charm on my test handset, a Sony Ericsson w810i. But developer Magmic, responsible for the mobile edition of Bill Hogue's classic, goes a step beyond just offering a great replica. The game includes a ten-screen modern mode with overhauled graphics, but Magmic smartly doesn't monkey with the mechanics that made it a favorite for gamers.   If you're unfamiliar with Miner 2049er, here's the scoop: Bounty Bob has chased an evil miner into a series of uranium mines. To complete each stage, Bob must step on every inch of the area to change its color and claim it as his own. However, the caves are full of hazards, like slides, gaps, and mutants. The mutants can kill Bob with a single touch, so you must avoid them until you can pick up some prospecting gear. When Bob grabs some gear, like a candle or drill, the mutants are temporarily vulnerable. Like Pac-Man turning the tables on the ghosts, Bob can touch the mutants and banish them from the screen. But unlike Pac, the mutants stay gone.   There are ten screens in both the original and updated modes to clear. Treading on every inch of the mine is not easy, and as you push deeper into the caverns, the mutants become more plentiful and you must deal with things like elevators and vats of radioactive waste.   Fans of platforming will love Miner 2049er. This is classic run-and-jump game play from the school of Donkey Kong and other arcade hallmarks. The controls are simple but responsive -- which is important for a mobile game -- and so any death I endured was strictly my fault. The levels are cleverly designed, so as you play the game you'll discover your own tactics for clearing boards, such as when to use the slides or how long to hold off on picking up mining gear.   Miner 2049er is an excellent value, thanks to offering two separate game modes. The wonderfully implemented visual upgrades don't interfere with the celebrated game play, but it does feel like you're playing a whole new game thanks to slight variations in board layout. And like those old games which never really had an ending, such as BurgerTime, Miner 2049er offers a lot of replay value. I genuinely wanted to keep playing to best previous scores and see if I could reach the next screen -- which is precisely the same reason I logged a lot of hours on the Commodore 64 version of the game when I was a kid.  This classic platformer was good fun in 1984 and it is good fun now. Not every old school game deserves a rebound, but Miner 2049er is definitely a relic of the golden age of video games that merits a new audience. While my enjoyment of the game was certainly boosted by enjoying a jaunt down memory lane, I firmly believe that this is a fun platformer that modern fans of great games like Donkey Kong and BurgerTime need to play.", "date": "Jun 5, 2007"}