{"name": "Milon's Secret Castle", "name_review": "Milon's Secret Castle Review", "ref": "https://www.ign.com/articles/2007/06/05/milons-secret-castle-review-2", "text": "Milon can't communicate. He's a little boy living in a world of music, a world where everyone speaks in verses and song  but he can't understand them. He's totally tone deaf, and, frustrated with his inability to perceive the speech of others, he sets out on a quest to find anyone who can help. It's tough to be Milon.   And it's tough to play Milon, as the storyline woes of Secret Castle's protagonist are mirrored in its gameplay. Milon's Secret Castle is confusing. Counterintuitive. It can't seem to communicate to the player just what's supposed to be going on at any given time  and not knowing where to go or what to do doesn't make for a very fun play experience.   You take control of Milon as he arrives at Castle Garland, a fortress overrun by demons. You find that Milon can run and jump, like any good side-scrolling platformer hero, and that he can also blow bubbles to attack enemies. OK, so far so good. Until you enter into the game's first level, and find there's no way to leave. You're stuck.        You're not actually stuck, of course. The exit door is there. It's just invisible. You can reveal its location with a bubble, after you find a key, which is hidden and only appears after destroying certain blocks and collecting the cash left behind. Huh? Yeah. Milon's gameplay is just plain weird, and may well be in the running for the most confusing, nonsensical game to hit the Virtual Console so far.   Now there were plenty of games in the '80s plagued by counterintuitive presentations. With their limited graphics, abstract play mechanics and lack of upfront instruction, many new titles of the 8-bit age just left players scratching their heads in bewilderment. Even established hits of the era don't make much sense if you think about them  plumbers punching hovering masonry blocks to reveal growth-inducing fungus seemed to work out all right  but Milon just never makes that connection to fun that would redeem its numerous abstractions.   If you do manage to wrap your head around the concept, you'll find that the game does hold a considerable amount of depth  playing Milon's Secret Castle is really more a maze/puzzle experience as the true focus is using Milon's bubbles to try to break nearly every block on the screen, eventually chancing upon the one or two that will fade away and show you the way forward. There are numerous boss battles, hidden items and secret shops to be discovered if you have enough patience, but be additionally warned that you'll also need a fair amount of skill to play this one legitimately  Milon can't take a lot of punishment, and the Game Over screen can come early and often.  Milon's Secret Castle is another of Hudson's early efforts on the NES. And, like Mighty Bomb Jack before it, it falls well short of being fun. Like any old-school game from the '80s, Milon has its own small, cult following  but new players not already familiar with the title will simply feel frustrated, lost, and cheated out of their 500 Wii Points. Invest in a different NES classic instead.", "date": "Jun 5, 2007"}