{"name": "Jackie Chan's Stuntmaster", "name_review": "Jackie Chan's Stuntmaster", "ref": "https://www.ign.com/articles/2000/04/13/jackie-chans-stuntmaster", "text": "Did you know that Jackie Chan's a gamer? He's a sworn Sega arcade game nut, and is known to kick just as much @ss with a joystick as a ladder. So, it should come as no huge surprise that he was quite involved in the creation of Stuntmaster. Not just the motion capture and voice action (of which there is a ton), but he actually helped steer the game's development. But what's even more surprising is how well the game actually turned out.   Gamplay In classic beat-em-up fashion (or Jackie Chan movie plotlines, take your pick), the stage is set with the most basic of plot devices: the family kidnapping. That's right, Jackie, playing the role he plays in nearly EVERY movie, that of the bumbling delivery boy/close relative of the kidnapped. Here, he's the grandson, and surprise, he just happens to be a closet master of Kung-Fu. Hey, works for me.   While most of Stuntmaster's gameplay centers around the normal brawler strategy of ~beat the smack out of that guy, hand this guy his @$$, then take down his friend in an unholy juggernaut of light-speed fists,~ there are a couple of original additions that keep things from becoming far from stale. While this is mainly due to the addition of combos, hidden golden dragon masks also add more to the depth. More on those later.   With very little effort (in fact, if the mood strikes you, you can stoop to button mashing), Jackie is able to pull off some rather complex stings of punches and kicks. I've managed an eight-hit combo, and did little more, than hammer the punch button a bunch of times. Sure, it's mindless, but isn't that what these games are all about? I have yet to see a truly cerebral beat-em-up. In any event, Stuntmaster offers more than throws. Kicks can be held and powered up to unleash a super-kick that will knock enemies to the ground in one hit. It's not that useful, but its fisted counterpart is. The punch power-up, while not insanely powerful, stuns the enemy opening them up to one of three throws. Nobody will confuse Stuntmaster for Tekken, but it is rather deep for a game of this genre.   As for the masks, there are 10 red ones scattered all over the level, some of them well hidden. If you can find all 10, you're gifted with a golden dragon mask. Collect all the golden masks, and you... well, I won't ruin it for you. The point is, this simple task creates far more depth than I've seen in any game like this to date. It enables you to administer beat-downs with reckless abandon your first time through the level then lets you play detective as you track down the masks. It's a totally simple concept, but definitely pays off.   So is Stuntmaster perfect? Far from it, sure there are numerous good points, but there's also one glaring bad one: the control. While moving, fighting, or jumping, Jackie feels like he's waist-deep in water. His movements are slow to execute, and the speed at which he delivers his attacks isn't really up to par with what Jackie is known for. Likewise, the momentum in jumps really takes some work. It doesn't bring down the whole game, but it is an inconvenience, and definitely needs more refinement.   Graphics If there's one thing about Stuntmaster that shines, it's the graphic work. I really can't get over how well the textures and lighting that smatter the various levels (which are equally well done) really do justice to your eyes. Case in point: a neon sign near the middle of the second level. Instead of simply blinking on and off, the sign gently fades in and out, bringing with it a smooth pulse and ebb of light from the sign. It's little details like this, that even on, show what developer Radical Entertainment is capable of. And the best part? It all flows a smooth 30 frames per second. Now I'm not ballsy enough to actually but Stuntmaster on the same pedestal as Final Fantasy or R4, but it is good, and filled with some great eye-candy.   First off, the texture work is just phenomenal. Signs, even small ones are easy to read, and off crisp, clear lettering. Every level goes with a theme, whether it's Chinatown at the beginning or the waterfront right after it, there's often a drastic change in textures from level to level, and I couldn't be happier. Brickwork, seamlessly moves into concrete, and rooftop singles just as easily give way to a red light-splashed wall. Sure, there's not a ton of detail here, but Radical has already learned the golden rule of texturing: less is more. I'm so sick of developers heaping shoddy texture work onto everything, where a simple shading job or colored light source would look just as good.  Likewise, the lighting effects are good looking, too. Colored lighting is thrown around like paint on a canvas, spilling into the nooks and crannies of buildings, and bringing the shadows into light. The aforementioned neon glow is just one instance of many where the lighting was merely used as pupil fodder, but it adds so much to the levels and even their design that I'm still taken aback by how good it is from such a small-time developer.   Animations are solid stuff, too. They show off the various motion-captured sequences that Jackie worked on, from his goofy run to the way he looks around; it's all been captured perfectly here.   Sound Again, this area really shines. Most of the time, I'm left with the task of trying desperately to come up with something to fill this section of the review. So many games are simply average in sound, and while Stuntmaster's effects and music won't win any awards, they are better than average.   What stands out most are the little voice-over bits that Jackie donated to the game. Stuff like him singing lightly if you don't move for a while, or ~I need a chiropractor!~ If you're a fan of Jackie Chan, the little quips should be familiar territory, but it just makes the game seem like more then just a beat-em-up with an action hero's name on it. Unfortunately, some of the stuff the enemies say really begins to grate on you after only a few utterances. The rest of the effects are rather subdued, though. Most landed punches are met with a sort of wet thud.   The music definitely fits, and sounds like something you'd find in one of Jackie's movies. It's soft, but has a driving edge to it, thanks primarily to a constant beat in the background. You'll get Chinese notes and overtones thrown in for good measure, and musically, it's a very full and complete experience, but it won't move you to tears. Jackie Chan's Stuntmaster will satisfy any one looking for a good beat-em-up -- if you can handle copious amounts of Jackie himself. Good graphics, nice combos, and a great reply value thanks to a little treasure seeking add depth to areas that are often lacking in a game of this genre. While the control definitely needs work, it's not enough to ruin the game, and within minutes, you'll have adjusted. Take Stuntmaster for a spin, I'm sure you'll find it's one of the best brawlers in recent memory.", "date": "Apr 13, 2000"}