{"name": "Prince of Persia", "name_review": "Prince of Persia Classic Review", "ref": "https://www.ign.com/articles/2007/06/11/prince-of-persia-classic-review-3", "text": "You leap over a pressure-sensitive floor, narrowly avoiding the deadly spikes that spring out of the floor. You quickly tuck and roll, just moments before a second set of spikes can impale you. As you get to your feet, the floor begins to shake. It's only by great fortune that you sprint across the crumbling tiles and make the jump to stable ground in time. But there's no moment to catch your breath, because a man is wagging a scimitar in your face. The clash of swords echoes through the dank dungeon. After a series of well-timed parries, you drive your sword through the gut of your opponent and leave him dead next to the skeleton of a previous adventurer. You rush forward, confident that you can take on any challenge. Then a blade drops from the ceiling and kills you instantly. You die before you have a chance to feel the pain. This is Prince of Persia Classic.   In 1989, the Apple II became the launching pad for one of the most important platformers of its generation. No, not Mario or Sonic: Prince of Persia. Jordan Mechner's classic title featured revolutionary animations, challenging sword-dueling combat and tricky death traps. The original POP was known as much for its merciless difficulty as it was for its spirited sense of adventure. And now the original Prince of Persia has been reborn on Xbox Live Arcade.   With the Sultan MIA, the Grand Vizier, Jaffar, has taken hold of the kingdom. He's imprisoned the fair princess and demanded her hand in marriage. She has 60 minutes to decide -- marry Jaffar or die by his hand. The princess's only hope is her would-be suitor, who's just been imprisoned in the palace dungeon. If the princess is to be saved, you'll need to fight your way out of the dungeon and reach Jaffar before time runs out. It's kind of like 24, only with a more believable plot.   POP Classic, priced on the high-end for XBLA titles at 800 Microsoft Points (US$10), is a faithful recreation of the title that started the franchise. The map layout is identical to the original, but that doesn't mean this is the exact same game. In fact, developer Gameloft has made some welcome improvements to POP.   The graphics are the first and most notable change. While most ~enhanced~ XBLA titles throw in some stylish explosions and call it a day, POP Classic has been fully redone to be on par with (and perhaps even better than) Prince of Persia: The Sands of Time. For an XBLA title, that's a high level of quality. The palatial backgrounds in the later stages are gorgeous and the animations are fluid. In fact, the animations in POP Classic rival some full-price Xbox 360 titles.   Combat can be tricky. If you don't parry, you will die. Beyond the graphics, Gameloft has added one checkpoint in almost every level. This is a great help, because it's not always easy to make it through the treacherous pathways of a full level without dying. The combat system, difficult for the wrong reasons in the original version, has been refined. It's still very tough at times, but it is enjoyable. While the early battles might fool you into thinking combat is merely parries followed by attacks, the second half of POP Classic proves this wrong. You'll sometimes parry an attack only to have the enemy quickly respond with another attack, never allowing the chance to counter. This can feel cheap, until you realize that you can still parry these attacks as well. Combat in the latter stages is often a long string of blocks and evades on both sides. Button mashers will find a sword stuck in their gut more times than not.   The platforming elements are the shining star of the show. The obstacles are pretty straightforward -- spikes on the ground, chopping blades from the floor and ceiling, crumbling platforms, and lots of chasms to leap across. Most of these deadly elements are fairly obvious, but since you're in a time crunch, you're forced to move quickly. And moving quickly means you won't always spot the telltale signs of the palace's many traps. Why anyone would want a spiked floor in the hall leading to their living quarters is anyone's guess. Just know that you're likely to run into some.    For many, the first time through POP Classic will be a failure in some measure. It's very possible you won't reach the princess before time expires. But for some reason that doesn't actually matter. Even after time run outs (and a short cut-scene shows the princess has chosen death over marriage), you can still save the girl. Take 20 hours if you need it, because in the end you still fight Jaffar and somehow the princess is still alive. Granted, you get a bonus 10-second cut-scene if you make it through the 14 levels before time runs out, but it's not a make-or-break proposition. It's nice that POP Classic is a little friendlier to gamers, but this aspect does seem to take things a tad too far. Also unnecessary is the optional butterfly that shows the prince where to go. Part of the charm of the original version was that there are some dead ends; but you only find out through exploration. The butterfly negates some of that if you leave it turned on.   That hardly seems sporting. Prince of Persia Classic has only one significant flaw, but it's considerable. The game, by the very nature of its concept, is only about an hour long. Though there are two bonus modes -- Time Trial and the ~one life to live~ Survival -- it's still the same 60-minute game. Even the cool ghost feature, which enables gamers to race their previous best attempt at a level, isn't enough to merit more than a second playthrough. Because POP Classic was developed before Microsoft increased the size limitations of Arcade titles, the original un-enhanced version of Prince of Persia could not be included.  It's been years since I played the original POP. It's a game I couldn't finish as a kid, but thanks to Gameloft's friendly redesign, I've raced through it four times now. The seeds of Ubisoft's recent Prince trilogy on Xbox can be found here -- even the dark alter-ego of the Prince plays a role. Prince of Persia Classic is certainly short, but it's oh so sweet. This is one of the best games released on XBLA to date and the template all future enhanced classic games should follow. If it weren't for the brevity of the experience, POP Classic would be, well, an instant classic. Still, if you can accept that you won't get more than a couple hours enjoyment from the $10 download, do yourself a favor and check out Prince of Persia Classic. It's one of the elite among Xbox Live Arcade games.", "date": "Jun 11, 2007"}