{"name": "Surf's Up", "name_review": "Surf's Up Review", "ref": "https://www.ign.com/articles/2007/06/11/surfs-up-review-2", "text": "Anybody else wishing these penguins would just chill for a little while? These flightless birds have been pounding the big screen with no fewer than three movies, including Sony's ~Surf's Up,~ which bowed last weekend to decent box office. Ubisoft released a surfing game that specializes in accessible controls -- it's actually a solid casual game to zone out with -- and now Gameloft lines up a mobile edition that offers both surfing scenes and traditional platforming antics.   Much like the movie, Surf's Up suffers from an initial blast of familiarity. As I moved Cody the penguin across an icy landscape, collecting shells, and making big jumps, I couldn't help but flashback to Capybara's Happy Feet game, released only last year. The games are similar, as you must collect items to earn bonuses and make with the running and jumping. But after a couple levels, Surf's Up starts to pull away by offering some sped-up action and the surfing scenes.   The platforming levels traffic in genre staples: Lots of running, jumping, and bouncing. In this case, you're bouncing off walrus heads or riding geysers that break through the ice. The walrus heads often bounce you to high ledges full of shells and letters that spell out ~surf.~ If you collect all four letters, you get to play a bonus level to earn an extras life. There is some Sonic the Hedgehog action in here, such as surfing through loop de loops in the ice and timing jumps when you're flung off a ledge at high speed to reach hidden areas. There is a little combat in these levels, too, as Cody uses a leaf to bat back animals.   The surfing element is breezy and fun. You skirt across the waves, collecting shells and avoiding debris. The surfing scenes also host boss encounters, such as showdowns with the surf champ Tank. You can hit currents to speed up and pull off mid-air tricks after launching from ramps. Too bad I just came off of Gameloft's own Pirates of the Seven Seas, which also employed a surfing sequence. Surf's Up has the better vibe, but my enthusiasm was certainly blunted. If you skipped Pirates, though, these scenes in Surf's Up will undoubtedly feel fresher.   Surf's Up also slips beneath the surface for some diving. Cody pushes through the chilly blue, paddling behind his board to collect more shells and avoid getting bumped by the denizens of the deep.   Like many of Gameloft's side-scrollers, Surf's Up is predictable but still enjoyable. Ranked against their Shrek the Third, Surf's Up definitely comes out on top. There's just more game here and the surfing sequences are more fun than the dragon shoot-'em-up.   Surf's Up looks fantastic -- this is a colorful game that is sure to please the peepers. The penguins in Happy Feet may have been cuter, but Cody and his friends are more detailed and better animated. The backdrops explode off the tiny screen, full of bright blues and greens, occasionally punctuated by pinks and yellows. The music and sound is also quite good, but this is an area where Gameloft has always excelled.  Surf's Up is a fun side-scroller that is sure to please fans of both the movie and classic, 16-bit style platforming. The visuals are excellent, thanks to a wonderful use of color and some nicely detailed characters and environments. But it must be said that, even though Surf's Up is good, Gameloft is in a slight holding pattern here. I think if you've played the majority of the mobile giant's side-scrollers, Surf's Up will hit expectations but certainly not blow your mind. However, as an entry point to mobile gaming beyond puzzle games, Surf's Up stands to wow more than a few players just dipping their toes in the water.", "date": "Jun 11, 2007"}