{"name": "Pitfall: Beyond the Jungle", "name_review": "Pitfall: Beyond the Jungle", "ref": "https://www.ign.com/articles/1999/06/17/pitfall-beyond-the-jungle", "text": "As part of a slim initial slate of titles for the newly released Game Boy Color, I had high hopes for this one. Few games had yet taken advantage of the new system's capabilities, so I was eager to see just how far this title could push the envelope.   Features  15 Levels. Plenty of traps and enemies. Single player only. Password Feature. Compatible with Game Boy Color and Game Boy.   The Game  The original Pitfall on the Atari was a classic, and later incarnations were also pretty entertaining if somewhat derivative of Indiana Jones (See, it's an axe, not a whip; it's DIFFERENT). But little could have prepared me for the horror that this cart represents. In an attempt to gain some sort of closure, I've asked the game's protagonist, one Pitfall Harry Jr., to sit down with me for a chat. Join us, won't you?   GBCD: Hi there, Harry. How are you feeling? Harry: A bit sore, actually. Those bottomless pits really take it out of you. GBCD: I'm sorry to hear that. Have you considered not falling into them quite so often? Harry: I have. Problem is, every time I get to one, my motor control just seems to leave me. I jump and I jump and it's really just a matter of chance if I make it to the other side. Gravity hates me. GBCD: Ah yes, a sad but not wholly uncommon affliction. I hear Simon Belmont of Castlevania fame has started a support group. Harry: I heard that. His whole family has that problem. Must be genetic. Anyway, it's in my name, so I guess that's one strike against me right there. I'm still trying to figure out why my father thought Pitfall was a name that needed to be passed on. GBCD: Tragic. I can give you Donkey Kong Jr.'s number. Harry: Yeah? What's he doing these days? GBCD: Not sure, actually. I think he's in insurance. Jr. never got over his father's career dominance, especially after he worked so hard to clear up that whole bondage scandal with Mario. And apparently Diddy is claiming relation by blood now, so it's a big mess. Harry: Man, things are tough all over. So you wanted to talk about my recent expedition to South America? GBCD: Ah, yes. Did you find anything interesting? Harry: No, not really. GBCD: Nothing at all? Harry: Well, I'll tell you Steve, I went down there to handle this situation with a bunch of yahoos called the Momo's or the Maki's or something primeval like that. Apparently there was this evil Scourge and some mess involving red magic and blue magic, yada yada yada. Honestly, I was about to blow the whole thing off when this half-naked native chick shows up at my apartment, chattering away. What was I supposed to say? No? So I went. GBCD: Fascinating. Harry: I wish. Run run jump. Run run run swing jump. Collect some meaningless crystals. Jump swing kill something jump run. Fifteen minutes in I was leaping off of ledges just to break up the monotony. GBCD: Still, I bet you got into some interesting skirmishes with the wildlife down there. Harry: There were snakes and scorpions and stuff, I think. In retrospect they all kind of run together. I remember they were all pastel and poorly drawn. They pretty much just ran back and forth waiting for someone to put them out of their pixelated misery. GBCD: Hmm, yes, I can see how that might be a downer... Harry: And another thing! The scenery there is SO pass. I mean, don't get me wrong, the independently scrolling background was kind of nice for about five minutes...Reminded me a bit of my Super Nintendo days. But it didn't last. It was just one boring vista after another: Jungle, volcano, ruins, YAWN... GBCD: Still, it WAS in color. Harry: Color schmolor. GBCD: Hey, watch the language, Harry. Kids read this stuff. Harry: Well, I'm sorry, but just because a game is in color doesn't mean that you can get away with obnoxious gameplay and a terrible design. GBCD: Amen to that, brother. Say, maybe I could swing you a position on our review staff. Harry: Really? What's it pay? GBCD: It doesn't. Harry: I'll be in touch. GBCD: Yeah, OK. Well, I think we're about done here. Can you give us something good to end on? Harry: Well actually, after I finished up my adventure (and I use that term loosely), Crave sprang for a few days in Rio during Carnivale. I met this girl, I forget her name. Matilda, I think. Anyway, she was a dancer in the parade and in lieu of clothes she wore this neon body paint. She was capable of things you wouldn't believe. She could put her legs behind her he... GBCD: Goodnight folks!   Gameplay Value: Nil. Play a good Mario sidescroller and spare yourself the misery.  Harry about covered it. It's quite apparent that the designers of this game were under pressure to simply get a color game out FAST. They did. And I'll wager they sold quite a few copies because of it. Unfortunately, all semblance of quality went out the window. Note to video game execs: GIVE YOUR DESIGNERS THE TIME THEY NEED TO DEVELOP THESE GAMES PROPERLY. This may result in less titles released, but if you produce a quality title (Pokmon ring any bells?), you'll make up for it in increased sales. More importantly, you'll earn the respect of your customers. Remember that you can only produce so much inferior product before the public learns to stop buying it. Steve Averett reviews games for IGNpocket's #1 affiliate, GBCDojo. Be sure to stop by GBCDojo for everything Game Boy Color.", "date": "Jun 17, 1999"}