{"name": "Yu-Gi-Oh! 2007", "name_review": "Yu-Gi-Oh! World Championship 2007 Review", "ref": "https://www.ign.com/articles/2007/06/13/yu-gi-oh-world-championship-2007-review", "text": "It's been a long road for Yu-Gi-Oh. The Konami-developed card-battle brand has gone portable countless times, first on the Game Boy Advance, then, more recently, on Nintendo DS.    Nightmare Troubadour was the name of the first dual screen effort, and it was a step up from the hit-or-miss designs seen on the GBA. Spirit Caller came next, debuting just earlier this year, and further refined the dueling experience by adding support for Nintendo Wi-Fi Connection.    Now, it's Yu-Gi-Oh! World Championship 2007. This latest release takes one more positive step for the franchise, continuing the slow evolution of the series towards becoming something truly remarkable. But it's not there yet -- there's still room for improvement.    World Championship 2007 isn't so much a game as it is a piece of gaming software. A conversion of the card lists and ruleset for the physical Yu-Gi-Oh! Trading Card Game, it's the digital way to play a traditionally analog game. It can be played as a standalone video game just fine, but it's not presented as one in any normal sense -- there's no story mode, no adventure. Just dueling.      That can sound intimidating for any Yu-Gi-Oh newcomers, and perhaps is. History would certainly support that view, as past titles in the series have been anything but friendly to players not already versed in the ways of the deck. Interestingly, though, that's not the case here at all -- newbies may well be scared away by the lack of a narrative structure to progress in World Championship 2007, but if they stick around they'll find, at long last, a full and robust tutorial explaining every aspect of how the Yu-Gi-Oh! TCG is played.    The tutorial mode is hosted by anime character Neo Spatian Aqua Dolphin, a sentient cetacean whose bottlenose points you to nearly hours' worth of rule set instruction. You're first taught to summon and place monsters, how to attack and how to defend. Then you'll learn about spell cards and traps, then more complicated concepts like fusing multiple cards together, linking combos and more. After every lesson, a quiz tests to see if you were paying attention -- and after every few quizzes, there's a practice duel against the Dolphin himself to make sure you're getting it right.    It's a time-consuming but ultimately worthwhile way to learn the ropes of this complex card battle game. So much so that these tutorials, combined perhaps with the viewing of a few of the Yu-Gi-Oh anime's episodes on Cartoon Network, would be just enough to give total newcomers access to this vast gaming subculture.    World Championship's primary focus remains the established, diehard players, though, so the features found beyond tutorial mode still cater to that hardcore crowd. You can customize your own anime avatar with a selection of different faces, hairstyles, hair colors and outfits. You can practice dueling against computer-controlled opponents. You can take part in themed duels, or rules-limited duels, or win-in-one-turn puzzle duels, all of which will hone your skills even more. But then it's time to go online.   It's all about the Wi-Fi Connection for WC '07 -- to such a degree that, left completely offline, the game would be hard to recommend. The single-player experience runs dry past a certain point, meaning meaningful competition will ultimately be found only through the challenge of other humans through the 'Net.    Like any other Wi-Fi DS title, Yu-Gi-Oh battles can be spoiled by cheaters or disconnectors too shamed to take a loss. But worthwhile opponents are out there, and games played as intended are fluid and fun. One of the coolest features of Yu-Gi-Oh online is ghost data download -- worldwide leaderboards are kept up, listing the top players from both your chosen home country and from around the globe.    And, selecting anyone on the list, you're given the option to download their data and face off against their decks in offline battles. It's not the same as taking on the actual human head-to-head, but it's still a boost to your ego if you can manage to take down the #1 ranked player's deck with your own, more meager stack of cards. Pokmon Diamond and Pearl offer a similar feature in their hardcore-targeting Battle Tower, and it's a blessing to the longevity of a title to have constantly-updating downloadable content like that. There will be new opponents to take on for months, maybe years, to come.Yu-Gi-Oh! World Championship 2007 is an all-around impressive presentation of Konami's card-battling craze. Most of the things now holding the design back from true greatness are wishlist features  voice chat during battles would be nice, as there's no current way to communicate with your opponent  and other additions could further encourage new players to give the game a try. The lengthy, detailed tutorial mode is a big step in the right direction, but this package cut out any kind of single-player adventure. One step forward, one step back. If you've never given Yu-Gi-Oh a try and are curious, you can safely start here  just supplement your play with some episodes of the show and you'll fill in the blanks. And if you're a hardcore duelist already, definitely invest in this Championship. You'll be entertained for hours, days, weeks and months to come  and you might just become the #1 battler in the world.", "date": "Jun 13, 2007"}