{"name": "Overlord", "name_review": "Overlord UK Review", "ref": "https://www.ign.com/articles/2007/06/14/overlord-uk-review", "text": "According to Peter Parker, with great power comes great responsibility. Pah, what a load of superhero-spouting rubbish. We'd much rather adhere to Overlord's philosophy, that with great power comes the chance to destroy homes, kill sheep, woo buxom wenches, wipe out entire species and, um, urinate on carpets. And speaking from experience, abusing power is a lot more enjoyable than being responsible with it.   Thankfully then, Overlord is bursting with opportunities to be evil. In fact that's pretty much the aim of the game - to cause as much mayhem as you possibly can. Think of it as the perfect job for an ASBO-hoarding kid, where the meaner you act the bigger the rewards you receive.    Red minions are great for putting out fires - or starting them.  But before we get too involved in how to be the ultimate badass, first let's have a bit of background history. Things were going pretty well for the forces of evil, with innocent villagers running scared from the all-conquering Overlord. Only it turns out he wasn't all-conquering, because his tyranny was brought to an abrupt end by a group of goody-two-shoes heroes who knocked him off and left his kingdom to rot. But just as peace was beginning to spread across the realm once more, a spiritual successor to the long-dead tyrant emerged from the darkness, ready to bring chaos to the land once again. You are the Overlord, get ready to teach the good guys a lesson they'll never forget.   Clad in steel armour and wielding a bloody great axe, the objective of the freshly-appointed Overlord is to stomp through picturesque villages killing and maiming innocents. For every drop of blood spilt you're awarded life-force, which forms the basis of what the game is all about. You see, no self-respecting evil dude would do his own dirty work, instead calling on his army of minions to do it for him. That's exactly what happens here, with players cashing in the lifeforce they've collected in return for an army Minions - little goblin-like creatures who obey you're every command.    As such you don't actually spend that much time slaughtering enemies; instead you bark orders at your Minions (although you can also control them directly using the right analogue stick), telling them to attack villages, gather artefacts with which to kit out your castle and generally cause havoc.    We're thinking of getting minions for the office. To bring us tea and cakes.  At first players only have five minions at one time with which to do their dirty work, but later in it's possible to amass a battalion of 50 fiendish followers. Thankfully, even with this number of critters on-screen it's easy to keep track of your horde's progress and keep them in check, because the controls are quick to pick up and easy to use. You can either control the minions directly or highlight an object for them to attack. Your army can be broken down into a number of groups too, enabling you to flank the enemy if you're clever and quick enough. Also, even when the screen is packed with Minions there's no visible slow down, which is a nice touch.   Learning how to best use your army is the key to success in the game, especially as you discover new types of Minion. Initially you only have access to the browns, who are great brawlers but not much else. However, later in the game you unlock reds (shoot fireballs; absorb flames), blues (water resistant; can revive minions) and greens (withstand poison; turn invisible for stealth attacks). Knowing how to make the most of the Minions at your disposal is paramount to your survival, because while the greens can easily knock off an enemy in seconds if they manage to sneak up from behind, if they're ambushed head-on they won't last a second.    As well as adding another layer of tactical depth to the combat, the different minion types add a puzzle element to core gameplay. For example, only the blues can survive in water so you need to use them to flick a switch at the bottom of the lake, or similarly the greens are the only Minions resilient enough to get through a poisonous patch of flowers.   Unfortunately that's pretty much as complicated as the puzzles get on Overlord. What's more they're all linear, which is a bit of a disappointment because more could've been done with the different abilities of the Minions. A more pressing problem, however, is the relentless backtracking you'll inevitably have to endure to build up an army of the right Minion types. You see, different Minions are spawned from different pits, which are dotted around the levels. So if you reach any area where you need a load of reds and you're army is currently running on empty, you must traipse all the way back to the previous red spawn point. What's more, you can't always predict what minions you need for a stage so this happens far more than it really should.   Zombies are just one of the many enemies you'll bash to bits.  Despite this irritating niggle it's hard to get frustrated with the irrepressible Minions because they're so much fun to play around with. Rather than a mindless horde you boss around they have a real personality, so much so you'll laugh when they pick up rat corpses and pumpkin skins to use as makeshift bits of armour. This artificial intelligence impacts on the gameplay too, because it increases there defence. It's therefore extremely worthwhile smashing every object in a level on the off-chance your Minions can use the debris in some way. And while this may sound rather tiresome, when you see the way the minions jump on the back of enemies or ransack a cottage it's hard not to chortle at the chaos they're causing.   If you hadn't already guessed, Overlord benefits from a great sense of humour. From the first time you slaughter a sheep or meet the emo-like elves you can't help but play with a grin on your face. The storyline is often laugh-out-loud too, which is refreshing because many fantasy games take themselves too seriously. There's no Blade of Evendell or Cloak of Perpetual Twilight here, just tongue-in-cheek humour that pokes fun at many of its more straight-faced peers.   However, despite the humorous approach to the game, developer Triumph Studios has still managed to create a wonderfully rich and detailed fantasy-inspired world, with graphics to marvel at. There are fields full of flowers, lush elven forests bursting with glowing trees and rippling pools of water in dank dungeons. Every area is a joy to look at, so much so the gorgeous presentation is often the key to driving you onto the next level, to see what the game has in store.    Your Dark Tower is the base of operations for your evil empire.  This polished quality also permeates through to the Live multiplayer, which takes place in beautiful locations from the single-player game. There are two different modes you to play, including co-op and versus. In co-op you play with another Overlord in an attempt to best a range of increasingly strong enemies, whereas in versus you're tasked with beating your opponent in a race to collect either the most treasure or kill the most enemies. In reality both are throwaway additions to the Overlord package, but are still enjoyable if you want a short burst of action with a mate.Overlord takes everything you think you know about the fantasy genre and turns it upside down, then adds a dash of mild violence, a splash of toilet humour and a twisted storyline. The Minions are a novel creation and ensure Overlords gameplay is like nothing else on Xbox 360. Commanding the chattering mass of destruction is thrilling and it never becomes tiresome, thanks to different Minion types and the urge drive to collect new or bizarre weapons and armour for them. Admittedly the puzzles are a little linear and there are times when youre required to backtrack through levels, plus the simple multiplayer will hardly set the Live world on fire. But if youre looking for a barrel of laughs and a game that's both interesting and fun at the same time, prepare to bow down to Overlord.", "date": "Jun 14, 2007"}