{"name": "Rainbow Six: Urban Operations", "name_review": "Rogue Spear: Urban Operations", "ref": "https://www.ign.com/articles/2000/04/13/rogue-spear-urban-operations", "text": "With last year's release of Rogue Spear, the sequel to the mega-hit realistic shooter Rainbow Six, Red Storm Entertainment proved that they weren't just one hit wonders.  We couldn't get enough of Rainbow Six around the IGN compound when it was released (hell, we even had those console monkeys Matt and Aaron from IGN64 playing with us every day after work...and during work for that matter), and the spark was rekindled when Red Storm gave us Rogue Spear last fall.  Now, seven months after the release of Rogue Spear, we were looking for something to get us back into the game, and it looks like our prayers were answered.  Red Storm recently released their expansion pack for Rogue Spear, Urban Operations, and it's brought Rogue Spear madness back to IGN, making us crouch, lean, and peer around every corner on the way to the bathroom.   Like the name implies, the missions in Urban Operations take place in metropolitan areas ranging from a crowded marketplace in Istanbul to an underground tube station in London.  These new environments are well designed and really capture the feel of their real-world counterparts.  Level design has always been one of Red Storm's strong points, and it carries over into Urban Ops.  These are some of the best maps ever for any realistic FPS.  One of the neatest extras that these urban settings offer is the addition of innocent bystanders...well at least in the open-air market.  This adds a whole new strategy to the game as you'll have to be careful not to shoot any of these random people and it would have been nice to see civilians on more levels.  As good as the level design is, though, the expansion pack only adds five new single-player missions.   In addition to Istanbul and London, you'll have to disarm a bomb in Venice, save hostages in Hong Kong, and eliminate a terrorist group in Mexico City.  As you can see, you'll be jumping around the globe a lot, but your world tour isn't going to last very long.  With only five missions scattered at the corners of the globe [editor's note: Tal has a Masters in Geography and if anyone knows that globes don't have corners it should be him, but apparently they don't teach that at that fancy-schmancy Ivy League school that daddy sent him to], it's hard to keep a logical storyline flowing throughout the game.  As cool as these new urban settings are, the missions didn't have any rhyme or reason for following one another, and there was no central story that tied them all together.  Another slightly frustrating downfall of Rogue Spear: Urban Operations is the shear difficulty of the game.  Urban Ops is unforgiving.  One innocent gets shot while you're transporting the last hostage to the extraction zone and you have to play the entire mission over again.  Make too much noise and the edgy terrorists might shoot all of the hostages, making your rescue attempt useless.  Lean around a corner too quickly and dead-eye Johnson standing in a window slit a half mile away will almost always shoot you right between the eyes.  Sure, these reactions make your role as a highly skilled operative that much more important and realistic, but the AI seemed pumped up to the max in Urban Operations.  I found it completely unrealistic that all of the enemies were perfect shots, even with pistols at 2000 paces.  Even my snipers weren't as good as the enemy AI in many cases, and they've been doing this kind of stuff for years.  Urban Operations almost requires auto aim in some missions, something I never had to use in the original.  This level of difficulty prolongs the game and makes you replay the same mission over and over until you get it exactly right.  While this adds to the play time of the game, it is going to frustrate some gamers who want to move on to a new area, and may turn off ~instant-gratification~ gamers completely.  In addition to the five new urban missions, you'll be able to play through five of the original missions from Rainbow Six, only now with enhanced graphics. We were happy to see the original missions reproduced in Urban Operations included some of our old-time favorites, like the Bio Lab and the Amazon level.  Several of these, like the one where you have to infiltrate a country estate and plant a bug in the phone, are stealthy missions that only call for one team member to complete.  I personally love these types of missions as they require a bit more thought and planning than simply bursting in with guns blazing.      While the classic missions look great compared to their Rainbow Six brethren, the Rogue Spear graphics engine is really showing its age.  The realistic character models still look good, but the surface textures look washed out and mottled, and the environments themselves are jagged and extremely dated looking.  I guess that's the problem with making ultra-realistic environments though...people know what it's supposed to look like in real life.  I also ran into many more clipping problems than I found in the original.  Fortunately most of these problems were confined to falling through walls after I got shot, so it didn't affect the gameplay, but it's still something I hope the designers look into for future sequels.    In addition to the new single-player missions, the expansion pack adds eight new multiplayer maps.  Overall the gang at the zoo we call IGN was impressed with the new maps, especially the bunker, the training maze, and the underwater habitat level.  There's also a whole new gameplay type, defend, which puts you in the unenviable shoes of a lone operative defending a switch from a group of invading terrorists...and these guys really want to push that button.  Overall, we still like assault and terrorist hunt around the office the best because we can play as a group.  Defend is good for a few solo kicks, though.  Like any expansion pack, Urban Operations adds a few new implements of destruction to your armory.  There are only four new guns -- the rapid firing M249 SAW, the Russian-made RPD machine gun, the HK 21E3, and the AW Convert sniper rifle.  The new guns didn't add much to the game, especially since Rogue Spear already included such a large and varied arsenal with plenty of machine guns and sniper rifles.  My favorite combo is outfitting my teams with a M16 A2, a suppressed .45, and a butt-load of frag grenades.  I've never known overkill to let me down, unless I'm going in solo.  The expansion pack is rounded out with a MOD manager that lets you overlay new MODs with ease.  This new feature was actually really, really neat, and it makes adding MODs to Rogue Spear simple enough for anyone to use.  I hope to see this feature in a lot more games in the future.  In the end I loved the urban settings in the Rogue Spear expansion pack as well as the new multiplayer maps, I just wish there would have been more.  The new weapons don't really do much to enhance the game, but there was already a substantial arsenal in Rogue Spear to begin with, so I really can't blame Red Storm for not including more.  The graphics engine is definitely going to require a major overhaul in future iterations of the series too. But overall Urban Operations is a better than average expansion pack, if just for the level design alone, but it's too damn short.  We know you have it in you, Red Storm, so please give us more next time.  -- Tal Blevins", "date": "Apr 13, 2000"}