{"name": "Fantastic Four: Rise of the Silver Surfer", "name_review": "Fantastic Four: Rise of the Silver Surfer Review", "ref": "https://www.ign.com/articles/2007/06/15/fantastic-four-rise-of-the-silver-surfer-review", "text": "I know it's cliche to think that any game based on a movie franchise is immediately going to suck, but if games like the DS version of Fantastic 4: Rise of the Silver Surfer continue to get made, that cliche is going to keep thriving. Pulling no punches here, this DS game is awful: terrible concept, bad level designs, poor use of the franchise. And it's ugly -- I've seen better looking Game Boy Advance titles. Whether or not the movie's a success is still up in the air as of this writing. What's known is the videogame version's lousy.   According to the manual, the Nintendo DS game has been developed by the same creative force that's produced the console version of the Fantastic Four game: 7 Studios. The team's been all over the place in game quality, from its Defender remake for Midway to the Sopranos PlayStation 2 title. But 7 Studios doesn't have much in the way of handheld experience, and it really shows. Shoddy production values plague the game. It looks bad, plays bad, and is bad.   The DS game follows a similar story structure that the console games follow, but that's pretty much where the similarities end. This game is a very rudimentary side-scrolling action platformer where each level follows one of the four different Fantastic 4 characters, starting with The Thing. It's a rigid, uncreative run, jump, and punch design with controls and movements that are badly tuned -- the characters jump around like Earth suddenly has the gravity of Jupiter or something. The Thing, The Invisible Girl, and Mr. Fantastic have similar design structures even if their abilities are completely different. The Invisible Girl's levels show just how incompetent and clueless the level designers are: she doesn't jump, instead she floats around on a force field wherever she can go. So why did they create levels that have moving platforms if she can just float over them?   The Human Torch is the only one with decidedly different levels than the other three, opting for a two screen tall vertical shooter that's duller than dirt to play. Vertical shooters are a dying breed, and this one's simply dead in creativity -- move and shoot until the end. Dreadfully boring, and yet the designers recycle this design for levels featuring the Fantasticar between missions.      The DS elements are few and far between, and almost completely unnecessary 90 percent of the time. In the platformer, the designers use the lower screen for nothing but a data screen and a touch panel to activate power-ups. This is a first-generation cop-out, simply because most of the screen's being used to display a promotional photo of the character that's being played, and that the power-up activation could have simply been offered on a free button. Boss battles are stylus controlled, but they're worse than any of the ~bad~ mini-games in Wario Ware.   Adding to the crumminess of the DS game is the poor programming and art. The 2D engine is sluggish and buggy, featuring slowdown in places where it's inconceivable why the game's slowing down. Background artwork and character sprites are poorly rendered and lack a lot of detail. This game would have been slammed if it showed up on the Game Boy Advance.   And even if you found the game the least bit fun and wanted to see it all the way through, it's poorly structured -- the designers try to encourage players to explore every nook and cranny to find extra gems to unlock Fantastic 4 comic book covers (honestly not that big of a deal), but once you finish a level you have to move on to the next. There's no option to decide to go back to a previously completed level in order to find the elusive pick-up that'll unlock the cover you missed.  It was a game with potential, and instead it's simply a contractual obligation. Apart from the energetic musical score, there's nothing good about the Nintendo DS game. This is simply shelf fodder, the game grandparents will blindly buy for Little Timmy because the parents took him to see the movie.Poor Little Timmy.", "date": "Jun 15, 2007"}