{"name": "Jeff Gordon XS Racing", "name_review": "Jeff Gordon XS Racing", "ref": "https://www.ign.com/articles/1999/06/18/jeff-gordon-xs-racing-4", "text": "Jeff Gordon, the youngest three-time winner of the Winston Cup, has finally released his racing game. All in all, I've got to say I'm impressed. There's a lot of stuff that's lacking but you find yourself not minding so much because you're actually having fun. The game is really scaled down in terms of realism. Obviously they are going for an arcade type feel with this one.  The arcade feel is something hard to get on a PC and I have to hand to ASC and Real Sports for the job they've done. Not that the game doesn't have its faults. Goodness knows it isn't that. But overall it's a fine effort. Let's get to specifics.  The cars are supposed to handle like Ferraris but I didn't see it. Not that I've ever driven a Ferrari, but I can still have an opinion, right? I mean, that's my job, isn't it? As far as the handling goes, you'll find the cars have more in common with some of the classic arcade racers. Realism is definitely not the main goal here. Not that that's a bad thing. In fact, after all the hardcore racing sims I've had to play lately, this was a nice break. Although the game does have some hardcore elements to it, for the most part it's a very simple racing model. You steer, accelerate and brake. You can, if you want, race with a 4 speed manual transmission instead of the automatic.  You can choose from four cars at the start. As you progress further into the game, more cars will become available. Cars are rated in terms of weight, horsepower and top speed. In addition, each car has unique braking and cornering abilities. You can also independently adjust the tightness of the steering. None of the cars are too extreme in any one performance area. In fact, I think most of the cars are too much alike. More range would give you an opportunity to experiment with various racing styles. As it is, most of the cars race pretty much the same.  The cars look pretty good overall. Each has a fairly distinct design and most are rather neat looking. In addition to choosing a car type, you'll have the chance to pick from eight sponsors. The only effect the sponsors have is in the appearance of your car. Each has a unique color palette. This gives you a chance to further customize your racer but as far as I can tell, it has no other effect. Damage to the cars is represented by bending and twisting the body. There are no specific damage textures.  Damage does effect the handling of your car however. There are three levels of damage here and eight different areas of the car that can be affected. As the car becomes more and more damaged, you will notice a marked decrease in performance. Lucky for you, the car will heal itself eventually. As you're racing the damaged areas will slowly begin to regain their original shape and thereby return the car to its original performance levels. You see a graphic representation of these damage states in the HUD.  Another thing to be mindful of is the contact between the tires and the track. This is also shown on the HUD but it's too subtle to be of much use. That's a shame really because it's really important to the handling of your car. You can see which tires have a good grip on the road and which tires don't. The idea is that when you see yourself loosing traction, you straighten out and lower your speed. Unfortunately, the display just isn't visible enough to be used for anything. You'll wind up spinning out anyway. You can, with a little practice, begin to anticipate this loss of control intuitively so you won't really need the readout anyway.  The tracks were all well designed and balanced. They are also graded pretty well too, with the harder tracks coming later in the game. They range in length from about three-quarters of a mile to just over two miles. Going at speeds of nearly 300mph will put your average lap time somewhere between 12 and 30 seconds. While this might seem fairly short by the standards of most racers, you'll make up for it by racing over a dozen laps on most of the tracks. Even if you have a poor best lap time, you can still come out on top because these tracks stress consistency and endurance over fast leads. I, myself, had consistently horrible lap times and still managed to win most of the races.  Most of the tracks are pretty basic-some curves, some straightaways -- but a few will present some surprises. You've got one snow track and one dirt track but I didn't really find that the cars handled too differently on those tracks. There are a lot of opportunities to catch air on the many jumps in the game. When you do take off, the car sprouts wings so you can still steer while in the air. This is a little stupid looking but it's way too practical for me to bitch about it.  There are also speed boosts built into certain sections of the tracks. When you pass over these, your car is catapulted forward at terrific speeds. In some instances the computer will actually take over control of your car to steer you into the next section of track. Sometimes you'll have to handle the speed yourself. It's very difficult to make a ninety-degree turn at over 300mph.  There are also a few tracks that incorporate full 360 degree vertical loops. These are a lot of fun. Your car needs a lot of speed to get through these however, so use caution. Also keep in mind that it's very difficult (although not impossible) to pass on these loops. For the ultimate in danger, there's a huge cloverleaf track where four different racing lanes pass through one another. If your speed is off ever so slightly may wind up crashing head on into several of your competitors.  To help you out in this game, ASC has been kind enough to include three difficulty levels. In my opinion, the easy level is a little too easy and the hard level is a little too hard. I prefer the ~Baby Bear~ setting because it offers a challenge without totally humiliating you. If you play the game on the higher difficulty levels you get access to more cars. If you complete the game on the hardest level, there's a secret challenge awaiting you. Don't ask me what it is. I don't want to spoil it for you. Okay, actually I don't even know what it is, but I know that it's there. Find it yourself and drop me a line. I'm curious.  Jeff has also included a Racing School in the game. In this School he guides you through some of the basics of racing. To me it seemed like some of his advice was a little obvious. Don't go so fast that you lose control-stuff like that. Some of it was pretty enlightening though. Unfortunately, the units and examples are far too brief to be of any real help in the game but it's a nice idea to put it in. I just wish it had been a little more specific.  To help you refine your racing style, there's a Practice mode in the game. You can come here to learn how to control your car on each of the tracks (although you only have access to four of them until you start playing in the Championship mode). There's also an Arcade mode where you can practice against other racers. You can set the number of laps from 1 to 40 and the number of opponents from 0 to 16. The tracks aren't really big enough to accommodate more racers but I thought that the cap for laps should have been much higher.  The real challenge in the game is the Championship mode. Here you race in three seasons against real opponents. As you complete each race, you are awarded cash. The cash itself is unimportant except in terms of points. You can't actually buy anything or bribe the other drivers. I think a straight point system would've made more sense, but I guess it's hard to get a Nascar boy away from the idea that driving real fast ought to be worth a million dollars. Don't get me wrong. If he can make that much money from a race, more power to him. I'd sure as hell be doing it. I seem to have gotten off the point.  If after the ten races of the first season, you have come in first overall in the point/cash standings, you can proceed to season two. This is just like season one but the bar has been raised just a little. Oh, and you're racing against Jeff Gordon also. In the second season it's less important that you beat all the other racers. As long as you beat ol' JG, you can move onto season three.   The game looks pretty good. The tracks are a little gaudy (keeping with the whole arcade theme) but they are highly detailed. It looks like someone spent some time making sure they were pleasing (or interesting, at the very least) to look at. The effects and the lighting in the game are handled well, although some sections are too dark and others are too light. You have a lot of options in terms of graphics, opting to eliminate smoke, sparks or skidmarks for the sake of balanced frame rates. Best of all there's an auto detail feature that will customize the graphic options for your machine. That way you get smooth and consistent frame rates throughout the race.  Sounds are usual racing sounds. In other words, they aren't too hot. I mean, how exciting can a revving engine sound be? The echo in the tunnels is nice and the sound of water alongside the track is very sweet. They've even included an option here to adjust Jeff's voice-overs independently of the rest of the sounds. That's a feature all racing games need to have.    Anyway, given the recent spate of racing games that have crossed my desk-I've counted over a dozen within the past month or so-I feel like I know what to expect from the genre. While games like Midtown Madness and NFS High Stakes win big points for depth and involvement, games like Boss Rally and Jeff Gordon's XS Racing provide an experience that's a helluva lot of fun for an entirely opposite reason. These games are simple and easy to play. They strive to bring a real arcade experience to the PC and they succeed.  -- Stephen Butts", "date": "Jun 18, 1999"}