{"name": "DBZ: Harukanaru Densetsu", "name_review": "Dragonball Z: Harukanaru Densetsu Review", "ref": "https://www.ign.com/articles/2007/06/18/dragonball-z-harukanaru-densetsu-review", "text": "Who knows what's going on in the world of Dragonball Z? This character's dead, that character's pissed, this character is that one's father and everyone's beating the crap out of each other mid-air about five times per episode. But what makes for a head-scratching, action-packed anime half-hour translates surprisingly well to a handheld card battle game though, especially when Bandai cakes on more polish and visual flair than are found in most first-party Nintendo games.    Dragonball Z: Harukanaru Densetsu follows the same frenetic action and soap opera drama of the previous games, but relegates combat to a card-based system. Groan, right? Well surprisingly, Bandai developer BEC pulls it off pretty well. As players select their cards and beat up on bad-doers, a flurry of colorful sprites, effects and large character portraits are constantly sliding in and out of screen, accurately recreating the excitement of the DBZ TV program. Players begin each level on a game board with an objective to reach and a maximum number of turns available to them. Along the way, creatures and enemies will be encountered and must be either battled or fled from. By selecting one of the five playing cards in front of them, players can unleash a variety of attacks, strategies and defenses.    The card system works off 8 card types: Strike cards attack, hide cards run from battle, training cards increase guard (defense) strength in all cards, reverse cards trade stats with opponents, energy cards increase attack strength in all cards, event cards call friends to attack for the player, use cards access the item inventory and Z cards can be used for any of the above. Each card has a defense and offense number, between 1 and 7, with Z trumping all (and numerically equal to 8). When players draw a card, it competes with the opponent's card and whichever character has the higher offense number takes their turn. What occurs during a won turn depends on what card type was used, so a strike or event card will do damage to the opponent, while training and energy cards will beef up the stats of a player's entire deck. During all attacks in the game, show-faithful attacks (complete with speed lines) occur between both battlers on the two DS screens. Once an opponent's HP has been drained entirely, the player is free to move on and continue their quest on the board.    What's nice about this system is that smart card usage can prevent enemies from ever taking a turn, as opposed to more conventional RPGs where the heroes usually sit and take damage in between dishing it out themselves. So long as the player always plays a card with a higher offense value, their opponent can only sit there and take damage until expiring. Less useful cards, especially those with low values, can be spent out of combat on the game board, where the offense value doubles as the number of steps a player takes on that turn. The goal of the game is to plow through every enemy encountered, on the way to the immediate level objective which, once complete, unlocks the next stage. Good strategy involves knowing which cards to hold onto, which to dump on the board and when to power cards up instead of going for an attack. The system may sound dense but in practice it's actually very simple, perhaps even to a fault. And each of the eight card types is so balanced and essential that none of them feel useless. Having cards that positively impact all other cards in the player's hand is a creative, useful idea that lends a huge amount of strategy to a game that could have otherwise been a very straight-forward card battle beatemup.    There are a few different modes in the game, with the predominant one being Story Mode. This mode begins by asking players to select one of four scenarios (only three are available from the start), focusing on either Goku, Gohan, Piccolo or an unlocked fourth character. That character's story unfolds one game board at a time, with each board and story segment presented like an episode from the TV series, including the obligatory episode title card. The main character is generally led through each stage by a wise (and often mocking) guide, who explains any new gameplay mechanics and goes over the objective ahead. Objectives usually amount to reaching a location or final boss, although twists and turns occur on each game board so that things are never over as quickly as they would appear.    What will probably turn a lot of players off from the game is the extensive amount of tutorials at the beginning of the first level. Players should expect to be reading for about ten minutes before playing their first battle. That said, while the developers haven't done much to keep these tutorials as short as possible, they have kept them highly enjoyable, as the selected DBZ hero and his guide banter back and forth as the ropes of combat are learned. Goku even expresses his boredom at one point and anxiousness to get into the thick of battle, but believe me, these tutorials are hugely necessary to get a firm idea of what's going on in the game.    As players progress through each board, they track down mini bosses and fight the occasional surprise attack. Wait, did I say occasional? I meant constant. And there lies one of the game's only real flaws; the onslaught of random battles against underlings in this game is relentless. If a player is trying to reach a demon halfway across the board, visible by a little idling demon sprite, they might have to battle 6 or 7 random ghouls on the way there. This gets boring because the enemy fodder are usually the same 1 or 2 characters over and over without variation or personality. Random battles also throw a wrench into any strategy a player might make for the boss ahead; saving that Z-level attack card? Not anymore, because it's all you might have to use against Mr. Green McNobody. If the last card the player used to move had a higher defense than that of their attacker, the random battle will be avoided entirely. If the values tie or fall in favor of the enemy, a fight ensues. Random battles can also be run from using by using a Hide card, but getting one is about a 1 in 8 chance. So most of the time, these encounters must be plowed through, and often at the expense of some really useful cards.       This problem relates to a larger one in the game, in that there is no deck customization system. Players are shuffled random cards with each turn and aside from a page of personal stats, there's really no sense of mastery in this game. The developers should have considered allowing players to store and keep useful cards, or carry their favorite deck between levels. Of course, this would have complicated the simple, barebones system they have in place now (which works), but it might have lessened the frustration a little.    As enemies and allies are encountered, the game pauses for short cut scenes with the key characters. These are all handled with large 2D character portraits and text dialogue, although some short (and some not so short) vocal clips pop up from time to time. Each level ends with a resolution of the immediate story and a cliffhanger that leads into the next one. And with each level only taking around 20 minutes to complete, there's always time for one more.    In addition to Story Mode, there is a multiplayer Vs. Mode that can be played by up to four participants (each with a copy of the game) or by two with a single cart. The single cart mode is a little disappointing, mainly because so much of what's great about the single player experience has been cut to fit in the 2 meg data transfer. Players in this mode engage only in 1-on-1 card battle with no story or game board. Additionally, all music and about half the sound effects have been stripped from the empty DS experience so if possible, play next to the host. The other multiplayer mode (requiring each player to use a copy of the game) is a more robust, accurate representation of the game, with a game board, sprite icons and full audio amongst all players. Although it's fun to combat against friends, the game loses a lot of what's compelling about it without the constant objectives and wacky storyline. A co-op story mode would have been fantastic, especially since some of the single-player missions involve a buddy (like Piccolo) wandering the game board with the hero as their story progresses. Maybe BEC can work something like this into the sequel.    In addition to these two game modes, there's an unlockable card gallery that shows off all played cards along with their stats. This is a little pointless, and would have been a great place to build and customize decks instead of just looking at cards, but oh well. An audio gallery allows players to listen to any of the vocal clips that have been played through the game so far. These clips are funny and surprisingly long. Like everything else in the game, these two extras, bare as they may be have tremendous polish, complete with dancing monkey sprite in the background.    Music in the game fits the action perfectly. It's a little retro and guitar-heavy, as in the show, but it makes fantastic use of the DS's sound capabilities with impressive instrument sets, smooth transitions between tunes, volume lowering during moments of speech or sound effects and a lot of play between the two stereo speakers. Sound effects, likewise, are punchy, exciting and perfectly capture the energy of the game. Battles are peppered with dialogue from (presumably) the show's voice actors, which really heightens the impact of these encounters. The audio in this game is just further evidence that the developers knew exactly what they were doing, and exactly how to recreate the ultimate card-based Dragonball experience on a handheld system. I must confess, Im not a seasoned Dragonball fan. Ive seen a few episodes from the various series but always felt like I was jumping in 100 episodes too late to get a real sense of what was going on. And while Dragonball Z: Harukanaru Densetsu was obviously written for well-versed Dragonball fans, the action is so balanced, the dialogue so enjoyable and the presentation so impressive that this game should appeal to fans that have never even heard of the series. Card battle game aficionados might find the gameplay here a bit too simple, but those new to the genre, especially fans of the adventures of Gohan and Goku, might love what they find here.", "date": "Jun 18, 2007"}