{"name": "VR Baseball 1997", "name_review": "VR Baseball '97", "ref": "https://www.ign.com/articles/1997/04/08/vr-baseball-97", "text": "The VR Sports team had two years to develop this game. What happened? VR Baseball has a multitude of redeeming qualities,  but these are counter-balanced by major flaws that make the game barely-average.  Complete with over 700 Major League players, 28 Major League stadiums, and all the Major League stats and teams they've left out one crucial element - game play.  Instead of plastering the screen with a collage of windows and stat screens, VR Baseball included just you and the field. This gives you that nostalgic pitcher-to-batter feeling. This interface allows you to have a normal baseball game, rather than being preoccupied with a screen flooded with animated icons and useless camera windows.  This game may have an ~old-fashioned~ interface, but the game looks and moves like, if not better than, today's motion captured sports titles. In addition to almost life-like player animation, players also vary in size and shape. For example, some players are bigger and heavier. This results in a slower batting swing. Even the pitchers differ in size, strength, and pitching speed.    Even though the game looks great and moves smoothly, it simply lacks quality game play. A good example is the batting part of the game. Beside the great pitching animation, trying to hit the ball is another game in itself. The ball moves a little slow during the pitching sequence, but the major problem is the batting animation. It skips a frame or two right in the middle of your swing and the ball mysteriously goes into play. In other words, you don't hit the ball. You hear a crack, you see the ball move, the players field the ball - but you didn't hit it. Besides the fielding and pitching, batting is the most exciting part of baseball. You'd think that developers would spend most of their time perfecting this part of the game. This is a major flaw that deserves no sympathy.  It's unfortunate to see a sports game with so much potential end up a lemon. This game has so many strengths, but there are some flesh-wounds in the game that totally kill it. The VR Sports team is definitely on the right track and hopefully next year's attempt for a baseball game will be a success.  Jay Boor", "date": "Apr 8, 1997"}