{"name": "Monster Madness", "name_review": "Monster Madness Review", "ref": "https://www.ign.com/articles/2007/06/19/monster-madness-review", "text": "Monster Madness has been a blip on our radar since before we knew what ~next-gen~ games would actually look like. On the surface it sounded like an attractive package: top down action with upgradeable weapons, four-player co-op, online multiplayer, and an exaggerated Halloween theme. All the right components are there, but this is an instance where the final product turned out to be worth a lot less than the sum of its parts.    The most important bit of information to know before purchasing Monster Madness is the difference between the Adventure portion of the game and the Online Multiplayer modes. The Adventure Mode is the meaty ~story~ portion of the game. A paper-thin plot acts as an excuse to tear through five monster-infested zones of suburbia. Each zone contains four levels and makes for a decent chunk of play time. This is also the part of the game where players collect monster tokens, upgrade weapons, and attempt to collect most of the very creative achievements. Unfortunately, the Adventure Mode only supports local multiplayer and is not playable over Xbox Live. The online multiplayer offering takes place in arena type environments separate from the adventure.    Lack of an online adventure mode is a significant omission considering top down action games like Champions: Return to Arms have supported online multiplayer since PS2.  It's also a shame because Monster Madness was clearly designed to be played by more than one person at a time. The number of enemies, items, and hidden goodies packed into every environment is pretty impressive. The thing is - wandering around to grab (or kill) everything isn't nearly as fun by yourself. Without the tension of beating your friends to pick up an item the game quickly devolves into a repetitive hack n' slash affair. Getting people together on the same 360 is preferable, but this presents its own problems -- like a camera that has to pull way back to capture all of the action on screen.    I've always enjoyed a good dungeon crawler, but in this title even the hacking and slashing has its share of problems. There are four characters in Monster Madness, each one fitting neatly into a high school typecast of geek, stoner, cheerleader, and goth. They have unique special attacks and melee weapons, but they play nearly identically. Players move their character with the left analog stick, turn with the right stick, and attack using the right trigger. Projectiles are launched with the left trigger, the bumpers cycle each type of weapon, and clicking R3 or L3 causes a character to jump forward or straight up respectively. Nearly every command feels loose and slightly unresponsive.     Why is movement and turning handled separately? In a game where melee combat is the default attack shouldn't a character always face the direction they are walking? This turns out to be one of many questionable control decisions. Of course when you actually hit an enemy it is often unsatisfying; it's hard to pin down, but the combat lacks a certain punch and enjoyment. Even driving a vehicle, which should be as simple as hitting the gas and steering, feels wrong. With varying camera angles and vehicles that get caught on every obstacle, it's infinitely more difficult than it should be. At least there isn't a timed driving sequence that consistently ends in death. Oh wait, there is. Whether it's a car, an ATV, or a UFO, the controls are unresponsive or overly complicated.      The weapon upgrade system could have been the saving grace of Monster Madness, but it too is ultimately flawed. Players start with a makeshift melee weapon like a plunger or a saw and collect everyday items to cobble together more powerful weapons like a pipe shotgun or CD launcher. After finding the required parts, weapons are purchased from a roving shop called Larry's Tool Trailer. Larry accepts monster tokens as currency and as you might have guessed they can only be obtained through slaying enemies. Weapons are both too expensive and sometimes no better than each character's default melee weapon. Lowering the difficulty level makes it easier to assemble weapons like the rocket launcher, but even so it's still a slow and unsatisfying addition to your arsenal unless you put in the extra time to earn the upgrade.    Adding to the frustration is the fact that the weapon shop and checkpoints show up at odd intervals. Ammo and health stations appear more frequently, which is critical because there is no quick save function. This means that if you haven't hit one of the randomly occurring checkpoints and you die, it's back to the start of the level minus all of your collected loot. This is worse when a death is due to some random environmental one-hit-kill or because you plunge off a ledge that appeared to be off limits. In these instances Monster Madness induces a special type of couch punching, controller throwing aggravation.   The multiplayer portion has its own problems. The smaller arenas could be compared to PowerStone with a pulled back camera and a lot less fun. In the larger environments the game feels more like a straight-up third person shooter. There are plenty of modes to play around with including capture the flag, king of the hill, and a cooperative challenge called The Dojo where players face ever-increasing waves of enemies and fight for tokens. All of this variety would be appreciated if the core combat and presentation were better. Simply put, the fighting isn't fun and no number of modes or online functionality can change this.    Running on the Unreal 3 Engine the game's visuals have a glossy sheen and the environments are packed with objects that fall apart and explode. The lighting and weapon effects are decent enough, but the frame rate tends to dip and stutter even when only one player is in the game. Further detracting from the visuals is a poor co-op camera that always swings into the wrong position at the wrong time. There are even platforming segments that require multiple players to navigate an environment using a camera that rarely presents an unobstructed view.     At least Monster Madness doesn't take itself too seriously. The dialogue is sparse and often nonsensical but it's packed with game references. It pays homage to Zombies Ate my Neighbors and a few other classic titles while less purposefully making some references through familiar gameplay elements. I never thought I'd fight another maniac wielding a fortified shopping cart in a mall grocery store after slaying the psycho from Dead Rising. The music is fitting with overly dramatic tunes you'd hear in a theme park fun house. However, the voice acting is forced and annoying with end bosses repeating the same lines ad-nauseam.Even without the bugs and hiccups we experienced, Monster Madness would still be teetering on the brink of a fun experience. The ideas behind the game are solid, but the poor implementation too often leads to tedium or frustration. The numerous gameplay issues aren't helped by the fact that this is a full-priced title and there are more than a few multiplayer Xbox Live Arcade games that offer more fun at a fraction of the cost. Try before buying, and don't say we didn't warn you.", "date": "Jun 19, 2007"}