{"name": "Championship Pool", "name_review": "Championship Pool", "ref": "https://www.ign.com/articles/1999/06/19/championship-pool", "text": "endeavors to bring the game of billiards to a video game audience in an easily portable Game Boy form. In terms of popularity, pool ranks right up there with bowling and gambling as a prime middle-American pastime. So how does this pocket-sized version stack up against the real thing? Well, for starters you don't need to worry about ripping the felt with a misguided cue-this is the main difference besides price ($2,000 for a real pool table vs. $20.00 for the Game Boy cart). These facts alone might persuade those intrigued by the geometrical intricacies of billiards to risk very little and give this game a shot.   Features  Single-player (but up to eight players can play on the same game if they are willing to pass around the Game Boy...ewww, germs!). No game saves. No high score saves. Over 10 different pool game variations. Average-to-poor game control-attributable to the graphic set-up. Difficulty level: Medium to Hard.   Features Championship Pool's most notable aspect is the hefty and comprehensive manual. It is literally the War and Peace of the Game Boy manual world. Even veteran players of this game could learn a thing or two or three about billiards from this detailed compilation of information and instruction. It is a must-read before you venture into playing the actual cart.   The game itself offers four different gameplay options: Tournament, Challenge, Party, and Freestyle. The Tournament mode offers a simulated competitive scenario in which you challenge computer-generated opponents in 8-Ball or 9-Ball. 'Challenge' lets you practice your pool skills in a practice forum. The Party mode lets up to eight players (all using the same Game Boy and cart-no Game Link necessary) engage in a variety of games. Finally, 'Freestyle' lets a player improvise and create original pool games from scratch.  Just to give you an idea of this game's breadth, the following games can all be played on this cart: 3-Ball, 9-Ball, 8-Ball, 10-Ball, 14.1 Continuous, Rotation, 15-Ball, Straight Pool, Equal Offense, and Speed Pool. If you are a novice to the game, the options can seem mind-boggling. For experts, on the other hand, any fewer choices would render the game woefully lacking. Regardless of your level of experience, the manual provides detailed guidelines for playing each of the aforementioned games.    Championship Pool achieves an amazing number of 'cons' in the graphics category. In stark contrast to real pool tables, the pool tables on this game are almost ridiculously difficult to manipulate. If you want to see all the numbers on all the balls at once, you must revert to a 'zoom in' mode that lets you only focus on one part of the table at the time. This creates difficulties in setting up a long shot across the width of the table.  More cons: The letter font on the opening game menus and on the in-game overhead menu is almost impossible to read, and requires some fancy adjustment of the contrast wheel to render words legible. Add to this that the opponent animations are wooden and virtually a waste of pixels. And whereas real pool is inherently associated with raucous social atmospheres, this virtual pool environment is sterile in presentation and fails to make a memorable visual impression.   Yet MORE cons: Also of note is that although the graphics will allow a player to view and adjust the power of a shot directly from the game screen, the same is not possible for viewing and adjusting the spin of a shot. In order to do this, a player must access two sub-menus first before being able to set the spin. This is time-consuming and a big error in game design.   One nice graphical aspect of this game is the 'ghost shot,~ which allows a player to set up a shot and see how it falls before the actual shot is made. For the most part, this feature is accurate and can help you make even the most challenging of shots.    Could Game Boy music get any worse? It could, if it couldn't be turned off. Fortunately the game's so-called ~jukebox~ noise can be eliminated with a quick trip to one of the game's sub-menus. The ~plunk and blip~ comprise this game's forgettable repertoire of sound effects.    The wide selection of different pool games alone gives Championship Pool some redeeming value. A true billiards aficionado could play repeatedly and never quite exhaust the challenges. And as strange as it sounds, once you've started a game it is quite a feat to pull away, especially in the middle of the Tournament mode. But for the most part, the average player will have a hard time feeling motivated to play this game unless it is the only one available at the moment.  If you are a billiards addict and need a quick and cheap fix, this game will provide it. Anyone else might find difficulty generating the cash or the excitement for what is a noble attempt at an in-depth simulation that dismally fails to create a quality gameplay experience. The Software Toolworks scratched big-time on Championship Pool. Monica Wilbur reviews games for IGNpocket's #1 affiliate, GBCDojo. Be sure to stop by GBCDojo for everything Game Boy Color.", "date": "Jun 19, 1999"}