{"name": "Pokemon Diamond", "name_review": "Pokmon Diamond and Pearl AU Review", "ref": "https://www.ign.com/articles/2007/06/20/pokamon-diamond-and-pearl-au-review", "text": "Formula. Actually, formula and repetition. Those are two traditionally negative elements of game design that usually relegate games to instant B-grade status or - worse, even - to the bargain bin. Yet, somehow Nintendo is a company that manages to build success through innovating, formulating and repeatedly milking that original innovation. We've seen it with Mario, Zelda, Metroid and critically, Pokmon. And we all love Nintendo for it.Pokmon Diamond and Pearl, the latest main-series release for the Pokmon brand, is a resounding success and is already selling ridiculously well in the Japanese and US markets. But enough counting of the greenbacks; we know you just want to know how good the game is - so let's push on.If you've never played a Pokmon game before, now is as good a time as any to get stuck into the series. The basic idea is about battling wild Pokmon, capturing them, training them and then repeating those steps until you've collected them all, as the tag line roughly goes. In all, there are 493 Pokmon potentially in Pokmon Diamond and Pearl.We say potentially because the kicker is that not all Pokmon are available in both versions - you must trade across to get the unique breeds. Also, if you're after all 493 Pokmon, you'll need to slot in GBA versions of Fire Red, Emerald Green, Ruby and Sapphire in order to import them across - with a limit of six transferred beasts for every 24 hours of real-time. When you work it out, it's going to take you months and months to bring across even 150 or so of your original Pokmon - but if you're a purist, then this is probably a sound investment of time.The other catch? You must recapture any Pokmon you've brought across in special hunting grounds. We don't necessarily agree with this approach - we'd definitely prefer to bring our hard-earned and highly trained Zapdoses and Mewtwos across intact. Of course, there's no denying that this decision extends the replayability of Diamond and Pearl significantly. You also can't transfer any Pokmon who have been taught HMs, because that could potentially break the game's design. Which sounds funny, but is probably a nightmare for programmers.So what else has changed? First of all, your travels place you in the geographically varied Sinnoh region. Fundamentally, you'll be traversing the same kinds of environments you've seen in the past - towns, forests, marshes, caves, waterways, mountainsides - capturing as you go, doing battle with gym leaders, and pursuing your 'rival' whom you get to name at the start of the game. The battle sequences are nearly identical, but the menus are vastly improved. Again, this is all formulaic Pokmon stuff, and by and large you won't be surprised by a lot of what goes on, but it's still compelling enough to keep you playing and earning badges.How are the new Pokmon, I hear you ask? Well, after 493 of those freaky suckers, we're impressed there's anything left to be invented. However, Game Freak has managed to pile on 100 new critters. Some, like Mime Jr., are pre-evolution versions of their more mature counterparts (like Mr. Mime). Others are fully evolved or entirely new. You can initially choose one of three different starting Pokmon: Chimchar (fire), Turtwig (grass) and Piplup (water). In essence, initially the game plays out like a complex version of rock-paper-scissors, where some elements are strong against others and vice-versa. The battle menus have now been moved to the lower touch screen, which works well. You can still use the D-pad to make your selections, as you can for most actions in the game. Apart from that, the core gameplay has changed very little. The division of attack-types is slightly altered, but calling out Pokmon, tag-teaming battles and using items is all identical.One of the more intriguing inclusions in Pokmon Diamond and Pearl is the 'Poktch'. The odd name is apparently derived from 'Pokmon' and 'wristwatch'. Basically, it's a PDA that can be injected with fresh functions by visiting the Poktch company. This is a very handy evolution of the Pokgear and PokNav from past games, initially combining a calendar, calculator and a pedometer, but expandable by up to 25 total functions.While most of the functions are mainly novelties, you'll occasionally come across times when a particular function is required in order to solve puzzles in the game. That's pretty cool integration. The other side of the Poktch is the basic watch function - which is to say, knowing the time in Sinnoh is pretty important. Like Pokmon Gold and Silver on the Game Boy Color, Diamond and Pearl bring back the day/night cycle and keep track of the days of the week. This is by far the most interesting twist on the gameplay since, as was the case in Gold and Silver, the time and day dictates where you can find Pokmon, particular non-player characters and some events. Even if this is a slightly improved version of an old feature, the absence of time and date in Emerald Green, Fire Red, Ruby and Sapphire were noticeable. It's a welcome return. Also returning are several other features - with slight tweaks. Berries are no longer the only food available to your Pokmon. While you can still harvest and grow stat-improving berries from bushes around the Sinnoh region, you can also sit around a big mixing bowl with three other mates (connected to your DS via wireless access) and mix up a batch of 'Poffins' - essentially Pokmon candy, specifically designed for Super Contests.And what of these Super Contests? Well, take the original premise - a fashion and skills show for Pokmon and their trainers - and add a few new stages and levels of complexity to the micro-games. We never really got hooked on the original contests back in Sapphire and Diamond, but if you're a fan, then this adds another level of depth.    In fact, depth is one of Diamond and Pearl's biggest positive factors. There's a whole heck of a lot to do, and it's all impressively well integrated. For example, in addition to the main quest, collecting, customising and training, the Pokmon centres are now online hubs for trading and battling on a global scale.In the top floor of the Pokmon Centre, you can enter the Club Communication Room. Inside, you can participate in two or four player battles, with a number of different battle options (tag, two-on-two, single and more). Because of the simplicity of the presentation (which we'll dive into shortly), there was no discernable lag to speak of. However, finding players can sometimes be a bit tricky - there wasn't anyone in our region to play the game alongside - however there were plenty of Yanks online. It only takes a few moments to connect to the battle, and other players already on your friends list can join you in the waiting room to pass the time with basic chat and drawing functions. The drawing function is something of a curiosity - up to five players can sit around a sheet of communal paper and scribble away with rudimentary artistic tools and colours. We can almost picture all the Pokmon-themed toilet humour pouring onto digital pages around our big, brown land.We also used the Pokmon Diamond and Pearl online experience to test out a new piece of Nintendo hardware that should be appearing on shelves alongside the game's release - the DS Headset. This is a single-ear, monaural headset with a built-in microphone (so, really, it should be called an earpiece). The quality of the earpiece is pretty decent - certainly on par with Xbox Live's headset in terms of clarity. However, it does use up the headphone socket, which means you can't use the DS' speakers while it is plugged in. And, because it's only a single, monaural speaker, the sound is still definitely inferior to using proper headphones. Of course, that's a small trade-off to chat with a mate in the US or UK for nix.Outside of the multiplayer, you can also exchange Pokmon with your friends or simply on a global level by finding the Global Trade Station in Jubilife city. We really dig being able to leave your signature on the tag that is sent along with your traded critter. It's a nice, personal touch for a kind of heartless act. Wave goodbye, Pikachu - you're getting shipped off!We also like the automated journal entries when you load a saved game - it's a simple enough feature; just a single screen of notepaper and few key points on your last actions - but darn it, it's very handy if your time is constantly split between different games, like us. In addition to online battling, you can now trade critters internationally. What we're not impressed by is the very dated, fairly mediocre presentation. This far into the DS' life and after four generations of Pokmon games, the game series has finally embraced portable 3D in the most uninspired of ways. The game is still viewed from an overhead point-of-view, which is fine. The engine is a combination of mostly-2D sprites, representing your character, most incidental objects such as trees, bushes, flowers and rocks, and 3D for buildings, lamp posts and the ground or land surfaces. In theory, it works. Then again, in theory communism works, too.The result is a lot of symmetrical sprites, a lot of scrolling and very bland towns and environments. There's a lack of natural or organic shapes, like rolling hills or random patches of grass - everything is ordered, neat, tidy. The reason is simple enough - your character is locked on a square-by-square X and Y axis movement grid. It's quite restrictive to your movement and in turn, the design suffers.Battle animations have seen a slight improvement to some of the more spectacular blasts, rays and bursts - lots of particles and scaling effects, but this is very much the same kind of battle engine screen that players have seen since the GBA versions. The upped resolution doesn't do much for the sprites, either. All of this points to Nintendo's reluctance to take risks with the main series games. Sure, they can spin off a bunch of related games that look arguably more impressive than the main games do, but when it comes down to it, Diamond and Pearl are really lacking visually when these should be flagship titles. To be blunt, we'd trade off backwards compatibility for a fresh set of Pokmon rendered in 3D during battle scenes, and a world that isn't limited by X and Y axis movement. It's not a big ask.In the audio department, things don't fare much better - apart from the opening theme, most of the music in the game sounds resolutely midi - and not in that pleasant, 'oh, how quaint and retro!' way. While the Pokdex still allows you to play back the calls of Pokmon and fool around with the pitch and tone, Pokmon from the first series of games still sound identical - we're talking about the original Game Boy version's sound effects. Yeesh.For a game that nails so much, offers more depth than any Pokmon before it and still retains the addictive gameplay of its predecessors, matters of the audiovisual nature matter little to fans. We're certainly still convinced that the series is in good shape, but we're just a little disappointed that, for a game that is all about growth and evolution, some elements still seem to be stuck in a bygone era.It's been ten years - would you believe it - and the Pokmon franchise is as fun and vital as it has ever been. For some, the lack of significant shifts to the formula is a good thing. There's nothing to come between the addictive and balanced gameplay that has won over these fans. For others, the lack graphical and aural pizzazz, combined with the upholding of gameplay traditions might mean this is an adventure they might sit out on. It would be their loss, though - we're hooked all over again.", "date": "Jun 20, 2007"}