{"name": "Disney Magical Racing Tour", "name_review": "Walt Disney World Quest: Magical Racing Tour", "ref": "https://www.ign.com/articles/2000/04/14/walt-disney-world-quest-magical-racing-tour", "text": "Walt Disney World Quest Magical Racing Tour is the kind of game that usually gets ripped to shreds by guys like me. It's cutesy, it's kiddie, and, above all, it's another Kart racing game! Even if it is Disney, what does the world need with another kart game?  And yet, could this be a Kart game that controls well? Now that's not something you see everyday... but I do.  If you picked up on that joke as one of the many zingers thrown off on The Jungle Cruise ride at Disneyland, this game is perfect for you. Eidos' Disney Magical Racing Tour may not be a great innovation for videogaming, but as a tour that races through some of the most memorable attractions found in the Magic Kingdom, this game earns a spot in my heart purely for sentimental value. The developers at Crystal Dynamics have nailed every landmark and visual flair of Disney World, while rearranging and enhancing each ride to make for a fast, fun game.  Gameplay  Did you know that, somewhere deep in the heart of Disney World, is a spectacular device called the Fireworks Machine that sprays glorious rockets, explosions, and sparklers into the air every night at the end of  each Disney day? Neither did I, until I heard that Chip and his bumbling partner Dale accidentally ruined the machine by dropping acorns into it. It blew up into dozens of pieces, and now it's up to Chip 'n Dale to pick up those pieces and rebuild the machine before the night's show. Guess how they're going to get that done? Yep, they've decided to hold a Walt Disney World Quest Magical Racing Tour to collect all the strewn mechanisms and doo-dads!  OK, it's not exactly biblical storytelling. Why this Magical Racing Tour is taking place never really makes sense (and why are there 11 other racers competing against Chip 'n Dale? Why is it that they must hurry before night settles and the firework show begins, yet time never passes in this game and several attractions are set at night? Where's Mickey and the rest of the gang? Yeah, and what about Scarecrow's brain?)  None of that really matters here (although, being a Disney product, you would have expected the story to be rock-solid). The focus of Disney Magical Racing Tour is racing, or rather Disney racing. What's the difference, you ask? In this game, a huge part of the fun comes from the all the detailed work that went  into the course design and Disneyesque gameplay. For instance, instead of Banana Peels (or more like the Oil Slicks in Nascar Rumble), players drop Tea Cups that spin your opponent wildly as they're driving, trapping them in those crazy cups and making them dizzy for a good while. Riding in a real Tea Cup down the street is the dream of every Mouseketeer, and that's finally possible in this game.  It's the track design that just grabs hold of you. Crystal Dynamics has faithfully brought 13 of the most popular Disney attractions to life (they include Space Mountain, Haunted Mansion, Pirates of the Caribbean, The Jungle Cruise, Tomorrowland Speedway, Big Thunder Mountain Railroad, Disney's Blizzard Beach, Rock 'n Roller Coaster (at Disney-MGM Studios), the Disney Studios, Test Track (at Epcot), Typhoon Lagoon, the new Animal Kingdom ride for Dinosaur, and Splash Mountain). Each is a near replica of the true ride, but it's now all controllable for gamers who always wanted to freely roam in this amusement park. Remember the opening climb of Space Mountain, where you are being shot through a portal of light and color into outer space? That same experience is here, only this time you are driving that rocket ship, running over dozens of Zippers to boost speed for your final ascension into space!  Generally, the courses are not perfect recreations of the rides. The models used in the tracks are not millimeter-by-millimeter mock-ups. Rather, they are stylized versions of Disney World's attractions, built for speed and fun while retaining the bliss of riding these classic rides. The Haunted Mansion race begins outside the mansion doors, where you break into the doors and storm through twisting halls, up gothic staircases, and through mysterious curtains that reveal hidden shortcuts. It's like the real thing, just redone for a game (even the mirror ghosts are there at the end of each lap).  To be perfectly honest, if you don't like Disney, you probably won't like this game as much as I did. Then again, if you're not in with The House of the Mouse then you probably wouldn't like a good Kart game anyway. Disney Magical Racing Tour never breaks the mold in the Kart racing genre -- the addition are Fairies on the track that give you good luck by making CPU opponents more prone to mistakes was brilliant, but otherwise this is nothing new. It is super fast, which is very nice, and combining that with great tracks makes this game lots of fun to race. Also, each track's vehicle has been brought into the game, and while they don't steer too much differently, the ability to race boats, rocket ships, and doom buggies is awesome.  My only complaint would be that this game may be too hard for its target audience. The challenge is set so high (and without a setting for difficulty) that little kids and even their parents will have a hard time finishing the Adventure mode. It's still fun to play around, but placing first is just too hard!  Graphics Again, the pride of this game isn't in the quality but rather the approach and Disney style used. That's not to say there isn't plenty of quality in the graphics of this game -- in fact, sometimes it's downright beautiful, and even when the game's only turning on half the charm, it still looks colorful and exciting.  As always, the vast charm of this game is the Disney license. Racing through Big Thunder Mountain Railroad and spotting all the hidden Mickeys (those landmarks that just happen to be shaped like a pair of mouse ears) is great fun. Crystal Dynamics has also brought the stages to life, animating every mile of the track. Animatronic dinosaurs growl at your driver as you zoom past, while surly pirates carry on with their looting while the race rages behind them. You may even spot Bubbles the hippo in the Jungle Cruise (however, I haven't seen the backside of water yet, and that's a real heartbreaker for me!)  We being strict critics, however, I must point out that the game is a little ragged looking. Sometimes the visuals are breathtaking (and always enchanting due to the Disney theme), but other times the graphic engine is running on empty. The main textures are fair throughout, but the resolution is very low for the sake of speed. Also, the special effect animated textures (which are used to enliven the game even more when there are no creatures on screen) are just awful. At the beginning of Dinosaur, you begin in a time tunnel and leap out into the past. However, the effect is done with just two-frame cycling textures. Passing through the time continuum seems like a polygon error. Had Crystal Dynamics added a screen-warping effect, it would have worked, but here it just looks like a placeholder graphic. Weak effects and other problems are sloppy, but the overall style more than makes up for it.  Sound The best part of this game is the authentic version of the Grim Grinning Ghosts theme played in the Haunted Mansion track. Hands down, that's reason enough to buy this game for many Disney fans. Eidos has licensed the tracks of Disney World's rides and incorporated them into the game, making every race a trip down Memory Lane. If the songs had been included in Redbook audio, this would have been a must-own for any Disney fan, since these tunes have rarely been heard outside of the park, and the few exclusive records and CDs released with the tracks are hard to come by.   Unfortunately, Eidos doesn't follow the logic of the ride with their music. If Eidos had been able to have the whole music tracks in the game, and mixed them on the fly (like Disney does by spacing music cues out on different speakers and placing walls to separate parts of the ride to orchestrate the music) so that the game sounds like the ride, this would have been amazing. Instead, they selected one short segment of the musical tracks and continued the loop of that piece, rather than linking musical segments like the ride does. You don't get the full experience -- instead, you get to feel what it's like when the ride breaks down and you're stuck right next to a speaker. Thankfully, you don't have to endure It's A Small World in the same way (that song has been known to drive riders clinically insane), and the music segments are generally chosen well, but some tracks still get annoying after a few laps. Splash Mountain's five-story drop just isn't the same without the chorus of doom howling as you drop.  Sound effects are also well mixed and used. The engine sounds are nothing to crow about, but they're not irritating, and that says a lot for a Kart game. It's the cartoon sound effects that make the audio of this game so bright. Disney voices are used throughout (and the new characters, while hardly worth getting this game over, have that true Disney quality). Also, sound effects are done carefully -- slamming into a wall will produce a crash sound, but just gleening off of it in a corner will produce a rubber ~Boing!~ I shouldn't be recommending this. Nobody NEEDS another Kart racing game. But I am recommending it, almost highly. As a Kart racing game, it's nothing extraordinary, but as a Disney collector's item, it works wonders. When I first heard of this game, I thought for sure it would never work, that it wouldn't be as fun as the real thing. Of course, nothing could be that great (I feel like a little boy all of the sudden!), but this game works on just enough levels that it's worth the ride. Bottling the magic of Disneyland is rare in a licensed product, but that essence is here in Disney Magical Racing Tour.", "date": "Apr 14, 2000"}