{"name": "Death Jr. and the Science Fair of Doom", "name_review": "Death Jr. and the Science Fair of Doom Review", "ref": "https://www.ign.com/articles/2007/06/22/death-jr-and-the-science-fair-of-doom-review", "text": "One of the first prominent PSP games, Death Jr. hits the DS with the same scythe & gun combat, but with more focus on puzzling and the DS's unique system features. The story involves Death Jr., son of the grim reaper (referred to as DJ) and his deformed buddies at their school science fair, where a radioactive accident unleashes their nemesis, the evil Moloch, and transforms their school into a hellish version of itself. Kind of like Silent Hill meets Saturday morning cartoons. As DJ, players must navigate the increasingly bizarre school, bypassing puzzle platforms and attacking any demon students and possessed objects they come across.    The gameplay isn't too dissimilar from the original PSP game, involving lots of linear exploration, scythe swinging and gun blasting through each area. Of course on the DS the game has been redesigned to include plenty of touch elements (just about every move can be performed with either face buttons or a combination of the L button and stylus) as well as dual screens (one for inventory) and occasional microphone input. This game was developed by Backbone Vancouver, the same folks behind last year's well-received Age of Empires: The Age of Kings for the DS, but not the same team behind the original PSP Death Jr. game.    In theory, the game should work. Backbone Vancouver is working with solid character designs, creating fantastic character models and some of the most bizarre and engaging 3D level design on the DS. Unfortunately, in spite of its visual flair, the core mechanics are so poorly implemented and the design so complicated that playing through this game is much more of a chore than it should have been. This should have been a quirky little personality-driven platformer, but instead it's an infuriating practice in poor design choices, unreliable platforming and merciless respawn rules (for both the player and enemies).    One of the biggest problems is that the developers are so in love with their characters' animations that they let them get in the way of solid platforming and reliable collisions. When DJ runs, he wobbles around cutely, when he jumps he does wild leaps and spins with his scythe, but all of this makes it very difficult to predict exactly where DJ's collision is at any moment. Button response is slow and sloppy; Pressing the A or B button doesn't cause DJ to immediately hop or attack, it just begins playing the hop or attack animation. And animations don't seem to cancel each other out, which means that when DJ lands from a jump he won't be able to jump again until his landing animation finishes. This results in plenty of unregistered button presses, and regular sliding into pits that should have been easily jumped across.    Midair platforming is nearly impossible, because it's so unclear just how DJ's collision works. When he catches his scythe on a ledge or links it to a dangling hook, it usually involves more blind luck than skill. Several times I watched DJ fall right past a hook I'd expected him to grab, because between him and his scythe I had no idea what part of him to line up with the hook.    Because every time DJ bites the dust he gets warped back to the beginning of the level, enemies and challenges must be replayed dozens of times before getting through some areas. Enemies respawn mercilessly, often right next to DJ while you're trying to figure out how to puzzle past an area. They seem to have no qualms about repeatedly knocking DJ off cliffs and into instant death situations either. Enemy collision is as wonky and unpredictable as DJ's, so between the two of them it's nearly impossible to discern where the safe zone is when approaching an enemy. The only safe approach is to swing DJ's scythe like mad as soon as an enemy comes into view and continue this until they're dead. The game does a horrible job at conveying when enemies are taking damage and when they're blocking attacks, so it's usually a surprise when one of them actually dies.    Death Jr. can't decide whether it wants to be a 2D game or a 3D one. The game is constantly swapping back and forth between open sections that require awkward 8-directional movement, and more restricted sections that require traditional 2D left and right platforming. The problem is that the movement never is quite 2D. Instead, 2D movement is simulated through areas that are too narrow to move back and forth in. Because of this, there still are plenty of opportunities to accidentally wiggle DJ in the wrong direction and fall off a cliff. Transitions between the full 3D and 2D-like areas are confusing and generally result in running into enemies or pits. There's little indication when to start thinking in three dimensions, so it's easy to just keep running right and fall into danger. Level design here is incredibly linear so it doesn't make sense why the game didn't just feature locked 2D spline movement. At least that would have made the platforming more predictable. Instead, the game is the equivalent of Mario 64 wobbling to stay on platforms from Super Mario World.    DJ begins the game with his training scythe and just a handful of moves. By the end of the game he has around 10 different scythe attacks, all keyed in through Street Fighter-esque button mashing. WHY? Functionally, every attack does the same damn thing. There's no boss or enemy that can't be gotten the best of by just wailing on the attack button like an idiot for five seconds. The game demonstrates how to dodge and roll away from foes by double-tapping the D-pad, but this isn't ever really needed since most enemies offer up little to no resistance to being sliced into oblivion.    Later on in the game DJ gets some non-scythe firearms, as in the PSP games, and the puzzling and action does benefit from that. Shooting enemies is more enjoyable and less sloppy than trying to scythe them, and there are some nice, simple puzzles involving guns where DJ has to blast platforms to flip them upright or knock down obstructing walls. The guns look fantastic and animate nicely, although they suffer from the same delay problems as the rest of the game (pressing the A button starts the shooting animation, rather than actually shooting, so timing is difficult). Ammo also runs out pretty quickly and platforming necessities such as the helicopter-style float down and ledge grabbing are only possible when the scythe is armed.    The puzzling aspects to the game are about as frustrating as the combat and platforming. DJ is accompanied by his newly dead, floating friend Pandora. The developers summon up a little Lost Vikings with these two, allowing dynamic swapping between them. Pandora can only be controlled for a few seconds at a time, but using a Princess Peach-like glide she can get to places that DJ can't. This doesn't accomplish much on its own, as only DJ's movements count toward level progression, but Pandora is able to set off triggers to warp DJ across pits he wouldn't otherwise be able to cross.    Now, if that's all there was to the puzzling - Pandora floats away, hits a switch, DJ gains access - it might have worked well for the game. It might have even been fun. Instead, DJ has to basically kill mutated students, who drop vases, which break open to reveal differently-colored orbs, at which point the player has to turn into Pandora, pick out the orb that matches the color of the next target, double tap the desired orb, turn back into DJ, platform up to the cliff, turn back into Pandora, float across the gap, use the stylus to slingshot one of her orbs at the floating target (but only if the target and orb are the same color - otherwise please start over), then finally warp DJ to her new location. Yup, it's about as much fun as it sounds.       Graphically, the game does a lot of things right. The main character designs are fantastic (enemies and minor characters, less so). The environments are big and colorful and very creatively constructed. At times they can get a little cluttered, but there are lots of cool interactive objects and eye candy like giant forks that pop in and out of the ground to block DJ's way. Everything has a very N64 look to it, which seems to be common among the better 3D DS games.    What's shocking is just how bad everything else looks in the game. Anything 2D, from the menus to the cinematics, looks incredibly amateur with inconsistent art direction, rough edging and often garish use of colors. Considering how much effort obviously went into shaping the 3D visuals, it's a shame to see that game wrapped up in some of the laziest and blandest 2D art on the system.    One of the most impressive aspects of the game, its dynamic camera, is also unfortunately one of its most annoying as well. The camera offers regular doses of scripted movements, reveals and subtle storytelling. At the same time when the camera is just following DJ, it does a poor job foreshadowing his path, often swiveling on a dime to send any slow reaction gamers (you guessed it) running DJ right off a cliff and to his death.    It's obvious by how lengthy the cutscenes are that the developers expect us to love these characters and the story they're involved in. But DJ and his friends fall flat in bad pun after bad pun. The humor is weak, the story is alternately boring and confusing. Every single character in this game is annoying, and the cutscenes are so poorly illustrated (horribly-compressed still image renders with garish text over it) that they're not even worth watching.    Music is very hit and miss in the game. The opening cinematics song and occasional compositions here and there are spooky and memorable, but most of the soundtrack is barely noticeable. Nobody has any voice over in this game, which is a shame because little quips from our hero probably would have gone a long way. Sound effects aren't great, but they get the job done.    There are two extra multiplayer modes in the game, each requiring every player (between 2 and 4) to own a copy of the game. The first mode, referred to as Reaper Ricochet, is essentially a Death Jr.-themed game of Pong. Yawn. The other, referred to as War, is a little deathmatch combat game between reapers. Each game offers a variety of objectives and gameplay tweaks, but the lack of single-cart download or a single player variation here hurts. The multiplayer games are pretty shallow anyway, and in no way salvage this mess of a game.Youll want to love this game, you really will, but you wont be able to. Its evident that a lot of passion went into its creation, but the game completely ignores the rules that every successful platformer since Mario has adhered to. The collision detection in Death Jr. is atrocious, the move set and puzzling unnecessarily complicated and the controls consistently unresponsive. The visuals are engaging, but theyre not enough to save this unplayable mess. Death Jr. has shaped up to be an adequate little series on the PSP, but on DS hes (here it comes) dead on arrival.", "date": "Jun 22, 2007"}