{"name": "Klax", "name_review": "Klax", "ref": "https://www.ign.com/articles/1999/06/20/klax-2", "text": "Back in the late Eighties, Atari Games lost the Tetris license to Nintendo. Rather than admit defeat, the company instead set out to out-Tetris Tetris with a brand-new tile puzzle game for the arcade titled Klax -- a design that obviously borrows an element or two from the popular Russian puzzler while adding its own unique flair into the genre. Klax was then brought out to every single console at the time by Tengen, Atari Games console division. Gamers saw versions for the NES, Genesis, Turbo Graphix 16, Game Gear -- even Atari Corp. licensed the game for its fledging Lynx handheld. But because the game revolved heavily on color recognition, the Game Boy was left out of the mix. Until now.  Features  Wave select. Digitized sounds from the arcade. Freestyle mode. Three difficulty levels. Password saving. Only for Game Boy Color.    You're presented with a stationary table spanning out in the distance. Up close, you take control of a paddle that can move to one of five positions. Colored tiles flip from the far end of the table and creep towards you. The idea is to maneuver your paddle, collecting these tiles, then flipping them into the bin below in one of the five positions. Connect three of the same colored tiles up, down, or diagonally (called a ~Klax,~ and they'll disappear, settling the rest of the tiles deeper into the bin.   Each level has a specific criteria to meet so you can advance to the next level -- some require you to form a set amount of Klaxes, others require you to capture a defined amount of tiles on your paddle. And in others, you'll have to score a certain amount of points.  Klax marks the very first game that requires the Game Boy Color, and it's not hard to see why, since it requires immediate recognition of colors. The brown tiles are hard to distinguish from the red ones, but other than that, the game looks absolutely great on the handheld. And while the Game Boy Color doesn't have the greatest sound chip out there, Digital Eclipse pulls a whopper and produces some decent quality audio -- the game features all the speech and sound effects, completely digitized. A very cool feat considering that not many Game Boy games have digitzed audio -- and Klax features it prominently. Digital Eclipse puts out another great arcade conversion on the Game Boy Color. Klax isn't quite as addicting as Tetris, but it has it's own feel that makes the game more unique than many of the other knockoffs of the late '80s and early '90s. The absolute best home version of Klax was arguably the Atari Lynx version -- and this Game Boy Color version comes damn close to the quality that Atari put out with its own handheld version. And audio-wise, this game is very impressive -- sure, the digitized audio is low-quality, but no other Game Boy game has prominently featured recorded sound as Klax does, and hopefully future games will follow suit now that it's proven that it can be done.", "date": "Jun 20, 1999"}