{"name": "Dirt", "name_review": "DiRT: AU Review", "ref": "https://www.ign.com/articles/2007/06/26/dirt-au-review", "text": "To steering wheel or not to steering wheel, that is the question. Countless gamers have poured hundreds of dollars into these imposing sculptures of plastic, rubber and electromechanical components, only to watch them gather dust and steal precious storage space once the novelty has worn off. They're unwieldy to set up - raise your hand if you've ever wrapped masking tape around your legs to get a blasted lap mount to work or is that just us?  Worse still is the higher lap time that often results when using a steering wheel rather than a control pad. In the split-second world of racing, even a slight increase in lap time can be the difference between a spot on the podium and a sponsor pulling the plug.     But every once in a while, along comes a game that truly shines with the use of a steering wheel. A game that makes you feel like every penny you spent on your wheel and welded racing chair was justified. DiRT is one such game.   I realise that this is a review of DiRT, and not Microsoft's new(ish) steering wheel, but the two are so interconnected that there is no easy way around the issue. The difference between playing DiRT with a control pad and with a steering wheel is the difference between driving a ride-on lawnmower and a group B Audi Quattro. This game absolutely demands the use of the 360 Wireless Steering Wheel; without it you're only getting half of the experience.    Play with a control pad and the game suffers from that floaty, arcade-like handling that previous Colin McRae titles were plagued by. Sure, you'll still be hooning through the bush at 130km/h, sliding through the corners, but it won't feel like your car is actually touching the track. You won't feel the suspension being affected by the ruts and potholes that make racing in the dirt such a raw, powerful motor sport. The usually massive transition between gravel and tarmac will become just another minor blip on your rumbling controller. Even counter-steering through a power slide doesn't feel right and that's one of the most important sensations in a rally game. For the first couple of hours of getting DiRTy, I was a little disappointed at how artificial and buffered the controls felt, especially when compared to the New King of Console Sims, Forza 2.      But when I plugged in Microsoft's hulking steering wheel, it became obvious that DiRT's handling has been designed from the ground up for lovers of expensive peripherals. Even the simple task of roaring down a gravel straight saw the wheel trying to jump out of my lap. Watching other DiRT players using the wheel is a bit like watching a person with Tourettes driving a go-kcart, with the steering wheel rapidly flying all over the place in a blur of micro-corrections. It's hard work, giving the Wii a lesson in how to burn calories while gaming, but is infinitely more enjoyable than the placid control pad experience. Power slides feel truly great - a slight jerk into the corner to get the car sliding, and then plenty of opposite steering to hold it through the turn.    So how do I review DiRT when the two experiences are so different? After much deliberation, I've concluded that there's only one way to review the game - the way it deserves to be reviewed - with the steering wheel in place. Don't get me wrong, even with the control pad it's a fun game, but your enjoyment levels will increase exponentially with the wheel.    That's the handling covered then - excellent, visceral and meaty with a wheel, a little too arcadey, a bit floaty without. What of the rest of the game then?    If you've made it this far into the review, you've probably been following DiRT for a while. You'll know that the game is no longer just about the lonely art of bush bashing against a clock. Rallying is still at the game's core, but there's now a raft of other game modes to spice up the action.      A couple of these modes see you racing seven other rally cars and off-road racers on a variety of track types. Some tracks are long sandy circuits in the middle of the desert, while others are small pits of mud within arena environments. It's a bumper to bumper affair, in stark contrast with the purer art of rally. The AI is very aggressive - we're not sure if this is because it's a little on the simple side, or whether that's the way these guys actually race. It's not too much of an issue though, as bumping and grinding with other cars won't slow you down much.    Crossover matches are similar, in that you're racing against another competitor, but on different parts of the track at the same time. So there's no risk of colliding with them - unless you suck so badly that they lap you.    Still, deep down in its muddy, brown guts, rally mode is the heart of the game. There's two types of rallying action; championship rally, taking in courses from around the world, as well as the crazy art of driving insanely powerful vehicles up steep slopes with gut-wrenching drops off either side, otherwise known as hill-climb. We prefer to think of it as Russian Roulette Racing.    All of these various race types are lumped into one giant career mode. This lengthy experience will take you weeks to complete, but if you don't have the spare time to sink your teeth into something this substantial, there are a couple of snack modes that let you select which race type you'd like to focus on.       All options are presented via the sexiest interface we've encountered. Now, we don't normally harp on about something as banal as a user interface, but this menu system needs to be seen to be believed. Think of the computer Tom Cruise uses in Minority Report, but without the hand gestures, and you'll have a good idea of what to expect. Every section also has detailed recorded voice instructions, right down to the comprehensive garage. When you're loading up a game, which takes quite a while, you'll be presented with a summary of cool information, like the longest jump you've ever done or the number of times you've rolled your car.     We told you the interface was sexy - watch the vid if you don't believe us.  That's right - finally, we get to roll licensed vehicles. About bloody time too. The old excuse about manufacturers not allowing cars to flip through the air like Mexican jumping beans can now be tossed out the window; all 47 licensed vehicles will somersault end over end if you abuse them enough. The destruction doesn't end there though, as DiRT has arguably the most comprehensive damage modelling we've seen in a racer. Windows smash, wheels fall off, engines fail, clutches blow, bumpers crumple, doors fly from the frame and the entire chassis realistically deforms. You'll want to limit the damage though, as sometimes you'll need to race multiple stages with a minimum amount of time to sticky-tape everything back together. It's a feast for sadistic eyes, and you'll give the game's replay feature a thorough workout to see how much punishment you dished out to your car.    These replays also show off the game's other great strength - its visuals. Without doubt, DiRT is the prettiest realistic racer seen on any platform. Using an entirely new engine designed from the ground up for next-gen, the view outside of your muddy windows is more realistic than anything you've seen. Forests stretch as far as the eye can see, with plenty of foliage filling in the gaps. There's the occasional bit of pop-up, but it's the exception rather than the norm. Full cockpits are included for every vehicle, and you can even see the shadows for the car passing through the interior as you change your orientation to the sun.    Strangely, dust and water effects aren't quite up to the eye-watering levels as the scenery - we'd prefer larger, more billowy dust clouds and water spray. You can't have everything though. But the biggest issue, which rears its head most often during multi-car races, is the game's frame rate. The graphics engine obviously pushes the 360 hardware to within inches of meltdown (hang on - aren't 360s always on the edge of a meltdown? Ha!), and during larger races the frame rate can really suffer. Again, it doesn't happen all the time, but when it does it detracts from the game's great sensation of speed. It's by no means a show-stopper though, and doesn't stop DiRT from being the sexiest racer we've seen.      These truly next-gen graphics are complimented by some great sound effects. As well as the accurate navigation being piped to you by your navigator, the ambient sound effects are terrific. Engines have that rough ~baaaarp, baaaarp~ that rally cars are renowned for, while the sound of the gravel bouncing off the underside of the car is a subtle touch. I love the way that sounds become a little echoey when driving next to a wall, rather than just in tunnels.    So DiRT covers off most of the racing checkboxes with aplomb; handling - check (if you've got the wheel to do it justice). Deep singleplayer mode with plenty of variety - check. Great damage modelling, visuals and audio - check. Which leaves one area to check out - multiplayer. Sadly, it's this feature of the game that lets the rest of the package down.    You can read our detailed multiplayer impressions here, where the joy of thrashing the US IGN team was tarnished by the fact that DiRT's multiplayer is so sucky. Cutting straight to the end of this disappointing chase, DiRT does not allow you to race other people at the same time. You can't even race their ghost cars. Instead, up to 100 people can join a lobby, and then race against a clock simultaneously, checking each other's times along the way. Not a bad idea, if only the voice communication between players wasn't so rubbish, and the fact that the host can't choose which tracks or cars to race. Nope, instead the game gives a very limited, very random selection of races to choose from.    Considering the singleplayer game introduces multi-car rallying disciplines, there's no excuse for the game not to have online racing. Oh well, at least Sega Rally isn't too far offRegardless of the lacklustre online play, DiRT continues to shine through its layer of mud and grime as the king of accessible rally racing. If youre an anally retentive Richard Burns Rally fan, you might find it a little too arcadey for your liking, but for the rest of us it doesnt get much better. Well, provided youve spent the AU$129 on a Wireless Steering Wheel", "date": "Jun 26, 2007"}