{"name": "Marvel Trading Card Game", "name_review": "Marvel Trading Card Game", "ref": "https://www.ign.com/articles/2007/06/26/marvel-trading-card-game", "text": "The tabletop card game giants Magic: The Gathering, Yu-Gi-Oh! and Pokemon have all made their way to handhelds in some form. Upper Deck's Vs. battle system finally joins the big boys with the introduction of the Marvel Trading Card Game on DS. If you've always wanted to battle Marvel heroes and villains in a digital card game, your dream has finally come true. It's just too bad developer Vicious Cycle couldn't dream a little bit bigger for this modest entry into the pantheon of collectible card games.    Working on a premise similar to Magic, the Vs. system creates a two-player battleground where players call forth increasingly more powerful characters in an effort to drain their opponent of all his endurance points. Characters come with a resource cost, which is relative to their power. Scrubs like Prowler and Destiny cost one or two points, while the fully-powered Magneto costs a whopping eight points to put into play. All characters come with an offensive and defensive rating and (usually) a special action. In alternating turns, players attack one another, using ~plot twists~ to enhance their characters' attributes or otherwise make things difficult for their opponent. It's a bit geeky, but it's also quite a bit of fun.   With MTCG, you'll have access to more Marvel characters than in the history of gaming. Of course, this is all handled with cards and simple mathematics (~My 4 attack is more than your 3 defense!~), so it isn't like you are controlling Hulk smashing Wolverine. Still, all of Marvel's major players are included in multiple incarnations as are scores of smaller characters. Onslaught, Super-Skrull, Namor and Jarvis, the Avenger's butler, all make appearances, ensuring every corner of the Marvel Universe has been covered. What more could a Merry Marvelite ask for?    Vs. is a decent system that does force some strategizing and can't be played blindly. But no matter how clever you might be selecting your attack order and using plot twists, the battle is generally decided by the quality of your deck and the luck of the draw. It also helps if you toss some of the unbalanced characters into your deck. While most characters have appropriate power levels to match their cost value, there are several, such as a mid-level version of Sabretooth, who have unjustified attack and defense rating. In the tabletop game, this can be addressed with house rules, but any unloved cards can't be pulled from Marvel Trading Card Game's virtual deck.    It doesn't help that you begin the game with nothing more than either a Heroes or Villains starter deck. To pick up booster packs and refine your deck, you'll need to progress through the incredibly long single-player story mode. There are both a Heroes and a Villains path for the story, each consisting of seven chapters. Those chapters contain 10-12 battles each lasting between 20 minutes to an hour. In other words, to play through both stories, you'll need to invest most of your summer vacation. That's awesome in one sense, but also limiting, since progression in the story unlocks new booster packs. Only by getting deep into the single-player missions can you hope to gain access to the full library of Marvel characters.   Though MTCG's single-player is fairly deep and enjoyable, the focus is on multiplayer. While owners of the PSP version get to enjoy purchasing cards off Konami's online store and participating in online tournaments, the DS version is more limited. You're pretty much only going to use the online for head-to-head play. It works perfectly and it's certainly fun to battle against a buddy. And hey, it's a lot cheaper buying a DS cartridge than buying a few dozen packs of the tabletop version.  Marvel Trading Card Game has a solid foundation, but the presentation and visuals are abysmal. Long load times, fast-scrolling text, and lots of low-res graphics seriously damage an otherwise enjoyable experience. The artwork in collectible card games is sometimes as worthy of admiration as the addictive gameplay, yet the art is given only secondary consideration in MTCG. Despite using the lengthwise ~book~ setting on DS, the images still come out too small and in low-res. Though gameplay is what truly matters for a game, this is one instance where narrow-sighted development hampered the packaging and weakened the game as a whole. I have to admit, I am somewhat addicted to the Marvel Trading Card Game. It's not a great game by any measure, but it does an excellent job of tapping into the collector's mentality of comic-book fans. Upper Deck's Vs. system is inferior to Magic, Munchkin and Pokemon, but is still enjoyable. The fact that it taps into so much of Marvel's mythology may be reason enough for Marvelites to give this a try. Just be warned that the game is far less than it could have been due to weak visuals, repetitive sounds and a story mode that is too long for its own good. MTCG isn't as enjoyable as its tabletop counterpart, but it has proven to be a nice distraction that, for some intangible reason, keeps drawing me back.", "date": "Jun 26, 2007"}