{"name": "Mega Man 2", "name_review": "Mega Man II Review", "ref": "https://www.ign.com/articles/2007/06/26/mega-man-ii-review", "text": "Coinciding with the 20th anniversary of Mega Man, Capcom has released its mobile port of what is arguably the best title in the Blue Bomber lineup. Mega Man II was the the game that established exactly what audiences should expect out of the series: Frantic run and gun action with a twist of that rock-paper-scissors mechanic to overcome your adversaries. Now that it's on mobile, it's a great reminder of how much fun Mega Man can be, despite a few bumps in the road.   For those who haven't been paying attention to the gaming scene for the past two decades, Mega Man is probably the most tried-and-true side-scroller out there. The basic formula: Players guide our hero through a series of stages, each one lorded over by a boss robot whose power you gain once you defeat it. Each power has its strengths and weaknesses over other adversaries, requiring players to carefully choose the sequence of which bosses they face. Flash Man is weak against Metal Man's circular saw gun, Quick Man is weak against Flash Man's freeze time ability, Air Man is weak against Quick Man's boomerangs... you get the idea. Once you defeat all of these stages, Dr. Wiley's castle opens up and the last leg of the game begins.   The game was one heck of a challenge, so the creators added a code system to make things manageable, which was ingenious during the time, but as they say, the times have changed. Now, a save system has been implemented, recording your progress as you clear every stage until you get to the final castle, which makes things a tad less difficult. Every time you start a given stage, you're gifted three lives and plenty of 1-ups pop up throughout the levels. Should you use up all of your lives, you just have to start the stage over again without need to worry about continues or life management. It would seem that the mobile version of Mega Man isn't quite as challenging as it used to be, but there are other challenges to face in the game.   The biggest challenge thrown your way will easily lie within the controls. That's not to say that they're horrible, but they certainly could use a little work. Both the d-pad and number pad are used, making for a control scheme that is a bit overwhelming and it may take a while before you get the hang of it. If you're only using either the D-pad or number pad, you'll find that it's near impossible to navigate your way through the game, but if you use both, it becomes easier. If you take things one step further, transitioning between the D-pad and the number pad as the situation calls for it, running and gunning at the same time, you'll be in good shape. There will be frustration until you get there, but once you have it, you'll find something as satisfying as what we remember from the 8-bit glory days.   Where the game shines the most is with its audio/visual presentation, as Capcom used the BREW capabilities of these phones exceptionally well in that regard, providing a perfect visual translation. The sprite-based graphics aren't very demanding, so it's not that big of a surprise to see everything faithfully recreated. The sprites and the level layouts were exactly as I remembered them, complete with all of the various animations rendered smoothly, helping out immensely with the game's appeal.   Hearing that familiar Mega Man II theme song when you boot up the game was a pleasure after such a long time, showing that the sound was recreated fairly well, but it did hit a stumbling block. While the various tracks are recreated perfectly note for note, the loop of the tracks aren't handled so well. Rather than seamlessly starting up a track when it finishes, the music fades out before starting up again, leaving a very noticeable gap -- a minor complaint. Also absent were a handful of sound effects including the various blips and bloops from Mega Mans gun firing, when he jumps around, or the explosion sound effect from when he dies, adding to the awkward misstep. If you've never played the game before, it's more than likely that you won't even notice this discrepancy, but If you're a fan of the game, it's probably going to hang in the back of your mind.  Though Mega Man II has its faults, it's still a solid mobile action game. Most of its appeal lies in its nostalgia-inducing charm, making it more for the fans of Capcom's classic series; those of you who are just looking for a decent side-scroller, though, should consider the pedigree and give it a play just to see the sights of video gaming circa 1986. Though it has some audio issues and a control-related learning curve, when I hit the groove, I smiled like a little kid with his first NES.", "date": "Jun 26, 2007"}