{"name": "Transformers", "name_review": "Transformers: The Game Review", "ref": "https://www.ign.com/articles/2007/06/26/transformers-the-game-review-2", "text": "Whether you're an old school 80s Transformers fan or a newcomer to the series, there's no doubting the marketing power and summer blockbuster aura around Transformers: The Movie.  A series now over 20 years in the making, you'd be hard-pressed to find gamers out there who don't know the story of the noble Autobots and evil Decepticons, so when a Transformer game comes along -- let alone one based on a movie with an immense amount of buzz -- people are going to pay attention to it.  In the case of Transformers: The Game, IGN is split amongst reviewers, as editors from the PlayStation, Xbox, and Nintendo teams all wanted a crack at Transformers to see whether our nostalgic expectations would be upheld.  Interestingly enough, however, amongst each of the three games, we ultimately share the same opinion; Transformers: The Game is a shell of what it could have been, and ultimately only a passable experience.    Transformers: The Game is a token movie/game experience.  Published by Activision and developed by Traveller's Tales, the game offers a parallel story to the film, allowing players to take the side of either Autobot or Decepticon and go between the scenes of Bay's movie in a free-form, mission-based experience.  From initial boot, the game is already hit and miss, as the introductory cut-scene is horribly compressed, rendering what might have been an atmospheric cinematic less so.  Along with it though, the voice of Optimus Prime himself details the history of the Autobot/Decepticon rivalry, familiarizing fans and newcomers alike to Bay's interpretation of the franchise.  From there, players choose either Autobot or Decepticon loyalty and begin their quest to retrieve the ~AllSpark.~    No matter what side you take, the general gameplay progression is the same.  Yes, you'll have totally different missions depending on which ragtag bunch of Cybertronians you side with, but both sides offer similar mission-based chapters wrapped in an open-world area.  The idea here was to create something similar to GTA, but Activision's own Grand Theft Autobot comes up significantly short.  You can explore the regions -- be it desert, city, suburban, or the like -- all you want, but ultimately there's just one mission to take part in for actual story progression.  Other than that, feel free to transform and roll out as you see fit, collecting up to 100 energon cubes per area, per player.  The claim that Transformers is truly an ~open world~ is a bit misleading though, as it's more of a mission-based game within specific ~arenas.~  There just isn't enough diversity within areas to give the actual feel of anything more than a destructible sandbox.   As far as the actual missions go, they're pretty straightforward, and can get repetitive fairly quickly.  On the Autobot side, it's all about driving to a waypoint, and bustin' some deceptichops.  While the game focuses primarily on the movie's key characters, you'll also come across some rather generic looking drones to fight, though nearly all of the combat focuses on melee attacks (horizontal waggle with either nunchuk or Wii-mote) rather than using the badass weaponry on A and B buttons.  At any time in a fight, enemies can put up energy shields that stop you from shooting, hitting, or even throwing items at them.  Not only does it lack logic, but it also takes away from the chaotic melee/shooter portions of the game.  Plus, how the hell does an energy shield negate a thrown city bus?  We call cheese on that.   During the Decepticon campaign you'll see a bit more diversity, as you can blast the hell out of anything in sight (something you're penalized for in the Autobot mode) and use firepower to dish out damage on buildings, human vehicles, and Autobots alike.  In addition, the Decepticon transformations make for far more diversity, as you'll blast through the skies with Starscream, hit the streets with Barricade, fly chopper-style with Blackout, or tunnel with Scorponok.  The Decepticon army also makes use of mini-cons (originally found in the 80s cartoons as well) to spice up the combat, so you'll use Blackout in chopper mode, and then dispatch mini-con Scorponok when the mission dictates.  It's still pretty basic on the Decepticon side, but at least there's more diversity in the vehicular forms even if boss battles are handled with little else than energy shields and waggle.    And while Tranformers is one of the better looking Wii games thus far, making use of 480p and 16:9 display along with some solid bloom lighting, smoke and fire effects, and open-world environments with decent draw distances, it's the design that doesn't translate quite as well onto Wii.  An IR cursor is used for aiming in tandem with the classic lock-on targeting of the other versions, but glitchy IR and low sensitivity hurts the experience overall.  Rather than having look sensitivity change the IR's bounding box -- a tactic used in Scarface, for example -- it changes only the rate of turning, so players will need to push the IR all the way to the ends of the screen a la Red Steel in order to move the camera.  For any Wii shooter vets out there, we don't have to tell you how annoying that can be.  This makes turning, looking, and locking-on more of a hassle, and something Wii players will need to deal with should they choose Nintendo's version.  Across each of the available platforms, Tranformers: The Game has some serious issues.  Combat is too one-dimensional, focusing mainly on melee, as your firearms do nothing against enemy shields.  As an ~open world~ game, Tranformers can also feel fairly closed off because each area dispenses only one mission at a time, making for an entirely linear experience wrapped in a relatively void and underwhelming world.  IR isnt perfect, causing quirky camera issues and annoying lock-on problems.  Still, Transformers isn't a total wash, and we can see the potential for entertainment.  Doing battle,  while shallow, is still good for some basic entertainment.  The game offers a ton of unlockables, so the average player will unlock something new (even if its just a piece of promo art from the Dreamwave comic series) every few minutes, and the scenarios do a decent job of making use of both robot and vehicle modes.  A fully-destroyable environment makes for a ton of collateral damage during fights, and nearly any piece of the environment can be picked up and used as weapon should the need arrive.  Its simple, shallow, but still entertaining at times.  This may not be the Transformers game we were hoping for, but it has its moments.", "date": "Jun 26, 2007"}