{"name": "Beetle Buggin'", "name_review": "Beetle Buggin'", "ref": "https://www.ign.com/articles/2000/04/15/beetle-buggin", "text": "Have you ever felt the undeniable urge to get in one of those new VW Beetles and tear down a race track suitable for NASCAR cars?  Or perhaps you've experienced the need to hop into a sand buggy and take it for a spin down an asphalt speedway?  Okay, so maybe that's a little far-fetched, but surely everyone has had an unquenchable desire to barrel around a dirt road stadium in a brand new Volkswagen Thing.  If this kind of rip roarin' action is the sort of thing that makes it worthwhile for you to get up in the morning, then Beetle Buggin' may just be the racing game for you.  As a matter of fact, despite the small bit of sarcasm there, it may even squeak into the libraries of a few more people than the dedicated dozens of fans to which the title speaks.  Cranking up the engine, players are treated to what is quite possibly the most entertaining comedic intro in the history of PC racing games.  This thing is loaded with more cheese than the Kraft factory.  One might think that the quality of the graphics might be sufficiently transmitted by showing the real life racing videos played next to the in game perspective.  However, the designers saw it fit to place these images against a decidedly 70's background of vibrant colors and then cap off the whole spectacle with a selection from The Dukes of Hazzard's Greatest Hits album.  Also fascinating during the sequence was the splash of the words ~Beetle Racin'~ across the screen several times, as if to signify that this was the title of the game when it in fact should read ~Beetle Buggin'~  This little tidbit lends to the hypothesis that either the title was changed towards the end of production and there wasn't enough time to alter the intro, or that this was simply a glaring error of the quality assurance team.  For the sake of leniency, we'll assume the former.    Once past the rather distracting movie adventure, the menu screens and options available are actually rather well done.  Each choice is accompanied by a small circular window of running animation that signifies what that particular item will do for you.  Though a rather small touch when laid next to most of the other things by which games like this are judged, it looked very slick and deserves at least an honorable mention.  Among the available game modes are Quick Start, Championship, and Beetle Challenge.  The first is very much what you might expect.  Gamers are given the choice of participating right away in one of five different events - Jump, Buggy, Speed, Monster, and Cross. Ranked here in order of ascending difficulty, Jump starts things off with an insanely simple task of jumping a set number of feet, utilizing a turbo charger and a 15-foot ramp. Buggy starts to get a little rougher, placing players in a dune buggy of sorts to race through a beach scene/city highway combo (I know, sounds odd doesn't it?) against five other competitors.  Speed then takes things up a notch, adding two more competitors in a racetrack full of VW Bugs.  To this point, the hair pull rating is still tolerable, but it's all down hill from here.  The Monster event involves taking massive trucks with nearly no attitude control around a mud laden course, while trying to avoid a vast array of obstacles.  As if this wasn't insane enough, you'll be asked to perform this feat within a specified time limit, and hitting obstacles along the way deducts from that period.  After seeing an inordinate amount of mud fly, it is indeed possible to pull this off, but it may take you awhile.  However, it surely won't take nearly as long as the final event, the Cross.  A similarly styled course, sans obstacles, is the venue for this bad boy.  Incredibly, all 7 of your racing companions seem to be imbued with a holy aura of god-like driving ability.  They accelerate around corners that you must navigate at the blinding speed of 12 mph to avoid crashing into a wall.  They blow past you on straight-aways as if utilizing some sort of space aged new fuel that slipped past your technical crew.  Furthermore, they seem to be intense fans of hanging back in the first part of the event to instill a sense of confidence in you, only to quickly crush it underfoot in the final lap of the race.  I was unable to place higher than 3rd in this event for some time, but hey, maybe you'll get lucky.  While the Championship mode is just a glorified version of Quick Start, with ladder rankings and an ultimate goal, the Beetle Challenge mode is the real gem of the title.  In this area, racers must compete in the predefined events, at varying difficulty, in order to win prize money and access to the World Beetle Championship race.  The option to purchase other vehicles is a welcome gift here as all Quick Start races begin with the choice of an awe-inspiring two cars, and the Challenge section offers only one.  A little limited at first, but at least there is room for improvement.  Among the items in the ever-shortening list of definite attributes in Beetle Buggin' are the visuals, which are extremely impressive.  Making use of DirectX 7 and your favorite D3D or 3Dfx video card, some truly beautiful landscapes, car models, and animation effects can be witnessed.  The scaling quality of the cars and track atmosphere, coupled with the lighting effects used, make what appears on that old dusty monitor seem quite believable.  Though a bit 'cartoonish' in its presentation, this little guy is easily on par with any other respectable racing sim on the market today.  Unfortunately, the same care that was put into the graphics of this effort was apparently not applied in its music selection.  Sounding like a cross between old school country and a circus clown melody, the orchestration here is more than disturbing.  Conversely, it must be admitted that these tunes seemed oddly consistent with the general feel of the game.  Were I screaming down a highway at 200mph in a bright green beetle, this may in fact be the music I would choose to throw in the CD player.  However, I'm not quite that crazy, so it simply doesn't work for me.  If I ever do go completely crackers though, at least I'll know what soundtrack to order.  In the proverbial nutshell, Beetle Buggin' is an intriguing experience.  While offering top notch graphics and a somewhat cute gameplay style (in a weird, Herbie sort of way), this sucker just doesn't seem to fall into any sort of niche.  Racing game fans, speaking on a majority basis, are more into slick looking Nascars, Indy vehicles, insane 4x4 monsters, or lightning fast motorcycles.  Notice that the word ~beetle~ is not found anywhere in that listing.  However, if you're a racing nut, or even just a little interested as to what this game could offer, definitely give it a try.  Or, if you happen to be one of the chosen few out there who have been looking high and low for the ultimate beetle racing simulation, may thee look no further.  -- Rich Rouse", "date": "Apr 15, 2000"}