{"name": "Final Fantasy", "name_review": "Final Fantasy Review", "ref": "https://www.ign.com/articles/2007/06/28/final-fantasy-review-2", "text": "The saying is older than dirt, but perhaps there truly is merit to the old adage, ~can one desire too much of a good thing?~ Mind you, I'd never really given that phrase too much thought before, but after playing through the original Final Fantasy for what has to be the 643rd time, I'm starting to think that Shakespeare was not only a genius, but a seer.   It's not that there's anything fundamentally wrong with Square Enix's latest homage to Coneria and its neighbors... it's just that we've played it so many times before that it lacks that special magic. Important as this game may be in the annals of videogame history, it has been re-released and remade so many times (and in better ways at cheaper costs) that much of the original's spirit seems to have left the project.   Is the paper-thin storyline, unpopulated world and simplistic battle mechanics still forgivable after we've already experienced them on the NES, PlayStation, and GBA? Well, yes... but not nearly as much.   Tiamat is a pain for physical characters, but mages mess him up. That's especially true for veterans of the GBA remake, Dawn of Souls. This 20th anniversary edition may benefit from new visuals, redone music and a bonus dungeon, but other than that the content is exactly the same -- right down to the easier difficulty level and additional areas. Okay, so it's almost the same... Final Fantasy II isn't included in the UMD as it was in Souls, but will be released as a separate PSP release next month.   That's not to say that there are people who haven't played Final Fantasy. I'm still amazed at how many folks out there have never tried Pac-Man or Kung Fu or even Sonic the Hedgehog -- but weirdoes like that are out there and it's the audience that FF1 should appeal to. Basic as it may be, there's still some fun to be had in it -- particularly when fighting the spiffier-looking bosses or viewing the always-cool bestiary. Moreover, if you want to feel like a virtual demigod, the combat will definitely make you feel as such with the sheer number of random enemies you'll obliterate with your spell and sword attacks. In other words, the 12-15 hour quest lends itself well to the ~pick up and play~ philosophy.   Oh, and it also has to be said that, despite its familiarity, the aforementioned visual and audio upgrades are really quite pleasant. The new art style and 16x9 perspective takes real advantage of the PSP's crystal-clear screen and the remixed music is pretty catchy. I can't say that the boring and occasional FMV sequences are as compelling, but at least they're there, right?If this is somehow your first time ever playing the original Final Fantasy, then you may find its basic premise and gameplay a nice distraction between bus trips. But make no mistake -- the game can't compete with more modern PSP RPGs like Valkyrie Profile or Dungeon Siege, and its decision to use only half of Dawn of Souls' content three years later with a price tag that isn't low, leaves Final Fantasy vets like myself feeling disappointed with the dj vu.", "date": "Jun 28, 2007"}