{"name": "G1 Jockey 4", "name_review": "G1 Jockey Wii UK Review", "ref": "https://www.ign.com/articles/2007/06/28/g1-jockey-wii-uk-review", "text": "Who could ever have known that a day at the races could be so complicated? If you were one of the ones who got all dressed up for Ascot, you might imagine it involves nothing more than being small and riding a horse, or being posh, sitting in the stands and quaffing expensive booze while enjoying a flutter. If, on the other hand, you're fresh from the Wii Play paddock, you might think you could squash a horse race into a videogame by giving it some simple Wiimote waving and chucking in some charmingly cartoony graphics. But if you've mastered the art of cow riding on Wii Play and you're thinking of graduating to Koei's jockey-sim, you'll need to take note: it's not as simple as just waving your wand at the screen. It gets a little bit more complicated than that.    Jumping requires you to pull back on the nunchuk at just the right moment.  G1 Jockey Wii is a port of the latest PS2 title in the series, and it shows immediately because you can't navigate the menus by pointing at the screen with the Wiimote. Instead, you'll have to use the D-pad or the analogue stick to move around. And there are a lot of menus. Sure, the back of the box might be full of pictures depicting horses in full flow down the home straight. But G1 Jockey's career mode, which forms the main substance of the game, will see you spending a lot of your time in the stables, or on the training paddock, or just chatting to reporters, or mentors, or fellow jockeys (be they rivals or friends).   And that's where the first complicated bit comes in. In spite of its action sequences G1 Jockey is, essentially, an RPG, in which you train your horses, hone your riding skills, and try to become the best jockey of them all by winning as many races as possible. You can tell it's an RPG because it's got loads of talking heads, the same as every other Japanese RPG, with the same sort of blandly upbeat and positive dialogue - 'isn't it great now we've all graduated from riding school', or 'I can't wait to meet my mentor', and all that sort of whimsy.    You can also tell it's an RPG because you start the game with a sepia-toned account of your love for horse-riding, before selecting various options for your character. You can select everything from your racing colours to your stable affiliation, and, in time-honoured RPG fashion, it chucks an overwhelming amount of statistics at you, right from the start. Take choosing a stable affiliation, for example. What's a stable affiliation? Who are these 16 stable owners that appear suddenly before you? What does it mean that John Pears owns Holy Man (2/C 1800-2500), or that Abigail Robinson owns Saint Loup (4/C 2200-3200)?   Its impossible to discuss G1 Jockey without mention the menus - there are loads!  They're not questions that are answered during the first part of the career mode, even though it's designed to function as a tutorial. Instead, this tutorial takes you through the nuances of the horse-riding controls. And that's where the second complicated bit comes in, because in spite of the simple input of the Wii controller, riding a horse turns out to be actually pretty intricate. The basic controls see you shaking the nunchuk forward to accelerate and back to decelerate (and jump), and you twist it to steer. The Wiimote, meanwhile, allows you to whip your horse in various different ways. But there are plenty of added nuances. To accelerate well, for example, you need to time your shaking with the horse's stride, and when you're using your whip you'll need to be fairly precise with the Wiimote to make sure you don't do so too hard, or in order to use different whipping styles.     Further complications arise because horse races turn out to be as much a test of strategy as of your co-ordination. For a start, there are different types of horses - some like to lead for the whole race; some like to jostle for position; and some like to make their break from the back of the pack. And so you'll need to play to the strengths of whatever horse you're riding and time your sprint to the finish accordingly. But you'll also have to keep an eye on your horse's stamina, as well as their 'motivation' and 'potential', in order to know when it's better to whip your horse and when it's better to just pretend to whip your horse, and in order to judge precisely when to eke out those last precious efforts from your horse as you drive over the final furlong.   Its easy to get carried away in the thrill of the chase, but stick to your strategy.  And after trying to take all that in on the training ground, the game proper starts, and things get a bit more complicated still - partly because the menus are so difficult to navigate. Each turn represents a week, during which you'll train and take part in races. You'll also be able to chat to NPCs, which you'll need to do because it's by making friends and winning races that you'll be offered lots of horses to ride. In order to accept those offers, and try to negotiate for more, you'll have to flick through a series of stat-filled pages in order to participate in a slightly confusing sort of auction process.    So G1 Jockey is dauntingly complicated and you'll need some patience to persist in the face of its convoluted menus, intricate race strategies, and annoyingly twee music (which runs the full gamut of noodly muzak styles). But if you do persist in the face of all these obstacles, you'll find the racing itself quickly becomes fairly intuitive and actually pretty easy.   Winning races allows you to build up a rapport with specific horses.  Then something strange starts to happen: you suddenly realise that you've succumbed to the game's idiosyncratic charms, even if your only previous interest in horses was as an excuse for an all-day drinking session. There's just something inordinately satisfying about choosing the right moment to surge past the pack in front of you; or springing out of the traps and managing to pace your horse so he's got enough energy to strain his neck ahead of the following pack at the finishing line.So if you are basking in the afterglow of another drunkenly fuzzy day of the races, dont be under any illusions. Unlike the cow-racing game in Wii Play, G1 Jockey isnt something you can simply pick up and party with, because it buries its deep and involving appeal beneath an imposing and overcomplicated edifice of statistics and menus. But if you have the patience, youll certainly find it enduringly endearing.", "date": "Jun 28, 2007"}