{"name": "The Bigs", "name_review": "The Bigs Review", "ref": "https://www.ign.com/articles/2007/06/29/the-bigs-review", "text": "By now, most baseball fans have probably played through a couple of seasons with the baseball titles released earlier this year.  They've won and lost pennant races, World Series games and lead lean and stellar franchises.  The hardcore fan has probably even synched up their game experience to real life in time for the All-Star Game in a few days.  So with all of that, is there any more room for a baseball title that comes out right before the All-Star break?  2K Sports and Blue Castle Games seem to think so, with their recent release of The Bigs for the PS2.  But does the arcade styled game stand up when the game's on the line, or does it crumble under pressure?   The Bigs stands out from other baseball titles in two specific manners: it focuses in on big time plays that take your breath away as well as the pitcher/batter duel for every at bat to build a palpable level of tension within the game.  Along with a shortened number of innings (five versus the regulation nine innings for the sport), The Bigs imparts a sense that just about anyone can (and often will) pull off an incredible defensive play when it's needed or be the catalyst for a critical rally.  Part of this is due to the implementation of the Turbo and Big Play meters for the game.  Players boost their turbo by throwing strikes or getting batters to swing and miss, or taking balls at the plate.  Since you are free to use your turbo whenever you want, you can store up turbo until you really need a boost to get your club going on either side of the ball.   Take yourself out to the Bigs ballgame. Turbo winds up enhancing a player's abilities, giving him the chance to pull off moves that he wouldn't normally be able to do.  That includes supercharged throws to get someone out, rocket fast sprinting along basepaths and powered up swings that easily clear the walls or knock a fielder off their feet.  Using turbo won't always guarantee success - a fielder with a strong enough arm can still throw out a boosted runner, for instance - but it does add a bit of drama and excitement to an inning.  Besides, near guaranteed success is where the Big Play meter comes in.  Almost any offensive or defensive play that you pull off will provide points to your Big Play Meter, which can only be triggered when it's filled and glowing.  For batters, it provides a Big Blast, which lets you smash any pitch out of the park, while Pitchers gain Big Heat, adding incredible breaks on every ball thrown.   What winds up detracting from the PS2 version of The Bigs is that it has many of the same issues that the 360 and PS3 versions suffer from.  The rubber band AI for the computer is just as relentless, and the number of comebacks that you'll suffer from can be infuriating as your opponent stages the largest rally in baseball history to crush you.  Fielders will still stand still for a second, which can hamper your chances to make a play for a fly ball or a line drive - that is, if they don't try to jump one way or the other for the ball.  You will still find yourself throwing home more times than you want because the all-purpose button for dives and jumps is still tied to the X button, which will ruin your chances to turn double plays.  However, there's another, newer issue that crops up every now and then during gameplay.  There appears to be a lag when you're building power for a throw, which can often result in tipping your hand for the other player.  We went through a couple of games, and there appears to be a one or two second hitch every now and then which doesn't start the power meter up.  As soon as you release the button, it builds, and you accidentally throw a ball or lazy strike that's easily hit.  At least it gets you into the game quickly with fast load times.   Making incredible catches is just a part of the game. Now, players can still enjoy a quick Play Now session or an Exhibition game that offers more options for your particular match up, such as jerseys and difficulty levels, as well as inning lengths.  Players can also take advantage of the Home Run Derby that's present in The Bigs, cranking balls out of AT&T Park and into McCovey Cove.  However, players won't be able to take advantage of the enjoyable (and destructive) Home Run Pinball mode that was featured within the PS3 and 360 versions of the game.  Don't get me wrong, it's great to take advantage of an All-Star Week tradition, but smashing balls through Times Square would've been an awesome addition to the PS2.    Just like the other versions of the game, players won't experience a franchise or season mode for The Bigs, instead relying upon the Rookie Challenge to experience the action of the major leagues.  Players create their own slugger, taking them through the earlier action of spring training into the season and eventually into the World Series with your chosen team.  As the year progresses, you'll be tasked with various goals, such as getting a specific number of stolen bases or home runs with your rookie during a game.  You'll also need to boost your player's stats with training mini-games that put his fielding, batting and catching abilities to the test.  Like the other versions of the game, players still won't have any idea how their club is doing or their relation to the rest of the teams in their division.  Nor will there be an explanation as to why regulation nine inning games suddenly pop up in the playoffs.  But the largest knock on the PS2 version of Rookie Challenge has to be the fact that it doesn't have nearly as many options for customization as the PS3 or 360.  It's understandable due to the system, but it's somewhat underwhelming when there's only four kinds of generic players you can choose from, with relatively minor adjustments for each.   You'll be playing a lot of five inning games instead of a season. At least the online version of the game is solid.  Players will be able to create their own games with three, five, seven or nine inning matches for players.  Just about everything, from player uniforms to whether or not you'll rank a game to be posted on the leaderboards can be configured before you play someone.  You can also download updated rosters from the servers to make sure that the squads you play with are as current as the actual teams.  However, a significant bonus which the PS3 version is missing is that players will be able to create a friends list, easily allowing players to find people they want to play games with without randomly going through other opponents.   Unfortunately, The Bigs doesn't stand out as well on the PS2 as it does on other platforms.  While some of the player faces look great, some of the camera angles on some players can be so dark that you can't tell who they are.  Similarly, even though the heightened aspects of the ballparks stand out, the backgrounds suffer from some muddy textures. Perhaps one of the worst elements comes with the triggered turbo and Big play moments, which colors the screen a shade of red and blue respectively.  It's not dramatic, nor does it wind up adding to the action on screen - it's just odd.  From the limited baserunning icons to the seams in the backgrounds and the relatively normal looking character models, this game easily pushed the limits of the PS2.  At least it runs smoothly without any slowdown, which is a serious feat.   Don't adjust your set...Turbo has been activated. The game is still solid in the sound department, however.  While Damon Bruce is the new guy on the block, he provides a decent job behind the mike, with a number of good comments.  He still winds up repeating a number of lines and he may miss a call here and there, but for the most part, he is a worthy successor to Miller and Morgan.  The wooshes of turbo-powered balls and the crack from bats sounds perfect, and the soundtrack is extremely solid.  Personally, you can't go wrong with Ace of Spades from Motorhead, but having Stone Temple Pilots and Primus amongst some of the artists is a great touch as well.It still doesnt have Season or Franchise modes, and it might not be as impressive as the PS3 and 360 versions of the game, but The Bigs still plays well, if you can overlook some of its flaws.  The game packs a lot of fast paced action into the title, with dramatic big play moments dominating the gameplay.  However, some of the visual hiccups show that this game was easily stretched to its limits when it landed on the PS2.", "date": "Jun 29, 2007"}