{"name": "Go Puzzle", "name_review": "Go! Puzzle Review", "ref": "https://www.ign.com/articles/2007/06/29/go-puzzle-review-2", "text": "Old-school shooters, miniature strategy games and retro revivals are all fine and good, but it's the brainteasers that make up the foundation of the casual games market. Until now, however, the PlayStation Network has been somewhat devoid of titles in that category. Other than Go! Sudoku, Super Rub-a-Dub and Lemmings, there haven't been any other mindbenders for those in the hunt -- more importantly, though, there hasn't been that one big puzzler that has everyone talking...   Sadly, there still isn't.   But there is Go! Puzzle, Sony's latest attempt at expanding its library of PSN stumpers. And while the game does offer a mild dose of fun depending on which of its three titles you play, it's certainly no Zuma or Astropop.   Don't play Aquatica. It destroys brain cells faster than most drinking binges. One thing that can't be denied, however, is that Go! Puzzle does provide an awful lot of content for a low price. Swizzle Blocks, Aquatica and Skyscraper are three distinctly different games and each one has their own stylized modes, multiplayer options, etc. Available as separate purchases at $2.99 or $5.99 for the whole shebang, Go! Puzzle definitely gives people their money's worth.   Of course, there's a rub -- and that rub is the fact that none of the three titles actually standout from the competition. In fact, one of them is outright terrible.   ~Captain Terrible,~ or ~Ugh~ as I like to call it, is Aquatica. It's your prerequisite variation on the classic ~falling blocks~ concept, except that your blocks are multicolored sea mines that can only be flipped horizontally. The idea here is to clear out all the mines by matching up like-colored blocks by the threes. You'll get the occasional ~specialty~ mine as well, but the gameplay in Aquatica is so incredibly boring and slow that it doesn't matter. The contrasting colors and poor graphics make the screen difficult to look at for long periods of time and the music is straight out of Sesame Street's B-sides. Avoid it.   Be on the lookout for Skyscraper -- it's the best game in the set. Swizzle Blocks fares quite a bit better, but it's unquestionably the most complicated game in the set. Here, you have to match four like-colored squares (with eyes) in box formations using a targeting reticule that does different things depending on where you place it (sometimes it will move one square, other times two). Clear the grid-like screen as fast as possible and it's off to the next level. The single-player game is only passable thanks to it a moderate learning curve, but the multiplayer option is where Swizzle Blocks truly shines. Boasting an array of power-ups and some intense action, the two-player ~Battle Mode~ is surprisingly addictive and fun. But be warned. Play with the four-player maximum and things become more confusing than entertaining.   That brings us to Go! Puzzle's best game, Skyscraper. In it, you're an astronaut who has to move from one size of a building to another before ascending a floor and repeating. The trick here is that the only way to complete your goal is by moving across tiles of a single color. Of course, strategy comes into play when figuring out which color should be stepped on first to proceed (and how you're going to step on all the titles before time runs out). It's a charming little puzzler that's easy to learn but difficult to progress in; in other words, it's what it should be but it's not very deep.Go! Puzzle has a large array of modes given its price, but none of the games included in it truly stand out. Swizzle Blocks and Skyscraper are okay and may get a few hours out of you, but Aquatica sucks like a new Eureka Boss SmartVac. All things considered, this collection isn't a bad pickup for desperate puzzle fans that don't play PC flash games or Xbox Live on a regular basis, but if they want originality or pizzazz they had better look elsewhere.", "date": "Jun 29, 2007"}