{"name": "Ratatouille", "name_review": "Ratatouille Mobile Review", "ref": "https://www.ign.com/articles/2007/06/29/ratatouille-mobile-review", "text": "Remy is a rat with a dream -- he wants to be the greatest chef the French culinary world have ever seen. Or not seen, really. Knowing he's not exactly welcome in any kitchen (the French have apparently not forgotten out the plague just yet), Remy teams up with a hapless garbage boy named Linguini at a classy restaurant. Together, with Remy controlling Linguini like a marionette, the pair sets out to cook some of the finest food ever served in the City of Light.The game takes places wholly in the kitchen. Linguini must pick up orders from a counter and then assemble them from the dozen or so ingredients in the kitchen. There are many recipes in play, most requiring at least two ingredients. There is a bread station, fruit and vegetable storage, and a cooler for meat and dairy. Each station has several ingredients inside, such as the cooler full of meat, fish, eggs, desserts, and cheese. Some ingredients require additional prep, such as slicing vegetables at a cutting board, toasting bread at the toaster, and boiling pasta on the stove. You must balance cooking some ingredients while gathering others, finally assembling them at the pick-up window.The entire game is one big balancing act. Things can get stressful when the kitchen is full of other chefs blocking your passage to certain stations and the golden order ticket of a food critic is going unnoticed because your entire prep station currently in use. The controls can also add to your stress, unfortunately. I really wish the stations were just labeled with numbers so you could easily tap out directions rather than trying to manipulate a flashing cursor around the kitchen. Since the kitchen takes up more real estate than the screen, you get slowed down when you want to issue a command for Linguini to run to, say, the off-screen cooler while he's at the toaster. Seconds go unnecessarily wasted as you have to scroll up and off-screen to the out-of-sight stations.The game does employ a clever mechanic that I really liked -- the use of both hands to hold multiple ingredients. You can place one ingredient in the left hand and another in the right, allowing you to grab multiple items from the same station, such as both bread and pasta. Then you can race through the kitchen to drop the bread in the toaster and the pasta on the stove without time-killing multiple trips. By the third shift, I had developed shortcuts that allowed me to maximize time by whooshing through stations, grabbing multiple ingredients located close together. However, sometimes these shortcuts failed me when I had to deal with moving that flashing cursor to off-screen spots.THQ Wireless obviously ordered Ratatouille to be modeled in the vein of Diner Dash and Cake Mania, which is a smart move considering not only how these were both excellent casual games that roped in millions of players, but also that the formula applies perfectly to a kitchen-themed movie. So, while Ratatouille should get dinged on originality, there's no point in punishing THQ for it -- especially when you consider that the mobile game is actually more in tune with the spirit of the movie than THQ's Ratatouille consoles games.The game ramps up the difficulty fairly quickly, so it's hard to recommend it necessarily for very young players. Despite its cute appearance -- the graphics aren't going to wow you by any means, though -- this is aimed more toward parents and older siblings that ended up getting dragged to the theater and had a surprisingly good time. (Although, by now, don't we all know that Pixar know how to make a real ~family~ film that speaks to all ages?)For a riff on the Diner Dash-Cake Mania formula, Ratatouille is actually a fairly entertaining little game. There is some much needed depth by having over a dozen ingredients on hand, making it something of a challenge for even older players. I wish the controls had been cleaned up a bit; that would have made a game a little more easily playable. But on a whole, if you like Diner Dash or Cake Mania and think the Pixar movie looks like another winner, the Ratatouille mobile game might be for you.", "date": "Jun 29, 2007"}