{"name": "Ninja Gaiden Sigma", "name_review": "Ninja Gaiden Sigma Review", "ref": "https://www.ign.com/articles/2007/06/30/ninja-gaiden-sigma-review-2", "text": "Ninja Gaiden on the original Xbox was a landmark release for the system, partly for its lightning-quick gameplay and brutal difficulty, and partly because of its outstanding visual prowess. It's arguably the best-looking game to ever hit the system. As good as it was, the perfectionists over at Tecmo, and Tomonobu Itagaki in particular, decided to refine it even more with the release of Ninja Gaiden Black, an updated re-release of sorts that added the Mission mode and new enemies that upped the difficulty even higher.   Now the title gets its third release in Ninja Gaiden Sigma exclusively for the PlayStation 3. Sigma is essentially a remix of the original game and Black, offering up some of Black's additions like the Mission mode, while going back to the original's difficulty level (though it's still certainly not easy). There are also new enemies to be found, some new areas, various gameplay tweaks and, most notably, the ability to play as Rachel.    The end result is that Ninja Gaiden Sigma is, as expected, the best of the bunch and a fantastic title all around. It's somewhat amazing how well the core game holds up three years after its release and a generation later. Many of us around the IGN offices were massive fans of the original game, and our time with Sigma was easily just as much fun as we had three years ago. If you didn't like the original there won't be enough here to change your opinion, but fans of the game will find a ton of fond memories here.   The gameplay in Ninja Gaiden Sigma is extremely fast-paced, maybe even faster than the original release. It's very quick and requires a lot of dexterity to handle, and new players may find a bit of a learning to overcome as they get used to how to properly fight, but once you have it down you'll be lopping heads off left and right. Old timers who've beaten the old releases will find that much of the game feels easier this time around. But in large part it's simply because after you've worked through the game once, your skills have necessarily become so honed that the early (and seemingly difficult at first) stages are essentially a breeze.   As mentioned, the biggest addition in Sigma is the ability to play as Rachel, a Fiend Hunter who made various appearances in the first game, but only as a non-playable character. In Sigma, you're able to play her efforts as she heads off in search of demons to slay. These missions are a bit of a hit and miss. On the one hand, they help flesh out the story a little more in certain areas. Ninja Gaiden's story never made a ton of sense, but her sections help clarify a few events.   When it's ninja vs. ninja, always bet on the one in black. But while the story gets helped and any new content is welcome, she's not really all that much fun to play when compared to Ryu. She's a ~tank~ character, meaning that she's relatively slow but extremely powerful. Being that many of the enemies in the game are fast, it can be somewhat frustrating when needing to play a little more defensively than you're used to. Rather than jumping about and lunging at creatures, with Rachel you need to block a lot and wait for proper openings on pretty much everything you fight. She does have a nice evasion/counter move where you're able to flip over an enemy after blocking an attack and swipe at them from behind. It's so much more effective than directly attacking the quicker enemies that you practically need to abuse it, which makes some of her battles somewhat repetitive.   To be clear though, her sections are still reasonably fun, but they're just not as good as Ryu's. We were never frustrated by having to play through them, but we did wish we could get back to Ryu's sections simply because he's more fun to play. So in short, Rachel's sections are a decent addition, but they're not fantastic.    The ability to play as Rachel isn't the only new thing you'll find in the game. New enemies are scattered here and there, and a number of the returning characters have been given visual overhauls, not just with regards to texture resolution boosts but their overall design as well. Most of them fight the same, but some do look quite a bit different, and all of it's for the better. For instance, the black ninjas in Tairon look much more lethal now, as do the Vigoor soldiers. All of these updates have been applied fantastically.   There's also a new weapon in the game, or pair of weapons in fact. Dragon's Claw and Tiger's Fang is a dual-sword combo that you can find relatively early on in the game, and aside from being powerful they look awesome. Unlike most every other weapon in the game they act very similarly to the Dragon sword, so you don't have to trade functionality for coolness.    While much of Rachel's content takes place in the same areas that you'll also play through as Ryu, there are a couple new areas and scenes to be found. The earliest example of this is found in the second chapter where Ryu heads back to find his home village burning to the ground. This chapter used to end with a cutscene where Doku would make his first appearance, defeat Ryu and set up the revenge story for the rest of the game. Now, you're able to play through a new section where you enter a burning building and take out a number of enemies, and then exit to play the showdown with Doku. You aren't able to beat him, as otherwise the rest of the story wouldn't actually happen, but it's really cool that you get to partake in this battle now.   In addition to the new content, a number of subtle but great gameplay tweaks have been added. For instance, Ryu will now automatically climb up small ledges and boxes, meaning that you no longer need to jump over a small ledge and hope you don't over-jump the other side. This is especially helpful in a couple sections where items are located on small ledges and it could previously have been frustrating to fall off and start the climb over again.   A handful of other small adjustments have been made to help players in a number of ways. For instance, you no longer need to tap the jump button in order to run on water - Ryu will do this automatically as long as you don't stop. It's not as satisfying anymore, but some players never realized you could do this in the original. As well, Ayane throws more daggers with helpful notes your way, helping players figure out how to advance and such.   Ryu always makes an entrance. One thing that wasn't helped a ton is the somewhat confusing layout of some areas and a lack of direction on occasion. Tairon is still a maze, and towards the end of this chapter when you need to face off with a couple turrets before you leave, the only clue your given is to head over the nearby drawbridge and then you're left on your own to wonder until you happen upon your exit. Being that a couple progression points in the game require that you've learned to multi-wall-run (run along one wall, then jump and run along a second or third), if you've missed this clue and haven't learned that you can do it out on your own, you can get really stuck if you have no idea where to look to advance.   The camera is also unfortunately exactly as we remember it from Black. It's adjustable, but there are times when it will be pointing in less-than-ideal directions, and it can be hard to see what you want in tight quarters. In open areas, which thankfully encompass most of the game in some respect, it's not really a problem and the overall experience more than overshadows this fault.    One fault that we had with the original game that was greatly addressed here are the sections where you were required to fight a seemingly endless amount of enemies to advance. Areas like the Archives were especially bad about this, but they've luckily been removed from all required sections. There are sections where this will happen, but in each of these cases it's for some sort of bonus item. Unfortunately, you don't realize this until after you've spent all of your urns while fending off nearly 100 enemies, but at least they are optional, whether you know it or not.    The Mission mode from Black returns once you've beaten the game, as do interchangeable costumes and the ability to upload your high Karma score. Rachel gets her own set of missions this time around which is nice, though as mentioned previously, she's not as fun as Ryu. The Mission mode is locked prior to beating the game for a reason, however - it's extremely difficult and intended to truly test your abilities. If you want to practice for those, once you've beaten the game you'll also have access to a harder difficulty option, which is paramount to self-torture for all but the exceptionally talented players.   Visually, Ninja Gaiden Sigma is easily one of the cleanest-looking games we've seen this generation, with extremely sharp visuals all around. Texture resolution is great, character detail is fantastic and it runs at a blistering 60fps even at 1080p. The environments look good, though since most of the geometric content has been moved over from the Xbox title it's not mind-blowing in any way. The same holds true for the lighting. Characters feature self-shadowing, which while subtle does look nice, but the environments use the same lighting techniques as the previous iterations. There's a time or two in the game where Ryu's dynamic shadows get cast onto the ground where the shadow from a platform you're standing on isn't cast and makes things appear messed up, though you really need to look for these instances and you'll probably never really notice them during actual gameplay.   The foot is not mightier than the sword, but it's more demeaning. Though its core gameplay and content is more than three years old, Ninja Gaiden Sigma is just as fun as the original release. Many of the new content additions and tweaks have been added for the betterment of the experience, making this clearly the best of the bunch. The sections with Rachel are reasonable fun, though pale in comparison to what it's like to take Ryu on a decapitation world tour. If you didn't like the first two releases, there's not anything here that'll draw you in. But if you're a big fan of the original, it's worth your time and money to pick up Sigma as the game has never looked better or been so refined. And if you've never played Ninja Gaiden before, you should stand in line for this one.", "date": "Jun 30, 2007"}