{"name": "Cookie & Cream", "name_review": "Cookie & Cream Review", "ref": "https://www.ign.com/articles/2007/07/02/cookie-cream-review", "text": "Years ago it was an obscure little title on the PlayStation 2, and that status probably won't change on the Nintendo DS: From Software's unique Cookie & Cream game has made the leap from console to handheld. Much of the DS game, including the puzzles and boss battles, is derived from the original PlayStation 2 game, but with a touch-screen twist. The PlayStation 2 game's the better, more creative version, but the Nintendo DS isn't a slouch - it's still a surprisingly clever and fun game amidst a slightly sluggish pace.   Cookie & Cream on the DS, like the PlayStation 2 original, follows the exploits of two adorable bunny critters on a trek to save a missing moonor something. The plot doesn't really matter as it never really comes into play during any part of the game - all you really have to know and understand is that the game's going to be sugary sweet all the way to the core, and that bleeds into the different areas that you'll have to explore.    Explore might be a bit of an overstatement as the game's pretty straightforward in the direction you need to go. The challenge isn't the leaping from platform to platform - though that does get a little tricky since the perspective makes it a little tough to judge distance and height. No, the challenge is in figuring out the little switch puzzles that require using both screens at the same time. While the one bunny on the top screen's maneuvered using the D-pad, activated triggered puzzles must be manipulated on the bottom screen in some fashion. And they're not always obvious, which is where the game gets a little tricky.   For example, some puzzles might be a simple matter of turning a touch-screen wheel, which will rotate a platform within reach so the upper rabbit can make a safe leap across a gap. Or pulling an on-screen rope will tug a bad guy out of harm's way. Triggering a puzzle's easy because there are obvious buttons jutting from the ground. The ~solution~ to a puzzle isn't all that difficult either, since they're obviously tap, drag, or rotate controls. It's the results that aren't always that obvious - why are you cranking a wheel, or dragging gears, or pulling a rope? How will pulling this stuff off affect the environment up on the top screen? You'll also have to keep the upper bunny moving while you poke around on the lower screen - to keep things interesting, idle bunnies will be attacked by a tossed in enemy.   Obviously once you figure out the tricks the challenge is over. The first time through, though, the hunting and pecking at the environment puzzles means a longer time getting to the finish line and, ultimately, earning a lower score for the level. Of course, you've got the added element of a clock ticking away. The encouragement for multiple plays through is there because your times are being recorded and the fastest time gets displayed at the end of a level. There's also the added incentive of extra mini-games that are awarded after specific score milestones. These mini-games are derived from some of the puzzle challenges in the platformer, but they can get really tricky: in one, you have to play a ~Irritating Electric Stick~ type game where you'll maneuver a dot through a maze without touching the sides - the challenge is to get your dot onto trigger points to lower hazards while a marble rolls around on the upper screen. Very neat.   The game -- at least the Story Mode -- never really gets tremendously difficult but it can get a little frustrating in its design philosophy of not telling players what to doever. One boss battle was so confusing that it took just a bunch of poking around and stumbling upon the required task, and even when we managed to pull it off it was never really clear why that hurt him. Ah well. And we can't help but hate the inclusion of slide puzzles. Slide puzzles suck, especially when you have to solve them in mere seconds.      What's also cool is the multiplayer battle challenge where as many as four players compete through a series of mini-games, and this mode can be played either locally or over the Nintendo Wi-Fi Connection service for online play. It's no surprise that for this review we couldn't find a single person looking for a challenge over the internet - this is a very obscure, limited release game, and the online mode plays secondary to the single player Story Mode, so the chances for two people to randomly search for a battle are a little on the slim side. But at least you've got Friend Codes so you can play only those that you know. And if you ever want to play cooperatively, the game supports a local link where one player's the bottom (touch-screen puzzle) bunny, while the other does the platform hopping on the upper screen.Cookie and Cream on the Nintendo DS is what you'd get if you did a mash-up with Wario Ware and a platformer. Many games throw in those touch-screen mini-games in between the platforming action; Cookie and Cream does both simultaneously. It's not overly tough to blow through from start to finish, but there's a lot of payoff for doing it all multiple times. And the multiplayer support isn't half bad either. Just make sure you have the tolerance for slide puzzles and microphone blowing.", "date": "Jul 2, 2007"}