{"name": "Steel Horizon", "name_review": "Steel Horizon Review", "ref": "https://www.ign.com/articles/2007/07/02/steel-horizon-review-2", "text": "World War II is easily known as the most exploited game landscape around.  From real time strategy titles to countless first person shooters, players have gotten used to defeating Nazis in Europe on the air and on the ground.  Very few WWII titles have been released on consoles or handhelds that featured naval combat, which was also a key component of the conflict.  Konami's recent release of Steel Horizon attempts to address that, merging turn based strategy elements with real time battle sequences.  Unfortunately, Steel Horizon doesn't particularly handle either one of them well, resulting in an extremely messy game.   Players take on the role of a young naval captain during World War II that has high expectations heaped upon him.  As the son of a highly decorated officer, you find yourself placed at the helm of the Allies' most technologically advanced vessel.  Curiously, you dictate what this machine is from your choices of a Battleship, Submarine or a Destroyer.  Since your flagship can be upgraded over the course of your career based on how well you accomplish your tasks, wisely choosing which ship you want is important.  If your flagship is sunk, your career, and the game is over.  However, for some reason, you don't have any option to upgrade the other ships in your fleet, which leaves the other boats in your armada rather archaic and at times useless compared to your primary vessel.   Welcome to the battle scarred seas of Steel Horizon. This uselessness is exacerbated when you realize that at the start of every mission in the turn based phase of Steel Horizon, the game will frequently saddle you with a mix of boats that you won't particularly use or even need to accomplish your tasks.  There are thirteen separate kinds of ships that can be launched, which would give you some flexibility as to the boats you launch or the strategy you choose to employ.  However, you'll often involuntarily receive groups of cargo vessels, hospital boats or other non-combative ships at the start of a mission.  Unfortunately, you can't scuttle or decommission these fleets, so these often turn into floating gun fodder as you attempt to find out where the enemy is hiding across the map grid squares.  Since your fleets can only move a few squares per turn, the pace of the game moves at a snail's pace, slowly crawling along for every decision you make.  What's more, you'll find yourself coming to rely upon a core group of two to four different kinds of boats that you'll wind up building at captured shipyards and sending out to confront any Axis fleets.  It may sound somewhat limited, but since the AI of the game is pretty much brain dead, that isn't particularly that big a deal.   When it comes to battle, however, the game really gets derailed.  Instead of keeping the turn based setup, the game transitions over to real time button mashing, where you try to quickly maneuver your ships into position so you can hit the attack button and hopefully cause some damage.  Depending on the ship, you'll also be able to charge and trigger special attacks, like rapid fire cannons or dive bombing fighter pilots to attack the other fleet.  However, this quickly devolves into chaos, particularly when it comes to movement.  Players are automatically removed from the action on screen to consult a large plot of open water; all the while, your fleet is getting blasted to pieces because you're trying to turn the boat.  What's more, since you have to individually micromanage everything that's going on, you never really get a chance to set up tactics, so most of the time, you fire off attacks and special moves in a ~Spray and Pray~ method and hope that you manage to take down more of their boats first.   Unfortunately, this doesn't improve regardless of the mode that you select.  The 20 main missions that you engage in over the course of the campaign are painfully lacking in both departments, and after a few battles, the agony of the lack of tactics or strategy will quickly sink in.  While you may unlock some hidden side missions based on accomplishing different tasks, or potentially take on skirmish battles ~inspired~ by the campaign missions, you're still subjected to the same kind of plodding strategy and roll of the dice action for the rest of the game.  At least the versus mode is a bit more intriguing, because another player will give you more of a challenge and do strategic moves the AI never would.  However, after a few turns, you'll probably find you and your opponent becoming bored by the weak mechanics and you'll look to play another title via ad hoc.   Seriously -- the detail on this strategic map is stunning. Visually, Steel Horizon is a far cry from what the PSP can offer.  Blocky ship designs, bland map textures and extremely generic visual effects barely take advantage of the system.  The pixilated real time action is extremely confusing to follow, especially when you start changing from ship to ship to fire at some distant fleet.  If anything, the only serious attention was paid to the campaign character, which are illustrations of each officer as they discuss the missions.  The sound doesn't fare any better, with generic effects, no voice acting, and a continually repeated song that makes you immediately mute the title.It would've been nice to get a naval strategy game that actually required tactical maneuvers, strategic attacks and retreats, and naval cat and mouse games between the different ship classes that was similar to real life.  It would've also been nice to get an naval action game that made you feel like you were in control of a ship or a fleet taking on all comers with tight controls and excellent visuals.  Unfortunately, Steel Horizon is a little bit strategy and a little bit real time action, but not even close to enjoyable in either category.", "date": "Jul 2, 2007"}