{"name": "The Bigs", "name_review": "The Bigs Review", "ref": "https://www.ign.com/articles/2007/07/02/the-bigs-review-5", "text": "It can be a tricky thing to translate a simulation heavy sports game like baseball into an easily accessible arcade title.  If you go too far, you alienate the purists of the game, who don't necessarily want to play with rocket trails on balls or the almost cartoonish manner that playing offense and defense takes on.  On the other hand, if there isn't enough done, the game feels like a sim with a gratuitous visual or gameplay feature glommed onto it.  Blue Castle Games and 2K Sports have tried to strike this balance with their recent release of The Bigs, an arcade take on the traditional baseball title.  It's taken the field on the consoles, and it's also made the jump over to the PSP.  Can it send one out of the park, or should it go back to the minors?   The Bigs is different than other baseball titles because it focuses on incredible plays and pitcher/batter duels during every at bat. As a result, players get a sense during the game that just about anyone can (and often will) pull off an incredible defensive play when it's needed or spark a rally for their team by driving in runs.  A majority of this is tied to the game's implementation of the Turbo and Big Play meters.  Players boost their turbo by throwing strikes or taking balls at the plate.  Since you are free to use your turbo whenever you want during the five innings of a standard game, you can store it up until you really need a boost to get your club going on either side of the ball.   Turbo can help you send the ball out of the park. Turbo boosts a player's abilities, giving him the chance to pull off moves that are physically impossible.  Some of these stunts include supercharged throws that rocket a ball to a base, lightning fast sprints along basepaths and powered up swings that can soar over the walls or knock a fielder off their feet.  Even if you use turbo, you aren't guaranteed to get the result you want - a fielder with a good glove rating can still catch a turbocharged hit, for instance - but it can make every play much more exciting than the standard baseball game.  Besides, if you're looking for almost guaranteed success, you need to fill up the Big Play meter, situated right above the Turbo meter.  Just about any offensive or defensive play will provide points to your Big Play Meter, which can only be triggered when it's filled and glowing.  If you're batting, you can trigger the Big Play meter for a Big Blast, sending the ball screaming out of the park, while pitchers can trigger Big Heat, placing tighter breaks on any ball thrown towards the plate.   Just like the PS2 version, the PSP version of The Bigs has many of the same issues that the console games suffer from.  The AI for the computer can be unyielding, staging constant comebacks in games if you start to establish any kind of lead over it.  Fielders will still stand still for a second, which can hamper your chances to make a play for a fly ball or a line drive - that is, if they don't try to jump one way or the other for the ball.  Then again, fielding is somewhat complicated by the analog nub, which isn't as accurate as you might need it to be in some bang-bang plays.  As a result, you may accidentally put yourself out of position to make a play.  You will still find yourself throwing home more times than you want because the all-purpose button for dives and jumps is still tied to the X button, which will ruin your chances to turn double plays.  There seems to be a lag when you're building power for a pitch, which can often result in tipping your hand for the other player.  We went through a couple of games, and there appears to be a one or two second hitch every now and then, which doesn't start the power meter up.  As soon as you release the button, it builds, and you accidentally throw a ball or lazy strike that's easily hit.  Strangely, the PSP version of the game also has a heavy dose of slowdown during each game, from any pitch thrown to hitting and baserunning.  It's odd that the PSP version is the only version of the game that has this issue.  It doesn't make the game unplayable, but it does significantly affect the fast pace that the game is known for on the console.   Unfortunately, you've got a lot of slowdown to wade through in the PSP version. Players can hop into a quick Play Now session or an Exhibition game that offers more options, such as jerseys and difficulty levels, as well as inning lengths.  Players can also take advantage of the Home Run Derby that's present in The Bigs, smashing balls out of AT&T Park.  However, players won't be able to take advantage of the enjoyable (and destructive) Home Run Pinball mode that was featured within the PS3 and 360 versions of the game.  It's unfortunate, especially because it's an extremely fun game mode that can help you with your swing timing at the same time that it puts a non-traditional spin on a baseball mini-game.  Maybe the UMD couldn't render the damage and the elements of the mode itself, or perhaps it's the slowdown that plagues the standard gameplay that hampered the inclusion of the mode, but it's not available here.    Just like the other versions of the game, players won't experience a franchise or season mode for The Bigs, instead relying upon the Rookie Challenge to experience the action of the major leagues.  Players create their own slugger, taking them through the earlier action of spring training into the season and eventually into the World Series with your chosen team.  As the year progresses, you'll be tasked with various goals, such as getting a specific number of stolen bases or home runs with your rookie during a game.  You'll also need to boost your player's stats with training mini-games that put his fielding, batting and catching abilities to the test.  Like the other versions of the game, players still won't have any idea how their club is doing or their relation to the rest of the teams in their division.  Nor will there be an explanation as to why regulation nine inning games suddenly pop up in the playoffs.  You'll also find some pretty light customization options for creating your rookie.  When you combine that with the game slowdown, it hampers the amount of fun you might have with this mode.   The Rookie Challenge mode is fun, but has some of the same issues from the console version. Unfortunately, the online isn't as solid as the other versions of the game.  Since the game only supports Ad Hoc play, you don't have any leaderboards to tie into, downloadable rosters to update your build or friends lists to contact with other players (which would only be useful if the game supported infrastructure).  Players can still set up the number of innings that you'll play, but you'll find that you'll have just as slow a game experience via Ad Hoc play as you would during a single player game.  As a result, you're not really gaining anything different, outside of the fact that you'll be playing against a human.   Unlike the PS2 version of the game, The Bigs looks much better on the PSP, at least where player's faces are concerned.  Thanks to the LCD screen of the PSP, the characters stand out, even though the character models don't particularly look larger than normal.  That's unfortunate, since the action of the game is designed to turn these athletes into larger than life figures.  While the heightened aspects of the ballparks stand out, the backgrounds suffer from some muddy textures. Perhaps one of the worst elements comes with the triggered turbo and Big play moments, which colors the screen a shade of red and blue respectively.  It's not dramatic, nor does it wind up adding to the action on screen - it's just odd.  Combine that with the continual slowdown that plagues the game, and the presentation of the game is hampered.   The sound hits harder than the gameplay does in this version. The game is still solid in the sound department, however.  While Damon Bruce is the new guy on the block, he provides a decent job behind the mike, with a number of good comments.  He still winds up repeating a number of lines and he may miss a call here and there, but for the most part, he is a worthy successor to Miller and Morgan.  The wooshes of turbo-powered balls and the crack from bats sounds perfect, and the soundtrack is extremely solid.  Personally, you can't go wrong with Ace of Spades from Motorhead, but having Stone Temple Pilots and Primus amongst some of the artists is a great touch as well.It still doesnt have Season or Franchise modes, and the game mechanics are enjoyable, but the PSP version of the game is overshadowed by its issues.  The slowdown doesnt cripple the game, but it seriously hampers the fast paced action of the title.  However, it still captures the big play moments that The Bigs was designed around, which is cool.  If youre looking for an arcade twist on baseball, you might want to keep an eye out for The Bigs, just be prepared for some technical issues along the way.", "date": "Jul 2, 2007"}