{"name": "Bust-A-Move 4", "name_review": "Puzzle Bobble 4 (Import, Bust a Move 4)", "ref": "https://www.ign.com/articles/2000/04/18/puzzle-bobble-4-import-bust-a-move-4", "text": "I remember the first time I saw Puzzle Bobble (known as Bust a Move in America). I was hanging out at the mall, taking in some Virtua Fighter and Killer Instinct thrills with my high school buddies, when I saw this freaky little bubble-popping game running on the Neo-Geo machine. I desperately wanted to play it - but this long-haired freak in a denim jacket and Coke-bottle glasses was hogging it all for himself. I vowed to come back and partake of the game the next week.  The following Saturday, I returned to the arcade, and that dork was still there. I went to the food court, bought an eggroll from the Chinese food stand, and came back a half-hour later. Yep - the guy was still there. At this point I considered doing a spinning DDT on the helpless Puzzle Bobble addict from the top of the Tekken 2 machine, but decided to hold off. Sadly, the next week, the arcade manager had replaced Puzzle Bobble with The Super Spy. Damn.  Despite the fact that I'm old and senile now, I finally have Puzzle Bobble 4 spinning in my Dreamcast. And we're not talkin' about any Puzzle Bobble 4 here - after all, according to the box, this is ~the most beautiful Puzzle Bobble 4 ever.~ Oh, yes. It is truly a game to behold. Puzzle Bobble 4 is the story of Bob and Bub, two dinosaurs in the land of monsters. Using an odd contraption at the bottom of the screen, they must fire colored bubbles onto bubble clusters, placing three of the same color adjacent to each other. When this happens, the bubbles pop. Pop all of them, and you're on to the next stage - but don't take too long, or you'll be crushed by the clusters which are slowly falling from the ceiling. It's simple. Puzzle Bobble 4 adds some new gameplay twists into the mix, while maintaining the addictive fun of the first three games. The coolest improvement is the pulley system where you have to deal with up to four clusters, adding and popping bubbles while taking counter-weighting into effect. There are also rainbow bubbles that assume the color of adjacent bubbles, star bubbles that pop all of a certain color, and special rocks that can only be destroyed from above.  This game is positively loaded with gameplay modes and options. You can follow a series of branching puzzles in single-player puzzle mode, or go through a very silly plotline in story mode. There's also a ~collection~ option that lets you browse through 231 cleverly-designed puzzles, designed by hard-core Japanese fans. Want more? Then how about a devilishly difficult Challenge Mode - or perhaps you'd prefer Versus Mode against a second player or CPU? If that's still not enough, you can check out the Puzzle Edit Mode, and make your own mind-stumping puzzles for your friends to play.  When it comes to multiplayer, Puzzle Bobble 4 is as good as it gets. The bubbles you pop transfer to your opponent's pile, and each of the game's eight playable characters have special ~counter bubbles.~ Best of all, the reversal system allows you to snatch victory from the jaws of defeat in a fraction of a second - and just like the classic Super Puzzle Fighter II Turbo, it's anybody's game up until one player is severely trounced.  Graphically, Puzzle Bobble 4 shines. The art has been completely redrawn in high resolution - there's not a bit of chunky-looking 2D imagery here. The visuals are bright, colorful, and undeniably crisp - Bub, Bob, and the rest of the crew have never looked so good. Sound effects are just as crystal-clear, as are the delightfully indecipherable vocal taunts.  Complaints? There's no support for the analog pad, though squeezing the trigger buttons will nudge your bubble-launcher one degree to the right or left. To be honest, I can't think of anything else that I would have changed - and it's very rare that I can say that about a game.   Simply stated, Puzzle Bobble 4 is the best puzzle game to hit stands since Super Puzzle Fighter II Turbo. If an American publisher doesn't pick this one up for distribution at a competitive price-point, I'll be sorely disappointed - it took me over four hours to write this review, simply because I had to take a break every twenty minutes to play just a little bit more.  And in retrospect, I can finally see why that long-haired Puzzle Bobble freak would never leave the arcade. -- Colin ~This Story is Happy End!~ Williamson, IGN", "date": "Apr 18, 2000"}