{"name": "Smash Court Tennis 3", "name_review": "Smash Court Tennis 3 Review", "ref": "https://www.ign.com/articles/2007/07/05/smash-court-tennis-3-review-2", "text": "The great Stefan Edberg once said that many people think of tennis as a game of hitting, meaning that the player with superior strokes, skills, and overall tennis talent would rule the day each and every time out onto the court. Edberg, in all his great serve-and-volleying wisdom, instead said that tennis was a game of speed, a game of running and movement, and more importantly, footwork. Sadly, Mr. Edberg didn't have his hand in the development of Namco's latest tennis title, Smash Court Tennis 3, which has professional tennis players moving at a snail's pace. Even still, the tennis action is functional and reasonably fun, just so long as you aren't expecting the next installment of the fast and furious Virtua Tennis.    On its outermost layer, Smash Court Tennis 3 (SCT3 for short) has all the trimmings to be a solid tennis offering. There's an arcade mode where you can set up a sequence of matches between your favorite pro players, an exhibition mode for a one-time match up, and a challenge mode where you can play tennis variants like Pac-Man, Galaga, and Bomb tennis, all of which provide an excellent distraction when the sim action gets a little dull. The list is rounded out by an Ad Hoc multiplayer option, and Pro Tour, which is the focal point and real meat of the game.    Circle gets the square. As with any good career mode, things begin with you molding your own tennis pro. The customization options aren't exactly deep, but you should still be able to match up a few set pieces to form something that looks a bit like you, or at least one of your family members. After you've finished creating your prodigy, it's time to take to the court. Sadly, this is where things go slightly awry.   It's clear that Smash Court Tennis 3 is trying to deliver a simulation-based experience, at least when compared to Virtua Tennis, which features pro players diving across the baseline - something that never happens in the real thing - and having endless rallies with no errors in sight. SCT3 on the other hand brings much slower, more methodical action. Players slowly maneuver around the court, carrying what feels like too much momentum, thus making them slightly unwieldy at times. This does improve as you enhance your star's parameters (attributes) and skills, but still doesn't feel anywhere close to the real thing. A tennis player ranked in the top 300 in the world - the initial ranking in SCT3 - flies around the court, but not here in the Smash Court world. Now, I understand that there has to be some kind of progression and disparity between the movement of a number one player and the 300th ranked player in the world, but it's nauseating watching the way you'll lumber around the court when you first start out.    If there's no grass on the field, play on the clay. The same goes for hitting power and precision which is totally confined to the center part of the court, even when you strike up an exhibition match between Federer and David Nalbandian. Roger Federer can put the ball anywhere on the court in reality, but none of that translates into the game. Now I'm not saying that you'll be lobbing the ball down the center through your whole career in Pro Tour mode, but it takes a very long time until you can concoct anything that looks like actual tennis. When that match finally does come, it is rewarding, even if your player does feel a bit heavy when sprinting around the court.   Being that the gameplay is more simulation than arcade, you might be wondering where the smashing comes in during Smash Court Tennis 3. Essentially the only time you'll get to smash the ball (read: perform an overhead) is when you're playing the net. So, like many other tennis titles, players are urged to rush the net as much as possible, taking some attention off of the ground-stroking portion of tennis. It's odd because today's game is played largely from the baseline, but videogame tennis continues to paint the net as the most advantageous position. While it is true that coming to net is the quickest way to put your opponent away, it would be nice if some ~smashing~ could be done from the baseline.    Off the court in the Pro Tour mode you'll be able to check out your schedule and either do several different training events, sign a new sponsorship contract, or enter into one of three types of tournaments (your ranking determines what tournaments are available). The training activities prove themselves to be fairly obsolete in the long run when compared to tournament play. See, you pump up your player's attributes by attaining experience points, which then levels you up after each tournament or training session. It would stand to reason that practicing your ground strokes would enhance your forehand and backhand, but instead the game simply assigns generic experience points for you to hand out however you see fit.    The only problem is that training sessions never earn you as many experience points as winning a tournament, so unless you happen to be too low of a rank to compete in a tournament for that given week, you'll want to spend most of your time working through the bracket of a tourney.   Great balls of tennis balls! Visually the title is acceptable, but isn't yet on the same playing field as Virtua Tennis as far as tennis on the PSP goes. Players come through very pixelated, with little detail anywhere on the model. The courts and environments don't fair much better, with clay courts that look nothing like the real thing. There's a weird graphical oddity that pops up whenever you serve up an ace, or smash a ball to end a point. During the instant replay of your shot you'll notice that the landing pad for your winner is nothing more than a white, texture-less square.   Aurally the game doesn't deliver the highest of production values. The same techno funk track blares during every replay, and will surely get old during your first match. The sound of striking the ball comes through with a decent level of authenticity, but that isn't exactly difficult to emulate. Aside from some mediocre menu tracks, the sound department is pretty empty.Smash Court Tennis is one of the few tennis series to try and take the sport seriously, but it falls a little flat in terms of overall excitement. Some developer needs to establish a medium between over-the-top, arcade action and a simulation of real tennis. Smash Court Tennis does a good job of building a functional career mode with sponsors, fan letters, challenges on the court, and an experience point system that allows you to mold your own style of player. Its just too bad that the actual tennis cant keep up the same level of quality.", "date": "Jul 5, 2007"}