{"name": "Harry Potter and the Order of the Phoenix", "name_review": "Harry Potter and the Order of the Phoenix Review", "ref": "https://www.ign.com/articles/2007/07/05/harry-potter-and-the-order-of-the-phoenix-review-8", "text": "The Gryffindor gang's all back in their latest handheld outing, and this time EA has cooked up an (almost) 3D adventure that strays from the series' pixel art roots in an attempt to match the atmosphere and visual style of the console games. Unfortunately, the team was so preoccupied with fleshing out Hogwarts and the other locations of the film that they lost sight of a focused, consistently enjoyable game. Harry Potter and the Order of the Phoenix throws everything and the kitchen sink into one DS game, but it's very hit and miss in terms of visuals, gameplay and enjoyability.    In his fifth year of wizardry education, Harry must balance school, his first girlfriend and the return of Lord Voldemort. Unfortunately, not much of this really comes across in the game. Harry spends the majority of his time in game doing menial chores over and over for his fellow students. Harry, fix these vases! Harry, find my package! Harry, grow these plants! It all feels incredibly narrow and the major plot points of the film and book get lost in the midst of all Potter's constant chores. Cinematics aren't helped by their poor visual presentation either, with soulless renders of high poly Potter characters flapping their lips in Muppet fashion and staring (and occasionally blinking) blankly whenever their text isn't scrolling by. Confusingly, the twins (Ronald's older brothers) share the same portrait, which doesn't move in between lines of dialogue. The result is one character that appears to be constantly repeating himself.    Most of the menus are functional but incredibly plain. The text in this game, particularly in the cinematics is almost entirely illegible, a blurry, fancy script with hard edges against the background. The story is dull enough though (and again, so chore-oriented), that most players will stop reading and start button mashing through all cinematics after the first few. The game concludes with a battle between Harry and you-know-who, but everything before then is dull and slow going.    The in-game graphics are pretty disappointing, too. The game takes the classic Resident Evil approach with 3D polygonal characters displayed over 2D backgrounds. This should have made for a pretty gorgeous DS game. The 2D background images, however, are washed out, lacking in detail and heavily compressed. Ugly color blocking and general sloppiness can be seen in every shot. The top screen is usually used as an extension of the bottom screen, even though the characters can't go up there, which makes for a lot of pointless attic and roof shots. The 3D characters and objects are surprisingly low in polycount and detail, even with only a handful of characters onscreen at once. Foreground elements overlap Harry to better immerse the player in the scene, however there are plenty of locations where the art doesn't match up with the collisions, allowing Harry to walk into walls and on air.    The 3D characters scale and rotate in relation to the camera each time a new camera angle is reached. Visually this looks dynamic, but the inconsistent location of Harry from shot to shot occasionally causes the player to get caught ping-ponging between two screens. The developers took a Devil May Cry approach to Harry's controls, meaning that as long as the player continues holding the D-pad down during a transition between two camera angles, his direction of movement will carry over. The problem is that Devil May Cry featured analog stick control while this game is limited to the 8 directions of the d-pad, requiring the player to constantly wiggle Harry back and forth to travel down corridors that don't line up with those 8 directions.    Hermione and Ronald, along with occasional other students follow Harry around for much of his travels, and there doesn't seem to be much of a reason for this other than getting in the player's way. NPC characters in this game have collision against Harry and lousy pathfinding AI, so as Harry makes his way across school, players can expect to occasionally get stuck against their friends and have to wiggle their way to freedom.    Speaking of traveling around school, boy is there a helluva lot of that in this game! One of the game's major faults is that the developers have accurately recreated practically every corner, staircase and hallway of Hogwarts in this game. The problem is the game is 100% linear, and NPCs usually only inhabit the lounge area Harry is returned to after each chore. So the player will run Harry around for 2 to 3 minutes to finally reach a minigame that only takes 30 seconds to complete. There was absolutely no effort made to place chore locations next to one another, so players should get used to running all the way across school on one errand, then all the way back for the next one. It's an ambitious idea, to include such a complete school layout as this, but when 90% of the rooms are barren of any life or objects to interact with, what's the point?      During Harry's travels, a 3D finger at the bottom of the screen always points toward his immediate goal. It's nowhere near as useful as the directional arrows in games like Crazy Taxi, though. The rooms are usually so small that every few seconds that players can expect constant disorientation because of all the camera shifts; when hitting some corners, Harry will literally take one step in a camera view before being switched to another. Another issue is that the finger always points Harry in the immediate direction he needs to go, rather than toward his goal. So if Harry walks into a corner, the finger will whip around to point him back out of the corner before returning its pointing to the actual room exit. This sounds like a small issue but in practice, it makes the finger arrow unintelligible about half the time. The finger is also a pure white 3D object, so telling where the finger is even pointing can be difficult. In short, navigation and mobility in this game is so atrocious, it's difficult to play through all this to reach the minigames.    Fortunately, to the game's credit the minigames are fun and plentiful. Although they're a little hit and miss in terms of graphics, they make up one of the best touch minigame collections on the DS. Every time Harry reaches an NPC student, teacher or other objective, the player will be asked to perform a touch-based minigame, often revolving around casting magic with his wand. This is done by drawing a summon shape with the stylus, then tapping a variety of floating orbs in order to cast. It sounds dull, but so does Elite Beat Agents when you break down the mechanics of it. Casting recognition is perfect in this game (I never once had the game confused due to sloppy input), and each of these touch modes is peppered with lots of visual effects and flair that really sell the magical aspects of it.    Minigames involve grabbing frogs, rolling marble-like stones, repairing fragile objects, cooking potions ala Cooking Mama and dozens of other activities that are all pretty varied and enjoyable. A few of the minigames even use the DS microphone. Each time a minigame is played through, the player is ranked as to how well they did, although it's a little easy to ace through all of them. Once they are beaten, minigames appear in the minigame menu and can be replayed later for fun by one or more players. Each game has increasing levels of difficulty, and should take some time to play through all of them with the highest rating.    One of the more frequent minigames is a spell-casting battle, which usually occurs between Potter and Malfoy, along with whatever doofuses he has standing around. This is played through traditional turn-based RPG mechanics, with the young wizards-to-be taking turns knocking each other around with force-based spells. Each time a spell is selected, and a target named, the player must track the stylus between a dozen or so red orbs in a short amount of time to successfully cast their attack. If this is done correctly, the enemy takes a hit and then he (or one of his allies) attacks someone on Team Potter. As the main game is progressed through, players can spend earned points on beefing up their RPG stats, which make future encounters easier to overcome. It's not an incredibly balanced RPG game (as long as the player doesn't botch a turn, a win is practically guaranteed), but it's deeper than one might expect in a game as already full as this one.    Quidditch of course makes a return, but it's a pretty weak one this time. Functionally very similar to old school basketball games like Double Dribble, the game involves passing the ball between players, flying over to the rings and sinking it. The AI here is pretty dumb and (just like those old basketball games) easy to steal from. The player can also use a special shot by pressing the L and A buttons; the problem with this is that it results in a goal just about 100% of the time, even when shot from across the field. So winning the game really just amounts to getting the ball, launching a super shot from anywhere on the field, stealing the ball from the opponents and repeating until the game is over.    Music and sound effects are pretty decent, and capture the magical atmosphere of the films. But, like a lot of licensed DS games, the tunes tend to repeat far too often and some of the musical loops are only a few seconds in length.    The game is about average length for a licensed DS game - it's not short, but it can be beaten in a single afternoon of playing. The developers have incorporated a percentage system, and it's possible to beat the game with well under 50% of the game completed. The remaining percentage can be accomplished by finding every object and playing every minigame through all difficulty levels, achieving an Outstanding rank on each. This adds length to the game, although it depends on the gamer how fun replaying the same minigame over and over to achieve a top rank actually is. It's surprising just how anti-climactically the game ends, however; as soon as Harry has his final showdown, the player is dumped back into school but Hermione and Ronald, who triggered all the main missions in the game, are conspicuously absent. The player is left in this big, empty world to track down the remaining objects and challenges, with little guidance in order to have a shot at a 100% achievement ranking, which doesn't yield much more than some production stills of the cast and crew onset of the new film anyway. Still, it's all there for completists.    The developers cover their butts pretty well in regard to multiplayer options. The game offers several of the minigame activities in multi-card multiplayer modes, single-cart multiplayer and even DS download to give a sample of the game to a friend with an empty DS. There's no WiFi, but since the nature of these games is more turn-based single-player anyway, it's not that missed.This game is a real mixed bag. The minigames are fun and make fantastic use of the DS touch screen in different and interesting ways. At the same time actually reaching the games is frustrating and boring, and the story is handled so poorly that even playing through the game I didnt get much of an idea what the film will be all about. RPG casting is okay, but Quidditch is definitely a step back from some of the previous games. As a Potter game, Order of the Phoenix falls flat. But as another collection of themed touch minigames, theres something here that might be worth checking out.", "date": "Jul 5, 2007"}