{"name": "Eagle One: Harrier Attack", "name_review": "Eagle One: Harrier Attack", "ref": "https://www.ign.com/articles/2000/04/19/eagle-one-harrier-attack", "text": "You Wall Eyes and Aviophobes who are too gutless to check in to real flight sims on PCs are settling for much, much less on these ankle-wading console jets. Eagle One is one of those shallow skimmers. Not a bad game, not at all -- in fact, the mission structure is worthy of a medal, and the action gets heavy when the flak flies. But it tries pussyfooting the line between sim and action game, never really gunning either way.   Gameplay Marauders from some neo-facist political faction have invaded and occupied the Hawaiian Islands, and it's up to the American government to bail out our Kahuna buds. This is a job for the Army, Navy, Air Force, and Marines... Unfortunately, all we've got is you, Eagle One Pilot.  Already, we're beginning to see a problem. Why is an invasion of the United States, not perpetrated since Japan's Pearl Harbor attack in 1941, answered with the deployment of a single fighter? Thankfully, the US military is not in the hands of arcade game designers, because it is this kind of nearsighted plotting that should have been left long behind now that we have team games like Rainbow Six.  So fine, it's not as good as a PC flight sim. I don't even like PC games, so if I want to dabble with a flight sim, would this game work for me? Yep, then nope, and probably not, and in that order. It's a good console flight sim, but not a great one, and generally it doesn't have the excitement you're looking for.  Eagle One has a remarkable mission system, taking pilots deeper into occupied territory as players work to free the islands. Missions typically course from search and rescue missions to bombing runs, but nothing is as simple as it looks, and once your bird is airborne, anything can happen. Night rescue missions suddenly turn from stealth into front-on combat as the rescued POW escapes in a Jeep and requires back-up as it cuts towards safe harbor. Other missions shift and shift back viciously as sudden crisis arrive. And if hope finally fails, bring in a partner for two-player cooperative warfare in five separate missions.  This kind of technical performance demands solid controls, but here Eagle One meets the need only halfway. The basis of the game is the Eagle One Harrier Jumpjet Plane, America's premier VTOL fighter. For some reason, some missions ask for you to trade in your Harrier for a lesser aircraft, (including a Huey chopper and an A10 Warthog) which takes away some of the focus of the game (did they just randomly name it Eagle One Harrier Attack?), and it seems that the control of the Harrier has been slighted by that.   Of course, the unique properties of the Harrier Jumpjet (with its pivoting jet engines that allow it to operate like a jet or a sort of helicopter) give the control a lot of latitude. The plane can zoom across the sea floor, then transform for surgical aerial attack. Glass Ghost has replicated the Harrier for the PlayStation in many cases (including the VIFFing concept, which is basically strafing and lateral movement in Hover mode), but the handling seems artificial. Instead of controlling the jets, you control the entire craft, leaving pilots with a useless yoke when it matters most. The jet has artificial handling of latitude, where players simply tap the triangle button to jet up and square to drop some -- this fake control means that players cannot handle their jets like helicopters, nosing the jet some and using the jets in a half horizontal / half vertical position to propel the craft forwards in the air. So instead, this game consists mostly of using Jet mode to get where you're going, then shifting into Hover and shooting from a near-stationary position (leaving you a sitting duck unless the outer defenses are swept up before you begin your main mission.)  Graphics Underperforming where it counts, the graphics in Eagle One are good but dated. Excellent cityscapes and land graphics (chunky ground textures, but the island spreads out for miles) and distinct enemies are good, and the explosions are solid. The engine runs clean and the game looks great from afar. Particularly when you're buzzing a cityscape, the game looks great.  Of course, it zooms by at three or four miles an hour, but it looks good. That missing sensation of speed, however, makes this arcade / sim hybrid really neither. Against Ace Combat or other console sims, which generally go for the bombastic action and delirious pacing against all odds, this game is slower without being more precise in the downshift. You can literally watch F-16s stroll by your still-standing hover jet.  Also, the sense of scale feels forced and wrong. For one, Hawaii is sparsely populated in this game, making for some dull exploring. Buildings are as tall as tanks, and flying through the pea-sized hotels and military installations just isn't very exciting. This wouldn't have been a huge oversight if Namco hadn't proved it could be done with their Ace Combat series.  Sound As is becoming the trend with PlayStation sound design, the audio quality is high, but the mixing is non-existent. It's almost like only two sound channels are being used here. Voiceovers occasionally overlap action sequences and get drown out in the chaos (which may be semi-realistic, but imagine Top Gun without all the radio chatter and you'll see how boring this game is when the audio fails). Other times there is no ambiance or white noise behind the voice, which makes it sound like they are in the same room as you rather than knee-deep in a war.Had this game fully utilized the Dual Shock controller in new ways or just simply concentrated on sim controls of a Harrier Jet, it would have had a lot of value. However, even though the game's missions are varied and immediately exciting, the game gets to be either frustrating or bland in execution, without that feeling of accomplishment in mastering sim controls that comes with more complex games.", "date": "Apr 19, 2000"}