{"name": "Brain Age 2", "name_review": "More Brain Training AU Review", "ref": "https://www.ign.com/articles/2007/07/06/more-brain-training-au-review", "text": "Like the gaming equivalent of a nootropic shake, Brain Training is back to once again bring hope to the masses; to give all and sundry a glimpse at an easy and fun way to potentially limber up those neural pathways and increase your killing power. Sorry, thinking power. And of course, that zany devil Dr Kawashima is back too, playing a digital Anthony Robbins to our brain-befuddled masses. Whether you think the Brain Training games work or not, it's hard not to love ol' Dr K. He's the Chairman Kaga of Gaming Stadium only without the capsicum-biting antics or gaudy jackets. Still, what understated charisma! What, erm, chubby, pinch-able cheeks. And what eyes - a fella could get lost in them.    Okay, so he's not exactly the most interesting mascot the games industry has ever seen, but at least Dr Kawashima doesn't conform to the Western model of motivational coach. He isn't loud and extroverted, nor does he try and sell us the concept that we can improve our brain power by watching TV and scratching our crotchal regions (send me $20 to find out how!). Nope, he's ever-so-Japanese, and frankly, that's the way we'd prefer it. Like the previous game, the rest of the package is understated as well, preferring to lure you in with well-designed play and the drive to better your scores than with flashy gimmicks.   For arguments sake, let's say you didn't play the original title. (Those who did may kindly direct their attention to the next paragraph. Or rewrite this one in their head). What's it all about? Well, obviously the basic goal is baked right into the title, with a host of mental drills on offer, each designed to tweak one aspect or another of your brain tank's acuity. The idea is to hop into the game each day to do a handful of individual drills, then find out what your brain age is via a sequence of three tests. Keep coming back regularly and you can follow your progress via graphs for each test, and hopefully get to the point where you're routinely sitting on a brain age of 20 (the best possible age rating), with a plane or rocket rating on each of the drills (your skill at a particular test is ranked on a scale from walking man through to car, train and eventually rocket - obviously the faster the transport the better).    Good old rock, nothing beats that!  More Brain Training does not stray from this formula. In fact, its presentation is almost identical. No matter though because it's packing an all new suite of drills to master, secrets to discover and advice from Dr K to ponder upon, and we're hooked all over again. The selection is excellent, representing a more interesting blend of drills that will test you in ways that the original didn't. There's Rock, Paper, Scissors, where you must say the correct answer out loud, depending on whether the game tells you to win or lose. There's Word Scramble, which is basically an anagramming game - form longer and longer words out of a jumble of moving letters. And perhaps most fun of all is a rhythm action-esque drill called Masterpiece Recital where you follow sheet music and tap in the notes in time on the touch-screen keyboard. There are plenty of maths staples too - Missing Symbols is a good tweak on Calculations X20/X100 from the original, Memory Addition juggles simple addition and memory testing, and Correct Change manages to make both mathematics and working at McDonalds seem like fun. (Warning, working at McDonald's is not actually fun). And yes, you can track your progress via very bare-bones graphs - although once again it would have been cool if Nintendo had included a few more options, such as being able to see more than two months worth of results at a time.   Then there are a whole host of exercises that Dr K hits you with as you tap through to training each day. Unlike the last game, which often asked you questions - like what you ate for breakfast (invariably, coffee) - so it could quiz you on it a week later, or asked you to draw something from memory (note to self - stick to writing), More Brain Training is more eclectic and interesting, such as coming up with acrostics (turning a word into an acronym describing the word) or being given a field of dots from which to make a picture. And title it. Ah, ~Ugly Kid~, you're my finest creation.   And let's not forget Dr K's regular pieces of advice, such as ~Be on the lookout for things that make you laugh. If you see nothing worth laughing at, pretend you see it, then laugh.~ Hang on, no, that's the Little Book of Calm. Oh well, rest assured Dr K has plenty more tidbits on improving your mind. And the more times you come back to the game, the more you unlock - new drills, secret options, even a rather dull Dr Mario clone.   Ten bucks says you ignore the game and work out how to play 'Axel F' instead.  Elsewhere on the cart you'll find a quick-play option, for when a friend wants to bust out some hot maths action and you don't want to jeopardise your precious scores. You'll find 100 new Sudoku puzzles - which is practically a full game in itself (although we're still stuck in Picross DS territory these days - next stop Slitherlink), as well as the option for single cart multiplayer brain training. Plus you can have up to four save games on the one cartridge, allowing you to compare your results with other family members or friends.   So, what's not to like? Well, it can take a while to adjust your writing to ensure the game registers it correctly, but that's fair enough. More annoying is the amount of repetition in Dr K's general comments. Why not spice it up a bit? Especially since it makes no sense to tell the player that: ~You seem to be maintaining your status quo. Well, that's not so bad~ even if that 'status quo' is consistently hitting a super-fast time. Oh, and no, it's not getting hot at the moment - there are gamers in the Southern hemisphere you know. The ratings feel a little random at times too, but then, the game is more about beating your top score than lamenting the fact that you're still putting along in a car in one of the drills. And finally, there's no question that, while this game definitely appeals to both gamers and casual players alike - it ain't for everyone. This really is doing maths for fun (yipee!), yet somehow it's still compelling. Quaint-compelling, not adrenaline-rush-compelling, but there's definitely room for both in my collection. Like the original, More Brain Training makes for a good bite-sized distraction each day, whether youre playing it for fun or as a desperate measure to try and recoup some mental clarity after years of abuse (you know what Im talking about guys  those all-night Scrabble tournaments and wild Claytons drinking sessions eventually catch up with you). As a sequel More Brain Training doesnt stray too far from the template of the original, but the new selection of drills are more interesting and represent a more varied challenge than those of Dr Ks first outing, so this is both a welcome return for fans of the original, and a good starting point for newcomers. Besides, who wouldnt love a game starring the Richard Simmons of mental callisthenics?", "date": "Jul 6, 2007"}