{"name": "Anno 1701", "name_review": "ANNO 1701: Dawn of Discovery UK Review", "ref": "https://www.ign.com/articles/2007/07/06/anno-1701-dawn-of-discovery-uk-review", "text": "It's chaos in our town. Peasants are revolting because they haven't got enough fish. Burglars are on the loose. A fire's broken out and it's spreading like, well, wild fire. Disease is seeping through the streets quicker than the plague and a nearby volcano is looking more than a bit moody. While all this is going on though, what are the aristocrats complaining about? ~Oooh, we haven't got enough chocolate, Mr. Mayor.~ Chocolate?! Just be happy you're not riddled with bubons and burglars aren't pinching your jewels.   You see, being a mayor in the world of ANNO 1701: Dawn of Discovery isn't easy. Or rather, it starts out easy as your population of gurning simpletons merely demand fish, wool and a roof over their heads. But, as they inevitably stride towards civilised life, their demands quickly ramp up until they're asking for fine jewellery, beautiful cotton clothes and confectionary. The problem is that, as mayor, you've got to juggle your economy, supplies and town planning to meet all these demands, otherwise you could have trouble on your hands.   You've got to colonise new islands to grow exotic crops, like spice and cotton.  Some might already be familiar with this from the three ANNO titles already available on PC. They might also be sceptical that Dawn of Discovery is just another straight PC to DS conversion, rather like Sim City DS or Theme Park, cramming mouse/keyboard controls into the dual-screened handheld with little thought to whether the interface actually works. That's definitely not the case here though and developer Keen has created intuitive controls ensuring no action requires more than a few taps of the stylus. From laying down roads to raising taxes or building towering cathedrals, it's all an extremely easy process. Which ensures ANNO is perfectly suited to DS, rather than a PC title that's had a stylus rammed forcibly up its backside.   What's beautiful about the interface is that Keen has kept it simple. The side of the screen permanently displays icons for building, town information, taxes and so on. It's not at all obtrusive and there's still plenty of room on-screen to show your town. It's just a matter of tapping an icon to bring up a selection of logically organised, pictorially-represented sub-commands whenever necessary. Meanwhile, the top screen shows more general information about your economy and supplies and an advisor keeps you abreast of important events, keeping the clutter to an absolute minimum.   This is absolutely crucial as managing the demands of your townsfolk is an in-depth business. As a budding explorer-cum-mayor, you're tasked with setting out to sea, establishing new colonies and settlements - the latter taking up the bulk of the single-player Story Mode. Each settlement starts off extremely simply with just a few houses, a goods warehouse, a lumberjack and some sheep for wool. However, as your residents develop from a rowdy rabble into a civilised gathering, they start to require more refined utilities, including bathhouses, schools and churches. This necessitates collecting more building materials from around the island, including stone and coal. If you meet the requirements of townsfolk, they change from peasants to merchants and eventually become aristocrats, which also means more taxes and better buildings for you. Ka-ching!   The stylus controls are excellent and building towns is very simple.  Rather like piecing together an IKEA wardrobe, building towns in ANNO is a rewarding but challenging experience. Watching the buildings of your residents evolve from mere shacks to castles, as the inhabitants rise through the ranks, is a beautiful sight. Plus, carefully planning out your sprawling town is all-consuming. Even small aspects like making sure your townsfolk are within the area of influence of a particular structure (churches, schools and the like) requires plenty of forethought, with residents needing these structures to evolve from simple twits. Likewise, making sure chocolate makers or jewellers have the necessary utilities - indicated on the top screen when building - is a compelling experience because you want residents to have the best of the best - even if they are a bunch of moaners.     However, while every new structure - whether a theatre or academy for soldiers - brings its own aesthetic joy, some are sadly lacking in terms of genuine value. For instance, emergency services - that is the fire station, jail and hospital - are a bit useless. Although townsfolk do become ill or have their possessions burgled, it's only their actual home that's affected. Thus, a much simpler solution to a burgling spree or raging inferno is to knock the troublesome house down. You can then plonk another one in the same spot and it's almost as if the peril never happened.   There's another downside to building towns too: although you can zoom the isometric view in and out, you're always restricted to the same camera angle. As your buildings become taller, it's harder to see smaller structures, including all-important schools and churches, behind them - which is problematic for obvious reasons.    Filthy pirates are always trying to pinch diamonds to buy parrots and patches.  As well as creating towns, you're also tasked with building ships to scout out new islands to settle on. Although this isn't important at first, in order to meet the requirements of civilised residents it becomes essential. You see, most islands have basic resources, including stone or wood. However, to uncover diamond mines or to find soil that's fertile for spices you've got to uncover new islands. Thankfully, it's a simple process with the top screen displaying what crops can be grown and mountains showing whether they contain coal or diamonds, when an island is selected. Once you're happy with your new island, you build a new warehouse and any resources are supplied back to your main settlement. This means you can quickly build an empire that spans across the ocean.   However, although all this exploration is exciting at first, it's not without its problems. You see, rather like other economic management titles such as Theme Park, ANNO suffers from a lot of repetition, particularly in the Story Mode. As you complete chapters you're required to start up new settlements, meaning 'levelling-up' your citizens and building the same structures over and over again.   Thankfully, this isn't such a problem in the Continuous Play mode. Here, you can concentrate on building an epic civilisation without worrying about it being destroyed at the next chapter - because there aren't any. In fact, we'd go as far to say that Continuous Play is more entertaining than Story Mode, simply because you can take your time planning towns, rather than racing towards the next objective.   Proper planning of colonies is vital for expansion.  Continuous Play also provides an opportunity to concentrate more on the simple but enjoyable military aspect of ANNO. After building a barracks and a warship, you send soldiers out to conquer the territory of other explorers. There's nothing more rewarding than creating a fleet of ships, arming them to the crow's nest with soldiers then sending them out to wreak havoc. Conquering islands is done by setting up an offshore outpost then sending soldiers out to destroy an opponent's warehouses. If you destroy all the warehouses the island is yours and you can continue in your quest for global domination - and that's ultimately what ANNO is all about. If you fancy dominating some friends you can also sample ANNO's four-player multiplayer. Taking its queue from Continuous Play, the multiplayer sees you setting goals - including most amount of gold or number of residents - before taking to the high seas to claim victory. It's a worthy addition to the ANNO package, with the only let down being that you need multiple copies of the game.For our money, ANNO 1701 is the best management sim so far for DS. Building a town from scratch is a rich, rewarding experience that grows with each new structure uncovered or mysterious island discovered. Whats more, thanks to its beautifully implemented interface, its especially well-suited to quick on-the-move game sessions. While Story Mode suffers from too much repetition and the isometric viewpoint causes a few town planning issues, Dawn of Discovery still manages to be an engaging, engrossing endeavour.", "date": "Jul 6, 2007"}