{"name": "2D Brick Breaker Revolution", "name_review": "Brick Breaker Revolution Review", "ref": "https://www.ign.com/articles/2007/07/07/brick-breaker-revolution-review", "text": "Digital Chocolate made its reputation by producing wildly original and clever mobile games such as Tower Bloxx and Tornado Mania, leaving other publishers to duke it out over accepted staples like card games. But doing so has certainly left money on the table and so Digital Chocolate has begun a campaign to claim market share in popular categories, starting with Absolute Minesweeper and continuing with the casual gaming suite, Cafe. But now the firm has the ~Breakout~ genre in its crosshairs.   At first blush, Brick Breaker Revolution looks like a very stylish take on the genre, currently dominated by Gameloft's aging -- but still quite playable -- Block Breaker Deluxe. But one very simple design decision elevates DChoc's effort above your basic Breakout/Arkanoid clone: Each stage has a key block that, when smashed, unlocks the top and bottom of the screen. Using the key blocks, you can move up and down the tower of screens, working your way toward a boss monster that lurks at the top of every sequence of brick-filled screens.   Fluidly moving up and down the tower becomes an essential strategy in Brick Breaker Revolution. You can avoid the key block as long as possible so you don't advance up the tower by accident, allowing you to clear a screen and earn extra bonus points. However, hitting that block gives you something of a safety net once you are on the ~second floor~ of a tower. Should you miss the ball with your paddle, it simply drops back down to the screen below.   At the top of each sequence of screens, you square off against a boss monster composed of moving bricks. There's a snake that slithers around the screen, a Space Invaders-eqsue alien, and a moving armada of smaller bricks. Beat the boss and you complete the stage, watching your smashed bricks fill in a recognizable landmark before moving on to the next round.   Brick Breaker Revolution comes packing heat. The game is loaded with power-ups that can both bolster and hinder your block-clearing efforts. The weapons are almost universally worth getting greedy over; I lost many a ball lunging for a grenade when I had no business doing so. The useful grenade power-up swirls around your ball. You plant it by hitting 5 when near some bricks and, after a few seconds, it explodes. (This is extremely useful against the boss snake.) The nuke wipes the screen clean, awarding mega bonus points. The laser fires a beam across the height of the screen, singing any bricks in its path after just a moment; if you just swipe it across the screen, you're destroy few bricks. The unstoppable power-up turns the ball into a fireball, blasting through bricks without any ricochet action.   Other power-ups include a magnet that grabs the ball, ball control that lets you nudge the trajectory, and a size increase for the paddle. Naturally, there are things you want to avoid, such as a speed boost on the ball that makes thing a little hairy and the mirror that reverses controls.   Brick Breaker Revolution sports fantastic balance. None of the weapons are so stupidly powerful or so plentiful that the game is a push over. The ball speed is just right. The brick layouts are clever and daunting. And the game has several game modes for increased value, such as a non-story endless mode and time attack.   As mentioned in my preview, Brick Breaker Revolution features an entirely new look for Digital Chocolate. The cartoon-y visuals seen in titles like Pyramid Bloxx, Bumper Car City, or Tornado Mania have been replaced by techno-stylish effects. The paddle explodes into triangles when you miss a ball. The multipliers are seen in big, pixelated numbers. Backgrounds are bright colors like orange and purple. The game reminded me a lot of the cult classic Rez on the Dreamcast and PlayStation 2.   Brick Breaker Revolution is an excellent take on the ~Breakout~ formula. The core game play -- busting blocks -- is solidly intact, but wholly elevated by the ability to move up and down a tower of brick-filled screens. All of the weapons are fine-tuned and immensely useful. And the game vibrates with style. Highly recommended.", "date": "Jul 7, 2007"}