{"name": "Yoshi", "name_review": "Yoshi Review", "ref": "https://www.ign.com/articles/2007/07/17/yoshi-review", "text": "Nintendo's Mushroom Kingdom mascots have headlined lots of puzzlers through the years. Dr. Mario came first, paving the way, and afterward followed everything from Yoshi's Cookie, to Wario's Woods, to the Yoshi-themed presentation of Tetris Attack. Probably the least known of them all, though, was this game  only called Yoshi. It's a simple stack-swapping design that came out on the NES and Game Boy 15 years ago, made a minor ripple, and then faded into obscurity. Its fate will likely be the same here on the VC, as its slow and basic style of play hasn't gotten any more engaging in the past decade and a half.    Mario's stuck in the bottom of a Tetris-style pit of falling blocks in Yoshi, and his hands are raised up in the air to support four spinning plates. You control the plumber himself, and not the blocks  they cascade automatically while you shift the plates on Mario's hands, stacked up with blocks that have already settled on top. It's a different take on the falling block puzzle genre, but it can be cumbersome to manage. If you need to get the stack on the far left all the way over to the far right, for example, you'll have to spin and move Mario three times to do it  and all the while the other stacks you've shifted are getting moved backward along the path you just took.        Your goal is to line up like blocks together, as matching two of the same kind eliminates both  each one is emblazoned with a different Mario enemy character, so connecting two Goombas, two Boos, two Bloopers or two Piranha Plants together is the idea. Yoshi enters into the mix himself with an alternative method for clearing the field  his signature eating. Mixed in with the tumbling baddies will occasionally be the bottom half of a Yoshi egg. If you allow enemy blocks to stack on top of the egg piece and then finish the sandwich by allowing a top half eggshell to settle on the summit, each block caught in-between will be munched and eliminated by a newly-hatched Yoshi.   That's all well and good. The problem is that it's just not a lot of fun  Yoshi's boring. Bland. You've seen pretty much all there is to see after only a few minutes with the game, and the challenge is never really there. It's just waiting around for the next set of enemies to fall, or biding time until the next egg piece appears. There are multiple modes, one of which has a defined end goal of eliminating all blocks on the screen, but even that doesn't help much because it's too easy to achieve.   Yoshi's best placed as a beginner's puzzler, holding little appeal for experienced players who'd prefer the deeper challenge of other designs.   It's great to see a new puzzle game arrive for the Virtual Console  the genre is known for its great replayability, and its games represent an unbeatable value for Wii owners. But not Yoshi. While other contemporary designs like Tetris, Dr. Mario and Tetris Attack have become classics since their early '90s debuts, Yoshi has been left behind and forgotten. It's just not as fun. Not as engaging, and not home to nearly as much depth. Pick up Yoshi only if you're a dedicated puzzle fanatic  otherwise, save your 500 Wii Points for a more notable game.", "date": "Jul 17, 2007"}