{"name": "Sonic The Hedgehog", "name_review": "Sonic the Hedgehog XBLA Review", "ref": "https://www.ign.com/articles/2007/07/17/sonic-the-hedgehog-xbla-review", "text": "There is no hedgehog more famous and recognizable worldwide than Sonic. Not even Ron Jeremy. But SEGA's golden 'hog has fallen on dark times over the past few years with numerous sub-par outings. Thank goodness for Xbox Live Arcade, where Sonic's greatest moments have a chance to live again. For 400 Microsoft Points (US$5), kids can find out why Sonic the Hedgehog was such a sensation a decade ago. Though the ~Vintage Collection~ of the original Sonic the Hedgehog offers no extras, it delivers a perfect port of the game that helped make the SEGA Genesis a hit.   When it first released in 1991, Sonic the Hedgehog showcased some innovative elements for platformers. Along with the typical enemies to bop, Sonic added verticality, puzzle elements, and bonus levels into the mix. To further differentiate itself from the granddaddy of all great platformers, Super Mario Bros., Sonic introduced a health system of sorts. The little Hedgehog spends much of his time collecting coins through each stage. These coins open bonus stages and add to your score total, but more importantly, they keep Sonic alive. When Sonic is hit -- either by an enemy or one of the numerous traps spread throughout the six environments -- he drops all the coins in his purse. Being hit when broke means death for Sonic, so like a miser, he must hold on tightly to his precious gold.   Of course, what's a good platformer without a great story? And boy, does Sonic have a whopper. Often called the Moby Dick of game stories, Sonic the Hedgehog tells the plight of hundreds of forest animals forced to do evil deeds for Dr. Robotnik. Only Sonic can hope to free them by knocking them silly (that'll teach them to be prisoners of a mad scientist). The ultimate goal is to chase Dr. Robotnik through the various stages until cornered in his evil lair. There are no supporting characters -- no Tails, no Knuckles -- and no jaw-dropping plot twists. This is pure action.    One of the reasons Sonic is so beloved is for its wide variety of environments. Things begin in the Green Hill Zone -- named for its lush rolling hills and Disney-esque appearance. But soon gamers are taken to the site of Greek ruins, an oversized arcade, and a mad scientist's laboratory. Each comes with its own unique pitfalls, enemies and soundtrack, making the levels very distinct.   Sonic isn't the most difficult game you will play on Xbox Live Arcade. The challenge lies in trying to gather and keep as many coins as possible for when you cross the finish line in each stage. Every level also comes with several hidden areas, adding a touch of replayability to a game that most people have probably already played to death. Of course, leaderboards are offered, all of which are based on overall score. The Achievements are fairly standard stuff, the bulk of which can be earned simply by beating the game (made even easier thanks to the ability to save anywhere).   There's no co-op in the original Sonic, which I wouldn't expect developer Backbone Entertainment to add. But it's not unreasonable to expect some artwork, classic ads, or historical information about the franchise. This is as barebones a presentation as can be offered. The only work Backbone did was add a nice menu page and smoother ~enhanced~ graphics that remove the blocky edges from the 16-bit original.   Sonic the Hedgehog holds up well, more than 15 years after its original release. This isn't the best of the side-scrolling Sonic games, but it still plays great. Even after all these years, I get a thrill running through the old, familiar levels. It's a shame that SEGA and Backbone didn't think to add any bonuses for longtime fans. The SEGA Classic Collection on PS2 has the same game, but with historical information and a video interview. Why wouldn't that be included here -- especially when you have to pay five bucks for the download? It's hard to recommend spending $5 on a game that probably should be part of a larger package, but if you have the extra dough, Sonic is still a fun experience.", "date": "Jul 17, 2007"}