{"name": "WPT: Texas Hold 'Em 2", "name_review": "World Poker Tour: Texas Hold 'Em 2 Review", "ref": "https://www.ign.com/articles/2007/07/18/world-poker-tour-texas-hold-em-2-review", "text": "Surprise -- poker is still as popular as ever thanks to the inherently sexy idea of high-stakes cards and some rather colorful personalities representing the sport on the tube. Poker fans have many, many options for mobile cards -- from Glu's World Series of Poker to Downtown Texas Hold'em, which endures on some corners of the decks. However, Hands On Mobile's latest offering might possibly trump them all, thanks not only to a tight game of Texas Hold 'Em, but also to an exceptional value-adding web-to-wireless application that allows PC players and mobile gamers to compete against each other.   World Poker Tour: Texas Hold' Em 2 shows all the markings of an accomplished sequel -- it refuses to monkey with the successes of the first edition, but offers a lot of additional options and content that serves to compliment the game. The biggest addition is the web-to-wireless play. When you download the mobile game and register, you can use your name and password at WPTmobile.net to log into the online application. From your desktop you can play against other PC gamers and mobile players with persistent avatars and bankrolls. This feature is already a success, as there are players with million-plus bankrolls up on the leaderboards.   Whether you are playing against other mobile players or PC gamers, the online game offers an extraordinarily smooth experience. Chatting is easy via shortcut comments or your own text (although, the game has an aggressive profanity filter -- ~poop~ didn't even make it through). Creating and maintaining a buddy list of friends or favorite players is also simple. You can send invites from the buddy list for setting up games, or you can wade into online tournaments and test your skills against the burgeoning community. Mercifully, you can choose to only play with players at your skill level and a similar bankroll, thus preventing a frustrating, lopsided experience. This is easily the strongest online poker game for mobile.   Before going online, beginners can try out practice mode or check a single-player scenario. When you first start the game, you can create an avatar from over 100 customizable options for use in these modes (this is the same avatar you can use online) and then test out the game with your small first bankroll. There's no pressure out here at the on-set, so this is a good place to get your feet wet and learn both the flow of the game and the controls.   Hands On makes full use of the WPT license, including all the trimmings you would see and hear in an actual broadcast. The game looks as god as it needs to -- the emphasis here is not on flashy visuals, although WPT is hardly an ugly game. It's just more workman-like in nature, although it does offer a few little flourishes, like extra backdrops for matches, such as an arctic setting.   There's not really much more you need to know about WPT: Texas Hold 'Em 2 -- it has poker down to a science, it's full content, and features an excellent mutliplayer game. I cannot imagine a single player having any regrets about making this smart download. WPT: Texas Hold 'Em 2 is an authentic poker game that will satisfy newcomers and card sharks alike. The single-player poker game is good -- it's full of options and solid content. But the star is the web-to-wireless mode which represents a monster step forward not just for mobile poker, but mobile games in general. Now you are practically guaranteed a massive audience full of potential play partners. If you know poker and want poker, this is the game to buy.", "date": "Jul 18, 2007"}