{"name": "Final Fantasy II", "name_review": "Final Fantasy II Review", "ref": "https://www.ign.com/articles/2007/07/26/final-fantasy-ii-review-3", "text": "Give Square Enix credit -- in the month since Final Fantasy I hit the PSP, the company has fixed some of the original's problems in Final Fantasy II. Gone are the two-second load times when accessing the menu, for instance, and the infantile challenge has been amped way up. Story-mongers too should take note that the plotline in FF2 is much more interesting than the almost-translucent narrative of its predecessor, and the soundtrack is better as well.   If you're a diehard FF fan and higher production values and a superior fairy tale are all you need, then by all means, pick Final Fantasy II right up. After all, the reconstructed sequel beats last month's retro remake in just about every aesthetic category. If you're the type of player who puts a higher emphasis on more satisfying gameplay experiences, however, then FF2 definitely isn't the upgrade it appears to be.   Final Fantasy II's dialogue and story are its best features. One of the least-played Final Fantasies on earth, FF2 feels like its own game rather than a follow-up (which, at the time of its original release, was a semi-innovation). Instead of the traditional experience-building format of the original, Final Fantasy II offers a proficiency system not unlike what's found in The Elder Scrolls; that is, the more you use a skill, the better you are with it. One interesting wrinkle on this idea, though, is the fact that you can actually lose your aptitude with your abilities as well. If you're a warrior who insists on using axes, swords or knives all the time, for example, then your magic-related skills will drop while your physical attributes rise. Interesting, no?   Fascinating as the system may be, it's far too tedious to be enthralling. The only way to increase your health is to take shots over and over again, which forces you to absorb a million unnecessary hits so that you can build a character strong enough to combat later enemies. Moreover, the balance between magic and melee weapons is skewed so heavily towards spellcasters that it won't take long before you realize there's less incentive for powering strike attacks versus magic. In short, the customization feature is artificially robust -- as the best path is rather obvious.    The good news is that while the combat engine is flawed, it's tolerable because of the aforementioned storyline and production value. There's a nice mix of drama and emotion in here and that's a hard feat to pull off with such familiar themes and situations (re: stop the ultimate evil, gather the sacred crystals, etc). My only wish is that the battles were less frequent because Final Fantasy II's encounter rate is so high it's on par with the Shin Megami Tense series. When you couple this regularity of warfare with the game's unusual experience system the feeling of repetition only intensifies.Let it be known that even with its noticeable tedium, FF2 is still a qualified RPG experience for dedicated Final Fantasy fans (especially if they somehow missed it when it was re-released on PS One four years ago or the GBA two years later). But for anyone who can see past Square Enix's flagship branding, there isn't any one aspect of Final Fantasy II that pushes it into the ~must try~ zone. Remove the FF logo and the historical importance (Chocobos and Cid made their debuts here after all) and you're left with ~just another portable RPG.~You may be better served to pick it up on the cheap (and bundled with FF1) as part of the GBA's Dawn of Souls collection instead.", "date": "Jul 26, 2007"}