{"name": "Pokemon Diamond", "name_review": "Pokemon Diamond and Pearl UK Review", "ref": "https://www.ign.com/articles/2007/07/27/pokemon-diamond-and-pearl-uk-review", "text": "As '90s pop sensation Take That once sang, ~Everything changes but you~ - a sentiment that could easily be applied to the Pokemon series. You see, despite leaps and bounds in video game technology, Pokemon Diamond and Pearl are practically identical to the original duo of games released way back in 1996. You're still catching 'em all, beating gym leaders and becoming pals with aging professors. But the question is: does the Pokemon formula still hold up to scrutiny after 11 long years?   Well, despite the fact these latest iterations of the Pokemon franchise are undoubtedly still a blast to play, that all-pervasive sense of familiarity does stop them short of achieving legendary status. As you progress, it really does seem like you've seen every location, character, event or item in Diamond/Pearlbefore. Even the narrative follows pretty much the same path as previous entries, immediately eliminating any sense of surprise. Of course, this won't be a problem for those new to the series but, if you've been catching 'em all since Bulbasaur first came onto the scene, it's disappointing to discover Game Freak hasn't taken any risks with this first DS outing.   You'll have to stay up late to catch Pokemon that only come out at night.  What's more, it's a shame to see some of the series' clunkier game mechanics making their way into Diamond/Pearl. In particular, Hidden Machines - special moves that can be taught to Pokemon and used outside of battles to gain access to new locations - severely limit the ways you can play the game. As only certain types of Pokemon can learn particular moves, out of your party of six Pokemon, three or four of those tend to be there purely so you can easily access their Hidden Machine while wandering around. Likewise, you can't specialise in your favourite types of Pokemon, instead being forced to stick with a group of all-rounders.   However, despite these issues, Diamond/Pearl still manage to shine. That's because, when Game Freak first made Pokemon in 1996, it hit gameplay gold with almost every attempt to deviate from that successful formula - Pokemon Ranger, Mystery Dungeon, Pokemon Colosseum, for instance - proving disappointing by comparison. Undoubtedly, the main Pokemon series' insistance on sticking so solidly to its proven foundations is a double-edged sword, but as least that makes for dependable, if not revolutionary, gameplay. You see, at its heart, Pokemon is a fairly hardcore RPG cramming in plenty of stats, grinding, levelling, bosses and the odd side quest. Despite it's kiddy demeanour, it's got more depth than plenty of 'grown-up' RPGs and it's possible to invest 100s of hours expanding your roster of Pokemon.   Some of the Poketch applications are rubbish and we only used the Move Tester.  In terms of gameplay upgrades, Game Freak only adds a few tweaks here and there, the most immediately obvious being the brand new 3D graphics engine. While it's hardly pushing the DS to the limit, the visual overhaul offers a fresh, welcome take on the Pokemon world, while managing to retain the crisp style of old. Sadly, the same can't be said of battles, which still feature 2D Pokemon sprites and the most basic of animations. Given how spectacular 3D battles looked even back on N64, we'd have liked to see a similar take in this DS version.   Also fleshing out the upgrade roster is the inclusion of the Poketch application. This is a series of gadgets - including calculator, Pokemon status checker, watch and so on - essentially there to offer some basic touch screen/dual screen functionality. Sadly, these largely range from the slightly useless to the utterly pointless. Of note though are a basic map, which comes in handy when planning your journey ahead, and a Move Tester that shows what attacks are effective against different types of Pokemon.     That's right: Diamond/Pearl use the same paper, scissor, stone battle mechanic as their predecessors. So, for instance, fire types are better against grass Pokemon but weak when taking on water Pokemon. However, Pokemon can actually be a combination of types, like water and ice or psychic and steel, which makes the Move Tester vital in testing out potential attacks before battles and adding a little more strategy to proceedings.   Of course, the biggest new feature for this DS Pokemon pair is the inclusion of online play - and it fits brilliantly with Pokemon's core mechanics of sharing and battling creatures. Using Nintendo's Friend Code system, you can trade and play with pals all over the globe - plus you can chat to them during battles, which is an unexpected delight. Sadly, it's only possible to play against one friend at a time - which is slightly odd given there are co-op scraps in the single-player game - and you can only chat to someone if you've registered their Friend Code. However, beyond that, it's an extremely engrossing and intuitive experience.   Swapping monsters online is extremely simple. Just don't give them rude names.  If you have no friends online, you can fight against another player's team by heading to the Battle Tower. Here, users upload their teams to the Pokemon servers and players can download them to battle against in the Tower. However, you'll be fighting against AI players rather than a real person. Joining Battle Tower, the other option for online play without Friend Codes is the Global Trade Centre, which is a bit like the classified ads at the back of a newspaper. Here you can upload a Pokemon you don't want and leave a message saying which creature you'd be willing to trade for. Likewise, you can search for a particular Pokemon that's missing from your line-up and download it from another user. Whatever you choose to do, the online mode adds even more replay value to a title that's already bursting with an incredible amount of content both in single-player and multiplayer.Its a definite shame that Game Freak is essentially repackaging the same Pokemon game weve been playing since 1996 again for this DS outing. However, the formula still works after all these years and Pokmon Diamond or Pearl are still life-absorbing, in-depth RPGs with 100s of hours of potential play time. In fact, the main adventure alone takes around 40 hours to finish and thats without accounting for side quests or the Battle Tower. If you've never played a proper Pokemon game before, you really owe it to yourself to experience one of Nintendo's deepest, most absorbing franchises - and this DS version is as good a place as any to start. Series fans though should be aware of how little's changed aside from online play. If you thought things were getting stale last time around, you might want to stay clear.", "date": "Jul 27, 2007"}