{"name": "Alien Syndrome", "name_review": "Alien Syndrome Review", "ref": "https://www.ign.com/articles/2007/07/27/alien-syndrome-review", "text": "At the beginning of Wii's lifecycle we got word of an action-RPG that would be heading to Nintendo's new system.  After a bit of digging it turned out that SEGA's Alien Syndrome was really a multi-console effort for both PSP and Wii.  As it turns out, this one makes a better PSP game than it does a full console effort, and while Alien Syndrome still isn't a must-have PSP title, it at least looks, feels, and plays like it was designed for its intended platform.   You've undoubtedly seen coverage of Alien Syndrome on our site, as the developer has posted blogs, provided us with hands-on builds, and shared a ton of info on the game, but for those late to the party Alien Syndrome can still be summed up fairly simply.  Take one part Smash TV and mix it with the isometric view and RPG system of something like Diablo and you've got Syndrome's offering pretty much down.  Players can either trek through the game in single player mode, or opt to have up to four players engage in co-operative multiplayer throughout the entire adventure, and in that aspect Alien Syndrome is a solid offering.      Selecting from one of five different ~classes~ will start each player with their own custom stats and proficiencies, and as the game progresses both increase in stride.  Along the way you'll have full access to a mobile turret/weapon shop known as the SCARAB, which can provide everything from new weaponry or armor to simple necessities like additional ammo for specific guns or health packs.  If at any time you find yourself carrying too much weight or in need of extra cash, just ~scrap~ items and your SCARAB unit will turn them into more currency.  This ~on the fly upgrade~ system is a huge high point of Alien Syndrome, and it ensures that the game offers non-stop action while still having the depth of a classic town-based action-RPG.  Once you take to the battlefield it's all about blasting baddies with multi-directional aiming control, beating them down with a wide array of melee attacks including critical strikes, stabs, circular clear-all sweeps, smashes, and finishing maneuvers.  Unlike the Wii version, which relies on motion control, the PSP gameplay is done with simple button presses, and while the combat is still a bit slow in our opinion it's far simpler to pull off melee combos on PSP than it is with motion integration.   For the most part the general combat works fine, and players who are craving a more in-depth four player experience may take some joy out of working together and beating the ever-loving-tar out of a few space mutants, although it's going to cost you $40 per disc on PSP.  In the end, however, you're going to find that for every entertaining concept or option in Alien Syndrome there's one or two annoying ones in its place.  For starters, the game's visual presentation still isn't up to snuff for PSP titles, as it deals with low lighting, framerate issues, and a general lack of any specific visual style.  The game looks better overall on PSP than it did on its console re-design, but the models and animation work is still pretty simple overall.  We'd put this one on par with a first-generation PS2 game at the highest, and while the interface design and general quality of the artwork is still decent on the small, high-res screen there are far better looking games on Sony's handheld.   If you can get over the extremely weak graphical offering and bland, two-tone interface some of the odder gameplay issues will undoubtedly frustrate you.  For starters, the aforementioned melee lag makes using anything but firearms a bit less entertaining, as enemies close in on you and hack away while you wait for your player to attack.  The gunplay in Alien Syndrome PSP is also a bit different from the Wii's IR usage (obviously), requiring you to make use of a strafe button while using only ~fire where you walk~ controls.  This makes the game less like a Smash TV, and more like classic shooters like Commando or Ikari Warriors.  It makes circle-strafing a bit more difficult, and the controls aren't quite as fluid, but the strange ~slow down while turning~ issue that was in the Wii version isn't an issue on PSP, making it a bit more manageable.   In addition, the PSP version moves a bit quicker overall, at least it feels like it when we move from console to handheld and back.  When using characters like the Seal class all ammo regeneration happens a lot faster, making that class an amazing starter selection as it no longer requires the constant fall-back of melee usage.  Along those same lines we seem to get more experience in the PSP version as well, actually finishing the premier level of the game at level three instead of nearing level two like on Wii.  We ran the same course, fought the same amount of enemies, but seem to be getting a more appropriate amount of exp for each baddie we best; Alien Syndrome has far better pacing on PSP.  Anyone who can get past the more annoying nuances of the games design and execution may still find some fun in Alien Syndrome.  The game offers over 100 different enemies, but rehashes some of its more minor bosses in an attempt to add longevity.  At the same time, powering up your character is relatively deep for a simple run-n-gun game, and we got some simple enjoyment out of powering up our weaponry or making use of class-specific skills such as increased critical rates or outstanding melee power.  If this game would have been $29.99(or $19.99, to be more realistic) instead of its current $40 price point we might endorse it a bit more, but seeing as its release couples a $40 price point with the need for four copies to play multiplayer its hard for us to get too excited about Alien Syndrome.  For fans of classic action-RPGs or multiplayer addicts Alien Syndrome would be a solid weekend rental or bargain bin purchase, but given the lack of polish throughout, the overall lackluster graphical presentation, and the $40 price tag weve got to put SEGAs latest effort in the just skip it category.  There are far better games available on PSP, and far more are on the way.", "date": "Jul 27, 2007"}