{"name": "Unreal: Return to Na Pali", "name_review": "Unreal Mission Pack: Return to Na Pali", "ref": "https://www.ign.com/articles/1999/06/29/unreal-mission-pack-return-to-na-pali", "text": "How come everyone around here in the office always cringes when a mission pack comes in? What a shame. Especially when it's for a first person shooter. I mean, there are a ton of them, and you can't help but to play them for a couple of weeks, with a few exceptions of course, and then have them mysteriously vanish to the back of your video game library. It would be unfair if I included Unreal in that pile of games that now gather dust, but I have to admit, I haven't been playing it as much since the release of Half-Life, Thief... the Quake III test. Will Unreal Mission Pack: Return to Na Pali bring Unreal back into your gaming digestive track? Yep.  Return to Na Pali puts you back under the rags of an escapee. Only this time around, you get picked up by a salvage ship, and you have two choices: either die a slow death, or take up a mission. Assuming that you take the mission, your goal is to rescue the weapons research logs from the wreckage of the cruise ship, Prometheus... without dying by the claws, or missiles, of the many creatures that inhabit the Na Pali world.  I know, great story, but where's the added value you ask? Well first off, GT Interactive has added three new weapons: the grenade launcher, rocket launcher and... a brand new CAR! (Combat Assault Rifle). I'll try not too bore you too much with all the weapons' functions, 'cause I'm sure you all know how an assault rifle, grenade launcher and rocket launcher work. But I would like to talk about the secondary firing features on some of the new weapons. The rocket launcher fires a smart missile which gamers can manually guide to its target, while the grenade launcher has a remote option that lets gamers launch grenades and detonate them from a safe distance. These two weapons alone add so much to the multiplayer part of the game. There's nothing more hilarious than taunting an enemy with a handgun and leading him to a littered hallway filled with grenades.  GT has also added six new multiplayer deathmatch maps for all kinds of gaming goodness. The ~Stomp~ level happens to be one of my personal favs. There's really nowhere to snipe. It's open, tons of winding stairways and eveyone dies -- it's great. That's one thing that separates Unreal from a lot of the other FPSs out ther, is the level design, and these new deathmatch only maps compliment that strength.  With 14 new single player maps and new enemies, Return to Na Pali is a worthy pack purchase that all Unreal fans should get. And yes Dan*, I played it, you freak. We even set up the mulitplayer goodness around the office. Why do you think this review is so short?! Jeesh.  -- Jay Boor  *Dan Harnett is the PR Sorcerer at GT Interactive -- I love that guy.", "date": "Jun 29, 1999"}