{"name": "Devil's Crush", "name_review": "Devil's Crush Review", "ref": "https://www.ign.com/articles/2007/07/31/devils-crush-review", "text": "TurboGrafx fans got the chance to get their retro pinball fix with the notable space-themed Alien Crush. The game was, and is, suitably fun, featuring a two-screen-tall virtual pinball table, and graphics and sound reminiscent of Ridley Scott's Alien films. But old-school TG-16 fans know that a better version traded in the extraterrestrials and flying saucers for skeletal knights and medieval castles. Devil's Crush is the refined, more fun sequel and definitely a game worth looking at.   Demons, monks and fire-breathing dragons have descended upon a peaceful kingdom in Devil's Crush, settling into a pinball table that's something of a hybrid between monster and medieval themes. Your task, of course, is to eliminate the beasts and roaming wizards, striking them with your flipper-propelled pinball and racking up the highest score possible. The appeal of the Devil's Crush table is good, and feels engaging -- cackling skulls laugh at your misfortune when you lose a ball, stone walls break away to reveal new paths and enemies to attack. And it has more playable area than you might first think with three vertical screens altogether.   That's an enhancement over Alien Crush's two screens, and the additional real estate is welcome. As your ball is launched up or drops down between the three main regions, the ~camera~ follows the action accordingly -- and it's a test of timing and reflexes to command each area's set of flippers fast enough to keep the ball out of danger (though, really, Devil's Crush is fairly forgiving in that regard). You'll only have three balls at the beginning of a new game, but you can earn more during play and there are numerous safeguarding table elements that will activate and cover up gutters for you.   Like Alien Crush before it, Devil's Crush also has several bonus rounds that shift the action away from the main table and into alternate, single-screen challenge areas. These will often be ~boss fights~ of a sort, as you'll earn thousands of bonus points for successfully striking and defeating a giant dragon, for example, before the ball falls back out onto the core table.   The only thing holding back Devil's Crush is its lack of variety, in that there is only the one table to experience. It's bigger and more interactive than the single table seen in Alien Crush, which is good, but it would have helped this title's replay value quite a bit to have even just one other, differently laid out surface to play on. There are only so many times you can attack the same circle of shuffling sorcerers before you find yourself ready for something new to happen.Alien Crush was a good appetizer, but Devil's Crush is the superior experience with faster gameplay, a larger table and a more satisfying theme. Check it out if you're a fan of video pinball games, as there's none better to come from the TG-16 catalog.", "date": "Jul 31, 2007"}