{"name": "Picross", "name_review": "Picross DS Review", "ref": "https://www.ign.com/articles/2007/07/31/picross-ds-review", "text": "The incredible popularity of the daily Sudoku newspaper puzzles (as well as the umpteen Nintendo DS games) has set a fire under Nintendo's butt to go back to its classic roots and revive one of its less remembered Game Boy games. Picross has been around for years and has a place in many gamers' hearts, but clearly without the Sudoku craze Nintendo arguably wouldn't have brought back the design. It's a good thing it did: Picross DS is easily one of the most addictive and engaging pick-up-and-play puzzle games released on the Nintendo DS, and the clean, sterile Nintendo DS redesign fits the ~casual gamer~ demographic perfectly. Pass this one up and you'll be missing out on one of the finest DS titles yet created.   The concept is about as mathematical as Sudoku is, which is to say that it's not very. Using the clues given at each row and column, you've got to determine which blocks are active in the grid. The clues given are how many ~groups~ are active: if a row says ~1, 3~ it means that the particular row has one square, then a group of three squares, with at least one inactive square between the groupings. If it's a 5x5 grid, it's pretty easy to know that, using this example, the first, third, fourth and fifth square in that row are active to the puzzlebut if it's a larger grid you'll have to do a bit more hunting to figure out where the active ones are. Solve the puzzle and you'll reveal the picture, a low-resolution two-bit image like a fruit, an animal, a vehicle...anything.   Now, early in the experience you'll probably try to convince yourself that there's no way to solve some puzzles without blind guessing in order to open up more clues. But the way the game lays out its levels, the designers stealthily teach the mechanics of finding the tiny clues that will lead you to solve some of the tough puzzles in the game. The trick is to use the ~X~ markers as liberally as possible - if you know where an active block isn't, don't be chicken to mark it with an Xthe game will actually gray out the row/column hints if you block out a proper grouping to help out.  There's almost always enough given away in a puzzle to peck away at the grid properly, and the sooner you find the little clues the more the brain will work to uncover the viciously difficult challenges deeper inside Picross DS.   If you mark an inactive square as active, you're penalized time - that's how you're ranked in a game: how long it takes to finish a puzzle. If you take more than an hour - whether that's real-time or penalized time - you don't get full credit for completing the puzzle. And that's the only big issue with the game - once you solve a puzzle you already know what it is, so if you have to play through it again you already have a huge hint on where to start. And the whole ~penalize with extra minutes~ thing is fine, but the game should be tracking how many errors you made along the way. It doesn't.   The lack of error tracking is a shame because Picross DS does a great job keeping track of other elements. The ~Daily Picross~ item is a fantastic evolution of Nintendo's effort to get gamers to play games on a regular basis. It's an item that in basic form for Brain Age and branched out in other Nintendo games, most notably the recently released Planet Puzzle League. Daily Picross enables quick-paced versions of Picross to be played once a day, and the times are tracked over the course of weeks via an on-screen chart. Just like Planet Puzzle League's mode, the Daily Picross challenges give the game that ~must play today!~ addictiveness. As if standard Picross wasn't already addictive enough. Which it most definitely is.   Apples, squids...any picture can be a puzzle.   On top of this, players can create their own drawings and turn them into Picross puzzles, and then trade them all locally or online. Nintendo will also be creating new puzzles for downloading for as long as they can keep up with the demand. The construction element's pretty powerful but it doesn't allow for the creation of the same pixel animation that the built-in puzzles have when they're solved. Even so it's a welcome and useful addition that allows for tons of creative ideas (most likely Picross Penis Puzzles Aplenty) and near endless play time.   The Picross concept is also extended with some really great multiplayer competition. It's a simple race against the other person to see who can finish the puzzle first - any mistakes penalizes the player by deactivating his puzzle for five secondsand that could be an eternity against a veteran Picross player. This mode can be played locally or over the internet. Locally, you only need one copy of the game to play it. The benefits of a graphically minimal game design.  The game may not look like much on the surface, but once you delve into a handful of Picross puzzles you might find it hard to stop playing. Picross DS is a brilliant, mature-focused Nintendo DS product that's incredibly addictive with near endless gameplay. If you missed out on the original Game Boy design Nintendo's got you covered: those puzzles can be downloaded off of the Nintendo Wi-Fi Connection servers for free. This is a fantastic alternative to the Sudoku design, and as fun as that number puzzle is, Picross DS trounces it.", "date": "Jul 31, 2007"}