{"name": "UFO: Extraterrestrials", "name_review": "UFO Extraterrestrials Review", "ref": "https://www.ign.com/articles/2007/08/01/ufo-extraterrestrials-review", "text": "For years now we've been suggesting that someone out there needs to update the old Microprose classic X-COM UFO Defense. This game allowed players to manage a worldwide military organization tasked with defending the nations of the world from an alien invasion. Combining intense tactical battles with ~big picture~ strategic play, it ranks as one of, if not the, most enjoyable PC games ever.  Over the last few years or so we've seen quite a few titles try to recreate the magic and mayhem of the original game. Most have fallen short either by missing the point of the game altogether, or by shifting the balance too far towards an unpleasant extreme. Matrix Games' UFO Extraterrestrials fails with an entirely new third approach, sticking too closely to the original and ignoring the chance to put their own spin on things.   Players are put in charge of an alien-fighting force on the planet Esperanza. The initial base comes equipped with interceptor craft that are used to shoot down any UFOs that come within the base's detection range. Squads of soldiers and armored vehicles can be dispatched to investigate these sites and, later in the game, assault alien installations around the world. Success in these missions causes your soldiers to improve in their fighting ability and nets you some cool alien tech that you can research back at the base.   As you discover the mysteries of alien technology, you can then build advanced equipment to deal with the growing alien menace. The more successful you are in your mission, the more funding you'll get from the nations of Esperanza. Get enough money and you can even enlarge your operation by adding additional radar and intercept bases around the world.  It's a compelling design but its success requires the cooperation of several different elements. In this case, there are definitely some high points. Watching your troops improve with each mission until they develop into a highly effective alien killing force is definitely one of the game's most rewarding payoffs. Unlocking the secrets of an alien technology and then turning it on your foes is another of the game's undeniable joys. Unfortunately, tedious tactical battles and annoying limitations on base management will keep you from otherwise enjoying the things that the game does well.   There's not much of a story beyond the first cut scene and even that's not worth much. This initial cinematic not only makes a space battle between aliens and humans seem downright boring, but it also features some of the worst voice acting we've ever heard in all our years playing videogames. We fact, I hesitate to use the term ~acting~ here because of the stilted and lifeless performances that we're given by the voice over team.  Still, while a little story would have been nice, you hardly need much of an excuse to defend your planet from an alien menace. Here your xenophobia is pretty much taken for granted so it's assumed you don't actually need to know why the aliens are out to get you. The fact that they keep sending their spaceships flying over your head is reason enough to shoot them down and send a team out to the crash site to kill any survivors.  The turn-based tactical battles definitely convey the right sense of menace. Stepping off your troop transport is incredibly nerve-wracking. Just the mere suspicion that an alien could be waiting to get off a shot at you before you're even off the ramp is enough to get you interested in the action. This is particularly troublesome given that the enemy AI seems to be able to see much farther than you and has weapons that far outclass the ones you begin with. You'll also suffer from the lack of a simple overhead map that gives you the general layout of each level. And don't even get us started on how your soldiers have virtually no peripheral vision and no option to reserve action points for opportunity fire.      You will initially appreciate the variety of the maps but as the number of missions ramp up you'll start seeing lots and lots of repetition. Thankfully, there's lots more variety found among the aliens you'll be fighting. Each level seems to offer a number of different types of foes to fight and the smart player will eventually learn how to prioritize the most important targets. Word to the wise: don't neglect the ones with the huge arm.  The levels teem with destructible objects, which you'll really get to see the benefit of during your more enthusiastic firefights. On the other hand, the aliens don't have too many structures to hide behind and those few that do exist aren't likely to hold many aliens. More likely than not, you'll simply find your foes just hanging out in the wide open spaces of most levels or simply hanging out in the saucer waiting for you to come and kill them.   While the repetitive maps, lack of an overall view, and interface omissions impact your enjoyment of combat, the real kicker is that none of your soldiers will ever die. You can lose them by abandoning them in the mission area but otherwise, not even the most vicious alien attack will ever do more than simply send your soldier to the hospital for a few weeks. It certainly helps you to develop a stronger fighting force by the end of the game, but it also means that much of the tension is completely undone. How much can you really care about putting your soldiers in danger when the worst that can happen is that they have to sit in a hospital for a few weeks?  The only real consequence of having a wounded soldier is that they won't be available for upcoming missions. You should be upset with yourself for leading your troops into harm's way to begin with, but you wind up being more upset with the limitation on the game's recruitment options. Rather than letting you manage your own recruitment, the game gives you a set quantity of soldiers and forces you to make the best of it. You'll get new recruits from time to time, but it's not anything you have any control over. This can lead to situations where you've got lots of cash and the goodwill of the world but can't field a full team because several of your soldiers are still recovering in the hospital.   The strategic portion of the game takes place on a global level. Esperanza is divided into large zones and you'll need to make sure you build enough detection and interception bases around the planet to provide good protection for your most generous funding nations. Unlike X-COM, you can only really have one specific soldier base, so you won't get the same sense of lots of different teams working around the globe.  Many of the functions of the bases are automated for you. We already complained that soldier recruitment is entirely out of your hands. Additionally, hiring and firing of scientists and engineers is tied directly to the presence of your labs and workshops. Money for rearming and refueling comes directly out of your account regardless of whether or not you'll be running a deficit, which can tend to frustrate your economic outlook during the lean months.  The graphics are a bit outdated and suffer from some performance problems. Individual units and environmental assets look decent enough during the tactical battles, but the jerky animation and the questionable effects tend to ruin any sense of realism that you may experience. With X-COM at least you were fighting over towns and cities that gave you a sense that there was something worthwhile at stake. Esperanza has no such effect on us. I mean, why are we fighting for this crummy planet anyway?  Moving past the graphics, the sounds aren't any better and are, in many ways, worse. The voice talent leaves a lot to be desired and the music, if possible, is even more dated than the graphics. If this is what passes for music on Esperanza, the aliens can have the planet for all I care.Meh. UFO Extraterrestrials gets a few things right but it doesn't take enough chances or introduce enough conveniences or improvements to make it worth the forty bucks they're asking for it, particularly when you can grab a copy of the original X-COM for less than that. We find it particularly troubling that the few diversions the game does manage to take all seem to be in the wrong direction. Less control over your bases in the geoscape and some poor choices in the tactical system are probably the biggest offender here and it's odd that the designers chose this approach, particularly since everything else in the game is pretty much a direct ripoff of the X-COM gameplay.The bottom line is that UFO Extraterrestrials is enjoyable only to the extent that it copies X-COM UFO Defense. With that in mind, it's hard to deny that the game has some merit, but it hardly does justice to its inspiration.", "date": "Aug 1, 2007"}