{"name": "The Next Tetris", "name_review": "The Next Tetris", "ref": "https://www.ign.com/articles/1999/06/30/the-next-tetris-2", "text": "For more than a decade, a little game by the name of Tetris has been occupying the game-playing time of both casual and die-hard gamers. What makes this game so damn addictive? Yes, that's a rhetorical question, because we don't really care. It just is, and we're grateful for the game design Alexey Pajitnov brought to the videogame world.  And for years, companies have tried to copy the game's addictiveness with their own versions of the ~falling icons~ idea, from Sega's Columns and Puyo Puyo to Atari's Klax, to Capcom's Puzzle Fighter. But none has ever matched the simplistic nature of the original Tetris.  Now, the true Tetris-license owners, Blue Planet Software, attempt to expand on the Tetris theme with The Next Tetris. The designers have taken the same idea (falling pieces constructed of four blocks, a playfield 10 wide by 20 deep) and have added color and an added element of gravity to the mix. Does it work? You betcha. Gameplay  We all know Tetris, but for those who've never touched the game, here's a little breakdown of the gameplay. Blocks constructed of four square pieces (a total of seven different shapes) fall from the top of the screen one at a time, and its up to you to fit the pieces (by rotating them in 90 degree increments) in such a way that a complete horizontal line is formed. Once that happens, the line disappears and the pile of blocks on top of that line settles down a notch. This gives you more room to work with. The game ends when you fill the bin to the very top.  In The Next Tetris, a new element is added to the mix: color. The same seven pieces are in the game, but there are two types: the Tetramino (the normal Tetris piece) and the Multimino (a Tetris piece that is constructed of two or more colors). When a Multimino lands into the bin, it will break up as if the colors were individual pieces. If the same colors touch each other, either vertical or horizontal, they'll meld into each other, forming a bigger piece in the bin.  What's cool about the Multimino is that it will cause cascades  these are combos that will delete line after line of blocks with a single fall of a Tetris piece. Gravity plays an important role in this game, more than in Tetris. In Tetris, a gap in the middle of a stack will remain there until you whittle your way down into the bin to fill it up. In The Next Tetris, if a block can fit into that slot, it will fall into it. You have to keep your eye on the colors when you fit pieces together  you don't want to create large pieces, since it will make it harder to form cascades.  Okay, now that that's out of the way...  The Next Tetris is a little different in gameplay than Tetris. In Tetris, you just stack and stack and stack until you fill up the bin. In The Next Tetris, there's a definite end to each level. The idea is to clear out set ~garbage~ pieces in a certain amount of time. When you clear out the garbage blocks, the level ends and you move on. This idea is the same in all the game's variations, from the game's One and Two Player mode, Marathon Mode, and Practice mode. Thankfully the designers had the forethought to put in a Tetris-style ~build until you can build no more~ mode, called ~Score Marathon.~ Unfortunately, you can only play this mode solitaire.  Two Player mode is incredibly unique  like always, the idea is to clear out the garbage blocks, but this time you're trying to do it before the other player clears out his. But what's really cool is the ~punishment~ you give the other person when you clear out multiple lines in one shot. Thanks to the game's smooth 3D engine, clearing out two, three, or four lines in a row will cause the other player's screen to flip around wildly...while he's trying to play the game. Very disorienting. If you clear out lines with cascades, his screen will go even crazier  sometimes even darkening. And a five-or-more cascade will cause his blocks to turn a solid color for a few seconds, making cascades near impossible for him to create.  If anything, The Next Tetris needs more options, especially for two players. Score Marathon just screams ~Two Player Mode~ but we don't get it. And the Classic Tetris mode is in there, but again, it's only for one player. A shame. Graphics  The Next Tetris looks absolutely gorgeous thanks to a silky-smooth 3D engine that runs in the PlayStation's high resolution mode. And yes, it animates at a constant 60 frames per second  which really shows off when the other person's screen is flipping around like a Ringling Bros. acrobat. And when you clear out a line, the whole thing explodes out at you in a cool effect.  But what's really great is that the graphics aren't overwhelming , nor do they clutter. It's a perfect combination: sterile yet stunning. Sound The game features a fair share of tile ~clacking~ and ~thumping~ effects that fit the design well. The best feature, though: if you don't care for the music Hasbro and Blue Planet Software have supplied for the background audio, you can pause the game, enter The Next Tetris' CD player mode, and put in your own disc. Tetris with Fatboy Slim or Beethoven? Absolutely. And you can use the controller's L and R buttons to increase and decrease the volume during play, as well as skip tracks on the CD. Those audio guys were thinking. I've been playing tile-stacking puzzle games for the past ten years, but none have been more addicting and satisfying than Tetris. This isn't the first time Tetris has made it to the PlayStation (Jaleco's Tetris Plus was released around two years ago), but this version adds some very cool features and new elements that make The Next Tetris a must-own. My only real complaint (and it does bring the point score down a notch) is the lack of two player options. The Two Player game is absolutely great, but since Classic Tetris has been done multiplayer before (on the Game Boy, no less), it certainly is possible. And, I would have loved to play Score Marathon with a buddy to try and screw him up as the pieces increase in speed. It's a shame these modes weren't included.But as it stands, you gotta get this game. Tetris lives, baby, and keeps on going.", "date": "Jun 30, 1999"}