{"name": "Tomb Raider: Legend", "name_review": "Tomb Raider Legend Review", "ref": "https://www.ign.com/articles/2007/08/06/tomb-raider-legend-review-2", "text": "The grand dame of adventure has booked previous engagements on mobile, but Tomb Raider: Legend marks Lara Croft's 3D debut on the smallest screen. It's not a direct port of the console game that marked a decided improvement in the franchise's fortunes, but it has more than enough hooks to snare fans of that game. What remains to be seen, though, is if they are ready to give up some of their exploration expectations to enjoy Lara on the go.   Legend traces Lara's quest to rejoin the three broken shards of Excalibur, the blade of the fabled King Arthur. The pieces are scattered and it's up to the heroine to seek them out, traveling around the globe to wrest the missing pieces back from some unsavory characters. The first leg of your mission takes you to Japan, where you must scale a skyscraper and then blast your way through some Yakuza thugs. The steamy jungles of Ghana serve as the backdrop for the second mission. After claiming the second piece, it's off to the tomb of King Arthur for a final showdown.   While you certainly have access to many of Lara's trademark moves, such as wall-hanging, pistol-wielding, and flips, what you definitely don't have is absolute freedom. The game is extremely linear, placing a good deal of the action on-rails, not entirely unlike the classic Eidos platformer Pandemonium. You'll discover this right away as you climb the Tokyo skyscraper. Just pressing forward keeps Lara running along the scaffolding, no matter which way to the camera bends or points. This keeps confusion at a bare minimum -- often a good thing -- but the essence of Tomb Raider is exploration, and that's denied here.   In the jungle, you're treated to some very nice scenery, but again, you're pretty much shoved along the way by an invisible parental hand. Things get a little better during fighting sequences, but even here, you still are always shown the proper way. Enemies pop into view and you artfully dodge attacks while returning fire. The gymnastics are cool, but these scenes ultimately feel more like a shooting gallery than real combat. You must also duel with bosses at the end of each mission, which requires the tried-and-true pattern management technique.   I'm bagging on Tomb Raider quite a bit it seems, and that's because I want fans of the series to know exactly what they are getting before parting with their download dollars. Inappropriate expectations are one of the worst things about mobile -- it's what garners poor word of mouth. However, if you can accept the on-rails experience, there is good fun to be had here, such as using the hook and pulling off some of Lara's acrobatics. I really enjoyed the pacing, even though repeating some sequences due to a button blunder resulted in teeth-gnashing, and while the shooting gallery comment sounds like a total dig, it's not. It's just the only way I can describe the sequences, and the idea of a shooting gallery full of Lara's hopping about isn't bad.   The visuals are quite good, too. It's amazing how far mobile graphics have come in such a short period of time. I really liked the use of color. Lara is very spidery, though. I know she's supposed to be somewhat lithe, but there are some scenes where she's almost reduced to toothpicks. Quick, somebody give this woman that lolcat's cheeseburger.  Tomb Raider: Legend is one of those games that is defined as ~it is what it is.~ Hardly a ringing endorsement, but not a damnation either. Residual fans of Lara Croft will surely get a kick out of having her in full 3D on their handset, but the largely on-rails gameplay might dampen spirits. The game is wholly playable, though, so if you're still down with Lara and don't mind a linear adventure, this Legend may satisfy.", "date": "Aug 6, 2007"}