{"name": "B-17:  Fortress in the Sky", "name_review": "B-17 Fortress in the Sky Review", "ref": "https://www.ign.com/articles/2007/08/07/b-17-fortress-in-the-sky-review", "text": "DSI and Skyworks take players back to World War II in an action flight game that's not nearly as lame as Wiffle Ball or MLB 2K7, the team's two previous stinkers on DS. Players take control of the classic military bomber through 25 missions that involve piloting through hostile air, bombing enemy ground sites and blasting incoming fighter planes out of the air. The game's hook is that the player controls all 8 of the bomber's gun turrets at once by cycling between them. It's a fun idea that's reminiscent of Missile Command from a first-person perspective. Unfortunately, novel ideas like this don't always translate into fun gameplay.    The majority of the gameplay involves taking a seat in one of the 8 gun turrets. Players can switch between the seats by cycling through the L and R buttons, or by tapping different locations on a touch screen map of the bomber. All 8 guns fire more or less identically, but each one has a unique view from the plane that gives it more or less advantage, depending on which direction enemy planes are coming from. Enemies swoop in on the bomber a handful at a time and if they're aren't shot down during their approach, they'll begin to fill the bomber with holes until the mission is failed.    It's a fun idea, but unfortunately multi-tasking between the turrets is annoying and unintuitive. For one thing, every turret has a very limited range of where it can fire; enemy planes that can be seen from one gun perspective may not actually be able to be shot at, since the guns lock up before reaching the edge of the screen. This is an annoying tease since the player can't tell that a shot will be impossible until they switch to a view, lift up the gun and watch it fail to aim at the enemy, by which time it's probably too late to switch to another gun in time to shoot it down.    Another problem is that the game identifies gun positions based on a clock system (~Fighters at 2 o'clock!~). This works fine for incoming aircraft at 12 and 6, since the player can just tap the front or back of the bomber. Any other angle is confusing though, as it's unclear during selection exactly which turrets face which direction. None of this matters much anyway, however, since the turret on the top of the bomber can rotate a full 360 degrees. Because of this, 80 percent of incoming planes can be shot down from this one turret, and the 20 percent that do slip past won't do enough damage to fail the mission. It's a shame that the game has such a major unbalancing issue, because players can essentially beat the game without ever having to try more than the one turret view.    After a few planes have been shot down on the mission, the second mode begins. This involves moving the bomber left and right from a topdown view, avoiding explosions from anti-aircraft weapons below. It's a fun idea but since the explosions go off at random locations, and cause instant damage, there's really no skill to this mode. Either the player gets hit a lot while shifting around, or they get hit very little, and neither has much to do with their gaming ability. When this mode ends, players are returned to the turrets for a bit before hitting the final mode, which involves dropping bombs on enemy soil. This mode couldn't have been implemented more sloppily.    The player shifts their plane left and right from a topdown perspective (the bomber is invisible here) and drops bombs at will on the ground below. Each mission has a specific objective, such as blowing up an aircraft field, but along the way there are several other hostile targets such as bases, ships and parked planes that can also be hit. The player has an unlimited supply of bombs, but they'll need them because the aiming in this game is merciless. The screen scrolls by at a set rate and unless the player is already lined up below a target when it comes into view, it'll be too late to get over in time. Basically, this makes for lots of failed missions that are only passed once the player has memorized exactly where the objective is on the map. Some kind of arrow indicators pointing toward the target or way to tell that an important landmark is about to be passed would have been great, but there's none of that here.       Odder still, the game doesn't instantly fail the player, in spite of the main target needing to be destroyed in order to progress. So if the target is missed, the player still has to play through another round of gun turret action before finding out they botched the mission. There's a flight path displayed on the bottom screen during this mode that asks the player to adjust their altitude up and down during the assault, although this seems to have zero effect on the actual bombing and feels like an afterthought thrown in to spice up the dull gameplay.    Every mission follows the exact same pattern - turrets, dodging flak, turrets, bombing, turrets - and that's the game in a nutshell. There are no multiplayer modes or engaging campaigns. This game features only the most barebones, minimum amount of handheld warfare possible. It doesn't begin that thrilling, and becomes less and less interesting with every level. There are three sound options that adjust volume on the music, sound effects and radio chatter, as well as two difficulty modes, with the easier one helping the player to auto-select the most useful turret at any time.    Graphically, the game's pretty ugly. It features 3D turrets, airspace and planes, but they're all plainly constructed. Enemy jets all look the same and animate either zipping toward the camera or diving down in a trail of smoke. The 2D interface is clear, although because of the side view bomber schematics, it's difficult to know what direction an enemy is approaching from, in spite of audio cues. 2D artwork on the ground bases is atrocious with pixel art that would have been embarrassing in the SNES days. It's sometimes difficult to tell which buildings are the target ones, since they all look the same, and there's a surprising lack of damage animation on the larger structures, such as air fields and train yards. Because of this, players won't be able to tell if they've passed a mission until they actually get text confirmation at the end of the level.    Ambient audio sounds fairly accurate with wind and decent gunfire and explosion sound effects. But the music and overall soundscape is pretty barren and does little to create atmosphere in each level. The rest of the bomber's crew (apparently sitting on their lazy butts while the player runs around their plane doing everything) shout out constant audio cues on which direction enemies are approaching from. Some of these sound bites are useful, such as ~Bandits at six o'clock!~ They pinpoint incoming fighters accurately within 15 degrees. Others are less useful, such as ~Fighters, coming in fast!~ Umokay.B-17 Fortress in the Sky is sort of a fascinating failure. The game is overly simplistic, lacks variety in its missions and isn't nearly as playable as it should be. At the same time, it's an interesting approach to air combat that hasn't really been done in games, especially on the DS. Although looking at this game, there's probably a reason for that. If a buddy of yours owns this game, you might borrow it and satisfy your curiosity for twenty minutes. But I can't recommend actually spending any money on it.", "date": "Aug 7, 2007"}