{"name": "Wave Race 64", "name_review": "Wave Race 64 Review", "ref": "https://www.ign.com/articles/2007/08/08/wave-race-64-review", "text": "Water. The animator's nightmare, the programmer's greatest challenge. Nearly every form of entertainment media has struggled, at one time or another, to properly and realistically capture the true essence of the element. Its fluidic, flowing, inconstant nature represents an opposite extreme to the tangible, fixed, solid objects that usually form the foundation for any movie's setting, or any game's core design  and so it was a spectacular achievement when Wave Race 64 got it exactly right.    One of the earliest games released for Nintendo's 64-bit system, Wave Race 64 featured, 11 years ago, some of the best water effects even seen in any game. The accuracy with which these waves were rendered was a huge boost to the fun factor of the game's jet-ski racing experience, and was so ahead of its time in 1996 that today, in 2007, the gameplay still feels fresh and new. Its graphics aren't as impressive as they once were, and some aspects of its presentation are certainly dated  but any negativity washed up on this game's shore will quickly be taken back out with the tide, as Wave Race is still just a blast to play.   Four professional watercraft pilots are yours to choose from at Wave Race's onset, each one with his or her own personality and features. Each one is also fully customizable, though, in name and handling ability  so if you don't want to race as the evenly-balanced Ryota Hayami, you can quickly transform him into an off-balanced, loose-gripped racer named, say, Mark Bozon.   Championship Mode is the first stop for your chosen avatar, and is Wave Race's main single-player competition mode. You'll race to complete three laps on a variety of watery courses, from beachsides to tranquil lakes, abandoned naval bases and glacial bays. The raceways are mostly open and wide, giving you plenty of leeway to choose which path you think's best to get to the finish line  as long as you don't miss the buoys.     Floating throughout each race course are a handful of red and yellow buoys, marking the direction you're supposed to take as you're jetting through the waves. Red buoys indicate that you should pass on the right side, and yellow the left. As soon as you pass five of the markers correctly in a row, your jet-ski will achieve ~Maximum Power!~ and gain a boost in speed  but if you miss a buoy by passing it on the incorrect side, you'll instead be penalized by a drop in momentum. And, if you rack up five misses on one course, you'll be disqualified from the race altogether.   Weaving in and out of the red and yellow markers takes some skill, but Wave Race's controls are intuitively easy to pick up. You can practice in a tutorial area called Dolphin Park before starting your quest for the checkered flag, and the game will instruct you in different techniques through voice-over and text  techniques like Wave Race's trick system. Though not required to learn, the special skills available to your racer can give you a boost and add to the fun of the game. You can complete a 360 backflip when coming off a jump ramp. You can dive underneath the water's surface with the submarine technique. And you can take Peppy Hare's famous advice when the mood strikes you, pulling the Control Stick first to one horizontal side and then the other as you fly through the air  that's doing a barrel roll.   The tricks will add to your score in Stunt Mode, which pits you against the clock instead of other racers and presents a set of floating, circular rings for you to try to pass through on your way to completing a single lap. A two-player versus mode lets you challenge a friend on any of the game's courses that you've unlocked through the single-player campaign, and a Time Trial option lets you try for records on the same stages  though, like other N64 releases to the Virtual Console, you can't save your Ghost Data in this edition.   And there's one other change made to this VC version of Wave Race 64  in-game ads. No, Nintendo hasn't sold out, but the company has modified the original code of the game to replace certain banner graphics. Kawasaki Jet-Skis had partnered with the Big N to sponsor the watercrafts in the game back in 1996, so logos featuring the Kawasaki name appeared on a few of the courses  now they've been swapped out, replaced with the logos of the Wii and the Nintendo DS Lite. It's a little odd to see brand-new logos appear in a game that's 11 years old, but hey, it works. The game certainly doesn't play as old as it is, so maybe it's an appropriate inclusion.When you get the core of a game just right, everything else flows naturally. Wave Race 64's technical achievement in water effects was so spot-on that the racing gameplay taking place upon those waves had to be spectacular  and it was. This game was a blast to play back in the earliest days of the N64's life cycle, and it's still just as fun today on the Wii. You'd be well served to invest 1000 Wii Points to download Wave Race 64  and let's hope sales of this title end up being high enough to catch Nintendo's notice. With the motion-sensing capabilities of the Wiimote and the innovations sure to be introduced by the recently revealed Wii Balance Board, a new-generation update of the franchise would be exciting to see.", "date": "Aug 8, 2007"}