{"name": "Sword of the New World", "name_review": "Sword of the New World Review", "ref": "https://www.ign.com/articles/2007/08/09/sword-of-the-new-world-review", "text": "There are going to be people who really enjoy Sword of the New World. People who enjoy Lineage II, for instance, were probably falling over each other with anticipation before this game came out. And that's understandable because it's a Korean-style MMO with an exciting Columbus age of discovery feel, a richer noob experience, and a great soundtrack. It's a grind, but I remember starting out in Lineage II, and the grind has come a ways since then. Unfortunately, despite Sword of the New World's successes in many departments, the gameplay itself is probably going to hamper its ability to attract people from outside the niche market this type of MMO caters to.      The main differentiating factor from other MMOs is apparent as soon as you enter the character creation/selection screen, known as your ~Quarters.~ (As a side note, let me just proclaim throughout the land that this is most probably the best log-on theme ever composed. Captures the feel of the game completely with its prim and proper strings, but at the same time shouts, ~Come on! Time to go! Choose your party and let's get crackin'!~)  You'll be making not just one character, but a family of characters, whose numbers are dictated by the number of slots (we can imagine them as splendidly furnished bedrooms, perhaps) in your Quarters, expandable by dealing with the proper NPC. I immediately took advantage of the maximum party number allowed outside simultaneously to create Kate, Fredrick, and Alexander Fitzwiffletoff-- Fighter, Wizard, and Scout, respectively. Customization is extremely limited. No sliders for faces or body types here. You're allowed to decide name, sex, class, and which outfit to wear. A little disappointing, but those familiar with the Korean style would know not to expect any frills.   Wait, did I just say frills? Expect lots of frills, only the literal kind, that ruffle or pleat or whathaveyou on fancy dresses. This game is pretty and it even knows it. Andre, a fashion designer (costumes for levels 70ish plus...), in the town of Reboldoeux (one of your earliest destinations) is constantly alluding to the cuteness of your family-- bishi is definitely applicable here as well. Victorian flair, even at times a little bit of Lolita-informed style for the girls, indicates, if not frivolity, then at least a sense of being very well-off and ready for tea.    Within the plot, though, it makes perfect sense. You're an old military family sent to Granado Espada by the Queen of Vespanola to make things ship-shape. The colony is experiencing some tension, perhaps even turmoil, due not only to monsters (which abound) but also various political sources-- if not governmental (Republican vs. Royalists! Does this sound familiar?), then religious (Solioto's cult vs. The Church). In addition to helping the inhabitants of the new world, for example, make fabulously fresh and delicious Carbonera, you'll be taking care of (i.e. decimating) the various beasties of the land on behalf of many folk, including the Office of Pioneering Support.      Before you can be fresh of the boat, though, you have to...get off the boat. Your first task is, amusingly enough, to find some rum for your captain to drink. Attempting to remind him of his responsibilities (steering the boat?) won't get you very far, so it's best to just succumb to his weakness.    This is also as good a time as any to explore what's going on in your classes. Fighter, Wizard, and Scout (effectively a healer) are the ones I picked to be exceedingly typical. I wanted to experience the Sword of the New World take on the classic mix of strength, magic, and recovery, and it didn't disappoint. Other classes include the Elementalist and Musketeer, but there are also a number of character options collected during play as cards. For instance, after defeating a tenacious little munchkin named Ramiro in a duel outside town, he gave me his card and I am now free to create a boy who looks exactly like him (called a Ramiro) as a member of my family. Boxed copies of the game include a unique character accessed with a code as well.     The class system goes far deeper than it might seem at first because of the ridiculous number of stances for each class. For example, my fighter, Kate, has-- if you can imagine-- seventeen (!) ranging from hardcore defense to even harder core offense depending on what weapons she has equipped (which in turn depends largely on what level she is and whether she has read the proper training literature, which can sometimes be found, but also bought.) Fredrick (Wizard) and Alexander (Scout) have six and five stances, respectively, so that rounds out to a total of twenty-eight different sets of moves to unlock and master (accomplished not only by knowing what they do and when to use them, but also by using up skill points when you level.) All this complexity translates to a system that is not terribly accessible for unaccustomed players, especially once you factor in all the hotkeys, with a row for each member of the family.      On the upside, the UI does a pretty great job of handling the barrage of information. Menus for each individual character pop up in their column above the health bar, experience information, stance selection, and move buttons with a simple click off another little button. It's all very compact and things go pretty smoothly in that respect.   So we're off the boat. The Fitzwiffletoffs are in the thick now-- this first ~thick~ being outside the gates of noob central Reboldoeux. Here cavorts a veritable plague of six-monsters salad. In fact, that's the case pretty much everywhere you're sent to fight. It's a sea, a horde. It is rare to be fighting less than three at a time. Fortunately, with three family members wailing on them, everything tends to fall in about a second or two, leaving drops such as various metals and jewels to be used for crafting or the exceedingly handy mango, which replenishes 200 HP for your whole lot.    The sorts of missions you can expect are varied, but more than half of them are ~Kill 150 X~. Quests of this type are most commonly given by ~Pioneering Monuments~ spread throughout the new world as guideposts to explorers. The idea is to find the statue, get your orders, and wade into the wriggling mass of baddies to have at it. And...have at it. And have at it. (Grind much?) Having at it! In fact, I'm having at it as I write this thanks (well, we'll see) to a system of commands that leaves players at times feeling less than involved in what is going on.      On the one hand, it's great to have a system to control all your present kin at once. It's great that I can tell them to ~Defend~ and they stay in a general area defeating any monsters that come near with their regular attack. I can also tell them to ~Hold~ so they won't move at all, but still attack incomers. ~Harvest~ is possibly the most useful, since it orders everyone to pick up all your loot on the way to a spot you click. The problem is it's just not much fun. When something like 2/3 of your fighting experience consists of finding a spot to sit and letting your characters do their thing, you begin to either feel like a cheater or like you'd rather have a nap. If only it were perfect and you could accomplish both of those things by leaving your family unattended. Instead you'll sometimes be knocked out of commands by enemy attack, leaving the party standing there dumbly until you send more orders, or the rare nasty big-bad will spawn and require your attention and probably some of those stance moves that generally go unused, or, more commonly, you'll just need to heal to keep pace with the spawns.    You get used to those. Things will literally spawn on top of you, occupying the same space, while attacking. That may seem unfair, but you quickly forget about that bother and consider it a blessing when it turns out to be your 176th (250 kill missions are certainly not unheard of) X. What's worse is trying to make your way through this enemy sludge. Traveling through an occupied area is very dangerous unless you stop every few yards to dispatch chasers. Warp scrolls are 500 Vis (Monies!) a pop, but it's worth it considering the time you spend hack-n-slashing your way through. Dying is not a huge deal, since there is no penalty except the wait time of getting up (until after the halfway point at level 51, at which point you'll have to start putting in some effort to resurrect), but it's really annoying to stand back up with half a life bar in the middle of the same mob of monsters that just stomped you seconds before.        Amidst the frightfully boring kill quests and some others so vague that they became infuriating (e.g. Find evidence of a terrorist plot at the base of this huge statue, but none of it is marked, so just wander aimlessly until you're ambushed a few times...) there are some pretty sweet instances. That is one thing that can-- and is-- generally said of Korean MMOs: you feel like you've really accomplished something when you finally do. After somehow defeating Dios Lantem behind the locked door of the temple Al Quelt Moreza (the seeming climax of a pretty intriguing and fun to unravel plot arc) you eventually learn that gasp-- perhaps all is not as it seemed! The next instance consists of helping the giant, floating Dios exterminate creepy portals that spew evil minions. Very cool, but most people would rather not grind for hours to get to that point.     Player vs. Player is certainly alive and well, and probably what many are looking forward to what with arena battles, clan fights, and scuffles between the Republicans and the Royalists. It's hard to get a feel for PvP at the moment since the game is so new and the factions aren't really established that well yet, at least not visibly. The most prevalent PvP right now, at least on the Vespanola server, seems to be straight up family vs. family duels. You can request a duel at any time by right-clicking another player. If the opposing family accepts you'll both be transported to an arena in which to duke it out. Baron servers (three of the four) intensify the PvP situation quite a bit by making it possible for players over level six to force another player to duel. However, dying in PvP as a Baron actually does incur some experience loss, so better choose your fights wisely.    Crafting feels even more optional in this game than in many others. Rather than choosing a profession, players buy recipes and take the materials to the appropriate townsperson who will then create the object for you. While this might seem like an imposition at first, it's really no greater detour than a workbench or forge, so if you find yourself loaded down with crafting supplies it's not a horrible idea to see what kind of recipes you could complete.   Despite opportunities for grouping, the community thus far is pretty lacking. The forums are full of people, but in-game it's difficult to get advice. Finding people to chat with makes the grind a lot less obnoxious, but that's a huge quest in its own right. It's made harder by the fact that, probably to disable spammers somewhat, broadcast and zone chat is limited to those who have first purchased consumable micro- and megaphones. Rather than cooling down the advertising, it just inhibits the player's ability to hook up.     You know, it's frustrating because as much as you want to like this game, unless Korean is your preferred flavor of MMO, you probably just won't. If you're on the fence there is the lucky option of the free-to-play download. Only lasts up to twenty levels with other limitations like no trading, but it's a way to test the water. After that, if you feel compelled, there's the relatively painless $8.95 upgrade and monthly subscription.  The world looks great, with interesting environments and creatively designed monsters. The area theme songs get stuck in your head, and not because you hate them. The story is engaging and the dialogue is casual, often goofy, but when you get down to it, so much time is spent in a monotonous grind that deep down you'll probably know there is more fun to be had elsewhere.", "date": "Aug 9, 2007"}