{"name": "Heroes of Mana", "name_review": "Heroes of Mana Review", "ref": "https://www.ign.com/articles/2007/08/09/heroes-of-mana-review", "text": "Whether you agree or not the truth is simple:  The Mana series is evolving, and it may never be what it originally was during its glory days on the Super NES.  Series creator Koichi Ishii (Mana's Miyamoto) has stated time and time again that he wants to continue to evolve the progress the series, moving from gameplay style to gameplay style depending on what type of story he wants to tell, and specifically the platform he is focusing his efforts on.  On GBA it was Sword of Mana, and on DS it started as Children of Mana.  Now that the team has had the time - and resources - to focus on what the DS can do Mana has again morphed, this time to the world of real-time strategy.   Oddly enough, DS hasn't had a ton of RTS titles thus far, and for a system that lends itself perfectly to the genre we were quite confused.  Apparently so was Ishii, as his latest vision is a teamed effort with his creative crew and developer Brownie Brown (Magical Starsign), and it sets a ton of standards for the genre in pocket form.  And while the game still has its flaws - some of them quite irritating at times - Heroes of Mana is a must-have for any RTS fan, and is a great first step for the DS.        Heroes of Mana sets the story in the same world and mythos as previous Mana titles, dating back all the way to Super NES.  In Heroes players will control not one or two main characters, but dozens of ~Hero~ cast members that start as a loyal crew working for the region of Pedda; an enigmatic nation of the world known as the ~Ancient Kingdom~ by outsiders due to their impressive use of sorcery and lack of diplomatic relations with the outside world.  After an early plot twist the game changes dramatically, as the young protagonist Roget bans together with his allies Yurchael, Qucas, D'Kelli, and Gemiere in a search for not only justice across the lands, but also answers to inexplicable questions about Pedda's past.   Story specifics aside Heroes of Mana is a very straight-forward RTS title for anyone who has played games like Warcraft or Starcraft before.  Based on the mission you'll control either a small group of warriors (like Nintendo's own Fire Emblem series) or actually have full control of the mission, using a ship known as the Nightswan to create structures and units for battle.  Game control is remarkably intuitive, as it takes the depth and strategy of PC RTS titles and makes them DS-friendly.  For starters, all buildings are actually built (and remain) inside the Nightswan, so the the battlefield remains open and uncluttered no matter how evolved your tech tree is.  With the simple tap of an icon you'll go into the Nightswan, be able to tap on open building zones, and construct the units of your choice.  Once they are made a simple tap brings up the different types of characters you can create, including the ability to cue up to five units of the same type at once.  The system is easy to use, and extremely fast.   On the actual battlefield more DS-specific innovations are made, and many of them are absolutely essential for a dual-screen RTS.  Commanding troops is as simple as tapping on the unit and tapping again on the intended target, be it friend, foe, resource, treasure, or specific spot on the ground.  If you want to grab multiple units simply use the free-hand tool by tapping an icon - which in turn freezes time - and draw any shape needed to encompass all desired units.  Once a circuit is  created time returns and the units are yours.     Unit management is also a breeze because of the automatic unit grouping, which allows you to hit small bottom-screen icons to immediately select all of the same type of unit, including ground, air, ranged, heavy, hero, or special.  As a final must-have aspect to DS play Heroes of Mana has fully-incorporated a ~swap screens~ button that can be used both in battle and in menus.  Tapping this icon simply swaps the screen and allows for full touch control across both display zones, be it equipment management or fast-scrolling with the mini-map.  Master this technique and Heroes of Mana will become amazingly intuitive.    Along with the high points of the game, however, come a few plaguing issues, and if Heroes of Mana sees a sequel Square Enix would do well to keep these low points in check.  For starters, the game is relatively slow.  Even with the game speed cranked to its max we found that it was still a bit too sluggish at times, and while we needed the extra seconds for micro-management when learning the game we later desired far more speed.  As another large gripe - one we've been seeing since the game released in Japan - the A.I. can be a real pain, as characters often take extremely odd routes to destinations or show command issues when engaging enemies.  At rare times units won't attack an enemy that is attacking them without an explicit command, and often units will stray from the pack, attacking enemies that are near the intended target.     While it's a nice touch that units in ~attack mode~ stay aggressive even when out of range of their intended target it can get to be a pain as well, as Heroes of Mana implements a full strength/weakness system around ground, range, heavy, and air units.  One unit is always dominant over another, dealing double damage and taking only half in return.  If one of your moronic party members attack a stronger unit, they'll be decimated in a matter of seconds.  This may not happen often, but when it does it can be extremely annoying.        For the most part though, Heroes of Mana does a great job on the battlefield.  Combining the quick unit management with the speedy economy handled entirely off the field was a great choice, and there are awesome little additions to the game found in nearly every mission.  Simply walking the map can uncover hidden items, the Nightswan can unhook and fly about the battlefield like a mobile base from Starcraft, Hero units have two special skills - one active when on the field, one active when not on the field - that add a ton of strategy to the game, and gigantic special attacks actually trigger in-level animated FMVs to show off huge world deformations and grand, mission-changing results.  All of this production value still manages to amaze us even after putting in dozens upon dozens of hours with the game, and it's really a testament to just how devoted both Ishii and developer Brownie Brown were to making a true DS real-time strategy.   Aside from the in-battle elements and overall control Heroes of Mana tells a pretty strong story, and has a ton of production value as well.  Story is told through classic character art placed over hand-painted backdrops, with additional dual-screen artwork sprinkled throughout.  The best way to describe the actual character design would be a mash-up of classic Mana work, Brownie Brown design in something like Magical Starsign, and a dash of Lupin III.  We're a fan of the style, and the fully-animated sequences that are intertwined during key story points make Heroes of Mana not only a solid game, but a pretty involving piece of Mana mythos.  It's deep, it can be convoluted, but the game includes tons of library notes on all the characters, concepts, and storylines, so if you're out for an engaging story and some RTS action it should definitely satisfy.   As a few final notes on the overall product, Heroes of Mana does a few things right, and a few things ~not so right.~  Aside from a 24 chapter main game (we'd estimate it at about 20-25 hours for hardcore gamers, more for RTS newbies) there's also 40 single missions that can be played outside of the main game.  These open up as you fight your way through the story, and act as breaks form the otherwise specific, story-based mission structure of the main game.  Also included is local wireless multiplayer, and a bit of Wi-Fi connection as well.     Sadly this game can not be played online, but instead has what ends up being a rank-based leaderboards that can be viewed and updated whenever connected to the Nintendo Wi-Fi Connection.  If you want a serious game of one-on-one, you'll need a friend with a copy of the game.  The game performs beautifully in multiplayer (we've seen no major hiccups), but the lack of true online multiplayer is, in our opinion, a huge loss for this game.  With titles like Luminous Arc (turn-based strategy) on the way that have less production value, story, and gameplay than Heroes of Mana, but support full online it's going to be interesting to see which title people support in the long run.  Online would have been the icing on the cake, and instead we only hope that Mana's evolution waits for one more RTS before continuing on to the next iteration.Heroes of Mana may not be the true Mana game you've been waiting for, but its obvious at this point that series creator Koichi Ishii has different plans for his franchise, and they include a grand, year-by-year evolution of the product.  The creator teamed with developer Brownie Brown to create something truly unique on DS, and in a lot of ways this trail-blazing RTS is a huge success for the platform.  The game still has a few issues, including some moronic A.I. at times and a lack of online play - something we wouldn't have dared ship the title without - but it also has a ton to offer players who haven't had the chance to dive into the genre yet on DS.  The presentation is great, the fully-animated sequences are simply beautiful, the music is captivating (not as much as something like Final Fantasy, but still pretty impressive), and for the most part the gameplay is intuitive and downright fun.  For anyone willing to put up with a few annoyances Heroes of Mana delivers a great pocket RTS experience plain and simple, and with a deep story, diverse cast of characters, and a pretty remarkable amount of depth it's a no-brainer for strategy fanatics.  It isn't the franchise you remember from over a decade ago, but Heroes of Mana proves one very important element of Koichi Ishii's philosophy: The gameplay may change, but the soul remains.", "date": "Aug 9, 2007"}