{"name": "Crazy Taxi: Fare Wars", "name_review": "Crazy Taxi: Fare Wars Review", "ref": "https://www.ign.com/articles/2007/08/10/crazy-taxi-fare-wars-review", "text": "Few videogame memories can live up to the time I kicked Adam Brown's teeth in at Crazy Taxi.   Y'know Adam, right? Great guy. Graduated from Purdue. Anyway, back in our high school days, Adam and I were in love with a little machine called the PlayStation 2. One evening, we were hanging out with some friends in my basement when he blew the dust off of Crazy Taxi and started talking trash about how awesome he was at the game. I hadn't played in months, but we popped it in to shut Adam up.   I beat this boy senseless. I was Crazy Dashing in ways this kid couldn't even comprehend and racking up Class S licenses like SEGA was giving 'em away. In the end, he dropped his controller and bowed his head in defeat.   Boo-yah.     SEGA is intent on creating memories similar to the Adam Brown Massacre with the release of Crazy Taxi: Fare Wars this week. The title takes the original game as well as its sequel and crams them onto one UMD featuring ad-hoc/single-system multiplayer, a plethora of mini-games, the ability to save replays, record storage and -- best of all -- customizable soundtracks.    If you somehow missed the glory days that were Crazy Taxi's arcade/Dreamcast/PS2 run, the game revolves around you recklessly piloting a cab, picking up fares, dropping them off as quickly as you can and repeating the whole process. The money you make from the trips -- there's a regular rate meter, but going up on two wheels, performing insane jumps and drifting around corners will earn you wallet-fattening tips -- will act as your score. If you're dropping folks off fast enough, you'll get time added to the constantly counting down clock. When the time is up, the number of passengers you served and your monetary haul equate to a license and rank. Compete for a specific amount of time or as long as you can keep time on the clock.   I'm Halle Berry! It sounds (and is) easy to get into, but once you get the hang of adjusting your air freshener and slamming into walls to facilitate turns, you'll start to master the tip-grabbing methods and your own personal route. See, fares range from close, easy jaunts (they'll be people with red icons) to long, difficult journeys (look for green icons). Making the most out of your remaining time means having to pick which is more important: some easy bucks or some additional time. Picking up a green fare with 12 seconds until game over might not be the best move.   Nothing new, right? Well, you're kind of right. Yes, Crazy Taxi and Crazy Taxi 2 are the same song and dance as before (San Francisco- and New York-inspired maps respectively mixed with some balloon-popping and long-jumping mini-games), but SEGA's also added multiplayer modes. If you have a buddy packing a PSP with Crazy Taxi: Fare Wars, you two can face off in three types of ad-hoc battles. Time Trial sees which player can score the most cash in two-, four- or six-minute runs; C-R-A-Z-Y has you face off in a modified game of H-O-R-S-E where one player completes a fare and the other player tries to beat that time; and Head To Head has two drivers compete on the same map at the same time for the best score.    Have a friend but only one PSP? You can pass the system back and forth while competing in Time Trials and C-R-A-Z-Y.   Of course, Crazy Taxi is a game that hinges on being able to control your cab, and the PSP is up to the task. It'll take you some time to get the hang of holding the system while using the right shoulder button to accelerate, X to shift to reverse and circle to shift to drive, but once you find a comfortable spot, it'll be easy enough to master the buttons and weave in and out of holes with the nub -- at least in the original. Crazy Taxi 2's steering has always been a bit too loose for me.    However, the biggest highlight in Crazy Taxi's PSP debut is the addition of customizable soundtracks. If you have songs on your memory stick, Fare Wars will read the tracks and -- after enabling the feature from the options menu -- play them in game. If you don't like the track you're running around the city to, you can tap the select button to go to the next one. Including this should be a no-brainer, but many PSP titles don't. Nice work, Sniper Studios.   This soooooo crazy. Not so fast, though. Fare Wars is all the fun you remember, but it's also all the flaws. These are straight ports of the game, so anything you might have had an issue with in the previous titles will still be prevalent here. The colors are bright and the graphics look good as you pick up priests and deposit them at the baseball stadium, but textures are going to pop in as you reach ludicrous speed; braking is tough; and the gameplay tends to get repetitive.   Oh, and no more Offspring? Weak.Re-releases are never easy to review. Sure, a title might have been awesome when it was first released, but times change and game engines age. For a compilation to succeed, it needs to bring something new to the table that warrants a repurchase.For my money, Crazy Taxi: Fare Ware does this. You're getting two solid games with brand new multiplayer content, the ability to save gameplay footage and a customizable soundtrack for $30. There are tons of games out there with larger price tags and smaller feature lists.", "date": "Aug 10, 2007"}