{"name": "Metroid", "name_review": "Metroid Review", "ref": "https://www.ign.com/articles/2007/08/13/metroid-review-2", "text": "Metroid doesn't hold your hand. Later games in the series have offered players maps, and hints, and even exact directions for where to go next -- not the original. The first game, Metroid on the NES, held no such welcome help. You were alone.   It's probably that feeling of isolation, above anything else, that made Metroid so unique. The game is an action/platformer, a side-scroller that puts you in the role of galactic bounty hunter Samus Aran. You've been dispatched to the planet Zebes to eliminate the Metroids, the species of energy-absorbing alien jellyfish that are being bred by a group of interstellar rogues, the Space Pirates. But the mission won't be easy -- Zebes' underground caverns form a labyrinth of corridors and shafts. You're going to get lost.   You're going to hit roadblocks and dead ends and impassable barriers. And you're going to have to turn around, backtrack, and find either a different path or a means of blasting your way through whatever impedes you. That's the core of Metroid. Longtime fans of the series know the formula well, and it's one that works because it eases you into the adventure, gradually increasing your abilities, at a satisfying pace, over time.    When you first start off, Samus can only run, jump and fire arm cannon shots with limited range. But you quickly find the Maru Mari, which allows the hunter to roll up into a ball and fit through tight spaces. Then you get the missiles, which make red doors open and pack a powerful offensive punch against difficult enemies. Then you get an upgrade for your cannon, then more energy reserves, then better jumping ability... In other words, you get a lot of stuff, and as your arsenal diversifies and your maneuvering capability increases, more and more of Metroid's mazelike world opens up to you.   It's clear, though, that this was Nintendo's first attempt at designing such an expansive, explorable side-scrolling world. Oftentimes you'll find yourself running through a room or hallway that looks just like the one before it, and with no in-game map to help you keep your bearings, you could get frustrated. It's not a deal breaker, because the game is still a great experience, even if a bit too open-ended -- but it's certainly necessary to note for new players. Give it time, have some patience, and you'll be able to push past any initial frustration and fully explore each of Zebes' five different areas.   You may need to use the game's many well-know passwords too, because Metroid is still one significantly challenging game. How gamers back in 1987 ever got good enough to blast past Ridley, Kraid and Mother Brain in less than hour still amazes me -- but they did, and the series took off from there. It can be tough to revisit this first adventure of Samus with its stiff controls, dated graphics, and lack of any in-game navigational assistance. And, inarguably, games that came later in the series improved spectacularly on each and every aspect of this original. But Aran's first 8-bit mission still has the nostalgic power to keep players coming back, and that's the most important factor of all.There will be plenty of gamers, even longtime and dedicated Nintendo fans, who may decide to pass checking Metroid out. And that's not because it isn't worth the money, but because this first Metroid has just been so prolific in other releases in recent years that there may not be a reason to go back to the original NES cartridge. You could unlock and play it on the Metroid Prime GameCube disc. You could unlock and play it on the Metroid: Zero Mission Game Boy Advance cartridge. You could even buy it as a standalone cart for GBA, by itself, when it came out as part of the Classic NES Series for that system a few years ago. But if you don't already own it or haven't experienced it at all, it's a must. You'll see how the series established itself in exploration, in isolation, and in never holding your hand.", "date": "Aug 13, 2007"}