{"name": "Blast Factor: Advanced Research", "name_review": "Blast Factor: Advanced Research Review", "ref": "https://www.ign.com/articles/2007/08/13/blast-factor-advanced-research-review", "text": "Blast Factor: Advanced Research is the latest expansion pack from Bluepoint Games. The expansion provides additional content to the original Blast Factor title, a PlayStation Store game, which has already been complimented by the Blast Factor: Multiplayer Pack. So with the second expansion pack now available for purchase, how has Blast Factor changed since its first release back in November of last year? Ultimately, you're looking at a much better game, with residual flaws from the first two installments. And although it's disappointing to see that some problems have been left unchecked, the Blast Factor experience, if we may call it that, has undergone some serious improvements, making it a far more enjoyable game.   Advanced Research is, essentially, a revamped version of the original Blast Factor, an arcade style shooter with a biological twist (very similar to Geometry Wars). The controls remain entirely the same and the game feels exactly as the previous titles feel. In other words, those of you looking for a radical new experience or a mind-bending change in the fabric of Blast Factor space: you're out of luck. This expansion pack, like its predecessor, will only be appetizing to fans of the ~series.~ The differences, however, are noticeable and certainly appealing. For a meager $4.99, Advanced Research gives you seven new specimens to fight through - specimens that boast a refreshing redesign of the biologically influenced backdrop - so now, in your quest to defeat the maniacal horde of Mother Nature's worst, you needn't stare at the same dull, blue-cell background with nothing but hexagonal arenas to work through.   That's right, Advanced Research introduces new shapes! All kidding aside, the fact that the cell shapes are now varied is a plus, and the changing colors and patterns of the backgrounds make it, visually speaking, far more palatable. However, this game is still simple looking, but the more colorful specimen designs are absolutely welcome.   Click here to watch ~fighting the boss~   So, with Advanced Research installed, here's what happens. At the main menu, you're given the option to choose between the standard fares: New Game, Practice, High Scores, etc. However, after Selecting New Game and opting for Single Player, you're now given the ability to choose between Basic Research, Advanced Research and Hybrid Research. It is in this seemingly simple selection that Blast Factor reaches its highest potential thus far, since you can now play whichever mode you want (with however many players you want). Selecting Advanced Research throws you into the new series of cells with new enemies, bosses and level designs. Fortunately enough, you can still play through the entire original game just by selecting Basic Research. And to top things off (a.k.a. ~the icing on the cake~), Hybrid Research alternates between Basic and Advanced Research specimens, giving you a taste of both games during one playthrough. These various options are also fully available for cooperative play, and (of course) the Grudge Match option is still present.   Advanced Research, besides the aforementioned graphical facelift, pits your mighty little machine up against a variety of new opponents. Some examples include new armored units, new Platelets that are resistant to both your Repulsor and your ~wave technique,~ as we like to call it, and even a robotic unit that traces you with a laser sight, appropriately dubbed the ~Tracer.~ There are also the new Bouncers, Big Blasts and the Swarmers (they're like schools of viral fish!) to speak of. While these new opponents do force you to work even harder to stay in good health, the returning lack of weaponry makes dispatching them somewhat boring. It would be great if a host of nice weapon upgrades and new techniques brought more variety and creativity onto the battlefield, but sadly, that's not the case.   Another noticeable change is the absence of the Bonus cell, which has been thankfully replaced by the Survival cell. For those of you unfamiliar with the term, the Bonus cell was a cell level in the original Blast Factor that gave you a limited amount of time to destroy as many pink units as possible, resulting in a menagerie of fireworks.  It's not like we're against crazy fireworks or anything like that, certainly not. But the Survival cell is way more interesting. After progressing through the first few cells of a specimen, you come upon the Survival cell, which throws wave after wave of enemies at your miniscule ship. Surviving the wrathful swarms grants you Life Protection, which preserves your survival bonus after you die. While this incentive is certainly worth fighting for, we had more fun with the Survival cell because it provides you with the opportunity to go ~all out~ without fear of death, since getting blown up within this particular cell doesn't subtract from your current stock of lives, it just means you miss out on the Life Protection. Groovy.   Would it hurt if there was a fiery explosion in your cell? Perhaps. We were able to play through the entire Advanced Research ~campaign,~ and although it only took a few hours (curse that final specimen), the level of difficulty was appropriate and we came away feeling satisfied with the experience.  However, there are still problems that remain nestled within the game's mechanics. Enemy spawning is still an issue, since there is very little time to physically move out of the way when new Platelets are brought into the cell. There have been far too many times where we'll be mopping the floor and all of a sudden a single, infuriating Platelet spawns right onto our ship, regardless of how quick our reflexes are. While this becomes less and less problematic as your skill level increases, it can still be wholly aggravating.   Unfortunately, there are a few other problems that should be brought to your attention as well. The first is that, while each specimen now has a song to go along with it (music being a major weak point of the previous installments), the new tracks are generally just a series of drumbeats and sound effects, which leaves a lot to be desired. And although there are two new boss designs for Advanced Research, they are very similar to one another and they just alternate throughout the seven specimens. It would have been infinitely more satisfying if there were new boss types for each specimen in the game.Although this is certainly not a perfect shooter, the two expansions have made Blast Factor into a much more robust and enjoyable package. Fans of the original should absolutely pick this up, especially for just $4.99. For those of you who havent played Blast Factor before, itll end up costing you almost $20.00 to get the full game and the two expansions, which may be a little pricey for such a simple title. However, the new content and multiplayer modes raise Blast Factor up into a much more respectable realm, so if you feel like getting your hands on a good shooter, and you dont want to wait for the upcoming PSN title Everyday Shooter to come along, go and grab Blast Factor; youll probably enjoy it.", "date": "Aug 13, 2007"}