{"name": "Typing of the Dead", "name_review": "The Typing of the Dead (Import)", "ref": "https://www.ign.com/articles/2000/04/25/the-typing-of-the-dead-import", "text": "If you think you've seen everything there is to see in gaming, you're wrong - if you haven't tried out The Typing of the Dead, that is.  Sega has created possibly the weirdest game ever, a title that's so unexpected it defies logic when one tries and figure out the frame of mind of the individual at Sega of Japan who said ~Hey, we'll make a typing game, and make it fun.~  The Typing of the Dead is the kind of game that, like Dance Dance Revolution and Beatmania makes people look on as you play, and with good reason: you're killing zombies with precise key strokes!  Who wouldn't be intrigued at the prospect.  Well, it turns out that many initially scoff at the idea.  Afterall, we've all used typing tutors before, and they were anything but fun.  The Typing of the Dead does manage to be enjoyable, though, and the fun lasts beyond the deceptive novelty phase.  I'd go so far as to say that the game is even more enjoyable than its lightgun brother, House of the Dead II.  And yes, upon making the discovery myself, I was just as surprised as you probably are right now.  For the uninitiated out there, let's go over the basics.  The Typing of the Dead, in its arcade mode, is pretty much identical in content to 1998's House of the Dead 2, sharing all the levels, graphics, animation, and crappy voice acting.  The difference is that instead of blasting zombies with your Sega / Mad Catz / Interact brand light gun, you type the zombies to death using your Sega-brand keyboard.  As zombies and the various other baddies appear on screen, a little window containing text in both Japanese and Roman form appears in front of them.  Type the phrase associated with the creature, and you'll blast him back to the grave.  Take too long, and the zombie will either attack you, or you'll miss the opportunity to kill him.  Weaker zombies require that you type smaller phrases, some being single letters in length, while stronger zombies, including bosses, have you typing multiple phrases formed from upwards of twenty letters, including hyphens, dollar signs, and the dreaded YEN symbol (this is the only thing that gets in the way of using an American keyboard, but I encountered it only once, so there's little concern over compatibility).  It's certainly a weird idea, and while it may seem like a dry concept for a game at first, you have to play it to fully understand why it's so fun.  First off is the obvious humor value, which comes about due to the game taking itself seriously.  The characters don't wield guns.  Instead, they have keyboards strapped to them like one of those modern-day office-space-saving gadgets.  I guarantee that you'll be on the floor when you see how your comrades fight off the zombies just before the level two boss.  And oh yeah . . . if you're wondering how to reset the game using the keyboard, just pretend you're using a computer, and the answer will come to you.  Beyond the humor lay a surprisingly intense title.  The rush you get when a zombie approaches as you frantically type away is incredible, especially when you realize that all you've really been doing is typing out a Japanese phrase.  The boss encounters are particularly intense, as some bosses can only be struck under certain conditions (the second boss, whose target heart region closes off periodically is an example).  When the boss is immune to attack, the typing window goes gray, and you need to wait until the window suddenly becomes active.  During the wait, you'll find yourself reading through the upcoming letters, trying to memorize as many upcoming key strokes as possible.   Sega's clearly put a lot of thought into taking The Typing of the Dead beyond just the mere novelty of typing your way through House of the Dead II.  There are secrets to be found in every level, including power-ups that transform you into a zombie, or transform all characters into their big headed equivalents while giving some zombies monkey helmets.  These are all attained by blasting little placards that appear for the briefest periods of times in inconspicuous areas of the screen.  Of course, all the secret paths from House of the Dead 2 are in here, accessible by either saving a citizen or shooting a particular creature in time.  In fact, as my lightgun skills were never precise enough, I actually found myself going through different paths in TTotD than when playing through House of the Dead 2.  Above these secrets, there are lots of other surprises to be found in the game, but I don't want to spoil the experience any further.  Thankfully, you'll be inspired to play through the game once all the surprises are gone, as like any good action game, there's a lot to master in The Typing of the Dead.  Each time you kill an enemy, you're given a letter rating based on how long it took you to type his phrase from start to finish.  Getting an A rating for each enemy is difficult to say the least, especially considering that you're typing what's basically gibberish (unless you fully understand Japanese).  Beyond that, you're more prone to error when typing too fast, and your precision rating at the end of the level may be affected as a result, not to mention the fact that some enemies will strike you if you make a mistake when typing their phrase.  If you spent day after day getting an A rating in NiGHTS, you'll find a lot to do here.  It's a classic gaming formula, except you're improving your typing as you play.  Sega's also gone about including numerous modes which manage to add plenty to the game's lastability.  The fact that you can start from any level of your choosing certainly helps out considerably in your wanting to pop the game in for a quick five minute play session.  You'll also find an original mode where you can assign items to the function keys, and an awesome drill mode where you're drilled on accuracy, speed, and, my favorite, your ability at pressing special keys.  There's also a tutorial mode which explains the merits of touch typing (you MUST see this).  The only real problems with The Typing of the Dead involve its adherence so closely to the House of the Dead 2 levels and graphics.  A few extra levels or paths would've been greatly appreciated.  I also despise the Japanese keyboard for being too small.  It looks cute, but are all Japanese hands this tiny?  The game's notion of difficulty settings is also questionable.  Instead of asking that you type longer, more difficult phrases, the zombies just seem to attack more aggressively.  The difference doesn't seem to be clearly defined.  Finally, the game misses a perfect opportunity of having you toggle between enemies in mid attack, as the button for doing so, the escape key, is too far out of reach to be a reasonable option.  There's certainl some room for improvement in the gameplay.  But then again, I don't think you'll find me complaining too much, as The Typing of the Dead is such a unique experience.  Everyone out there ought to give it a try, even if you've played through House of the Dead 2 like myself.  Thankfully, Sega's ensured that the game is more than just a novelty, giving us secrets to discover and skills to master.  Unfortunately, I'm not sure if I can necessarily recommend that you import the game without knowledge of Japanese, as there's a boss encounter that's nearly impossible to get by otherwise (it's the boss of the third level, where you fight the snake guy with three heads - you're only allowed to attack the one head whose phrase is the response to a question posed to you at the bottom of the screen, a difficult thing to do unless you can read Japanese).  If you've enough Japanese knowledge to put up with this (you can usually guess correctly by reading a couple of phrases in Katakana), or if you don't mind not being able to get through one of the levels (remember, you can skip the level if you like), then this is a must-import title.  Let's hope that Sega of America gives the game an American release.  -- Anoop Gantayat, IGNDC", "date": "Apr 25, 2000"}