{"name": "Mega Man Star Force: Leo", "name_review": "Mega Man Star Force: Leo Review", "ref": "https://www.ign.com/articles/2007/08/14/mega-man-star-force-leo-review", "text": "In 2001, gamers around the world were introduced to a great experiment by Capcom, one of the world's foremost video gaming companies. What if they were to take one of their most famous gaming series - Mega Man - and cross it with the ever-thriving RPG genre? General agreement in the gaming world was that the resulting Mega Man Battle Network was a great game, for Capcom's experiment executed the hybrid formula with great skill. Taking advantage of the Game Boy Advance's hardware and interesting, innovative styles of gameplay and fighting, Mega Man appeared to have turned the corner in the 21st century. The classic series was dead, the X series was becoming stale, and any other 90's spinoff, such as Mega Man Soccer or Mega Man Legends, garnered little attention and fanfare apart from the keenly-interested.   Sadly, it only took Capcom a handful of years to beat the Battle Network series into the ground. They stumbled upon a great formula with the first three titles in the series (which crescendo in quality much like the original series did with the first three titles), but quickly overdid it. While there was little doubt there could be many better ideas than crossing the Mega Man series with an RPG environment, the series was overdone, and by the fourth installment, the series found itself tired and without steam. Capcom released a total of six installments of the series (the latter releases were split into ~editions~ much like the Pokemon series), but the series was gaining few new fans while retaining only the most hardcore Battle Networkers. The innovative qualities that got Battle Network into the homes of so many gamers had disappeared like smoke up the chimney, and for one reason only - the series refused to change. The status quo was kept. Things got boring.   There was great excitement, then, when Capcom announced it was going to walk away from the Battle Network series to try their hand at a completely new and different Mega Man RPG. This new series, starring a character named Geo Stelar, would take place hundreds of years after the events of Battle Network, and would retain an RPG style while assumedly walking away from the redundancy of the Battle Network series. Furthermore, the game would appear not on the Game Boy Advance, but the far more powerful Nintendo DS, creating a buzz of anticipation amongst Blue Bomber loyalists. With a story revolving not around the internet and Net-Navis of Battle Network fame, but devices called Transers and mystical beings known as FM-ians, there appeared to be true change on the horizon. Even when it was revealed that the series would draw many parallels to its Battle Network cousins, hope was not lost. But now that the game has been released, hope can indeed be lost with due haste. Much like the last half of the Battle Network series, the all-new Mega Man RPG, entitled Mega Man Star Force, manages to miss its mark completely. Instead of leaving the gamer satisfied with his or her experience, it's more likely to leave the gamer mystified, feeling positive they've been down this road countless times before.      The old saying ~familiarity breeds contempt~ rings true here. Mega Man Star Force feels like the same, stale Mega Man series gamers had to deal with in the Game Boy Advance's dying days, leaving us scratching our heads and wondering why the title wasn't named Mega Man Battle Network 7. Aside from a mildly remixed story that is essentially as arbitrary and dumfounding as the latter Battle Networks', and a slightly enhanced (but otherwise identical) fighting system, Star Force is the de facto continuation of its GBA brethren. And that's not a good thing. Series like Castlevania, which has appeared en masse on Nintendo handhelds since the GBA's release, can get away with this brand of operation. After all, that series represents the pinnacle of what a game can be while changing little and keeping the gamer unusually satisfied. Mega Man-inspired handheld games were begging to be changed a long time ago. Unfortunately, that change still hasn't come.     Anyone familiar with any Battle Network game, from the original to the sixth, will feel comfortable understanding what Mega Man Star Force offers them, in almost every respect. After getting past the initial gimmicky feel of having to choose between three nearly-identical versions of the game (Dragon, Leo, and Pegasus), the gamer will be confronted with a title which is heavy with redundancy. None of the problems which the Battle Network series suffered from, such as its linear feel, trite storytelling and awkward and sudden difficulty curves, have been addressed, though the battle system has been somewhat revised, bringing it into the realm of DS 3-D. It's hardly impressive, and the basics of battle are the same (based on battling with cards known as Battle Cards... the same idea as Battle Chips in Battle Network), but at least something has changed.   Since the main character Geo can cross with his FM-ian friend known as Omega-Xis in the ~Wave World~ (a world unknown to most humans), there are two main characters (just like Battle Network's emphasis on Lan and Mega Man.EXE). Coincidentally, when Geo and Omega-Xis come together, that character too is called Mega Man. The Wave World is the alternate world gamers are expected to ~pulse in/out~ of to fight enemies in random encounters, find various malicious EM viruses, and ultimately continue the linear storyline. This is in many ways identical to the internet you were expected to ~jack in/out~ of in - you guessed it - Battle Network.    If the Battle Network references are becoming mundane at this point in the review, then just imagine how mundane the experience with this game is. Other than scattered and sometimes-clever DS touch screen features, the ability to temporarily summon Mega Man.EXE from your Battle Network games by putting one of them into the GBA slot on your DS, and some nice, colorful graphics, Mega Man Star Force is going to leave you longing not for more, but for something else entirely. In-game features like the convoluted BrotherBand system (which allows you to friend other real life gamers and NPCs alike), ample WiFi functionality (to battle other gamers, e-mail, et cetera), and cross-version differences between the Dragon, Leo and Pegasus (which are minimal and rely primarily on which ~version~ of Mega Man Geo and Omega-Xis morph into) aren't enough to save this game from mediocrity.      Ironically, those unfamiliar with the Battle Network series, or those absolutely enamored with the series are the two groups of people most likely to enjoy this game outright, even though it's supposed to be an entirely new series. After all, the battle system is trite to those who have dealt with game after game of battling with cards in an alternate world, but it could be exciting to those who haven't experienced it or can't get enough of it. If you're not on those two extremes, however, your best bet is to stay far away from Mega Man Star Force. We expected more than a mild change from the status quo when new Battle Network games came out, and we definitely expected more than a mild change when the Battle Network series was supposed to die off in order for a new Mega Man RPG to begin. In both cases, our expectations weren't met. But there's definitely a more lasting disappointment with Star Force, because so much more could have been done. Whether or not the title reflects it, this game is Mega Man Battle Network 7. Does that sound appealing to you?Mega Man Star Force is a game that appeals to the extremes. Battle Network loyalists will find what they love here, and gamers ignorant to the style and feel of Battle Network games could also find an RPG worth playing. But everyone else in between is going to be bored with the title. There's not enough of an RPG foundation to keep RPG purists' attention, there's not enough action to appeal to the mainstream gamer, and the linear feel of the game will leave most gamers feeling trapped (though there are sidequests here and there). The lack of innovation and change creates a vacuum which will trap most gamers in its wake. And with such a weak storyline which weve attempted not to spoil, theres little reason to play in the first place, nonetheless keep playing. Unless you're confident this type of game is your cup of tea, your money is almost certainly better spent elsewhere. We were expecting innovation this time around, because this is a game we wanted to like. Unfortunately, we were left disappointed.", "date": "Aug 14, 2007"}