{"name": "AMF Bowling Pinbusters", "name_review": "AMF Bowling: Pinbusters Review", "ref": "https://www.ign.com/articles/2008/03/26/amf-bowling-pinbusters-review-2", "text": "So get this: publisher Mud Duck had Atomic Planet develop a bowling game for the Wii that has plays worse and has a smaller feature list that Nintendo gives away, for free, with every Nintendo Wii system. AMF Bowling: Pinbusters is a waste of time, a waste of money, and it's embarrassing to see this game in the Wii library because it's just a pointless inclusion. If I was AMF I'd throw back what little the money that Mud Duck most likely paid for the extremely underused license.   Now, understand that the bowling that's included as one of the five games in Wii Sports might not be the most feature-filled game ever created, but it at least gets the basics right: you can bowl right- or left-handed, your progress and highest score is tracked, and you can use your created character. It's also inoffensive with its sterile, ~for anyone~ visual style.   AMF Bowling Pinbusters? Right-handers only, folks. If you're lefty you better either sit this one out or try to cope with playing with right-handed Wii remote control. Statistics tracking? Ha! Not a chance: you play ten frames, and the game abruptly ends with absolutely no fanfare. High score tracking? Not even close. Can you even use Mii characters? Nope, you have to select from an assortment of ten truly offensive stereotype characters, from stoner surfer-dude Cody to Gangsta Big Money to emo rock girl Roxy.    Fail.   These guys have some of the most grating mannerisms, both during celebration of a strike or sulking when hitting a split or dropping it into a gutter. It's laughably bad, folks  Cody lets out one of the most over-the-top ~duuuuuuuuuuuuuuudes~ that would make even 1980s Sean Penn roll his eyes. This is not a game you'd want to whip out if you want Grandma to join in on your videogame fun.    Even if Wii Sports bowling didn't exist, this game would still be tremendously shameful. The pin physics might be acceptable, but the bowling balls bounce like they're filled with concentrated helium and grip the lanes as if they were wrapped in sandpaper. The game controls almost exactly like Wii Sports bowling, but by mimicking the control of the game that everyone owns, the developers end up showing us just how much they don't get it. The team even goes as far as stealing Wii Sports' practice mode of rolling the ball around obstacles down the lane, but with the awful attention to ball rolling physics, it's not nearly as fun or satisfying.   There are only two things going for AMF Bowling Pinbusters: a variety of alleys, and one mode outside of the standard ten-pin bowling mode: Pool. Neither of these extras are game sellers, either. The seven different alleys are totally forgettable and have no bearing on the game. And Pool isn't terrible but it's certainly not a game-seller. The idea is to roll your ball into another ball, which will then, hopefully, hit the pins and knock them over.What's the point of selling a substandard bowling game on a system that gives one away for free? This game is an absolute dud: it plays poorly, it lacks all sorts of important features, and it doesn't come anywhere near the same quality as what Nintendo already includes as standard issue with every single system in North America. An absolute waste of everyone's time and money...gamers and developers alike.", "date": "Mar 26, 2008"}