{"name": "Basketbrawl", "name_review": "Basketbrawl", "ref": "https://www.ign.com/articles/1999/07/01/basketbrawl", "text": "For some reason, combining basketball with violence is a popular video game trend -- look at Arch Rivals, Bill Laimbeer's Combat Basketball, or Punkshot. Now there's Basketbrawl, a Lynx version of the Atari 7800 title, with a very similar theme. You pick your character from a fixed pool of players, each rated according to skills and health. You then play against the other team, trying to score more points before the six-minute clock runs out.  Aside from this, anything goes. Players must fight, stab, and mutilate their opponents for the ball, while spectators attack anyone who get too close. Weapons and power-up icons appear on the field, giving temporary benefits such as speed or renewed health. Your ultimate goal is to beat five other local gangs and win the championship. A password allows you to continue from a later point, while two players can ComLynx together for a team-up against the town.  Sadly, when Basketbrawl took away the rules, it also took away the fun. The problem is that neither the brawling nor the basketball aspects of this game are done well. Shooting consists of jabbing Button A and praying the ball goes in. Fight moves are limited, aiming attacks is difficult, and weapon effects have little variety. Defense is nonexistent; you can't block shots or passes, steal the ball, or resist enemy attacks. The basketball action is constantly disrupted by fights, and fight fans have to stop and score points to keep the game going.  The overall pace is frantic and confusing. You play three times against each team, first with one opponent and working up to three. Two spectators enter the field and attack players for no reason, and a third throws knives at everyone. The control buttons are used to attack, kick, shoot, and throw, depending on who has possession. But it's difficult to tell when you have the ball, and you may throw it away when you were planning to attack. In the end, there's a lot of frenzied button-pressing but very little satisfaction.  Sights and sounds in Basketbrawl do little to enhance its appeal. While backgrounds are sufficiently detailed, the main game graphics are simple, crude, and poorly animated. Throw in a very choppy side-to-side scrolling, and the game looks like a relic from the Atari 2600. The title theme music is very catchy, but the other game sounds are primitive and dull.   Basketbrawl takes an idea loaded with potential, then removes most of the excitement by combining weak sports action and weak combat action. The only thing to do is to wait a while longer for an authentic basketball game; Lynx owners may be eager for sports titles, but they're not desperate.", "date": "Jul 1, 1999"}