{"name": "Pet Alien", "name_review": "Pet Alien Review", "ref": "https://www.ign.com/articles/2007/08/16/pet-alien-review", "text": "Ability doesn't always guarantee quality, as in the case of the latest game from Shin'en, the developers behind 2005's well-received DS shooter Nanostray. Pet Alien features polished 3D graphics, solid controls, a variety of game modes and a wacky cast. The problem is that none of it is remotely interesting.   Based on the Cartoon Network animated series of the same name, the Sokoban-style puzzle game puts gamers in control of five different aliens, each with its own puzzling ability, on a quest to collect all the gems in each level before hitting the exit door. Dinko can run fast, even against the flow of conveyor belts. Gumpers is a big dumb lug that can pound through ice blocks and cracked walls. Flip can Yoshi-float over obstacles. Swanky can push or pull crates around. Scruffy can squeeze through tiny openings and flick out its tongue to collect distant gems or trigger switches. The five playable characters balance the game's puzzling well and rarely overlap; there's no way to exploit the game and, say, power through it using two or three aliens instead of all five.   What's problematic however is the overwhelming repetition of the game. Comprised of 80 levels, Pet Alien offers puzzle quantity but not much else. All five aliens are unlocked in the first few levels and while there's a slight increase in difficulty as the levels progress, it's not nearly enough. Essentially the game is the same two minutes over and over. Puzzles are functional but rarely clever. Rather than requiring constant or time-based swapping between aliens, each level is broken into leisurely chunks that the player can often tackle in any order.   This is the pinnacle of excitement in this game. There's only one type of enemy in the game, a floating robot that must be led into mines in order to destroy it. But aside from a few crates and moving platforms, the levels are pretty lifeless. If this were a cell phone game, it might be passable but on DS the whole experience feels half-assed. The solution to every level can be deduced in a few seconds, and from that point each level runs on auto-pilot. If an alien does touch an enemy and dies, the level is immediately restarted so at worst, a player will lose about 90 seconds of progress.   Level design is kept to a bare minimum with very little going on in each environment beyond the objects absolutely required for puzzling. Although there are 80 levels to puzzle through, the game doesn't require finishing them all to get through each of the game's 5 floors. So in a floor with 20 rooms, maybe only 15 are required to reach the boss and access the next floor. This is a nice design because if a player is having trouble with a particular level, they can always quit out and try another one instead. Unfortunately, the final floor requires every previous level in the game to be beaten anyway. This ends in a lot of backtracking and tackling levels substantially easier and less-interesting than the later ones. Imagine reaching the final boss in a game and being told he won't fight you until you clear all the minor enemies out of the world first.   Once per floor (five times in the game), a boss battle is encountered. The bosses have great character designs, reminiscent of bulky N64 bosses. Each boss has a weakness that requires one of the five alien abilities. However, this same weakness is used for the entire battle, and each boss only has three hit points so it's rare that one of these encounters lasts longer than a minute. Factoring in the five bosses, 80 levels and a few retries, the entire game can be beaten in around two hours.   During the course of the game a few extras unlock including a challenge mode (replaying the same levels on a timer), character gallery and five minigames. None of these are multiplayer, but given the gameplay mechanic single-player is all that makes sense anyway. The minigames are shallow diversions that involve tapping or dragging the stylus and memorization. They don't really have much to do with the main game or even the abilities of the aliens, but they pass some time. Ultimately, that's all this game feels like - passing time. Nothing stands out, nothing's memorable and a day after this game is beaten it will be completely forgotten.   When they're not developing their own games, Shin'en composes music for a dozen other developers and publishers. So it's surprising that the audio here is so lifeless and uninspired. Visually, the game is a mixed bag. The 3D character models are well-designed and don't suffer from being too angular like most 3D characters on the DS tend to, but the sparse environments and bland menus definitely reduce the impact of the visuals. Fans of the show will be disappointed to find that the protagonist, 13-year-old Tommy Cadle, barely makes an appearance in this game, having been kidnapped in the opening scene. At first glance, this game appears to be pretty solid. Its got balanced gameplay, an abundance of levels and several modes of play. But actually puzzling through the levels gets boring very quickly and little has been done to keep things interesting along the way. This game has no heart and while nothing stands out as being particularly bad, nothings particularly memorable either. Puzzle fanatics who have exhausted the DS library might enjoy this game, but everyone else (including fans of the show) should move along.", "date": "Aug 16, 2007"}