{"name": "Fatal Fury: Battle Archives 1", "name_review": "Fatal Fury: Battle Archives Volume 1", "ref": "https://www.ign.com/articles/2007/08/16/fatal-fury-battle-archives-volume-1", "text": "There is one indomitable fact that we must convey to you - a fact that far exceeds the importance of any other piece of information we have in our possession about this particular title. And though it may not seem to be exceedingly relevant, in the grand scheme of things, we can assure you that the urgency in reporting this to you is paramount: Geese Howard is a complete bastard. With that said, we can breathe a sigh of relief and get back to our review. But for those of you who don't know Geese Howard, fear not, you will by the time you finish this article.   While Fatal Fury: Battle Archives Volume 1 may be a somewhat convoluted title, it is, essentially, a compilation game. Throw the disc into your PS2 and you have the ability to play direct ports of four classic arcade fighting games: Fatal Fury, Fatal Fury 2, Fatal Fury Special, and Fatal Fury 3. And while four games on one disc may sound like a pretty nice deal, you should keep in mind that Fatal Fury 2 and Fatal Fury Special are just about the same, only the ~Special~ edition has more playable characters available and a few extra features here and there. So standing back, you're looking at a suggested retail price of $14.99 for three/four old fighting games. Cool, right?    Almost. Putting the value of the package aside, let's look at its contents. Battle Archives is put together pretty well, barring some issues with keeping the game in 16:9. With the set we were using (a Samsung LN-52352W), the screen would go black once you selected a game to play, if the display was left in 16:9 mode. Although we tried it out on multiple televisions of the same model, the same problem kept popping up. Although this may just be an issue with one particular television type, keep in mind that you may need to change the screen size if you're having problems getting started.   Besides that, the actual organization of the compilation is smooth. The main menu is stylish and clearly lays out all your options for you, with the four different Fatal Fury titles prominently displayed on top, and all the technical stuff on the bottom. There's even a character editor for manually changing the colors of the character sprites in any of the four games. This was a cool feature, and although it's purely aesthetic in nature, it was still fun to play around with. But the games are what matters here, and we can tell you this with confidence: old Fatal Fury games don't exactly serve as the pinnacle of the fighting genre.   He's got a wicked kick. The basic formula is typical: with each game, you select a difficult level, a character from a roster (that drastically varies in size), and then play through a series of fights with virtually no story to guide them, save a few dialogue quips with little relevance. A second player can join in at any time, either for some cooperative play (in the first Fatal Fury) or for some standard matches. However, when it comes to the individual games, know this: the original Fatal Fury has not aged very well. Poor graphics and audio are completely forgivable, given its age, but poor controls are an entirely different matter. The game mechanics are loose and somewhat unresponsive. And while normal combat is generally not a problem, executing special moves is incredibly challenging and painfully inconsistent. We're intimately familiar with 2D fighting games, and yet we had a great deal of difficulty getting the hang of pulling off special moves. Even now, I personally have a successful attempt only three out of four times.  For veterans of SNK games, this may not concern you, but newcomers will find move execution to be quite frustrating.     What's more frustrating, however, is the difficulty level of the Fatal Fury games as a whole. Most noticeable to us though, is the final boss of the first Fatal Fury. And that boss is Geese Howard. You may remember us mentioning him at the beginning of this article, and for good reason. He's almost physically impossible to beat. We played on the easiest difficulty level at first, and even then, the game leading up to Geese was invincibly frustrating and unbalanced. But when Geese strode into the arena, well, that began an epic event here at the IGN office. By the time twelve different IGN folk attempted to beat him, over the course of sixty-two continues, we only had six non-sequential, one-round victories to show for it. I was finally able to bring him down, but only after resorting to the cheapest, most absurd tactics possible - and then it was easy. So clearly, there's something very wrong with the AI in this game (but that's a legendary trait of the Fatal Fury series).   The other games aren't much better in light of the difficulty. Fatal Fury 2, Fatal Fury Special and Fatal Fury 3 are all very hard to beat as well. And while challenge is certainly not a bad thing in itself, the amount of a challenge that the easiest setting delivers shouldn't be as much as it is, especially when (in the case of Fatal Fury 3) it was one out of eight difficulty levels. So if you're interested in this game, be prepared; it's really tough, but it can still be rewarding in the long run, especially if you're dedicated to winning.    Fatal Fury only has three playable characters, each with a handful of moves. Fatal Fury 2 and Special have a more impressive roster, with eight and sixteen fighters respectively. Fatal Fury 3, however, only has ten to choose from, though there are three unlockable characters to try out as well. Battle in the four games is what you'd expect from an old 2D fighter; it's simple and relatively shallow, with about five special moves for each character to spice things up. And while there's really nothing else that sets these games apart from their competitors, Fatal Fury is one of the first fighters to feature a ~two-plane~ system, where you can shift between the background and the foreground with a touch of a button (although the first Fatal Fury didn't allow you to control your location, you just followed your opponent). While it's neat to have this option for slightly more complex combat, the two-plane system doesn't add too much enjoyment to the experience as a whole, but it doesn't take away from it either (except in the first game, where it was super cheap).   When it all comes down to it, we found Battle Archives to be pretty fun to play, despite the serious shortcomings of the early titles. Since I'm way into 2D fighters, it was a real treat to experience the early years of a famous series. Fatal Fury 3 was easily the most enjoyable though, since the characters were fleshed out, the two-plane system was refined, and the character sprites were easy on the eyes. Although some slowdown could be noticed when the fighting environments were destroyed (the standard breaking of pots and walls), the game played well and special moves were much easier to execute. Most importantly though: Battle Archives offers us a great diversion from the now commonplace 3D fighter, which is refreshing.    That's right... it's the Burning Knuckle!!! We could spend more time talking about the games as individual titles, but at the end of the day, this is a PS2 compilation, and we should treat it as such. Generally speaking, SNK Playmore did a fine job in porting the classic Neo Geo titles onto the PS2, since each game is an almost exact replicate of its arcade counterpart. The controls transfer well to the Dualshock (besides the inherent looseness), and you can jump back to the main compilation menu at any time during gameplay. The graphics and audio are as good as they can be, considering the originals, and having four old-school titles at your fingertips is admittedly fun.Fatal Fury: Battle Achieves Volume 1 is, first and foremost, a title for SNK enthusiasts who don't already have the original games. If you follow SNK's characters, then you may like seeing the veritable birthplace of Terry and Andy Bogard, and their fellow fighters. And the price of $14.99 is a pretty nice deal, no matter how you look at it. Although, if you happen to already own the games that are contained within this collection, in one form or another, there's really no need to buy them here, since they're just straight ports with no real extras to speak of. In the end though, this is a neat collection, but the games themselves aren't the best around. But if you're a diehard fan of 2D fighters, we recommend picking it up. In the meantime, you'll have to excuse me. I'm going to go practice my Burning Knuckle!", "date": "Aug 16, 2007"}