{"name": "Ecco the Dolphin", "name_review": "Ecco the Dolphin Review", "ref": "https://www.ign.com/articles/2007/08/17/ecco-the-dolphin-review", "text": "SEGA has one true icon: Sonic the Hedgehog. But if there is a runner-up, a second place winner in the Genesis beauty contest, it would be Ecco the Dolphin. Ecco's first venture onto consoles, a unique underwater 2D adventure, was loved by fans and critics alike. At the time of its release, Ecco was seen as a thinking man's platformer that had challenging action elements and an intriguing storyline. So who can blame some gamers for being excited to see Ecco's first adventure arrive on XBLA? The good news is that the original game has been preserved. The bad news is that it's no longer fun.   I'm not one to ask for my hand to be held during a game, but Ecco gives almost no clues as to what the hell you are supposed to be doing. Had I not beaten this game a dozen times as a kid, I'd probably have never figured out which way was up. The opening level is a perfect example of what to expect throughout Ecco. You are a fun-loving dolphin who happens to have odd markings on your face. You're just hanging out, swimming in the sea. You can attack some jellyfish, eat a snack, and talk to fellow dolphins. And then you'll start to wonder, ~Okay, now what?~ To progress the story, you have to leap out of the water. And not just any leap, you need a high leap that gets you near the top of the screen. When you do this, a strange force sucks up your family leaving Ecco all alone. How do you know to make this jump in order to initiate the start of the game? You don't. That's Ecco the Dolphin.    Despite the frustration of rarely knowing what you're supposed to do, Ecco still has its moments of brilliance. This is a challenging adventure game that is, more or less, an underwater platformer. You'll need to deftly maneuver Ecco around traps, charge into enemies to damage them, and solve puzzles to save the day. For some, the controls will be a frustration. Being in the water, Ecco needs complete freedom of movement. But you can tell Ecco swims on an eight-point track. This results in some poor precision in your aiming. You'll think you have a dash lined up perfectly, only to find Ecco askew and slamming into a barrier. It's not the game's fault, really.  This is a 16-bit title and it's just how it was back then. But newer gamers might lose patience with Ecco.   This is not a game for the faint of heart. Even without some minor control issues, Ecco is a tough game. There are plenty of predators in the deep looking to do Ecco harm. And Ecco is a mammal, so despite this being an aquatic adventure, the little fellah needs to surface for air frequently, adding another layer of challenge. Not only do you have to worry about navigating through treacherous underwater areas full of traps, but you can't take your time because you need to find a place to suck in some air. Things get tougher once you hit the final three levels. In ~The Machine~ the world is always scrolling, pushing Ecco forward as you quickly dodge obstacles. This is not for the weak.   Once king of the sea, Ecco shows his age on XBLA. Ecco's charm still resonates after all these years. This is a story about a dolphin saving the world from aliens. Yes, aliens. In order to save his pod, Ecco must travel back in time before the alien harvest. Amazingly, this is still more believable than the plot to Independence Day.   Backbone Entertainment, the team tasked to port the majority of Genesis classics, can't be expected to provide any major updates to an old title like Ecco. But it's still the team's responsibility to make sure everything outside the game is worthwhile. And that's where Ecco the Dolphin fails on XBLA. There's no historic perspective on Ecco, no classic art gallery, no video interviews with the original designers. And the Achievements may just be the worst I've seen for an Arcade title. One Achievement requires that you beat the game three times without dying. Three times! It's hard enough to beat Ecco once without dying. Who thought that playing through three times to perfect was worth 20 points?   Ecco the Dolphin is a classic from SEGA. But sometimes classic's should stay in the past. For those who have played Ecco before, there's really no reason to come back to it. There are no extras offered and the Achievements are junk. If you've never played Ecco, then you may want to give it a go. It really is one of the more innovative titles of its time. But, again, that time has long passed and Ecco's gameplay doesn't stand the test of time like Sonic's.", "date": "Aug 17, 2007"}