{"name": "Ghost Recon Advanced Warfighter 2", "name_review": "Tom Clancy's Ghost Recon: Advanced Warfighter 2 Review", "ref": "https://www.ign.com/articles/2007/08/22/tom-clancys-ghost-recon-advanced-warfighter-2-review-2", "text": "It won't take long for you to fall in love with Tom Clancy's Ghost Recon Advanced War Fighter 2. For me, the game sold itself when I sneaked into a bombed out house, picked off a few Mexican rebels and watched a tank explode -- complete with the screen rocking all around and smoke billowing out of a cavern.   GRAW 2 is here for the PlayStation 3, and it looks, plays and feels oh-so good.   Did you miss the title's first go 'round on the Xbox 360? GRAW 2 puts you into the fatigues of Captain Scott Mitchell. A leader in the armed forces, Mitchell is the last hope for damage control in a 2014 Mexico civil war that is nearing a protective wall separating the states from chaos. You and a team of elite soldiers -- Ghosts -- are sent in to keep the peace and protect Lady Liberty. Of course, everything goes to hell and the media ends up blaming you for a bunch of horrible things, but that's war, baby.    The story isn't what's going to keep bringing you back to GRAW 2 -- its' the gameplay. From the time you pick up the controller, GRAW 2 feels natural. From an over-the-shoulder perspective, use L1 to precisely aim, R1 to pull the trigger, tap X to take cover or reload, hold X to change your weapon's rate of fire, hold circle to switch guns, and R3 lets you use your scope if you have one.   However, that's just the game warming up. You'll use the controls to swoop in, wipe out villains and run back to your awaiting helicopter, but once you master guiding Mitchell, you'll need to begin managing your squad. Sure, you could run into a situation all by yourself, but this game is about teamwork. Using the D-Pad and face buttons, Mitchell can order the squad into particular positions, have them take cover, engage the enemy, heal each other or just hang back while the captain gets his kill on.   When you finally hit a wall in the game -- the first few hours are easy, fun missions -- you'll discover that succeeding in a given quest comes down to managing your troops. After coasting for most of the game, our unit began dieing time and time again as we tried to fend off a group of mercenaries in a church courtyard. A helicopter had swooped in to extract us, but as we approached the whirlybird, a rocket took out the tail, and the chopper spun off into the distance as the church came tumbling down.   Mercs swarmed the area. Cowering behind a concrete planter, I ordered my troops into the fight, but the well-trained enemy made short work of the exposed front. Then, the bad guys lobbed grenades at my cover until I stopped breathing.   Bastards.   The shadows are your friend. After a few more trial-and-error attempts, I found a good spot for my men to take out the bad guys while I sniped from around the corner of a building. I love it when a plan comes together.   For my money, this is one of the best features in GRAW 2 -- the ability to tackle the same objective from multiple perspectives. At one point, I was working my way through a citified neighborhood with tall buildings and narrow streets. As I came around one of the bends, several snipers began firing upon my position. I tried to take them out with the machine gun I was packing, but I ended up street pizza.   So, when the checkpoint reloaded -- these things are plentiful in GRAW 2 -- I selected to enter the battle with a sniper rifle. The outcome was in my favor this time. Once you play through one of the 13 missions in the campaign, you can replay them in Quick Mission Mode to get scores and stats on your firefights.    Changing your piece on the fly isn't limited to when you have a near-death experience. At certain points in the game, you'll have a M.U.L.E with you. This ATV is packed with bullets, health and other assorted supplies and can be summoned via the same D-Pad interface that orders your humanoid troops around. If you want a more hands-on approach and the follow command isn't to your liking, you can hold down one of the shoulder buttons and drive the vehicle yourself from the first-person perspective.    Although the vehicle can take damage, if you're hurting and need to scout ahead, taking the M.U.L.E. up the road isn't a bad idea. In fact, there's even a hovercraft called the UAV Cypher you can pilot ahead to scope the baddies.    Now, here's where the main Sony/360 difference comes in. Although you can use the joysticks to pilot these crafts, they are also Sixaxis-enabled. You can tilt and rotate the device in GRAW 2 to move the M.U.L.E., fly the UAV, make Mitchell roll and a few other actions.    Personally, I found the options useless -- especially the roll.   While the Sixaxis seemed to work fine -- if not a bit floaty -- for the vehicles, the roll was incredibly unresponsive. I'd literally have to remove my left hand from the controller and shake the device with my right hand to have the captain respond. Even then, it seemed like a crapshoot as to what he was going to do. In a game where I need to be scouting the yellow objectives on my HUD and watching for red-marked enemies, that's a no-no.   Beyond that, this port is  really good. Sure, there's a framerate stutter or two when you're in the rides to the next mission and when you're getting intel from your Mexico contact, but it's nothing to freak out about; the colors seem a bit more washed out in the PS3 version than the 360 version, but it works with the desert setting; and the exaggerated, rocking camera found on the 360 when Mitchell would run has been toned down.   Black Hawk down. As for the online multiplayer, GRAW 2 satisfies the very basic expectations of an online title. While we didn't notice a great deal of lag during our game sessions, GRAW 2's graphics do decline somewhat in multiplayer combat. This isn't too serious of an issue though, and for the most part our games went smoothly. The chat support is somewhat impressive, since our teammates voices came in loud and clear during team matches. Although as of right now, there is no visual indicator to inform you of who is speaking at any given time, making communication more difficult than it should be. We also had to wait ten minutes before each match, since the matchmaker found so few games currently in session (or so it seemed). But this will hopefully change with time as more players start gaming online.   If you own a PS3 and haven't played GRAW 2 before, you owe it to yourself to pick the title up. The controls are easy to get into, the graphics look great, and there's a load of multiplayer options. You're looking at a fun romp  through the horror of war.", "date": "Aug 22, 2007"}