{"name": "Heavenly Sword", "name_review": "Heavenly Sword UK Review", "ref": "https://www.ign.com/articles/2007/08/23/heavenly-sword-uk-review", "text": "When you think of Heavenly Sword, you probably think of beauty. From the outset Sony has ridden a tidal wave of goggle-eyed awe every time it's wheeled out its third-person action adventure to the gaping masses. For a long, long time, Heavenly Sword's been a poster child for the next generation of PlayStation gaming, with a virtually unparalleled aesthetic and attention to detail. It's only recently we've had chance to dig below that surface though and witness the game beneath that high-gloss, mo-capped exterior.   Having played Heavenly Sword in its entirety now, here's some good news: there are lots and lots of things that Heavenly Sword gets very, very right. First, and most immediately obvious, it's a truly gorgeous game. Everything from the beautifully designed, slickly animated characters to those magnificent, omnipresent sweeping vistas is a glory to behold. What's more, while your eyes are busy welling with tears of appreciation, your ears can waggle happily at some stunning effects work, the epic orchestral score and voice acting full of genuine gravitas. Without a doubt, if you're looking for a game to demonstrate the potential of your PS3 and bring your smug, 360-humping friends down a few notches, Heavenly Sword provides as much a sensory overload as you're likely to need.   If we rated visuals in sweets, Heavenly Sword would be a 200-foot sherbet fountain.  As you're no doubt aware by now, there are three main components to Heavenly Sword's gameplay: combo-heavy sword combat, archery (and other projectile combat), plus twitch-style Hero sequences. Undoubtedly, the feather in Heavenly Sword's cap is its incredibly elaborate swordsmanship. Once the titular sword is in your possession, you've got three possible 'stances' to select from - Speed, Ranged and Power - easily switched via the shoulder buttons, plus a two-flavour attack using a combination of square and triangle buttons. You've also got dodge assigned to the right analogue and the occasional use of Superstyle moves via circle - these unleashing devastating strikes once you've sufficiently built up your combo counter.   It's an incredibly competent set-up and, as you slowly unlock the countless combo moves through progression, it enables you to perform some truly spectacular - and genuinely empowering - manoeuvres. Adding to this sense of omnipotence is the frankly ridiculous number of opponents you'll be up against at any one time: from tens of enemies as the game begins to literally hundreds in the epic finale. In order to compensate for the frenetic, ludicrously overcrowded action, Ninja Theory has employed a highlighting system, with foes glowing blue, yellow or red just prior to attack - each indicating they're about to perform a specific subset of moves - and you'll need to switch to the corresponding stance ready to counter. Trouble is, it feels like a clumsy fudge to a very significant issue and, once you're besieged by the hordes later in the game, you'll likely resort to fumbled button mashing as even these highlights are obscured by the swelling crowds, making it virtually impossible to counter effectively.   Realistic facial animation is one of Heavenly Sword's crowning achievements.  It's the kind of problem that persistently arises during Heavenly Sword: throughout you can't shake the feeling that you're playing a tangled mess of brilliant ideas desperately failing to wrestle themselves free from some incredibly misguided implementation. For instance, it's a serious misstep when the strongest aspect of your game - sword play - is sidelined for almost 50 percent of its runtime. The very first level employs a massively hobbled version of the combat system which simply has none of the visceral thrill or satisfaction of the fully-fledged engine. Throw in the decision to completely remove sword fighting again in chapter three (of six, one of which is simply a boss fight), replaced by some over-egged archery, then cripple it later still with some pretty but soulless silliness, and it adds up to maybe three to four hours of decent combat in a game which takes a rather embarrassing, and distinctly un-epic, six or seven hours to beat.     On the subject of archery - and projectile combat as a whole - it's again problematic. Although neatly designed, incorporating an 'after touch' function, enabling you to steer your projectile through the air at a target via the SIXAXIS motion sensors, it's ultimately a fairly shallow addition to gameplay and quickly becomes tedious and repetitive - particularly highlighted by the fact that you'll do nothing else for the duration of the game's lengthy third chapter. To be honest though, repetition is a frequent complaint, with some genuinely atrocious pacing decisions to blame. As much as we like Heavenly Sword's basic combat, enemy encounters - without exception - play out identically every single time; you enter a small, enclosed area which is locked down until you've cleared it of opponents, then progress to the next tiny section, ready to do it all again and again and again.   You try reacting intelligently to an individual assailant in this lot.  Needless to say, unless you're seriously enamoured with the sword fighting combo system it quickly becomes tiresome and, to be blunt, incredibly boring. Smarter use of the core gameplay mechanics - that is, mixing them up more frequently to reduce repetition - would have helped tremendously. In fact, it's telling that our favourite section of the game - which sees a fairly lengthy boss encounter broken up by a desperate bid to save a key injured character with your bow and arrow as he shambles away from marauding enemy soldiers - does just that, making for a genuinely exhilarating, entertaining experience. Occasional use of twitch-action 'Hero' sequences help to rectify things briefly - and really give the animation team the chance to shine - but, sadly, examples of this design deftness are few and far between.   Worse still, Heavenly Sword is overindulgent in all the wrong places. For instance, it's all well and good having incredibly lengthy, fully motion-captured cut-scenes but, really, if you're a hardcore combo-cruncher signing up specifically to let rip with Heavenly Sword's combat system, it's pretty annoying - and demonstrates a serious lack of coherent direction - having the action grind to a halt every couple of minutes while Andy Serkis and company desperately try and get their chops around the hopelessly hackneyed, melodramatic script.   Combat's undoubtedly impressive but painfully repetitive thanks to poor pacing.  Adding to the frustration are a number of smaller - but no less cumulatively infuriating - issues: some terrible checkpoint implementation means you'll frequently find yourself replaying large sections, generally only to hit the same troublesome point ten minutes later, ready to start all over again. Inexplicably too, the apparent eight-point axis your character turns on - presumably to exert more control during heavy combat - is hugely inappropriate for navigating narrow walkways and corridors. Worse still, it makes aiming with projectile weapons in third-person view hugely imprecise - not great when certain sections demand you aim on the move.   Puzzles too never reach levels anymore sophisticated than 'bang that gong, right there', which is a shame - God of War, Heavenly Sword's closest cousin understood the power of a brief, cerebral moment when it came to keeping things feeling fresh. Sure, these are minor points, but probably not what you expect from a high-profile, triple-A second-party offering.So, all that in mind, is Heavenly Sword a bad game? No, its not  although it certainly seems that someone, somewhere, forgot to ensure they were piling those glorious peripheral trimmings on a game worthy of all that Sony gold. Combat is undoubtedly the titles strength and offers some immensely satisfying thrills when you actually get your hands on your sword. Projectile combat, too, is entertaining in its own right  although nowhere near enough to carry such lengthy sequences as is demanded here. What youre paying for then with Heavenly Sword is the grandiose spectacle, the overblown production values and the chance to show just what your PS3s capable of when given the chance. Its a benchmark in presentation for console gaming and the lavishness of the show might well be enough for you to overcome the games significant failings. Theres definitely some kind of fun to be had here  albeit of the one-engaged brain cell variety  but make no mistake: Heavenly Sword takes the age-old mantra of style over substance and drags it kicking and screaming into the next generation.", "date": "Aug 23, 2007"}