{"name": "D&D: Tactics", "name_review": "Dungeons & Dragons Tactics AU Review", "ref": "https://www.ign.com/articles/2007/08/24/dungeons-dragons-tactics-au-review", "text": "Dungeons & Dragons fans have been able to play their preferred fantasy playcraft in just about every medium imaginable, from pen and paper, tabletop dungeon crawls to card games and straight-up PC adventuring. Finally, the PSP gets a D&D adventure worth delving into - if you have the time and patience to invest.   Understand, Dungeons & Dragons Tactics takes an already complex world of Damage modifiers, base attack multipliers, armour classes and encumbrance and actually steamlines some elements, while retaining about as much depth as other games in the franchise have in the past. It's complex and arguably alienating stuff unless you're familiar with core D&D concepts. It's also not going to sate PC fans looking for a Bioware-level of depth, either.   The story, divided into acts, is your standard D&D fantasy fare; prophesies from witches, worldly destruction, and a quest to destroy the 'athearorn' a mystical artefact that becomes the driving purpose of your clan through out the game's 40 hours of questing.     The game gives you plenty of freedom to customise your party with characters of your own imagining and to your specifications. This is nothing new, of course - but Tactics introduces two new classes to the mix for those already well versed in the ways of the standard classes. In addition to Barbarian, Bard, Cleric, Druid, Fighter, Monk, Paladin, Ranger, Rogue, Sorcerer, and Wizard classes, there are two non-core classes, the Psion and Psychic Warrior. Their magic-based attack components focus on toying with minds and using indirect attacks to undermine opponents.    Alignment actually plays a more significant role than you might expect for a handheld adventure. Your stance on certain key moments in the game can be quite different depending on whether you err towards good, neutral or evil. Some decisions you make can bring your alignment down towards evil, or up from neutral, too. However, it's a heck of a lot harder to steer yourself away from a dark path once you're set on it.   The squares system belies the tactical aims of the game. It's turn-based, after all - so this just adds another level of pacing.  The overworld map is initially limited in scope; however, the more adventures you successfully complete, the more cities and other locations become available, eventually branching your path and compelling you to do a bit of lateral thinking to find the next key character or location to continue the storyline.    Being a very methodical and slow-paced game by its nature, adding a tile-based tactical movement and combat system is actually a pretty good idea. In practice, the game plays out much like any other turn-based RPG - the game automatically pauses in between decisions, allowing you to plan out the best possible strategy in a given situation.   You have to factor in a lot of different options during either combat or exploration phases. If your priority is seeking loot, you can divide your party (of between two and up to six characters) into a looting band, while sending the other half off to kill off as many enemies as they can, for instance. During your adventuring time on the field, you must factor in searching for chests for loot, since the mission ends abruptly if you fulfil your objective.    Chess Mode speeds up the animations and gets rid of non-essential breakaway moments, meaning that the dungeon crawling and land traversing takes only a fraction of the time. If you're not one for laboriously plotting out your moves and queuing your spells in anticipation for an encounter, we'd suggest ticking this box on the menu screen.   Combat is all done indirectly, through menu commands or in retaliation. There are a lot of branching menus to wade through, which can be fiddly - particularly on the PSP's screen. It's also hard to discern the abbreviations if you're in a hurry - there's a separate name bar that pops up at the base of the screen, and paying attention to it is essential.    One of our biggest criticisms is the way in which the menus actually work in-game. When you're not adventuring in a level, the overworld screen divides the menus to the far left and right thirds of the screen - which is really annoying if you're trying to read blocks of text or get a good overview of a list of items for example. The PSP's thumb-stick is massively over-sensitive, too. This makes scrolling - something that should be effortless - an unnecessary chore. We would've preferred full screens of text and accompanying images, rather than retaining a pointless image of your map location in the middle.   Reasonably good looking, but the menus and options screens and bars are a big issue.  Essentially, the game plays well enough - it's a mix of D&D, Advance Wars and something akin to Final Fantasy Tactics as well. The block-movement system works as well as you'd expect, allowing you to flank and use the world and line-of-sight to your advantage. However, trekking long distances is a pain by nature of the movement method; the game desperately needs group movements and group tactics commands - particularly for a portable with limited menu space and buttons.   To Kuju's credit, the developer wisely included a glossary of key terms in the manual and game. It's a small gesture, but it might actually be enough of an aid for newbie players who have always been curious but never taken the plunge.    Graphically, while it's clear that Kuju entertainment tried to do some interesting things with light-sources, atmosphere and magic, it's not until you start encountering the larger enemies and more ethereal areas of the game that the engine begins to shine. The PSP isn't a powerhouse, but there's a good amount to textural detail in many areas. We do wish we could pull the camera a little farther back though - the angle is somewhat claustrophobic, even when tilted with the stick. The 2D cutscenes and lack of voice-acting feels a little cheap, and there's also a lack of character development, too - which is strange, given how long the game was in development for. Couldn't the team work a little longer on creating characters we really care about a little more?   There aren't a huge number of maps, but there are more weapons and enchanted items than you'll ever get around to using, and the 4-player ad hoc wi-fi is icing on the cake if you're up for a roundtable session with mates. Load times are a little on the longish side and the music skips once in a while, but overall the game is a solid production that will please D&D fans, if not being approachable enough to bring in casual gamers. Deep, a little rough, but mostly this is palatable fantasy gaming. PC and table-top players should best steer clear, though; you'll just end up yearning for Baldur's Gate III.", "date": "Aug 24, 2007"}