{"name": "Dead Reefs", "name_review": "Dead Reefs Review", "ref": "https://www.ign.com/articles/2007/08/28/dead-reefs-review", "text": "Oh adventure genre, where did you go wrong? You used to be fluffy and fun, witty and charming, and engagingly wicked.  Now you're like the Dementors of the gaming world, sucking all the fun and frolic out of our most precious form of entertainment, leaving us with only boredom and despair. Your latest representative, Dead Reefs, only demonstrates again how far you've fallen on the PC. Not only is Dead Reefs' story withering in its pacing, but the control scheme is depressingly sad and the visuals, camera work, and puzzles are not much better.   The story, one of a cursed island with a deep history of piracy, meanders along with predictable characters, one of whom was murdered before the game begins. When Sir Amadey Finvenero, the player character, shows up to take on the investigation, the story unravels and we learn that the island mystery is a tad bit more sinister, and ridiculous, than it appears, revealed in an unprecedented twist.     That turn to the outlandish is jarringly abrupt. There's no gradual slope here, just a quick shove off a cliff that drops you into the gaping maw of madness when most of the game before it was a rather benign murder mystery/ghost story. The tale should be one of a rational man's journey into uncomfortably unbelievable territory, but not only does Finvinero not have much of an understandable transition for a character of his type, he simply falls over the edge with no real struggle leaving him transparent and dull. We're also left wondering what happened with many of the characters as several of them become suspects but then just disappear from the story never to be seen again. It's an unsatisfying ending to an unsatisfying adventure.   That underwhelming sensation is enforced by the visual presentation. While architecture is actually pretty decent and the dark mood is clear through the acceptably morose colors, character models are less than thrilling. Their movements are awkward, the lip synching is off, and the textures are muddy and bland. The most I can say for them is that in concept, they aren't bad designs. I can see how the characters, originally, could have had some personality to them that just didn't translate to a 3D environment.      Many of the visual presentation problems aren't only with the graphics. It's the animations that lack personality, cutscene direction that presents dialogue and movement as clunky and boring, and camera-work that round out the issue. The camera in particular is a real issue. There are many times, even with the option to change the camera angle, that it simply doesn't provide the view that you're looking for. Taking the adventure route of games like the original Resident Evil games, the camera angle switches while you're running around the environment with the character. This is designed to give a more cinematic and voyeuristic approach but in this case only provides headaches and awkward angles that hurt gameplay.   If it's not the video, it's the audio. Granted, the budget for the game was probably pretty small but the sound in the game is virtually non-existent aside from a semi-decent score and bland voice work.    Even with the problems of basic visual and audio presentation, Dead Reef's main failure is the insane interface. Any PC game that doesn't allow for mouse support and instead chooses to use the keyboard only is asking for trouble. Even crappy ports of console games allow for mouse control much of the time and at the very least, controller options. It's an unforgivably clumsy choice to make for any game, let alone a genre that takes advantage of the mouse to make looking for important objects and clues easier.   What makes the hunting for items worse than your normal point and click adventure is there are no hints for where items are or what's important in the environment. You're forced to use the pathetic controls to sidle up to every object in the environment to see whether it can be interacted with. Muddy environments hiding muddy objects that don't have any hint that they're objects (such as a glint or a slightly different color palette) means hard going when you're trying to find an item. One puzzle included finding a shroud in a graveyard that didn't stand out at all, which was especially frustrating since the game gives very little help about what you should be looking for. Puzzles are great. Frustrating people because they don't even know that there is a puzzle is a whole different thing.   The aggravation ends as all things do: in death. Death comes swiftly and with no warning, so save often. In some ways it reminded me of those old choose your own adventure books where you'd decided to turn to page 56 only to be eaten by a ravenous goblin.  Aside from the dark atmosphere, theres not a whole lot to say in the positive about Dead Reefs. Its a dull story that takes an unpredictably fantastic turn at the end that doesnt fit with the rest of the standard mystery presentation. Add to that some boring animations and terrible camera work and youre on your way to a below average game. But worst of all is the unforgivable sin of the keyboard only control scheme. Its painfully awkward and drives any small enjoyment in the games dark atmosphere into the murk.", "date": "Aug 28, 2007"}