{"name": "Tiger Woods 08", "name_review": "Tiger Woods PGA Tour 08 Review", "ref": "https://www.ign.com/articles/2007/08/28/tiger-woods-pga-tour-08-review-3", "text": "Just over five months ago, EA released Tiger Woods PGA Tour 07 for Nintendo Wii.  At the time of review, we thought it was odd, as EA usually followed the classic ~Our games are one year ahead of reality~ pattern, and Tiger Woods 07 was actually releasing in 07.  Fear not Wii patron, EA hasn't fallen behind, because it's still 2007, and we've got a new Tiger Woods sitting on shelves.  What can five months of development time do for a franchise that was missing so much the first time around, you ask?  The answer is not a whole hell of a lot.   Last year's Woods Wii effort wasn't necessarily a bad game, it was just an amateur effort that missed the boat in a few key areas.  On the flipside, this year's Woods Wii title isn't necessarily a bad game, it's just an amateur effort that misses the boat in a few key areas.  We poke fun at the five-month development cycle, but to be honest, Tiger Woods 08 took the extra time to implement a new interface, add a few modes, work in the token 08 improvements from other console versions, and fine tune the swing mechanic slightly -- and that's about it.  No global changes, no graphical improvements, no online, and no Mii integration.  Tiger Woods 08 might as well be Tiger Woods 07.1 because it's nearly the same game with a few basic changes, and fits the score perfectly.  Is this from 07, or 08?  Your guess is as good as ours.  That isn't to say these changes aren't for the better --  they're simply not enough to really warrant a second purchase for the avid Wii golfer.  This year's interface still makes use of clean IR control, now working in a far brighter and truly ~next-gen~ look by going with a more experimental style.  Instead of simply throwing an option tree over a backdrop, this year takes on a strange honeycomb-like presentation, having all the menus scroll up and down with a quick flick of the Wii-mote. It's better, but it isn't really a dramatic change overall becasue you'll still have access to all the main modes and game types that 07 offered.   As far as 08-specific changes go, there are a few, but they're pretty basic.  Included this year with all 08 versions of Tiger is the ~Player Confidence~ system, which works with your created player to add real-life drama to clutch shots.  Essentially the game watches how you perform in certain areas, and establishes patterns based on your specific results.  If you've got a problem hitting that clutch drop shot when the fairway favors a slight tilt to the right, your player will show visible issues with that shot, including a drop in stats, a rumbling Wii-mote, and some added heartbeat sound effects during your swing.  It really is a welcome addition to the Tiger Woods package, as it plays off your weaknesses, forcing you to make that clutch shot when both you and the computer know it's a tough order to fill.   The list goes on, including a new taunting system for multiplayer that allows local groups to manipulate player spin, air conditions, or add audio distractions while their friend attempts to take a shot.  It works, but there's no comparing it to the online and Party Mode additions of FIFA, Madden, and Live.  Throw in a few more game modes such as Four Ball, Best Ball, Elimination Mode, and Stableford and you've essentially got an 07 revision with a few changes for the better.  While we're on the subject, this year's putting system and overall in-game interface is a bit stronger, but it's really minimal overall, and something most casual Tiger fans won't even notice.  We're a fan of the new ~Preview Putt~ mode that no longer lets you perfectly line up your putt pre-stroke though, so if EA is listening, that's a huge improvement over previous versions.  Putting now takes just as much skill as driving, pitching, or chipping, and that's a major plus as far as we're concerned.   And then there's the Wii control.  This year offers three modes of play, including the classic full swing mode, a new ~sitting swing mode~ that essentially makes use of Wii waggle, and a classic mode that attaches the nunchuk for original analog Tiger control.  The full swing mode - which is of course the main attraction to Tiger on Wii - has been improved, but still isn't perfect.  This year's control allows you to successfully manipulate with fade and draw shots, adding intentional hook or slice to any shot by twisting the Wii-mote in your hand after you've centered up on the virtual ball, but before you actually swing.  Basically you line up the Wii-mote, point it straight down per the game's instructions, hold B, and then twist the remote in your hand either left or right.  Once you've done that, take a normal swing with the Wii-mote still twisted in position, and you'll hit your shot.     What this does accomplish is the true feel of putting desired action on your ball, and it's a huge help when driving and using approach shots.  What the game still doesn't do well, however, is implement swing tracking in a manner that tracks a poor shot and adds the necessary hook/slice to a player that isn't intentionally doing it.  Sure, every once in a while you'll get a token slice due to some sloppy swinging, but in order to ~accidentally~ hook the ball you'll need to crank the Wii-mote like crazy; something that we can't see anyone doing in a real situation.  What it comes down to in the end is that Tiger Woods 08 has made it easier to manipulate the ball with the Wii-mote, but still doesn't accurately portray a swing with bad form -- at least not as much as we'd expect.   The overall swing experience is definitely an improvement overall; it just isn't changed a great deal.  This time around you've got more of a 1:1 feel, and we'd actually prefer this control to something like Wii Sports, which achieves almost the same level of swing power/hit power interpretation, but still doesn't even attempt hook/slice manipulation.  This time around Tiger will follow your swing nearly inch by inch, stopping in mid-swing when you stop, or cutting off a backswing when you make your follow-through.  You could see this to a lesser extent in last year's more advanced control mode, but it's fine-tuned much more this year around.    As an added note on presentation, almost nothing has changed in the audio/video department this year.  The game still looks exactly like it did last year - which is basically PS2 quality - and we recognize the majority of the audio as taken directly from last year's Wii effort as well.  The crowd reactions are the same, the announcers are the same, game models and course detail is virtually unchanged, and there isn't a single section of the game - aside from the aforementioned interface changes, mind you - that have gotten any upgrade whatsoever.  This year's Tiger Woods is 07 with a few minor changes on the control and gameplay side of things, and remains otherwise unchanged.This years Tiger Woods effort isnt a letdown because of a lack of fluid controls or borderline broken swing tracking which  arguably  was the case last year.  This time around its a compilation of issues that remain in Tigers overall Wii effort, as the game has improved only slightly over 07, and still feels like the PS2 version with a Wii-mote add-on.  Golf is one of the easiest concepts to sell on Wii, and for some reason Tiger is the black sheep two versions running because it lacks any of the attention that its companion Wii games are getting from EA.  Theres no Mii implementation, no online, no Party Mode or Wii-exclusive mini-game content, and nothing that really shows that EA is dedicating any thought, time, or effort into the franchise on Nintendos system that  quite frankly  is built perfectly for an amazing golf experience.  If youre comparing Tiger 07 to 08, of course 08 is the better experience, but its still a far cry from what the franchise is capable of on Wii, and its pretty obvious that Tiger Woods PGA Tour 08 was a back-burner title for Nintendos console this year.  In a perfect world, Tiger Woods 08 would automatically be sent out to all 07 owners free of charge as a version upgrade, as its pretty much the same game minus all the ~launch-itis~ flaws.  We'd recommend this one to avid golf fans, but at this point itd be a far better move to just wait for 09, 10, or beyond.  Tiger is a perfect franchise for Wii; EA just needs to be notified.", "date": "Aug 28, 2007"}