{"name": "Medal of Honor: Airborne", "name_review": "Medal of Honor: Airborne Review", "ref": "https://www.ign.com/articles/2007/08/28/medal-of-honor-airborne-review-4", "text": "The valor of the men and women that won World War II is a seemingly endless fount for video games. The very black-and-white essence of the war is perfect for games, as there is no morality to discuss. The Nazis were evil, so go get 'em. Electronic Arts has made several Medal of Honor games over the last decade, and while some firms have moved on from the Greatest Generation (the upcoming Call of Duty 4 trades in Nazi thugs for terrorist thugs), EA presses on. The buzz surrounding the latest entry, sub-titled Airborne, is high, though. And the mobile game based on the upcoming console and PC shooter should benefit from some of that momentum.   Airborne on mobile takes the setting and period authenticity, but unfortunately eschews the whole paratrooper angle. You drop into the battle via chute at the beginning of each historical mission and can use flares to call in fellow paratroopers, but there is no skydiving whatsoever. It's a sad oversight (since it is implied in the actual title), but there is a substantial amount of game on the ground that makes up for the loss.   The first Medal of Honor for mobile was decent enough, although a little too paint-by-numbers for most tastes. Airborne is certainly a stronger game; it appears to be based somewhat on JAMDAT's excellent SOCOM game for mobile.   As with any and all World War II shooters, you must blast through Nazi-held strongholds. Airborne offers eight stages of Axis-bashing. Each stage offers something new, such as dealing with snipers, mortars, mines, or demolitions. You start with just a standard-issue rifle, but over time, you pick up your own sniper rifle, a trench gun, grenades, and other assorted weapons. You must use the proper weapon under the right circumstances to push through the Nazi forces. Is there no cover to take near the upcoming Nazi patrol? Use the trench gun to take them out with close-quarters blasts.   The action is well-paced. Smart level design keeps things moving, and mission length is just right for giving a little hell before your bus stop or between class. There are lots of little highlights, such as throwing a flare to call down some extra thunder or grabbing the reigns of a machinegun nest or mortar tube to give back what the Nazis were giving you.   I tested Airborne on an LG VX8600 -- it has a nice, bright screen that really makes the explosions pop. The environments are all appropriately brown and gray, with splashes of blue and red here and there. The soldiers are a bit small with limited animation, though. The audio is solid with digitized war cries of Nazis trying to bum-rushing your position or gunshots.Medal of Honor: Airborne for mobile is a solid action game with great pacing. If you haven't yet succumbed to World War II fatigue (as I suspect many gamers have), there is some good action here for those between-puzzler sessions. The game is a tad short with eight missions, but while you're in the trenches, there's certainly some fun to be had.", "date": "Aug 28, 2007"}