{"name": "Warhawk", "name_review": "Warhawk AU Review", "ref": "https://www.ign.com/articles/2007/09/03/warhawk-au-review", "text": "It seems like just yesterday that the PS3 hit shelves to be swept into the loving arms of devoted Sony fans, first-time users and the occasional vicious mugger. After a handful of excellent launch titles and an overflowing hamper of promises about quality exclusive third party software, the future was looking pretty bright. One of those key triple-A titles was the mysterious and poorly demonstrated Warhawk - a game that promised massive battles and tremendous single- and multiplayer engagement.   Two thirds of that initial promise made it into the final game. That's not bad, considering those two aspects are absolutely worthwhile and fun. Though the single-player campaign is gone, Warhawk now sits high on the list of must-own PS3 games during a painfully quiet period for the console in the lead-up to December 2007.   Warhawk's premise is very simple. Two teams of up to 16 players (siding with either the Eucadians or the Chernovans) per side can battle it out on land or air in five expansive locations; Archipelago - a bunch of floating islands surrounding a central castle, The Badlands is a dry, arid map with small pockets of townships and a main fortress in the middle, The Destroyed Capitol is exactly what it sounds like - a cityscape that has been torn apart, The Island Outpost is gorgeous, with small bases at each end of an expansive island landscape, and finally Eucadia is mountainous and heavily populated with architecture. While every player will have his or her own personal favourites, we found that Island Outpost and Badlands were the most flexible and fun maps for game modes like Capture the Flag and Nodes (essentially a 'capture the area and grow your base' mode), whereas more spread out maps suit the chaos of standard or Team Deathmatch.   The detail at ground level is impressive, given the scale of the game.  Every player has exactly the same base character and each weapon and vehicle has been finely balanced to prevent over or underpowered options. As a remake of a PSOne game, it goes to show exactly how far games have come in the last ten years, while retaining a focussed simplicity in the gameplay; that is, Warhawk does a lot, but it never bites off more that it can chew.   First of all, for Australians, the game works flawlessly with internationally hosted servers. The server list displays a predictably specific set of hosted games and conditions - from ping to map preferences - and it never takes much more than a minute to get into a game from the outset. Once you're in, there is remarkably little to no lag in games hosted in Europe or the US. This makes tracking down and participating in epic 32 player battles a joy, not a choppy struggle.   However, before you dive into the game, Warhawk gives you an initially basic list of customisable character and vehicle options to give the game a touch of personalisation. We initially didn't bother with this step - there weren't too many options from the get-go, so we delved straight into the chaotic fray instead. That said, the more we played and the more ranks we achieved, more outfits, paintjobs and details became available. This actually becomes fundamental in differentiating skilled players in combat (in addition to a small glowing stripe or badge insignia above each player's head. You also rise in rank all the way to General based on points earned during ranked matches.    The Chernovan Nemesis VTOL, currently sporting invisibility. Vicious!  You get dumped straight into a battle when you join a game. This is a strange and pretty-much unavoidable gameplay decision that can occasionally be frustrating during your first few hours with the game. More experienced players can occasionally camp at spawn points, waiting for you to get birthed on-foot as a nearly defenceless grunt. However, even with your most basic arms equipped, your soldier can be a deadly adversary, thanks to the combat blade's one-hit kill.   The weapons, as mentioned earlier, are nicely balanced. Our beef is not with the quality of weapons, such as the predictably aggressive shoulder-mounted rocket launcher, the precise and deadly sniper rifle or the vanilla assault rife. We take issue with the lack of creativity in weapon choices. The only real ground-based weapon that truly tickles us pink are the binoculars, which can be used to call in an air-strike when locked onto a target like a jeep or tank. Ever a tricky offensive tool to introduce successfully, the flamethrower is a little underpowered and the flame-spout distance is too short to be hugely effective. Optimally, we want to see a weapons and items pack released onto PSN in the near future that adds a couple more types of grenades and more interesting arms.    Hopping into a vehicle is arguably more fun that dashing around on-foot. Although your little soldier alter-ego can jump most waist-height walls, scale ladders, cling to edges and scamper around in a crouch, nothing really compares to aerial combat in Warhawk. Like almost all aspects in the game, the Warhawk and Nemesis VTOL craft are not game-destroyingly strong. In fact, they can be taken out with just a handful of ground-based artilary fire or a homing rocket attack. But because of their superior speed and handing (reminiscent of the Banshee in Halo), a squadron of craft all coordinating attacks can be devastating. Their weapons, seven in total, are also very cool. The chaff bomb makes auto-targeting impossible for those in the blast zone, and the Avionics Package renders you invisible for a short time.   No review of Warhawk would be complete without at least mentioning the Sixaxis integration. What was once a major point of difference for the title has now been relegated to just another menu option - and we're glad. Playing with motion control is haphazard at best. True, the sensitivity can be adjusted via a sliding bar, but even with the bar cranked to maximum sensitivity, you'll never feel like movement is as precise as using the sticks. On the upshot, you can free up your aiming controls and assign them to the sticks, which might be enough of an incentive to compel you to experiment. We're deeply pleased that developer Incognito left the implementation of such controls to the player's discretion, unlike a certain high-profile PS3 dragon-flight game that was reviewed recently.   Blowing another Warhawk out of the sky causes molten shards of wreckage to rain down on other players.   Warhawk also reaffirms the PS3's processing power. There's so much going on at any one time that it's mightily impressive the framerate is locked at such a buttery pace at all times. Even with all 32 players taking to the skies over gorgeous islands filled with foliage, destructible objects, buildings and excellent textural detail, the game is miraculously smooth. We also love the volumetric clouds filling the late afternoon skies, and at ground level, incidental details in cities is remarkable. It is clear that a lot of care has gone into polishing the engine and making it as fluid as possible without sacrificing too much detail. It's not the prettiest game on a technical level, but character faces and vehicle models are also roundly impressive. We're also going to give props to the sound effects and score - excellent to the point where people in our office were leaving their desks to see what the heck was going on and then hanging around to watch the melee.   There are a few issues that we'd like to see resolved in future updates. First of all, there is very little in the way of in-game help. Outside of basic how-to notes that are randomly generated at the start of matches while the map loads, there's nothing to aid newbies in the ways of Warhawk. We're sure a manual, presumably included in the retail version, could be made available from the PSN at no charge to owners of the game. Secondly, more content is always a good thing, and we get the feeling some maps and weapons are being held back solely to bolster upcoming downloadable content. While that's all well and good, the final cost of the game seems a little high. We'd like the price to get knocked down by the time the retail version comes out.   Warhawk offers one of the most flexible and entertaining multiplayer experiences in a long time. It's refreshingly fun and it's only on PS3.  At its best, Warhawk offers an everything-to-everyone multiplayer experience. Almost all areas of gameplay have been thought through logically, offering scaling map sizes, customisation options and a massive scale that begs for team tactics meetings. Each encounter can leap from a ground-only, grenade fuelled skirmish to a cars and troops, versus VTOL bloodbath in moments. It's a joy to play and there's not much else on the system that offers this kind of multiplayer experience. In fact, it's probably the best multiplayer on the system since Resistance: Fall of Man.   At it's worst, Warhawk is almost too simplistic to justify its price tag. With just five maps (albeit utterly massive) and a range of weapons that treads pretty close to generic, long-time shooter fans might wonder what the hoo-ha is all about. Of course, it would be your loss if you wrote Warhawk off as cut-price or sideshow - it's a streamlined package that gives you just enough to make it feel like a high-quality production, but the lack of bells and whistles - even in the upcoming retail version, with its making-ofs and trailers - means that Warhawk is all about great short-burst multiplayer mayhem and really nothing else. And that will either sell the game to you or turn you off completely.", "date": "Sep 3, 2007"}