{"name": "Medal of Honor: Airborne", "name_review": "Medal of Honor: Airborne Review", "ref": "https://www.ign.com/articles/2007/09/04/medal-of-honor-airborne-review-3", "text": "After a long line of disappointing games in the Medal of Honor franchise that just never could recapture the magic successes of Allied Assault, we finally get Medal of Honor: Airborne that combines high presentation values and good, fast-paced fun. While there's definitely some good entertainment value here, the campaign is short, and the multiplayer isn't incredibly deep. Still, it's a good game overall and the best game in the franchise in some time.   Medal of Honor: Airborne takes a different approach to World War II shooters. Instead of starting players out in each linear level on a path where there's no variation, EA LA decided to let us choose where to start each mission by throwing us out of a plane. Once floating in the air, it's a matter of steering the parachute to the best location to start the fight. Where the best location is depends on how you want to play the game, a mechanic that certainly is useful if you want a challenge or find that it's more fun to start out in a certain place on a map. It also provides an opportunity to drop into a new location if the previous one was a little too difficult or even complete one of the five different skill drops (drops in very specific areas).     A compass will show the way to the various objectives so that it's easy to steer in the right direction. It's also nice to be able to land on the high ground to get a good view of the action and shoot a few enemies before jumping down. The main problem is that in some of the missions, landing in those high positions doesn't really mean much. Because of the way the game is structured, enemies will continue to re-spawn in the area of objectives so that the challenge remains consistent. In order for enemies to stop spawning, you'll have to jump down and advance the action yourself. It is possible to kill enough enemies quickly that friendly troops will be able to move forward, but that didn't happen often.   While there's a lot of choices to make about which direction to run and attack a problem from, some of the freedom provided by the paradrop is an illusion in some of the levels. Some of each level's objectives end up forcing you down a direct and linear path like a corridor shooter. It's not necessarily a bad thing since a lot of the action is fun, but the paradrop can sometimes end up feeling more like a gimmick rather than a revolutionary way to approach a shooter.   The level design is pretty good though. Each of the objectives will require some adjustments of tactics and movement. You'll find some of the levels are much more open than others but all definitely have a different feel, good defensive emplacements, and lots of increasingly difficult enemies. I can't help but feel there were some more missed opportunities to stir up more frenetic chaos by implementing bigger weapons or more enemy and friendly vehicles pounding it out. The near constant infantry vs. infantry combat is fun, but a little more variety couldn't have hurt.     When you do fight against vehicles, it's not really very satisfying. Tanks will only drive in circles around track and halftracks are only used to block entrances in the last level and can't actually be blown up. Why even put Panzerschreks in the level if they're not for blowing up the halftracks? Why make it so that they can only be stopped by killing the machine-gunner when we just blew up tanks a couple of levels ago with the same weapons?   As is the case with most EA games these days, the presentation values in Medal of Honor: Airborne are quite good. Everything from the menu system to the mission briefings has been given attention. Each mission starts inside the hold of a drop plane flying over enemy territory full of soldiers in your squad chatting with each other, cracking jokes, getting shot, screaming, and finally, jumping out of the plane. There are some terrifically animated moments in this confined and terrifying metal tube as the plane gets shelled, engines explode in fire, and other soldiers start dying.   Falling into a level is a great way to get a quick lay of the land before the real battle begins. The levels have a lot of great detail to them in the architecture, especially those levels in towns that have been shelled (such as in Operation Market Garden) and seeing the well-modeled soldiers running around shooting at you and at each other definitely sets the mood.   The illusion begins to break down when you land and find that the levels are actually very static. While there are some terrific explosive effects and dirt fountains from grenades, rubble stays attached to the ground, buildings stay upright, and the only noticeable use of physics is in the way models interact with the environment. I'm not necessarily asking for completely destructible environments here (I'm sure that creates a world of trouble for level design), but some level of interactivity would certainly have added to the believability of the levels. It's also a little frustrating that there's basically no ballistics model. Soldiers often hide behind wooden slats and boxes that would be easily chewed up by almost any of the weapons in the game especially at close range. You really shouldn't be able to duck behind a wooden fence to avoid being destroyed by an MG42.    It's probably more annoying because the weapons feel and sound really good. While no guns in a game can (or should) accurately represent the deafening crack of a real gun, it's a treat to hear a good gaming version of that thunder. The right sounds added with the right amount of recoil can help make a shooter much more fun and the guns feel that much more real and powerful, which EA has done an admirable job of here. Helping to make the weapons even more fun are the upgrades that can be acquired through use. Every time you deal damage with a weapon, you'll gain a little bit of experience eventually resulting in an upgrade. These aren't just cosmetic, they're very useful and make each of the guns much more powerful, which in turn makes you want to get them. Comparing the unequipped Thompson at the beginning of the game with a fully upgraded Thompson with a 50 round magazine, pistol grip, and barrel stabilizer is like night and day.      Occasionally, using these weapons can be a treat against the AI, who will often use cover intelligently (though will also run mindlessly at you), but these good moments tend to come more in the linear sections of the game. It's the open nature of some portions of each level that seem to create some confusion causing enemies not to respond even when you're shooting them or just stand out in the open away from any cover though this isn't to say I haven't seen AI acting smartly in more open areas.    One of the most annoying behaviors comes from friendly AI. I can't tell you how many times I've been shooting at an enemy or getting ready to throw a grenade only to have a friendly AI guy step in front of me. When shooting, it really only makes the friendly AI bark a curse or two at you but if you throw a grenade and it bounces off the stupid guy's head back into your lap, that's a real problem, especially if you've cooked the grenade so there's no time to run away.   The mix of enemy and friendly AI creates some fun quasi-squad interactions, but it also creates some ugly situations in more open areas where they often run right by each other in the open, basically stand on top of each other without fighting, or resorting, way too often, to hitting each other with their weapons instead of pulling the trigger. If I were running into a room with a Thompson or an MP40, I don't think my first reaction would be to run across the room (or an entire courtyard full of enemies, as I've seen happen) and try to beat the enemy with it. I'm pretty sure I'd pull the trigger. In fact, I always did in the game since melee combat does very little comparable damage.     The length of the campaign also may be an issue for some of you. My first time through took around 7-8 hours on the PC and second time through only took about 5-6. If you're an accomplished shooter fan, you'll definitely want to turn the difficulty up to high so that your entertainment doesn't end too quickly.   I found that the game was a bit more difficult on the 360 though that may have been relative to my mouse and keyboard skills. The higher difficulty of control also means that the game will take a while longer to complete (depending on your skills with a controller), and also means that you'll likely have to use a more deliberate pace than you might if you played the PC version where scoring headshots are much easier to pull off.   Increasing replayability is a big thing these days so Airborne does come with multiplayer, though the focus is definitely the single-player. Multiplayer action certainly has its merits and is ultimately fun, but it's not the incredibly deep experience that can be found in so many other games. What is there is some fast-paced action with some fun weapons in some small and frantic levels. You'll find your standard deathmatch modes, but the most interesting is certainly objective mode where players have to capture flags in the Battlefield style. There are only three flags around each level and capturing all of them means a win. As usual, the mechanic helps focus the action around certain locations. The most unique part of the MP equation is the ability for the Allied troops to parachute onto the battlefield. It helps create a paranoia that'll have your head on a constant vertical swivel. Any of the games can be played with or without weapons upgrades and can support up to 12 players.Medal of Honor: Airborne, while not perfect, is definitely the best game in the franchise to come along in quite a while. It may be fairly short, but those hours are pretty much one non-stop battle with Nazi Germany throughout the various paratrooper campaigns from World War II. The levels are designed well and provide a few different environmental challenges that shooter fans should appreciate. The weapons feel and sound good as well and dropping into each level from the sky adds some interest and replayability through occasionally the feature seems more like a gimmick than something to change shooters for all time. The shiny coat of EA presentation covering all aspects of Airborne certainly help with the enjoyment, but there's not quite as much variety and interaction that we're becoming used to in top-tier shooters these days.", "date": "Sep 4, 2007"}