{"name": "Coinundrum", "name_review": "Coinundrum Review", "ref": "https://www.ign.com/articles/2007/09/05/coinundrum-review", "text": "The stories some developers concoct for casual games are so silly you are almost forced to like them. In Coinundrum, an alien coin crash lands on earth and uses his cloning techniques to imbue our pocket change with life. With the assistance of our newly self-aware pocket change, the alien coin can escape back to space. But the nefarious Dr. Dinero might have something to say about the exodus of laundry machine money. Can the coins finally cash in on their dreams of freedom?   The tale is totally goofy, but also completely functional in the context of this simple puzzle game. Across several stages, you must stack coins by pressing OK with a sliding marker lands in the center of a circle along the top of the screen. If you are off, the coin still drops on to the rising stack, but the danger meter along the side of the screen registers instability. If the meter tops out, the stack falls and you have to start the stage over.   It's a simple mechanic that works better than I ever expected it would. After the far too easy first and second stages, I was concerned the entire game would end up a cakewalk. However, when Coinundrum decided to turn up the juice, I was hooked until I finished the final stage and got these coins off to the cosmos.   There are a variety of items in the game that both help and hinder your efforts. Coin multipliers drop either three or five coins at a time on your stack. This is extremely useful when trying to reach a specific goal, such as a 30-coin combo or a 200-coin stack, but if you're off-target when you drop the multiplier, you fill up the danger meter. Magnets make sure the coin drops directly on the stack no matter what. Hearts slightly decrease the danger meter. A hand allows you a few seconds to physically tap coins back into place along the height of the stack, reducing danger.   When dropping coins, watch out for hitting shoes that speed up the target. If you're lucky, you can hit a turtle that slows the cursor back down. A cloud blocks temporarily turns the target cursor invisible. A lock prevents you from making a move for a few seconds. These dastardly pick-ups are tough business in the stage where you must stack more coins than Dr. Dinero, who is dropping change on his half of the screen at the same time. These power-ups also work during another stage where you actually play as Dr. Dinero and poke coins out of a stack.Coinundrum is a silly little pleasure that I actually played from one end to the other in one sitting. There was no hesitation when hitting the ~play again~ option after watching my stack of coins topple. But once it was over, I was through -- and that doesn't always bode well for value. There is a free play option that just lets you stack to your heart's content and a two-player game where both players hover over the same phone, but the heart of the game in the main story. It's a cute ride while it lasts, so get the game on a subscription and stack it up for a couple hours.", "date": "Sep 5, 2007"}