{"name": "Pandemonium!", "name_review": "Pandemonium Review", "ref": "https://www.ign.com/articles/2007/09/06/pandemonium-review", "text": "With the advent of the PlayStation and the Saturn, video games firmly stuck both feet in the third dimension. Pandemonium is a relic of the transition between 2D and 3D, when developers futzed and fussed with polygons to create worlds that scaled, swirled, and offered vantage points that a traditional side-scrolling game could not. Needless to say, not all of these games have necessarily aged that well -- and Pandemonium is one of them.   This is not a damnation of Pandemonium. It is completely competent platformer with some then-dazzling visuals that have made an admirable transition to mobile. (Since I started covering mobile games in 2002, the industry has jumped from Game Boy to PlayStation -- quite a feat.) The mechanics are a little hoary. You spend the majority of the game running left and right, negotiating ledges with tricky jumps while fending off occasional enemies and collecting treasure. The control inputs of today's handsets aren't necessarily ideal for precision jumps, though, so roughly half of Pandemonium's game play will push your brow into a furrow.   You have control over two characters in this fantasy world: Nikki or Fergus. Nikki is an acrobat that can perform double jumps, which makes her infinitely more useful than Fergus the jester. Fergus can cartwheel into enemies, but since so much of the game relies on scaling heights and crossing chasms, the jester fades to the background fairly quickly. Avoiding enemies -- save for the large boss encounters -- is actually an easier way to push through the game.   There is quite a bit of content in Pandemonium. If you tour the kingdom, you'll visit eleven different realms. Whether you actually see the whole world is debatable. Missing jumps due to slippery controls and a sometimes-unstable framerate is not necessarily a recipe for fun. It's too bad that you're almost dared to keep playing, because Pandemonium is actually a looker. I tested the game on an LG VX8600. The colors are straight out of the era where skies were always blue and the only gangs in games were gangs of meddlesome Goombas. The camera, when not chugging, sweeps along your path, showing off a nicely constructed world.  Pandemonium begs to be played with an actual game controller -- the mobile controls are just too slippery to make the precision jumps required for an old-school platformer like this. (The old N-Gage edition actually handled better.) The sorta-3D look is slick, but it serves only to dress up a basic plaformer -- and cellphones actually host plenty of well-done platformers, even if they are in 2D.", "date": "Sep 6, 2007"}