{"name": "Bug Too!", "name_review": "Bug Too! Review", "ref": "https://www.ign.com/articles/1997/04/10/bug-too", "text": "Bug Too! isn't much of a sequel as it is an extension of the original's gameplay; and not much has changed from a year and a half ago.For those of you who loved (and had the patience for) the original, you'll probably like this one. But dive beyond the cuteness and uniqueness, you'll find some problems that make this 3D platformer somewhat boring and not much fun to play. For starters, Bug Too! introduces two new main characters, Maggot and Superfly. Other than the individual animations, these characters aren't much different than Bug.All characters can run, jump, and butt-slam enemies, but the specific character traits aren't revealed until their powerup is grabbed. Since that happens later in the game, and since the game is really tedious you might not make it that long. Not to mention the developers attempt to be cute and witty comes off being cocky and annoying.Bug can only exclaim ~Boo-ya!~ so many times before you just want to rip his adorable little head off. Mostly, though, the game's difficulty and level design is way over the top. It's extremely hard to line up your character to jump onto an adjacent enemy, or figure out which paths are open or closed.As well, many levels cannot be completed without specifically losing a few lives -- there's no way to know whether some areas are traversable without sacrificing a few Bugs. Because of this, you'll have to play the games many times just to advance a few levels further. The graphics aren't much different from the first Bug!, so don't expect too many new effects.There are a few surprises, though, including a dizzying corkscrew through some of the later levels. But again, you're going to need a serious amount of patience to make it that far. Only if you found yourself somehow enjoying the original Bug! should you remotely consider this purchase. It's a nightly rental, nothing more.", "date": "Apr 10, 1997"}