{"name": "Cyberball 2072", "name_review": "Cyberball 2072 Review", "ref": "https://www.ign.com/articles/2007/09/07/cyberball-2072-review", "text": "Just think: In only 65 more years, we'll be watching gigantic robots play football with a live bomb. Rather than cringing when we see a quarterback take a blindside hit, we'll cheer when a wheeled running back misses the first down and explodes into a cloud of plastic and metal alloys. Failure will not be tolerated. It's going to be so much more exciting than Battlebots could ever hope to be. Until that day, we'll just have to play Cyberball 2072 which has made its way to the Xbox Live Arcade.    Cyberball made a few console appearances back in the day, but it made its biggest splash in the arcade where multiplayer robotic football was all the rage. The game can hardly compete with the 2Ks and Maddens of today, but Cyberball was pretty darn advanced for its time. Everything from the on-field view to the play calling setup and little situational challenges will be familiar to modern day players, which is either a testament to how well Cyberball was designed or how little videogame football has changed over the years.    Cyberball 2072 can't hold a candle to modern day football, but it does have something that Madden doesn't -- robots. And robots are always cool. Cyberball also makes a few changes to the standard football rules to further spice things up. Robots don't get four downs to make it ten yards. They carry a bomb that slowly heats up before exploding if it isn't defused. To stop the bomb, you have to cross the 50 yard line or score a touchdown. If you don't make it, the ball detonates and takes the ball carrier with it. There are a few other subtleties such as a 6 period game, money that can be used to upgrade and repair damaged bots, and an accelerated clock, but the main draw is the bomb. It sounds a bit trite, but stopping your opponent short and watching them explode never gets old.    And that same exact thing that makes Cyberball great is also this version's biggest pitfall. Your opponent will always be the computer. You can play the game co-operatively with a friend both offline and on, but you can't play head to head against another person. The standard Cyberball cabinet in the arcades had two screens and allowed you to play head-to-head with another person or team of two. Why Midway and Digital Eclipse decided to emulate the single screen version of Cyberball is a huge question mark. Who wouldn't want to play this game against an actual person rather than being forced to play the AI? Nobody, that's who.   But if you're willing to make the computer your perpetual foe, you might be able to find some fun. The Game Breakers challenges are tough as nails, but a nice way to waste some time. The game is predictable enough to be fun for those who know the game of football, but also wacky enough to keep less informed players interested. Now, there hasn't been a big graphical update and the sound is as boring as ever, so the game does show its age. But if you want a cheap football game to pick up and play for a few minutes here and there, you could do a lot worse.   Online play on this release is hit or miss and depends greatly on how good your teammate's ping is. We've had everything from games with no noticeable lag to those that are unplayable. It's a shame that Midway and Digital Eclipse didn't go the extra step and include the full four-player versus game. Cyberball 2072 holds up fairly well and the option to team up with a friend and take on some live humans would have made this a great arcade football alternative. As it stands, the game just isn't all there.", "date": "Sep 7, 2007"}