{"name": "Metal Slug: 2nd Mission", "name_review": "Metal Slug: Second Mission", "ref": "https://www.ign.com/articles/2000/04/29/metal-slug-second-mission", "text": "The NeoGeo Pocket Color isn't scoring a ton of big licenses from third party companies (Pac-Man, Sonic and the Capcom load excepted), so it's up to SNK to rely on its own properties to build up the system library. One of the most amusing games to release with the system last year was Metal Slug: 1st Mission, a brilliant shooter based on the NeoGeo arcade series. Of course, one good turn deserves another, so SNK released Metal Slug: 2nd Mission, another brilliant shooter in the series that's just as much an awesome, balls-out action title as the original. And more so this time because there's so much more to the game.Features:38 MissionsTwo charactersBranching pathsDigital audioOnly for NeoGeo Pocket Color2nd Mission hasn't strayed at all from the original formula  it's still a guns-blazing weaponfest where you control a lone soldier out to blow up stuff and rescue prisoners. Your soldier has the ability to run, jump, crouch, and fire weapons, and you'll need to use these skills to get through each of the game's  38 missions. The whole idea is to blast your way through the rounds, taking out the enemy soldiers and picking up power-ups  there are a bunch of cool weapons in the game, including a heavy machine gun, a shotgun, missiles, grenades, and a whole bunch more. The other task is to find all the POW soldiers lost in each of the levels  when you free a prisoner, he'll leave you a weapon power-up after disappearing offering a hearty salute. In this game, saving prisoners is a lot like collecting Pokmon  at the menu, you can see who you've managed to save for your collection. Call it your progress report.But you're not only on your feet  for some missions allow you to jump behind the controls of a kick-ass jet plane, tank, and submarine. The submarine is new to the series, at least on the NeoGeo Pocket Color. If you get killed in the sub, you don't die  you actually go to another level where you're rowing your rescue raft to safety.Also new to the series is a second character  a female. Don't think that it's just personal preference to choose your on-screen persona. In Metal Slug: 2nd Mission, whichever character you choose changes the level orientation of the game. The levels will branch out differently for both the guy and the girl, and each character can pick up different weaponry in each of the same missions. The game will also branch to different missions depending on how well you did in the previous mission. Replay value is the name of the game this time  the only thing they didn't add to the sequel is a link-cable mode. A shame, since this game would truly be killer with a second player tagging along with you.Since Metal Slug 2nd Mission has been programmed specifically for the NeoGeo Pocket Color (no backward compatibility to the Japanese-released black-and-white system), the graphics are a lot more vibrant than the first game. What's more, the slowdown that plagued the first game has been remedied somewhat in 2nd Mission  the game still slows down, but mostly when a digital sound is being played. Some levels have a bit more slowdown than others, since later levels are a lot more ~busy~ with tons of sprites whizzing by. But I honestly can't complain with the pace of Metal Slug 2nd Mission  a little slowdown is expected in this type of game, especially with all the action that's exploding on-screen. Metal Slug 2nd Mission is a killer game on the NeoGeo Pocket Color, and well worth a purchase even if you have the original. So much more has been added to the series  more weapons, extra vehicles, branching paths, an extra soldier. With all the puzzle and fighting games for the system, it feels good to plug in a mindless, old-school action game into the system. And this one is definitely one of the best. My only real complaint is in the controls  doorways become a pain in the butt since you can't shoot upward in front of them. Pushing up while in front of a doorway will put you into the next room even if you didn't mean to go there, and going back through the door will reset the enemy count even if you blew them away before. Other than this little item (and the lack of link cable support), I definitely think Metal Slug 2nd Mission is a worthy sequel and an outstanding handheld action game.", "date": "Apr 29, 2000"}