{"name": "Two Worlds", "name_review": "Two Worlds Review", "ref": "https://www.ign.com/articles/2007/09/07/two-worlds-review-2", "text": "You have to wonder why a developer would deliberately position their game in the long shadow cast by a hugely successful title like Oblivion. Sure, the market is obviously there, but it seems like such a cruel fate to thrust upon your brainchild, knowing it will be condemned to labels like ~clone~ or ~rip-off.~ Nevertheless, Polish developer Reality Pump has stepped up with a confident swagger, proud to steal from the best, and confident it can stand on its own.    It's a tall order. Oblivion wrapped a massive amount of content and overwhelming level of freedom in a package that oozed high-class production value, with an accessibility that helped lure in the console audience that had long eluded computer role-playing games. Two Worlds seems to have all the basics down, with miles of terrain and bustling cities full of more to do than you'll care to explore. For those that like to roam rather than barrel through the adventure, there's a near endless flow of side-quests to take on, and some of these have interesting consequences.    But it only takes a few minutes to spot chinks in the armor. The visuals are rife with awkward, sometimes glitchy animations and objects that just pop in, seemingly from nowhere. There doesn't seem to be any physics simulation, and there are plenty of bugs in the collision detection, so expect to occasionally see people walk through each other or pop through walls. Even worse, movement will chug when the action gets too hot and heavy, with far too many pauses that are independent of those necessary to load chunks of the world, the latter of which are understandable.    Players assume the role of a bounty hunter tasked with collecting magic doo-dads integral to stopping the resurrection of an evil god. Tired fantasy clichs are flung around like confetti throughout the awkward, Old English dialogue. Like many Eastern European-developed games, it has embarrassingly bad voice acting, too. Imagine Steven Wright at a Renaissance Fair, and you'll have a pretty good idea of what to expect.   Burn, Two Worlds!  BURN! One of the biggest flaws with Oblivion was the decision to make enemies automatically scale to your level, so that the challenge level stayed fixed. This gave you the freedom to go where you wanted, but it eliminated the satisfaction of building up your character in preparation of a long and arduous quest. Two Worlds avoids this trap to a degree. You'll find enemies that kill you in a single hit, and eventually you'll be able to crush those same foes in seconds. It's a satisfying feeling that ought to be a part of any good role-playing game, and it's complimented by a robust system for building skills, giving this game plenty of depth.   The main quest itself is very open-ended, at least after the first couple hours or so. Making progress is more than a simple matter of traveling from place to place marked on your map. Instead you'll need to take on many side-quests to build your reputation in order to make the allies you need to achieve your goals. This might not appeal to shotgun players who don't want to roam the countryside or talk to random villagers, but those that prefer a more leisurely pace will enjoy the sense of consequence it lends. Seeing sub-plots unfold and your reputation evolve can be a lot of fun.   The combat is repetitious at its best, glitch-ridden at its worst. You'll be able to dole out some nifty-looking combos, and a dodge button lets you quickly avoid your enemy's strikes, almost to the point of being untouchable, as dodging works perhaps too well against melee fighters. Simply press dodge at any moment before an attack connects, even at the last possible moment, and the avatar will slide away unharmed.   Many glitches are direct byproducts of the sloppy combat system. After clearing through a dungeon full of skeletons, our hero left a pair of gauntlets on the ground, intending to retrieve them after going topside to sell a few trinkets. Upon returning, the gauntlets had disappeared. Where did they go? Who knows. Perhaps Two Worlds' code ate them.     Much has been made of the horseback combat, a feature sorely lacking in similar games. It's nice to be able to pull out a spear and bust some skulls as your ride by, but the equestrian portion of the game controls so poorly, it's not effective to do so. In fact, I can say without hyperbole that the horse riding in Two Worlds features the worst controls I've ever experienced in a game. I realize that horses do, indeed, have minds of their own, but perhaps this is not the best aspect of riding to simulate in a game. When your horse doesn't feel he can go a certain way, he goes off on his own, sometimes heading in the opposite direction of the one you're pressing. You learn to work around this and stick to the main roads, but trying to navigate the horse through complex terrain or tight spaces is simply more trouble than it's worth.   When you are fortunate enough to land a hit, the enemies will sometimes ~teleport~ behind or to your side, an inexplicable side effect to the game's horrendous engine. Sometimes this will happen to the player's avatar instead, as a wild hit sends him flying from his horse--but he wasn't knocked down, he was simply moved somewhere for no reason at all.   As an aside, there is a surefire method to navigating noble steeds across any terrain: Get off the horse, cross the terrain on foot, then whistle. The horse will miraculously make its way to the player, even in areas it refused to traverse with a rider. It's cumbersome, but a nice alternative to taking a long way around to a desired location.   Getting around is a snap, thanks to abundant teleports all over the map. You can zip around with ease between any teleports you've passed in your travels, which really helps streamline those endless hikes that have always been my least favorite part of games like this. You'll have access to horses and other mounts as well, but unfortunately these can't go through teleports with you.    Not as easy as it looks. Death isn't the cruel fate it once was. Dying in battle will simply find back at the nearest shrine, rarely more than a few hundred yards away, with all of your possessions safe and sound. These shrines will also heal you whenever you walk within range, which can be easily abused for some cheap victories. Of course, if you're looking for more of a challenge, the Hard setting has no re-spawn.    And then there's the online co-operative play. The idea of playing a game like this with a band of buddies is an enticing one, but it might not be what you're expecting. You won't be able to just hop into the single player game with a couple of friends. The multi-player portion is like a separate game.    You'll need to make a new character solely for your online exploits. On the 360 you just get a simple chat lobby, which isn't nearly as exciting, but it gets the job done. Although the multi-player maps represent only a fraction of the size of the single player game, they're still pretty large. More importantly, they offer the same open-ended gameplay of the single player game, allowing you to explore freely and take on whatever missions you choose. You'll still get all the fun of building up your character, but you'll just need to accept that the badass you powered up in the solo game will never see any co-op action.   To really enjoy the multi-player, you'll need to have some friends committed to regular play, since finding a decent game with strangers can be a bit difficult. The 360 version doesn't have dedicated servers, so being dropped by the player hosting the match can make things very frustrating, as well. With that said, if you have reliable buddies, the online portion isn't ~broken,~ as some have declared. It's just a different approach, and in many ways it makes more sense than just dumping more players into the solo game. As long as you understand what you're getting and you have willing friends, it's a great feature.    The designers had a good handle on what they wanted and they've created a game with a ton of depth. Unfortunately, the execution is flawed. This game is buggy and unpolished, and these quirks will prevent it from duplicating the real key to Oblivion's success: mainstream appeal.The designers had a good handle on what they wanted and they've created a game with a ton of depth. Unfortunately, the execution is flawed. On both Xbox 360 and PC this game is buggy and unpolished, and these quirks will prevent it from duplicating the real key to Oblivion's success: mainstream appeal. The game has some very real issues that should not be overlooked.", "date": "Sep 7, 2007"}