{"name": "Pinball Jam", "name_review": "Pinball Jam", "ref": "https://www.ign.com/articles/1999/07/07/pinball-jam", "text": "As much as I like video games and pinball, I never cared much for video pinball games. The problem is that either the playfield is an unrealistic collection of screen-sized subfields slapped together (Alien Crush, Dinoland, Dragon's Fury), or the programmers put in ~video features~, like bosses and marble eaters (High Speed and Pinbot for the Nintendo Entertainment System). In either case, the fundamentals of pinball end up being compromised.  Now Atari Corp. has released Pinball Jam for their Lynx portable video game system. This game card contains two real Williams/Bally pinball titles, Elvira and the Party Monsters and Police Force. Elvira has you shooting targets and ramps for pizzas, punch, and water rides with the campy Mistress of the Dark. Police Force requires you to defend the Law of the Jungle against the Drug Rat, the Loan Shark, and other animal villains. The action is viewed from directly overhead, with the screen scrolling up and down to track the ball.    Pinball Jam consists of a lot of plusses mixed with a few minuses. The best thing is its high level of realism and adherence to the originals' rules and scoring. Game physics are convincing for the most part, down to the frustrating ramp shots that don't quite succeed, but the marble is a little more elastic than it should be. On the other hand, this is still not a total replacement for real pinball. Pressing the Option 1 button shakes the board, and tilts are possible, but slap saves and other complex moves are not. Still, for the time being, this is the closest that pinball purists can get in a video game system.  A few other changes have been made to accomodate the transition to a video screen. The scrolling screen follows the ball, so aiming for targets at the top of the playfield becomes harder. During multiball, the lower ball is shown and an arrow points to the location of the other. Free game specials are now extra balls, and end-of-game matches are gone. Each pinball can be played in easy or hard mode; ~easy~ gives five balls per game, while ~hard~ offers three balls and clears all lit targets after a drain. Only one player can play at a time, but a high score table tracks the top three scores for each machine.  Of the two titles, Elvira is a tougher challenge and requires good playing to get high scores. Police Force is suited for beginners, and offers many easy chances to do well. One minor risk is that players who are unfamilliar with the originals will start off handicapped. The manual documents shots and target combinations, but nowhere are they labelled or illustrated. As a result, new players have to discover where the Pizza Passage, the Hot Sheet, and other targets are before they can play effectively.    Graphically, Pinball Jam literally tries to duplicate the look of the arcade. The screen closely resembles the real games, containing everything from playfield art and flashing arrows to transparent slides and wire ramps. The effect isn't perfect, however, and the limits of the Lynx screen display are clear. Some areas are colored too brightly, and some other spots are too cluttered. The screen scrolls well most of the time, but when the balls get extremely fast, the scrolling becomes somewhat jumpy in order to keep pace.  The primary game sounds come from computerized approximations of bumpers, flippers, and other obstacles at work, which are okay by themselves. Each pin also has a selection of digitized voices from the arcade, though they are slightly scratchy and rearranged a little with the original game actions. The best sounds, though, are the number of background tunes play throughout, setting the pace and keeping things lively.  Pinball Jam is a fun game, though it cannot satisfy the die-hards who want the complete pinball experience. But for those of us who can accept some minor compromises for realistic pinball action on the go, this card is a perfect way to spend many spare hours.", "date": "Jul 7, 1999"}