{"name": "Worms: Open Warfare 2", "name_review": "Worms: Open Warfare 2 Review", "ref": "https://www.ign.com/articles/2007/09/12/worms-open-warfare-2-review", "text": "Worms don't make fantastic soldiers in real life. In fact, they really got the short end of the stick; they get stepped on, they get eaten by birds, and they end up as bait for our luxurious fishing shenanigans. However, in the world of Worms: Open Warfare 2, worms reign supreme as the best fighters around. Actually, they seem flat-out crazy to us, and who could ever forget the screams and throaty battle cries of a gun-toting invertebrate? Team17 Software has brought the newest Worms game to the PSP, and while it carries a few faults here and there, the overall experience is quite excellent and proudly sits among the better Worms games of late.   For those new to the Worms franchise, here are the basics: you control a team of worms (generally between one to four at a time) on a 2D battlefield and trade blows, using all manner of diabolical weapons and explosive devices, with another team. Each turn gives you a certain amount of time to maneuver one worm on your team, set up a shot or use an item, and then a few spare seconds to move out of the way after firing. Then control is tossed to a worm on the opposing team, who proceeds with the same protocol. Each turn cycles a different worm for control, which means if you have a full team and you move a worm into dangerous territory, you'll be waiting quite a few turns to control that particular soldier again. In other words, this is a game about planning ahead and making careful, strategic decisions.    Open Warfare 2 features a diverse set of modes to enjoy, including jumping into a Quick Game, creating a Custom Game, partaking in a Single Player Campaign or Puzzle mode, or duking it out with other players (either through ad-hoc or infrastructure mode). There are also a variety of profile editors, team management systems, level creation tools and a shop to purchase extra goodies, including new levels, helmets, and weapons. This title is extremely robust and the developers certainly haven't failed to provide an abundance of content for players to burn through. But before you enter the wormy battlefield, you'll be asked to customize your team of combatants, including their color, helmets, voices, and even victory dances (which are hysterical, we can assure you). After setting these options and walking through the tutorials, you can dive into the meat of the game, but where you start is completely up to you, which is nice. Ultimately, this game is very open-ended and allows you to work through things at your own pace, and go back to any point in the single-player campaigns for a virtually endless number of redos. Awesome.   Controlling your worms on the PSP works surprisingly well. We were worried about the control scheme, but its simplicity and precision triumph beautifully. Controlling your worm is simply a matter of hitting left or right, and changing the angle of fire is just up or down on the directional pad. Using the two triggers zooms your view in and out, which is incredibly helpful, and the analog nub pans the camera in any direction. These simple camera controls really help during combat because you'll have to aim your shots and gauge distances, angles and wind direction all the time.    Gotta' love the top-hats. The arsenal in this game is equally impressive, and features a wide range of not only serious, ~cool~ weapons, but a handful of gag items to boot. So if you're sick and tired of using a shotgun or bazooka, feel free to whip out a Super Sheep, Holy Hand Grenade, Banana Bomb or the Buffalo of Lies (yeah, things get pretty crazy). While these joke weapons may not seem like effective means for disposing of your opponents, they're actually quite useful yet balanced enough to keep the fight fair and square. The real fun of the game, though, is having the entire assortment of items at your disposal and having a completely even battle to wage. In such a situation, strategy plays a critical role in deciding the victor, and we've gone to great lengths to come out on top, including using steel walkway girders as shields, swinging down on Ninja Rope to drop a stick of dynamite into enemy ranks, and using a shotgun to burrow through the side of a cliff. Each weapon has a host of different uses and exploiting each and every one of them can lead to some very interesting face-offs.   Speaking of a face-off, the multiplayer elements work very well for this type of game. You can play with a friend nearby, or you can connect through infrastructure to battle it out online. These modes work just fine with only a minimal amount of lag, and a strategy game of this breed fits into the multiplayer dynamic very nicely, creating a lot of replay value. You can even send a small custom game to someone without the UMD, and they can use that game to play hot seat matches or square off against the computer.     Unfortunately, as we mentioned above, there are a few problems with the title. First and foremost, you have no way to save or restart a battle mid-level. Regardless of whether or not this adheres to Worms tradition, the lack of any sort of ~midway~ point really hurts the experience when you make a mistake. For example, say you spend a very long time meticulously planning your strategy and executing each turn with precision, grace and even a touch of flair. You whittle away your enemy's forces and manage to keep one of your worms in good health - well enough to easily finish off your last worm foe who only has ten hit points left. You expertly swing to the edge of his cliff, land with a nimble charm only you could possibly manage, and then line up to throw a grenade right down the measly little foxhole that your enemy calls ~home.~ Everything seems perfect, you have plenty of time on the clock, and one easy grenade toss is all that stands between you and victory. You note the wind speed, set the angle for your throw and give it just the right amount of power to send it gently down the hole. But wait. The grenade accidentally bounces off a small bump in the terrain, rolls right back to your feet, and explodes underneath your poor soldier. Although he could normally withstand the blast, the force of it sends him spiraling off the cliff and into the murky and lethal waters below. Game over.    Unfortunately, this isn't too far from the truth. Even after spending twenty to twenty-five minutes on a level, and playing it really well, making one little mistake could cost you the entire round, and you have to start from scratch, making your last twenty minutes a complete waste. Bummer. Although players could certainly exploit a mid-level save feature, which we understand, having to undergo such immense tedium really hurt the overall experience for us.   Another complaint we have is in regards to the pace of the battles. Things feel solid, for the most part, but when you end up sitting through prolonged skirmishes, you realize that combat just doesn't progress as fast as it should. The worms move at a crawl (no pun intended), the AI takes way too long to decide on an action, and there are very awkward pauses between turns. Although these sorts of hesitations may not be noticeable at first, having to see them every time you end your turn during a very long battle ends up being frustrating. Fortunately, these issues are just about the only serious faults that can be leveled against the game, since the rest of the title is nicely polished.   Someone just got dominated. Worms: Open Warfare 2 is a well-made game and deserves the attention of any Worms fan. The impressive collection of modes and customizable options, including an extensive level editor, gives you plenty of play time out of this single UMD, and the amount of strategy that stems from the weapon set diversity is stellar. Finally, Worms just has a good sense of humor and the quirky animated cutscenes are a testament to this mentality. If you want a very good (though somewhat flawed) strategy game, this is certainly one to look out for. Just be careful of Super Sheep... they're vicious little critters.", "date": "Sep 12, 2007"}