{"name": "Pixel Junk Racers", "name_review": "PixelJunk Racers Review", "ref": "https://www.ign.com/articles/2007/09/13/pixeljunk-racers-review", "text": "Come Thursday, Q-Game's PixelJunk Racers will be available on the PlayStation Store. And while there's been a painful lack of downloadable games for PlayStation owners recently (besides Warhawk), this particular title doesn't exactly fill the void in our poor, lonely hearts. In fact, it does nothing more than add to the ranks of mediocre games already available to us, though this title does have a few positive elements that may make it a worthwhile purchase for either the desperate or the ~slot car obsessive.~   PixelJunk Racers is an extremely simple, top-down slot car game where you can do one of three things: control your car's acceleration, move to the left, and move to the right (on courses with generally five tracks). That's it. You can basically get through the entire game by holding down the R2 or L2 triggers and moving back and forth. Now, the more difficult levels do require quite a bit more precision and skill, but the basic mechanics can be grasped in about fifteen seconds. Whether or not this works to the game's benefit is difficult to say, since easy controls are often a blessing, but boring controls can be a curse. PixelJunk Racers falls somewhere in between.   The setup of the game is equally straightforward. You can play either by yourself or with friends. You unlock new modes by participating in a series of single-player tournaments, which entail completing four different modes of play and progressing to the next tier. Each mode of play generally has two to three stages, so that's about twelve stages for each of the seven tiers of the Solo Tournament. That's the majority of the game right there, and you can replay any particular mode/course again in Quick Race, either alone or with a friend.    This title has thirty-two different modes to its name, though many of them are similar. Modes vary in style, and range from Sunday Drivers, where you need to weave in and out of slow-moving cars, to Balloon Burst, where you actually inflate your car at the starting line and then propel it forward by letting go of the trigger. One of this game's definite strengths is the diversity and creativity of the modes you can unlock, since they get very silly after a while. Unfortunately, these diverse game types can't quite save the core mechanics which are aggravatingly repetitive. You can only do so much with slot cars, and having such limited, bland controls isn't necessarily a failure on the developer's part, but rather a flaw in the fundamental concept. Eventually, slot cars get boring. After all, it's just a stationary top-down view of a track with little cars zipping around the course. There isn't even the danger of having your slot car fly off the edge if you take turns too quickly, which was an exciting element of classic slot car racing.   However, despite the somewhat boring nature of the gameplay, the zany modes do help keep things fresh, and the ravenously quirky concept is definitely appealing, at least to gamers who enjoy atypical titles. The best things about the title, however, are the load times. There's a slightly long load time when the game is booting up (of course), but once you're at the main menu, a race is literally seconds away. There are virtually no load times throughout the game and it definitely helps promote the ~pick-up-and-play~ mentality.   This about sums it up. Unfortunately, there are aspects of this title that become very annoying very quickly; the announcer is one of them. If only there was a way to turn him off, because he will start annoying you - maybe not right away, but eventually. The backgrounds are also embarrassing: they're bland and have almost no animation to keep them alive. We understand that this is supposed to be a simple title, but a little life sprinkled on the backdrops would have been nice.   Furthermore, when you start moving too fast (and you will in the later courses) you simply lose the ability to control your car. We don't care how fast your reflexes are - this game becomes almost impossible after you reach a certain speed, because you literally can't follow the car with your eyes; it moves too quickly. You'll always end up crashing into something (and crashing is usually bad).PixelJunk Racers will cost $6.99, so if you really dig the idea of a slot car videogame, than we're sure you won't miss your money too much. Also, the fact that you can play with up to seven people offline is pretty impressive, since this is one of the first PS3 games to really take advantage of seven different controllers simultaneously. Unfortunately, an intrinsically bland concept keeps this game from becoming a truly enjoyable hit, but that doesn't necessarily mean it's terrible. We had a few good times with PixelJunk Racers (especially the confusion of trying to figure out seven different people playing seven different colors), but you may be better off passing on this one. Or you could play with real slot cars instead. Your choice.", "date": "Sep 13, 2007"}