{"name": "Critter Crunch", "name_review": "Critter Crunch Review", "ref": "https://www.ign.com/articles/2007/09/13/critter-crunch-review-3", "text": "Capybara Games' Critter Crunch is one of the year's best surprises -- a fresh twist on the match-three puzzler formula blessed with gorgeous visual design. Cuddly Biggs' forest home is under siege by an army of pests that look pleasant enough as they descend from the canopy to the earth below. But should Biggs let these titular critters touch down, they turn vicious and attack our hero so mercilessly, Capybara has to hide the carnage with a cloud.   Biggs uses his long tongue to slurp up one insect at a time, spitting it into the waiting mouth of a larger bug. Bugs comes in three sizes (and multiple colors). If you spit two small bugs into a medium-sized bug, it pops. Two medium-sized bugs pop a large insect. However, feed one small bug to a medium bug to make it full, then spit that bug into the mouth of a large bug to pop it. If you spit a small bug into the mouth of a medium bug that it positioned just below a large bug, all three are popped. Think of Biggs as an enforcer of the food chain, if you will.   While helping the bug gorge on each other, try to line up colors. If you pop a bug, any like-colored bugs next to it also explode. You often need to rearrange the bugs to set up combos like this, but you cannot spend very long decorating the screen, as the insects are always gradually encroaching on your home.   Whenever you pop a set of bugs, a jewel drops to the forest floor. The bigger the combo, the larger the jewel. Gobble these jewels on the way down or before they vanish on the floor to pick up points. Each jewel helps fill a meter on the side of the screen; when it's full, Biggs moves on to the next infestation.   Soon, the game starts throwing curve balls into the equation. Toxic bugs must be dealt with quickly, lest they infect the bugs around them. Biggs cannot hold these bugs in his gob for very long, though. Each second chisels points off the meter. And when the toxic bug is finally popped, you must avoid the falling jewel, because it's also pure poison. Bomb bugs, if satisfied with a meal of smaller bugs, detonate and take all nearby bugs with them. Blocker bugs cannot be gobbled or fed -- Biggs must clear the bugs above the Blocker to get rid of it.   Biggs' tongue is a capable weapon, but even he could use some extra firepower against the insect invasion. If he pops the bugs with a sparkling halo, a power-up drops down the screen. The watermelon lets Biggs spit three seeds that pop any-sized bug on contact. Garlic grants Biggs a foul belch that pushes the bugs back one level. The chili pepper lets loose a pillar of flame that blast several bugs out of the forest.   If you clear a handful of screens, you get a special bonus puzzle stage. The forest is infested by a carefully arranged set of bugs. Biggs has a certain number of moves to clear all of the bugs and claim his prize points. These are easy at first, but get incredibly devious later in the game.   There is a lot going on in Critter Crunch, but managing all of these tactics and features is by no means overwhelming. Capybara uses a smart learning curve to introduce new features, like the power-ups or the toxic bugs. Everything comes together so perfectly; there is nothing in the game that feels superfluous. Each power-up has a viable use, there are reasons to use both the food chain popping solution as well as the color arrangement mechanic. It all just comes together so amazing well -- I was addicted, and you will be, too.   Critter Crunch features some of the best visuals I have seen all year -- the artist behind the game has done a remarkable job with character design and animation, as well as color choice. Biggs is an incredibly charming little fella. The bugs are expressive. They have different animation for when they're full or the second before they're launched into the mouth of a larger predator. The color palette is wonderfully inviting -- this is a game that's just pleasing to look at. (Anybody that reads this site knows how important I believe color is to attracting and keeping a gamer.)Capybara has crafted one of the best puzzlers of the year. Critter Crunch revitalizes the match-three formula, something I was convinced couldn't be done after playing dozens of them over the years. I simply cannot imagine why anybody who tries this game wouldn't be instantly hooked. Biggs is a great ~hero,~ the food chain mechanic is incredibly clever, and the production values are stunning. If you love puzzle games, you must give Critter Crunch a download.As much as I love mobile, I sincerely hope Capybara takes Critter Crunch beyond the smallest screen. Biggs deserves his shot at fame in the casual PC scene, as well as console services like Xbox Live Arcade.", "date": "Sep 13, 2007"}