{"name": "Ghouls 'N Ghosts", "name_review": "Ghouls 'N Ghosts Review", "ref": "https://www.ign.com/articles/2007/09/14/ghouls-n-ghosts-review-2", "text": "Real men fight zombies in their underpants. And a real man, Arthur, of the Ghosts/ Ghouls /Goblins series of side-scrolling action/ platformers from Capcom, has been doing just that for 20 years -- beginning in the arcade, traveling to the NES, and later arriving on the Genesis. Which is where we're going today!   Ghouls 'N Ghosts stars Sir Arthur, unarmored and in underwear, for the second time on a home console. It was a launch title for SEGA's 16-bit platform back in 1989, and with its near-perfect recreation of its coin-op inspiration, early adopters of the Genesis must have been well pleased with GNG's gameplay, challenge and style -- all of which hold up today. There must be some pretty tough polyester in those pantaloons.   Expect to see these words a lot. Playing as Arthur, you embark on an adventure through a set of environments that are dark and dreary, but have a cartoon flare. Like Castlevania with a sense of humor, you'll take on undead monsters, gargoyles and dragons, but also enemies like a magician with the power to transform you into a duck. The underwear thing is a joke, but is also a key part of the gameplay as Arthur begins each level in a full suit of armor, but if he takes a hit the armor is knocked away, leaving him in nothing but boxer shorts. If he takes another hit in that form, he'll lose a life.   And losing lives is a frequent occurrence in Ghouls 'N Ghosts, as the challenge here is considerable. You'll find yourself dying over and over again as you formulate the best strategy for dealing with each platforming sequence or boss encounter. Luckily, GNG gives you unlimited continues and mid-level checkpoints to offset any frustration factor. With a little persistence, you'll make it through to the end.   New for Ghouls 'N Ghosts over its predecessor, Ghosts 'N Goblins, is a difficulty selector that lets you tone down the intensity a bit for an easier adventure. There's Professional Mode, but also Practice Mode (and you'll find things a bit more forgiving with the latter). Also new are some of Arthur's abilities, like additional weapons, enhanced attack range and armor upgrades. The first Ghosts 'N Goblins was fairly basic in outfitting Arthur's arsenal, but this time he can find axes and swords in addition to his standard throwing lance, and can direct assaults upward to attack airborne enemies. The Magic Armor further boosts his potential to bring the pain, as wearing it and holding down the attack button lets you unleash powerful spells like fire blasts and lightning strikes.   Newcomers to the series should heed the warning that GNG's controls take a little getting used to, as Arthur's jumping in particular has a unique feel. He can't change direction in mid-air like almost every other platforming hero from his same era, so you have to plan your leaps with more thought. And this installment is definitely still old-school in that regard; later games in the series introduced double jumps, edge-gripping, and other enhancements to make things more forgiving. Not this one. Jump wrong here and it's Game Over time for the good sir knight.Ghouls 'N Ghosts is the second game in Capcom's Arthur series, placing it chronologically between the original Ghosts 'N Goblins (which came to the NES) and Super Ghouls 'N Ghosts (for the SNES). And its gameplay is something of a balance betweens those two as well. It's enhanced feel and added depth over the NES original still may not be as robust or as extreme as the SNES game to come after, but it's still quite solid. A great port of a good game.", "date": "Sep 14, 2007"}