{"name": "FOX Moto GP 3D", "name_review": "Fox Motocross 3D Review", "ref": "https://www.ign.com/articles/2007/09/17/fox-motocross-3d-review", "text": "I've never ridden a dirt bike, but my cousin has broken many bones via his motocross hobby. Superscape's Fox Motocross 3D just reinforces my will not to take up the sport. Reaching speeds of over 150 mph and crashes that send your body flying through the air can stay in the virtual world. I'm not going anywhere near a dirt track. Real men play badminton.   Like most racing games, you've got one goal in mind here: Finish in first place. Controlling your bike is relatively simple using the directional pad or numbered keypad. Braking is done automatically when you reach turns, but pressing the down or 8 button will help you brake harder when turning a sharp corner. It's also used when you want to land quicker after launching yourself off of a ramp. Needless to say, I hardly ever touched the brake button. If the computer is going to assist me in that task, I'm not going to argue with it. Up or 2 is to accelerate, but holding the button enables your boost. The boost meter is below the main game screen and can only be filled by performing tricks when you're in the air.   (Please don't ask me to explain the functions of the left and right buttons.)   Once you reach the top of a ramp, press the center button to initiate the Trick Cam. The Trick Cam offers a side view of your bike, granting a better camera angle of the tricks you're attempting. Tricks are pulled off by entering in a variety of directional pad or button combinations. Easy tricks can be performed by simply pressing OK. If you're fast and high enough, you can pull off combos to really fill up your boost meter. Five tricks combos seem to be the max since I couldn't find a place on any of the maps where I could go high enough or fast enough to pull off six without crashing. Tricks range from a No Hander to 2 Handed Seat Grabs to Backflips (my favorite). There is a help screen that shows you how to do each trick.   There are four main modes of play. Supercross is the main mode and consists of four areas with four tracks each. Three of the areas are mostly the same in look, with the exception being the third stage that has snow levels. Free Ride lets you practice on any tracks you've unlocked in Supercross mode. Time Trial is just that, trying to complete the course in your best time possible. Leaderboard connects to the internet to show you the top lap times for each course.  Extreme is the same as Supercross, except you start out with a full boost bar and your opponents are more aggressive. Speaking of your opponents, if you get caught in second or third place, get used to staying there -- it's very difficult to catch up to them. Also, use your turbo as much as you can to recover after wiping out.   Placing first through third earns you money that can be spent in the between-races garage. I don't know if fourth place earns you any money because I'm super-awesome at video games and would never settle for fourth. You can upgrade your engine, tires or brakes. I suggest upgrading them at an even pace. Don't do what I did and spend your money only upgrading your engine. You'll only have a fast bike that makes turning difficult.   The graphics aren't bad and your rider looks pretty detailed for being on such a small screen. The tricks come and go quickly, but the animations are suited correctly for each trick you perform. The sound effects are passable with the occasional voice yelling out ~Nice!~ or ~That's sick!~ I think he says sick and not the other four letter s-word. It was hard to tell. One thing you will want to turn off is the music which will annoy you within the first ten seconds. It changes in between stages but never seems to get any better. There are three different views to choose from with the 1st person view giving you the best sense of speed and airtime.  Moto GP 3D is a decent attempt at quenching the extreme sports enthusiast who is looking for a quick fix. After a while it begins to lose its flavor, but if youre in the theater waiting for your movie to start, there are worse ways to idle than pulling off a No Handed, Bar Hop combo.", "date": "Sep 17, 2007"}