{"name": "MySims", "name_review": "MySims Review", "ref": "https://www.ign.com/articles/2007/09/18/mysims-review-3", "text": "It was obvious from the very beginning that EA was taking a different route with its latest ~Sims~ project, MySims.  On both Nintendo DS and Wii, MySims puts you in the role of a newcomer to a ruined town, and rather than following the original formula of previous Sims games - create players, start a family, buy a house, get a job, and live life - you'll instead not only further yourself, but also be responsible for picking the town up and restoring it to its original glory.  On Wii, much of this has to do with creation, building homes and businesses for the town Sims to live and work out of, while simultaneously upping the town's social appeal.  On DS, however, it's a bit of a different design, but it still works rather well.   MySims isn't for the hardcore DS player.  It should be pretty obvious straightaway that, while it has some general appeal for any and all fun-loving DS owners, MySims is geared toward the younger crowd.  In fact, we'd go as far as to say that the DS version is fit for even a younger audience than the Wii effort, as the game lacks any of the ~build it~ features of Wii, and instead mimics the design of Nintendo's own Animal Crossing, while of course adding in the Sims charm and unique gameplay along the way.          In MySims DS it's more about talking with townspeople, fulfilling tasks, and upping the overall star ranking of the town in social situations, rather than dealing as much with the creative side of the game.  You'll begin by creating a character and outfitting them, layout your home with a few belongings, and start working for the Mayor just like the Wii version, though more of the game deals with talking to specific people or doing hands-on tasks around town, such as planting flowers or patrolling the streets with the town policeman.  Overall the opening sets the stage nicely, giving players access to an active town map on the top screen - complete with the current position of every town member - as well as the day/night indicator and full use of inventory.  The art style is made up almost entirely of pastel colors and very soft character and environment designs, setting the tone for the rest of the game.   And all in all the design is fun.  We liked running around town introducing ourselves to our neighbors, working up enough cash to buy furniture for our house, purchasing clothes such as a jogging suit for our self-appointed ~morning jogs~ around town, and purchasing little trinkets at the general store to give to village newcomers.  The only problem here is, while entertaining, the game simply feels like ~Animal Crossing Light,~ as the tasks, character interaction, and overall tone of the game is nearly identical.   In sections where MySims does set itself apart, it actually shows off weaker overall design, though it could still be fun for the younger DS crowd.  As days pass on you'll eventually unlock various mini-games and tasks to keep you busy, including everything from racquetball to lei making, photography and fishing, snorkeling and a few others.  Each of the games is the equivalent to a mini-game in something like Mario Party, often using just one button and the d-pad to pull off simple tasks.  Racquetball is all about hitting a ball as many times as you can against a cement wall, and aside from adding a few tweaks such as ~Target Mode~ to the action it's extremely simple and one dimensional.  Even something like lei making, which requires player to slide flowers on the touch screen onto specific points of their flower necklace grows stale relatively quickly, as the only difference in difficulty levels is the size, color, and shape of the flowers used.  Again, it's fine for the crowd it appeals to, but it's still a very basic overall design.    And aside from the mini-games and day-to-day progress in your home furnishing and social interaction there really isn't a ton that drives MySims.  You'll get the occasional chit-chat mini-game where newcomers to the town want to interact with you, giving you a certain amount of time to win them over by using simple touch-activated cues such as talk, listen, encourage, laugh, and so on. Since these games use the Sims gibberish, however, you don't really take much away from the interactions, so while a person says they're frustrated that the town isn't bigger you're limited to just saying ~listen, listen, encourage, encourage~ and moving on.  For a game that's all about social interaction there isn't a ton to be had.   On the more minor level, small little gripes with the game seem to pile up, and while it's not all bad we did have some pretty annoying moments.  Character movement, for instance, feels a bit sluggish due to a pesky walk animation that happens before your character gets up to a full running speed.  Any time you change directions, moving from left to down, for example, you'll go back to walking for a brief moment.  The only way to get around this is to roll your thumb - which works - taking you in a quarter circle for a moment in order to keep you in run mode.  It's minor, but when you aren't thinking about it you'll commonly revert back to walk despite holding the run button (or dragging the stylus, depending on your control preference).  Things like that can be found everywhere, having your character catch on an odd collision, or even more interface-based shortcomings such as the lack of a simple ~retry~ button for mini-games or the fact that you can't sell multiple of the same item at once.  They're small issues, but they can add up.  In general the game has a lot to offer the younger DS crowd; it's juts a bit on the shallow side all around.  With the DS version of MySims EA set out to create a very laid back, Animal Crossing-like experience for the younger pocket crowd, and for the most part it succeeded.  On one hand youve got aspects of the game such as the active map that shows exactly where everyone in the town is at all times, or the comprehensive top-screen clock that can be activated, showing exactly how much time is left in each section of the day.  On the other, however, MySims is lacking in any serious depth, relying heavily on the replay value of just a handful of mini-games that, in the end, are about as entertaining as a single Mario Party challenge.  The game has a very soft, inviting design to it, including everything from the color palette to the simplistic musical score, so if youre looking for something geared towards younger, new gamers MySims fits the bill.  Just dont expect it to hold players for more than a few solid hours overall.", "date": "Sep 18, 2007"}