{"name": "MySims", "name_review": "MySims Review", "ref": "https://www.ign.com/articles/2007/09/18/mysims-review-2", "text": "MySims for Wii plays and looks less like a typical Sims game and much more like Nintendo's own Animal Crossing, which may be a good or bad thing depending on what you hope to get out of the game. If you're looking for a title with a cute, colorful style and with a constant stream of structured missions to complete, not to mention an addictive construction component, you may really enjoy what EA's new Wii-exclusive effort has to offer. But if you come to MySims seeking the social experience of a traditional Sims project or the bulk of community management tasks these games encapsulate, you will leave town unsatisfied.    The objective of MySims is simple. You, as a handy builder, are tasked with the challenge of restoring a zero-star town to its former five-star rating. To do that, you'll need to construct houses and buildings, interact with the townsfolk to take on new assignments, search of essences, and more.  EA very clearly wanted to create a streamlined, easily accessible version of The Sims with its Wii endeavor, and for the most part it has. Take, for example, how quickly and hassle-free you can create your Sim, name your town, and begin. Using the Wii remote, you merely point to an on-screen character model, choosing face and hair types in addition to various outfits, and tap a button to cycle between a robust selection. It can be done in a matter of seconds, not minutes or hours, and anybody will be able to pick it up. The intuitive means in which MySims utilizes the Wii remote carries over into the game itself, whether you're interacting with the environment or building objects.   Oooh, spooooky...  At the same time, from the moment you delve into the character creation process, you will be left wanting more. You can't individually tweak or customize facial eyes, noses, or mouths, for example - you can only select a full set. By comparison, Nintendo's notoriously simple Mii creator is deeper, which is disappointing. Limitations like these are noticeable throughout the experience and they clash with the very nature of the franchise, which has flourished in part because of its depth.  We prefer to think of MySims is an enjoyable, if slightly flawed alternative to the Animal Crossing franchise. Once you create your character and enter the town, you meet up with a variety of people, all of whom have unique issues and problems that they (naturally) require you to fix. You might be called upon to construct a restaurant for an Italian pizza chef or a dance club for a DJ, or maybe you'll need to build a bed and other furniture for another Sim. These tasks are satisfying to perform because the process is uncomplicated and straightforward. You merely collect the correct essences and then go to your workshop to design and fabricate the objects.   Go prospecting for new essences.  Using the Wii remote to customize and construct items feels very good because you can very easily grab and rotate building blocks with the device and then point and click to add a wide assortment of essence colors and patterns. While you're given a basic 3D blueprint for every item that you construct, you're also free to add to the design and give your creations your own style. We really liked to add nonfunctional, but nevertheless interesting exhaust pipes to everything we created, be it a refrigerator or a podium. You may prefer to paint all of your creations in a flower pattern. The game is designed so that you have that freedom, which is great. Likewise, portions of the town are surprisingly customizable. For example, you can paint the walls of every interior and completely design the look of buildings you create.      The beginning world of MySims is small and unpopulated, but as you play and advance, more and more patrons move to town and the activity within begins to pick up. On top of that, you're able to open up new portions of the world by advancing the star rating of the city because you unlock special items, like a crowbar, which can be utilized to breakdown barriers located on the outskirts of the area. Only when you've opened these new locales will you be able to find the unique and vital essences that they hold and also utilize their additional space to invite new citizens to your city - all integral to advancing. You will visit caves, forests, and beaches, in addition to the main town, as you progress through the adventure, and you will definitely feel a sense of accomplishment as you gain access to a new world portion.  A look at a portion of the main town.  MySims disappoints, though, in a few key areas. The first is that it doesn't often feel like a Sims game because the social experience is lacking, to say the least. You don't really hold a job or sustain yourself (although you can, you don't even need to sleep), and interaction with the townsfolk is only in place as a means to relay new assignments. You can be nice or mean to the Sims, but there's rarely a need to explore this mechanic except to gain new essences. And speaking of essences, while they are initially a fun component of the building process, later in the game some essences can be frustrating to find. Sometimes, you get essences from people and other times you have to go prospecting for them - the latter of which can be cumbersome. And finally, for whatever reason, the flow of MySims is interrupted with load times, which take place whenever you leave a house or building, enter a new world, or go into your workshop, for starters.   Once you build him a place, this Italian chef moves to town. I like MySims and have given it a ~good~ final score. The game has style and charm. I'm partial to the cute, colorfuly visual presentation and actually wish that EA had done a little more with it, going so far as to incorporate Mii avatars  I feel that was a missed opportunity. The world that you explore in the game is filled with objectives, which is great. The problem is that nearly all of the objectives revolve around the same two tasks: the collection of essences and the construction of houses, buildings and items. All of the Sim management and social interaction elements of the previous games  well, you're not going to find much of that in the streamlined Wii affair. If you can get past that, you will still find a fun affair that uses the Wii remote well and generally looks pretty good. It just isn't as non-linear or deep as any Sims game before it. With any luck, the sequel will marry the depth of the series with the new Wii look and controls.", "date": "Sep 18, 2007"}