{"name": "Power Factor", "name_review": "Power Factor", "ref": "https://www.ign.com/articles/1999/07/07/power-factor", "text": "Power Factor for the Atari Lynx puts a new plot on the traditional side-scrolling action game. In a virtual reality chamber on a leisure moon arcade, you play the heroic Redd Ace and try to duplicate his historic victory over the Sinledo Techmods' invasion. You run, jump, and shoot through 11 side-scrolling levels of the enemy base, looking for six parts of a bomb to destroy it all.  You start with three lives, a flight pack, and a Very Large Gun. Items scattered through the game enhance your weapon, give extra lives, and add fuel to your pack. A statistics screen summarizes your mission progress, and computer terminals in the base provide maps, object locations, clues and information. There are no continues, so losing means a long wait in line before you can try the simulator again.    Take away the slightly novel storyline, and Power Factor comes off as a fairly simple, fast-paced action game. Basic strategy is to grab all the items on a level, find the exit, and shoot everything you can. The game is very linear, consisting of surviving a level, defeating the end boss, and going to the next. However, there are some subtle touches of sophistication. You can't win without finding all six parts of the bomb, and some of the weapons you find are better suited for specific obstacles. There are three difficulty levels, though even the easiest level is a decent challenge.  At its core, this is a fun, if not particular original, action contest. The only real hitch comes in the controls. In an attempt to give the player a lot of options, the control pad is overloaded with functions. For example, pressing left and right moves Redd, while tapping left and right selects weapons. This makes weapon selection difficult in tight situations, small movements tricky, and detracts from otherwise seamless controls.    The graphics on Power Factor are highly detailed, with a touch of whimsy. Redd Ace and the Sinledo aliens are drawn with a cartoonish look, making the station's deathtraps, backgrounds, and other items appear soberly realistic by comparison. Scrolling and animation is particularly fast and smooth. Sound effects are also nice, but not as diverse as the graphics; sounds consist mostly of explosions and firearms of all sorts, mixed with other minor effects. There's also a very nice piece of rock music, but for some reason it only plays after the game ends.  Power Factor tries to become a slick, action-packed run-jump-shoot game, and almost succeeds. The controls are a minor irritant, though the action, sights, and sounds almost make up for it. For the player looking for cheap thrills who can handle one flaw in an otherwise fine package, this is a decent title.", "date": "Jul 7, 1999"}