{"name": "Super Thunder Blade", "name_review": "Super Thunder Blade Review", "ref": "https://www.ign.com/articles/2007/09/20/super-thunder-blade-review", "text": "It's harder today to be awed by a game. It happens, sure, but it's not nearly so frequent an occurrence as it once was  when you'd see a game running in motion for the first time, with your own eyes, and your jaw would drop just a little. When you'd see something you'd never seen before, and it would leave you impressed, and impacted. The place where this was most likely to occur, decades ago, was the arcade scene. And the games were often from SEGA.   The company now most known for Sonic the Hedgehog was, in the late '80s, a premiere arcade developer  creating such stunning coin-op cabinets as Hang On, and OutRun. Games that rejected the two-dimensional status quo of the decade's earlier days and instead brought players a 3D experience  driving into the screen, or dodging obstacles approaching from a distance, or weaving a helicopter through buildings, trees and rock formations while blasting enemy fighters out of the sky. That last one is what this game's all about, the chopper-piloting arcade action title, Super Thunder Blade.   Unfortunately, that description makes Super Thunder Blade sound a whole lot cooler than it is. This port of the coin-op game Thunder Blade was a Genesis launch title, one of the flagship games SEGA presented in its 16-bit machine's first wave of software to attempt to bring that arcade sense of awe home to gamers' living rooms. But it just didn't translate. Without the arcade ambience, without the more powerful graphics hardware, and without the custom-built cabinet that was shaped like a cockpit, the appeal of this particular late '80s effort just couldn't make the jump to the console.     It was too choppy. A common problem plaguing SEGA's titles from that era, but magnified even moreso here  the framerate of Super Thunder Blade is far too jumpy, which is a problem when you're tasked to steer your chopper clear of fifteen missiles, four skyscrapers, two tanks and a jetplane all at the same time. The control is responsive enough, and is actually improved a bit when playing with a Classic or Cube Controller's analog stick, but it's still difficult to purposefully pilot your aircraft.   Gamers used to Nintendo's Star Fox titles will be most at home with Super Thunder Blade's style, and may be able to make the adjustment to the skippy visuals needed to be able to enjoy this adventure  but then it's not always an on-rails, into-the-screen shooter like the Big N's Arwing series. When you approach a boss battle in Super Thunder Blade, the perspective shifts to an above-the-copter view, and the gameplay becomes more similar to Tiger-Heli or Xevious. Your bullets and missiles, previously fired straight out in front, change to be angled toward the ground instead. It's a welcome break from the mold of the rest of the game.   But then there's not much of the rest of the game to see after that  Super Thunder Blade only has four levels total, meaning you'll likely be able to blast through all the way to the end in only a matter of minutes. That length of an experience made sense when it cost only a quarter to play in the arcade, but as a home console title it's just disappointingly short.The Thunder Blade experience was more than worth a drop of 25 cents over 20 years ago, when it held a position of prestige and honor among SEGA's late '80s arcade greats. But 800 Points for this 16-bit port is far too much, as most all of the elements that made it a compelling experience got lost in the translation to the home machine. Super Thunder Blade is visually choppy and far too short  and while diehard Genesis fanboys might argue otherwise, it's just not worth your time anymore today.", "date": "Sep 20, 2007"}