{"name": "Stranglehold", "name_review": "Stranglehold AU Review", "ref": "https://www.ign.com/articles/2007/09/20/stranglehold-au-review", "text": "John Woo's Hard-Boiled is basically the prototype for hyper-violent hyper-stylish action in my mind. The film, released in 1992, had a huge impact on my impressionable young brain at the time, locking in teahouses as the single greatest location for a shoot-out ever and twin pistols as the weapons of choice should I ever decide to single-handedly take down a triad gang. And needless to say, I've never looked at banisters the same way since - as soon as Chow Yun-Fat slid down one, blowing away enemies left and right (on his way to a body count of around 300), that was it; he was officially the most kick-ass man in film.   Which brings us to Stranglehold. A gaming sequel to Hard-Boiled, Stranglehold is your chance to play as Chow Yun-Fat's character Tequila from the film. In other words, it's your chance to kill hordes of gangsters and look impossibly cool while doing it. Down with that? I thought so. Kicking off - as these things are wont to do - with the execution of a cop, the pace never lets up, hitting a teahouse before the first mission is out (naturally), and propelling Tequila along a clichd but satisfying storyline. It's an excuse for the action no doubt, but hey, if you throw in two rival Hong Kong gangs, Russian mobsters, an undercover cop and a family tie between Tequila and mob boss Mr Wong, you can't go too far wrong.     Of course, it's all about the action, and Stranglehold doesn't disappoint. It's been a long while since we've had a decent Max Payne-style third person, bullet time-fuelled action game, and that's exactly what Stranglehold is. Don't call it a clone though, because this game definitely has its own style. Let's do a whirlwind tour of the gameplay mechanics.    First up, the all-important bullet time. You can enter it manually by tapping the right bumper button, but more often than not entering bullet time is context sensitive. Essentially, as soon as you aim in the general direction of an enemy (or ten) and do something stylish (such as diving, running along a banister or sliding down the spine of a dinosaur - all of which are triggered with the left trigger) the game automatically enters bullet time. It's a great system, meaning you're popping in and out of bullet time during the most cinematic actions, and while you only have a limited stock, it never takes long to recharge.    Now, let's come back to that whole ~do something stylish~ line, as 'style' is a huge part of this game. Killing people, you see, isn't enough. Stranglehold is all about killing people in rapid succession and with the greatest possible style. Hence the 'style points' system. This is a counter that builds with every kill you get (complete with a subtle but indispensable audio cue for each death), and the more stylish the kill - the more points it's worth. For instance, diving in slow motion at an enemy and capping him in the head with a shotgun? Amateur hour. Entry-level style. Get the hell out of here. Two points for you. Running up a narrow railing capping enemies left and right as you run? Definitely more stylish - take a few more points. Shooting enemy after enemy while swinging from a chandelier before diving off it in slow motion to take out the final goon? Now that's style. Taking out enemies with objects in the environment will also net you plenty of style points - although some levels have far more objects that can be shot down (such as neon signs) than others.     The trick, of course, is to keep the kills up - leave it too long between executions and the counter resets. So, aside from looking cool while killing, what's the point? Well, your style contributes to your rating at the end of each level, but it also fuels your 'Tequila Bomb Gauge' (as does finding paper cranes hidden throughout the world). That's the dial at the bottom left of screen, and it's the key to some of the most powerful moves in the game. Near the beginning of Stranglehold you unlock the ability to top up your health by tapping left on the D-pad, but it's the three other moves that are unlocked as you progress that are the show-stoppers. Each requires progressively more juice in the tank to activate, with the carnage ramping up fittingly.    The second special you earn is Precision Aim. This puppy allows you to pistol snipe. Just press up on the D-pad and your perspective zooms right in. Now comes the hard part - do you go for a clean clinical kill (such as a headshot), or do you go for comedy value and aim 'south'. Nuts, I can't decide. Either way, it's pretty gruesome stuff. We especially like the gurgling sound enemies make when you shoot them in the neck. But we're sick like that. The third special is Barrage (tap right), which turns Tequila into a butt kicking, triad murdering machine. More so than normal that is. We're talking invulnerability to damage for a short period and a massive boost to whatever active weapon he has. The shottie, for instance, becomes a rapid-fire enemy shredding, environment splintering machine. Finally, we come to the Spin Attack. Triggered by tapping down (duh), this is the Stranglehold equivalent to the scrolling shooter screen clearing bombs of yesteryear. Tequila spins elegantly on the spot, doves are released (yes, doves) and every enemy in the room gets capped. Awesome.    Sounds like a recipe for shooter heaven right? Well, it is and it isn't. While we love the idea of style points, the execution is a little hit and miss. Some sections seem perfectly designed to harness long chains of kills, while others are so cluttered that elegant runs become quite difficult - for the wrong reasons. In fact, ~cluttered~ is a word I've used a lot when describing Stranglehold to friends. The environments in particular are often very cluttered, and the fact that you're using the one button to both dive and interact with the environment (running along rails, boosting off walls etc) means that you're executing stylish kills less than you're bumping about the environment and trying to line up an object to interact with. That's not to say it isn't fun - it most definitely is, it's just that the execution is a little clumsier than we'd hoped it would be. This is compounded by the waves of enemies that often tend to burst from doors all around you, making both strategic and stylish play less of a focus in many areas.     There's another gameplay mechanic we haven't mentioned yet, and that's the ability to take cover behind objects. It's a handy ability (and now mandatory for modern shooters), and you'll even go into bullet time when you pop out from cover to shoot. Mind you, there are a couple of things holding it back. Enemies spawning in all around you means that the fight often happens in all directions, so cover often isn't that useful. Secondly, you can only take cover behind some objects. Thankfully you'll learn to pick them pretty quickly.    We should also mention that your cover may not stay as cover for long.  Hide behind a column and enemy fire will literally chunk it away, piece by piece. Yes, Stranglehold has destructible environments, and it's very impressive on this front. If the room you're fighting in isn't reduced to rubble by the time you're done, you simply aren't trying hard enough. Better still, you're given a dollar value of the damage you've done to the environment at the end of each level. So, that's what it feels like to do $15,836,845 worth of damage to a casino. *whistles*   The destruction extends to almost everything that won't fundamentally break the level. Shoot-out in a museum? Dinosaurs, fossils, totem poles, Terracotta Warriors you name it, you can destroy it. The level of carnage really helps make gun fights feel that much more explosive, and that much more 'HK action'. Oh, and the team has really innovated in some areas too - the most explosive barrels are yellow in this game, as opposed to industry-standard red. It's bizarre-o-world!     The settings are great too. Right from the opening scenes where Tequila is running through the dense, neon-lit streets and marketplaces of Hong Kong, you know you're in for a visual treat. The team has obviously worked hard to make each level as iconic as possible and they've mostly done a great job, putting together a set of levels that run from shanty towns and slums through to opulent penthouses, casinos and traditional gardens. And the first-rate art design is backed ably by a modified Unreal Engine 3 that has allowed the team to build some very believable and lush environments. Kowloon Slums is a great example - the rain pelts down, lightning illuminating the scene every few seconds. Tequila is soaked to the bone - and looks it. No shiny plasticine skin here. The environment is littered with gutted, rubble strewn buildings, and faded concrete corridors, fat electrical cabling strung from the ceiling, water pouring in through cracks. Could there be a better setting for a showdown? And that's kind of the point. Stranglehold brings Hong Kong action to vivid videogame life, so despite some uneven design elements and the fact that some levels are more impressive to look at than they are to play, it's hard not to get swept up in.   Stranglehold is far from being the ultimate shooter, but it knows what it is, and thats a homage to some of the great Hong Kong action films, and this is a role it revels in  not just in the sense of style that pervades every aspect of the game, from the settings to the special moves, even the epic sense of cool that pervades everything Tequila does, but in the production values and  importantly  the fact that it doesnt take itself too seriously. As the game progresses, the action film clichs stack up, but in the best possible way. After all, how can a bad guy diving out of the window of a skyscraper, only to appear moments later rising up in a helicopter, possibly be bad? And who wouldnt love seeing Tequila diving out of an exploding building, only to land in a speedboat? Robots, thats who. Are you a robot?", "date": "Sep 20, 2007"}