{"name": "Maken X", "name_review": "Maken X", "ref": "https://www.ign.com/articles/2000/04/29/maken-x", "text": "Wow, what a unique game!  Maken X, an Atlus-developed title that's being brought over stateside by SOA is one of those games that feels refreshingly different from just about any title out there that you may have played.  It's actually somewhat difficult to classify the game, as although an action-oriented title presented in the first person, it's nothing like Quake or Turok.  Thus, fans of the Japanese version lovingly cooked up the ~first person slasher~ descriptor.  Genre and comparisons aside, this first Atlus Dreamcast title (to be hopefully followed by Princess Crown 2) is an enjoyable addition to the Dreamcast library that suffers from a few very rough edges here and there.  If you've already read our import preview, our import review, and our domestic preview of the game, you're up to date on the basic premise, so skip down a few.  Everyone else, shame on you for not checking the site daily, and please scrutinize the following.  The main character of Maken X isn't that anime chick you've been seeing in all the posters and wallpapers.  No, Atlus has made the main focus of the game a very special sword, the ~Maken~ of the title (Ma + Ken in Japanese can be taken to mean demon sword).  This sword has the ability to take possession of human life forms through a process known as brain jacking.  That's where you come in, taking control of the characters possessed by the Maken through around twenty different levels of first person hack-and-slash action.  As you proceed through the game's levels, you're given the option from time to time of brain jacking a character, be it Kei, the red-clad poster child of the game, a boss you've just fought, a helpless enemy you've found in one of the levels, or one of your friends (mmmm . . . Fei Shan Lee ... yummy ... I gots ta go to Hong Kong one day).  When you brain jack a character, you dump your old body behind, and suddenly find yourself in control of a new body, which comes complete with different abilities.  One character has multiple swords which swing out in attack, for instance, while another character can launch a projectile from his tongue.  You'll also find some characters to be slower than others and some faster - brain jacking a given character isn't necessarily a good thing, although you can generally tell what you're getting yourself into, as the game provides info on a character's level of ability beforehand.  Despite the differences in abilities, each character is operated in basically the same way. You can attack, do a combo move, jump, and strafe as basic operations.  Each character also has a special move, which is made positively useless due to it sucking up your life per use.  I don't remember the Japanese version of the game doing this, and I'm more than annoyed, as I found myself rarely using it when playing through the US version of the game.  It turns out to not be too much of a problem, though, as you'll find yourself using other attacks more often, including the ability to leap over your opponent's head and arrive on his backside, perfect for garnering the all-important critical blow (this would probably look really, really funny in real life).  You can also lock on to an enemy with the push of a button, and all subsequent movements keep you facing your opponent.     Unfortunately, at the heart of the game's problems - and really, the only gameplay related problem you'll find - is the actual control system for moving these boys and girls about.  Everyone out there and their pet Gremlin knows the perfect control layout for first person titles on Dreamcast - just look at . . . err, well, MDK2 and Slave Zero, while primarily third person titles, do the job nicely.  Maken X doesn't follow the pattern, and the results are somewhat mixed.  The game's control scheme makes combat once you've locked on to an enemy an absolutely wonderous affair, an intense session of blocking, maneuvering around your opponent, jumping in for the kill, and so on and so forth.  That's the only thing the control scheme does well, though.  Navigation is tricky, as you can't survey the scene while moving, and there's no quick turn feature.  Whenever I jump across a platform, I hold my breath, as I'm unsure if I'll land properly.  When not locked on to an enemy in battle, good luck avoiding getting hit as you clumsily try to position yourself in front of the enemy.  Fighting two big enemies at a time?  It sometimes works, but it's usually one of those things where you're not entirely sure why you won, if you manage to win.  I wish more though had been put into this area of the game, as it's cause for an immense amount of frustration as you play.  The lack of robustness makes seeing some enemies nearly impossible before they've attacked you, and this happens entirely too much.  That, combined with the occasional control hiccups made it so that I was never sure of myself as I made my way through the levels - usually a good feeling, but not when the lack of assuredness is attributed to a shaky control setup.  I'm not one to swear at a game when having difficulty with it, but in the case of Maken X, I usually felt that any difficulty was more due to the problematic controls than anything - in other words, it was the game's fault that I died, and not my own.   But I couldn't stop playing the game despite this problem.  Why?  Look aside from the control issues, and you'll find the Maken X gameplay experience to be pure gold.  The game does, thankfully, emphasize one-on-one combat, and you'll usually find yourself locking on to a single enemy and taking him out, before moving on to the next foe.  The fighting action at its finest is fast, furious, and very intense.  You often can't just go in for a kill and expect to come away victorious.  No, strategy is important at times, and observing an enemy's pattern before attacking will end up saving you some deaths (don't worry if you die too much, though - the game has infinite lives and a save feature).  There are numerous paths through the game, culumulating in a promised 7 different endings, and the multiple characters add so much in the way of variety.  Everyone's experience with Maken X should be a different one, as you can freely select your level from an overhead world map, brain jacking previously encountered characters at will, and partaking of side quests at your leisure.  The actual design of the levels from a gameplay standpoint range from the very straightforward to the moderately complex, with some levels having the occasional easy-to-figure-out puzzle.  You'll never find yourself growing tired with a level before it goes poof, and there are around twenty to play through, most of which finish off in an intense boss encounter.  Getting through a level usually proves to be an immensely satisfying experience.  And in addition to these fine points are the game's brilliant artistic elements.  Well, it must be said that there's something evil in this area, even more so than the Maken itself.  The story appears to be interesting, but despite being spooned to you in rather large helpings between levels, various problems ranging from the horrid translation to the even worse voice acting job make it hard to follow.  Actually, I wouldn't put the blame on the localizers alone, as the way the story is told, which originates from the Japanese version, ain't that great in the first place, with characters jumping to silly conclusions without any dramatic build up.   It's in the area of the visual arts (you know . . . the stuff that you see) that the game excels.  The game is, first off, a graphical marvel, moving at a constant 60 frames per second, and featuring detailed models for the worlds and characters.  I'd say it's one of the best looking games on the system - just wait until you see some of the brilliant special effects.  You MUST play this game on the VGA Box or through S-Video.  Beyond the technical brilliance, you'll find a title that excels in terms of graphical design.  Hey, it's what made Sega Rally on the Saturn look better than it really did, and Atlus demonstrates its flair for visuals with Maken X.  The levels take place in beautiful environments that are themed in real life, from the snowy Russia to my favorite stage set in India, and are full of dramatic encounters with enemies.  You'll enter a room and the game will cut to a cinema of sorts, showing a group of enemies coming at you from various sides.  It all comes together beautifully.  Also worth mentioning are the game's awesome character designs.  The main characters look like Japanese animation brought to true 3D form, and they're stylized enough so I wants me some character figures!  And then there are the enemies.  I'm not sure what exactly the designers at Atlus are into, and I want to stay far away from it in real life, but in the game world of Maken X, the strange and occult come together in some of the most intriguing creature designs since the baddies of Blue Stinger.  Some of these guys managed to give me the creeps, even after I stopped playing.  Atlus has actually tried to give some of the enemies interesting background stories, although Metal Gear Solid this is not, due to the horrid, horrid voice acting (they absolutely ruined the guy at the end of India!!!).  You'll play through Maken X for its incredible artistic elements, its fast one-on-one combat system, and just to see what surprises the next playable character brings.  It would have been a much better experience if Atlus had worked on the controls a bit and if the game's story were better told, though.  I'd suggest that you rent Maken X before buying, just to see if you can look past the game's moments of evil.  -- Anoop Gantayat, IGNDC", "date": "Apr 29, 2000"}