{"name": "NHRA: Countdown to the Championship", "name_review": "NHRA: Countdown to the Championship Review", "ref": "https://www.ign.com/articles/2007/09/21/nhra-countdown-to-the-championship-review", "text": "When reviewing a niche title such as NHRA: Countdown to the Championship, one should never start off by saying, ~Well to be honest, I know absolutely nothing about drag racing.~ But let me be honest here. I know absolutely nothing about drag racing. This makes reviewing a drag racing game a tad difficult.   Or rather, I should say that I knew very little about drag racing. Call this is a testament to just how comprehensive Countdown to the Championship is. I'm going to make this easy for the extreme NHRA fans out there : if you try to Stage your car in parking lots and see the yellow lights of a Christmas Tree when you close your eyes, you should buy this game (and seek help). It is an excellent representation of the sport at a budget price. However, if you have no idea what Staging or Christmas Trees are (outside the pine variety with presents at the bottom) then keep reading.   It's really those who are new to NHRA drag racing that will have trouble with this game. In case you didn't know, drag racing does not entail wildly hitting the gas to beat multiple cars in a series of laps. Instead, it involves two cars (or the newly added motorcycles and rocket cars) that race in a straight line for roughly four to five seconds. What's that you say? Why would they make a game out of that? Well, it's a little more complicated than just making a beeline to the finish.   I'm sure there's a lame  There are five parts to each race : Tuning, Burnout, Staging, Racing, and the Replay. The first thing you do is pay careful attention to the race conditions such as the cloud cover, air and surface temperatures, and humidity (oh yes, all of those normally useless stats actually mean something here). Using that info, you then tune your car. For example, air temperature affects horsepower and surface temperature affects traction.    Get used to this idea of planning because pretty much every little thing can be tweaked and tested. Things like the primary and secondary clutch, the engine's spark, compression and overdrive, the fuel flow, the tire pressure, the front ballast, and the wings (I'm surprised there wasn't an option involving cup holders). If you'd rather not deal with all of this, there is an auto-tune option in the lower difficulty settings, and Crew Chiefs that offers different advice about your settings. But don't rely on them too much, because different crew chiefs specialize in different things. Tune something wrong and you're liable to have an engine fire. Oh, and depending on your difficulty level, this tuning portion can have a pretty narrow time limit.   Now I'd wager that the preceding paragraph has either had one of two effects on you. Option one is that your interest is peaked. Option two is that you think this is the worst game ever and you've already closed your internet browser. True, the insane detail does make this racer seem more like a flight sim sometimes, and tuning is the bulk of the game. This is not your typical racing game.   Nevertheless, when you actually get on the track, you will undergo the ~burnout~ (spinning your wet wheels for better traction), the ~staging~ (carefully lining up your car) and the ~racing~ (praying to your god of choice that your reflexes and tuning abilities can overcome awkward nub sensitivity - more on this later). Afterwards, you can analyze what went horribly wrong by watching the replay with fourteen (!) different camera options. There's even a detailed chart overlay of your car's performance as the race is happening. In case you're that obsessive.   You'll be seeing this a lot. In terms of modes, Countdown to Championship is fairly basic. Vehicle classes involve Top Fuel, Funny Car, Pro Stock, Motorcycle, and Jet-Powered, and you have your basic array of Quick Race, Single Event, Career, or two player VS options. Jet-Powered is exclusive to the PSP: it's been somewhat hastily put in because all you can tune is the Nozzle Size, but at least it's accompanied with neat fire effects. Also exclusive to the PSP is the ability to race any class against each other, with the slower class getting a head start.    Career mode is interesting because money plays a part in it. Do well and you'll find yourself being picked up by different sponsors. Crash your car consistently, and you'll have big bills to pay (yes, it's game-over if you don't have the money to pay off the bills). Granted, this feature sounds a little more interesting than it actually is. Money is treated just like any other stat and you may even forget it's a part of the game until you randomly see a game-over screen after a race event. Career mode also utilizes the new NRHA points system to determine champions, and you can even spectate all of the races that you're not part of. Just like watching it on TV.   If it's not clear by now, Countdown's greatest strength is its attention to detail. However, this is still a budget game with budget problems. Although it looks slightly sharper than the PS2 version (because of the smaller screen), the graphics are pretty basic and the crashes are ridiculously bad. The awful commentator should also be turned off immediately. However, the worst thing about the PSP version is the control. The nub just can't handle the nuances that the DualShock can, and you'll be crashing a lot more than you should. Considering the actual race is only 5 seconds long, the controls for this part better be damn well perfect. It's not exactly game-breaking, but it's enough to easily recommend the PS2 version over the PSP one.This is a game that caters to a hardcore crowd and is definitely not for everyone. The PSP version has a few neat additions but ultimately loses out to the superior controls and load times of the PS2 version. It's still a solid version of the game though -- just expect to smash into a wall or two (or three) a little more than you'd like.", "date": "Sep 21, 2007"}