{"name": "Race Driver: Create and Race", "name_review": "Race Driver: Create & Race UK Review", "ref": "https://www.ign.com/articles/2007/09/24/race-driver-create-race-uk-review", "text": "Despite the fact that DS was launched back in 2005, the number of decent racing games can be counted on one hand. In fact, you could pretty much count them on one finger because, so far, Mario Kart DS has been the only must-have racer on the handheld. But now, Codemasters is zipping to the starting grid with Race Driver: Create & Race - a driving title that's like nothing else on DS. You see, instead of offering arcade action, Create & Race is a far more sober simulation experience that swaps red shells for real-life tracks and moustachioed plumbers for hardcore driving challenges.   Of course, on home consoles and even PlayStation Portable, Codemasters has become synonymous with offering realistic racers but on DS it's only really known for the half-baked port of Micro Machines, with that god-awful touch screen steering wheel. Thankfully, clumsy gimmicks like that have been stripped out of Race Driver in favour of a fleshed-out simulation experience with plenty of racing options, modes and even a comprehensive track designer - and there's never a touch screen steering wheel in sight. Hooray.     First up, is the World Tour mode, which is the main draw of the single-player. Here, you race in championships across the globe in pre-set cars. So, for example one of the first tournaments sees you getting behind the wheel of either a Nissan Fairlady Z S-Tune or a Honda NSX, then speeding through the Phillip Island and Oschersleben Motopark race tracks. As you progress you unlock more championships and increasingly faster gas-guzzlers.   Alongside this is the Simulation mode, which lets you create your own championships by selecting tracks you want to race on, the difficulty of opponents and what cars you want to drive. Finally, there's a neat little Challenge mode in which you must pass racing challenges based around particular driving skills, including steering, braking and so on. In terms of modes, Create & Race is without doubt the most thorough racing experience on DS and offers up a hefty single-player.     However, although it certainly excels in terms of modes, it doesn't perform so well on the track. This is because the handling initially feels like it's not quite spot-on and is stuck in the middle ground between arcadey handling and realistic simulation. For starters, cars seem to slide across the tracks rather than actually making contact with them and the steering can seem a bit twitchy because of the d-pad. Furthermore, braking isn't as finely tuned as previous versions of Race Driver on different systems and it's easy to misjudge the braking when approaching a corner, so you either overshoot it entirely or almost grind to a halt.    Another problem is presented by the tracks themselves. You see, although they're accurately recreated from real-life courses and they all look rather fine thanks to the robust graphics engine, there's very little warning about when you're approaching the corners. Even though there's a map on the bottom screen and some crash barriers indicate an upcoming corner, turns aren't flagged up enough as you're driving and can often creep up on you. Codemasters should have really included arrows on-screen to show turns because as it is, on the more complicated tracks you've almost got to memorise courses to remember every bend or briefly take you eyes away from the action     In fact, it's a bit of a Catch-22 really because DS owners used to playing Mario Kart are likely to find the driving a tad difficult, whereas traditional Race Driver fans may miss the precision they've become used to. However, if you do persevere through the first few tournaments things do liven up and driving becomes a lot more enjoyable because you get used to the handling and learn the ins-and-outs of tracks. In fact, it's actually worth persevering because as you complete championships you're given reward points that can be spent on new challenges, bonus championships and, best of all, new items for the track designer.   Ah yes, the track designer. This is one area in which Codemasters has really gone above and beyond the call of duty, giving players the chance to show off their creative side as they make courses from scratch. Using the touch screen you can draw routes free-hand with the stylus or choose from a selection of road sections, before adding track-side items, including trees, stadiums and so on. You can even take a quick practice lap round the course or have a fly-through to check out your chicanes and hair-pins. In fact, the track designer is so intuitive, flexible and easy to use you could even recreate well-known courses from other racers, including Mario Kart DS (we pulled off a fairly convincing Yoshi's Circuit). Overall, this is a surprisingly addictive and thoroughly enjoyable element of Create & Race that you end up spending a lot of time on and is ultimately the main draw (pun not intended) of the game.     Furthermore, after creating your masterpiece you can then use it while racing in the game's four-player online mode against friends and random players or the single-card multiplayer. This adds as an extra incentive to make a decent track, to get respect from the racing masses. You can also choose from championship courses as well. Overall though the multiplayer is another excellent element of Race Driver and online races run without a hint of lag - even with all four players jostling for position at the same time. In some respects it's also a more rewarding online experience than Mario Kart DS because it relies purely on driving skill, rather than a racer getting rammed by a red shell on the finishing line and, of course, there's no sneaky snaking in Create & Race. At first Race and Create seems like a bit of a let down because the handling doesnt seem quite right and the lack of arrows to indicate when turns are coming up is frustrating. However, with a little more practice as you race through championships, the more positive aspects of the game start to shine, including a decent sense of speed thanks to the 60fps and plenty of single-player options. But the star of the show is certainly the Track Designer, which is incredibly in-depth, while still being extremely flexible and simple to use. It adds an enormous amount of longevity to a package thats already bursting with modes and unlockables.", "date": "Sep 24, 2007"}