{"name": "Digimon World: Data Squad", "name_review": "Digimon World: Data Squad Review", "ref": "https://www.ign.com/articles/2007/09/24/digimon-world-data-squad-review", "text": "Let's get the most obvious part of this review out of the way: Digimon World: Data Squad takes a hellishly long time to play. This atrocious length is not due to consuming, epic battles, nor is it the result of a complex and evocative story. It isn't from an abundance of extra bonus features, and it certainly isn't founded on a myriad of interesting characters. No. Unfortunately, Data Squad has none of these things. The reason that this game takes so long to play, or at the very least, why it ~proportionally~ takes so long to play (we'll explain that later), is that everything takes forever. Playing this game is so frustrating and so agonizingly boring that any good qualities it may possess are just drowned out in a flurry of poorly executed mechanics and an unoriginal narrative. But such points require further explanation in order to fully understand, so let's proceed cautiously and with the gravest of mindsets.   Digimon World: Data Squad is an RPG from Namco Bandai, and developed by BEC. It follows the adventures of Marcus, Yoshino and Thomas (and a few others) - members of the elite Digital Accident Tactical Squad, or DATS. The purpose of the DATS team is to protect the real world from invading Digimon, and to maintain the balance between the world we know and the Digital World. As you may have already guessed, this game is based on the cartoon/anime of the same name, and offers an original story that runs parallel to the anime's story.  If you're a fan of the television series, than you'll probably recognize a lot of the characters, both Digimon and human, that populate this game.    Unfortunately, Data Squad just about fails in every way at being a good RPG. In fact, any connoisseur of RPGs can see right away that this is simply a below-average title, no question about it. The game puts you in control of three characters at a time, though you do add a few others to your party later. You run around in a handful of relatively bland areas, which are only accessed through a selection screen, and not actually connected by a world map. As you run around, you'll face an obscenely large number of random encounters that pit your Tamer's Digimon against packs of wild Digimon. You issue a command to each of your Digimon, one at a time, in the most rudimentary turn-based system imaginable.   Essentially, your turn will give you a screen-full of options, though most of them are repeats. The option that shows up the most is the technique your Digimon actually wants to perform. But trust us, it's way more simple than it sounds - tragically so. Besides a handful of special abilities and the potential to influence your Digimon's mood through Support commands, there's simply nothing special about this title worth exploring.   Oh, you crazy Digimon. Yes, you can digivolve your Digimon into different forms, but the selection is repetitious. Besides, changing your Digimon into different forms really doesn't change the way battles are played out, except that you have access to a slightly different variety of techniques. However, the majority of these techniques share the same animations and special effects, making it an incredibly unoriginal experience when you change characters or try and freshen up the combat.    And the combat is the absolute best way to illustrate our very first point in this article: the length. Data Squad takes a long time to play not because the actual length of the game is impressive, but rather due to the raw, unbridled amount of load times that literally drag this title headfirst into the ground. This is the reason we chose to use the word ~proportional~ above, since you spend way too much time sitting and waiting, as opposed to actually playing. It's almost an embarrassment to RPGs. Just a few examples out of many: there's a painful load time for the items menu. Yes, you read that correctly. You have to wait at least three to five seconds just to open a list of your potions and other assorted knick-knacks. And this is an RPG, the type of game that's completely reliant on menu navigation and micro-management. This time adds up as you play, and while it may not seem like a serious issue at first, just wait until you're a few hours in and you're completely ready to rip your hair out.    Then, of course, there are the battles themselves. After selecting a technique for your Digimon to execute, you have to wait at least a second or two for it to load, than another second or two for the opposing Digimon to register the hit. Than it takes another couple seconds to resume the process for another pair of opponents. All in all, even a normal battle involving just a few low-level baddies takes an extremely long time to complete. This has to be one of the worst paced battle systems we've seen in a long while. In fact, after a battle, one particular Digimon of ours suddenly yelled: ~That was a waste of time!~ How right you are, Lalamon.   For an RPG, Data Squad certainly doesn't ~wow~ us on the story side of things, either. There's no context or prologue at all to the events of the game, so newcomers to the Data Squad universe will be completely lost. The characters are bland and horribly voiced, and almost everything about the plotline screams ~unoriginal.~ Some bad Digimon are on the loose, kids are being kidnapped, etc. Don't expect to be mesmerized here, since the dialogue, exposition and cutscenes are all terrible.  It's almost sad to see an RPG so poorly designed, but that's the truth of the matter. We could give countless examples of the poor quality gameplay, but there's really no need to. The load times and pacing issues alone should deter even the most passionate RPG enthusiast.  He's not as threatening as he looks. The only thing we can say in this games defense is that its not necessarily broken. As annoying as it may be, the game is still technically playable, and you can still understand the plot if you want to. Furthermore, the music is actually not that bad and some of the themes can actually sound like normal RPG tunes (which is a welcome relief). Unfortunately, theres really no reason to play this game. Even fans of the show should avoid this one. I personally have watched Digimon in the past and can tell you that this title does nothing to capture the charm of the anime.Do yourself a digi-favor and dont waste your money on this one. Instead, lets hope that the next Digimon title brings a little more pride to this digital legacy.", "date": "Sep 24, 2007"}