{"name": "BRAHMA Force", "name_review": "BRAHMA Force: The Assault On Beltlogger 9", "ref": "https://www.ign.com/articles/1997/04/10/brahma-force-the-assault-on-beltlogger-9", "text": "Genki is no stranger to the first person mech adventure. Two of the PlayStation's earlier titles, Kileak and Epidemic, were both mech titles, and were both awful. Imagine our surprise when BRAHMA Force turned out be good!  You are the leader of the BRAHMA Forces, elite mech commandos designed to handle any hostile situation. While flying into the captured Beltlogger 9 mining colony to take out the vengeful Dionisio Vega, your squad is met with an ambush by Vega, and your entire battalion is wiped out. So it's just you alone. Sound familiar?  Your mech has been equipped with all manner of powerful weapons, from lasers to bullets to timed charges (for blowing open locked grates and such). Power ups have been hidden along the way, but you have to equip your mech for it to go on-line. Hit START and you'll be taken to a rather large menu where you can equip your mech, upgrade your energy and durability, and so on. It's this menu system that makes you feel more in touch with your machine than most games like this; you're in charge of its upkeep, and knowing all its capabilities will be essential in surviving to the end. Your mech also has the ability to jump, which adds tremendously to the gameplay.   Like most classic adventure games, a major part of BRAHMA Force's gameplay involves flipping switches to unlock doors, to allow you to pass on to the next level. While this doesn't break any new ground as far as game structure goes, it does feel instantly familiar to anyone who's ever played an adventure game. The levels could've been a little larger, but the clever enemy AI works well at preventing you from finishing the levels too quickly.  BRAHMA Force offers solid gameplay within an established game genre. It won't be the next Tomb Raider, but it is a hell of a lot of fun!", "date": "Apr 10, 1997"}