{"name": "Juiced 2", "name_review": "Juiced 2: Hot Import Nights Review", "ref": "https://www.ign.com/articles/2007/09/25/juiced-2-hot-import-nights-review", "text": "While it's common practice in the music industry for a band to have a self-titled album, it's not too often that you'll find something similar in the gaming world. But here we have Juiced 2: Hot Import Nights from Juice Games, the sequel to the original 2005 release of Juiced. The follow-up sees a large number of changes in the series' overall design - the calendar-driven event sequence is gone, you no longer have to pay to repair damage after a race nor pony up a race fee to enter an event. It's a sleeker experience to be sure, but it's still far from perfect.   While we had issues with the current-gen controls, the PlayStation 2's steering mechanics are a bit better in that they're not nearly as touchy during a race. The general feel of the game is a bit generic, with reasonably responsive controls but no real personality to each of the cars that come through the controller. One thing that's a bit curious is that although the game encourages you to drift around corners to gain boost, you also lose speed when you do so, unlike some of the other versions of the title.   Though drifting around corners is encouraged, you do lose some speed in doing so. The track designs in this version also feel fairly generic. Each track is a closed-off portion of a city, each of them feeling like a test track for you to race on. The designs aren't bad, per se, but they don't have the personality that we'd seen in the more advanced versions of the game. Chalk it up to hardware restraints or what have you, but the end result is that while they work, they aren't all that memorable or different from the other 3,265 racing games you'll find on the system.   The presentation aspects of the Career mode and so forth are extremely hit or miss. One thing that we like quite a bit is the new goal-based progression. For each racing league, you'll need to complete a number of goals in order to race in an advancement qualifier to move up to the next tier. Each level has a number of goals for you to complete, and they're generally pretty varied.   For instance, one goal might be to win a $25,000 bet against a certain racer, while another is to amass an airtime of 6 seconds in a race while another is to simply win a single circuit event. The cool part is that you can achieve multiple goals in a single race, so if you're good and know what you're looking for, you can cut down on the number of races you need to partake in to advance. It's also nice that not all of the goals require you to actually win a race, which will help those who begin to struggle at the later tiers.   You have brakes, but you should only use them to initiate a drift if you want to win. While going from race to race is much better this time around, what with the game having a series of goals to hit at your leisure before advancing rather than relying on a calendar, a number of other elements outside of racing are poorly implemented. For instance, the Driver DNA system doesn't really work all that well. The idea here is that you can swing a number of your racing styles (and those of the AI drivers) from being red hot, a.k.a. aggressive, to ice cold, or calm and refined.   One of the issues with this system is that it doesn't seem to have an impact on how well anyone performs. Drivers that have practically maxed out their racing abilities one way or the other can finish dead last in a race and do so just as often as someone with a rather ~plain~ DNA readout. When hiring drivers to race on your team, which you'll only need for crew-based events, you're shown their DNA structure to help you figure out who to pick, but it reads differently than before a race and, again, it doesn't seem to matter all that much.    While the Driver DNA's lack of any real impact upon what's going on doesn't really break anything since you can essentially just ignore it, the car performance and upgrade system can be anywhere from confusing to a nuisance to a money-drainer. For one thing, each car is given a single performance number that is supposed to tell you how well the car will drive. This isn't an entirely accurate system as we've had cars wipe the floor with other cars at the same performance level. Why there aren't separate numbers for acceleration, top speed and handling, we'll never know. As well, while you can upgrade the handling of your car, your performance rating doesn't include your vehicle's handling ability, and there's no way to see exactly how much of an impact your upgrade has made.   Speaking of upgrades, each racing league that you advance to unlocks three new levels of upgrades for each of power, handling and weight reduction. While this is nice, the issue is that if you pay for a level one upgrade of any sort, you don't get any kind of discount for upgrading to level two or level three. With a very minimal price difference between the three, it feels like a complete waste to pay for lower levels. The only reason that you would ever do so is because in order to unlock upgrade levels two and three you need to complete small challenges to unlock them, and then you need to pay for them. We're fine with this part since the challenges can actually be fun. But something that we're not fine with is having to repurchase an upgrade if you uninstall it for any reason (like to allow the car to compete in a different league, for instance). We could understand having to pay an installation fee, sure, but why do we need to pay for the whole thing over again if we've already purchased it?   It's like a car show up in here. In addition to upgrading your vehicle's performance, you can also install a number of visual mods, like new hoods or rims, and apply decals and paint jobs. The physical additions that you can add all look nice and allow you to customize your car pretty well, though unfortunately they have no impact on its performance. The vinyls tool is generally good, allowing you to place shapes or logos on any part of your car, twist and resize them and layer them to create whatever you want.Juiced 2: Hot Import Nights has its share of strengths and weaknesses. The layout of the Career mode is nice, and there's lots to do. However, some aspects of the car customization are poor, and the track design is fairly generic. If you love customizing cars and racing them, you'll find some things to like here. But certainly don't expect perfection.", "date": "Sep 25, 2007"}