{"name": "NHL 2K8", "name_review": "NHL 2K8 Review", "ref": "https://www.ign.com/articles/2007/09/26/nhl-2k8-review", "text": "Quick -- how much are the latest hockey rosters worth to you? If you answered $20, NHL 2K8 might be just what the doctor ordered because all your Jackson is going to get you is some current players in their current jerseys.    Is that a bad thing? Yes and no. If you haven't picked up a 2K hockey game in a while and don't have the money or desire to toss your bucks into one of the current-gen versions of the franchise, there's a lot here to like -- stuff like online leagues, leaderboards, 82-game franchises, morale and more. However, if you own 2K7, there's really no reason to buy 2K8. It's not that this year's ice hockey romp is a bad game or a shallow game; it's just that 2K8 is pretty much 2K7.   And the sad part is, 2K7 was pretty much 2K6.   Picture in picture. It doesn't get any better. If you haven't picked up 2K8 yet, you probably think I'm faulting this title a bit too hard. After all, isn't every year-after-year sports game just a fresh coat of paint on last year's engine? Well, to some extent that's true, but not like this. 2K is literally recycling everything from last year -- the menus, the interface, the color scheme, etc. If you covered up the corner logo, there'd be places that you'd have trouble telling which game is which.   Although this series has been known for deep gameplay and franchise options, last year's game trucked out a set of mini-games that were well thought out and fun. ~Free-For-All~ had you trying to score as many goals as you could before the net was blocked, ~In The Zone~ had you keeping the puck in your area for as long as possible to earn points, and the list went on -- as did gameplay option such as Pond Hockey and Mini-Rink.   The good news is that those options return with 2K8, but the bad news is they return untouched. You get the same 15 mini-games without any additions or subtractions, the same pond, the same setup, same everything.    The ice background is gone, but the rest of the interface remains. I might be exaggerating a bit. Skybox mode returns, too and features a bit of a shakeup. No, it's setup with the same objects -- circle around a plush loft to see your stats, unlockable teams and more -- but the game room has been whittled down to just an NHL trivia console. Rest in peace, air hockey and shuffleboard mini-games.    Still, if you look past the slap in the face that is 2K8's carbon copied look, you'll find a hockey game that is still fun to play. If you've played a hockey game in the last ten years, the basics will come pretty easy -- square shoots, X passes, circle checks and R2 is your speed burst -- while last year's Pro Control (click R3 to pass to/shadow a specific player) and the new Superstar Moves (combo-based maneuvers -- such as calling your shot and the double deke -- that have puck handling and agility requirements to pull off) will take some getting used to.  Beyond that, 2K8 is everything you've come to love about videogame hockey: drive to one side of the net, swing it to your wing and hope for the one-timer. On defense, check the hell out of everyone.    2K6, 2K7 or 2K8? 2K did add to its storied franchise mode while neglecting the rest of the game. This year you'll be able to take your team through their preset schedule while dealing with waivers, two-way contracts and salary caps. These improvements might stand out if the franchise interface didn't look exactly like 2K7.   As far as how the title looks on ice, it seems a bit worse than last year but not by much. Players tend to be more jaggy, the can framerate stutter here and there, and the crowd is flat. Literally. They're 2D like a Michael Jordan standup. Still, the game looks decent in motion.Twenty bucks isn't that big of an investment -- you could go to the movies, you could get four Little Caesar's pizzas, or you could buy NHL 2K8 -- but I can't get behind recommending this game. If you already own NHL 2K7, you've got this game and just need to update your rosters. If you don't have a 2K hockey game, go buy NHL 2K7 -- it's the same game and you can get it used for less than $10.Plus, that would leave enough dough for at least two Little Caesar's pizzas!", "date": "Sep 26, 2007"}