{"name": "Streets of Rage 3", "name_review": "Streets of Rage 3 Review", "ref": "https://www.ign.com/articles/2007/09/26/streets-of-rage-3-review", "text": "It was believable at first. A criminal mastermind, operating an underground syndicate of thieves and street punks, gets taken down by three rogue cops. Then it got a little weirder, as a year later the same evil genius rose to power again, only to be dethroned a second time with the help of a kid on rollerskates and a professional wrestler. But here, in Streets of Rage 3, any and all semblance of reality is long since lost  as big boss Mr. X has returned yet again, commanding an army of robots, and you're tasked to eliminate him once and for all by controlling a boxing kangaroo.   Streets of Rage 3 is certainly plotwise odd, as SEGA's Genesis brawler trilogy  which began as a fairly realistic and somewhat dark look at urban crime  is reimagined with giant bombs, controllable marsupials and cyborgs holding Ph.D.'s. The last of that list is the new playable main character Dr. Zan, who is an old man outfitted with electrical weaponry inside his body. The better to zap any bad guys he encounters, which he'll do alongside returning fighters Axel, Blaze and Skate from Streets of Rage 2.   Those three control about the same as in the previous game, and overall this sequel feels much like its two predecessors. It's a side-scrolling, street fighting beat-'em-up with a bit of Z-axis movement, wherein you alone or you and a friend walk endlessly to the right side of the screen and thrash any toughs that appear in your way. We've previously reviewed both of the other Streets of Rage titles on the Virtual Console, and found in particular that SoR2 has held up very well over the years and is certainly worth a download  the verdict for SoR3 is mostly the same, but with a few reservations.     Streets of Rage 3, for example, is a step back from its prequel in a variety of areas. Its presentation feels a little more incomplete, its graphics look like a bit of a downgrade from what had already been achieved, and its soundtrack is somewhat questionable. The presentation issue stems partly from the odd plot, but also from the non-inclusion of Adam as a playable fighter  he was in SoR1, removed in SoR2, fans were saddened by his loss, but he was still gone when this game arrived. The in-game plot's explanation? He's too busy to fight. Oh, sorry, Adam. Didn't realize you had a dentist's appointment. We'll just be over here saving the world without you.   The graphics, which featured larger, more expressive sprites in part 2, were made smaller and grungier this time around. And the music, though actually still very good, couldn't have hoped to live up to the soundtrack established in the second game  because that was one of composer Yuzo Koshiro's all-time best.   But all of this is not to say that Streets of Rage 3 is a bad game, or a bad sequel. Far from it. This is just a classic example of the psychological barriers that get set in place against any kind of follow-up, once you've already achieved great success once before. Streets of Rage 2 is a great game, and Streets of Rage 3 is a good follow-up to a great game. You'll get more brawling action, more stages, some new characters and the like. And it's hard not to recommend more of what made Streets of Rage so appealing in the first place.If you've got 800 Wii Points set aside for just one of the Streets of Rage titles, spend them on Streets of Rage 2. But if you've already experienced that game and want more of the same, invest eight more dollars in this third series installment without hesitation. It's hard to talk about it as a standalone game when it's right there in the shadow of one of the Genesis system's best titles, but Streets of Rage 3 is an impressive experience all on its own. Even if it has a bit of a wacked-out plot.", "date": "Sep 26, 2007"}