{"name": "LocoRoco Cocoreccho!", "name_review": "LocoRoco Cocoreccho! Review", "ref": "https://www.ign.com/articles/2007/09/27/locoroco-cocoreccho-review", "text": "One of the most charismatic and original games to have (and likely will ever) hit the PSP is LocoRoco. The concept is relatively simple - by rotating the land, you cause the little bulbous creatures to roll from place to place while finding other LocoRoco and heading toward the exit. It's easy to play and wildly addictive, the perfect formula for a classic title.   The franchise has now hit the PlayStation 3 in the form of LocoRoco Cocoreccho! While the PlayStation Store title was initially promoted as an interactive screensaver, it's actually much more of a game than something you use to keep your monitor from burning in. However, it's not all that lengthy. The first time through is very quick, possibly on the order of about 30 minutes for most folks, though the first couple times you finish the game you'll open up new areas that extend its longevity. High scores are the name of the game here, and an online leaderboard will allow you to compare your efforts to others from around the world.   Click here to watch the video feature.   While you twisted the world in the PSP game to get the critters to roll from place to place, things are different on the PlayStation 3. Here, you're in control of some sort of magically hypnotic butterfly, which draws any nearby LocoRoco to it, allowing you to control their direction. Holding down the Circle button will create a circle of influence, and any LocoRoco inside will attempt to get to the butterfly. Tapping Circle makes them try harder and faster, thereby causing them to jump higher and farther, allowing them to reach high objects or clear larger gaps. Aside from these basic controls, you're also able to utilize the Sixaxis' motion controls to tilt some platforms, shake tree branches and a bit more.   All of these concepts work rather well, aside from the fact that the LocoRoco sometimes won't do what you want them to (like clear a gap or reach something). There are plenty of puzzle-esque elements in the floating world that reward you with more LocoRoco. Some platforms and such are hidden or out of the way a bit, so exploring the world and trying a few things here or there will generally reward you with more happy little dudes.   While all of that is cool, there's an issue with having to do a lot of waiting around for the LocoRoco to get to you. For each section of the map, the LocoRoco will go around in a loop and pass by a gate until you decide to close it. You can close the platform leading up to the gate at any time, but the gate won't open until you've collected the requisite number of LocoRoco at the gate. So until you've collected said amount, you need to leave it open so that they'll circle the area so that you can lead them off their path to find other LocoRoco.   Total madness! The result of this is that you'll do a lot of waiting for the LocoRoco to make their loop and get back to you if you need to gather a large amount of them. If you only need one or two this usually isn't an issue (unless they're all grouped together), but it can be frustrating when you wait to collect a bunch of them, then a number of them don't jump properly or what have you and fall in a gap, forcing you to sit there and wait for them to come around again. This leads to a fair bit of tedium in an otherwise fun, if brief, title.   The use of a fast-forward feature or something along those lines would have helped here a ton, though unfortunately all you can do is sit and wait while twiddling your thumbs.  LocoRoco Cocoreccho! is a cute and fun title that's unfortunately marred by quite a bit of sitting around and waiting. The puzzle-esque elements are cool, the music and art style are charming and the replayability is decent. However, too much time is spent waiting for the LocoRoco to reach a certain spot, only to sometimes have them fall and force you to wait again.", "date": "Sep 27, 2007"}