{"name": "Go Fish!", "name_review": "Go Fish Review", "ref": "https://www.ign.com/articles/2007/09/27/go-fish-review", "text": "Remember the game Go Fish? Where the person you're playing with would ask you for a card and if you didn't have it, you would say, ~Go Fish!~ Do you remember playing it, then moving on to Crazy 8's because it was a lot more fun? I remember those days as well. Reaxion's Go Fish! is a wonderful reminder of the card game that never could hold its own against the others.   Game play is extremely simple. You start with a certain amount of random playing cards. The object is to collect all four of the same card. For instance, if you have two Jacks, you ask your opponent if he has a Jack. If he has one or even both Jacks, you collect them. Once you have all four, you have a Book. If he doesn't have a Jack, he says ~Go Fish!~ and you pick the top card from the deck to the side. You get another turn if you happen receive a card from your opponent or from the draw deck. The game is over when a player runs out of cards, or there are no more cards in the draw deck. The winner is the person with the most books collected. You can play up to three opponents at a time, either computer controlled or online. If you are able to find three other people online who share the same Go Fish! passion as you do, then you live in a world science may never be able to explain.   The graphics are very colorful and your opponents are animated very well. The game does involve a big of strategy when you play against three other people because you need to memorize the cards their asking for in case you're holding one and want to grab it from them if they didn't ask you for it. The music is lively but after a while it sounds like your two year old cousin got into your room and started walking on your Casio keyboard.   You have the option of creating your own limited customizable avatar. You can choose between playing as a male, female, or a monkey. I opted to go for playing as a sexy female because I don't remember monkeys having a huge Go Fish skillset when I went to the zoo on class field trips. The tutorial is nicely done and walks you through playing the game in case you've forgotten how.  This is definitely a game for fanatics of Go Fish. Since mobile card games like Texas Hold Em or Uno are taking over cell phones, I don't see how this could gain mass appeal. It's nicely done -- the multiplayer module is cool -- but it's Go Fish and unless you love the game, it won't hold your interest. Perhaps if it were packaged alongside War and Crazy 8's it would be a better value. As a stand alone game, it's one that you may end up having to throw back while you wait for bigger fish to come along.", "date": "Sep 27, 2007"}