{"name": "Cunning Fox Backgammon", "name_review": "Cunning Fox Backgammon Review", "ref": "https://www.ign.com/articles/2007/09/28/cunning-fox-backgammon-review", "text": "Who doesn't like a good old fashioned board game? Did you know that some board games are as old as 3000 B.C.? Maybe even older? Did you not learn this in history class? See, this is why our education system is failing us. Kids aren't taught to learn the important things in life. Cunning Fox's Backgammon gives its take on one of the oldest board games in existence.   The object of Backgammon is simple. Get your entire group of checkers home before your opponent does. Starting out with 15 checkers each on the same starting points of the board, the object is to successfully maneuver your pieces home and out of play, while trying to avoid your opponent who is doing the same thing. It's a game where you can use a defensive approach, an aggressive approach, or a combination of both. It's also one of my favorite board games because I suck at chess.   Fans of Backgammon won't find anything new, flashy or spectacular with this version -- which is fine. If a giant explosion went off every time you hit one of your opponents it would probably get annoying after a while. All of the different rules are available for your choosing such as the doubling cube or the Crawford Rule which is normally used in tournament play to avoid a cheap opponent from doubling up on you right before he wins the game. The computer loves to do this to you, by the way.   Speaking of the computer, the AI in this version isn't very skilled. I've played about 300 games on it (I told you I liked Backgammon) and from what I've concluded, the computer relies heavily on getting the exact role it needs to either catch up to you or flat out beat you. One time I had all of my pieces at home except for one who got knocked out (If you get hit, you have to start that piece over at your opponents home field). The computer only had the number 1 and number 4 rows guarded in its home territory. So I had to roll anything but a 1-4. What happens? I roll a 1-4. Seven times in a row. Seven times. I'm not a mathematician, but I'm sure our moon exploding is more believable than rolling the exact same die seven times in a row when you're about to beat the computer. Amp the difficulty up to 9, and sit back and watch the computer get every roll it needs, while you get every roll you don't need. I have it set at 8. Any lower than that and it feels like I'm playing a two year old so I'll deal with the frustrating rolls for now. Online play was nowhere to be found, which is a big disappointment.   The graphics are simple, but sometimes the dice will always land on the same art of the board, and sometimes the pieces will obstruct the view of one of the die. The sound effects appear to have taken about 3 seconds to program because I don't think the magnified sound of a dropped pen qualifies as the sound of rolling dice; I advise turning the sound off. You can choose between different board colors but stick with the classic or wood look unless you like playing the 80's Neon version of Backgammon.   Foxs Backgammon is not a bad choice, but isnt a good one either. Adding online play and fixing some nuances for future versions will certainly help this game out. A better menu system and color choices that wont blind people would also be an improvement. But if youre a junkie and need a quick backgammon fix, this game will do just fine. Until you stumble across a better one...", "date": "Sep 28, 2007"}