{"name": "The Settlers: Rise of An Empire Eastern Realm", "name_review": "The Settlers: Rise of an Empire UK Review", "ref": "https://www.ign.com/articles/2007/10/01/the-settlers-rise-of-an-empire-uk-review", "text": "The Settlers franchise has been reliably pumping out sprogs for fourteen years now, ever since the first pixel-fisted baby shot onto the Amiga in 1993. Over its six incarnations and expansion packs, it's mutated in ways that would - in a harsher environment - have caused it to get ripped apart by faster, leaner games.   Settlers's last two series entries have been disappointing, bending the core resource-management gameplay in aggressive, combative directions that didn't suit it. And more recently, the DS version was a plastic-wrapped turd in a box for anyone unlucky enough to have given it a tedious whirl. If we were writing an overlong headline for this review, it would be ~Has the PCs most established and modest franchise wandered too far into the woods of mediocrity to ever find its way back?~ Then we'd probably say ~Read on to find out...~ to make it sound like we knew the answer.       We do! The answer is no; Rise of an Empire is a better game than we'd feared. As you'd expect, it's certainly the best looking of the bunch, and there's a friendly learning curve. The (unskippable) tutorial is perfectly crafted too, with all the usual stuff about how to use the camera and move units. However, once you get past the short first mission, the game gives you slightly more spaced-apart goals and forces you to work out the intervening steps. It's cannily done - you neither feel left behind, nor patronised. It soon becomes natural to get promoted and gain new powers, and work out what The Settlers series is all about.    And that is: a deliberately sedate town-building game that doesn't go out of its way to dazzle, shock or amuse you. It's so unapologetically twee in that earnest, European way, that it actually becomes a source of admiration. When you first hear your female knight saying ~I believe in justice above all!~, rather than pinch your nose at the stink of ham, you think, ~As you should, fine knight - you are, after all, my emissary in this tiny world~.     A typical campaign round will start off with your knight, plus a basic castle and storehouse. Resources lie dotted around the map; wood, stone, iron, game, fish, and more - as we said, The Settlers is all about the resources. Collecting these resource opens up the production level - wood can be used to make buildings or brooms, deer can be turned into sausages at a butcher's shop, or soap in what, for want of a better work, we'll call a soapery. That's what it's all about - maintaining this network of gathering and production. If the idea of that seems a little bookish and thrill-free to you, you can keep this review relevant by deducting two from the score and reading it aloud in a high-pitched camp whine.   Meanwhile, your knight - the only directly controllable unit, until you get military troops - can roam the land, meeting up with other villages. You can trade with them, but generally they'll just ask you for favours. Especially the monks, who might as well be saying, ~Sorry sir, we accidentally built a church with that last bunch of stone you gave us. Can we, um, have some more please?~. Each knight has slightly different powers - from actively healing sick settlers, to passive powers like bargaining - and, as your influence spreads across neighbouring territories, you'll find more resources to harvest and require more shops to deal with them.     The last stage in a town's development is the military, who can escort your shipments and deal with wandering Vikings. You have direct control over your military, which is a relief because your towns can often feel a little self-sufficient. It's not highly evolved combat by any means, but Rise of an Empire strikes the balance in a fairly satisfying way that's been missing from the last couple of games. It's there, it's done well, but from the faintness of our praise, you can probably guess that it's not going to set the world on fire.   Although economy and resource management are king in Rise of an Empire, there's very little in the way of micromanagement. You won't find screen after screen of sliders balancing production and consumption - that's dictated by your ability to upgrade buildings. Your settlers are completely autonomous, reacting only to your occasional sermons and festivals, and they'll only kick up a stink if they're out of brooms and sausages. You can follow them around their sleepless lives in a kind of needless way, and find out what a tin miner thinks of your castle.     An occasional weakness is the pacing. You'll often find yourself gliding around the map, clicking on people until they say something, just to pass the time while your knight travels across off to reach an event trigger. You'll lose many, distracted hours to Rise of an Empire, but you won't always be sure exactly where all those hours went. It's much the same as MSN - you often won't believe the two-minute conversation it just took you an hour to have. You also have to admit that there's nothing new, here; this game has been made before dozens of times, and Rise of an Empire is basically spit and polish, miles away from a dazzling evolution of the genre.   But this is all part of its charm. The Settlers doesn't have a fast forward button, so you use these moments to look around, spy on people, admiring your handiwork and the algorithms that made it all possible. The fact you're reading this review means you're not dismissive of the genre, if not actually actively interested. If you thought CivCity: Rome was too much like hard work and most RTS games give you too much to deal with, then Rise of an Empire is a lovely, manageable game which really shines in multiplayer mode. If you can convince any of your mates that this is a genuinely valid way to spend their gaming hours, you'll have some slow fun together.Rise of an Empire isn't a breakthrough. It's as far from groundbreaking as you can be. It's like a cat massaging it's favourite cushion before having a comfortable snooze. Hardcore strategy nuts might be left wanting - especially in single-player - but there's no doubting the sedate pace is ideal for the patient and the young. Ultimately, Rise of the Empire does what it sets out to do, and looks pretty good in the process. It certainly won't set your knickers on fire but, just sometimes, that's a good thing.", "date": "Oct 1, 2007"}