{"name": "Hot PXL", "name_review": "Hot Pixel Review", "ref": "https://www.ign.com/articles/2007/10/04/hot-pixel-review", "text": "Damn you Wario.   Damn you and your wares.  I've seen through your tricks, and I finally understand your scheme for world domination through mini-games.  Were it not for you and MegaMicrogame$ released in 2003, we wouldn't be suffering our way through shoddy knockoffs trying to copy your formula of enjoyable bite sized challenges at a frantic pace.  The latest challenger to your title is Hot Pixel from Atari and zSlide, a title that attempts to fuse the mini-game format with skateboard, urban and other popular references.  Unfortunately it doesn't handle either particularly well, with the result that the title is a jumbled, weakly designed mess.   The concept of a plot is blatantly abandoned in favor of presenting you with a large variety of mini-games to complete.  Players initially have 130 different mini-games available to them, which are spread across 10 separate categories or ~episodes,~ such as Underground, Kidult and Awareness.  You get three lives to complete between eight and ten different challenges per episode, such as avoiding incoming asteroids, placing ramps for skateboarders falling from helicopters and shaking leaves off of trees.  A number of classic Atari-themed titles are also represented in mini-game form, with players getting a quick taste of venerated games like Asteroids, Breakout and Battlezone.     Some of Hot PXL's mini-games take from classic titles... For the most part, figuring out what you need to do is part of the challenge of the game.  Depending on the challenge, you'll need to move the analog nub to collect items, hit directional pad buttons or the face, L and R buttons to succeed at your tasks in a specific amount of time.  At the end of each mini-game, you receive a difficulty rating for that particular activity as well as the speed at which it was running.  Depending on the amount of time left over, you'll also get a percentage, which contributes to your overall score for the game.  Once you've attempted the preliminary games, you'll go up against a ~Boss~ game, which will try its best to defeat you.   The largest advantage that Hot Pixel has over some of its similar minded titles is the ability to download more than 70 new mini-games from its website to expand on the gameplay experience.  That raises the total number of mini-games to more than 200 challenges, which can be arranged into different playlists, allowing gamers to create their own episodes to test their skills on their favorite mini-games.  Players can also decide to simply leap into a random assortment of every game in Hot PXL, train themselves on challenges they're not used to, or take on friends.   ... but it's repetitive and tedious play with basic visuals will bore you quickly. Unfortunately, there's a ton of problems that wind up arising with the setup of the mini-games.  First of all, the presentation of many mini-games in Hot Pixel is extremely minimalistic.  While you don't necessarily need impressive visuals for mini-games that last around 5-10 seconds long, some of these are extremely bare boned.  Some even hearken back to the old 2600 days, where the primary characters on the screen were squares, and will probably only provide some nostalgia for those of us old enough to remember what those visuals were like. Even with these limited visuals, it takes at least a good five to ten seconds to restart or load new episodes, which is ridiculous, since the game isn't pushing the system.  Secondly, the mini-games that are included are pretty much variants on the same theme.  There is some variety that will keep your attention for a few minutes at a time, but the gameplay will get old for you very quickly. Even playing the extended version of the boss fights becomes tedious, particularly because the challenge of defeating the levels and advancing to another level descends into monotony.  Considering that you'll be able to go through the entire title in about half an hour, the combination of these facts precipitously drops the replay value of the title, making it a quirky curiosity at best.  Even setting up your own playlists with your favorite mini-games becomes a shallow exercise in entertaining yourself, and you'll quickly look elsewhere for fun.   Another issue is just how random in its scope the title appears to be. There's no rhyme or reason as to why specific games are in a particular episode's category.  For instance, you would expect that many of the paint can and skateboard challenges would be in the Street Sweat episode, but they're not.  Similarly, you have absolutely no explanation as to why you're constantly subjected to clips of a random guy at the beginning and end of chapters.  Other than being a real life mascot for the game (and an extremely lame one at that), there's no reason for his inclusion at all, or for most of the supposed bonus elements that are extremely useless.  Is he supposed to be street?  Hip?  Have some particular link with the theme of the game? As far as you can tell, it doesn't exist, which makes what little concept there is behind the game razor thin.  What's more, I don't want to watch videos of that guy in a video wall after I've seen them once, I can't redeem pixels for anything, and throwing in items like a screen of cola is pretty weak as a bonus feature.It's been said that imitation is the sincerest form of flattery, but this is practically a slap in the face of a title that works really well.  Hot Pixel tries to copy the WarioWare formula, but tedious mini-games, extremely basic presentation and repetitive gameplay without any kind of unified theme or reason for playing the mini-games sucks a large amount of fun out of the title.  Mini-games might be addictive fun, but you're not going to find it within Hot Pixel.", "date": "Oct 4, 2007"}