{"name": "DDR SuperNOVA 2", "name_review": "DDR SuperNOVA 2 Review", "ref": "https://www.ign.com/articles/2007/10/04/ddr-supernova-2-review", "text": "It's doubtful people are ever going to stop buying Dance Dance Revolution games. Titles such as Guitar Hero and Rock Band might have just come to the realization that people like doing things in rhythm, but DDR's known that for a while now and isn't afraid to crank out rendition after rendition.   Now, with our nation split over Iraq and the horror that is the 2007 Chicago Bears crippling sports fans worldwide, Dance Dance Revolution SuperNOVA 2 has come to heal our broken hearts and minds with catchy beats from the likes of Justin Timberlake, Britney Spears and a slew of Japanese pop tunes that are sure to make you stomp your bare feet on a mat that smells like an inflatable innertube.   If you're not sure how DDR works, I'd like to tell you to stop reading IGN right now and go to CNN or something because videogames have passed you by. However, I won't. I'll just give you a refresher: DDR features arrows scrolling upward on your television screen and challenges you to stomp your feet on the corresponding mat icon. The game grades you on how close to being on the beat you are and pumps the grade into your dance meter. If the meter runs out, you fail. If it's got something in it when the song's over, you get a final score to rub in your wallflower-of-a-friend's fat face.    She's the dancing queen. It's a formula that's been solid enough to spawn weight loss plans, have unathletic children pump sweaty quarters into arcade machines and launch a horde of home versions. SuperNOVA 2's controls are as solid as any of the DDR games before it. After so many iterations of the game, you'd expect Konami to know what they're doing, and luckily, they do. You'll need to jump in the air to land both feet on opposite arrows in time, hold one foot down on a long note while the other flails around the mat and generally use every trick you've learned to master the more than 70 songs featured in the game.   Seventy titles sounds like a lot -- and it is -- but the DDR faithful might have a rough time when they first unwrap the game. If they expect to find catchy foreign tunes immediately, they better get ready for a dose of American Pop. To get to the techno beats and J-Pop tunes DDR has made its name on, players will have to wade through Top 40 hits and throwbacks such as ~Every Little Step~ by Bobby Brown, ~Le Freak~ by Chic and ~Say Goodbye~ by Chris Brown.   Now, I'll be damned if I'm going to sit here and let someone disparage the melodic tones and heartbreaking rhymes of Chris Brown, but the slow tempo of ~Say Goodbye~ isn't going to be what the doctor ordered for DDR diehards. As I walked through the steps on screen, I had to listen to DDR Devotees Craig Harris and in-house freelancer Jack cry and complain that Brown and J-Timberlake were the antithesis of everything that made DDR a hit.   Marvelous, indeed! ::Chris Brown is bringing the thunder in his music video as I hop around the mat like a goon::  Jack: Waaaa! This is too slow!  Craig: Look at those arrows crawl up the screen!  Jack: Waaaa! El DDR est no bueno!   Ok. I might have made that exact conversation up, but they said stuff along those lines and people who share that belief need to suck it up. As you progress through the game, you'll earn points for the DDR store and be able to go purchase all the obscure, heart-racing beats you like while folks who love garbage music (see: me) can be happy right out of the box.    The main avenue to earning points and unlocking content will come from DDR's brand new Hyper Master Mode. Joining the traditional stable of workout (input your weight and watch the number of calories you're burning appear onscreen), game mode (single, versus, double) and online (simultaneous play for up to four players, rankings, etc.), Hyper Master Mode gives players five tiers of specific challenges to compete in on their way to the section boss and the ability to progress to the next level. The number of challenges in a level generally ranges from four to eight, and each boasts a different type of challenge -- one mission will have you dancing until the music stops, another will have you finish a song with 60 percent of your dance meter or more, and so on. As you climb the ranks, the challenges will get tougher and the bosses -- which are really just tougher songs that are then available for purchase in the shop -- will be more demanding.   Blue vs. Purple When we jumped into Hyper Master Mode as the blue bodied robot, we cruised through the first few levels of competition before being halted by a rather nasty boss battle filled with double arrows, lefts, rights and so on for NC and NRG Factory's vocal remix of Seduction that challenged us to get 65 or more combos. Although the sudden stoppage was frustrating, it was more challenging than annoying, which is a nice addition to the typical head-to-head battles of DDR pasts.   However, if you are aching for some head-to-head action, Advanced Mode returns to let players create their own courses, play through an unforgiving survival mode (get a rating of good more than four times and you lose), play until their dance meter runs out in Endless, play until their combo ends in Combo Challenge, and enter Battle to dance against each other while unleashing devastating attacks that add arrows to the opponent's screen, remove the onscreen indicators and more.   Sound familiar? It should; with the exception of Hyper Master Mode, these are all pretty much modes we've seen before. It's not a bad thing. Clearly people dig this game more than most, but it does make plunking your money down that much harder -- especially as we see company's shifting their focus to the current-gen consoles. I mean, how much longer before this franchise is completely overhauled?   He's rockin' the dance floor. Personally, I had trouble getting into SuperNOVA 2. It wasn't broken, but it wasn't all that attractive on the PS2. There were jaggies on the character models, the EyeToy didn't add anything to the game except me flying around onscreen while watching arrows, and the color choices were downright awkward at times -- there was way too much neon green in the online chat function.  Like DDR? You're probably going to dig Dance Dance Revolution SuperNOVA 2. You've got 70 new songs to play through, a tried-and-true stable of game modes and a lagless -- at least in our play tests -- online experience to hook you up with fans as obsessive as you are.However, make no mistake about it -- this is the same ol' DDR with a new mode and a new track list. When my time on the mat was done, I felt like I had just gotten done with one of the 173 other versions of the game. There's nothing that makes this one stand out.", "date": "Oct 4, 2007"}