{"name": "NBA Live 08", "name_review": "NBA Live 08 Review", "ref": "https://www.ign.com/articles/2007/10/04/nba-live-08-review-2", "text": "It isn't crystal clear whether it's the intricacy and subtle nuances of NBA basketball that makes it so difficult to emulate in a videogame, or if it's simply a lack of development skill on the majority of the teams that have produced these games (NBA 2K7 not withstanding), but regardless of the reason behind it there's really no doubting that basketball titles simply do not look like their real life counterpart when put in motion. Last year's NBA Live 07 was a sterling example of what's wrong with round ball on home consoles. Though the screens looked solid, as soon as the players started competing in real time things went awry. The artificial intelligence was an abomination, the animations were seriously lacking any kind of realism or fluidity for that matter, and the overall feel of the action was just plain bad.   Now NBA Live 08 is upon us. A year has passed since the failed effort of 07, and gamers have hopefully spent the last year in a love affair with 2K's previous offering so as to erase the memory of Live as quickly as possible. Is 08 the year that will finally see NBA basketball accurately portrayed by an EA-made game? Or is this year's Live just as horrific as the last? Our verdict awaits.   Lace Up Your Nikes   Last year's game was centered on Superstar abilities and refining the dynasty mode experience to deliver fuller and more dynamic gameplay. Ironically this year's entry in the NBA Live series completely does away with the Superstar abilities that were the focal point for Live 07 and has instead put 08's focus squarely on nothing. It seems as though the PS2 version is playing catch up to its next-gen counterparts this year, whereas in the past the opposite has been true.     The Dynasty Mode is still intact, but nothing earth shattering has been added to it. You still go through the rigors of the NBA draft with certain ESPN insights guiding you along the way, but it all feels too familiar with no additions coming to the PS2 edition this time around. It's almost as though EA figured that they had maxed out the system's potential so they kept the list of additions to the bare minimum.    What you will see in the way of new features is the FIBA World Championships, which is an eight-team tournament with a solid helping of countries represented. While the rosters aren't accurate for the USA squad, you will see other NBA players distributed to their appropriate homelands. There's also a scenario mode, but it's absolutely nothing that will expand on the amount of time you'll want to spend with NBA Live 08.   On the court things feel just as familiar, and considering what we thought of last year's effort, that isn't exactly a good thing. Passes still move too slowly, almost at a crawl during some points of the game. Player animations are still very rigid and not free flowing in the slightest bit, and without the Superstar abilities you're left really wondering what they spent the last year doing. Sure, you can click the left stick and make your player's hot spots show up on the court. And yes, go-to moves and lock-on defense - which hurts way more than it helps - are a part of this year's game. But where are the new animations? The subtle refinements to the gameplay that we like to see each year? Sadly there really aren't any to speak of.    A Total Benchwarmer   The biggest change that EA Sports has made to NBA Live 08 is that the camera rotation that used to take place on every change of possession has been replaced by an awkward flash transition. Now when the ball changes from one team's possession to another it just flashes you to the new perspective. The whole thing is very disorienting and isn't conducive to running a smooth fast break at all.   Then there's the fact that the gameplay just doesn't feel real. Shaq can somehow make jumpers from behind the free throw line. Shaq making any shot from behind the free throw line is bad enough, but when you see the seven-footer shooting a jump shot, things just aren't right.    The one positive that we can say for the gameplay is that the Superstar abilities are completely removed, making NBA Live 08 less arcadey and more pure basketball. Not to say that Live 08 doesn't revolve around driving and dunking, because it does, but at least you aren't cycling through the equivalent of superpowers during gameplay. That has to count for something.   The visuals in NBA Live 08 are also lacking any form of panache with very little to speak both on the court and off. Player models are blocky and don't move very well on the hardwood and the arenas themselves are a joke to behold. The aforementioned camera flash instead of a smooth pan really feels foreign and has no place at all in NBA Live.    One thing that can be said in favor of the aesthetics of NBA Live 08 on Playstation 2 is that the free throw camera is much better than what's offered in the next-gen alternative. It brings you right behind the player on the charity stripe, so you get a much better feeling for when the ball would naturally be released in his shot motion. Other than that, the visuals are a pretty bare bag of bones.When the dust settles on NBA Live 08 it will be remembered as a disappointing end  supposing that this is the last in the Playstation 2s life cycle  to a great series. Its just too bad that things couldnt have ended on a higher note, as the developers attention has clearly been on next-gen consoles in the past few seasons. Those who are desperate to do some balling on their aging console have nowhere else to look so heres some advice, go over and play your friends PS3 edition of NBA 2K8.", "date": "Oct 4, 2007"}