{"name": "Spelling Challenges and More!", "name_review": "Spelling Challenges and More! Review", "ref": "https://www.ign.com/articles/2007/10/04/spelling-challenges-and-more-review-2", "text": "Spelling Bees are the elementary school equivalent of the gallows. One by one children come up to a microphone and try to choke the correct spelling of a world they've never used before. Then they droop and slink off the stage in failure, the children left not daring to snicker, knowing that karma will give them some SAT word as punishment. If only there was a game out there to help kids prepare for a spelling bee which was fun, too! Unfortunately the only game that tries to do that is Spelling Challenges and More! and it fails at everything it tries to do. This game is the definition of failure. F-A-I-L-U-R-E.   Spelling Challenges and More! is presented as a game show. At least I think it's a game show since it opens by panning in on the game's host, a portly, middle aged, possibly inebriated man that looks like a puppet. He's standing on what looks like a game show set, if there were no contestants, audience or anything to play the game with. The ~game show~ consists of four rounds: a spelling bee and three other word games. Money is earned each round based on how well the player does. It's not money the player can actually use; it's just a score. Which makes it weird that the drunk Muppet host guy keeps saying ~Show me the money!~ or ~Earn those bucks!~ when I can't even use said bucks.   This may be a bad description of the game because it makes Spelling Challenges sound almost half-way decent.    There's a huge, glaring, problem with the spelling bee portion of the game. See, the DS version of the game, for whatever reason, doesn't use audio for the words, which inherently flaws the entire game design. That's the part of the development process where one would reconsider its production.    Get this: instead of saying the word, Spelling Challenges shows it!   Yes, before asking the player to spell ~present,~ they flash the word ~present~ on the screen, and then give the definition. How did nobody stop and realize how ridiculous that is? Of course I can spell that word; you just showed it to me! Oh man, you only flashed it for a second? How will my meager brain remember six whole letters?!   Blank. That pretty much sums up the experience. At first I thought this might be a title for really young children, but the game had me enter my age and actually set me at a higher difficulty level because I'm an adult. I'm glad I skipped 14 levels right off the bat because I don't know how this game could have gotten easier unless it was just having me repeat individual letters of the alphabet.   There are 100 difficulty levels in the game, so eventually the words get bigger. Since, biologically the human brain is able to naturally retain as many as seven letters, the short term memorization that has been foiling the developer's game starts to get challenged. Problem is, even if the word is longer than seven letters it's still a word like ~compliment,~ which is a level 60 word.    But say the word is long and the player didn't catch it all. Well just like a real spelling bee, the player can ask to have the word repeated. They flash it on the screen again! I might have had trouble spelling ~lugubrious,~ but not if I see it twice.   The developers broke this game trying to bring it to the DS. It's not a spelling bee game at all anymore. This is how I imagine spelling bees for deaf children. Show the word, and then have them try to sign it correctly. In fact, I'd watch that. Imagine if some school conducted a real spelling bee like this though. Little Jimmy is up there all nervous. ~The word is...~ and suddenly a big marquee lights up with ~poncho~ written across it. If my 7th grade spelling bee was like that I would have won for sure!   The irony is that the host of the game talks. A lot. He doesn't seem to shut up. He explains the rules of each game, and is so excited about the money I'm earning that I think he might get a cut. It's a crime that the annoying host gets to jabber on, but I don't get to hear how to pronounce ~alluvium.~ The sad fact is this auditory omission is unnecessary. If someone was willing to pony up the cash for a bigger cartridge, they could have fit the words, or at least most of them. If the game makers are unable, or unwilling to provide a necessary component of the game, then the title should be moved to someone else, or cancelled.   This grave error would be understandable, though probably still not forgivable, if the developers thought the rest of the game was so good that they had to get it out somehow. The problem is that the rest of the game sucks, too! There are 10 minigames to accompany the spelling bee portion and players complete three of them each round. But to claim these are 10 separate games is incorrect. Odd One Out, Right One, Fifty Fifty and Bomb Blast are all essentially the same thing. Likewise Not Noun, Hit or Miss, Catchword and What Is It are all pretty much the same thing. The first group has the player identify misspellings, while the second group is about identifying word forms. Minor variations don't make for completely new games. In addition to those eight, but really two mini-games there is also an anagram solver and a hangman clone.    This is probably the worst version of Hangman I've ever played. Worse than playing it as a child in the back seat of my parent's minivan with my 5-year-old brother that would always pick ~poopy~ as his word. First off, no hanging guy at all. Guessing the wrong letter just subtracts from the time limit. The best part of hangman is the prospect of killing someone with my inability to spell. Second, the game does not display which letters I already guessed so I don't hit the same one twice and get deducted time for it. If I do pick a wrong letter, the game freaks out and blocks the entire keyboard just to tell me no.   To complement the mix of insulting and frustrating games is the design's terrible interface. The touch screen is used to type in all the words, but for whatever reason the letters are laid out alphabetically. If it were a QWERTY layout then it could as least help teach kids where letters are on a keyboard (an inherent feature in every Nintendo DS system's PictoChat function), not to mention make the game faster and more intuitive for anyone over 12.   The whole time I'm playing this atrocity my ears are being assaulted by what can only be described as the soundtrack of a 1980s low budget sci-fi movie. I don't need tense synth music to tell me I'm awesome at spelling. I've got the puppet host to kiss my ass for me.  Spelling Challenges and More! is a broken game. Sure, it does what the developers made it do, but the very concept is completely flawed to the point of being, well, pointless. A spelling bee game that shows the player the words is a laughable concept, and anybody could have told the developers that. This game could have a future as a teaching tool for remedial classes, or possibly English as a Second Language courses, but it's not a game. It's an A-B-O-M-I-N-A-T-I-O-N.", "date": "Oct 4, 2007"}