{"name": "dothack//GU 1: Rebirth", "name_review": ".hack//G.U. Vol.1//Rebirth Review", "ref": "https://www.ign.com/articles/2007/10/05/hackgu-vol1rebirth-review", "text": "Before we dive into this review, let's go over some online jargon for all you noobs out there. PK stands for Player Killer, PKK stands for Player Killer Killer, and MMORPG stands for Massive Multiplayer Online Role-Playing Game. Oh, and a noob is someone entirely unfamiliar with these terms.    Of course if you're an online junky, you already knew all that. And if there's one thing the offline .hack series does best, it's cater to the online junky. Not only do the .hack games let you participate in an online MMORPG (offline in reality), they let you troll message boards, send e-cards, read emails and check the news. You can even transfer data from one game to another, since the .hack series is also known for consisting of several games that share an over-arching storyline. The idea behind all this of course is to immerse you in a world where reality and fantasy mix, and immerse you it does.     The G.U. series takes place two years after the original four .hack games end. CC Corp. has created a new version of their popular MMORPG ~The World~ after the original game's server was destroyed in a fire. This new version allows players to battle each other in an arena, join any number of guilds, and participate in various sidequests. The game quickly becomes popular and people spend countless hours online playing. Everything is just peachy in ~The World.~ That is until a pack of PKs--some infected with a mysterious malware virus known as AIDA--start terrorizing newcomers by killing them every chance they get.    Enter the game's hero Haseo, a PKK armed with a seriously sick sword (it doubles as a chainsaw), armadillo armor, and a major chip on his shoulder. His goal is to take on all ~The World's~ PKs, especially Tri-Edge, a player who PK'ed Haseo's online girlfriend so hard her real life persona fell into a coma (insert your own juvenile comment here). At the start of the game, Haseo has finally tracked down Tri-Edge and challenges him to a duel, but something goes terribly wrong and the next thing Haseo knows his character level is down from 133 to 001. Not only does this cause him to lose his awesome sword and armor, but nobody believes he was once the PKK known as the ~Terror of Death.~ Determined to set things right, Haseo decides to join a special online guild known as G.U., which is not only investigating Tri-Edge but also the virus AIDA. What follows is a trip to the Internet's dark side.   It's showtime! The first thing players will notice right off the bat is that the G.U. battle system is a major improvement over the last four .hack games. For example, instead of having to hack and slash your way to a dungeon just to hack and slash some more, you can now warp directly to any area you want using the game's main hub, known as a Chaos Gate. Simply walk up to the gate, choose three keywords from a list and voila: instant access to bugs and beasts.  Once you use the Chaos Gate to get a dungeon, you can initiate battle by coming into contact with any group of monsters you see on the field. You can even ride up and crash right into them via a steam bike, a vehicle you acquire mid-game that makes travel time a little less harrowing.   Once the battle begins, a magnetic force field leaps up and entraps your party in a small area, making escape impossible (unless you have a smokescreen). What ensues is a real-time battle in which you control Haseo's movements with the analog stick while the game's A.I. controls the other members of your party. Since the combat system has been entirely rebuilt, combo attacks can now be unleashed right in the middle of a fight by simply hitting the R1 button and choosing from a list of skill triggers. If you use a certain amount of these skill trigger attacks on a single monster, you'll generate a rengeki (Japanese for combo attack), which will add even more damage. There's even a feature known as Awakening Mode, which blasts all of your characters with extra stats to help you slaughter enemies faster. The frame rate is actually pretty decent during these attacks, so there are no awkward pauses or hiccups during battle. The only real issue is the camera, which has the turning radius of a shopping cart. Half the time you won't see enemies coming your way until they're already close enough to smack you upside the head.    On top of having the ability to use special attack moves without having to stop and go through a list of menus, you can also participate in an Avatar battle, where you use Haseo's Avatar (a cross between a gundam and an aeon) to datadrain opponents. Unfortunately, the developers skimped on what could have been a very cool feature. The problem is that Avatar battles consist of nothing more than mashing the square and circle buttons while jerking the analog stick around in an attempt to datadrain another Avatar. It's like a shooter game suddenly pops up in the middle of a boss fight. And if you lose the battle, you can just try again. Over and over again. It's boring and, quite frankly, it's stupid.    Despite this glitch in the new battle mode there is still more good news to report. ~The World~ itself is very much like something you might find in WoW or Everquest, albeit on a much smaller scale. As Haseo you'll wander the same fields and fight the same monsters, visit the usual weapons and armor shops, have the same conversations with people you'd have in a real MMORPG, and be able to trade with NPCs to acquire rare items that will help in battle. Treasure chests and extra stats can be obtained by kicking objects or a variety of cute, fuzzy creatures. Your party members will even speak in Leet (please excuse my editorial eye roll). Never once do you have to worry about lag time, glitches, or the server breaking.    Wait. Weren't we just here? The music and graphics are also enjoyable. There are plenty of catchy tunes in the game, especially the theme for Mac Anu and the Field Areas.  Meanwhile the game's designers do a great job with the CG cutscenes by not only giving them a rich, lush look with special cell-shading, but they also have made character movements smooth and fluid. The Voice acting is a bit hit or miss in Rebirth, but then again the VAs are stuck with some pretty oddball translations, so they get points for trying to make their lines sound as natural as possible.    Unfortunately, this is where the good news ends and the bad news begins. You see, the biggest problem with Rebirth's gameplay is the utter lack of it. Most of the action takes place offline, where you either check email or sort through game forums in an attempt to move along the plodding storyline.    Ah! Get out of my face! For the first few hours of the game this online community feature is pretty entertaining, allowing you to switch between a desktop and ~The World.~ The desktop features a ring of icons that you can toggle through to check email, send e-cards, skim through message boards, look at fanart and watch online news clips. This loses its appeal pretty fast once you get deeper into the game, however. Too much time is wasted having to go through pointless board threads in the hopes of finding keywords that open up certain areas or hint at special items. Sidequests require you to log on and offline constantly to figure out what you're supposed to do next. This is frustrating because it's so unnecessary. All of this could have been avoided by giving players the option of checking mail or boards using ~in-game~ icons that will blink new if anything important comes up.   Another major time suck from gameplay is the endless cutscenes, which last for minutes at a time but do little to advance the story. You're forced to become a bored spectator as Haseo is lectured on why he should appreciate ~The World's~ polygonal flowers and digitalized geography.  It's like the developers were desperate to stretch the storyline over three games but didn't think to make it more detailed, so they put in some filler.    Speaking of which, the game does a lot of recycling.  The same models, the same dungeons and even the same text pops up quite a bit, adding to the tedium of level grinding and completing quests. Add to that the game's low enemy count and you've got a real problem.  When making a video game of any kind, it's important for the developer to keep in mind gameplay. Rebirth lacks this rather core element, which makes it hard to recommend despite solid graphics, great sound, and a much improved battle mode. You'll be stuck watching Haseo and his online compadres as they ponder the meaning of life ~The World,~ and may be tempted to just log out.", "date": "Oct 5, 2007"}