{"name": "Line Rider", "name_review": "Line Rider Review", "ref": "https://www.ign.com/articles/2007/10/06/line-rider-review", "text": "Line Rider, a bona fide net game phenom, is soon making the full transition to traditional gaming platforms -- but along the way, Line Rider has stopped over at mobile, courtesy of publisher In-Fusio. The game celebrates inventiveness. You are given a toolset to build and then tinker with a track for Bosh, a little sledder that dutifully goes for the gusto, no matter how much peril you place in his path. It is truly a game that dispenses reward based on what you put into it. If you just load it up and expect instant magic, you will be disappointed. But if you take the time to learn the tricks of track building, Line Rider is hours of smiles.   You create a track from a variety of lines, such as one that accelerates Bosh for getting up inclines or a destructible line that Bosh rips through, leaving only flying vectors in his wake. After assembling the track, you can test it out and see how Bosh fares. If he falls off a point or doesn't quite make it through a loop, it's easy just to go back in and tweak a section of the track. Keep at it long enough and you'll have a fun little ride for the sledder.   In-Fusio's mobile edition of Line Rider is slightly hamstrung by the limits of the screen. The cellphone display makes it a little difficult to create an intricate track, as you cannot see much of the field when zoomed in to add detail or give your creation of bit of nuance. Zooming all the way out to see the entirety of the course makes it impossible to really be detailed. And there is no real happy medium. You will spend a fair amount of time just scrolling between two points of your track to make sure you're on course.   Once you've finished building a track and marveled at Bosh's run a few times, the game is far from over. In-Fusio has loaded Line Rider up with some very cool community options. You can upload your track to a server for other players to download. Once you download another track, you can rate it and then even start tweaking it yourself. The on-line tracks can be sorted by the highest rated or by the most recent additions. If somebody uploads something vulgar, it can be marked as inappropriate.   Line Rider also includes a puzzle mode where you must construct a track so Bosh successfully sleds through a series of orange flags. This is a cool addition, but I admittedly spent far more time just checking out all of the community stuff and just building my own tracks for fun.  Thanks to its smart and easy-to-use community features, Line Rider is a real winner for mobile gamers that are starting to move beyond puzzlers and poker. I highly recommend this fun, creative game to casual gamers with a creative streak. Get involved, share your creations, and really start enjoying the kinds of fun, different experiences that should start redefining mobile gaming.", "date": "Oct 6, 2007"}