{"name": "NASCAR 2008", "name_review": "NASCAR 08 Review", "ref": "https://www.ign.com/articles/2007/10/06/nascar-08-review", "text": "EA Sports gets more than a little flak from non-sports gamers for mere incremental improvements to their core franchises year on year, and for some games, it's warranted. With NASCAR, however, the idea of just throwing in updated rosters and playbooks doesn't really hold any water. Instead the improvements year on year are far more incremental, and it's actually been a full two years since the last major improvement, the Total Team Control that let you jump from car to car in the pack and issue orders to the rest of the team on the track.    This time around, however, there's really not a whole lot that's new to the formula. In fact, some things were actually taken out of the experience this year, and though the PS2 version actually fares a little better than the next-gen versions, due to the fact that it's largely unchanged from NASCAR 07, the fact that some of the more gearhead-oriented license tests in the PS3 version and the ability to swap between your entire team from the last two games is gone (though you can still issue orders to them with the right analog stick) blankets the entire experience with an overwhelming sense that little -- if anything -- of real merit has actually changed here.    Turn left. Then turn left. And then keep turning left. That doesn't mean the game is entirely devoid of fun, mind, just that it's rather lacking in new features. The biggest one is probably Earn Your Stripes Mode, which plunks you into the driver's seat in one of a handful of teams as you work your way up through the ranks from the Whelan Modified Series up through the Craftsman Truck Series, the NASCAR Busch Series and finally the granddaddy of 'em all, the NEXTEL Cup Series. Sure, you can just drop into Chase for the Cup Mode to cut straight to the final 10 races of the season, but the bulk of most players' time is going to be in Earn Your Stripes.   Tucked between a set of initial one-time challenges to determine where along the career path you'll start and the final victory lap at Ford 400, you'll slowly make friends and enemies on the track by either sharing your draft speed with them or pushing them to wreck by building intimidation (pulled off by simply scooting behind someone and tapping X or Square, respectively). Both are important not only because they'll help you notch points toward your overall Charisma and Flair. Along with Front Running (your ability to stay ahead of the pack), Race Strategy (slipping into the top 10 while piggybacking off alliances and rivalries built up over the season), Precision (driving/passing cleanly), On the Charge (your ability to pass other cars) and overall Experience, Charisma is probably the most tangible link between laps and races.    The Home Depot sure does know how to race. More minor additions this time around include the ability to tweak your car as you see fit, adjusting gear ratios, downforce, weight distribution and the like and then take the car out for a test lap, comparing the data and saving specific settings to help best put you in a position to take the checkered flag throughout a full season, plus the ability to earn medallions by completing simple challenges like finishing in front, passing cleanly and so on, the option to save mid-race (a godsend for those masochistic enough to slip into the coma of 500 laps of unblinking determination), and the ability to spend skill points to rewind the game a few seconds to avoid a crash.    These additions are rather minor, and really just build on the admittedly solid but ultimately familiar experience that the series has settled into over the years. On the one hand, it means that more experienced players shouldn't have too much trouble getting used to, say, the way a particular racing vet does on a certain superspeedway, but it also means that the builk of the game's spontaneity will come from just working your way up through the ranks in Earn Your Stripes.    If nothing else, NASCAR 08 actually ends up being a better play experience on the PlayStation 2 over its next-gen big bro, mainly because of how solid the controls are. Whereas the slightest spaz attack while manning the analog sticks in the pack on the PS3 would probably equal a nice little meeting of plastic and cement wall, steering out of a could-be wreck on the PS2 is actually fairly easy, even with the AI getting a little more testy on the higher difficulty levels.     Online, the game feels a little weak. Only four players at a time can actually jump into a race together -- compare that to the dozen people that can hook up online with the PS3 version -- and when four people with even decent connections get going, the field turns into a jittery, poppy mess of AI cars, leading to more than a few unnecessary accidents. If you're playing with the game's new Car of Tomorrow models, the obvious nod to safety holds true, meaning less massive pile-ups, but it's still annoying. Couple the lag with a lack of persistent online features like teams and it all feels like a distraction rather than something that could have actually added some depth and longevity to the experience.   Perhaps the biggest area where the game mirrors previous entries is in the visuals. NASCAR 08's engine isn't terribly far removed from last year's game (EA talked about a slightly improved damage model, but it's hardly evident unless you happen to get the back of your car sheared off in a particularly nasty wreck). Switching off Yellow Flags and charging the wrong way into the pack (admit it, it's the first thing you do in a NASCAR game) results in cars choppily rolling over each other as huge, blocky chunks of the body are torn off, revealing an almost PSone-level of detail underneath.   Crashes don't look nearly as good as they could. The framerate is solid enough offline (even in the pack), but there are odd spikes here and there, and with all the aliasing and flicker, it can actually be straining on the eyes. At least the lighting is fairly solid and during some evening races, the game can almost look pretty at times, but this aging engine certainly won't be pulling down any end-of-year graphics awards.    The audio is likewise competent, but not overwhelmingly amazing. Plenty of attention was paid to individual engine sounds, though, and the almost hypnotic drone of the engines does a great job of alerting you to dropping RPMs going into corners. Pit chatter is kept to a minimum and serve's its purpose, but you're obviously going to hear a lot of repetition over the course of a season. Soundtrack-wise, the dozen songs that loop through the menus (though not the races, thankfully) fill the obvious void of Midwest jangly rock, but aside from Velvet Revolver and Brooks and Dunn, most of the names aren't going to be instantly recognizable.    With the PlayStation 3 nearing its one-year anniversary, it's not entirely surprising that the PS2 versions are starting to feel a little tired compared to their hi-def brothers, but it's exacerbated even more here by the fact that NASCAR's underlying experience is so incredibly average. With so many amazing racing games, from sims to arcade crash-a-thons, NASCAR 08 no longer fills a niche larger than the actual sport, and while that may be good enough for die-hard fans of the sport, it's definitely not going to satisfy casual racing fans.", "date": "Oct 6, 2007"}