{"name": "Spider-Man: Friend or Foe", "name_review": "Spider-Man: Friend or Foe Review", "ref": "https://www.ign.com/articles/2007/10/06/spider-man-friend-or-foe-review-2", "text": "It was after a particularly tedious battle, somewhere in the first stage of the first level of Spider-Man: Friend or Foe, when poor Spidey himself summed up his own videogame experience better than we ever could.   ~Do you think this ruins the fun, with us always winning?~ the animated Webcrawler asked no one in particular as we stared at the screen in glazed-over boredom.   Yes. Yes it does.   The action-adventure brawler, developed by Next Level Games and published by Activision, started out with a unique idea - that Spidey would battle a horde of mysterious baddies with the help of his sworn Marvel-universe enemies. But what begins as an interesting premise turns out to be the most ordinary of gaming experiences, and Spider-Man: Friend or Foe very early on proves itself to be its own worst enemy.    At the beginning of the game, Spidey is drafted by Col. Nick Fury of S.H.I.E.L.D and brought aboard a ~helicarrier~ for a quick mission briefing. Someone, it turns out, is using symbiote-soaked meteorite shards to control the minds of supervillains, who are, in turn, wreaking all manner of havoc. It'll be Spider-Man's job to defeat them, recruit them, and fight along side them to find the mastermind.   But despite the game's glossy coating and promise of a lively team-based brawling experience, it becomes clear very early on that Spider-Man: Friend or Foe is little more than a mindless churn.    There are three types of basic enemies: small, medium and large. Throughout the game, they behave basically the same, with small differences as the levels progress. From level-to-level, their look changes to match the environment, but - for the most part - they don't seem to get much smarter, aggressive or powerful. And there's no difficulty setting, so you're stuck with the level of challenge the game offers, which is shockingly little.   And despite your travels to exotic locales like Nepal, Tokyo and Cairo, the entire game feels the same. It's predictable, uninspired and plain.   Even the structure of each level is exactly the same. It works like this: Go to a location. Your path forward is blocked. Enemies spawn. Kill them. Your way becomes clear. Move forward. Cross a bridge. Your path forward is blocked. And on and on and on.    The good news is, if you like walking across bridges, then Spider-Man: Friend or Foe is the game for you. Whether we were in Tokyo, Cairo, Nepal, Transylvania, or a tropical island, we killed enemies to make bridges appear.     You're also asked to collect ~secrets~ throughout the game to unlock multiplayer arenas, but we found most of them simply by walking where the game told us to. But even walking/jumping around in the game can be a challenge due to the fact that there is no camera control and your character sometimes disappears behind blind walls or walks through textures. With so many millions of bridges to cross, it can be a problem.   Speaking of multiplayer, Spider-Man: Friend or Foe offers little in this department. There's no online multiplayer (or co-op for that matter) and the local battle arena mode is limited at best.   But in an apparent effort to keep things interesting, Next Level built in a sort of character upgrade system, which succeeds somewhat, but is seriously flawed. Here's why.    Each time you leave the helicarrier and head down to play a level, you choose a fighting partner to go along with you. You start with the Prowler and unlock more characters as you play through the game. They each have special attacks and can team up with you to perform co-op Hero Attacks which are actually a lot of fun to watch, but can usually only be used once per stage.   Although it's unclear why, the in-game currency consists of tech tokens, little glowing thingamabobs that burst out of nearly anything you can punch (rocks, vases, crates, barrels) and some things you can't (your fighting partner). As you play through the game's battle sequences (of which there are painfully many), you'll collect tech tokens to spend on upgrades back at the helicarrier.     Tokens not only serve as upgrade cash, they also disappear in small increments every time you automatically respawn after dying in battle, which, by the way, is ridiculously hard to do. But do you die for good when you run out of tokens? Nope. You simply continue to respawn infinitely, in the exact same spot, until, we assume, the sun crashes into the Earth and destroys this game.   The problem becomes that it takes tokens to buy upgrades, but the upgrades don't matter because you can't die anyway, so why upgrade? Sure, you can die in a boss battle, but guess what? You can't use any of your special abilities on a boss anyway, so, again, why upgrade?   And that's what's ultimately so frustrating about Spider-Man: Friend or Foe. Some of the web upgrades are actually fun and rewarding to use, but they feel completely unnecessary because the gameplay demands nothing of the player. As a test, we replayed an entire stage in the first level of the game using nothing but a single attack button. We sailed through with a yawn.    As another test, while trying out the game's two-player co-op mode, we took Spidey and our chosen foe/partner, Silver Sable, to a cliff-top stage in the game's island-themed level. The predictable number of predictable-looking Phantom enemies spawned around us, and we set our controllers down, let the game continue running, and walked away for 30 minutes.   When we came back, our characters were still standing, and somehow the enemies had all thrown themselves off the cliff, probably out of boredom. Reluctantly, we picked up the controllers again and played through the rest of the game, with nothing to lose but time, small bits of our souls, and all manner of faith in all that is good and holy.      We played the Xbox 360, PlayStation 2, Wii PC and PlayStation Portable versions of the game. With the exception of the PSP version, all the above played the same way and seemed to contain the same storylines, battle system and upgrade mechanic (although in our tests, the PS2 version ran noticeably slower than the 360 version and had significantly longer load times). The Wii version is identical to the PlayStation 2 version with very few Wii-centric enhancements: shake the nunchuk to change characters, and waggle the remote during a throw to modify the move. That's it.  Ultimately, Spider-Man Friend or Foe feels like a lazy attempt to cash in on the character's license. The game is obviously geared most toward the younger set, but even kids like a bit of challenge, right? Despite its downfalls, the game has its moments. Hero attacks are fun to see, many of the upgrades are well-designed and exciting to watch, and the voice acting is redeeming  during battles, we found ourselves longing to return to the ~helicarrier~ just so we could hear the ship computer's jokes. But mostly, we just longed to be done with Spider Man: Friend or Foe.", "date": "Oct 6, 2007"}