{"name": "World Class Soccer", "name_review": "World Class Soccer", "ref": "https://www.ign.com/articles/1999/07/07/world-class-soccer", "text": "In Atari's moves to fill the Lynx game library with sports titles, the latest entry is World Class Soccer. As the title indicates, this is a portable version of the worldwide ball-kicking sport for one or two players. Two teams from around the world face off for a one-game bout, trying to score the most goals in the time given. Basic soccer rules and penalties apply, including throw-ins, corner kicks, and fouls. Game options allow setting the length of the game, from 10 to 90 minutes, the field conditions, and the computer difficulty level.    World Class Soccer has the makings of a quality title; unfortunately, its good points are outweighed by numerous quirks in the gameplay. On the plus side, ball control is fairly effortless, with automatic dribbling and easy passing and kicking controls. On defense, you can steal the ball either by kicking or a sliding ~tackle~, and you have full control of the goalie as well and all squad members. The field scrolls from side to side, while the screen zooms in and out of the action as needed.  While the game ideas are sound, the actual result is lacking and hurts the playability. Control automatically goes to the man closest to the ball, which causes quick control changes it enters a crowd. There is an option to manually change the active player, but it doesn't work at all. The zooming screen tends to focus closely on the ball, creating tunnel vision; long passes are impossible to coordinate, and you may be controlling a player or goalie who's off-screen, impairing your defense further. Players can choose teams from a hundred countries, but the only difference is the flag used. These and other problems make following the game very difficult and frustrating. Playing well is possible, but requires a lot of practice.  Like the game itself, the graphics on World Class Soccer are a mix of good and bad points. Images and sprites are respectably drawn and animated, and look well even when the screen is scaled to its smallest point. On the down side, the scaling is too slow to effectively show where the active player is, and the scrolling is often very jumpy to keep pace with the ball. Sounds are even less inspiring, composed mostly of a bouncing soccer ball mixed with periodic whistle blows and a simplistic crowd cheer.  This game has the ingredients for a quality soccer game, but assembles them into a disappointing ensemble that could have been better. While the hard-to-follow game action can be overcome with perseverance, only devoted soccer fans will care to invest the time that World Class Soccer requires for mastery.", "date": "Jul 7, 1999"}