{"name": "Xybots", "name_review": "Xybots", "ref": "https://www.ign.com/articles/1999/07/07/xybots", "text": "Daleks, Replicants, Terminators, Robotrons, Xybots -- the robots are at it again. EarthBase 26-B9, a remote station in the Federation's intelligence network, has been completely overrun by the alien Xybots in a surprise attack. Recovery of this base is of the highest priority; since you are the closest agent available, you must infiltrate the station, battle the Xybot forces, and stop the Master Xybots from taking over. Now!  Storyline aside, Xybots is a Lynx adaptation of the Atari Games' arcade title. One or two players must travel through the station's levels, as seen from a first-person 3D view. As you wander through the maze, you can grab coins, keys, and weapon enhancements, all while fighting the various Xybot forces. Your battlesuit will protect you, but it loses energy through time and from attacks; if it runs out, you are captured and the game ends. Reach the exit, and you have an opportunity to buy more equipment before going even deeper, featuring trick walls, transporters, and even more dangers.    Though a few recent Lynx games have been disappointing, Xybots is happily not continuing the trend. This is a respectable version of the game, with all the features of the original. The enemy comes in many different forms, using various defenses while firing on your position. Your gun fires unlimited shots, and an energy-draining zap can temporarily freeze the Xybots. The main action is seen from directly behind your fighter, and a second screen showing the level layout and status information is available. Every tenth level or so is a fight with a Master Xybot, but the main game remains maze-running and robot-blasting. Temporary enhancements such as robot locators and extra firepower are available, but financial frugality will help you survive later.  The game is not perfect, however, since the Lynx version is a little easier than the coin-op. The Xybots are not too bright, and often spend time waiting until you are in range before attacking. They are still dangerous, but you will rarely have to worry about being overwhelmed. You also start with 35 coins, enough to stay well-armed for three or four levels. As a result, the game may seem to start off slow for more experienced players, but Warp Exits allow travel to the higher stages quicker. Overall, Xybots on the Lynx remains formidable, but don't be too surprised at the initial progress you make.    With Xybots, the Lynx once again pulls off game graphics that look almost completely identical to the arcade. The station mazes are spartan, drawn with identical wall panels, but enemy Xybots and other game items are well-animated and detailed. Other visual extras such as the teleporter and the transition between stages have been duplicated exactly. The only shortcoming is that rotating your view is done with a 90-degree ~snap~, which can be a little disorienting.  Sounds are also very faithful, with the few blasts and explosions of the original copied closely. The mechanical Xybot voices have been removed, but in their place are several quality techno-rock background tunes. Though enjoyable, they can be turned off from the title page if desired.  Xybots on the Lynx is a solid translation, presenting an acceptable version of the game on the go. While the difficulty has been scaled back slightly, there is still more than enough of a challenge to keep the typical player back for more.", "date": "Jul 7, 1999"}