{"name": "Allegiance", "name_review": "Allegiance", "ref": "https://www.ign.com/articles/2000/05/04/allegiance", "text": "Allegiance is a refreshing addition to the latest wave of space combat games coming out this year. It's a remarkable and intriguing blend of the space fighter and RTS genres. And since it's all online against human opponents, the challenge and excitement level remains high. But while Allegiance offers many tempting innovations, the mechanical complexity of the game will overwhelm some gamers. Those who are willing to climb the steep learning, however, will certainly be rewarded for their efforts.  Since the game is online only -- apart from the indispensable training missions -- the workings of the game servers is of primary importance. I have to say that I was really surprised in this case. Since the game is hosted on the Zone, I expected to experience all the usual problems associated with the Zone. But Allegiance, despite some occasional unsteadiness and connectivity issues, worked pretty well. Even better, you can start the game without having to open the endless series of windows that normally characterize Zone games.  The other end of the multiplayer story has to focus on population and community. In this respect, Allegiance seems to have a pretty good following. I've found some pretty full games at nearly all times of day. I've even come into work at 8 in the morning and been able to find a good game of forty players. Most of the games tend to gravitate towards the same sort of options (conquest mode with unlimited lives, eject pods and single investors) but you can find a few variations of the game playing here and there.  The complications of the game arise mostly from the overabundance of controls. While this is the bread and butter of some gamers, it becomes confusing. I don't really think that Allegiance follows the model of most space combat games that have one foot each in the action and sim genres. This one feels like all sim to me. There's a very steep learning curve here. Just the individual ship controls alone take a long while to get used to. The upside of all this is that once you have a handle on controlling your ship, you can do just about anything you want to. But this flexibility comes with a steep learning curve. It's not that it's so difficult to start playing the game, but success in Allegiance is a combination of both your skill as a gamer, and your ability to memorize lots of controls.  And when you add in the responsibilities that come with the Commander or Investor roles, things get even more complicated. The Commander is responsible for directing the action on the strategic level. Fortunately the interface for this is as simple as it can be while still maintaining a good amount of flexibility. Equally fortunate is the fact that most of the Commanders playing Allegiance know better than to micromanage their squads. While issuing a command is a tad complicated, receiving and responding to a command is relatively simple. While you don't have to follow the commands if you don't want to, you'll find that the Commander is usually better aware of what's going on across the whole theater of war and therefore better equipped to distribute resources...that's you, you're the resources.  But there are other more resources than just people. The game's economy is founded on He3, a resource mined from the many asteroids floating through space. The mining ships, piloted by the computer but directed by the Commander, pick up the He3 and bring it back to the base where it's converted into cash and used to finance technological research and the purchase of some of the bigger ships. The designers originally hoped that the individual players could handle their own share of technology investment, but it doesn't seem that anyone is using that option now. Instead it seems like all players are forced to donate their cash to the Investor and he determines the research paths.  It's really cool to see gamers changing the game to suit their desires and their perception of what's fun. Sort of like the never used economic model in Tribes. One horribly frustrating ~optional feature~ that nearly everyone seems to use is eject pods. When your ship is destroyed, you automatically eject...if the damage wasn't sufficient enough to kill you outright. In this slow and unmaneuverable pod you have to make your way all the way back to your star base before you can launch again. This results in a lot of down time when you can go make a snack or take a shower. It's sort of like the scam in EverQuest where you pay Sony ten bucks a month just sit down every twenty minutes to regain health. You can be picked up by other pilots on your own side but they usually have too much else to do.  But if there's one thing that Allegiance emphasizes, it's teamwork. That's why it's called Allegiance after all. You've got to work together and coordinate your efforts as a squad or you're screwed. In games like Tribes or Team Fortress a hotshot, lone wolf player can make a huge difference to his or her team, but an Allegiance player has to cooperate and coordinate his efforts with other players. Otherwise a more coherent team of less skilled individual pilots can run away with the victory.  Just like the individual player roles (pilot, commander, and investor), Allegiance also offers a range of functions within the ship choices. Scouts are really fast and nearly indispensable in the early stages of the game. The Interceptor excels at base defense while the Stealth ship is best suited for base assaults. If you just can't make up your mind, the standard Fighter offers a nice mix of the three other ship types but since it doesn't really excel in any one area, you'll have to find ways to capitalize on your opponents' weaknesses. Allegiance also offers Bombers for taking out enemy installations. Huge Destroyers equipped with missiles can make short work of enemy fighters. The Frigates and Cruisers that come with the highest levels of technology require both a pilot and any number of other players employed as turret gunners.  All of the ship outfitting is handled at the hangar screen. Here you can choose any of the ships that your team has researched and your team investor is willing to pay for. The basic ships are always free so you needn't worry about stingy investor types -- they're only needed to approve Destroyers and Bombers and the large capital ships. Once you've selected your ship type, you need to place the various weapons, shields, ECM, cloaking devices and various other systems on your ship.  As I said before, the ships come with all sorts of control options from vector locks to oblique thrusts. While these take a while to master, it's the difference between living and dying as far as I'm concerned. Overall the ~feel~ of the flight engine is very satisfying and the ships have a believable sense of mass. If all you had to do was point the ship in a direction and go forward, then there'd be no problem. But with the addition of all the other movement features, things get a lot more complicated. And believe me, even if you're not using the ship's mobility to the fullest, your opponents will be.  But as with all things, you get nothing for free. Microsoft requires a ten-dollar monthly subscription fee for all Zone members. I know, I know, but there's nothing you can do about it. They have been kind enough to include a free one-month membership just so you can get those first few weeks of play in for free. With membership come all sorts of pilot rankings, squadron profiles and other neat options. Microsoft has magnanimously included a free game server link on the start-up screen. So you can still play Allegiance online without having to pay the fee -- although you still need a Zone ID -- but you won't get the pilot rankings and some of the other more gratuitous features.   So Allegiance is complicated. But like I said before, some gamers thrive on this more involved kind of experience. Those of you looking for a more accessible, arcade-like game may do better to go looking somewhere else. But if you've got the patience to become familiar with all the controls, and you're willing to work within the framework of a team, and you've got the chance to train and drill with a squad, then Allegiance can be very rewarding. In any case, Allegiance offers some tough human competition in a gorgeous and intricate universe.  -- Stephen Butts  For even more ongoing coverage on Allegiance, you should head over to IGN's Allegiance Vault", "date": "May 4, 2000"}