{"name": "NBA Live 08", "name_review": "NBA Live 08 Review", "ref": "https://www.ign.com/articles/2007/10/09/nba-live-08-review", "text": "When we first got word that EA would be expanding its sports division to encompass Wii fully, we were psyched.  The company nailed Madden in the Wii's opening year, following it up with a slightly less polished version of gaming's greatest football franchise, but still one that is well worth the cash, and evidence of hard work and dedication from EA's Wii department. Surely Tiger, NBA, and FIFA would follow suit, right?  Right?   Wrong.  NBA Live 08 for Wii is easily the weakest EA effort thus far on Nintendo's system, and that includes Madden, FIFA, Tiger, SSX, and even MySims; it's simply too thin.  From the game's preliminary boot it may seem as though NBA Live has everything a Wii-owning b-ball nut would want, but it's simply not true, as the game lacks dynasty mode, create-a-baller, or any actual resemblance of true-to-life basketball strategy whatsoever.  This may be a game ~anyone can play like a pro~ in, but if Wii isn't your first system, or if NBA Live isn't your premiere basketball experience you'll be hugely disappointed with what it has to offer.    NBA Live features the same EA Family Play modes as Madden and FIFA this year, allowing virtually anyone to pick up a controller and get a simplistic sports offering with knowing little to nothing about videogames at all.  In NBA Live Family Mode you'll worry only about shooting, passing, stealing, and blocking, each assigned to either vertical or horizontal waggle as the players move around the court automatically.  Unfortunately the game just isn't fun to play, as it's far too easy to sink shots, you feel disconnected from the game entirely, and the motion isn't always as responsive as you'd like.     Oftentimes we'd have enough time to post up for a shot, repeat the action again to try and bypass the wonky motion detection, and actually have enough time to holler at another IGN editor to witness the lack of jumpshot taken while we flick up and down repetitively.  Sure, most of the time the motion works just fine, and though it's extremely simple it's still pretty responsive, but when it glitches out, it does it with reckless abandon.  In a smart move by EA though, ramping up from Family Play to full control mode is a smooth transition; simply plug in the nunchuk and you're good to go.    As for options and game modes, NBA Live is playing shorthanded compared to the other versions.  Online is there, and from what we've played it's pretty decent overall as far as connection speed and lag goes, but you'll again only be playing single games with no online tournaments or added play modes.  Go into a lobby or join quick-play; simple as that.  Dynasty mode has been removed - something that even PS2 has - but the game is visually stronger when pitted side-by-side against the PS2 build, and runs in 16:9 and 480p.  Season mode is amazingly basic though, allowing for little more than trades and scheduled games.   Instead you've got Party Mode, which consists of two mini-game modes; the three-point competition, and slam dunk contest.  Both are extremely simple, using just a few Wii motions to shoot the long ball or pull off a variety of dunks in a active cinematic play mode - chose the dunk, do the motions, watch your player slam it home - but neither mini-games hold a candle to even a single Madden mini from 07/08.  It's just too thin.  A Wii-exclusive ~Challenge Mode~ has also been included this year, which basically takes a variety of superstars and puts them in classic game situations, having players complete challenges one-by-one as they rise the ranks of NBA history, but again it's amazingly basic.  Pick your challenge, play through it, rinse, and repeat.   It may not have a ton of different modes or depth, but even still that'd be fine of the core gameplay was on par with other EA efforts on Wii.  Unfortunately, it isn't, as NBA Live is full of odd graphical and gameplay glitches; it is entirely unbalanced, far too easy, and a shell of its former self. Motion control is spotty and unreliable, character animations lack the necessary in-betweens to give off a fluid, realistic look, and gameplay is a mess, often disregarding rules like pass-in time limits, lane times, backcourt violations, or the like.      With the game running in default settings we fired up our first full exhibition math with the Miami Heat, only to realize that Jason Williams was unconscious from three-point range; he simply couldn't miss.  Attributing it to his ~star~ ability we started passing through the starting line, shooting three after three while in single and double coverage; swish.  Finally we got to The Diesel himself, Shaquille O'Neal.  Remembering his keen ability to miss the backboard while shooting free throws, we posted Shaq up at the top of the arc, and nailed swish after swish with the big man from 24 feet out.  Apparently it's true:  With NBA Live 08 for Wii, anyone can play like a pro - even Shaq.  For the record, during that game the big man was more Kazaam than he was O-Neal, as he went on to shoot 18/22 from beyond the paint; an 82% accuracy rating.  The NBA Jam version of Shaq can't even post those numbers.   Of course when you crank up the difficulty levels the game starts to even out a bit, but even still it lacks the depth, solidarity in team control, and strategy that makes for a true game of basketball.  Instead, you've got an easy-to-play, dumbed down version of NBA Live; something that only b-ball newcomers will want to touch.  As far as presentation goes, the model detail is pretty strong, thought he game suffers from the aforementioned animation oddities and glitches that constantly come up.  The audio section is by far the game's strongest point, including some solid hip hop tracks - Toxic by Mark Ronson is a must-hear - and decent commentary during games.  It's a shame that the rest of the package lacks as much quality as Live's audio effort.  NBA Live 08 is EAs weakest attempt on Wii thus far, hands down.  It lacks the polish, depth, or passion of any of the other motion projects had, removing full modes and options of the other console versions while also skipping on any of the expected Wii additions.  Were not talking about the included Family Play mode, or the games Party Mode which includes two mini-games; were talking about seamless motion control that works in more ways than just a simple button press, Wii-specific modes that truly make use of the consoles strong points (IR being one of those, something never used in NBA Live), and the intuitive Learn Madden equivalent mode of NBA Live, where players instantly are greeted with step-by-step tutorials and a range of training modes that familiarize them with the Wii hardware.  Mii integration doesnt make a PS2 title turn Wii overnight, and neither does waggle control or sympathetic gameplay.  Its obvious NBA Live was a low-priority, back-burner product, as the game suffers greatly during its Wii conversion.  Heres hoping next year brings a deeper, more intuitive and entertaining game of NBA Live.", "date": "Oct 9, 2007"}