{"name": "Cocoto Fun Fair", "name_review": "Cocoto Magic Circus Review", "ref": "https://www.ign.com/articles/2008/03/27/cocoto-magic-circus-review", "text": "At least in the US, Neko Enterainment's Cocoto franchise hasn't exactly lit the videogame market afire  this little devilish imp and his cohorts have been invading European systems for years, and occasionally they'll sneak out of their territory for a little fun stateside, like their racing game Cocoto Kart Racer. Conspiracy Entertainment snagged Cocoto's latest ~adventure~ on the Wii: Cocoto Magic Circus may not be a great game, but of Conspiracy's Wii line-up this one trounces the likes of Ninjabread Man and Billy the Wizard.   Cocoto Magic Circus touts ~40 mini-games~ on its cover, but it's more like ~40 ways to shoot targets.~ This game isn't much more than a cute clone of Namco's Point Blank, letting players use the Wii Remote like a zapper and shoot on-screen targets in short 20 second challenges. Some of the targets are living, moving creatures, while others are images of those living moving creatures on planks of wood. Some challenges are one-shot deals that players can only complete if they hit the target with a single bullet. Others are interesting shootouts where they'll have to blast specific enemies in front of a secondary target to take it out. To make things more interesting, balloons are constantly floating in front of the players' way which will trigger penalties like shaking the screen or turning the screen upside down.   Shoot the golden apples.   The whole game revolves around Cocoto's fairy friend being kidnapped by an evil clown who's run off with her into his carnival, and players must plow through the different gun-shooting challenges to take out the clown once and for all. The game's progression, however, is a complete mystery to the player; you're never told how close you're getting to the end of the game or how far into the challenges you are. You're just faced with a level, you finish the level, and you move onto the next level. Over and over and over, with basic boss battles and ~golden apple shootout~ as a reward scattered within the progression..   Perhaps not showing players their progress was the developer's way to surprise the player when they get to the actual end of the game. For those who want a quick experience, you're going to get it with Cocoto Magic Circus: it won't take more than an hour to get from the start to the end on the normal difficuly setting. The multiplayer options give the game a bit more length since as many as four people can compete for score in a choice amount of challenges. And the arcade mode can be played in co-op two player, which alters the individual levels to accommodate the second player.   Even with 40 different levels, many of the challenges are simply recycled a bunch of times. And some challenges aren't very friendly to players who aren't familiar with the Cocoto franchise: many levels ask the player to shoot at targets but ~don't shoot your friends!~ and if you had no idea who Cocoto and his friends looked like you're at a complete disadvantageespecially since the imps look just as evil as the bad guys in this game. Cocoto Magic Circus is a short but ever so slightly sweet gun shooter. There's not much to the game but aiming and shooting, and the ~adventure~ is over within the hour that you start it. Other than multiplayer features the bulleted list is rather short: no unlockables, no extra modes, no original gameplay, and the only statistic tracked is an overall high score. It's just a bunch of point and click using the Wii Remote, but after surfing through a ton of Conspiracy Entertainment stinkers in the past few months, this one was a surprisingly fresh breath of air.", "date": "Mar 27, 2008"}