{"name": "Yu-Gi-Oh Tag Force 2", "name_review": "Yu-Gi-Oh! GX Tag Force 2 Review", "ref": "https://www.ign.com/articles/2007/10/10/yu-gi-oh-gx-tag-force-2-review", "text": "Part of a freelancer's job with just about any writing gig is to charge headlong into a sea of horrid licensed games and rejected mascot pap because, frankly, nobody else wants to - and rightly so; the normal day-to-day reviewing duties of your average editor are filled with enough crappy gaming experiences to scare away newcomers for life, so it takes a particular kind of masochism (and an empty bank account) to happily skip into the minefield of review rejects.    The plus side is exposure to games you would have never even considered otherwise. Granted, in the case of a franchise like Yu-Gi-Oh!, it also means having to dig through an extra layer of mythos and mechanics that seem incredibly daunting (and make no mistake, if you've never dabbled in the Yu-Gi-Oh! universe, it's almost offensively complex), but there are times when even an overwrought battle system and humdrum day-to-day activities can meet in the middle to absolutely destroy any semblance of productivity.    She looks chipper. This is precisely what GX Tag Force 2 does -- provided you give it the chance and you've got a genetic predisposition to card collecting sessions and more than a few hours of deck tinkering -- and though the game is clearly aimed at kids (just look at the art style, which is identical to the first game), there's more than enough depth here to provide even older PSP owners with something to chew on for weeks if not longer.    The core idea is that you're a cutesy little super-deformed student at a dueling academy, a school set up for kids who just want to throw down - card battle style. If it sounds like a complete dork is summarizing the myriad plot and character details, that's because I'm wholly unfamiliar with the manga, anime and games (yes, the series comprises a trifecta of different mediums, as ultra-popular Japanese franchises are known to do). Even still, it wasn't just the crack of the freelance whip that had me wanting to play more; beyond the teenybopper visuals, there's a stunningly complex game.    The Winged Abomination of the Ninth Circle. Just kidding, he's harmless. Too complex, truth be told, for newcomers, who get absolutely zippo in the way of a hand-holding tutorial right off the bat (it's there, but you'll have to chat with someone first to find out it's nested under the Database Menu). In addition, a good hour of trial-and-error and reading of the almost encyclopedic (and at times confusing) help guide is near-required reading for newcomers, but like all collectable card games, once you have the rules, turn order and mechanics down, the game spirals down into a vortex of rock/paper/scissors-canceling monsters and spell cards that can easily drain an afternoon in a single sitting (provided you're near an outlet or have a spare battery, mind you).    Hell, there's even a mode that will read any UMD and generate cards from it just like Monster Rancher. (Finally, a use for all those UMD movies, eh? Hooo hoooo! Eh... yeah...) That's in addition to the cross-talk between PS2 versions and the obvious Wi-Fi battles (Ad-Hoc only, which is a crying shame given the nature of the game and the fact that Konami already kicked out a Infrastructure-free first game) and the downloadable extra cards you can get by hopping online through your PSP (and, if there's Infrastructure support, why no online matchmaking?).     Through the cunning use of half-assed research, I've found that Konami didn't exactly go nuts on improving the game after the first entry. As mentioned before, the visuals, a cute little isometric view during exploration and a slow-moving top-down trudge through the monster-rich bowels of the school, are more or less unchanged from the last game. This time around, you'll bag a dueling partner right from the start, allowing you to jump into 2-on-2 battles without having to jump through any courting hoops (this also applies to the battles, now expanded to up to 4 players), and you can designate a Destiny Draw card to bust out when you're on the ropes allowing for a potential comeback, but otherwise the game is more or less what was seen last time around.    For Yu-Gi-Oh! freaks, that's likely beautiful news, because again, the actual card battles are exceptionally deep and multi-tiered. In fact, the game is so insanely deep that trying to run through just the basics would require another three pages. I mentioned the complexity before, but newcomers will probably have to sit through hours of tutorials and reference info to properly understand the full process of summoning, special summoning, chains, using particular cards during specific phases, sacrificing cards from your hand, swapping out cards from a Side Deck for best-two-out-of-three Duel Matches, and so on.   I know, right? Granted, the game is based off the New Expert Rules set from the trading card game, but it's beyond imposing for newcomers. It doesn't help that the sometimes quizzical translation is competent, but spelling and light grammar errors cropped up with startling frequency, from help menus to tutorials to conversations. At times it was an amusing trip into near-Engrish, but more often than not the mistakes just required re-reading a line, and others read like I had friggin' written them. ~A Spell Counter is a type of counter that is put on cards that use Spell Counters~? What? Seriously?   Some parts of the interface can feel a little cramped as well, (yes, even with 16:9 real-estate; there are simply times when a bunch of text is crammed into a column only two or three words wide), but the overall look of the game certainly holds up well. The PSP's screen affords the game plenty of opportunity for crisp, clean character portraits during conversations, and some of the warping cards and slightly trippy backgrounds during duels at least serve to throw some eye candy onto the screen. No, it's nothing that shows any signs of actually flexing the PSP's 3D muscle, but as 2D goes, things are at least clean.    Aurally, things are just as tolerable, but again there's nothing here that will absolutely require a pair of headphones. You'll get some light rock, a few more languid harpsichord or swingy little jingles, but aside from the chirpy menu effects, there's not so much here that you'll even have a whole lot of reason to play the game with the sound on. I didn't really feel the need to kill the audio, but in the interest of saving some battery life, it's a fair sacrifice.  Lots of text to read. Should you actually invest the hours into learning the quirks of the game, the rewards are certainly there for the taking, but the single-player part of the game really just serves as a foil for deck building and basic training. With nearly three thousand cards to collect, it's obviously a necessary step, but the main draw is going to be playing against friends in duels -- something made even more obvious by the inclusion of the new 2-on-2 Wi-Fi battles. Amazingly, even with Infrastructure support for downloading more cards, there's no online multiplayer. It was bad enough that the first game didn't offer any online play, but Konami completely missed out on what could have been an insane amount of replay value. The game also misses a golden opportunity to actually bring newcomers into the fold. I've been teased by card battle games in the past enough that I know I can learn to love a good one, but the prohibitively -- almost offensively -- high barrier to entry is going to turn off far more people than it will coax them into playing. The digital versions of a TCG are supposed to be the easy (and comparatively cheap) way to learn to play, but at this rate, Yu-Gi-Oh! won't be snaring any random passers-by anytime soon.", "date": "Oct 10, 2007"}