{"name": "Half-Life 2: Orange Box", "name_review": "The Orange Box Review", "ref": "https://www.ign.com/articles/2007/10/10/the-orange-box-review-2", "text": "There's never been a package on a console like The Orange Box. For $60 you get five games: Half-Life 2, HL2: Episode One, HL2: Episode Two, Portal, and Team Fortress 2. If you're keeping score, that's one of the best shooters of all time, its two expansion packs, a new and innovative puzzle game, and an off-the-wall multiplayer game. That's in one box, on one disc. If there's one must buy game of the year, it is, without a doubt, The Orange Box. All five components are excellent, with Half-Life 2 and Episode Two being the two finest single-player first-person shooters on Xbox 360.  Accessing the five games is easy, thanks to a simple, but elegant menu system. You can hop into any of the Half-Life components without having beaten the prior versions. So, if you've played Half-Life 2 before, you can skip it (though you really should play it again), and go right into the episodic content. Also included for every game (save HL2) is director commentary which offers an in-depth look at level and map design as well as story elements for the Half-Life universe. It's about as slick a package as you will find on a console. The only failure is the horrendous box art, which I'm pretty certain was designed by a select group of mildy-talented fifth graders.  Because The Orange Box contains so many pieces, Microsoft made several exceptions to its normal rules regarding Achievements. While there are still only 1000 Gamerpoints to be earned, there are 99 Achievements to unlock (as opposed to the normal limit of 50). You can also access unique Achievement lists inside each title that are game-specific. There are some well-planned Achievements to be had. Add some spice to replaying Half-Life 2 by trying to earn every Achievement. It's quite a challenge.   Half-Life 2Episode OneEpisode TwoPortalTeam Fortress 2  Half-Life 2 There's little debate that Half-Life 2 is among the greatest shooters ever made. Despite having played Half-Life 2 three years ago on PC and two years ago on the original Xbox, I still have fun playing through yet again. Anyone with decent skill can burn through the full game in about ten hours, but those are some truly quality hours. Half-Life 2 can go toe-to-toe with any shooter of the past three years.  If, by some strange chance, you haven't played Half-Life 2 before, here's the set-up. You play as Gordon Freeman, a former scientist who, while working at Black Mesa, accidentally opened a portal to another dimension. After saving the world in the original Half-Life, you were tucked away in a bizarre form of stasis, not to be awakened until humanity needed you again. Guess what; humanity needs Gordon Freeman again. With crowbar in hand, you must free City 17 from the extra-dimensional military force known as the Combine.   What helps Half-Life 2 stand out, particularly for a console title, is the use of physics. Most games that use physics do so merely to wow you with some nifty visuals. Half-Life 2 uses it for gameplay. And not just in isolated cases. The design is built around the physics engine. The world Gordon Freeman inhabits feels organic. This is as immersive an experience as you can get, both from the excellent voice work and the exhilarating gameplay.  The physics come to life once Gordon gains the gravity gun. With this tool in hand, you can catch an enemy grenade out of the air and shoot it back their way, unplug wires to lower barriers, and move debris to help you access new areas. While the crowbar has long been representative of Gordon Freeman, it's the gravity gun that remains the most important constant through HL2 and its subsequent episodes. While there is a decent assortment of other weapons, none will treat you as well as the gravity gun.   Half-Life 2 rarely slows down to allow you to catch your breath, instead pushing you faster and faster as you progress through the story. Much of the narrative is told through the action. The story never gets in the way of the action, but just as importantly, the action never interrupts the story. Half-Life 2 is the very definition of an epic adventure. The level design is outstanding. Though you sometimes have to return to an area you've been to before, there's almost no back-tracking whatsoever. There is almost always an alternate route on the way back somewhere so that it never feels as if you are retracing your steps. Bungie and many other developers could learn a lot from Half-Life 2.  There are a few issues, though, that keep HL2 from being the greatest thing since grated cheese. There are several times during the campaign when Freeman is assisted by AI teammates. Though these guys and gals perform well in a fight, they can often get in your way when trying to move about small places. And though there is a command to tell them where to move, the AI often ignores these orders or will simply refuse to stay put and let you get through a corridor. As with the PC version, there are mid-level loads that halt the action. Unlike on PC, these loads are not a few seconds, but often 30 seconds to a full minute. This is especially aggravating when a load comes during a high-speed chase. Lastly, the visuals are not as good as they should be on 360. This is clearly a port of the original Xbox version. The resolution has been kicked up, the textures are better, and the framerate is solid save a few random moments. But it could look much better (as Episodes One and Two prove). Even compared to the PC version from three years ago, the visuals for HL2 on 360 aren't stellar.  Half-Life 2Episode OneEpisode TwoPortalTeam Fortress 2   Episode One Episode One came out on PC a year ago, but this is its first time available for a console. So, for 360 owners, this is a brand new experience. Ep. One picks up right where Half-Life 2 ended. From the opening scene, you'll notice a big difference in visual fidelity between HL2 and Episode One. Better textures and lighting are obvious, but the character models are refined and the facial technology is greatly improved.   Episode One pairs Freeman with rebel fighter Alyx, as the two attempt to escape City 17. As Valve freely admits, Gordon Freeman is a ghost. He has no body and no voice in the game. You won't see him in third-person shots as you do Master Chief in Halo. You won't hear him yip-yapping. He is a crowbar and a grav gun, but nothing else. It's the other people around Freeman who add a human touch to the insane and improbable events that occur. In Episodes One and Two, Alyx becomes the emotional centerpiece for the series.   There is an astounding moment as Episode One opens. Freeman is discovered, buried under some rubble. When Alyx sees him, her facial expression is as sincere and human as you are likely to have ever seen in a videogame. Though the other characters you meet have some good facial work, Alyx is a cut above the rest. Over the course of the three-hour adventure (yes, sadly, Ep. One is very short), a bond will grow as Alyx becomes as central to Half-Life's plot as Gordon Freeman.  The pacing in Episode One is noticeably different from HL2. There are far more moments to catch your breath and there are stronger story elements added. This also leads to a real lack of awe and wonder during the majority of Ep. One. With the exception of the final few minutes, there are no grand moments as were seen in Half-Life 2. The sense of wonder at a Strider passing overheard is gone. The excitement of exploring a new environment is also never provided.    Episode One is by far the weakest of the five pieces included in The Orange Box. While it's enjoyable, it adds only one new enemy (zombie Combine), no new weaponry, and has you racing through similar environments to Half-Life 2. That isn't to say it's not enjoyable, but considering HL2 is one of the best shooters of all time, Episode One is a bit disappointing. Its saving grace is the relationship with Alyx, which manages to make Freeman a more relatable (if still invisible) character.  Half-Life 2Episode OneEpisode TwoPortalTeam Fortress 2   Episode Two Episode Two takes Freeman and Alyx out of City 17 and on the road to the wilderness rebel outpost in the White Forest. As with Episode Two, there are no significant weapon upgrades. In fact, there's only one new weapon that you get at the end of the episode -- and it's a doozy! But many will find fault with the lack of innovation with weaponry. These episodes are, according to Valve, what would have been Half-Life 3. And as such, you would expect a large variety of new weapons and enemies. This is Episode Two's one failing. And I mean it's only real failing. Episode Two is awesome. And, yes, in spite of its short length (about five hours), it is better than Episode One and Half-Life 2.  Episode Two is the perfect balance between the epic battles and constant action of Half-Life 2 and the story-driven elements of Episode One. You'll blaze through the forest in a retooled muscle car, explore the wondrous underground caverns of the Antlions, battle alongside the ass-kicking Vortigans, and finish off with a jaw-dropping and insane battle certain to leave you craving for Episode Three. But amidst the action is some significant narrative that finally begins to answer some long-standing questions. Alyx continues to grow as a character and is a true companion at this point. Her AI has been given a boost as well, so that she takes cover in combat and lends aid. She really is the perfect girlfriend; she never complains, is always supportive, and can cap a Combine soldier from 300 yards. It's impossible not to care for her by the end of Ep. Two. If you don't, there may be something fundamentally wrong with your soul.   One very significant new enemy was added for Episode Two. Hunters are smaller versions of the Strider. Where the Strider is meant to provide heavy artillery and take out vehicles and buildings, Hunters are designed for clean-up work. These nimble killers are sent in after Striders have decimated an area. Their goal is to make sure not one human is left breathing. Hunters are an awesome enemy and aren't relegated to only minor appearances like Striders. You will see these bastards often in Episode Two. They bull charge at you in the open, climb through open windows, and won't give up until either they are dead or Freeman is buried.  Updates to Valve's Source Engine can be seen almost from the moment you boot up Episode Two. The main addition is some new lighting technology. While Ep. One looks great on 360, Ep. Two is even prettier. The neon blue glow of a Hunter's flechettes and the luminous grubs in the Antlion lair are particularly impressive. It's a little disappointing that Valve didn't give at least Episode One a makeover with its new tech. If you play through all three pieces of Half-Life 2 on Orange Box, the visual evolution is quite stunning.   To review The Orange Box, I played Half-Life 2 on through Episode Two. Experiencing all three pieces successively offers an interesting perspective. Though little has been done to add new puzzle elements or weapons over the past three years, Valve has vastly improved the visuals of the series and, more importantly, the storytelling. Though I think Half-Life 2 is a blast, I never found it particularly engaging. Episode Two does many things better than HL2, with better pacing and a more interesting storyline. I can't say I will rush back to play Half-Life 2 or Episode One anytime soon, but rest assured that Episode Two will earn a second spin in my 360 this weekend.  Half-Life 2Episode OneEpisode TwoPortalTeam Fortress 2   Portal Portal is Tetris for the next generation. It's a new kind of puzzle game that finally takes advantage of the 3D space and does something fresh and innovative. Set in the Half-Life universe (there is a direct story link to Portal in Episode Two), you play as a test subject at the Aperture Science Center. With an experimental portal gun in hand, you must navigate through nineteen levels, each time with the goal of reaching the lift to the next challenge. There is also a promise of cake should you complete the test.  The portal gun is ingenious. One trigger fires a blue portal, the other fires orange. You (or any object) go into one portal and come out the other. Shoot a blue portal at the ceiling and an orange one at the wall next to you. Step through the wall and you will find yourself falling from the ceiling. You maintain your momentum through a portal, so that you can create an infinite fall and gain incredible speed. Then, as you fall, aim your next exit portal from a slanted overhang. You will shoot out at incredible velocity, allowing you to leap a hundred yards to another ledge.   Progressing through the levels, your character discovers a few areas where the test scenery has been broken off. For brief moments, you can step behind the scene and read mad scribbles from previous test-takers. ~The cake is a lie!~    Pushing you forward in your training is the disembodied voice of an AI program. The dialogue is comic genius, the kind that is very hard to come by in a videogame. You will likely laugh out loud at some of the things the AI program says during the course of your evaluation. She has a sardonic wit that plays well against her robotic voice. The sense of humor is slick and adds quite a lot to Portal, which is not a particularly deep game.  The first fifteen puzzles in Portal are a real breeze. You can whip through them in a half hour easily. And, more than likely, you'll be wondering why anyone was making that big of a deal over this game. But it's the final few levels that will tax your brain a touch and add enough exciting story elements to evolve Portal into something beyond just a puzzle game. Few of the puzzles are difficult to solve, though the execution to get past them can be a challenge in the last two stages. Still, the puzzles themselves aren't that creative. It's the concept of Portal that shows ingenuity. And, all told, you should be able to beat the game in two hours.   However, it should be noted that advanced versions of puzzles unlock once you beat the game, as do time trials and other challenges. Tackling these will add considerable time to the play clock. Portal doesn't fully deliver on its promise, but is certainly a game worth playing. If nothing else, it has the greatest song to ever play in a game's credits.  Half-Life 2Episode OneEpisode TwoPortalTeam Fortress 2  Team Fortress 2 Team Fortress 2 brings two things rarely seen on Xbox 360: humor and good class-based multiplayer. TF2 offers a cartoonish style that nicely contrasts its brutal gameplay. Taking on any of nine different roles, up to sixteen players compete on a total of six maps in objective-based games.  The class system is what helps TF2 stand out among other 360 titles. The nine different roles are very unique from one another, so that playing a Soldier and playing a Demo Man are very different experiences. There are the previously-mentioned classes for those who just want to shoot stuff or make it blow up, but there are other classes that rely more on skill than brute force. The Engineer isn't much use in a firefight, but he can set up teleportation nodes and turrets, making him an invaluable asset. The Medic fires a healing gun at teammates to support them in battle. He can even turn them temporarily invincible. And then there is the Spy, a class certain to be a favorite. The Spy can assume the guise of any other class while appearing to the opponent as a member of their own team. But being a Spy isn't just about looking like the enemy, you have to act along with the disguise. You can't pretend to be a sniper and then run out on the frontlines like a jackass. The other team will know something's not right. There's some actual depth to playing a Spy. Most of the other classes are a little less complicated, but no less fun to play. TF2 gets the class system right by making each role beneficial to the team and also enjoyable.  Controls in TF2 are very simple. You jump and fire weapons. That's really all you need. The left trigger is alt. fire, right trigger is primary fire. The bumpers switch weapons. It's simple, the kind of game that anyone can jump into and have fun with easily.  There is no deathmatch in TF2 and with each class having unique skills, there is an emphasis on teamwork. Going solo isn't going to help you win a Control Points battle on a map like the Well. While PC gamers are often good at playing nicely together, that's not always the case with console owners. So this teamwork requirement could turn games ugly on Xbox Live. That's not Valve's fault in any way; it's just the nature of console gaming. That's why a deathmatch option would have actually benefited the objective-based games -- since those who want team play can group together and leave others to mindless mayhem.   Each of the six maps has one game type attached to it. This helps in that the map itself was designed specifically to cater to one gametype (CTF, Attack/Defend, Control Points, or Territory Control). But this also hurts the diversity considerably. One thing that is great about Halo 3 is that the multiplayer is almost infinitely customizable. There's no customization here. Six maps with specific game types, and no way to distinguish your Engineer from another. No color alterations or unique icons.   Check out our video Head-to-Head between The Orange Box on 360 and PS3 right here. All six maps in TF2 are fun to play so long as you have at least eight people in a match. But I question the longevity of TF2 multiplayer. Will people be playing the same maps, with the same game types in six months? There are also some performance issues. I've had some big matches that ran just fine, but other matches (even ones with only four players) that were plagued by lag. Without a strong connection from the host, TF2 has some issues. When things run smoothly (and gamers aren't acting like idiots), TF2 is among the best multiplayer options on 360. It's ridiculously fun. There's nothing else available on any console like The Orange Box. Though you could argue that Half-Life 2 is old news by now, there are still four components of the Box brand new to consoles. That so much great content is offered at the standard single-game price is astonishing. Playing through Half-Life 2 again and then continuing on through Episodes One and Two is like batting with the '27 Yankees. These are Hall of Fame titles; it doesn't get much better than this. Throw in Portal, an imaginative puzzle game with a wicked sense of humor, and Team Fortress 2, one of the few multiplayer games to get the class system right, and you have a tremendous package. And all on one disc. While Portal and TF2 may not be strong enough to stand on their own, coupled with the Half-Life titles, The Orange Box really is one of the best games ever released.", "date": "Oct 10, 2007"}