{"name": "SEGA Rally Revo", "name_review": "SEGA Rally Revo Review", "ref": "https://www.ign.com/articles/2007/10/10/sega-rally-revo-review-3", "text": "Now this is a SEGA game. Rally Revo isn't just a fun rally racer. It's a return to SEGA's arcade roots at just the right time; the same roots that made the company such a success as a hardware manufacturer and software producer in the 1990s. Of course, the classic arcade game design in SEGA Rally Revo also comes with a few elements that may frustrate or let down some, which is why we recommend the title with just a few caveats. One thing is for sure, though -the heart of Rally Revo is good old fashioned fun.   SEGA Rally Revo is rally racing stripped down to its purest arcade form. Customizing your ride goes as deep as picking off-road or road tires, one more suited for controlled powerslides while the other provides better acceleration and top speed. And that's about it. You can swap in some pre-made liveries and choose between a manual or automatic transmission for any of the 30 some-odd cars, but victory and visual flair are derived entirely from your skills at the wheel. Forget about tweaking the weight distribution, trading brake pads, or purchasing new rims to show off your fancy wheels. This game is so focused on the driving itself (some might even call its off-track feature set shallow), that everything outside of the race is streamlined down to just a few choices.      The success in Rally Revo comes in the fact that the game is instantly fun and attractive as soon as you hop onto a muddy track. The game essentially boils down to an exercise in powersliding around turns properly. And, well, sliding around corners is cool. Rally Revo uses a central pivot to rotate the car around as a control mechanism which is fairly standard as far as rally games go. This allows for some great arcade handling, an area where this game does not disappoint. SEGA Rally Revo does have a steep learning curve. Beginners, in fact, will likely find themselves sliding back and forth from one invisible wall to another.    As an aside, those invisible walls are seriously frustrating for beginners. Sometimes it is hard to tell where the track ends and the unforgiving barrier on the edge begins. The visual queues aren't always a cinch to recognize as the track often blends into the surrounds quite well.    But once you get the hang of letting up on the gas (we prefer to ignore the brake entirely), turning, and then slamming onto the acceleration to start the slide, you start to realize just how much control you can have if you put the time in to learn the handling. But this need to perfect your precision controls and memorize the turns also highlights something about the game that doesn't exactly help its longevity. It's an arcade game, but this isn't an arcade. The game is a tad too streamlined.   Poor Shadow, even on a car he isn't cool. There are just five areas to race in, ranging from the muddy tropics to the icy north. This provides a nice range of slippery surfaces including ice, snow, mud, puddles, and packed dirt. But then there are only three tracks in each area (six if you cheat and count the courses reversed as a separate track). This makes the championship mode, the one you'll have to play to unlock cars, new liveries, and even the reverse tracks, a bit too repetitive for its own good. 15 tracks across five environments and 30 or so cars would be a great number for an arcade game and the track design is good enough that there aren't any stinkers in the bunch. But this game was made for the home audience that presumably will be playing this game for a long time to come.   The series of fake rallies you take part in are just a reordering of the same tracks over and over while the difficulty and speed of the cars you're in goes up. There isn't much to differentiate Safari 1 from Safari 3. They look nearly identical. One just has the turns in a different spot. The cars in each of the three classes all handle fairly similarly, too. And since you can't look up the stats on them, one is as good as the next if you don't have a favorite manufacturer. Every one of these championships is a set of three of the courses with a three lap race. And there's no qualifying, so every time you start a race you'll start in last and have to work your way up to the front as the AI zips out to an early lead. Would it have killed the developers to mix it up a bit?     Let's not forget about the GeoDeformation. This is actually pretty cool. As you zip around the dirt and mud filled courses, your tires actually tear up a scaled 12-inch mesh that sits on top of the course. The result is tire treads and skid marks physically manifesting themselves in the dirt or snow. It's not just about looks, the geometry of the course is changing. Without vibration on PS3, you can't feel the difference as much, but you will notice your car jostle about visually. On controllers with vibration, you can feel the car moving in and out of the ruts. This could be chalked up as a gimmick and it would be hard to argue much against it if the deformed tracks didn't affect the race so much. Aside from affecting steering, they affect your ability to get a good grip on the road. Packed dirt or snow is better for accelerating as you don't lose so much to the wheels spinning and kicking out debris. It's not a whole lot, but you can feel this in the game and it adds a whole new thing to think about while driving.    It should be noted that the same central pivot that the handling employs is also used by the camera. If you prefer to drive in the third-person with the camera behind the car, you'll find that the camera rotates around the car on tight turns to show you the side paneling. Unfortunately, you're trying to turn. This makes it so you can't see where you're going all of the time which isn't exactly helpful.   The streamlined design works well in the menus. Even when the camera isn't facing the right direction, the game looks great. SEGA Rally Revo is a nice reminder that games don't have to be gritty and dark to be visually compelling and ~cool~. Sometimes a bright blue sky, some lush vegetation, and glossy mud being kicked up at nearly every turn are exactly what the eyes call for in a game. This is one of those cases. Rally Revo doesn't look like it's running at 60 fps on the consoles which is usually a must in racing games, but the frame rate is nearly rock solid without noticeable dips and it still delivers a great sense of speed. All three versions (PC, PS3 and 360) look roughly the same, though your mileage on the PC visuals will of course vary with your setup.   The only real hitch in the visuals, aside from a lack of variety in the environments, is that the GeoDeformation doesn't always stream in smoothly. The plants and other bits of environmental eye candy have little to no pop-in. Yet one of the primary selling points in the game, the fact that the track can be altered as you drive on it, doesn't. If you're moving quickly, by the third time around a track, you can watch as the newly shaped ground loads in just before you drive over it.    That camera isn't so helpful at times. The online play runs smoothly and has the full feature set to get you into a race with the settings of your choice. Up to six players can join in on the fun remotely, but only one per machine. Now, the offline game is fun. But racing against humans is the real deal. The whole issue with the other cars burning you off of the blocks goes away as everyone is set on the same playing field. The result is a great start every race with cars slamming into one another as they jockey for position with more than a little foul play. Plus there's the added chance that a human opponent might crash horribly and give up the lead at any time regardless of how well they were doing -- something the AI never does.    If you're the type of gamer that doesn't like another ~idiot~ slamming into you and ruining your race, you can still enjoy the spirit of human competition without dealing with online yahoos. This comes with the time attack mode that allows you to simply go for the world's best times on each course by car class or to download/upload ghost cars to make the challenge more real and compare techniques. It's pretty standard, but in a game like SEGA Rally Revo that is lacking so severely in the feature department, it stands out in a big way.   If you don't have a high speed internet connection, there's a two-player split screen mode for you to tool around with. It's pretty worthless. The screen is divided vertically, which only amplifies the camera issues by taking away more of your peripheral vision in the third-person perspective. Even worse, the game ends when one player crosses the finish line. The other racer gets a DNF every time without so much as a chance to close out the race and perhaps pick up a little more skill to help them the next time they step behind the wheel. The last nail in the coffin is that you can't add in AI bots to race against in this mode, even though you can in the online modes to fill out a lobby.SEGA Rally Revo is a game made for perfectionists. Working your way through the single player game is a great challenge as you race against ever increasing competition. The gameplay is great and it looks like the visual representation of ~happy,~ but it may not be for everyone as we've been spoiled by racing game after racing game that keep upping the ante in variety and presentation. By any measure, it has solid racing mechanics. But then, variety is the spice of life and this title could use a bit more.", "date": "Oct 10, 2007"}