{"name": "Everyday Shooter", "name_review": "Everyday Shooter Review", "ref": "https://www.ign.com/articles/2007/10/11/everyday-shooter-review-3", "text": "There are a lot of arcade shooters out there, and a tragic majority of them feel about the same. So it's nice to see a shooter that, while borrowing a great deal of elements from previous games of its type, still maintains a spark of originality and style that carries it above and beyond the typical fare that has become frustratingly abundant.   Everyday Shooter, a game developed by Jonathan Mak and published by Sony Computer Entertainment, puts you in control of a single, pixel-like unit on the screen. Your goal is to clear a series of eight stages that vary drastically from level to level, all of them being intensely musical in theme and execution. Using one stick to move and one stick to shoot, this simple title takes a very standard and predictable genre and turns it about, lending incredible creativity and aural/visual splendor to a rather fulfilling experience.   The game has, primarily, one mode of play: a level-based, single-player approach structured entirely around music. Each level, lasting around three to four minutes, has a song playing in the background, one generally tied to the mood or tone of the visuals. Every sound effect for that particular stage is actually a guitar note or riff that harmonizes with the all-guitar soundtrack. That means every explosion either you or your opponents cause (including your own destruction) sounds like a veritable sea of guitar notes. This musical effect works extremely well and invokes a dreamy haze that truly elevates the overall experience. We recommend, like most musically based or inspired games, to plug in some nice headphones and turn off the lights for the most ideal play environment.   Click here to watch ~chains.~   But before we delve further into the game's details, let's discuss the overall game mechanics. Everyday Shooter's levels feel vastly different from one another, which is very refreshing. Although your control over your ship/pixel remains the same throughout, the way you achieve combos and chain together attacks is different for each stage. For example, in the second level of the game, your opponents are all connected by pulsating threads of color, and taking out the unit at the center will destroy all the attached enemies in the process, leaving you with a lot of points to find. Later levels can be a bit more challenging, like having to shoot a miniscule glowing pixel in order to release a small cloud, which will subsequently stun nearby enemies. A lot of the fun in Everyday Shooter comes from this relaxed experimentation and melodic gameplay, and taking a moment to discover the absolute best way to tackle a particular level's dynamic.   As we mentioned before, each of these stages is not only different in terms of your gameplay approach, but also in the way each level is graphically constructed. Colors, enemy types and backgrounds all shift and meld dramatically as you progress through the game, giving you a surprising treat every time you complete a stage. This is perhaps one of the game's most significant strengths, since each level feels fresh and accessible.   Besides the title's eight standard levels, you can also gather points to unlock extra content. These points are left behind by fallen baddies and can be spent in the Unlock Extras menu. These extras range from varying graphical effects that aesthetically augment the game's feel to adding extra lives to your inventory (these lives are very helpful, since you don't get any other weapons or upgrades besides your single, rapid-fire gun). Furthermore, you can unlock each stage in the normal game to tackle in Single Play, which lets you jump right into your favorite battle, without having to work through the entire title over and over. These different options, while mostly aesthetic, are still enjoyable and appreciated.   Unfortunately, there are a few mechanical problems that take away from the mesmerizing visuals and pristine guitar licks. Although you can move slightly faster when you refrain from shooting, your top speed still feels sluggish, especially in comparison to games like Super Stardust HD or Geometry Wars. There isn't enough weight/substance to your little pixel to make it feel like you have precise control, and this is problematic for a game with so few gameplay elements. Keep in mind though that this issue isn't overly troublesome; it merely impedes the game from feeling truly fluid.   More problematic, instead, is the aforementioned point gathering, which is extremely flawed. The little pixel points (which look very much like your ship), disappear after a very short time. Since you don't move very quickly, you'll oftentimes create a huge chain explosion, only to find that the field of beautiful and delicious pixilated goodness cannot be consumed quickly enough, fading away into oblivion. Poor pixels. This wouldn't have been too concerning had the points been easy to collect, but they're unfortunately not. Actually flying over all the points is far less effective than it should be, since zipping through a huge clump of them will often yield only a few actual pick-ups (despite the fact that your ship can pull at the points as you go). Again, this problem certainly doesn't ruin the gameplay - not at all - but it can be a noticeable frustration.   What a day for a daydream. Lastly, we must question the effectiveness of the musical implementation. Mak comments in his Notes section that he was inspired by a number of game designers, including the brilliant minds behind Rez. And while Rez is almost completely immersive and interactive in its musical sublimity, Everyday Shooter is much more passive. This may not bother some gamers looking to play the game, but don't expect to be in control of the tunes you're listening to, as you are with other musical titles. Mak's creation provides you with the music, but it won't let you control it.If you're a fan of arcade shooters and you've been itching for a more dreamy experience, you should absolutely check Everyday Shooter out. Even those that aren't particularly fond of the genre may enjoy this title, given its unique design and execution. While the game does have its problems, it's still very fun to play. Check it out. There's a lot of color, guitar and a healthy dose of everyday shooting.", "date": "Oct 11, 2007"}