{"name": "Football Manager 2008", "name_review": "Football Manager 2008 UK Review", "ref": "https://www.ign.com/articles/2007/10/12/football-manager-2008-uk-review", "text": "Despite regularly selling more than most PC titles combined, Football Manager still enjoys a reputation as something of a hardcore game. Largely impenetrable to the non-believer, it's almost obligatory for scoffers to dismiss it as little more than a glorified spreadsheet. However, the comparison is as irrelevant as it is tired - we've yet to discover a spreadsheet that can keep us entertained for six hours straight. And besides, it's a lot easier to use than a spreadsheet.   Nevertheless, those who have been dissuaded by the seemingly complex interface are being targeted this year, as Football Manager attempts to encroach even further into civilised society. Whereas you were previously stranded with little more than a stuffy manual and your own wits, this year's model will lead you by the hand into its sinister world of football based number crunching.     This is done via the introduction of the so-called advisor, an intrusive piece of software that pops up in the bottom corner of the screen to lead you through practically every step of the game. If you've ever used Microsoft Office's Word, it's the gaming equivalent of that annoying paper clip animation that crops up to remind you how thick you are. For the seasoned Football Manager player, it's equally irritating, although thankfully it's fully customisable, and you can tell it never to mention certain areas again, or even disappear completely.   Even if you know what you're doing, it's nice to know it's there as the interface has undergone the biggest overhaul in the series' history, with a clean white design and a reorganising of the buttons to be more instantly accessible. There's even an in-game tutorial and, in line with most other football management games, a calendar outlining all the important dates throughout the season. And with a further nod to ease of use, an all-new Transfer Centre screen has been added, effectively putting everything under one roof, thus enabling you to track every potential move, both in and out. As for the much-heralded Match Flow, this simply ensures that the build up to each game follows a logical path, with the relevant screens appearing in the right order.     Ease of use seems to be the big push this year, and the revamping is clearly a ploy to lure in new fans. However, the hardcore are still catered for with a slew of tangible new additions to the core game. There's been talk of over a hundred new features, although this would appear to depend on your definition of the word. What's certain is that the oft-demanded International Management has received some attention, enabling you to risk the furore of the tabloids in pursuit of the largely thankless task of shaping a squad of workaday players into something resembling world-beaters.    Elsewhere, the finances have undergone a sizable facelift to more resemble the actual transactions present in the modern game. As manager, you're privy to the financial comings and goings, such as corporate match day income, season ticket sales, investment funds, and improved sponsorships. While you may think such things are best left to the accountant, theoretically they enable you to gauge how much to spend on transfers and wages, as well as other variable outgoings such as win bonuses.     There is little in the previous paragraph to lure an unsuspecting gamer into the nefarious world of Football Manager, but it's on the pitch where it all makes sense. The 2D match engine has as ever been tweaked, with tactical advice provided by potato-headed former Liverpool and Republic Of Ireland midfielder Ray Houghton. And for the first time, you can change the dimensions of your pitch to suit your style of play, an idea that first surfaced in Football Manager Live, the online version of the franchise that is currently being developed.   Even for the committed fan, it's tempting to dismiss such concepts as resizing the pitch as smoke and mirrors. Does it really make a difference? Does any of it? The point is that whatever the game does, it does it right, creating a supremely believable world of football, not least due to the enormous database of players, which is regularly referenced by actual managers.     In many ways, this is the most irrelevant review of the year. Having come this far, survived the name change from Championship Manager and continued to set the benchmark, Sports Interactive are hardly likely to take their eye off the ball now. Entirely unsurprisingly, Football Manager 2008 is the same annoyingly compelling semi-autistic experience that it's ever been.   Even if you pretend not to care, it soon gets under your skin. You might shrug off a few pre-season friendly defeats, and even let one of the coaches pick the team while you smoke a fat cigar. However, as the first league game looms nearer, you're gripped by a sense of panic, and suffice to say before kick off you will be tweaking every possible aspect in an attempt to gain an edge.     And, as ever, if you lose, you feel compelled to play the next match in order to make amends. But of course if you win you have to push on to keep the run going. Even when you do manage to haul yourself away from the PC for such trivialities as your life, the game still continues in your head, as you plot strategies or consider the merits of various players. To all intents and purposes you are the manager of a football club, with an admittedly hugely diluted version of the stresses and strains that the position entails.The streamlined interface may draw in a few new punters, but this is still Football Manager as nature intended, and a brutally unforgiving intrusion on your time. A benchmark title for the PC, this is a game that you dont so much play as have a relationship with. And not necessarily a healthy one", "date": "Oct 12, 2007"}