{"name": "Holly Hobbie & Friends", "name_review": "Holly Hobbie & Friends Review", "ref": "https://www.ign.com/articles/2007/10/13/holly-hobbie-friends-review", "text": "This party's not for you. Holly Hobbie is on summer vacation, spending time with her friends, having fun being young and carefree. And you're invited to come along, too  but only if you're already in the club. Holly Hobbie & Friends is a DS mini-game collection in the style of other, similar DS mini-game collections, but there's a barrier to entry here if you're not already established as a knowledgeable fan of Holly's franchise. Playing it feels like standing alone in a crowd of strangers. It feels like it's not for you.   Unless, of course, you're a die-hard Holly fanatic already. Then you'd probably feel comfortable and confident when the game throws you headlong into pop quizzes about Holly's world, and friends, and minute little details about events that happened only in other pieces of Holly-brand media. There's a question that pops up on the screen not three minutes into the game asking, pointedly, ~How many layers was the birthday cake in the Holly Hobbie Surprise Party DVD?~ Well heck if I know  those kinds of elements in a game are, at best, annoying psychological keep-out signs for the uninitiated, and, at worst, shameless cross-promotional marketing.    It's an unsettling beginning to what is ultimately an unsatisfying experience, as the days fall away one at a time from Holly's vacation calendar, and each new date means one new mini-game to play. Holly Hobbie & Friends is all mini-games, one after another, and there's a bit of diversity to be found. Some of the designs are focused on using the stylus to poke, drag and glide along the touch screen, while others use the vertical real estate of the dual displays to form one long, tall scene.     The latter is the style employed for Clover Market, seen above, a game in which Holly goes shopping for groceries. You have a shopping list of items, you walk to the items, you press A to pick them up. Simple. The vertical orientation is also used for Bike Riding, where you move Holly left and right with the stylus to avoid on-the-road obstacles and run over collectible flower icons.   The touch screen is more utilized in some of the cooking mini-games, like when Holly and friends decide to build and bake a pizza, or a fruit salad, or a batch of cookies. Probably the most compelling design, though, is the one seen in the right side screenshot above  Fruit Juice Stand. There you use the stylus to drag out plastic cups to set on your table, then fill the cups with either apple juice, orange juice, strawberry juice or lemonade (with optional ice) while thirsty patrons appear out of thin air and wait, impatiently, to be served. It can be frantic trying to juggle several different customers at once.   And other games have recognized that, and centered their entire experience on it  like Cake Mania, or Diner Dash. And then there are cooking games that let you get much more in-depth with activities like making a pizza, or a fruit salad, or a batch of cookies. And there's even an old classic called Paperboy that did the whole obstacle-avoidance cycling thing pretty well.   Which is why Holly Hobbie's mini-games disappoint in the end. These designs are all done better elsewhere, and it's far too easy to blow through the total of them, especially since many of them repeat elements of their play with others in the roster of 14 challenges. There's an argument to be made that these games are purposefully simplistic, in order to be more accessible and fun for younger players  but then any accessibility that encourages is likely destroyed by the earlier issue, the specialized fan-only quiz questions. It's a lot of hassle to join in with Holly, so you're probably better off not spending the time.Imagine playing the latest Super Mario adventure, and, before you're allowed to access the first level, Bowser appears on screen and demands to know the name of the actor who played Luigi in the live-action segments of the old Super Mario Bros. Super Show. Well, I don't know that. Sure, there would be some hardcore fans of the Mario franchise who'd be able to immediately fire back the correct answer, and they could go right on enjoying the game  but the vast majority of players would be stuck, stumped, and upset. I worry that that's what would happen here, for young girls excited to play a new game, but then frustrated when they haven't also memorized the little nitpicking details of Holly's world. And, what's more, the Holly Hobbie franchise isn't even that big of a deal  you could get away with specialized trivia questions if you had a more popular brand as your foundation, like general Disney movies or the like, but Holly just relaunched in this new style one year ago. As it is, it's far too early for this little 10-year-old mascot, sweet as she may be, to be so exclusionary about who she hangs around with. So if this party's not for you, don't worry. There are far better ones that you could be attending instead.", "date": "Oct 13, 2007"}