{"name": "Animal Genius", "name_review": "Animal Genius Review", "ref": "https://www.ign.com/articles/2007/10/13/animal-genius-review", "text": "Kids that are opening presents this holiday season are going to be disappointed if they receive an edutainment game. It's the sad fact of the genre that they just aren't as appealing as something frivolous. It doesn't help that so many of them are really terrible too. Still, sometimes a developer gets the idea right, and Animal Genius for the Nintendo DS definitely displays that. It's still not a game that any adult will ever want to touch, but at least this one manages to be fun.   Let's get one thing straight, right off the bat: this game is for little kids. I'd say, no older than 8. It's clearly designed for tykes, from the Comic Sans font to the soothing and non-threatening voices of the narrators (the girl sounds hot). Though I'm a legal adult, my boyish good looks and immature sense of humor still allow me to assess the game fairly.   Animal Genius starts off with five empty terrains. It's up to the player to fill them up with five animals each. Detailed illustrations of animals, fill up the levels. By playing minigames, the player earns enough points to unlock the animals. The games are based on knowing basic facts about different types of animals.   I'd consider myself knowledgeable of the animal kingdom. I wouldn't necessarily say I'm an animal genius, but I know the basics. For instance, I recall from my schooldays that dolphins do not, in fact, live in trees. Recollection of these vital facts proves crucial to the game.   So obviously you're not going to be challenged by this. See, when the player gets enough points for an animal they have to answer 10 yes or no questions before the creature is unlocked. Like I said before, this is a game for young kids, so the questions are pretty rudimentary. Can a raccoon fly? Does a parrot have feathers? It's easy, even for a kid, but the challenge is more about answering 10 questions in the time limit. The game does throw in one or two specialized questions about the animal. They're throw away questions because of course the answer is yes, but it serves to teach a fact about each one.   The quizzes are secondary to the minigames, though. There are only four, which is a major bummer because to earn enough points to unlock everything players will have to play a lot. Still the games do have a bit of variation. Maze Munch, for example, has four different types of mazes. Each one is about guiding an animal to food, whether it is a skunk gathering berries, or a lion stalking zebras. This is the most action oriented minigame, and is a basic, but mildly enjoyable, puzzle. Each animal's maze is different and has a completely different strategy, so it's really more like four games.   Scratch and See involves rubbing the touch screen to reveal a picture of an animal. Each turn allows for less scratching, so players have to try and recognize a chipmunk by seeing a tiny fraction of the picture. It's definitely the weakest one of the bunch.   The other two games, the ones that are actually educational, also happen to be the games that earn the most points. One of the games, Creature Collector, has players tap on animals that match a certain criteria when they appear. The animals pop up in squares in increasingly faster intervals. The game starts off easy with things like, ~Find animals that have hair~ but then progress to more difficult scenarios like ~Find animals that are slower than an elephant.~ The minigame gets pretty fast paced, and the fact that a wrong answer detracts a large chunk of time makes it almost panic inducing.   The last game, Matchomatic, is a pretty simple matching game. It does however make good use of the touch screen, by having players ~flick~ the animals into the correct spots on the top screen.   The latter two games incorporate bonus rounds into them. The bonus round asks a question about one of the animals on the screen. If it's a bird themed game, it'll be a question like ~Which is the smallest bird?~ (Hummingbird) but sometimes it's a random question like, ~Who has trouble moving backwards?~ (Kangaroos)    The game has a very important element of educational games: the learning is rewarded. Animal Genius rewards the player for getting the right answer. The minigames don't require a super knowledge of animals, but the harder bonus questions gives the player a lot more points, making the learning element enjoyable because it helps, but never hinders.  Animal Genius is a kid game. A really little kid game. It's not going to be fun for anyone in the double digit age range because it's too basic. However, for a young child, especially one that has an interest in animals, it's actually a decent title. The educational aspects being presented as bonuses are a great idea. If there were a few more minigames it would really make this title shine. If you've got a kid and you're trying to get them to play some edutainment, this is probably one of the better choices. Your kid still be mad you bought them an educational game though.", "date": "Oct 13, 2007"}