{"name": "Desert Strike", "name_review": "Desert Strike", "ref": "https://www.ign.com/articles/1999/07/07/desert-strike", "text": "It is a scenario torn from the pages of recent history. The megalomanical leader of a Middle Eastern country threatens his neighbors with war, conquest, and poison gas. Spies and diplomats have been captured and tortured, which prompts the United States to respond. As one of the Army's top helicopter pilots, you and your co-pilot must fly into this dangerous zone, completing a series of missions to right the wrongs and neutralize the threat.  Thus begins Desert Strike on the Atari Lynx, Telegames' adaptation of the strategy/action game from Electronic Arts. There are four campaigns in all, each consisting of a number of missions. From a three-quarters overhead view, you fly your Apache into enemy territory, destroying targets, rescuing innocents, and looking for supplies. The player starts each campaign with three lives; if all lives are lost before the missions are completed, the campaign is restarted. Passwords at the end of each campaign saves the game. Do you have the reflexes and military mind required to stop the madman?    Desert Strike on the Lynx retains the challenge and depth of the original Sega Genesis game. Unlike Steel Talons, this is not a simulation; the Apache is restrained to two dimensions, and the emphasis is on playing rather than flying. Armchair pilots must manage supplies of ammunition, fuel, and armor, while planning attacks to outmaneuver and outshoot the enemy forces. The campaigns are significantly distinctive, and each is more challenging than the last. The missions themselves are fairly diverse, with the placement of enemy forces demanding different stratagems for each.  There is no way to directly set game difficulty, though the choice of a co-pilot/gunner has an effect on performance. Even so, the game is more than reasonable, starting off at a moderate pace that slowly builds throughout the missions and campaigns. Controls are simple, with the joypad used to fly, the A, B, and Option 2 buttons to fire, and Pause to bring up the mission status screen. The only kink here is that the helicopter moves a little slower than desired, but most players will readily adapt after a few minutes.     A respectable job has been done to fit the original Desert Strike graphics on the Lynx screen. Most items are animated and instantly recognizable, though the soldiers need scrutiny to distinguish friend from foe. Unfortunately, the desert terrain is drawn with colors that range from dull brown to garish orange. They do not contrast well with the other colors and makes playing the game a bit straining. Sound effects are merely functional and little more, consisting mostly of generic explosions and simple pops. Several tunes play between campaigns and between games, but there is nothing truly noteworthy.    Desert Strike on the Lynx is a very faithful adaptation, offering a rich mix of strategy and action that ensures many hours of satisfying fun. While the graphics and sounds could be refined some more, this card is still highly recommended for its diverse and complex gameplay.", "date": "Jul 7, 1999"}