{"name": "Every Extend Extra Extreme", "name_review": "Every Extend Extra Extreme Review", "ref": "https://www.ign.com/articles/2007/10/17/every-extend-extra-extreme-review", "text": "A very small percentage of individuals may experience epileptic seizures or blackouts when exposed to certain light patterns or flashing lights. Exposure to certain patterns or backgrounds on a screen or when playing videogames may trigger epileptic seizure or blackouts. So the warning goes at the beginning of every videogame manual out there. If you've ever wondered if you're in that small percentage of unfortunate individuals prone to epilepsy, Every Extend Extra Extreme (E4) is a good test. Seriously. This game has more flashing lights and mind-numbing patterns than a burnt out raver's worst nightmare. But amidst all of the insanity, there's also a game to be found if you dig down deep enough. And if you dig a bit more, you'll find that it's pretty darn fun.   Every Extend Extra Extreme comes from the same studio that brought the Xbox Live Arcade Lumines Live! And, once again, this is a modified port of a PSP game. This title, though, shows a clear and marked maturation in the approach to downloadable titles from Q Entertainment. Lumines Live!, you may recall, took the microtransaction route where a stripped down title was first introduced. Every Extend Extra Extreme takes stage on the XBLA as its own entity, complete and fresh from the start.   But we're getting ahead of ourselves here. How a game plays will ultimately be the determinant of its life or death and that may be a bit of an issue with E4. The game is uniquely fun, addicting, and oddly relaxing. But it can also be terribly overwhelming when you first pick up the controller. Even after reading the instructions, the game begins with trippy colors and a lot of confusion. Half of the game is figuring out the keys to survival.     The basic idea in E4 is to navigate your compass shaped ship around the board and then blow yourself up to destroy the surrounding enemies who then set off chain reactions to blow up more. You can let the chain go to its natural conclusion, but you're ultimately racing against the clock to rack up ~Quickens~ and ~BonusXs~ that increase the rate enemies appear on screen and the score you get for killing them. Waiting out an explosion chain that is giving you points may, in fact, be contrary to your success. And so the game goes back and forth between detonations and un-detonations (done with the A and B Buttons) as you scoop up power-ups and look to ever increase the value of your chain reactions.    Oh, and to get the most points you'll have to blow yourself up in time with the rhythm of the looping music.   Simple, right? The crazy part is that it is once you get the hang of it. It doesn't take long before you're playing on the infinite mode (grabbing time power-ups extends the countdown) for great stretches of time without even realizing it as the music and sights blur into one singular experience. Though if you want, you can choose one of the four time limited games (across four stages which is less than what you got on PSP) that max out at 5-20 minutes for the same game with less investment.    A game with the same general rules can be played over Xbox Live against a friend or stranger where the goal is to simply score more chains than your opponent in a set amount of time. The problem with this mode is that you don't get to look at what your opponent is doing - there's just a stream of text updating you as to their status. In the end, it isn't really any different from the adequate number of leaderboards that already exist to keep track of scores.   These modes of play are fairly similar to what you got on the PSP with Every Extend Extra, though changed slightly in both form and rules. E4 adds more to the pot to sweeten the deal. And at 800 Microsoft Points ($10 USD), it's a pretty sweet deal to begin with.    The ~Wiz Ur Muzik~ mode, which makes up for the limited number of included songs, lets you import your own tracks to play to. The process takes just a couple of minutes longer than the length of the song to analyze it and produce a beat filter that the game uses to ensure the whole rhythm aspect of E4 actually works. And it does, more or less, depending upon how steady the rhythm of your chosen song is.    If all of this is a bit too trippy, casual players can get their feet wet while hardcore gamers extend the life of the title with the R4: The Revenge mode. This is a more conventional shooter with just as much flash as the rest of the game. It's a nice addition that makes the price of some of the ~lesser~ shooters on the XBLA look downright silly. Every Extend Extra Extreme is a game that excites sections of the mind that other games leave untouched. For many, it will also sit on the edge of acceptable levels of initial confusion. The game is almost too unique and trippy for its own good, if that is even possible. It's a game that is worth experiencing and a great bargain amidst the flood of overpriced downloadable content out there. Just don't panic if it all seems a bit much when you first pick up the controller.", "date": "Oct 17, 2007"}