{"name": "Nancy Drew: Legend of the Crystal Skull", "name_review": "Nancy Drew: Legend of the Crystal Skull Review", "ref": "https://www.ign.com/articles/2007/10/18/nancy-drew-legend-of-the-crystal-skull-review", "text": "In second grade I was more of a Boxcar Children fan, myself, but I think I could still have appreciated the puzzle-solving adventure found in Nancy Drew: Legend of the Crystal Skull. Heck, I can even appreciate it now because some of these puzzles are pretty tough on the mode meant for ~Senior Detectives.~ You really need to keep your eyes peeled for any relationship between clues, no matter how slight, to unravel this mystery.   Obviously the story revolves around a crystal skull, but that isn't apparent from the outset. All you (Nancy) know is that you've been sent to New Orleans to check up on a friend of your boyfriend's after his Great Uncle died. When you arrive, though, you get knocked out by someone dressed as a skeleton. Some welcome! Henry, the boy, seems like an ok guy, but the housekeeper is a superstitious lady who goes in for hoodoo and creeps you out a bit, to say the least. Pretty soon you're collecting fake eyeballs, checking out tombs in the adjoining cemetery, and even finding secret passages (since every creepy old mansion's gotta have one!)  A little corny maybe, but probably not for kids, and even so, corny can be fun. Events will sometimes lead you to call your friend, Bess, who is staying at a hotel in the French Quarter. You can use her to do some investigating as well, and having this alternate point of view helps flesh out the environment beyond the dark stormy house.     The start menu is fairly impressive, giving not only the background file for this case, but a scrapbook-style synopsis of all sixteen past mysteries. The game is recommended for ages 10+, so the younger (or lazier) end of the spectrum can opt for ~Junior Detective~ mode, featuring easier puzzles and a task list to help you keep track of all the different leads you need to follow up on. All detectives have a bag for inventory, an observation notebook (which helps when you return after a couple days away from the plot), and a cell phone for calling up your friends. Later on you can also phone contacts for questioning once you come across their phone numbers.    Maneuvering around the environment is a pain in the way that first-person adventure games are sometimes. Instead of watching for your magnifying glass mouse to go red, indicating something to examine, you watch for it to change into an arrow and then click to move. It's generally not too bad, but the process would've been streamlined if they could've stuck to one method of turningeither clicking manually left and right arrows, or keeping the mouse at the edge to spin slowly.    Since it doesn't seem like you can mess up conversation threads, the puzzles stand out as the heart of the game. As I mentioned before, these can get pretty hairy, ranging from a scavenger hunt through a graveyard, to a Rube-Goldberg machine in a curio store. Translating hoodoo symbols, memorizing dental charts, and luring iguanas out of hiding are all useful skills. Everyone once in a while you'll also come across a mini-game-like task such as spritzing wasps with poison to kill them before they get mad and sting.     You might expect mediocre production quality from a series that has churned out about two per year since 1998, but Legend of the Crystal Skull is surprisingly good-looking. The environments are detailedfor example, after witnessing a display of mystically branded toast in the curio store, you may notice the toaster and stencils used to fake them in the back room. Character animations are smooth, with lip-synching to go along with the generally decent voice work. Unfortunately the one voice that bugged me noticeably a couple times was Nancy Drew's, but the supporting cast lends talent that makes each character distinct despite lots of Southern accents. Ambient noise is weather appropriate and once in a while some inoffensive jazz will play in the background while you snoop around.  The Nancy Drew series may have started selling because of the perfect licensing choice, but Legend of the Crystal Skull proves they are real, sometimes challenging, adventure games. Graphics and audio are surprisingly good, with game play that includes exploration, puzzles, and mini-games. An obvious mother-daughter activity, but I bet brothers wouldnt mind wracking their brains a bit, too.", "date": "Oct 18, 2007"}