{"name": "Backyard Football", "name_review": "Backyard Football 2008 Review", "ref": "https://www.ign.com/articles/2007/10/18/backyard-football-2008-review-2", "text": "This game is broken. From the first pass of the first game, it's obvious that there is so much wrong with Backyard Football 2008 for the DS that the only fun to be had with this product is by returning it to Gamestop for $10 in store credit. Although the other two Backyard Sports games for the DS haven't been stellar, they've at least playable. The Torus Games developed Backyard Football 2008 for the DS is an insult to the sport, to Nintendo, and to gamers everywhere.    Like the other Backyard Sports games, this one licenses use of the league's teams and a handful of its players. All 32 NFL teams are here, along with 15 professional athletes as kids (four of them unlockable), with the other 22 selectable characters played by generic Backyard Kids. Like the other Backyard Sports DS games, this one offers a few game modes: Play Now, Pickup Game, Season Play and Practice. These are all pretty identical except for progress saving and player selection. Unlike the other Backyard Sports DS games, this one features no minigames or multiplayer. That's right, this football game is 1 player only. The only extra is the Player Cards function, which allows the player to look at some truly hideous character art up close, as well as the stats of each player.    The game steals from recent, better football games by assigning available players a button during a pass. So after hiking, pressing the A, L or R button will send the ball to a different player on the field, without requiring the player to actually turn and aim. Or at least, this would be true if the passing weren't completely broken. The player has no control over the receiving player until they've caught the ball, so one would assume the receiving player would always catch it. Instead, they miss the ball about half the time, even when in the clear. Maybe it has something to do with the ball being tossed 100 feet offscreen instead of directly to the player. That's when the ball even makes it to them, of course. About a third of the time a pass is attempted, it will be botched and the ball will land on the ground in front of the quarterback. This doesn't just happen when the opposing team is rushing him, it happens all the time. The game labels it as an incomplete pass but it looks like a case of the quarterback attempting to pass the ball to his left shoe.    Now here's the good news (which is a smartassed way of saying more bad news): once you get the ball, touchdown! Every single time, even when running 80 yards from a kickoff. It is nearly impossible to get tackled in this game other than by running up to an opponent and standing still. My favorite play is to grab the ball, run all the way to the right of the field, stand there until the opponents all bunch up, then run back to the left of the field, past everybody for that amazing 90 yard run. Woohoo!    Unfortunately, it's also nearly impossible to tackle opponents in this game. During one play, I had my entire team running after an opponent with the ball, everyone jumping against him over and over, sliding off with no effect. It doesn't help that only one other player is selectable at all times. A tiny B button icon hovers above one player and pressing that button will swap player control to him. The problem is that which player is selectable depends on how close he is to the ball. On more than one occasion, there were players upfield that could have tackled the opponent, but they were unselectable because the AI player trailing behind the ball was always closer. Considering multiple players are selectable while on offense, I'm not sure why the same couldn't be done for defense.    A couple of times, while trying to make a pass, one of my teammates would turn around and run up against the quarterback so that neither of us could move. We'd become stuck until one of the opponents wandered over and tackled us. That's teamwork! That kind of idiocy doesn't just happen by accident.    I can't tell whether the athletes in this game are 2D or 3D because the art is so muddy and ugly. They move forward achingly slow, like a man trying to sprint underwater, and with about as much finesse. The backgrounds are all 3D, but are constructed out of flat billboards (think Doom) rather than actual geometry, so every time the camera pans around, objects become flat and invisible. One of the fields is covered in snow and the entire screen is white; nothing beside the players is visible, including the yard lines and touchdown zone. For extra fun, try picking a team with white uniforms so that everything becomes invisible. I recommend the New England Patriots.    The audio makes no sense in this game. Music is a weird, retro-sounding, synth- and beat-heavy mix that has nothing to do with football. The sound effects are used so rarely in this game (other than an overly-cheerful ~Pass complete!~ voice sample) that it's not unusual to hear dead silence for 4 or 5 seconds at a time.According to the credits, the core development team on this game was about 5 people, and boy does it show. This game is awful. Its an offense to the eyes, the mind and the heart of all young football video gamers out there. Its broken in almost every way and is in no way enjoyable. Its almost bad enough to recommend for a laugh, but Id hate for this game to make any money and be perceived as a hit. The Backyard Sports franchise isnt going to last much longer if Atari doesnt become more critical about whos developing their games, and how those games are coming out.", "date": "Oct 18, 2007"}