{"name": "Jericho", "name_review": "Clive Barker's Jericho UK Review", "ref": "https://www.ign.com/articles/2007/10/19/clive-barkers-jericho-uk-review", "text": "First of all, let's get one thing out of the way: Clive Barker's Jericho isn't a jump-out-of-your-seat scary game. Yes, there might be enough blood to fill an Olympic swimming pool, rotting flesh galore and some pretty hideous monsters but, if you pick up Jericho expecting a Silent Hill-style scare-fest, then you're going to be disappointed. If, on the other hand, you want an unsettling all-action shooter with a twisted plot and an innovative character-switching mechanic, then you'd better read on   Let's try and sum up Jericho's concept in a few simple sentences. Basically there's an evil chap who's after a God-like creature called the Firstborn because it'll make him incredibly powerful. So, a group of magic black ops soldiers known as the Jericho squad are called in to stop him. This involves travelling through time, taking out bad guys from history - including Nazis, medieval warriors and fat Roman emperors - in a race to get to the Firstborn and destroy it. Of course, that's just the tip of the narrative iceberg - throughout the game there's a lot of story exposition, which may be a problem for those that just want to dive in and start shooting things.   Enemies become more varied and tougher as you progress.  That said, there's still plenty of action to be found in Jericho and this comes courtesy of the game's character switching mechanic. You see, in the opening levels your character actually gets killed, allowing him to possess other members of the squad, enabling you to control their actions directly. Although this may look like a squad-based FPS, it's one of the only shooters where you can instantly - and easily - choose which member of your team you want to control.  It works extremely well and means you've got free reign on how you tackle enemy encounters. For example, you can stand back on the sidelines sniping from afar, get up close and personal with Church's wicked katana or mow enemies down with Delgado's mini-gun - the choice is yours. But whatever style of gunplay you choose, the character switching makes for some intense action as you zip between squaddies. Furthermore, there's no real weak link in the team and it's thrilling to have such a varied range of firepower at your finger tips.   If you like horrible creatures, then Jericho's definitely for you.  What's more, you're forced to really use each character to their maximum potential because they each have individual magical abilities, such as slowing down time, unleashing demons and shooting out bloody tentacles. Brilliantly, they're absolutely integral to the gameplay and rather than being a useless gimmick, they're vital additions to your armoury that you'll use time and again to beef up your gunplay. In fact only Jones's astral projection ability - which enables him to temporarily control enemies - is a bit pointless, used to pull levels and so forth, but one out of six isn't bad.   The best thing about these powers is the ability to combine multiple skills at once by character switching. So you can latch onto an enemy using Church's blood tentacles, then jump to Jones and down slow time, making it much easier to pump a stream of bullets into the now-trapped target. This gives you awide variety of ways to overcome enemies and experimenting with different character combinations is genuinely satisfying.     When you're not directly controlling a particular character the AI takes over. They're pretty handy in a firefight too, working together to dispatch of the enemy in double-quick time. This allows you to focus on the battle in hand rather than worrying whether one of your buddies is going to cark it.   The trade off against all these awesome abilities is that Jericho is actually pretty easy, especially because it's possible to revive out-of-action team mates. Ammo is replaced at every checkpoint too, so you can happily blast away without too much concern. Still, some of the later levels do provide a decent challenge, no matter how much ammo you're carrying.     Speaking of levels, Jericho would certainly have benefitted from a little more variety. You see, despite all the innovation with the character switching and magical powers, it appears very little imagination has been injected to the areas your fight through and many of the levels follow the same formula - blood-splattered corridor, open area with lots of enemies, blood-splattered corridor, open area with lots of enemies and so on.   Having said that there's no denying that shoot-outs are extremely intense and ultimately a lot of fun, especially when you're swamped by hellspawn. Sure, it would've been great if the formula was mixed up a bit more, but as shooters go Jericho is pretty damn exciting. The boss battles are good too and provide a sometimes much-needed change of scenery.Jericho is a unique and intense addition to the highly competitive FPS market. While it's not the scarefest we imagined it would be, Clive Barkers trademark gothic touch is very much in evidence and ensures the game has a wonderfully macabre atmosphere. The character switching gameplay is fantastic too and really helps to create fast-paced shoot outs against some of the nastiest, diguesting enemies we've seen in a long time. Indeed, while it's not hugely innovative the character switching does add a fresh dimension to the game, which is refreshing in a genre that's become stagnant over the past few years. Of course, Jericho isnt without its problems - theres just a bit too much repetition in the level design and the graphics, while decent most of the time, occasionally look a bit brown and bland. But there's no denying Jericho is an action-packed shooter, and one you'll have a lot of fun with if you're after a blast that'll make your blood curdle.", "date": "Oct 19, 2007"}