{"name": "Evil Under the Sun", "name_review": "Agatha Christie Evil Under the Sun Review", "ref": "https://www.ign.com/articles/2007/10/22/agatha-christie-evil-under-the-sun-review-2", "text": "The first thing a good mystery (or mystery adventure game!) needs is a great hook. This is the first thing that Agatha Christie Evil Under the Sun does underwhelmingly. The whole game is played as a flashback that Belgian detective Poirot relates most interactively to his pal, Hastings, so rather than dropping you straight into the murder intrigue, you are introduced to this cheesy premise first, and treated to strange banter between the two of them for the durationcomedy! Then the murder still isn't committed until nearly halfway through the game. Little mini-mysteries unfold slowly in their inter-connected way, but the big attention-getter is missing.      The story is one of those where everyone, including the detective, is supposed to be enjoying a relaxing vacation on Seadrift Island, even though the pub near the beach is reportedly haunted. Then, amid a rash of thefts and threatening notes, a popular actress is strangled on the beach. Finally! Are there also Nazi supporters, drug smugglers, and voodoo chanters? I smell a mystery!   With all that drama, you might think Evil Under the Sun could make for a pretty exciting game. Unfortunately, you spend most of your time watching Poirot take tiny little steps across the screen, although double clicking can ease this somewhat by skipping most of the walking bits. Using his snobby Narcissistic personality to limit how much you can explore in a given chapter-- ~Poirot will not be wading in this story. That must be clear!~-- is clever, but still makes you wish you could just go wherever you want. He also won't climb ladders or swim. Instead you'll have to wait for rowboats, or much more interestingly, a sea tractor, which is sort of like car on stilts that drives through the water. In fact, the novelty of riding in a sea tractor may be the most interesting part of the game, despite the fact that you're not the driver.   Like many adventure games you are sometimes stuck for an obnoxiously long time for neglecting to perform one tiny action that will mysteriously advance the plot. The bigger ~puzzles~ boil down to just gathering materials and following a series of instructions that you'll find somewhere along the way. Searching characters' rooms play a big part, but there's never any indication that a new room has opened so every once in a while you'll have to just suck it up and make the whole rounds. Some tasks do require a little more thought, but as I mentioned, it will have to be the correct thought, which can be frustrating. Things that you think might be of importance, like a suspicious bump in the rug, are sometimes disappointingly meaningless.      When talking to characters, it usually doesn't matter too much what you say. There don't seem to be any choices that send you back or ruin your line of questioning, for instance. Sometimes Poirot will berate you for asking something redundant, but asking something that you might think too edgy doesn't look like it screws up your reputation. In fact, it's usually best if you just click straight down the line of possibilities, because the replies make less sense out of order, which feels a little sloppy.   If you ever get stuck, Poirot has his own mystery running in his office. Called ~The Finger of Suspicion,~ the machine will point to the action you should take with regards to a particular person, with possibilities ranging from ~Talk~ to ~Eavesdrop.~ As you finish chapters of the game, Poirot will give Hastings hints on how the machine works so that by the end, you learn the truth about his magic trick as well. Cute, but it's only helpful if you are absolutely completely stumped and don't even know where to turn. If you're stuck on a puzzle it does nothing for you and Poirot will just tell you that everything you need is already in your possession.   Graphics and sound are pretty bland. The characters animate a bit on the robot side of the spectrum, and their voices are usually annoyingly off in terms of accents. Native speakers aren't required, but some familiarity with French would've been useful for the actor who butchered such commonly used phrases as ~Bien sur~ and ~Peut-tre.~ If the voices are going to distract you like that, it's probably better that you can just click through and read as fast as you like.    Mysteries should go well with adventure games, so why is it that Agatha Christie Evil Under the Sun is less than peanut butter-friendly? Mostly because by the time the murder is committed youre already bored. The tedium goes untempered by either the graphics or sound-- Im sure your imagination could paint a more engaging picture of this story if you just picked up the book.", "date": "Oct 22, 2007"}