{"name": "Fishing Master", "name_review": "Fishing Master Review", "ref": "https://www.ign.com/articles/2007/10/22/fishing-master-review", "text": "Even in the system's premiere year we're already seeing a somewhat worrisome trend in Wii game design.  Banking off the heels of Nintendo's popular - but almost insultingly simple - Wii Sports Design, publishers are now pushing out their own simplistic game designs onto the console, swarming Nintendo's innovative platform with dozens of extremely basic - but still full price, of course - games.  Some games, such as the recently released Mercury Meltdown Revolution, have gotten the hint, releasing a simple game at a price that's hard to resist ($20).  Others, such as Hudson's Fishing Master, aren't quite with the program yet.  Fishing Master is fun, but it's also amazingly simple, obviously rushed, and far too expensive.   It's funny to say it, but Fishing Master may be one of the most entertaining games we've had to review poorly in a long while.  The design is there, though it's intentionally about as simple as possible.  Players walk around a tiny chunk of land, cast with the Wii-mote, and crank in with the nunchuk in classic Twilight Princess fashion.  Should a fish nibble on the line (something they'll do nearly every cast) a simple flick up will set the hook, and then it's all about reeling in your catch.    As the only actual gameplay element in Fishing Master, hooked fish immediately launch the game into a man-vs.-fish mini-game.  Crank too fast and you'll snap the line, but reel too slow, and the fish will run away with the bait in its mouth; simple as that.  Every once in a while the fish will make a quick move, forcing you to either motion left or right with the flick of the Wii-mote to keep them hooked, but aside from that it's no different from the countless Radica Bass Fishin' LDC games released over a decade ago.   Here's the catch though; it's actually kind of fun.  Not in a ~Wasn't that totally worth $40?~ kind of way, but in the most simplistic, one-dimensional way possible.  The game actually includes some decent options, as you'll be able to purchase new live bait and lures, and upgrade poles, as well as fish multiple spots in each divided section of Japan.  As you improve your skills your Grandpa (the only other actual character in the game) will assign you new fishing missions to complete, as well as appraising your catch for the day.  The more you catch, the more cash you get.  The more cash you get, the more expensive bait and equipment you can get, allowing you to again catch more, and gain more cash.  You can see where this one is going    The novelty of fishing with the Wii-mote wears off though, and when it does there's very little - if anything - to keep you playing fishing master.  You get the occasional tournament, and there's a simplistic multiplayer mode where four players can fish together, but in general it never gets any more or less exciting than cast, hook, reel, and repeat.  Even the most die-hard fishing enthusiasts (myself included in that group) will only be able to see the silver lining for so long, and when it wears off there's definite trouble.  The game is low-poly and menu-based for the majority of the time.  There's no VO, very little animation aid from the sliding fish and basic navigation of your character around the selected spot, and the art direction - if you can call it that - is quick and sloppy.  Textures are cookie-cutter and bland, and some of the backdrops (including tree-lines and sky shots) are often thrown in by actually taking what looks to be a real photo mapped to a low-poly object.  When battling fish you'll never see below the water line, so any cinematic feel found in games like SEGA Bass Fishing or even Wii's own Rapala Fishing is nowhere to be found.  True, the game controls a hell of a lot better than Rapala, but it'd barely pass as a flash game in both visuals and gameplay.  Fishing Master isnt all bad, its just too shallow  again, we apologize  to be worth even the budget price off $40.  The Wii motion works for the most part, as you can crank the line, pull from side to side when prompted to battle the fish, and even move the pole in a true 1:1 if for no other reason than just to do it.  Players looking for a fun, simple game of arcade fishing may find a few hours of entertainment in Fishing Master  we did  but will soon come to the realization that current flash games, handheld titles, and LCD fishing games from nearly a decade ago have the same exact amount of depth.  If Fishing Master was a Wii Ware download for $5 (maybe even $10, if stretching it) itd be worth the cash for a very specific type of gamer.  At $40 though, no thanks.", "date": "Oct 22, 2007"}