{"name": "The Eye of Judgment", "name_review": "The Eye of Judgment AU Review", "ref": "https://www.ign.com/articles/2007/10/24/the-eye-of-judgment-au-review", "text": "Card games live or die by the quality of the multiplayer experience. A combination of collecting, competing and widespread popularity are the golden three things needed to make a card game lasting and successful. You need only look at the Magic: The Gathering or the Pokemon Trading Card Game series for proof of this. Sony has put forth The Eye of Judgment, a card game that essentially requires PS3 hardware and the PSEye in order to use - but is it enough to persuade Yu-gi-oh, Pokemon and M:TG fans from their passionate addictions? More critically, is it the system-seller that Sony is hoping it will become?   That second question is obviously moot for the moment - only time on shelves is really going to answer it. But we're pleased to declare that The Eye of Judgment has a lot to offer fans of the combative card games we've mentioned. It does stick to a lot of the staples of the genre but sets itself apart in some interesting ways.   First of all, for good and ill, you need a PS3 and PSEye to play. The PSEye part is fine, since it comes bundled with copies of the game, alongside a 30 card starter deck, a booster pack and four command cards. You just plug it into one of the PS3's USB slots, unfurl the fabric nine-square grid mat, position the camera over it from the sidelines, and you're good to go. Aside from the standard Tournament mode, there are plenty of options too - deck management, stats, and a two-card, quick 'battle-off' that round out the game's variety a little more.     Of course, if you sit down on the floor or at a table with your TV and just dive into a game, you're going to be baffled and utterly trounced by your opposition. This is a complex game that is three parts strategy to one part actual combat. The game has very good video walkthroughs that are basically essential viewing for people who are not only new to the game, but to card battle games in general.   Pressing on through these, the game is predictably turn-based. Two players sit across from each other. You're obliged to flip a coin or play paper-rock-scissors to decide the starting order. Then, each player draws five cards and player one lays one down on the grid. You draw your hand from a 30-card deck - that's the limit set by the official rules and this makes assembling a strong deck an essential part of the game. It also enforces the need to invest in more cards outside of the included starter deck and booster  pack- and this is something we'll get into a little further into the review.   Of course, to complicate things, each card has a casting cost (between zero and nine mana, judging by the deck's sample cards) and you only gain two mana per round (that is, after all the card selections, battles and outcomes have been played out by each player) so you must be pretty tactical to take advantage of this critical resource. That's a big element of the strategy - do you choose to lay down as many low-powered cards as soon as possible, or do you bide your time and hope to get enough mana together to lay down a heavy-hitter? This raises an important question of card power balance, and that's something we're going to address shortly.   The view of the action on the nine-square battle grid.  The overall object of the game is to take control of five out of the nine squares on the grid - doing so gives you control of the battlefield and thus ends the game. We found that early domination of the board can sometimes be more critical than the strength of your cards themselves. A lot of this has to do with luck of the draw too - you're allowed one 'mulligan' before the game starts (basically, you can dump your initial five card draw for a fresh hand), but if your hand consists of cards that have a mana cost of three or more, you're automatically going to have to wait for the next round before you can lay anything on the table - and by then, your opponent will already likely have one card on the grid with a second on the way that same round - putting you behind.   This is where balance becomes important, as does chance and, unsurprisingly, the necessity of investing in booster packs. This is also potentially a large downfall for the game, depending on your stance. If you're one of those card-collecting card gamers who have no problem dropping some dough on extra booster packs of fresh cards, then this will be no problem - you won't hate the fact that the AI seems to have multiples of reasonably strong, flexible cards making up its 30-card deck. Of course, if you're a casual player that's hoping to get by on what's included, you're going to be disappointed.   The game's tournament mode is divided into five difficulties - essentially ranging from beginner to expert - but the only real differences we found were how cutthroat the AI is when it comes to using action cards - cards that you hold up to the camera to check your status, order cards to attack again (for a mana cost) and how aggressive it is overall. Once you've mastered positioning of cards (facing them north, south, east or west to determine their attack and defence stances), the real key to advancement lies in drawing the right cards from a well assembled deck. That means buying new cards, which means more money for Hasbro and we'd guess that Sony gets a slice of the pie too.    We see that as a problem for the game - for the price, you get the hardware, some cards and the game. That's all well and good, but the sheer difficulty and limited range of included cards actually lessened the fun out of the box - which is something that could be argued can't be helped without more cards. But it is in assuming that every player will want to build up their decks that makes the game less fun from the outset. Taking the game online and then getting punished by players with access to a wider, more finely tuned deck points towards the essential nature of boosters and how limited the core game package actually is.   Perhaps real key to the fun is to try and find other players starting out around the same time you are - get your friends around, get them to invest in a deck and some boosters and have at it. That way, you're ensured a balanced, fun time - which The Eye of Judgment essentially is.   The game is also arguably more complex than it should be, given the all-ages appeal of the game. The game has more depth in its approach to the elemental forces - five in all dominate the cards and the squares of the board. When you factor in health bonuses, automatic weaknesses and square-flipping, which can change the element to the square's secondary element (still with me here?), then the game can get very messy, very quicky. It takes a couple hours to come to grips with most of the nuances, and even then, for seasoned Magic players such as ourselves, we found some of the tactics and attack movements almost baffling.   Magic: The Gathering's mana pool is a superior system when compared to the automatic two points of mana. While some cards give you the ability to sacrifice cards on the board for mana, you never feel like you have enough mana to do what you want. Sometimes, we even felt compelled to let some characters get killed off in tense situations just to free up the mana again so we could summon a stronger or more flexible beast.   The battle sequences break away from the standard top-down play screen.  But that's where the troubles end. The game is nicely presented on most fronts; you're greeted by a solid FMV introduction that sets the theme nicely and gives some purpose to the card and grid mechanic. The PSEye works very well; it generally has no trouble reading each card's code and the small on-screen beasts are all animated with a lot of personality. The hard rock and metal score is a little off-putting and isn't as cool as the developer thinks it is - we'd prefer some slightly more appropriate strings and gothic orchestral for an action-fantasy title. After the umpteenth time of hearing the arrangement dynamically shift between 'tense and fast' to 'manic and widdly', during a close battle, it can get old.   With the promise of expansions and boosters of all kinds on the cards, Sony has put a lot of faith behind The Eye of Judgment. We think they're mostly justified in this confidence because the game is fundamentally fun, if almost forcing you into collecting by way of the game's difficulty. The PSEye is mostly a pretty novelty that ties the PS3 to the card system itself, but we're not complaining. Though we're pretty sure the game could be adapted for non-digital play, the battle animations and novelty of summoning is compelling. A little more fine-tuning and balance is needed, but this is a strong start for the series.", "date": "Oct 24, 2007"}