{"name": "Cosmic Family", "name_review": "Cosmic Family Review", "ref": "https://www.ign.com/articles/2007/10/25/cosmic-family-review", "text": "Wii is the console for casual gamers, which inherently means it's ideally suited for families, too, and thus publishers have begun to release software targeted specifically to very young children. One of these ~games,~ if you can really call it that, is Cosmic Family, a title which strives to entertain with colorful cartoons and extremely shallow, but easily understood mini-games. The endeavor, created by Ubisoft Barcelona, challenges kids between the ages of four and eight to explore five floors of virtual space ship. There's no text to read - in-character voice actors guide you along - and most of the challenges are designed to be easy.  Nothing about this endeavor from Ubisoft Barcelona is particularly special. It looks like a flash game developed for Internet browsers. You point the Wii remote at the screen and move left or right to scroll the static presentation in the respective direction. Items, furniture and people are interactive - click on them and you'll trigger cinemas and cue minis. For some strange reason, there are noticeable load times in the title; for instance, if you click on an item, it might lag for a second before the animation begins, which is disappointing. Worse, though, is that the high-volume music is sometimes so loud that it actually drowns out any audio cues from characters, which is sure to confuse kids.  To its credit, though, Cosmic Family is very approachable and Ubisoft has compiled a list of minis sure to engage very young players. The 2D nature of the environments makes them easy to navigate and the interactive games (and we loosely define them as such) are well designed for the most part. There are some 20 different minis, many of which revolve around rearranging tiles with the Wii remote in order to reassemble a broken object; think of it like putting the pieces of a virtual puzzle back together. Other times, you might simply use the Wii remote to draw or color in the lines of a black and white picture. The team has treated every part of these pictures as a separate layer - a photograph of a man would therefore be comprised of several layers separating his head, arms, legs, torso and so forth -- which means that youngsters will find it difficult to color outside of the lines. There are also games that revolve around pushing items in a domino effect, and so forth.  Unfortunately, Cosmic Family misses one big opportunity by overlooking the motion sensory equipment in the Wii remote. None of the minis or otherwise feature mechanics built around waggle, which would have been an easy to grasp concept for kids. To that end, the title comes off feeling like a one-time flash game ported over to Nintendo's console.  One of the minis in Cosmic Family.  The biggest offense Cosmic Family commits, however, is that it's regularly priced at $49.99, a gross overvaluing of the package. Were it $19.99, we could have recommended the borderline-edutainment effort to parents who want something for their very young children who might be discouraged by other Wii games. But when you consider that titles like Rayman Raving Rabbids, also an Ubisoft endeavor, as practically as easy for kids to grasp, and offer much more bang for the buck, we can't get behind the price point for Cosmic Family.As a parent with two very young daughters of my own, I'm always on the look out for Wii games that they can actually grasp and play. Cosmic Family may be the best option yet with its very easy to understand interface and simple minis, but it also feels like a game that was meant to run in flash on an Internet browser and not a full-fledged Wii product. Bearing that and some of the sound glitches in mind, there are much better values for your dollar.", "date": "Oct 25, 2007"}