{"name": "Crash of the Titans", "name_review": "Crash of the Titans Review", "ref": "https://www.ign.com/articles/2007/10/26/crash-of-the-titans-review-2", "text": "Oh Crash Bandicoot, you were never popular enough to hang around with the cool kids like Mario and Sonic, and yet you've still avoided that depressing mascot retirement home where the likes of Aero the Acrobat and Zero the Kamikaze Squirrel reside (look them up if you have no idea who I'm talking about). However, as spotty as some of Crash's adventures have been in the past, there is still something likeable about the slightly deranged marsupial. Maybe it's because he looks like he stuck his finger in an electrical socket while biting into a lemon. Yeah, that might be it.   Ported by SuperVillian Studios (who still have one of the coolest logos in the industry -- you can't lose with a monkey riding a bomb), the PSP version of Crash of the Titans is pretty faithful to the console versions. In fact, since the game is very similar to the PS2 version, you might want to give that review a gander if you want a more detailed overview of the main game. But if you just want the quick version, the main feature of this platformer is the ability to ~jack~ large enemy monsters and make them do your bidding. Each of the fifteen monsters has their own special attacks, although the vast majority of the critters act the same. Add in a heavy dash of repetition, a largely stationary camera that hides enemies off-screen, and a spotty combat system, and you have a game that has ~fun weekend rental for the kiddies~ stamped on the cover (probably somewhere above the ESRB rating).   On your merry way. Nevertheless, let's talk about the PSP version shall we? SuperVillian Studios did a pretty impressive job with the graphics: the game has the same cartoony/storybook look of the PS2 game and is quite sharp overall. Although the characters are not as detailed or well-animated as their home console brethrens, they still look good. There can be quite a bit of pop-in going on in the background, and the framerate takes a hit whenever there are either multiple enemies on the screen (which is often) or during the cutscenes. It doesn't make the game unplayable mind you, but it's definitely noticeably. Finally, depending on which PSP you own, loading screens might be an issue: the older PSP takes twenty or more seconds to load an area, while the Slim is under ten seconds -- just something to keep in mind.     Handheld ports are sometimes given an unfair shake because it's much easier to point out what's missing rather than applaud what actually stayed in the game. So let me reiterate that the PSP version is very close to the console one. With that said, there are still some rather odd things missing from the PSP version that do affect gameplay. For one, Crash has no shadow. Now, I'm not asking for some ultra detailed, more-real-than-real-life shadow, but a little black circle under the character would be a large improvement over nothing. Many of the jumps are made much more difficult because there's no shadow to line up on the floating platforms. C'mon guys, Crash isn't a vampire after all (never mind the fact that vampires lack reflections and not shadows ... but you get the point).   But that's not all. The PSP version also lacks a lot of sound effects where there really should be sound effects. It's quite odd to see a monster unleash a special attack without any sound at all (on the plus side, many of the funny enemy quips from the console games made the cut). And speaking of monsters, punching a bad guy isn't quite as satisfying as it should be; combat can be pretty floaty and sometimes you won't know when you're actually hitting something.   Smashing stuff is key. Nevertheless, these changes are still pretty minor. The one major omission is that the unique (and more importantly, fun) co-op mode of the console versions has been taken out completely. This co-op mode added some spice to a pretty straightforward and ordinary game, so its absence is very noticeable. Instead, the developers try to make up for it by adding five exclusive multiplayer mini-games to the PSP version. Now let's get this out of the way in a blunt fashion that won't waste your time: these mini-games suck.  Here's an overview of them:   Jack-a-Mole: Moles pop out and you punch them in the face.  Crate Crash: Pretty much the same as Jack-a-Mole ... only with crates.  Crash Corral: Jack monsters and lead them back to your corral pad.  Titan Takedown: Jack a monster and ride him around longer than your opponent.  Barrel Defender: Protect your barrels. Attack their barrels.   These games are about as fun as they sound ... which isn't fun at all. In fact, each game is fundamentally broken in some painful way. For one, all of the maps are too large unless you have four players (good luck trying to find three friends with three PSPs and three copies of this game), the objectives hinge on arbitrary and unfair item spawns (Hey look! Those three crates spawned right next to Player 2 and there's nothing Player 1 can do about it because he's miles away! Fun!), and you get a choice of either trying to accomplish the goal or attacking the other player -- attempting to do both will lead to you losing. When you get down to it, it's really just a tacked-on mode to add to the PSP's feature list on the back of the box. We also experienced connection problems, and the game annoyingly boots a player off of the connection when a game ends. This makes an irritating experience even more irritating.Crash of the Titans for PSP is a decent port of a briefly entertaining game. But even then, the PSP version loses out to the consoles in a number of areas; especially when it comes to multiplayer. Considering that the PS2 version retails for the same price as the PSP one, I would recommend that you just go straight to the home console game if you have to play a new Crash.", "date": "Oct 26, 2007"}