{"name": "Scrapyard Dog", "name_review": "Scrapyard Dog", "ref": "https://www.ign.com/articles/1999/07/07/scrapyard-dog", "text": "Louie is back for the first time. No, that's not a contradiction; the big-nosed junkman from the Atari 7800 game Scrapyard Dog returns in this new adaptation for the Atari Lynx. As before, Louie's pet dog Scraps has been kidnapped by Mr. Big, and it's up to him to rescue his pet pal by running, ducking, and jumping through 24 stages.  Along the way, Louie will face Mr. Big's animal gangsters, such as rat mobsters and rock-dropping birds. He can fight back by lobbing tin cans, or try to sidestep the problem all together. He can also find money, play in hidden bonus sequences, and go shopping. However, a timer counts down each level, so Louie can't dawndle too long.    Scrapyard Dog offers solid game action in an easy-to-learn package. The controls are simple and logical, and Louie himself responds sharply to your moves. The action takes place on a side view, horizontally scrolling playfield, though some scenes scroll vertically as well. Game dangers are clearly visible, which prevents you from getting killed by a blindsided attack. Players comfortable with Bonk or Mario will be right at home with Louie.  Though the mechanics are very familiar, Scrapyard Dog keeps things intersting by good use of variety throughout the game. The trip starts off at the scrapyard, but winds through, above, and below the rest of the town. With vehicles to drive, places to explore, and villians to foil, the player is kept pretty busy. Things never get too hectic, though, and overall the game runs at a leisurely clip. As with other games in this genre, there are very few random elements, so patterns can be developed over time.  The most interesting parts of the game are the numerous secret bonuses and diversions. There are stores along the path where Louie can buy useful items, such as weapons or protection. Also, hidden throughout the landscape are various bonus scenes. For instance, by hopping on the right keys of a giant organ, or winning a shell game, Louie can pick up more money and benefits. There are also other bonuses, both hidden and overt, sprinkled throughout the game for the player to find.      The graphics in Scrapyard Dog are simple and entertaining. Game elements are easily identifiable and drawn in primary colors with a minimum of detail. There are also extra touches that add to the fun, such as an animated opening cartoon, and Mr. Big's taunting notes throughout the game. Sounds are pretty basic, offering appropriate but generic noises with a musical tune thrown in.  Despite the cute graphics and the simple plot, this title offers good clean fun for players of all ages. The numerous hidden surprises and the variety throughout only add to the game's appeal, making Scrapyard Dog a well-recommended title.", "date": "Jul 7, 1999"}