{"name": "Paws & Claws: Best Friends -- Dogs & Cats", "name_review": "Paws & Claws: Dogs & Cats Best Friends Review", "ref": "https://www.ign.com/articles/2007/10/27/paws-claws-dogs-cats-best-friends-review", "text": "Caring for a pet takes patience  patience that's sometimes hard to have. In Paws & Claws: Dogs & Cats Best Friends, you're called upon to have quite a bit, as gaining the trust of and building a bond with your virtual dog or cat can take a while to do. (Almost as long as it takes to say this game's overly long, ridiculous full name.)    If you invest the time and effort, you'll come to find that there is a fair variety of different things to do with your new digital pet here in this game. The significant downside, though, is that even after exploring fully all this title's offerings, you'll also find that no amount of persistence will make any of its mini-games feel more original, or more engaging. Everything in this game has been done before, and everything in this game has been done better.    It's become the far too standard thing to say about any new virtual pet release on the DS, but this game just isn't Nintendogs. And it's ridiculous  Nintendo's masterpiece first-party effort came out over two full years ago now, and the copycat clones still haven't come close to matching it. Even after two complete, calendar years, third-party DS developers still can't surpass the master's teaching. Every new game to try has some new set of issues holding it back. Paws & Claws: Dogs & Cats Best Friends is no exception.   In this attempt, the patience required of players to properly simulate the time period of getting to know a new pet and earning his or her trust is implemented in a restrictive, confusing way. Almost every activity in the game is locked and inaccessible in the beginning, and you're only allowed to feed, wash and clean up after your animal  who just sits there in one spot on the screen looking bored  for the first several ~days~ of gameplay.    Woof. When you are eventually allowed to go outside and access more activities, including walking your pet, playing fetch and others, you'll still encounter further layers of lockdown. It's not that gradual introduction to a title's full array of activities is a bad thing  most games don't offer every bit of content in the first few minutes, and that's normal. The problem is that unlocking things is scattered and arbitrary in Best Friends.    When you're trying to teach your dog some new tricks, for example, the interface will admonish you for trying to input a stylus command that the dog hasn't learned yet. Then, five seconds later and for no apparent reason, the message ~Congratulations! Your dog just learned how to do it!~ Huh? If there were some established goal that you were shown, an end condition established for you to reach before earning the next trick or game or area, the overall experience would be much less head-scratchingly odd.   It's easier to breathe and kick back with taking care of and playing with your pet after you've gotten through those early unlocking obstacles, and it's whimsical to see your young puppy scampering around outside while you stroll to the local pet store or competition arena. But, then again, the experience ends up lacking once you get into any of those activities  there's an odd power meter mechanic used in calling your pet, or getting it to fetch items outdoors, or compete in agility events that feels like a hold-over from a golf game; an odd implementation of touch screen commands and an overall absence of a sense of connection between the game and the creature on several occasions.   In grooming your pet, for instance, the unkempt fur you're asked to brush into brilliance hovers above your animal, unconnected to their body. And spoken commands into the DS microphone rarely seem to register correctly. And petting your puppy or kitten is stiff and unresponsive  most often the animal just sits there staring straight out of the screen while you rub the static hand icon over their body, achieving little success at whatever it is petting's supposed to accomplish anyway.Such a laundry list of minor complaints ends up building into a significant distraction, and, combined with the amount of staying power already demanded of you to get to the ~good parts,~ Best Friends ends up as nothing better than an average virtual pet experience. All along it lacks a hook  a fresh, unique feature that would make the frustrations worth enduring. Earlier this year, another Paws & Claws game, Pet Vet, had a similar overall feel and flavor  but it also had that little something unique, that focus on veterinarian simulation that set it apart and made it worth a look. This Paws & Claws game misses that mark, so virtual pet players will still want to look to Nintendo's Nintendogs instead, even after two full years.", "date": "Oct 27, 2007"}