{"name": "Ultimate Hunt Challenge", "name_review": "Ultimate Hunt Challenge", "ref": "https://www.ign.com/articles/2000/05/10/ultimate-hunt-challenge", "text": "You're not a real man until you've bathed in deer urine, or so my connections in the good ol' boy community tell me.  I guess standing around in the dead of winter covered in doe spoor is to hunters what making your bones is to the Mafia.  Don't knock it though, it's a rite of passage that has served fans of the sport equally as well as traditions such as the tailgate party, down home barbecue, and drunken binge.  Feel like getting up at 6am, climbing up a tree, and freezing your ass off waiting for an animal to pop its head out to take a whiz so you can pump it full of lead?  Then grab a six pack and all the ammo you can carry, because with EA Sports' latest title, it's a-huntin' we will go.  If I haven't offended your sensibilities by now, I sincerely apologize, but at least Ultimate Hunt Challenge will pick up where I left off.  One of the finest examples of shovelware ever seen, this three game set is a testament to the consequences of letting one's marketing department run amok.  First on the menu is Deer Hunt Challenge: Special Edition, a souped-up enhancement of an older release which went largely unnoticed by the public last year.  Also included are Turkey Hunt Challenge and Pheasant Hunt Challenge, which are both little more than direct ports of DHC:SE, although the deer have been replaced with fowl (there's bound to be a pun here somewhere).  Label it ~Deer Hard Trilogy~ at your own risk.  Armed with rifles, shotguns, and bows, it's up to you to track down big game through several modes of play.  If you're up for mission-based objectives, check out the challenge mode, which will march your camouflaged rear through locales such as the forests of Michigan, the canyons of Texans, and areas of Montana rich with wildlife.  A hunting trip option is also available if you're just out to bag a few kills for dinner and can't handle the pressure of trying to rack up a high score.  Target practice mode lets you brush up on your aim by practicing with cardboard cutouts and skeet shoots before you make an ass of yourself in public during multiplayer LAN or Internet games.  To say that the gameplay remains largely the same between Deer Hunt Challenge: Special Edition and Turkey Hunt Challenge is the understatement of the year.  Both titles require you to don an assortment of tacky getup, hide out in the brush, and sneak up on potential victims.  By using a system of hotkeys or a mouse-driven menu, you can charge into the fray at full speed, creep along cautiously, or crawl through the brush to reach your target.  Getting the jump on critters isn't as easy as it sounds, however, thanks to their acute senses of hearing and smell, which send them dashing off at full speed at the merest hint of danger.  To fool the beasts, you'll have to pay attention to how much noise you're making while traveling over different types of terrain.  While you're at it, don't forget to take care to cover that putrid human scent by walking into the wind and making use of the various animal hormones provided in each scenario.  An assortment of gear, ranging from binoculars to hunting blinds and bird/deer calls also helps to ensure that woodland creatures will blunder within striking distance.  Once within range of your sights, the timeless struggle between man and nature begins in earnest.  Using the mouse in ~free look~ mode, you'll aim your gun barrel(s) and attempt to let fly with a killing shot.  Placing a bullet squarely between the eyes of your victim or right into their heart is essential, as misplaced shots can result in a wounded animal that you'll have to spend time tracking down later on.  Attempting to follow a blood trail or series of hoof prints isn't all that it's cracked up to be...trust me on this one.  Once you've brought down one of the feathered or furred SOBs, simply trot off to pick up their corpse and collect your well deserved point score.  Although Pheasant Hunt Challenge plays out in a similar manner to its brethren, there are several obvious differences to the basic formula.  For example, you'll often have a dog by your side, who's job is to flush out the birds and retrieve their bullet-ridden bodies after you're through busting caps like Compton's finest.  In addition, though you can bring down gobblers while they're landed in Turkey Hunt Challenge, Pheasant Hunt Challenge requires that you pop the birds while they're in flight.  Trying to approach pheasants the Rambo way, by getting within point blank range and opening fire while the brain dead birds just stand there, doesn't seem to work.  The first time I tried to get away with this schtick, the game bluntly informed me that my brilliant tactical approach simply wasn't going to cut it.  Sigh...it hardly seems sporting.  It's understandable, I suppose, bearing in mind that stealth and subtlety are what the hunt challenges are all about.  Still, for all that you get to creep about in gorgeous 3D renditions of snowy forests, hunt through the flatlands during a downpour, and stalk the wild turkey in its natural habitat, having to keep your anger in check is a pisser.  I'm sure there's something to be said for shadowing creatures silently through the forest, fearing that every misplaced step will result in the crackling of leaves or the snapping of a branch, leading to the loss of a kill.  But what can you say about a game that taunts you by giving you a deer finder, places the animals in plain sight, puts a shotgun in your hands, and tells you to go about your business with the patience of a monk?  Realistic it may be, but fun it's not.  Even when you can do your Duke Nukem impression without fear of being disqualified, the game amounts to nothing more than a glorified target shoot with a fancy coat of paint.  Therein lies the heart of the problem.  All three titles may well be the ultimate deer/turkey/pheasant hunting experiences, but when evaluated based on the level of entertainment they'll provide the average gamer, they're a collective piece of crap.  Even though Ultimate Hunt Challenge features some wonderful outdoor visuals and a huge array of ambient sound effects, it deserves no more than an hour or two of your precious time.  I'll concede this much.  If a simulation that involves standing in the woods making ~gobble gobble~ noises is your idea of fun, than Ultimate Hunt Challenge may fit the bill.  If not, consider packing a load of buckshot into Ol' Bessie and pointing her at your own temple.  It'd be a less painful experience.  -- Scott Steinberg", "date": "May 10, 2000"}