{"name": "Crash of the Titans", "name_review": "Crash of the Titans Review", "ref": "https://www.ign.com/articles/2007/10/29/crash-of-the-titans-review", "text": "Crash of the Titans is a clever play on the title of the 1981 cheese-fest starring Harry Hamlin as the Greek mythological hero Perseus. How the movie and Crash are related is entirely debatable, though. The only link I could find -- and it's tenuous -- is that both look great at first blush but deeper exploration reveals some glaring weaknesses.   It must be pointed out up front that developer Devalley Entertainment has some serious chops in the art department. From the first frame of the tutorial to a showdown with a huge rodent that sports boxing gloves, Crash of the Titans unspools some of the best hand-drawn sprites this side of Glu's Super KO Boxing. The size of the characters gives them real weight and almost every member of the game's cast is gifted with smooth animation. And don't get me start on the color choices. This game popped off my Sony Ericsson w810i in brilliant bursts of reds, blues, and greens. Really, the visuals in this game are top-notch and Devalley Entertainment deserves serious praise for conjuring them.   But like the first half of any back-handed compliment, I've buttered the game up first. As wonderful as the game's graphics are, they do not cancel out the incredibly rote game play. Crash of the Titans brings little new to the table. This is primarily a game about running forward while jamming on the attack button, and there's just too many of these games in orbit. I'm not advocating an unnecessarily complicated attack system, but just too much can be accomplished by pounding a single key in combat situations.   Occasionally, the game offers slight tweaks, like setting a stage against a time limit or offering pieces of the environment to interact with, like rails. But it's just not enough.   Crash of the Titans also makes use of ~jacking~ in an attempt to change things up, but it fails to help the cause mainly because it feels so unnecessary. While jacking, the hero Crash is able to take control of dazed enemies. He hops on them like some cartoon Master Blaster (it's a ~Thunderdome~ thing...) and drives them forward, smacking around other enemies. The tutorial sets it up as something imperative, and while it is needed to solve a few puzzles, you can largely push through the game without it. In fact, you may wish to because the jacking elements because it's frustratingly slow. Crash is ultra-powerful on his own, thanks to a combo system that relies on simply hammering the attack key.About four stages into the game, you realize that too much energy went to the visuals at the expense of the game play. Which is too bad, because Crash of the Titans stands at the edge of mediocrity, wistfully looking into the domain of other good games. If you are still a fan of Crash Bandicoot and can somehow overlook the simplistic mechanics, by all means, dig in. But I can recommend too many other strong action titles to give Crash of the Titans a top of the hat.", "date": "Oct 29, 2007"}