{"name": "Exit", "name_review": "Exit Review", "ref": "https://www.ign.com/articles/2007/10/29/exit-review", "text": "Mr. ESC (we believe that's short of Escalade) steps onto the scene of a metropolitan disaster dressed in black, with fedora screwed on tight, red scarf flapping in the wind. Only he can save the citizens trapped in various buildings around the city. Fire, water, and electrical shorts won't stop him from finding the whining victims trapped in each building and then leading them to the exit. This task is rarely easy and will require you to use your noggin in ways unusual for an Xbox Live Arcade title. Released on PSP well over a year ago, Taito's Exit makes its way to Xbox Live Arcade. The perfect type of game to port, Exit is an inventive title with a slick style and brain-scratching puzzles. Many will find the unique set-up refreshing, but it's a few old-school game mechanics that keep Exit from reaching the upper echelon of XBLA titles.   As the mysterious Mr. ESC, you enter a variety of disaster zones with two tasks: Rescue any survivors and make your way to the exit. At the start of each level, you'll have only Mr. ESC's sense of style and his ability to leap short distances as your tools. But carefully laid out in each level are items needed to make it to the exit. You may need a fire extinguisher to put out a small blaze, a ladder to set in a specific area so you can climb to a lower level, or keys to unlock a door. You will also be able to use the people you rescue to aid you in getting you to the exit.    Survivors come in three different shapes: normal, big, and child. Each has their own skills and drawbacks. Kids are too small to climb most obstacles without an assist, but can crawl through small spaces that no one else can access. Tubbies require two people to assist them when climbing high surfaces, but are the only ones that can push large blocks. Many of the levels deftly weave these traits into the overall puzzle and give you one more thing to worry about. All of this would be perfect, were it not for some touchy AI. Escapees don't always make sensible choices when ordered to follow you and the command input system is sluggish. With a timer counting down in each level, this slowness can sometimes become an annoyance.   Speaking of slow, Exit's only other major issue is the sluggish movements of its protagonist. Mr. ESC does just about every action as if he were vacationing in the Bahamas, not making a daring escape from a burning building. Also an issue is Exit's old-school movement system. Mr. ESC's movements are similar to that of the original Prince of Persia. There are invisible blocks in the floors, requiring you to be on specific spots to execute proper jumps or pick up items. It's almost certain to become an issue for gamers at least once every few levels.   Exit comes with 120 puzzles (20 of which are unlocked by making your way through the initial stages). There are other locked puzzles that must be purchased through yet-to-be-released downloadable content. The puzzles included offer some surprising amounts of variety. Though the concept never changes, the dangers do. There are quite a few softball challenges that you can walk through blindly, but there are just as many truly tricky puzzles. These harder puzzles tend to become about trial-and-error and many will need to be replayed in order to beat. But if you know and accept that this is the type of maze puzzle game where you are using pen instead of pencil and the only way to ~erase~ your errors is to restart the level, then it's not going to be a source of frustration.There's nothing like Exit on Xbox Live Arcade. It's a smart puzzle game that has a few issues that aren't severe enough to detract too much from the overall design. Though some are certain to complain about having to purchase extra levels via Marketplace, consider that you get the entire PSP game (which also had premium downloads), for only $10. The levels only take a few minutes to beat, if you can do so on the first try. But there are 120 different levels to take on with the initial download. That's a pretty fair amount of time invested in an XBLA title. Though it's not perfect, Exit is worth picking up for any fan of Lemmings or Lode Runner.", "date": "Oct 29, 2007"}