{"name": "Guitar Hero III", "name_review": "Guitar Hero III: Legends of Rock Review", "ref": "https://www.ign.com/articles/2007/10/29/guitar-hero-iii-legends-of-rock-review-2", "text": "While other virtual guitar shredders on PS2, 360, and now PS3 have some serious decision making to do this holiday season, Wii gamers are faced with both a blessing and a curse with Guitar Hero III.  Being that Activision's first guitar effort also happens to be the first Nintendo iteration of the series, the Wii experience will be one without any sort of prejudice or premonition carried over from the Red Octane, Harmonix split.  Not only will GHIII be the only rock game on the system this year, but it's also a first for the series, making it one hell of an easy choice for Wii music lovers.  There may be a bit missing when compared to the other versions on 360 and PS3 - particularly the downloadable content - but aside from a few minor gripes there's literally no reason for Wii owners to pass this one up, as Guitar Hero III: Legends of Rock kicks the series off on Wii in a big, big way.   If you don't know the Guitar Hero series by now, consider yourself impotent as a gamer.  The franchise got its start in the dank, darkened cubicles of Kentia hall at E3 2005, only to become one of the biggest gaming franchises out there, including an original release in 2005, a sequel one year later, a 360-specific sequel this year, as well as an extra ~Encore~ 80s edition.  2007 has already been a huge year for the franchise, with games hitting 360 and PS2, but with Activision's acquisition of the franchise this holiday season brings us another impressive compilation, including a ton of options, classic gameplay, and easily the best track list to date.  It's time to rock out on Wii.  Whether you're playing it on 360, PS3, PS2, or Wii, Guitar Hero III is pretty much the same experience.  You'll hit falling notes by strumming a single string button while holding one - or multiple - fret buttons in a classic DDR fashion.  Despite being built entirely from the ground up by Activision this time around, the game feels great, changing only a few specifics during its move.  Notes have a larger window of time to be hit (something you may love or hate depending on how musically minded you already are), but the game also has a lower overall tolerance for missed notes.     As with the other versions of GHIII, Wii gamers will find that the easy mode is extremely simple, while expert has taken the series to a whole new level of difficulty.  You'll find more runs, more of a necessity for hammer-on and pull-off techniques (which basically let you hit the first note in a run, and then use only the fret buttons to continue that run, taking away the need to finger-tap), and much faster chord-to-chord lines.  First timers will be happy to hear that the game is simple enough for Wii's younger audience - as long as you keep them on easy, that is - while the more hardcore Nintendo fan will definitely have their work cut out for them, as Guitar Hero III raises the bar substantially; something that could be pretty daunting for first-time players on Wii.     Guitar Hero III also includes what we consider to be the best overall track listing in the franchise history, including a ton of master tracks, some decent bonus songs (the weakest portion of the game, but still an amazing set of extras), and a ton of player customization.  Not only will you have master-track recordings by the likes of Aerosmith, Slayer, and Iron Maiden, but also Metallica, which is pretty impressive for anyone that is well-versed in the music industry.  Really?  The same band that is notorious for bitching about where its music is shared/played actually contributed a master track to a music videogame?  Truly impressive.     You'll also have a few songs in the mix that are re-recorded for specific use in the game, a prime example being Anarchy in the UK by the Sex Pistols.  And per usual, all bonus songs use master track recordings, so you'll get Dragonforce's Through the Fire and Flames direct from the rock gods themselves, as well as top titles by Lacuna Coil, Fall of Troy, and Rise Against.  We may not dig every bonus track on the list, but there should be something for everyone.    And while we've talked about it time and time again, we really want to nail home just how impressive the guitar shells are.  The Wii-mote fits snug inside though a panel in the back, and stays entirely out of the way while rocking out.  With the added weight, Wii-mote speaker, and rumble functionality we'd rather use Nintendo's controllers over the other versions, though there really is very little difference overall.  In our previous hands-on with the game we noted the frustration of removing the Wii-mote to boot the game, but with the final boxed copy of GHIII that isn't the case, as the analog stick attached to the top of the guitar can be used much like the Classic Controller on the Wii menu.     It can be a small pain to pull out the remotes whenever you want to switch games, but seeing as you'd be swapping controllers out on every other console as well it's an expected annoyance, and not much of one at that.  The frets also feel a bit wider across all guitar models this time around, but seeing as it's the first Wii effort this is more of a starting point for Nintendo gamers than a change.  Combine that with the overall difficulty, and younger players will generally want to stick to the easy/medium modes.  Legend vs. Legend.   As for the actual changes made this time around, Guitar Hero is a mix of both good and bad.  We don't personally dig the style as much, with character designs looking blatantly over-the-top from even the original GH designs, and far more product placement throughout the game, but visuals aren't exactly the highest priority in this case.  That's like freaking out because of DDR backdrops.  Still, the animations are stiffer, and the interface and general art direction screams ~Look how hardcore we are!~ in more of a forced manor this time around, rather than doing its own thing and being visually pleasing because of it.  You can tell Activision really tried to be Guitar Hero, rather than letting the series sit in its visual niche it had already developed.  It's a minor gripe, but it does feel a bit forced.   On the plus side, however, the new battle modes are a blast, as is the online play and emphasis on multiplayer this time around.  Co-op career mode was a must-have, and facing off against Tom Morello and Slash from Guns 'n Roses gives the game a fresh experience during the otherwise cookie-cutter song-to-song career mode; especially when they become playable after being defeated.  Why there are only three overall bosses, however, is beyond us.  If it's all about the ~Legends of Rock~, we could sure use a few more to rock against.    So while single player still feels a bit underwhelming, multiplayer definitely shines.  Whether you play against friends or random guitar heroes online or locally, the experience is pretty much the same, as you can pair up for face-off, pro face-off, battle mode, or co-op sessions, and rock out to your heart's content. The only real difference here (aside from no co-op career online) is that you'll need to watch for the guitar power icon when playing online, rather than having a friend next to shouting ~Dude, star power!~ all the time.  Online on Wii is a huge plus, and that alone should make this one a no-brainer for music fans, even if you don't have any real friends to rock out with.   Editor's Note: Since the time of review it has come to our attention that the Wii version of Guitar Hero III: Legends of Rock makes use of only mono sound, rather than actual stereo (or Dolby Pro Logic II) audio.  At the initial time of review we didn't notice this issue - and to be honest, the game still sounds great despite playing everything out of each speaker - but Wii owners that plan on experiencing Guitar Hero on more than just your standard TV speakers may want to weight their options, as Wii's version is the only one out there that fails to deliver even stereo audio.  Activision commented that there still may be a chance to update the game via Wii Connect 24 or a Wii system update, but as it stands right now there's no guaranteed update in the works. All in all Guitar Hero III: Legends of Rock is an impressive addition to any Wii collection.  The guitar peripheral feels great, Activision nailed the Guitar Hero gameplay, and the 70+ tracks make up a set list that trumps any collection before it.  Online is a huge plus, especially on Wii, as not many games have excelled outside of local multiplayer play, and the massive amount of options, modes, and customization holds up to previous versions of the game, and should definitely impress any first-time Guitar Hero players on Nintendos console.  What you wont get, however, is downloadable content, which is a huge shame, as itll be a huge focus on both Guitar Hero III and Rock Bands future.  Wii simply doesnt have the space, and despite the developers best efforts the system just isnt ready for that type of expansion yet, which is disappointing.  On top of that, the Wii version of Guitar Hero III fails to deliver even stereo sound, offering only mono audio.  It's an odd omission, but as long as you're playing the game through regular TV speakers it won't be a major downfall, even if it is a ridiculous omission.  Even still, Guitar Hero III: Legends of Rock has more than enough content to justify a purchase, so while we complain about a lack of expandability for Nintendos version of the game, theres no denying that the fun factor remains.  If youre new to the series, Guitar Hero III is a must-have.  360 would still be our system of choice overall, but Wii owners shouldnt hesitate one bit to pick this one up, as its the best in the series, and a must-have for any music lover.  Trust us, you want to rock.", "date": "Oct 29, 2007"}