{"name": "Soul Nomad", "name_review": "Soul Nomad & the World Eaters Review", "ref": "https://www.ign.com/articles/2007/10/30/soul-nomad-the-world-eaters-review", "text": "Just about everybody wonders what they would do if they were suddenly, in the hustle and bustle of everyday life, granted a healthy dose of supreme and immutable Godlike power. We, for example, might wave our hands and bring a harmonious peace to the world, or perhaps we'd make Jessica Alba an avid IGN reader (you're welcome to stop by the office anytime, Ms. Alba!). Others, however, might use that power to conquer the world, and that's pretty much what Soul Nomad & the World Eaters is all about.   Developed by Nippon Ichi Software, Soul Nomad is a strategy RPG that generally revolves around the idea of divine power and how it could be used to either conquer the world or save it. Very much in line with other NIS titles, Soul Nomad is extraordinarily deep and undeniably quirky, and offers itself in a simplistic, old-school format that will please some people and completely turn-off others. And while this game does a lot of things well, considering its well-versed developer, it carries a number of pretty obvious flaws that hurt the overall experience.   The opening sequence. Soul Nomad places you in the shoes of a hero, either male or female, that you name. From then on, you usually select every line of dialogue that your character speaks, even if you only have one choice. In this manner, despite the fact that most of the dialogue trees are linear, you still feel like you're taking on the role of the hero, which is a nice touch.   At the game's beginning, you find out that long ago three World Eaters, commanded by a single dark figure, completely ravaged the land, but went silent when their leader was sealed by the forces of good. When you're only a few minutes into the game, your character is fused with the soul of that same sinister being in hopes that, with his power, you can destroy the World Eaters that still remain. So your body has a visitor, and that visitor is Gig. He's a hyper sarcastic God and he's not too happy about his current situation. If you're a little confused, that's okay. Let's just say that this game has a very interesting premise.   That's actually one of the more entertaining aspects of Soul Nomad. The dynamic between your hero and the encased soul of a God can be pretty entertaining, considering Gig's hopelessly cocky personality. Although we've seen somewhat similar stories of threatened worlds and great power before, it's somewhat rarer to have a God of Destruction sharing your body, so that's pretty rad.   Soul Nomad is, first and foremost, somewhat hard to understand. The gameplay mechanics are surprisingly unclear and the incredibly quirky terminology may throw some people off. Let's take a moment to explain. Soul Nomad is a grid-based strategy game, so that means moving units around, attacking, and using special techniques and such to triumph over the opposing forces. With this game, however, each unit on your team is actually a leader of a squad that you create, which makes things much more complex.   That's quite accurate. The confusing terminology comes into play when dealing with these squads and how to organize them. Each squad is actually contained within a room, in another dimension (seriously), and those rooms can be decorated and manipulated to best suit the squad.  Furthermore, your warriors aren't actually real people when you're setting up your squad - they're manikins, and they just represent the people you've dominated so that, come battle time, you can pull them through the pocket dimensions and into battle, regardless of where they are.   ...   That's some pretty wild stuff there. You'll be confused, for sure, but just keep this in mind: instead of individual units, you command small squads that are arranged on mini-grids. That's the simpler way to put it. This system is a pretty refreshing change from other NIS titles, because you can actually arrange multiple warriors in different rows (front, middle and rear) to create different strategic effects. For example, having a cleric in the middle row will cause him to heal one ally when the entire squad performs an action. If you place him in the rear, however, he will heal all the members of your squad. And because you have the ability to create a host of different characters from varying classes, all with a handful of abilities, you have a ton of creative control over how you form and develop your teams.   During battle, when your squad (represented by one unit) reaches an enemy and attacks, the screen shifts to its battle presentation, where both squads are pictured fully on either side. Your team then attacks together as a group, though their attacks are targeted to individual members of your opponent's squad. Again, Soul Nomad's battle system can be a little disorienting at first, but there are a lot of tutorials and eventually you'll find yourself carrying out heated battles with grace and flair.    There's a lot to do in this game, and many details must go unmentioned here, simply because they would take too much time to cover. To be brief, you have the ability to tap into Gig's power through the usage of Gig Edicts, which can have a menagerie of uses. For example, you can use them to steal from shops or pick fights with random townsfolk. In battle, they can be used as restorative items or buffs. This gameplay element makes things more interesting and gives you another degree of control when interacting with the game world.   Another aspect of Soul Nomad that we really appreciated is the ability to perform an Inspection on one of the rooms your squad inhabits. ~Inspection~ is just a fancy term for entering a random dungeon, where you can level up your characters and ultimately raise the power level of the room itself, which gives you points for raising your character's stats. Oh my. As you may have expected, you can do some pretty insane leveling in this game.   Battle grid. The title has many other positive elements to its name. Being an NIS game, it's pretty funny and loaded with a quirky sense of style. We tried playing the game as a girl, and within a few minutes, when she wanted to take a bath, there was an awkward yet amusing conversation between her and her male companion - the one currently sharing her body. The music is also quite lovely and reminiscent of Disgaea's soundtrack. Furthermore, one of our favorite things to discover was the presence of a complete Japanese dialogue track, which is fantastic for those who want to avoid the English voice actors (who still do a somewhat fair job). With great style and mind-blowing depth, Soul Nomad certainly has a lot going for it, especially with the availability of multiple endings and a New Game + option.   Unfortunately, as we mentioned before, this is definitely not a perfect title. In fact, there are a number of things we were upset about. For one, in regards to the voice acting, we found a lot of discrepancies between the Japanese dialogue and the English translation. I, personally, won't ever claim to have any sort of fluency in Japanese, but I can definitely recognize and figure out certain words and phrases. So, what the Japanese actors were saying wasn't always matching up with the English script. This certainly isn't a tremendous issue, and if you don't understand Japanese it won't be a problem, but it's something to consider. Perhaps NIS changed the English script to be a little more comical than its Japanese counterpart.   More troublesome, really, is the lack of good presentation. There are no animated cutscenes or impressive story sequences at all, and in the rare event that the character portraits are displayed on the screen along with their dialogue bubbles, they don't change at all depending on the situation or emotional tone. This was terribly bothersome for us. We could possibly forgive a lack of fully animated sequences, but having only one static character portrait for every situation just looks terrible. The problem is even further amplified due to the fact that the character designs are solid and a lot of fun to look at, so we wanted to see more art, but we never got it. It's a shame, really.   Along these same lines, the game's technology is really unimpressive. This looks exactly like every other NIS game, and that's a problem. Not because we have anything against 2D sprites or old-school style set-ups, but those sprites could have had more detail, larger animation sets or even higher resolution models. After playing Odin Sphere, we know that the PS2 can pull of some incredibly wicked 2D art, and it's tragically absent from Soul Nomad.   Performing basic attacks. Lastly, we feel the need to point out that this game has a very... strange world and method of interaction. There really are no environments to speak of, in the traditional sense. Almost everything takes place on a painted background, and entire towns and cities are reduced to a single image that you just navigate through with text. Even the battle fields are just flat planes with trees, mountains, rivers and the like drawn on. Considering all this, we have to stress this last point: some people might very well love this particular style; we certainly thought it had its moments. A lot of gamers, however, will absolutely hate this sort of thing, so think about which camp you belong to before making the plunge.Soul Nomad & the World Eaters is a good game, with a fantastic amount of depth and the potential for nearly limitless hours of playtime. Unfortunately, there are a number of things that prevent it from reaching the level of quality that we know it could possess. Looking at Soul Nomad, you can see the framework for an astounding game, but the rest of the structure just isn't there. On the bright side, the game that is there is a lot of fun and is sure to win the hearts of the super hardcore, strategy RPG crowd that we know is out there. If you dont mind the somewhat disappointing lack of overall polish and you just want the game for the raw mechanics and leveling system, youll undoubtedly enjoy it.With that said, well get back to conquering the world. And Ms. Alba, youre still welcome to stop by.", "date": "Oct 30, 2007"}