{"name": "Naruto: Rise of a Ninja", "name_review": "Naruto: Rise of a Ninja Review", "ref": "https://www.ign.com/articles/2007/10/30/naruto-rise-of-a-ninja-review", "text": "The Naruto anime is among the most popular in both the U.S. and Japan. It's only natural for game publishers to invest some cash to turn such a hot property into a videogame. To date, the result of translating Naruto into a videogame has not been positive with almost no great titles on shelves. That changes with the release of Ubisoft's Naruto: Rise of a Ninja, without question the best Naruto game to date.    Both an adventure and a fighting game, Rise of a Ninja follows the first 80 episodes of the Naruto anime. For fans of the series, Naruto is a walk down memory lane, as players participate in key moments from select episodes. If you're not an otaku, don't worry. Rise of a Ninja is designed to introduce the series to the unfamiliar (like me). You don't even have to like anime to be wowed by Naruto's stunning cel-shaded graphics and engaging storyline. Those new to Naruto won't quite understand why every other adult introduced is instantly branded a pervert or catch the subtext in some of the NPC relationships. Despite missing out on some of the context, anyone can follow along with the main adventure.    You play as Naruto, an orphan with dreams of one day becoming the Hokage (AKA big cheese). As Rise of a Ninja begins, Naruto is hated by pretty much everyone in the town of Konoha. But really, who wouldn't hate an orphan who wants to better himself and become a productive member of society? Know your place, Naruto! Your goal in the single-player adventure is to win the respect of the citizens of Konoha by proving Naruto's worth. He's still an orphan seven hours later, but at least most of the town loves him.   Rise of a Ninja starts out painfully slow. So slow, in fact, that some will give up on the single-player adventure in the first hour. That, however, would be a mistake. Once you get through the initial hour and a half (which consists of rudimentary fetch/delivery quests), Naruto's pacing picks up considerably. By the end of the adventure, with young Naruto braving the seemingly impossible Chunin Exam, I was hooked. Things move so quickly that the final few hours pass in a flash. And before you know it, the main adventure is over.   The tasks you face in the single-player portion are nothing new for an adventure game. There are lots of fetch quests, timed races, and hidden coins to collect. Many of the more adventurous quests have Naruto exploring outside of Konoha village into various parts of the forest. The game's visuals, which rank among the best cel-shaded look on any console, manage to make some of these mundane tasks seem just a touch more exciting.   Outside of town, Naruto often runs into bandits and rogue ninja he'll need to beat in order to complete his mission. Naruto's health doesn't instantly reset between battles, which makes some of the environmental hazards (who left all these swinging logs out?) a bit more treacherous. Taking damage from a spiked floor trap before running into an enemy is only going to make that fight more challenging. Fortunately, you can stop and eat some Ramen (which comes fairly cheap) to heal. This doesn't always work, since some boss fights have you facing several enemies in succession.    Meet the sand man. Should you be defeated in combat, your battle doesn't necessarily end. Throughout his adventures, Naruto earns memo clips. These clips are inspirational memories from the past. If you have a memo clip, you can use it after your health hits zero. As the memory plays out, you must rapidly tap the A button to regain health before being thrown back into battle. The memo clip is used only in the single-player adventure and it works very well. It's just one of the many small details that help Rise of a Ninja stand out from other Naruto titles.   As you progress in the single-player campaign, you learn new Jutsu. Think of these as ninja powers. Jutsu are cast by holding down the left trigger and making hand signals with the left and right thumbsticks. Outside of combat, Naruto uses Jutsu to focus his chakra in his feet so he can run up walls and trees, to clone himself in order to break down otherwise impenetrable barriers, and to transform himself via Sexy Jutsu to look like a bodacious babe. This last one is used to send lovelorn villagers into epileptic fits of joy (and thus win their favor).    As you learn and improve your Jutsu the single-player world opens up. With the highest level of Chakra Concentration, you can scale the tallest buildings in Konoha and find all new areas for exploration. You can even use this power to eventually walk on water. The stronger Naruto grows, the better the campaign gets. And it ends in a no-holds-barred brawl with some tough enemies. Once it is over (in 6-8 hours), you can continue to run around Konoha and do odd jobs for people in attempt to win them over (and earn more Achievements). But by this point, you should be ready for the true meat of Naruto: Rise of a Ninja -- the multiplayer.    Naruto's combat system is not deep. This is not Virtua Fighter or even Tekken. Each of the eleven playable characters comes with around a dozen combos and as many as three Jutsu. Learning the moves and the hand signals for each character won't take more than one or two fights at the most. But just because the combat isn't complex, doesn't mean it isn't good. Rise of a Ninja sports fast and absolutely gorgeous combat. It's immensely fun and accessible.   While the combat lacks depth, it does still have strategic elements. The most powerful weapon in combat is your Jutsu. However, casting Jutsu requires you to stand motionless as you charge your power (up to three full levels). Casting Jutsu is a gamble. Space becomes a critical part of combat in Naruto. A few feet may be enough to cast a low-charged Jutsu. Knocking an enemy to the other side of the ring should afford you time to unleash a Jutsu at full power.    Some Jutsu increase your attributes, which are helpful, but not the main attraction. It's the offensive Jutsu that are most impressive. These aggressive Jutsu initiate a mini-game (unique to each character) which has both attacker and defender competing to determine the amount of damage dealt from the attack. Naruto's Shadow Clone Jutsu creates numerous copies of our hero, which then assault the enemy. As each clone attacks, a button command appears on screen. This determines which strikes land and which miss. Get a perfect series of hits and you deal some serious damage to a foe. Zabuza's offensive Jutsu calls forth two water dragons. As Zabuza's player moves the thumbsticks to try and lock onto his opponent, the other player attempts to dodge the reticule. The various Jutsu add quite a lot to Naruto's fighting mechanics. And boy do they look cool.   Every playable character in Naruto feels distinctive. Even if you know nothing about the anime, you can still appreciate Gaara as ~The Sand Dude~ and Kiba as ~Wolf Guy.~ The basic attacks for each character tend to be unique, so that a simple punch with Naruto is different than what you get from Rock Lee. And that's as it should be for a popular licensed property with a score of well-known characters.    When you near defeat in combat, you can enter Rage Mode. Naruto: Rise of a Ninja can be enjoyed both online and offline with almost equal measure. Offline you can play one-on-one matches or create tournaments. Online you have the same ability to battle against another person in a single match, but have the benefit of the Forest of Death Exam open tournament.   The Forest of Death Exam is not a bracketed tournament as we're used to seeing online. There's no appointed time to meet, no need to sign up for a league, no restriction on when you can hop in. Go online, select the Forest of Death Exam, and you will be ready to fight. The Exam has you first battling for the right to enter the Tower of Death. To earn this, you must defeat two randomly-selected online opponents in a row (they are trying to meet the same goal). Do so and you make your way into the Tower of Death. You ascend the Tower's three levels by defeating other online opponents who are in the same level of the Tower. Once at the top, you continue to battle incoming challengers until you're defeated. As you ascend the Tower, you earn points both in combat and for each victory. These points continue to tally until you're defeated. The open tournament style is fantastic. It allows you to hop into a competitive match, earn cumulative points as you battle, and quickly re-enter the fray if you're defeated.    In all of our online battles, Naruto: Rise of a Ninja played perfectly. There's no downgrade in the visuals between online and offline. It's just as fast and beautiful on Xbox Live as it is when playing your buddy offline on the same console. Though the combat may not be as intricate as hardcore fight fans might want, it is still pretty awesome.  Naruto: Rise of a Ninja is surprisingly enjoyable. Once you get past the first hour, the single-player campaign becomes a real treat. And the combat system, while not deep, is a lot of fun. Fans of the Naruto anime will absolutely want to pick this one up. Those who've never watched Naruto can still get a lot of joy out of this game. It may even inspire you to check out the series on DVD. Naruto: Rise of a Ninja isn't the best adventure game or the best fighter on Xbox 360, but the two pieces fit together to make for one of the better games on the system.", "date": "Oct 30, 2007"}