{"name": "The Witcher", "name_review": "The Witcher Review", "ref": "https://www.ign.com/articles/2007/10/30/the-witcher-review", "text": "Coming into 2007, The Witcher had little momentum. After a great showing both before and at E3, more starting jumping onto the Witcher-wagon. After many years in development and many, many impressive changes to the BioWare Aurora Engine, The Witcher is finally being released to the public. The resulting game is pretty strong thanks to an interesting world rife with moral divides in a story progression that makes for hard choices when creating an identity for Geralt, the protagonist. It's a well realized and detailed world with excellent music to fill in the mood. If it wasn't for some story inconsistencies, crashing issues, and snore-inducing load times, The Witcher would be higher on our list of must-haves. As it is, we still recommend the game, but want to note for buyers to beware of the technical problems. The Witcher's story is an unusual one for fantasy. The world is dark and grimy in the way you'd expect actual medieval towns and landscapes to be. It's full of fear, disease, religious zealotry, and political maneuvering that results in pain for the powerless populace at large. In short, it's a window into our own world and tries to expose some of the issues that we deal with on a daily basis while still providing players the chance to control an interesting character and participate in an exciting adventure. It results in some cheesiness as the writers try to shove too many modern day problems into one game, but many of the issues are tackled in a mature fashion and we couldn't help but be drawn into this flawed but hopeful world. LoadingPlay While tensions always seem to be high between humans, elves, dwarves, and other races of fantasy, this Polish-born tale pushes those tensions into full blown racism. While most of the epithets are cast at the ~non-humans~ like the elves and dwarves, the main character Geralt is not immune to the slanderous speech of the human population. While Geralt was born human, he was mutated and trained to become something both more and less. While Witchers are granted enhanced reflexes and strength and trained to slay monsters, use basic magic, and brew helpful potions, the process of mutation sterilizes them and as many observe in the game, turns them cold to others.  Thusly, Geralt's adventures are not all happiness and joy in finding new friends as they are in some RPGs. Most humans are wary of Geralt, some are downright hostile and the non-humans often have the same reactions because he's part human. From the moment Geralt leaves the confined tutorial area of his home castle Kaer Morhen, he's subjected to the fears and anger of a world looking for a reason to explode. Geralt, of course, takes a defining role at the center of that explosion, one way or another.  Geralt as the deciding factor in events is one of the reasons The Witcher works as a narrative and a game. The first couple of chapters of the adventure will offer up some moral decisions that may seem a little more cut and dry but when chapter three rolls around, the choices offered up are many shades of gray and it's hard to ever know that what you're doing is ~right~ by the video gaming standard of black and white right and wrong. Are you helping elves fighting for freedom and equality or terrorists that have just as much hatred of humans as humans have of them? Do the ends of preserving and protecting humanity really justify the potentially horrific means? Do I love Triss or Shani or just view them as toys for my amusement? These ideological, political, and personal decisions make the story and the game more engrossing as you sit there and wonder ~what did I just do?~  The story works itself out mostly through conversation though there is the occasional action cutscene at bigger moments as well as art ~slideshows~ of flashbacks to previous choices when a branch of the story comes to fruition. You'll see how your decision affected you and the environment/people around you. Their intention was to provide players with a chance to see that their actions have consequence whether it's good or bad but it also proved to be a powerful tool to get us to want to play again to see outcomes from different choices. Consequences aren't always immediately understood and it's not unusual for one of these scenes to play several acts in the past and relate it to current happenings. While it's generally pretty well done, it can occasionally be a little confusing. Whether it's the translation or just occasionally disjointed story progression is hard to say.  The slideshows aren't the only odd and disjointed bits of the story. There are some presentation issues in the cutscenes that cause some disconnect from the adventure. Right after one of the best cutscenes showing Geralt departing from Kaer Morhen we're jolted forward to Geralt outside of an inn as barghests attack. There's no connection showing that Geralt wound up there, just that he's there, waiting outside in the rain with some other folks. When that happened I didn't know where I was or what brought me there, only that I was suddenly there fighting glowing dogs. While most of the game isn't like this, some extra attention to presentation could have helped. With a bleak situation in a world filled with monsters, it would be sad if the combat didn't hold up and while it's not perfect, we are definitely pleased with it. It uses a timing based clicking system in order to keep the combat more RPGish while also making it more active. Clicking once will initiate an attack. Once that attack animation begins (usually involving several sword strokes) players will either wait for a yellow flaming sword icon (normal difficulty) or an orange sword arc (high difficulty) to know to click again to chain the attack into another combo. Attacks gain in strength the more skill points are allotted to each style. With three camera modes, players should be able to find something that feels pretty good to them in combat. I've preferred the over-the-shoulder mode since it provides up close action, but the isometric camera provides easier access to attacking different enemies since in OTS Geralt is tied to the reticule and isometric has the cursor free roaming.  The strength of the martial combat is in constant need to change between fight styles to accommodate different types of human and monster enemies. Double tapping on direction keys will also cause Geralt to dodge out of the way to get better positioning for the fight, which plays a very important role when combating certain enemies. The end result can turn into a ballet of death. When combined with signs, potions, and bombs, and the ability to charge up melee and sign attacks, the combat becomes even better. Geralt has access to five different signs which range from direct damage to causing fear or pain which can stun enemies. Stunned or fallen enemies can be clicked on for a final finishing move regardless of their health status. It makes using the correct tool pretty important when fighting large groups of strong enemies that might not get hurt much by the group style of sword fighting.   The character development system is pretty decent for building Geralt the way you wish. Each of the attributes, signs, and styles are divided into five tiers with various extra skills associated with each. Because the points are assigned bronze, silver, and gold statuses, it keeps Geralt from getting too powerful in one area too quickly and forces you to make choices later in the game about specialties since silver and gold points are much rarer. By the time the game is finished, you'll still have many silver and gold skills open on the skill tree.  CDProjekt has also tried to break up the story and combat with a couple of mini-games in the form of boxing and poker. Sadly, neither of these is really worth the time. While they can offer up a way to make money, it's more like cheating than a mini-game. The poker AI is very, very poor and makes incredibly bad decisions, even after the patch. They'll re-roll three-of-a-kinds when they have the game won, roll only one die when they need to roll two to get a straight to win the hand and so on. It's pretty sad. Boxing is dumb for an entirely different reason. Mini-games are meant to be a break in the action, offering a refreshingly different style of gameplay. Boxing is basically just like sword fighting, but with fists, and worse. If you're going to have a boxing game, why not make it more like Punch-Out! or something? Potions play a pretty huge role in the game, especially on the high difficulty setting, which is why we're a little sad it wasn't implemented better. It's not that the system itself is broken. On the contrary, the amount of potions and effects are varied and support a variety of play styles. The problem is almost entirely with the inventory system. Everywhere you go in the world, you can collect ingredients for potions off of plants, mineral deposits, killed creatures, or stashes. Each substance has one or two possible ingredient uses. The problem is, you can't sort them easily by ingredient type, you can't look before you go to brew potions if you have enough of any type, and you'll have to constantly look back to your journal to have any clue what you need to make a potion. This is especially aggravating after you start stashing stuff at the inns (inns act as a universal bank so that you can grab your stuff from any of them). There's no sorting tool at the inns at all so you'll have to mouse over and constantly check back and forth between substances to see if you've got the right ones. Since alchemy is such a huge part of the game, the interface for it (and especially the inventory) should have been given more careful consideration. It leads to a lot of aggravation when you constantly have to run back and forth to the inn and load in and out of areas in order to get the right amount of potion made. And it's that loading in and out of areas that is probably the biggest problem The Witcher has. Load times are loooooonnng, which can be a real bitch when running in and out of buildings inside a city since you're often conveying messages, trying to get to your stash, or completing quests. One of the main problems is that the game doesn't keep the greater area in memory when loading into a house. The load into the house will be quick, but then when you turn around and go back into the city proper, you'll have that long wait waiting for you. This is a problem even on high end computers.   It's too bad because the game really looks good. Environments are wonderful. The main city Vizima is lively and given a great amount of detail that makes it seem like a real place in this fantastic little world. The smaller towns are given nearly the same attention to detail and enough non-vital NPCs that they feel lived in. Wilderness areas are equally as easy to believe as real places. The game only really has visual problems when it comes to models. Models are used over and over, even for some more important side characters. And when it conversation, the lip synching is pretty bad as are the random animations that play. I suppose the animations are supposed to signify mood of the characters, but they come off as pretty goofy. Even Geralt looks strange standing around as his arms are always as straight as can be and look awkward. Considering how everything else looks so good, it's pretty strange.  Thankfully, most of the voice work in the game is good enough to forgive the lip synching problems. There are definitely a couple of actors that caused the cheese to start bubbling, but for the most part, especially with the main character Geralt, voice work is good. The voice work has nothing on the score, however. The composers of the music in The Witcher have done an excellent job not only capturing the feel of The Witcher's world, but also the excitement and magic of the adventure.  Sadly, the game is also not entirely stable. We've experienced numerous crashes both before and after patching the game (though admittedly many more beforehand). If you don't have a way to get the patch on the PC you play games on, we'd sadly have to say you might want to wait until you do. The Witcher really is a good game and one that PC RPG fans will surely enjoy. It combines some entertaining and fast-paced combat with a well realized world and pretty decent story that branches and can end in three different fashions. With a load of choice in character creation on a point assignment and morality level, theres plenty of reason to want to come back and play the 40-50 hour game again. The big problems mainly sit with the technical issues like crash bugs and long load times can be very frustrating. If it wasn't for those things The Witcher would have scored better here. If you can look past the technical side of things (which are still not as bad as some other RPGs released recently) The Witcher is definitely a game youll remember well over the years.", "date": "Oct 30, 2007"}