{"name": "DK Jungle Climber", "name_review": "DK: Jungle Climber AU Review", "ref": "https://www.ign.com/articles/2007/10/30/dk-jungle-climber-au-review", "text": "To sequel or not to sequel, that is the question, and in this instance, Nintendo (and developer Paon) has chosen 'none of the above'. Jungle Climber is something of a semi-sequel to the GBA's DK: King of Swing. It takes the original formula, revamps the presentation and includes a number of tweaks and new inclusions to the gameplay and level design, but still feels very much like a GBA game on DS.   That's not to say that Jungle Climber isn't fun. It is ish. And the mechanics are at least different enough from most other 2D platformers to make them noteworthy. Being an ape, you see, it makes sense for Donkey Kong to swing arm over arm through his jungle habitat, and that's what this game tries to capture. The L and R buttons represent DK's left and right hands respectively, and you hold one or both down to grip the available peg boards in the levels. Grabbing a peg with one hand sees DK spin around it, allowing you to release at the right angle to fling off in the direction you want to go. As you become accustomed to moving about in this way, you'll discover that there's some fun to be had by briefly gripping then releasing pegs as you pass by to fling yourself along and keep your momentum going.    Springy sunflowers and anthropomorphic bananas. This game has it all!  Of course, DK has a few more moves up his hairy sleeves. While you can leap into the air by holding then releasing the L and R buttons, you can also launch yourself up into a roll with the A button. While rolling, DK can scatter enemies aside and chew through wooden barrels like they were made of, erm, balsawood. Better still, find Diddy Kong in the level and he'll latch onto DK's back, ready to be flung from the apex of an A jump to even greater heights. This is used to get to the many, many collectables in this game, as well as to open up the way forward. DK's final - earth shattering - move is the ability to throw rocks. Grasp one in the same way you latch onto pegs, then throw by releasing.   And that's basically the sum total of moves in the game. As you'd expect, DK can also leap into certain cannon-esque barrels to fire himself about the place, can interact with other objects in the environment, such as switches, boulders and giant springy sunflowers, and can somehow survive underwater. Oh, and in a completely pointless nod towards touch screen functionality (the game is otherwise controlled completely traditionally), if you collect 100 gems, you gain the ability to fly for a short period of time. No, you don't direct DK using the touch screen, you, erm, activate the power by touching the screen. Honestly, a button would have been far more intuitive. But then there'd be no reason to shoehorn flying in at all, now would there? Honestly, DK flying for no apparent reason? We're confused.   Speaking of gems, they're just one of a veritable cavalcade of collectables. Bananas, oil barrels, KONG panels, DK coins, banana coins, it's acquisition gone mad. While platform games have always been driven - at least in part - by collection, this is just ridiculous. It's as if - in an effort to make up for other perceived shortcomings - the game has overcompensated. I'm sure there's some psychoanalytical explanation too; with all the bananas on display, Freud would have had a field day.   In addition to collecting reams and reams of bananas (honestly, when is it ever going to be enough? You're an addict DK! Put down the banana crack pipe and do something useful for once!), the entire 'story' (if you could call it that - which you can't it's more like an anti-story) is based around the pursuit of crystal bananas that King K. Rool (and his gang) has stolen. Surely Nintendo can come up with a better McGuffin than that? Honestly, it's meant to be an excuse for the action so why does Nintendo always rely on crystals and stars and the same thing? Why not shift things up? I'd love to be in pursuit, for instance, of a snappy two piece suit made entirely of banana skins that enables the wearer to jump between parallel universes. And I'm sure DK would agree. Oh well.   It's raining bananas, hallelujah, it's raining bananas, woah!  Oh, and we should mention the latest addition to the line-up of tragically bad characters (Funky Kong I'm looking in your direction) that typically grace DK games - Xananab, a real live anthropomorphic banana (BananaX backwards, geddit?) who says awesome cool stuff like ~Good gravy gravy bo bavy!~ Personally I think he should have been rastafied another 10% or so, but whatever. Lame.   So it won't be the story driving you to finish this game, but the actual gameplay itself is solid, and the further in you get, the more challenging - and sometimes frustrating - it becomes. There are also six mini-games to play in this version, including a thrilling game of jump log, and a game where you have to catch bananas. The best part? It's actually called BANANA GRAB! Sadly, Mr BananaGrabber does not make an appearance. Speed Climb is back from the GBA game too, which is quite fun, especially since you can race against your best Ghost time.   In other areas, Jungle Climber fails to excel. The visuals are less cartoony than the GBA game, with DKC-style character models and objects, but they're far from exciting or stylish. Honestly, this world is getting stale. Worse yet, there's no gap between the top screen and bottom (aside from in some of the mini-games), which feels somewhat illogical when you jump from the bottom screen and instantly appear on the top. The soundtrack is definitely the worst aspect of the presentation, consisting of generic platforming tunes that you won't remember five minutes after turning the game off.  This is a pretty decent game, so if a parent gives it to you as a gift, or a copy falls from the sky or something, you could do a lot worse. Still, its hard to recommend. Sure, the mechanics are good, some of the levels are fun and challenging, and its no bad thing to have two screens to give the game worlds a better sense of space, but at the end of the day this concept hasnt changed much from its GBA outing. What was once interesting and different is now a rehash. Solid, but uninspiring.", "date": "Oct 30, 2007"}