{"name": "Buzz! The Mega Quiz", "name_review": "Buzz! The Mega Quiz Review", "ref": "https://www.ign.com/articles/2007/10/30/buzz-the-mega-quiz-review", "text": "How many times have you been watching some idiot on Who Wants to Be a Millionaire or Jeopardy and declared that you could play the game better than the contestants on TV only to have your significant other roll her eyes and tell you to put up or shut up? Then, you tell her, ~Katie, I'm busy. I can't go around entering my name for game shows.~ And then she says, ~Well, poop or get off the pot.~ And than you say, ~I graduated with honors, woman! Don't question me -- plus, I have a job that requires my utmost attention!~ And she says, ~Oh yeah, real tough -- play videogames all day long! Be a real man!~ Then you get up, slam the front door and go drink in the GameScoop recording room until dawn and try to convince the office you haven't been crying all night.   Thankfully, Buzz! The Mega Quiz has arrived to make those oh-so-common arguments a thing of the past. Packed with eight multiplayer rounds, five gameplay modes, 14 avatars and a bunch of buzzer sounds, Buzz is making its U.S. debut this week after taking the U.K. by storm with a handful of sequels and spin-offs.      If this is your first introduction to the world of British accents and spiky blonde hair, let's get you up to speed. Buzz! The Mega Quiz thrusts you and up-to-seven friends into a winner-take-all game show hosted by an Aussie/flapping-head Muppet named Buzz and his lovely assistant Rose. Each round Rose explains how you'll play, Buzz asks you some questions, and the losers squirm while the winner celebrates.   As if the fact an assistant has to tell you how to play every game didn't tip you off, Buzz doesn't use a traditional control scheme. Packed with the game are four controllers/buzzers -- more can be purchased if you're planning on having an eight-player free-for-all -- that are tethered together and get plugged into a single PS2 USB slot. The simple design is reminiscent of an oversized remote control -- there's a large red button followed by blue, orange, green and yellow buttons -- and it serves as your gateway to getting granny, your 5-year-old niece and your best buddy to play the same game.    Buzz asks a question and -- depending on the round -- you slam down on the red buzzer and choose the correct color-coded answer.   Where in the world is Car ... er ... Buzz? I tend to think I'm pretty darn decent when it comes to general knowledge -- I used to own fools at Buffalo Wild Wings NTN trivia in college -- and the wealth of questions Buzz whips out is one of the true strengths of this game. More than 6,000 questions make up the gameplay experience and cover topics such as film, sports, history and music. One minute you're being asked which musician was claiming ~it wasn't me~ in 2001 and the next you're staring at a painting of Napoleon and being asked who this guy went up against at Waterloo.   Questions about Shaggy and the Duke of Wellington? Sign me up!    This mix of straight-up word questions and photos is interwoven through most of the questions. You'll need to look at two photos of athletes and decide who was the youngest in his or her debut, identify tunes as they play on your TV and answer word problems.   Even when you get a written question, it's rare to see the game just toss up questions without some sort of gimmick. In fact, eight separate rounds keep things interesting by changing the rules and objectives. Point Picker has contestants picking the next category of questions off a large wheel, Pie Fight! lets the person with the correct answer hurl a pie in an attempt to knock his or her opponent out of the round, and a person who answers a question correct in Globetrotter gets to pick the next country questions will originate from. Don't like one of the mini-quizzes? You can choose to start a custom game and eliminate the bothersome round from the start.   There's even an instrumental cover of Europe's classic ~Final Countdown~ when Buzz introduces the Final Countdown round.      And that's just scratching the surface of what's on this disc. Beyond the multiplayer game show -- and the various difficulties -- you and some friends can go at it in Team Play (a mode that has you passing the buzzers amongst teammates), Quickfire Quiz (choose the number of questions you want from a list of 10 to 100 and see who has the fastest fingers) and Quizmaster (one person vocally asks their own questions, the players buzz in, and the Quizmaster uses a PS2 controller to tell people if they're right or wrong). Got no friends? The single-player mode tracks your high scores so that you can monitor your progress while weeping in your friend-less depression.   Yay! Buzz is fun, entertaining and challenging at points -- but I bet you want to know where the wheels fall off, right? In reality, they don't. Buzz is a solid title and is only held back by the aging PS2.    Buzz is going for a simple, colorful style, and that comes across well, but even that is a bit taxing on the hardware. Things that are supposed to look stylized instead look bland -- such as when the players standing at their buzzers -- and lots of jaggies crop up.   Go, grandma! Next up is the lack of any online support. With Buzz!: Quiz TV getting ready to release on the PS3 across the pond, the idea of facing off in an online quiz show showdown and downloading questions isn't so far fetched for the States. No matter how much you dig Buzz! The Mega Quiz, eventually you're going to start running into the same questions, have your friends move on to another title or get sick of the single-player option.    The load times between rounds aren't severe but noticeable, the animations for players right and wrong answers get tired quickly, and the controllers will become a crazed Medusa-like pain in the ass after you store them for the first time and they get tangled up.  All that said, I wholeheartedly recommend Buzz! The Mega Quiz. It's easy to get into, there are enough topics so that everyone can have a chance, you can customize what rounds come up, and you get your own buzzer. That's awesome, and the whole package is just $40. If you have a bunch of trivia junkies in your crew, this one's a winner.", "date": "Oct 30, 2007"}