{"name": "Viking Child", "name_review": "Viking Child", "ref": "https://www.ign.com/articles/1999/07/07/viking-child", "text": "Can't a guy fulfill his destiny in peace? Brian the Viking child was just sitting at home when the Norse god Loki appeared (between stints in Ghouls and Ghosts, natch). Worried about the prophesy that Brian will grow up into a mighty Viking leader, Loki has kidnapped Brian's family, spirited them across the land, and dared the young boy to rescue them. If Brian can survive the rescue of his family, he may get to fulfill this destiny someday.  This is the premise of Viking Child, an action-adventure game for the Atari Lynx, adapted from the European computer title. You play the part of Brian, who must explore many stages of the side-view scrolling landscape in search of your family. Your family members have been hidden throughout the land, guarded by both Loki's forces and a bit of deception. Only by agility and intelligence can you complete this quest.  When you boil the game down, Viking Child is essentially a run-and-jump quest game with a few adventure-gaming touches. Brian loses health over time and in fights with monsters, while each victory earns money and points. Though the trip is very linear, there is a lot of terrain to explore, and houses, castles, and caves contain shops selling weapons and magic. Finally, you can't exit a level without first uncovering and defeating the level's chieftain monster, who is hidden from immediate view.  In the end, the combination of action and adventure is only partially successful, which hampers the appeal. As an action game, Viking Child is a bit slow; Brian walks and jumps at a modest rate, while monsters run and jump all over the place. There are numerous fights, but they consist mainly of poking creatures with a dagger or throwing weapons against them. And while there is much to see, this game offers none of the sophistication of real role-playing games. In its favor, Viking Child is a tough game, with time limits and Loki's forces combining to whittle down your health.  The graphics on Viking Child are done fairly well. The adventure itself makes good use of earth-tone colors and detail. Brian and the creatures are drawn small enough to give a good view of the surrounding area, without losing much detail. There are also some elegant static screens and lots of cute touches throughout. Sounds, in contrast, are an absolute minimum. There are some nice scores, but the few primary game sounds are simply basic. While Viking Child is a pleasant diversion, it is missing the refinements needed for greatness. The biggest appeal is in exploring the land and just trying to survive, but it should not be mistaken for an adventure game. Still, if you're looking for something that's a little more than the typical run-and-jump title, Viking Child is worth a try.", "date": "Jul 7, 1999"}