{"name": "FIFA 08", "name_review": "FIFA 08 Review", "ref": "https://www.ign.com/articles/2007/10/31/fifa-08-review-2", "text": "It's always interesting watching a game make the transition from a home console to a portable system. Typically we see features stripped, visual special effects removed, and overall playability stricken from the release. Luckily FIFA 08 on PSP actually includes many of the same features and game modes that we saw in the exceptional PS2 release, only with slightly simplified gameplay to accommodate for the fewer buttons that reside on the Playstation Portable.   Once you take to the pitch on the PSP you'll immediately notice that the animations look quite sharp. Everything from slide tackles to fancy dribbling animations come through quite nicely on Sony's portable system. You'll be able to pull off the same quick first touch moves as well as utilize the freestyle trick system that made its way into this year's game. The only real difference is that the PSP obviously has no right analog stick so you toggle your tricks by using the left trigger. Hold it down, wiggle the analog stick and your player will start dazzling the crowd, and hopefully defenders, with a solid variety of different moves.   Bloody good tackle!  The players also feel a bit more under your control than they do on the next-gen versions of FIFA 08. Passes can be cut off, headers can be jostled for, you just have that extra bit of interactivity that made its way onto the PS2 but was absent from the Xbox 360 and PS3 versions. There are still some instances when oddities occur, like your players not realizing that they're next to the out-of-bounds line and letting an incoming pass roll into enemy hands, but for the most part the game will stay under your control.   The game modes will definitely remind most gamers of the PS2 release as the PSP features manager mode, challenges for specific teams, interactive online leagues, as well as the ability to create your own tournament. The only truly new game modes are Soccer IQ and the dribbling mini-game.   Much like the dribbling mini-game in NBA Live on PSP, FIFA 08 allows gamers to turn their handheld vertically and play in a DDR-style game. Basically the on-screen player kicks the ball in the air and you have to hit certain directions at a specific time to both attain valuable points and keep the ball in the air. It's a fun distracter from the core gameplay, and will definitely pass the time on a long trip, but we've seen it before.   The Soccer IQ mode is a neat little invention designed to test the knowledge of soccer diehards. Basically three-quarters of the screen is taken up by the question and your four answer options, with the last fourth being taken up by a diagram of a soccer field and a ball. For every question you get right you advance the ball closer to the opposing goal, for every question you get wrong the opposition gets closer to yours. Eventually you'll need to shoot the ball (score by answering the subsequent question correctly) or save a shot as the goalie. You can always pass the ball (not answer the question) and go to the next, and the game does a good job of mixing up the difficulty of the questions. Much like the dribbling mini-game, Soccer IQ is a solid addition to the FIFA mix.   The final newcomer to FIFA 08, and this is across all systems not just PSP, is interactive leagues. Essentially these leagues allow you to choose your favorite true-to-life squad and take them online to compete in their actual schedule against other blokes. It's a neat idea and it performs rather well, if only the action on the pitch were as lag-free as it should be. There's a very obvious delay between pressing the button and the corresponding action happening on the screen, something that hurts the gameplay experience when you're trying to rattle off a series of quick passes or that all-important shot.   Graphically FIFA 08 on PSP bears a strong resemblance to its PS2 counterpart only with a few rougher edges on the player models, both in regular gameplay and during close ups. The game still moves just fine though, and that's all that truly matters in a soccer game.   Aurally this year's effort is more of a mixed bag with crowd noise that reacts very realistically to the action on the field, now if only the duo in the booth could do the same. Its main failing is the fact that the commentary is loaded directly off of the UMD so you'll have to wait a split second for most of the duo's quips. Not only that, but because the laser needs to move to different parts of the disc to load the speech it becomes a bit of a battery drainer.FIFA 08 on PSP is a solid soccer outing, theres no doubt about it. It will keep players entertained for a lengthy plane ride or a boring college lecture, even if it does borrow many of its modes from the PS2 version. Soccer IQ and the dribbling mini-game are nice diversions, but they wont keep you occupied for all that long. If youre going to play the game mainly at home, pick up the PS2 version, but if youre going for a road trip to a far away football match (soccer game) you cant do much better than FIFA 08 on PSP.", "date": "Oct 31, 2007"}