{"name": "Checkered Flag", "name_review": "Checkered Flag Review", "ref": "https://www.ign.com/articles/1999/07/07/checkered-flag", "text": "It's time to strap on the helmets and head for the tracks; as the name implies, Checkered Flag presents auto racing on the Atari Lynx. The class is Indy racing, with the ground-hugging racers that symbolize breakneck speed. The usual elements are all here: cars to pass, curves to negotiate, and roadside obstacles to avoid, all while trying to be the first across the finish line. Option settings allow you to configure the game as desired, and up to six Lynxes can be connected for a real challenge.Checkered Flag is an absolute joy to play! While the game offers nothing that hasn't been done before, it implements and integrates all of its elements effectively. There are no bonus items, pit stops, weapons, or auto design to complicate matters; rather, the emphasis is on pure driving skills at high speeds. Even though the promised track editor has been left out, the end result is an extremely fun card that captures the thrills of the sport.The action is viewed from directly behind your car. A course map, race information, speedometer, tachometer, and rear-view mirrors are always visible. Controls include acceleration, brakes, gearshift, and steering, all of which feel properly responsive. The computer opponents are fairly straightforward, though they manage to stay on the road better, and will try to pass you whenever possible. Hitting another car or an obstacle may result in a crash or a spinout, which costs speed and time. Take too many hits and you might even lose your mirrors.To make things even more interesting, the game offers numerous options. There are 18 tracks to race on, from the slightly curvy to the very difficult. You can drive for practice, run a single race, or go for an eight-race tournament, and your car can be equipped with one of three different transmissions. Up to ten human and computer racers can compete, and starting positions can be set randomly or by a qualifying lap. For an extra touch, you can also choose the color of your car and the gender of your driver.Checkered Flag's images are among the best on the Lynx. From cars to obstacles, all of the graphics are elegant and highly detailed. The sense of speed is very convincing, with the Lynx's hardware scaling used to make everything fly by smoothly. Race information is clearly visible without being obstructive, and other game screens are equally attractive.There are not a lot of different sounds in the game, but they are used well. Engine whines alert you to change gears, tires squeal on tight turns, and the stereo roar of other cars remind you of pass attempts. Then there are the little extras, like the flagman's digitized voice announcing the start of the race and the musical scores between races.10/10This is a high-performance title that does nothing but pure video racing, and does it extremely well. Crammed with exciting gameplay, fast action, options galore, hot sound and graphics, and true multiplayer challenge, Checkered Flag is absolutely terrific!", "date": "Jul 7, 1999"}