{"name": "Metal Marines", "name_review": "Metal Marines Review", "ref": "https://www.ign.com/articles/2007/11/01/metal-marines-review-2", "text": "Strategy gaming is seeing a surge on consoles right now, and it's one that's offering fans of the genre a variety of options in setting, style and theme. Nintendo's newly-released Battalion Wars 2 gives gamers the task of commanding modern day military forces like tanks, helicopters and battleships, while next week's Fire Emblem: Radiant Dawn will present the past -- with sword-wielding warriors, archers, and jousting knights on horseback. But if you'd prefer your tactical expertise to be tested in a more futuristic scenario, it might be worth your while to consider this classic, Metal Marines.   This 16-bit real-time strategy title provides a welcome counterbalance to those newer arrivals in the genre, in both presentation and pacing. For the former, it's all about the look and story -- Metal Marines takes place in a far-flung future, and puts you into the role of a military commander trying to pick up the pieces in the aftermath of a cataclysmic war. A power-hungry dictator has seized control of the Earth after most of its land masses where destroyed by anti-matter bombs, and it's up to you, as a representative of Earth's colonies out in space, to reclaim what's left of the home planet from his iron-fisted grip.   Dispatch your Metal Marines to take out the enemy's base. You do that by launching a campaign against his subordinate generals, seeking to claim control of one island of land at a time. Metal Marines is separated into stages, and each one gives both you and your computer-controlled opponent one island to start with. The chunks of earth are sometimes small, sometimes large, but always outfitted with some array of equipment to get you started-- missile launchers, power plants, radar stations and more.     Your first job is to choose the location of your bases: the critical squares that you'll have to defend from the enemy's advances. After that, it's on you to choose how you'll play for victory. You need to destroy the enemy's bases on the enemy's island to win the round, and can opt to launch a full-scale assault against them right away, or you can shore up your own defenses to protect against their inevitable attack. But whether it's you or your opponent who strikes first, battles always play out in two phases.   The first is a salvo of missiles. The rocket-powered explosives fly across the expanse of water separating the warring islands and impact on the ground on the other side, doing damage to a one-square-radius area on the grid where they land. Missiles can be shot down in mid-flight by anti-air turrets, so it might be worth your while to invest in those.   The second phase is where the titular Metal Marines come in -- they're giant, humanoid robot suits in the style of Gundam or MechWarrior, and they arrive to attack the enemy in a landing ship that's much harder for anti-air guns to bring down than individual missiles are. Once the Marines have deployed behind enemy lines, they'll set about wreaking havoc on any installations that are nearby. You can choose to take direct control over your Marines if you want, but only their movement will be yours to command -- the rate at which they fire their weapons will still be determined automatically.   The way to defend against Metal Marines is with other Metal Marines, which will lead to the game's mech-on-mech battling sequences. They're a lot more low-key than they sound, though, and the confrontations usually end after only a few seconds; there's a rock-paper-scissors aspect to what armaments you choose to equip your Marines with that will affect the outcome of those skirmishes, but you'll rarely see a mech fight that's overwhelmingly balanced in one side's favor over the other.   The pacing in Metal Marines is in real-time, but how quickly the action plays out lies somewhere in-between the other recent strategy releases on the Wii. Battalion Wars offers active, direct control of units and fast-paced fighting, so much so that it's probably more of an action game than a strategy one -- that's one extreme. Fire Emblem is turn-based, so you can take as much time as you want in making up your mind about your next move -- that's the other extreme. Metal Marines lies in the middle, because while you do get some time to breathe between attacks from the enemy, you can't just wait around forever. The only time the action will pause completely to allow you to make slow decisions is when you're choosing where your offensive strikes will be targeted, while planning one of your own attacks.So Metal Marines offers a good balance for fans of the strategy genre, and is complimentary to the other two titles that should be drawing those gamers' focus this Fall. Its real-time, missile-launching, mech-commanding gameplay is still fun, even though the past decade has evolved the genre quite a bit since its initial release. And its theme and futuristic setting, while similar to several other ~giant robot~ games, it's somewhat unique. All told, it's a solid option that would sit well between rounds of Battalion Wars and Fire Emblem.", "date": "Nov 1, 2007"}