{"name": "Championship Manager 2008", "name_review": "Championship Manager 2008 UK Review", "ref": "https://www.ign.com/articles/2007/11/01/championship-manager-2008-uk-review", "text": "Often, the rise and fall of game franchises can be equated with the fluctuating fortunes of footballing empires. Just like Liverpool were once kings of English football, there was a time when Championship Manager was the dominant force of strategic sports games. Things have changed for both in recent years, the pendulum swinging in the direction of their better equipped rivals, leaving these former leviathans scrabbling for the minor places.   Customise the highlights to view as much or as little of the match as you wish.  Since Sports Interactive took all but Championship Manager's name when it defected from Eidos to Sega, creating the now utterly dominant Football Manager series in the process, the CM games have been attempting the impossible - to catch up on over a decade's worth of development time. Beautiful Game Studios has certainly had its work cut out yet, after a shaky start, the series has been making steady year-on-year progress, with Championship Manager 2008 proving to be no exception.   Instantly evident is how much effort has been put into improving the match day experience, with a collection of helpful features making the game more accessible. A quality overlay displays the fitness and confidence levels of your players during matches, providing a visual prompt when individuals begin to flag or drop their heads. This overlay also provides constant updates as to how your opponent is tweaking their formation and tactics, which is particularly helpful when watching a match in highlights mode rather than in real-time.   Once you stumble on a winning tactic, you can generally stick with it.  It's simple yet helpful additions such as this that are indicative of the game, with levels of player feedback and information more readily available throughout, including a collection of excellent pop-up pointers that provide a wealth of at-your-fingertips information. CM2008 is also effortlessly navigable, with essential shortcuts ensuring that you can spend minimal time searching for the correct screen and maximum time chasing new recruits and honing the skills of your squad.   While training is perhaps a touch simplistic, transfer negotiations have been bolstered, displaying greater flexibility and improved negotiation features that see you haggling over the finer points of payments and contracts. If you opt to use the Club Benefactor feature, you'll have oodles of money to spend in the transfer market which, despite its increased depth, still allows for some unrealistic yet satisfying player purchases.     Ultimately, leniency such as this is what most sets Championship Manager 2008 apart from Football Manager 2008. While Sports Interactive's football sim adheres stringently to reality, Beautiful Game Studios' effort takes a noticeable detour from the realms of utter authenticity. And while it never deviates too blatantly into the fictional or farcical, it does possess a clear bias towards accessibility and a more forgiving nature than its illustrious counterpart.   Highlights are fun to watch, but full matches still fail to convince.  Matches are a prime example. For starters, the real-time match engine still fails to generate overly convincing passages of play, though there's certainly been an improvement over last year's somewhat Sunday League-game vibe. As a highlights simulator, there's little to criticise, with match excerpts providing plenty edge-of-your-seat moments. Player movement has also been overhauled, with player icons now displaying far more character, leaning forward when sprinting, sliding into tackles and leaping to connect forehead with ball.   Another major difference between CM and FM is the level of tactical depth. While merely setting a formation and choosing a starting line-up would have your team struggling in Football Manager, it's more than possible to churn through an entire, virtually unbeaten CM season with the likes of Manchester United, Arsenal, Barcelona or Real Madrid (you can also simultaneously manage a national side if you so wish), especially if you're using the Club Benefactor feature to bolster your squad with even more superstars. However, lowlier teams do require a little more attention, with your tactical changes making a visible though rarely monumental difference to your team's playing style.   A strategic overlay keeps you informed about your players and the opposition.  This virtual invincibility factor is certainly fun for a while, but you'll probably find yourself hankering for a greater challenge after a season or two of utter dominance. It's a pity that matches aren't more strategically involving, as CM2008's incredibly detailed and intelligently refined ProZone match analysis tool is left virtually redundant. ProZone offers you a breakdown of every significant move and action point from a match, allowing you to study how each player is performing in minute detail. Yet when your team is ploughing through opponents like a pickaxe through margarine, you soon realise that you have little use for such a hardcore aide.   Thankfully, many of the bugs that blighted the last few CM games have been eradicated, though some irksome oversights and weaknesses still linger. Problems of particular note include unexplained player fatigue and some highly lacklustre team talks that soon become a chore. Media interaction also lacks a certain sense of weight and could have done with fleshing out.Despite attempts to appeal to a broad audience, it's hard to ignore CM2008's mainstream approach to football management, where tactics and strategy are very much secondary to accessibility and pick-up-and-play entertainment. If Football Manager's intensity scares you and you're looking for a chance to guide your team to glory with the minimum of team management minutiae, then Championship Manager 2008 is certainly worthy of your attention. It may not be Championship winning material, but it's certainly good enough for you to enjoy an entertaining couple of seasons.", "date": "Nov 1, 2007"}