{"name": "WWE SmackDown 2008", "name_review": "WWE SmackDown! vs. Raw 2008 Review", "ref": "https://www.ign.com/articles/2007/11/02/wwe-smackdown-vs-raw-2008-review-2", "text": "As a game reviewer, sometimes you get assigned titles you don't know much about. Maybe it's a horse racing game, something about living on Mars or so on, but when it happens, you give it the old college try and hope you connect on some level with the hardest of hardcore fans.   That isn't the case here.   I know wrestling games, and if you're reading this review, chances are you do, too. There's something about our brethren of junkies that leads us to obsess over every aspect of the upcoming brawler, analyze screenshot after screenshot and generally go off the deep end about these games.    Basically, we nitpick everything to death because we love it so much. Expect that here.   WWE SmackDown! vs. Raw 2008 is a stripped down version of its current generation brother with a frustrating control scheme. It's not all bad, but it is disappointing to see what could've been a must own portable title flounder.   This outing arrives with 55 superstars from Raw, SmackDown, ECW and the WWE's past; the new ECW Extreme Rules Match; a new tournament mode; and an updated -- albeit flawed -- control scheme.     Oh, and you can light barbed wire 2X4s and tables on fire. Sweet.   ECW was the promotion I called home in the late '90s, and that's probably why I'm drawn to the ECW Extreme Rules Match. Following the tried-and-true Philly formula, you get to drag your opponent all around the ring, floor and crowd in a no-count out, no-DQ match where the pinfall or submission must happen in the ring.   It sounds cooler than it is on the PSP. In the console versions, the crowd holds out weapons such as guitars and crutches for you to whip your opponent into or slam over their backs. On the PSP, the crowd is just a sparse group or 2D blobs that flail their arms. However, the PSP does keep one of the more unique match features -- namely, the weapon wheel.   In years past, we'd blindly reach under the ring for whatever foreign object we could get. Now, when you reach under the ECW ring -- this match type can only be played in the ECW arena -- you can use your analog nub to select from a set of eight weapons such as chairs, mops, sledgehammers and more. You can even pick four weapons before the match that you want to see represented on the wheel more than once and don't have to worry about being attacked while picking your item -- the game focuses on you and your opponent is left in off-screen limbo.   With God as my witness ... However, the weapon wheel isn't entirely good news -- it's a blatant example of the PSP's mixed-up control scheme. Remember last year when you'd move with the d-pad and taunt with the analog nub? Well, THQ kept that this year while adding a bastardized version of the Ultimate Control Moves people are getting on the PS2/PS3/360.   See, on the home consoles, the right stick is pretty much used for everything. You grapple with it, enter Ultimate Control grapples with it, swing weapons in certain situations and enact the new Struggle Submission System -- this is where you swivel the stick to dictate how much pressure you're applying with a given move as well as try to escape a move.    Here, Yuke's and THQ toss all that in without switching movement to the nub.    I'll set the stage. I'm Tommy Dreamer in an ECW Extreme Rules Match against Mark Henry. The big guy's giving it to me, so I move out of the ring via the d-pad, hit X to get under the ring, remove my thumb from the d-pad and select a weapon with the nub, then move my thumb back to the d-pad.    Why couldn't all of that been done with the nub? More than once, I'd leave ringside without a weapon or taunt into an attack after flubbing the flop. On top of that, the d-pad is just clumsy for regular old movement. Running to the corner and navigating the ring are just a chore with this system.   Putting aside the fact that once I get a guy on the ground I have to move to him with the d-pad, tap circle, use the nub to apply pressure and then switch back to the nub to move -- whew -- the Struggle Submission System is pretty cool. You're probably asking why you wouldn't apply as much pressure as possible each time, and the answer is that it's a risk-reward situation. See, if you're not applying pressure, the opponent can move his or her stick to try and escape the hold. If you apply pressure for too long, the two hands symbolizing your grip will begin to twitch and if they separate, your opponent will get up before you and have the advantage. Take the time to play a few matches as CM Punk, work the body and watch the red seep in from the corners of your TV. The satisfaction in overwhelming.    Another new idea that soars in SVR '08 is fighting styles. Each Superstar has two fighting styles that provide him or her with unique primary and secondary abilities they can use with a stored finisher. A Powerhouse such as Bobby Lashley can enact a ~Rampage~ that makes him impervious to strike attacks and makes his grapples inescapable, a High-Flyer like Rey Mysterio can feign an injury and then scoop his opponent up in a ~Possum Pin,~ and a Showman like Shawn Michaels can steal an opponent's finisher.   Whoa. I know. We've been able to steal finishers for years. However, these fighting styles are taking the things we all know and love -- performing an opponent's taunt, removing a turnbuckle cover and diving over the top rope -- and assigning them to certain Superstars.   That's a good thing.   Think about it. How many times have you been playing and seen someone do something completely out of character? Jeff Hardy performing the last ride? Cena pulling off the turnbuckle cover? Now that these moves are locked into fighting styles, people act in-character and get boosts for doing what they should.      Look at Randy Orton, the personification of the dirty fighting style. When Orton gets a two count and argues with the ref, he gets a momentum boost. When Orton shoves the ref into his opponent -- which knocks the ref out and the opponent down -- he gets a momentum boost. Never mind the fact that the momentum meters look way better than last year's two-sided pile of ugly and the characters have more realistic and varied stamina, which is now recovered by holding down Select.   New this year is the Hall of Fame, a selection of 12 classic WWE moments you have to relive -- like beating Bret Hart as Shawn Michaels in an iron man match or winning a King of the Ring in Tournament Mode, which is basically all that mode is. These achievements unlock new superstars for purchase in the WWE Shop, which also includes moves, belts and ring attire.   Longtime fans will notice iron man matches have been overhauled this year as well. Now, you can only choose between 10-, 15- and 20-minute matches, and after each pinfall, the loser's limb damage resets while the winner's remains the same. Although I'll miss brawling for an hour, the reset is a great idea. Once you hit a finisher in previous versions of the match, your opponent was screwed. Now, there's a challenge to the mode.   And -- most notably -- the load times have been dialed down a great deal to match the not-so-unbearable 25 to 30 seconds it takes the consoles to get from the last entrance to a match.   So, SVR '08 has all of the standard matches you'd expect -- Hell in a Cell, TLC, first blood, etc. -- but that doesn't make up for the controls and 24/7 Mode. If you just woke up from the coma so many of us fell into after Mae Young gave birth to a hand, the GM Mode and Season Mode from last year have been brought together and tossed into 24/7.   Don't get me wrong, that's fine idea, but it's the implementation that gets me. Disappointingly, GM is almost the exact same thing from last year. You'll choose and brand -- yes, ECW is available -- draft your roster, hire storyline writers, manage your feuds and deal with injuries and salaries. It's all the stuff people dug from last year's mode and the addition of the GM of the Year Award, a list of goals -- have the number one Superstar, defeat a champion from one of the other brands, etc. -- that get you closer to being Vince's golden boy.   Hold me closer, Legend Killer. It's when these GM aspects move into the single-player career mode that my opinion goes really south. When you choose to start 24/7, you need to pick if you're playing as a GM or a character. Choose character, and you'll pick whether you're a created character or one of 19 Superstars -- no ECW, divas and no Legends -- and then decide if you want to go with that guy's in-game overall rating or a drastically lower 24/7 overall.   See, the goal in 24/7 is to become a Legend by accomplishing goals similar to the ones on the GM side -- be the most popular Superstar, defeat the number one Superstar, etc. -- and participating in RPG-like events on your non-wrestling days that hone your skills on the mic, with fans and more. The events help you earn more money for WWE Shop, stay healthy and become more popular, but the training costs money and wears you out.    And here's where things get sticky. You remember how you had to rest your guys in GM Mode so that they wouldn't get injured and end up riding the bench? That's in the career part of 24/7 mode, too.    So, I'm taking Matt Hardy up the ladder of the WWE, and I don't rest him enough. Instead of giving him training and massages, I'm sending him out on trophy dates and movie shoots on the days he isn't wrestling to earn me more cash to spend in the WWE Shop on movesets for my created character. He gets tired, and after a particularly trying match with Rey Mysterio, I get an e-mail letting me know he's herniated a disc in his back. In the same e-mail, the medical staff tells me I have to take seven weeks off or the injury's just going to get worse.   I go to the calendar, and there's no option to rest Matt. In fact, it turns out there's no option in the game. If you get hurt, you have to wrestle with the injury. This meant I had to keep sending Matt into match after match, and his hurtin' back meant that as soon as the bell rang, his torso was already damaged. The opponent would get a couple moves in, and Matt would be dead weight.    This is a rather large problem. It's as if 24/7 Mode can't decide if it's an angle or a shoot. On the one hand, you have GM Mode where you're hiring people to write storylines and thus admitting wrestling's staged. Then, there's the career portion of 24/7 where you're forced to fight with injuries that would have the real Superstars laid up for months. You can make the argument that not performing in your season isn't fun, but I can assure you getting your ass handed to you match after match because all it takes is a hip toss to cripple you isn't a good time either.     Sadly, this isn't the only hang-up of 24/7. Knocking off the list of Legend-making tasks will take you a few years, but you won't even get halfway through your rookie year before you start seeing the same cutscenes -- your guy lifting weights, walking in on the divas, etc. -- over and over again. Worse is the fact the scenes don't make any sense in terms of your storyline. One minute I'm getting hate mail from Rey and the next we're shaking hands in the hallway.    If I can dust off a Stone Cold gem -- what?   Doubling back, I asked THQ why not every Superstar was playable in 24/7 Mode and was told it came down to the quality of their voiceovers. This is unacceptable. The cutscenes and mode these voices are being used in do not work. I seem to remember a kick ass season mode in WWF No Mercy -- a storyline tree branched out and changed depending on me winning or losing -- and no voices were used. I want a compelling story, not generic cutscenes and half-assed dialogue.   The repetition in SVR '08 doesn't stop with cinemas either. No matter how many years you play -- you can keep performing even after you reach legendary status -- the schedule will constantly be the same. WrestleMania's in Detroit, Vengeance is in Charlotte and so on. Plus, the calendar in your locker room will always read ~2008.~   The repetition report still isn't over. Create-A-Superstar is back in this installment, but it's basically the exact same thing as it was in 2007 with a few drawbacks and plusses to go along with it. Sure, the number of hair styles has jumped from 50 to 73, but the number of face paints has gone from 154 to 118 and most of those are recycled from '07. Weak.   Cena can't see ya. Also weak is this year's roster. While not being up-to-date on the roster is forgivable due to the WWE's constantly changing climate, the sheer number is a bit disappointing. Last year's title had around 70, but 2008 clocks in with 55 or so that includes starved cruiserweight and tag team divisions. However, PSP owners do get three exclusive Legends -- Jim Neidhart, Eddie Guerrero and Sgt. Slaughter.   Worse than the roster is the fact that PSP graphics seem all but abandoned. The game's jaggy, muddled and lacks the trademark detail we've come to expect from the franchise -- Sabu isn't taped up, the ring aprons looks faded and he match stuff just seems sloppy.   All the other traditional SmackDown series glitches you'd expect are here as well. The A.I. is dumb even on Legend (they don't know when to use their finisher), the collision detection is spotty (Will long hair ever stay out of people's backs?!), and there's no commentary -- which might not be such a bad thing if it wasn't replaced with a repetitive soundtrack.  If you really dug WWE SmackDown! vs. Raw 2007 on the PSP, you might consider buying this year's version. I found the controls off-putting and the lack of detail sad, but the big name modes -- Tournament, Money in the Bank, TLC, GM, etc. -- that make up the console versions are packed in here for you to digest on the go. Still, the poor graphics, d-pad/nub switching and flawed 24/7 Mode mean that I can't recommend you take a chair to the head to get this title.", "date": "Nov 2, 2007"}