{"name": "Need for Speed Pro Street", "name_review": "Need for Speed ProStreet Review", "ref": "https://www.ign.com/articles/2007/11/02/need-for-speed-prostreet-review-8", "text": "As in previous years, EA Mobile roars up to the starting alongside the yearly console-specific Need for Speed with a mobile edition. This fall's ProStreet veers away from the street vibe of past editions, such as Underground and Most Wanted. The ProStreet hook is that you compete in sanctioned street races instead of back alley drags, entertaining thousands with slick rifts and a flashy ride.   The mobile ProStreet doesn't go as deep as the console game, which is a good sign for more casual players. You have sixteen real world licensed cars, but instead of the hundreds of vehicle parts and gee-gaws found in the console game, you have more basic upgrades that affect general categories, like speed and handling. This keeps you in the garage for shorter stretches, turning the game's focus squarely on the track.   In ProStreet's career mode, you must engage opponents in a series of heats for cash purses. The goal is always to come in first, but you can bank extra money along the way by pulling off drift maneuvers during each race. When coming up to a corner, you press OK (or 5) to start a drift. The car starts sliding and a drift meter appears on-screen. You must tap left and right to keep a hatch-mark as close to the center of the meter as possible. If the mark slips to either extreme, you roll the car and fall back in the pack. Depending on how many corners are in succession, you can find yourself drifting quite often during a single race.   Here's why this is a good thing: The regular driving isn't exactly pulse-pounding. ProStreet follows the basic conventions of auto-acceleration. You can tap 2 to hit a nitro boost, which fills back up whenever you successfully drift. The other cars are only mildly aggressive and the tracks are all wide enough that you rarely must contend with needle-threading. You can also slipstream behind other cars, but I made it a point to avoid slipstreaming on one race to see just how much of a difference it would make. Not much, I still finished first without too much trouble from the pack.   In fact, once you really figure out the drift mechanic, ProStreet is too easy. You can constantly balance drifts and nitro boosts, leaving the rest of the cars far behind. Everybody likes to win, but most players at least want something of a challenge on the way to the victory lap.   EA Mobile typically excels at production values, and ProStreet does not break any patterns. The game is largely eye-catching, thanks to well-done car models and solidly detailed tracks. The 3D is very smooth with no noticeable hiccups on the LG VX8100 I used for testing. The only 3D racer that looks better and runs faster than ProStreet right now is I-play's Fast and the Furious: Fugitive, but both are different enough game that a racing fan would be fine having both on their handset.   My only complaint regarding ProStreet's production is the audio. The engine sounds are far from convincing. I know better than to expect miracles out of mobile, but the incessantly repeated noise of the engine growling between each gear shift is grating. There is no difference in the sound ever, no matter if you are between first and second of fourth and fifth.Need for Speed ProStreet is a decent racing game. The drifting mechanic is a good addition, even though it makes it too easy to bank enough nitrous to destroy the competition. The game looks good and plays fine, but I'm sure you'll mute the game after the first three races. There are better racers than ProStreet on the decks, but if you're a drift king and like the idea of licensed cars (that actually look like their real-world counterparts), this game could offer an hour or so of amusement.", "date": "Nov 2, 2007"}