{"name": "PES 2008", "name_review": "Pro Evolution Soccer 2008 AU Review", "ref": "https://www.ign.com/articles/2007/11/05/pro-evolution-soccer-2008-au-review", "text": "Let's hope EA Sports enjoyed their little head start with FIFA 08, because Konami's ever-reliable Pro Evolution Soccer 2008 is here to edge the win in injury time. While FIFA certainly looks amazing this year - eerily close to an actual TV broadcast, in fact - it's probably shot itself in the foot by trying to be too much of a simulation. Pro Evo, on the other hand, may lack the incredible presentation, but it delivers the drama, the delight and the devilishly fun gameplay that a football lover craves, match after match after match. It straddles that fine line between sim and arcade action perfectly.   However, it must be said, the warning bells are starting to ring. Pro Evo's victory isn't a 3-0 drubbing but more of a crafty 2-1 win over FIFA this year. It inches in front based on the pure fun factor that the game engine manages to conjure up, but it's clearly losing ground. If Konami aren't careful, this could be the last season that they snatch the title.     Now, let's get down to brass tacks. It is common knowledge that last year's PES6 on Xbox 360 was poor. The engine was sluggish and the edit mode was butchered, amongst other nitpicks. This year, however, Pro Evolution Soccer 2008 is almost identical across all three key platforms (well, except for the slowdown on the PS3). If you're concerned about the Xbox 360 version, you needn't be. It may even turn out to be the pick of the platforms.    For starters, let's talk editing. Konami continue to have problems with retaining club licences, so we've lost Arsenal and Manchester United, only to gain a fully licensed Newcastle and Tottenham Hotspur instead. A few minutes in the edit mode can fix all this up, of course. Just about all the players in the game have their real names, so all you'll really need to do is improve the kits and edit the club name. What's genius is that you can use the Xbox Live Vision camera to take a snapshot of logos and then stick them in the game. You can also take a snap of your own face and map it onto a custom created player. Results can be very effective if you get the lighting right.   Another nice new feature is the Track Record that details all your play stats, such as how long you've spent playing each respective mode, the furthest distance you've scored from, your highest and lowest possession percentages, average goals scored and conceded, and so on. To add to this, there are your achievements - nabbing hat tricks, winning streaks, winning cups and so on.      Master League has had a bit of a tweak, but there's nothing major to knock your socks off. There are now cute snapshots after each game, such as the supporters rejoicing in the street after a win, or one of your players looking pensive in front of the media. It's a shame you can't actually interact with your players in some way, as you could in the weird Pro Evo management game that came out on PS2 a while back. Come on Konami, think a little harder.  Negotiations are made a little less frustrating, due to instantly knowing if a loan or trade offer will be rejected, rather than having to wait a week to find out. Your tactical set-up is also made easier by letting the CPU select a side based on condition or ability, which speeds things up when there's a lot of fatigue in the side and you can't be bothered to manually switch players in and out.   Most importantly, big improvements have been made with the in-game engine over PES6. This year, player movement is fast, responsive and snappy, just as it should be. There's an emphasis on dribbling this year, making it much easier to go on ambitious one-man raids with highly skilled players such as Cristiano Ronaldo, Fabregas or Ronaldinho, without needing to worry about defenders magically getting a boost of pace to steal the ball off you just when you think you're in.     The improved ball physics result in a greater variation in the passing too, with crosses in particular showing a lot more movement of the ball through the air. Long passes sometimes bend and land back in play, just when you think they're going to end up in row Z. Lesser players lack the power to make the ball reach its target, whilst superstars are capable of the most delightful pin-point passes. You'll see the ball drift, hover, skid, float, and be blasted like a rocket in true dynamic PES fashion.   Goalkeepers seem to come running off their line more often, even when you're not pushing down on the Y button. At least they're more likely to tip the ball around the post, instead of fumbling it back into play.      We did even manage to score on one occasion by sprinting a player at the keeper before he could clear a poor back pass, the ball slamming into our player's face and looping back into the goal as the keeper desperately fell over himself to stop it. You see, Pro Evo is always pulling out rare magic moments like these. The engine is so dynamic that the most unpredictable stuff can happen - unlike the way FIFA seems to get stuck in a rut of predictable player behaviour.   As far as this year's visuals go, PES 2008 performs with a flawless frame rate. There's no slowdown in the box, no matter how crowded it gets. But there's a bizarre exception here - replays have an absolutely shocking frame rate! Quick highlights of a recent foul or attempt on goal stutter past your eyes like a flipbook animation, for no discernable reason. Play a replay back manually with the free camera and it's totally smooth - as is the in-game action. It seems frames have purposely been removed from automatic replays for some godforsaken reason.    As far as match commentary goes, well, the commentators are different and have a new script, but it's pretty much just as dull and inaccurate as it's always been. Why Konami can't get this right, we just don't know. It's all still generic babble, without any of the facts or trivia that FIFA manages to conjure up.     Finally, let's address the controversial addition of diving. Holding in the shoulder buttons at just the right moment will make your player tumble to their feet like they've been shot. However, to be fair, it's bloody impossible to pull off without the ref immediately booking you for simulation. In fact, no matter how many times we tried, we never drew the foul. The inclusion of diving won't change the way you play Pro Evo, because winning is still far easier by playing a killer pass and taking your opportunities, not by falling over in the box. Thank goodness for that.   PES 2008 is the game that PES6 should have been - at least on the Xbox 360. Even so, its probably still time for a major overhaul. FIFA is starting to kick goals with its incredible presentation and variety of modes, even if its still not as much fun to play as PES. Meanwhile, PES is getting away with very little innovation year after year - tweaks are made but little progress is seen in key problem areas. The commentary should be ten times better, the animation could be better, the crowd and atmosphere could be better, challenge modes should be enhanced (not axed entirely!)... and the list goes on. Come on Konami, before you totally lose the ball, pull your finger out and make PES the true next-gen football game it should be. Now that the series is starting to feel a little stale, its time to take risks! If PES 2009 is just the same as this years with a bit of a menu redesign, some different music and another few small tweaks to the match engine, we just might finally lose interest. And that would break our collective IGN hearts.", "date": "Nov 5, 2007"}