{"name": "Assassin's Creed", "name_review": "Assassin's Creed Review", "ref": "https://www.ign.com/articles/2007/11/05/assassins-creed-review-2", "text": "After years of playing Gameloft's mobile takes on Splinter Cell and Prince of Persia (as well as many other licensed games that use their engine, such as King Kong and Live Free or Die Hard), I came to Assassin's Creed with little doubt that the mobile maker could turn out an entirely playable action game based set during the Third Crusade. I just wasn't sure if the game would be unique enough to really recommend; Gameloft's side-scrollers may be clever, but they are also getting a little long in the tooth. While my experience with the console game it is based upon may be limited, I can honestly say the mobile Assassin's Creed not only hyped me for its November 13 release, but it was a nice bit of entertainment in its own right.   Altair, the hero of Assassin's Creed, is a master assassin turned loose in the most vibrant medieval cities of the Middle East. At least, that's what he seems like at first blush. Without wanting to ruin any of the game's surprises, collecting power-ups like Memory Blocks and restoring health via a flurry of little blue squares should have most gamers questioning the ~real-ness~ of Altair's mission.   Much has been made of the pakour or free-running elements in the console versions of Assassin's Creed. Since Gameloft's title is a 2-D side-scroller, obviously most exploration has been hacked out of the game. Instead, the game zeroes in on some classic platforming elements and stylish combat. Altair is as acrobatic as he is deadly. He will run up ladders and kick them away from walls to close gaps, shimmy along narrow ledges, swing across ropes, vault over spiky pits, and perform some impressive wall jumps that would certainly get him an audition at Cirque du Soleil.   Assassin's Creed uses a lot of the number pad, but it doesn't feel unnecessarily complex. Gameloft smartly streamlines the controls so that basics, like a dash run is assigned to a quick double-tap of 4 or 6. Jumping up a tall alcove with wall hops is accomplished by rhythmically pressing 2, rather than fidgeting with, say, 1 and 3. And 5 is put to good use for interaction with objects, such as pushing down boards or raising switches.   Combat is also solid. Regular sword fights at the beginning of the game (before extra weapons are added to your gear, like the crossbow) are simplified with singular attack and parry commands. However, as the enemies get tougher, you learn new moves, such as jumping off a guard's shield to get the drop on him.   There are some enemies you assassinate without multiple button presses. For example, you will drop down on a target astride his horse. As you fall on him, press 5 to slice him open with your dagger, gutting him with just one blow. Assassinations, always accompanied by a three three-pane art sequence) are really the end of mission. Once you manage to kill the target, you still have to retreat to safety. In most situations, you have some perilous architecture to negotiate or enemies to elude.   Assassin's Creed offers a few extras to help set it apart from most of Gameloft's Prince of Persia mobile games, a series that also emphasizes acrobatics. There are stealth elements that require you to blend into crowds to avoid detection. I liked keeping step with a religious order to keep out of sight. The horse riding is also fast-paced fun. Jumping and ducking on your horse requires quick reflexes, even if the game does often flash the number key command you're soon to need. Horse sequences are both side-scrolling and top-down.   As mentioned above, Altair does pick up some extra goodies during his travels, such as Memory Blocks (often hidden in pots -- watch out for snakes!) that boost his overall health and the crossbow. Altair also nabs a grappling hook and bombs. No item is horribly under-used, something that often crops up in mobile action games.   The game itself is a stunner. Gameloft's art team has done a magnificent job with the level design and the character animations. The game's vistas are wonderful, with continued emphasis on great use of color. (The screen is splashed with blood at great frequency, too.) The soundtrack is also excellent.Assassin's Creed is a fantastic action game that is more than just marketing hype for the impending console release -- although, it does manages to make me even more excited to pop that game in my Xbox 360. It does work off the template cemented in Gameloft's previous Splinter Cell/Prince of Persia games, but the story set-up and death-defying acrobatics make enough of a difference that I can recommend the game to players that may already have other Gameloft action titles on their handsets. This adventure is well worth your time.", "date": "Nov 5, 2007"}