{"name": "MediEvil 2", "name_review": "Medievil II", "ref": "https://www.ign.com/articles/2000/05/23/medievil-ii", "text": "Even though Sony's in-house development studio has generated some horrible code (yes, Blasto comes to mind), an English division of Sony created Medievil back in 1998 to the delight of many. Medievil took the 2D beat-'em-up genre into the third dimension with a sense of humor and brought a simple kind of fun to the PlayStation. It wasn't mind-bending stuff nor did the genre grow too much because of Medievil, but the game was solid fun, and the Sony team could tell that it had something on its hands.   Medievil II is now upon us with a clearer path of frightful fun. The game's greater diversity, larger levels, and better sense of control over different modes make this sequel a far more compelling experience and overall a much better game.   Gameplay For those who weren't around for the first Medievil, the great knight Sir Daniel Fortesque, originating from the land of Gallowmere, arrived in the first game to fight off the terrible legions of undead, controlled by the ingenious but crooked wizard Zarok, who not surprisingly wanted to control the world. Zarok had found the book of Black Magic, from which powerful incantations could summon the dead, including Fortesque himself. And so after defeating Zarok the first time around, in 1386, Fortesque is summoned once again, now in 1886, to fight the crazy wizard again.   Unlike the Knightly room in which you spoke with the dead in the first game, players are treated to Professor Hamilton Kilt, who narrates and assists you in between the levels, granting you weapons, and explaining what to do next in the upcoming missions. New to the game is Winston, a bespeckled ghost who looks a little like Casper, and hints at what to do in tricky situations; he's useful. Also at your help are the Spiv, who sells ammo, and Princess Kiya, who mostly just looks really good, if you're into blue undead chicks, that is. With all of these characters, the new interface works better than before, and adds a better sense of character to create a more engaging world.   While these folks always are helpful, I found that several times in the dozens of large levels that I was without direction. This is partly due to settling in to the game environment, but in other cases, it was just plain wide-open confusion. The levels themselves are segmented, so you need to pass though quick load times to reach another area, but the actual connectivity of these levels sometimes leaves gamers wondering what to do.   In Kensington, for instance, players need to grab the chalice and head to a rooftop, where Winston tells you not pass through this door until you've done everything. Well, the door doesn't open until you've found the chalice, so you can't anyway, and it isn't a door, either, it's a window. The semantics are important here only because I started looking for a door nearby and wasted a good 20 minutes looking for a door that didn't exist! Needless to say, Winston could have been used in better ways than in his current form.   Another area that slightly confused me was the Freakshow. The problem here, and it's minor, is that the hints for the next trick or puzzle don't always lead to the next logical thing. The game isn't that difficult but for an experienced gamer I had to do some searching, and for the less-than-experienced gamer, it might pose serious confusion. Additionally, in several early areas I thought I should be using Dan-hand to guide me into secret areas, but I couldn't use Dan-hand, and nothing in the game explained that I needed to wait and come back to those areas. Too much wasted time.   As for the nuts-and-bolts gameplay, it's widened out from the standard hack-and-slash stuff. Fortesque has a huge arsenal of tools and weapons at his side, including a pistol, Thor's Hammer, a crossbow, an axe, a cane, your own arm (you just take it off and whack people with it), a gatling gun, and three levels of shields, each one more powerful than the next.  These grant you more variety than merely slashing away at dead guys over and over, but they are also more specific to individual tasks, too.   You're still essentially beating up everything in sight, running around and solving physical puzzles, like in the first game; it's just that the game is better thought out, so each new level brings new puzzles, weapons (if you get the Chalice on each level, that is), bosses, and environments.   Adding to the freedom of attacks, are a few smart moves on the developers part that really broaden the gameplay experience, such as providing a first person view (press L2 and R2 simultaneously), and the ability to play as two different characters. Well, slightly different anyway. After the third level players get the chance to take off Daniel's head and place it on these funny little green hands that pop up every so often. Each level contains secret areas that only ~Dan-Hand~ can access, which adds lots of replay value. You can see from the perspective of Dan's head, or from Dan's body, and also play from both body parts. Second, players can play as ~Dan-kenstein,~ in a boxing match against the Iron Slugger. This boxing experience leaves much to be desired, but in context, the change of play is good fun.   Overall, the control over Dan is better than before, but I'd watch out when using the analog controls. Dan runs ALL the time, and when you reach ladders and narrow sections, it's extremely wise to use the analog. I switched between the two throughout the game.  Graphics The biggest set of additions that really create a more sophisticated feel to the game are the addition of several kinds of cut-scenes, all done with in-game graphics, and slightly sharper graphics in each level. The cut-scenes create a better sense of continuity and story, and there are lots of them to help break up the game into a more controlled broader world.   Visually, Fortesque and pals look a little sharper than before, and the levels are designed to completely rid the game of fogging and pop-up, which is greatly appreciated. The whole game design is comical and fantastical, but I think in this second game, Sony's development team paid more attention to little things such as buildings and constructs overall, and the end result is a more intriguing set of levels, each more weird and bizarre than the next.   As for the camera angles, they're a mixed lot. For the most part, you are placed in a high-isometric point of view, but in many situations, the camera is fixed, and in several areas, jumps, specifically, the fixed camera angles drive me mad. I'd say about 20% of the camera angles could have been tuned or changed to provide better views. Good, but not great.   Sound If there had never been Danny Elfman, than the Medievil II team would have invented him here. The spooky, zany sounds of circus music and Halloween themes perfectly suit this goofy romp, and though the songs aren't poppy enough to sing along with afterward, they create the right light-hearted, carnival atmosphere that really fits.   My favorite sound effects in the game have to be the unspoken words of Dan, who has no lower jaw, and thus is ~speechless.~ For those who've played StarFox and Banjo-Kazooie or other games in which nonsense talk is the predominant language Dan's own muffled blather is excellent mush-talk.   Last, I enjoyed how the use of old British language is used throughout the game. Also, the different use of English accented voice actors was superb. They may not have been doing too much acting, but they were right on. And hey, I mean, thank God I now know what ~Spiv~ means, yeah? I didn't care much for the first Medievil, mostly because of the game's incredible redundancy. It was funny and neat, but nothing new, and it grew boring. Medievil II is a great example of the best a good sequel  it specializes the gameplay with Dan-Kenstein, Dan-Hand, a new view, and loads of weapons, opens up the levels with vast environments and cut-scenes, and provides new commands so that we aren't bored after two levels. My only complaints are that the game is really hard at times, and that I often found myself wandering around a whole lot more than I wanted to. A better set of logical hints and a slightly better use of English would have made this editor less frustrated. But even though some of the camera angles weren't great, and some of the levels were totally confusing, the game on the whole is a solid piece of work. It appeals to both young and old, especially with the candid humor and great character design, and it's easy to approach gameplay. Surely the best thing about Medievil II is that never for a second does this game take itself seriously. The whole set up is a comic romp that makes fun of everything from Dan, to the bosses to the final outcome. The first was funny, but this one goes a little farther. It's engaging just to see what new weird, goofy set of contraptions and goofball enemies are waiting in the next level.", "date": "May 23, 2000"}