{"name": "Bee Movie Game", "name_review": "Bee Movie Game Review", "ref": "https://www.ign.com/articles/2007/11/06/bee-movie-game-review-3", "text": "Licensed games are supposed to be crap. It's just one of those things you can safely assume, and nine times out of ten you'll know it within five minutes of popping in the game. Factor in a kid-oriented movie license, and those odds go up even higher. But every once in a while you'll come across a game where the basic movie concepts just seem to gel with decent game design and you end up with... well, with Bee Movie Game, for one.    It's not so much that developer Beenox (who couldn't have had a more fitting name) absolutely nailed the complete package, but they throw so many things out there that a few of them manage to stick -- and fortunately the sticky ones end up taking up the majority of the game's play time. The throwaway parts of the game, including most of the side jobs you can take and the unlockable old-school video games, all pretty much fall flat.    Barry takes flight. Even running around in the game's main hub area, New Hive City, ends up feeling boring after a while. Sure you can ~borrow~ any of the cars that are zooming around the city (if it's not being driven, that is; if there's someone else in the car, they'll happily take you where you steer while riding shotgun), and there are some hidden collectables to find in both the main city area and Honex, the honey production plant that supplies all of the game's jobs and arcade games, but the scope of the city isn't nearly big enough to cause any wows, and it only seems to shrink the more familiar you get with it.    Luckily, the second you leave the hive, the menial, repetitive jobs disappear, replaced by a large-scale set of exploration levels and a few on-rails Die Hard Arcade-style quick button press events. The latter serves mostly as a bridge between normal levels and the inevitable pit of rainfall that suddenly descends on most of the outdoor sections, but the former is populated by either collecting pollen from healthy flowers and injecting it into dying ones or shooting down enemy wasps, dragonflies and the like with some auto-lock free shooting sections.    What's happening here? There is some light interactivity with the environments -- usually consisting of spots to snap photos (which unlocks concept art and stills from the movie in the museum back in New Hive City), buttons to press or things to knock over and turn on or off, but for the most part your time will be spent just searching for flowers to pollinate or those little hidden honey snacks, all so the little OCD voice in your head shuts up about having found 145 out of 150 of the little buggers. To make it easier to find them and highlight other safe spots or dying flowers, you can flick on Bee Vision, which dumps the world with purple hues save for the important stuff, which glows pinkish.    It's a damn handy feature, especially if you're the perfectionist type, and offers just enough hand holding that the game doesn't seem like it's stringing you along. Of course if you want to be strung along -- at least in small stretches -- you can always hop into air currents and hitch a ride on the serpentine paths (often littered with honey snacks). These are also one of the few ways to traverse massive, open stretches between safe points when rain starts to fall. See, they slow time, allowing you to dodge raindrops as you zoom through the tubes on the way to a hiding spot. Barry, the game's star, can kick off Bee Reflexes to slow time for a short while, but it's usually just enough juice to get you to a nearby safe spot.     These two sections, the rain-soaked dashes from one safe spot to the next, and the more languid bits of free exploration and pollination, are honestly very, very good, with both the complexity and the creativity of the levels ramping up as you move through the game. Considering your alternatives are a bunch of arcade games that bite the style off old-school classics like Frogger and Space Invaders, or rip-offs of Crazy Taxi, some lame delivery missions and a handful of press-the-matching button mini-games, it's definitely a good thing that the core of the game is so solid. The biggest offenders, the slow-as-paint-drying and twice as boring races, were so bad that I actually fell asleep while playing them.    I also took issue a little with the way the game just assumes that you've already seen the movie and are familiar with it. Granted, it's cool that levels in the game are literally mirroring parts from the movie, but the lame attempt at painting things as a flashback vault over major chunks of the movie storyline, mentioning characters as if the player should know who they are and mentioning events that weren't even in the game.    Look out! Though the game is out on both the PS2 and the 360, the differences are mostly aesthetic. Obviously the 360 version sports far, far better textures, some shader effects for things like fur and the odd instance of water (including some nice refraction when the raindrops are slowed down), but there are also a few wonky shadows when things like grass are introduced. The actual levels themselves are the same, as is the scope, but obviously the 360 version benefits from a better framerate and -- oddly enough -- ~real~ geometry in New Hive City (the PS2 version has invisible walls aplenty between buildings, which you can actually walk between and into in the 360 version, which changes the hiding spots of the honey snacks), not to mention greater density in background objects, roving bee folk and vehicular traffic.   It should be noted that Beenox did a hell of a job on the lip synching during both the pre-rendered cutscenes and the real-time stuff alike. The animation as a whole is very, very good stuff and really does look like the movie -- important because for the most part all of the voice actors sound like their big-screen counterparts (mostly because, well, they are). The music in the game is a little less impressive, with marching key progressions and tons of repetition, but it's not flat-out bad, just lackluster.For all the blah, repetitive mini-game jobs and the slightly weak overall presentation, Bee Movie Game holds up surprisingly well. It's definitely better than most licensed games ought to be, but your mileage with the game will largely come down to how obsessive you are about finding hidden trinkets in the exploration levels and how much you like zipping slowly around giant-sized everyday locales.One important thing to note: the PlayStation 2 version apparently suffers from a pretty serious glitch whereby it'll lock up while saving the game while saving, which can (and did) corrupt my save game, instantly washing away a good seven hours of play time and collecting. If you end up picking up the game, make sure you save on multiple files, or you'll be as bummed as I was.", "date": "Nov 6, 2007"}