{"name": "Dinolympics", "name_review": "Dinolympics", "ref": "https://www.ign.com/articles/1999/07/07/dinolympics", "text": "While Creation versus Evolution is a constant battle in schools, it is not a debate in videogames. Cavemen and dinosaurs have long been a staple, simply because divine intervention is not half as much fun as hairy guys and big lizards. Joining this fray is Dinolympics for the Atari Lynx, a puzzle game known as Humans on other computer and game systems. Each of the 25 levels is a collection of platforms, objects, and obstacles. The idea is to reach a goal before time runs out. By working together and using objects, the tribesmen can jump chasms, climb obstacles, kill dinosaurs, and other tasks. In dire situations, the witch doctor can be summoned to exchange a tribe member for an object. The game ends when time runs out on a level or all of the tribe is lost, and passwords allow players to skip earlier levels.    For some reason, a lot of people think of Dinolympics (and Humans, I may add) as a derivative of Lemmings. I don't see it, myself. Instead, this card reminds me more of The Lost Vikings, Gobliins, or the old Goonies video game. The first few stages are simple, but it soons gets to a point where finishing a level requires careful coordination of two or more cavemen and assorted objects. Most levels are fairly complex, including unobvious solutions and red herrings to waste time. The simple controls allow you to select actions and tribesmen, as well as get a large map of the entire level.  Even so, this game requires a good dose of tolerance. Your biggest enemy is time; most levels have just enough for you to finish it, if you know the solution. The clock almost never stops, so a lot of time is lost in minor acts, and making a mistake halfway through a stage might not leave enough time to finish it. The game is also a little repetitive by design -- moving three men and a spear across a chasm requires repeated use of jumping and throwing, for example. These are not necessarily bad points, but depend more on each player's individual preferences.    The effects of Dinolympics neither captivate nor repel, but are merely sufficient. Game graphics are basic but easily identifiable, and assorted whimsical scenes are sprinkled throughout the game. Animation and colors are average, though there is a little gratuitous parallex scrolling. The dominant sounds are a variety of bouncy tunes that play through each level, mixed with some very basic sound effects. The music can be turned off before the game starts, if desired. Dinolympics is an acquired taste. Some folks will find the time limits and the game's repetitive nature a bit too frustrating. On the other hand, more patient players will give this title more time, whereupon it will grow on them to become an appealing challenge.", "date": "Jul 7, 1999"}