{"name": "Power Rangers: Super Legends", "name_review": "Power Rangers: Super Legends Review", "ref": "https://www.ign.com/articles/2007/11/06/power-rangers-super-legends-review", "text": "In the year 3000, an evil alien named Gluto has assembled several of the Power Rangers' fiercest foes in an effort to attack the Hall of Legends and steal the collective energies of all Power Rangers. Luckily, the Omega Ranger and several other, more colorful rangers take turns beating him and his cronies into submission in what's not just a bad DS game, but a bad Power Rangers game as well.    The game takes players through twenty-five stages of platforming, beat-em-up action against Gluto and other heavies from the Power Rangers universe. The draw of this game is that 16 different rangers can be controlled, taken from almost every season of the show. Granted, most of these characters are barely distinguishable from one another beside which primary color they use, but I'm sure there are plenty of fans that will love the idea of playing as fifteen years' worth of rangers. It's too bad the game sucks too much to enjoy it.    To start, the art is consistently bad in this game. Environments are mushy and lack detail, and it's very unclear at times what pieces of art are platforms. The sprites look a little better, but their animations pop with very few frames. The game has major issues with button response time. Characters have to finish the previous (often lengthy) animation before the game will respond to a new command. In the better action games out there, new commands will typically override old ones, so that the player is always in control of their character. Instead, the characters in this game refuse to perform any action unless they're basically standing still. While attacking, characters won't respond at all to the D-pad, requiring players to stop punching and pause for a few frames in order to turn their character. This results in lots of cheap shots because every time a pair of enemies attack the character from opposite sides, the player can't face one enemy without leaving themselves open to longterm bashing from the other.    Enemies are boring in this game with weak AI and no personality. They hop onscreen, run at the player and attack until they die. Even for a screen-locking Final Fight style game, the enemy programming feels lazy, with groups of enemies emerging from the same one or two spots over and over. Nowhere in this game is there a unique entrance or anything to make the enemies seem intelligent, just the bare minimum to get them onscreen for a quick, dumb death. Enemies also don't stagger their assaults, so if there are five enemies onscreen at once, they'll all be lumped against the main character like a wiggling, easily dealt-with mass of evil, rather than a few of them waiting to attack. Usually in games, some effort is made to place enemies in the environment in a way that makes them seem indigenous, emerging in a believable fashion. This game uses the same small handful of enemies over and over, with no discernable logic about why one enemy was placed in a spot over another. It's like someone left the enemy fountain on offscreen and it's just drizzling pointless, random badguys until someone shuts it off. Often these baddies can be dealt with by attacking blindly at the edge of the screen, because chances are they're going to be coming in from the left or the right. Yawn.    Go go Power Rangers. Each ranger can attack by punching, firing a gun and swiping with a sword. This variety is short-lived though, since most of the enemies in the game are impervious to punch attacks and guns usually just daze them. However, every enemy can (and should) be beaten by mindlessly and repetitively using the sword, because the other two attacks are basically worthless. In fact, by ducking and using the sword low, no enemies will ever touch the character because this allows the player to duck under all projectile attacks, and swipe both in front of and behind them at the same time. Such a reliable exploit should have been removed, but considering what a chore playing through this game is, the quicker these enemies go away the better. As the player collects crystals, they learn new moves for their character that are usually suped-up kicks and punches. These attacks are powerful, but hardly necessary since the enemies can't even stand up to basic sword swipes.    Character mobility is also compromised, with rangers running and jumping sluggishly and with a delay in response time between button press and action. The developers added Megaman X-style wall-jumping, but it's handled so poorly that it involves more button mashing than timing. Everything the character does feels half as fast as it should be, like they're underwater the entire game. There are a lot of discrepancies between animations and collisions, too, with characters noticeably embedded in walls or falling short of platforms that visually, they seemed to clear.    In between platforming action segments, the game offers a dual-screen topdown vertical shooter mode that's also pretty awful. The player controls a helicopter motorcycle on the bottom screen with the D-pad, firing with the B button and unleashing bombs by tapping the touch screen. The enemies are pretty lifeless, though. Most of them sit in place until they're either shot or they scroll off the bottom screen. The trickier enemies move and spray bullets, but still tend to head in one direction until they're dead or gone. This mode has to be played constantly, and there's no variation (other than a few enemies) between each level. It isn't just a dull shooter by today's standards; it pales in comparison to those from twenty years ago. The 3D environment below scrolls along nicely, but how the programming team could spit out such a lifeless, boring experience is beyond me.    Boss battles are done using the megazord in full 3D sequences that borrow from better games like Chousouju Mecha MG. Using the stylus, the player fires lasers and swipes at another oversized robotic warrior until it collapses. Fought in a first person view, collision in this mode is difficult to predict; it's unclear which attacks will hit the player's megazord and which will miss it. Occasionally, the boss will hop in front of the camera, requiring stylus swiping to take it down. The game instructs the player how to defend as well as attack, but defending is so unreliable and attacking so easy that these battles can be blazed through by just swiping liberally with the stylus.    Menus are lively and colorful, with plenty of panels sliding in and out like interactive comic books. The dialogue in the game though does tend to drone on, not unlike the shows. Cutscenes are skippable but since they often reveal new objectives and play mechanics, they're semi-required reading.    In addition to the main game, there is a co-op challenge mode. With two DS systems and two copies of the game (no game sharing here), players can team up as any two of the sixteen rangers and engage in lousy combat together. Beyond this and viewing the credits of those who worked (but probably not too hard) on this game, there are no extras.  Nobody needs this game. There are plenty of great action platformers to be picked up instead on the DS and GBA. Unfortunately, Power Rangers fans will have to continue waiting for a decent handheld rendition of the series. Even for longtime Power Rangers fans, this game is too ugly and poorly thrown-together to recommend. Dipping into a decade and a half of Power Rangers characters and mythology is a fun idea, but its not worth trudging through this sorry excuse for a game for it. Hopefully Disney Interactive will learn from it mistakes and require a little more polish and quality control in the next Power Rangers handheld release.", "date": "Nov 6, 2007"}