{"name": "Word Puzzle", "name_review": "Word Puzzle Review", "ref": "https://www.ign.com/articles/2007/11/08/word-puzzle-review", "text": "There are some household games that shouldn't make the conversion to Xbox Live Arcade. Things like Tic-Tac-Toe, Connect the Dots, Rock-Paper-Scissors, and crossword puzzles are a few that jump to mind, but there certainly are others. Word Puzzle, which by the way would receive IGN's award for the most uncreative game name in history, feels like it should be one of those games that stays confined to a piece of paper and pencil rather than making its way onto your Xbox 360. Yes, the game is essentially one word search after another with small variations thrown in to keep it as fresh possible, but through the whole experience we couldn't help but ask ourselves, ~Why are we playing this?~   While Word Puzzle does feature four different languages to choose from (English, Spanish, German, and French) there's almost nothing in this game that you couldn't find in a Seven-Eleven for a cheaper price. For 800 Microsoft Points you get to search for a set list of words on eight different environments that feel entirely too similar. There are three modes of play: arcade mode, survival mode, and free play mode. They're all basically the same; you look for words, when you find them you highlight the first letter and the last letter and the game fills in the rest.    Look at all those words!  Arcade mode is focused on forming combos, which entails circling words as quickly as possible in succession without letting the timer run out. The amount of letters in the puzzle continues to expand, as does the complexity of their arrangement. Helping you along your way in arcade mode is the inclusion of highlighted letters at the beginning or end of a word to point them out. You still have to figure out which direction the word stems, and while it may sound like it oversimplifies things the challenge is definitely still apparent in the later levels, especially when you have to rotate around four sides of a cube to search for letters.   Survival mode transports you around eight very similar ancient civilizations. While the game map shows you traveling from continent to continent it's clear that this was a total afterthought and winds up feeling completely unneeded in the grand scheme of things. Survival mode is essentially you finding a similar grouping of words within a time limit. The difficulty obviously ratchets up, but I was never stuck for more than a few attempts until the eighth and final level. Keep in mind that I'm no word finding extraordinaire, at least not that I know of.   What truly differentiates survival mode is the word bombs that will explode if you don't defuse them in a certain amount of time. When they blow up you'll see annoying distractions like ninja shadows that will make you want to punch a hole in your TV jumping over the letters or a light source that only follows your cursor, leaving the rest of the puzzle in total darkness. It's a nice little deviation from the norm, but the distractions are more annoying than anything else.    The Xbox Live play is essentially more of the same only instead of having to defuse word bombs you'll need to set them against your opponent by finding the highlighted word. Score is tallied by the number of letters in the words that you find, so the final word count might be seven-to-seven, but if you found larger words then you get the win. It's functional, not all that fun, but at least it works.Once youve circled your last letter youll probably realize what weve been thinking all along, that Word Puzzle is a game thats probably better left to pen and paper. The game offers solid variety and decent puzzle design, but at the end of the day youre still doing with a controller that which is much easier and just as rewarding with a pencil. Word of advice, if youve solved every other puzzle book at your local Barnes & Noble and have no other brain stimulation for a month and a half, spend your 800 Microsoft Points here. If none of that applies to you then look elsewhere.", "date": "Nov 8, 2007"}