{"name": "Chip's Challenge", "name_review": "Chip's Challenge", "ref": "https://www.ign.com/articles/1999/07/07/chips-challenge", "text": "Meet Chip. Chip is a nerd. Chip has a problem with women (natch).  Meet Melinda. Melinda is a nerdette. A good-looking nerdette, though.  Melinda has a problem. Melinda needs a date. Chip wants to take Melinda. Melinda is not impressed. Can Chip prove himself?  Chip can try ~The Challenge~. Mazes. Blocks. Computer chips. Buttons. Switches. Time limits. Thieves. Keys. Doors. Traps. Force fields. Fireballs. Water hazards. Fire hazards. Ice hazards. Chip-eating creatures. Lots of creatures.  Will Chip do it?  ~Sure, Melinda!~  See why Chip has a problem with women?  Welcome to Chip's Challenge, the brain-straining strategy game for the Atari Lynx. From a scrolling overhead view, you control Chip as he tries to survive 144 levels filled with all sorts of dangers. The object is to find the exit of each level and escape before time expires. Complications include deadly monsters and hazards, as well as a number of computer chips that must be found before you can reach the exit. Naturally, each level is a puzzle; only by properly moving blocks, pushing buttons, building bridges, and avoiding dangers can Chip get his date.  Chip's Challenge is one of the most innovative strategy games ever released for any system. Unlike some puzzle games, this title offers a wide range of tasks to perform and goals to reach, and all of the puzzles are carefully crafted to be uniquely challenging. The main objective is escape, but the subtasks needed to accomplish this varies widely, and it's impossible to find a universal strategy. Some levels require doing things in a certain sequence, or repeating one motion many times over. Others have lots of possibilites but only one answer, and still others require precise timing and fast movement. Most levels emphasize sharp thinking over arcade action, so players not blessed with lightning-fast reflexes will not be too intimidated.  Another thing worth mentioning is the high degree of friendliness in this game. Chip has an unlimited number of lives, so you can redo a level as often as needed until you solve it. If you fail too often, the game will let you skip the current level if desired, and a password for each level allows you to start there in future games. Best of all, the first eight challenges are tutorials, summarizing what must be done to solve it, and introducing new creatures and objects at a controlled pace.   Puzzle games generally don't need flashy sound and graphics, but Chip's Challenge doesn't skimp on special effects. Game visuals are small but distinctive, allowing you to see a wide area while identifying everything at a glance. Animation is used fairly well, and the multidirectional scrolling is flawless. Sounds are equally well-done, with distinct effects used for everything that can happen. Even if something happens off-screen, the sound cues help you to keep track of everything happening on the current stage. Finally, several ~electronic~ soundtracks play during the game, though they can be turned off if needed. The Lynx was originally designed for fast arcade-action games, but there's no reason why it can't expand its range. With a lot of variety, a lot of difficulty, a lot of originality, and a lot of ol'-fashioned craftsmanship, Chip's Challenge is a quality title and recommended for players of all kinds.", "date": "Jul 7, 1999"}