{"name": "Armorines: Project SWARM", "name_review": "Armorines: Project S.W.A.R.M", "ref": "https://www.ign.com/articles/2000/05/23/armorines-project-swarm", "text": "Armorines: Project S.W.A.R.M. is one of those games whose reputation preceded it.  The N64 version was not highly regarded by most, and was in fact vilified by a great many.  When the PlayStation version came around, the inevitable analogies were made to the hideous PS port of Shadow Man, whose N64 counterpart could be considered at least average.  If Shadow Man was that bad, how bad would Armorines be?  This is not one of those stories with an unexpectedly happy ending.  Armorines on the PlayStation is, in fact, just about that bad.  I had some rather cursory, brain-dead fun with it, but I also did not pay forty dollars for it.  Were I to try and get my money's worth out of this game, I would not be particularly happy.  To be fair, the PlayStation has never been the system for first-person shooters, particularly in this age when the genre is dominated by all sorts of steroid-injected, three-thousand-dollar-PC-powered specimens.  But those looking for frags on the cheap have a dandy port of Quake II already waiting for them on the shelves, complete with four-player support and excellent control options.  For that matter, a few dollars more would buy you a used N64 and a copy of Perfect Dark, which is to Armorines as a new Ferrari is to a 1979 Olds 88 with bad valves.  Why is Quake (or a bunch of other games) a better choice than Armorines?  Well, for one, this game is ugly.  Yes,  ugly.  U-G-L-Y, it ain't got no alibi.  I'm not saying this just because big bugs give me the creeping willies, I'm saying this because the polygon models are blocky, the animation is hit-and-miss, and the textures are repetitive.  This is often an extremely brown game, which I mean in the literal sense, browner even than Quake II.  In the Aztec temple level, there's almost nothing but waves of dirt-colored, low-res art as far as the eye can see.  The framerate wobbles oddly at times as well.  Sometimes it runs quite smoothly, which is only to be expected given such simple environments, but at other times it's quite choppy, even in small corridors with no enemies about.  It's not just the technical aspects of the game that look bad, it's the artistic style and execution.  Some environments show flashes of interesting design, but the vast majority are ordinary corridors.  The monsters aren't anything inspired, just lots of legs with brown textures on them.  Seriously, the bugs are brown too, perhaps having changed their coloring in order to blend in with the environment.  The one saving grace of the character design is accidental - it just happens that the male Armorine is the spitting image of 70s giant-robot god Gold Raitan.  Speaking of the bugs, therein lies another problem with the game.  It controls surprisingly well, particularly when you get the hang of the slightly floaty Dual Shock movement and aiming controls.  But once you figure out how to charge into battle, you'll find that you outclass your opponents by a considerable distance.  Yes, the bugs are just bugs, and the Armorines are purportedly designed to survive a nuclear war, so I suppose that it's plausible to be able to plow through the opposition with ease, but it's not really all that fun to whack every bug in the level and then spend the rest of your time there trying to figure out which turn you missed (Speaking of which, would an auto-mapping feature have killed the developers?).  Intelligent combat tactics are rarely required - just charge in and soak up a few hits.  Resource management doesn't seem to become an issue, because the basic gun never runs out of ammo, and it's all the power you need to deal with the bugs.  There's a nifty grenade launcher and some other pickup weapons, but it never seemed necessary to use them.  Oh, one more realism issue.  If the Armorines are wearing the ultimate in powered combat armor, enough to survive the appalling environmental hazards of nuclear/biological/chemical warfare, why do they have to come up for air after thirty seconds underwater?  Sorry, just asking.  What's most puzzling about Armorines is that it originally came from Probe Entertainment, the developer who managed to build a pretty entertaining first-person shooter in the form of Forsaken.  That game had its issues, but you can't deny that it looked good, even on the PlayStation.  Armorines is a giant step backwards from that success, and I can't for the life of me understand why.  Maybe all their talent quit, or maybe Acclaim figured the license would sell the game and cut the development schedule in half.  Who can tell?  Comments  One of the nice things about the insanely huge PlayStation software library is that just about every genre is covered.  If you want to play an RPG, a platformer, a puzzle, any kind of racer, or just about any sport imaginable, there is, if not an A-list game, at least a very good game available for you.  What this also means is that there's really no reason to give average to below-average titles a second look.  There are much better first-person shooters than Armorines out there, and speaking to the few followers of the license out there, this game does nothing with what little the Valiant Comics license has to offer.  If you're an FPS fan, you know what to buy, and if you're a comicbook fan, just save your money.  -- David Smith", "date": "May 23, 2000"}