{"name": "Nicktoons: Attack of the Toybots", "name_review": "Nicktoons: Attack of the Toybots Review", "ref": "https://www.ign.com/articles/2007/11/09/nicktoons-attack-of-the-toybots-review-3", "text": "Let's get this out of the way right here. Invader Zim is the best Nicktoon ever made. The show narrowly beats out Rocko's Modern Life as my all time favorite Nickelodeon cartoon. So, five years after the show was cancelled from Nick, the boys over at Natsume have put the diabolical alien into a videogame on the Nintendo DS. It would have been nice if the game wasn't bogged down by all of these other cartoons that nobody even likes (SpongeWhoNow?) but what are you going to do? Nicktoons: Attack of the Toybots is a repetitive ho-hum title, but it's made cooler by an interesting formula and cameos from cartoons that date back to when I was young enough to watch this stuff.   This isn't the first time the Nicktoons have joined together. In fact, this is the third DS title to cash in on every major Nickelodeon cartoon at once. However, this is the first time that they've also tried to cash in on cartoons that aren't even on the air anymore. Attack of the Toybots takes place in the same canon the other games do. Somehow the Nicktoons know each other, and inhabit the same area. Dr. Calamitous, an evil scientist, has created an army of robot toys as well as robot counterparts to the main heroes, and used them to take over various areas. It's up to the Nicktoons to join together and beat the crap out of everything.   Unlike the previous Nicktoons title, Attack of the Toybots is not a platformer. It's instead a sidescrolling beat-em-up. Players pick two characters and go at it, attacking everything in sight.    The game starts off with five characters: SpongeBob SquarePants, Danny Phantom, Timmy Turner, Jimmy Neutron, and Tak. Each of their homes is a different level and upon completion of the level a new character is unlocked and added to the roster for a total of 10 playable characters. Some are characters from Nick's newer shows, like El Tigre, while others are obvious fan service, like Zim.    Sometimes teddy bears are too much for the likes of Timmy Turner. Most of the characters are well represented in the game. The CG characters, like Jimmy Neutron look a little funky, but the 2D characters are well done. The cutscenes are talking heads, but every character has multiple faces to break it up and convey emotion. Likewise the writing is actually pretty well done, in the sense that each character speaks in the way they would in their respective shows.   And though it isn't much, every playable character has a couple lines of in-game voicework. It's just a catchphrase and an exclamation, but they're all done by the original voice actors, which is pretty cool.   Attack of the Toybots has a distinct formula for each level. It starts off with the beat-em-up, then a miniboss. After that the player hops into a mech and smashes his way to the end to destroy a machine. The mech then turns into a vehicle and the game becomes a 3D racing minigame. The mech transforms again and players go into a first-person laser shooting battle with a robot Nicktoon counterpart. During the level the player collects nuts and bolts from defeated toys while driving. The accumulated bolts are used as health in the final boss battle.   Okay, I confused myself typing that.   It sounds complicated, and convoluted, but it isn't. I think it helps that the game never tries to explain what's going on to the player. The bolts are just collected as the characters go through, and not really given a second thought. By the time the boss battle occurs it becomes obvious what they're for, and from that point players can plan their strategy for the other levels. It's a neat way to do things, and it ties together three game modes that would otherwise feel very disconnected from each other.   Unfortunately, the problem with such a formula is that the game becomes very predictable and a bit repetitive. By virtue of a beat-em-up the game is going to be repetitive anyway, especially since there are hundreds of toys to smash. It doesn't help that there is only one attack button, so the game really becomes a button masher. Holding down the button charges up a stronger attack, which helps a little, but not much. The character sprites move pretty slowly, which looks a little weird on screen, but otherwise they animate well. Every character has a different type of attack so they all play differently. For instance, El Tigre is a fast melee character, and Mr. Blik the cat is more of a short range fighter, and Jimmy Neutron sucks.   The driving levels are not very fun, but are thankfully short. It's obvious that they're just ways to build up some more bolts and stretch the game. They do serve one major purpose though. In each driving mission are five picture frames and each one unlocks an image gallery picture of a Nicktoon character. Nearly every Nickelodeon character is represented in the gallery. I mean everyone from The Grumble from Aaaah! Real Monsters to Rudy Tabootie from Chalkzone. If you recognize who both of those characters are it will likely be a neat feature of the game.   The robot shootout modes are the most challenging part of the game. Most of the time however the player has so many bolts accumulated that their health won't run out. Each robot battle handles differently, and usually requires some trick like disabling turrets, or turning off water pipes in order to effectively fight. It's something that's fun once, but players have to play it twice because the last level revives all the robots again.   Attack of the Toybots also features multicard multiplayer. Now normally I'm not a fan of making my friend buy another copy of the game, but this is one of those titles that really works well as a multiplayer game. For people like myself that hate making friends buy copies, there is a single card version too. It lacks the cutscenes, has some rather long load times, and the second player can only choose the basic characters, but the whole game is there. Very cool for showing it off to friends. While it doesn't have the thrill of Battletoads or the X-Men arcade game, kids would probably get a kick out of playing together.This is the best Nicktoons game yet. I know, that isnt saying much since Unite and Battle for Volcano Island kind of sucked. And really, this isn't a stellar title. It gets pretty repetitive and it's not very long. But for fans of Nickelodeon cartoons, it's got enough characters and unlockables to be pretty appealing. The minor voicework is just enough to be neat, and with multiplayer and so many characters, it's actually a game that could be played multiple times. I just wish Rocko was a playable character.", "date": "Nov 9, 2007"}