{"name": "Twisted Metal 2", "name_review": "Twisted Metal 2 Review", "ref": "https://www.ign.com/articles/2007/11/13/twisted-metal-2-review", "text": "There was a time when developer Singletrac could do no wrong. Warhawk, Jet Moto and most importantly Twisted Metal were the very definition of early PlayStation software muscle. It's the latter that concerns us today, particularly the second game in the series, which was Singletrac's last involvement with the franchise before it was handed over to 989 Studios and quickly fell into ruin. Fittingly, it's also considered the best of the series, subtly tweaking the original with vehicle-specific special attacks but otherwise leaving the game intact.    Like all of the Twisted Metal games, you're plopped into a handful of arenas (LA, Moscow, Paris, Amazonia, New York, Antarctica, Holland and Hong Kong) and forced to duke it out with a handful of weapons like arcing napalm shots, homing missiles, more powerful (but dumbfired) fire missiles, bombs and so on. Those that choose to slog through the single-player game can ultimately see all of the characters' endings (Calypso, the organizer of each Twisted Metal event, grants the winner one wish), but the real draw to the series has always been multiplayer, and thankfully Sony actually flicked the switch to allow two player battles to take place through the PS3.   There're just a few wrinkles around the edges... Though multiplayer is at its heart more or less the exact same as the single-player campaign (you can square off in a one-on-one fight or play through the single-player game in co-op), just the nature of it being a human combatant helps mix things up. Granted, that means you have to cope with the game's... interesting control scheme (d-pad steering, press down to reverse) and brand of physics, neither of which have aged especially well -- particularly given the game's framerate and archaic visuals.    Mind you, this is a game that's more than a decade old, but the march of technology hasn't been kind to most early PS one games, TM2 included. Two-player fights are a pixelated, choppy mess, the arenas can feel a little too claustrophobic for their own good, and the original PlayStation hardware's lack of filtered textures don't do the game any favors.    I wonder what her story is. On even a standard-def TV, the game looks a mess, but, surprisingly, shrunken down for the PSP screen, the game actually looks rather good - particularly in single-player mode. No matter what platform you choose to play the game on, though, you'll still have to deal with low-fi sound effects, and some of the cheesiest rock riffs the mid-to-late 90s could produce.Whereas games like Jet Moto (which is also available on the PS Store) had enough going on to keep the game interesting beyond downing a sixer and playing with friends, Twisted Metal 2 is a multiplayer experience first and foremost. Though it's still decent fun, much of the smaller scope of the game and the simplistic car combat just don't hold up all that well. Nostalgia, it seems, was a bit kinder to this game than we'd originally thought.", "date": "Nov 13, 2007"}