{"name": "Prey Mobile", "name_review": "Prey Mobile Review", "ref": "https://www.ign.com/articles/2007/11/13/prey-mobile-review", "text": "Prey Mobile has me convinced that nobody in this industry can do pure, raw 3D better than MachineWorks Northwest. Their excellent texture work and smooth frame rates is unparalleled right now, and no game in their library is a better showcase of such talent than the brand new Prey Mobile, a 3D shooter based on the surprise Xbox 360 and PC hit of 2006.   The game returns us to Tommy, the Native American hero of the original prey. His girlfriend, Jenny, has gone missing and his journey to find her leads him on an otherworldly adventure. Not to spoil anything here, but Tommy gets into many dust-ups with some cats from the bad corner of the galaxy and finds himself wandering around architecture that makes the Disney Concert Hall in downtown Los Angeles look as sane as the exterior of a Best Buy.   Tommy has a variety of weapons he can use to smash and squish alien troublemakers, such as his handy wrench and an sci-fi rifle. One of the better weapons in the game are organic grenades. These little alien frog-like things can be thrown as approaching foes like a frag grenade. They explode on contact, dishing out major damage. Much of the combat in the game is very straight-forward, with Tommy taking on all comers. Aliens of varying sizes stomp and tromp around the stages (of which there are many) but Tommy usually has the means to get rid of all of them.   Prey Mobile makes use of Tommy's spirit walk ability. If Tommy is ever killed in the real world, he slips into the spirit realm and can hunt ghosts for extra health and spirit power. Tommy uses a bow and arrow to pick off the colorful apparitions and bank the powers. He only has a few seconds to recover whatever he can before he's returned to the realm of the living. This is a neat feature for a number of reasons, but the most practical one is the one I really appreciated -- it side-steps the frustration of repeated demise for the more casual-oriented mobile gamer.   Spirit walking is also used for puzzle elements since it allows Tommy to move in the physical world without any real physical limitations, such as letting him walk through walls. Prey Mobile only has a few actual puzzles, but they are clever, such as one that tasks you with using a vision of Jenny to solve a switch problem. None of the puzzles are overwhelming, but they are smartly constructed in a way that gives you a slight shot of accomplishment when you figure out the solution.   The size of Prey Mobile is impressive. The developer has built out three very large areas to explore, but each area is divided up into easily consumable levels. This works extremely well for mobile since the majority of cellphone gaming happens in those so-called stolen moments. But when you look around, especially outside the... uh, I really don't want to spoil anything here but let's just say that there is something large parked in the desert where Tommy first loses Jenny.   The main complaint that can be leveled at Prey Mobile is the same one attached to any attempt at the real-deal first-person shooter on mobile: Controls. Not even MachineWorks Northwest can trump the basic control limitations of handsets. To say that a directional pad and a handful of number buttons doesn't come close to approximating a mouse-and-keyboard combo is a severe understatement. That said, however, I believe the MachineWorks has gotten as close as we're going to see to decent mobile FPS controls until handset manufacturers get in the game.   In the version of Prey Mobile I have, I look up and down with 3 and 4 while strafing with 1 and 2. The strafing works exceptionally well and it didn't take me very long to cut wide arcs around enemies and bring them down. However, tilting up and down to catch enemies isn't exactly the easiest thing to do because of the on/off-ness of mobile button inputs. There is no analog here -- no delicate degrees. You're either staring at the ceiling all of the sudden or tapping very gingerly to get the right height. Again, this is a problem with handset design in relation to games.   (Possible solution: What if you used the camera as your sight? Press a button to center it, and then the camera measures the movement of the image to control your view? Sure, you might look crazy on the bus, but who cares? There's always somebody crazier on the bus.)   Now, if you look at these screens for Prey Mobile, you know the obvious -- this game is beautiful. The texture work in the interiors, such as when you walk up to a metal panel, is incredible. It's sharper than what you get on a Nintendo DS! The amount of detail is so cool to see in a mobile game. The enemy texture work is also quite good. You can see the pulsing skin, the scales, the mangled faces.  Oh, and I mentioned the weapon detail in the last preview of the game, but it bears repeating. Really check out the guns. The crackle of the electrical gun, the snaking rifle and the squirming grenades... all very, very well crafted. Craft. That's a good word for what MachineWorks Northwest practices here -- a real craftsmanship that just has no equal in the space right now. Even if a first-person shooter against aliens isn't your bag, you simply cannot deny the quality of Prey Mobile. I know so many hardcore gamers will turn their noses up to this game just because it's on mobile, but if you're somebody with an open mind or the desire to try out a first-person shooter without investing $400 into a video game console, this is a great choice. It's only available on high-end 3D handsets (look at the top tier phones on Verizon Wireless), but I think after you see this -- and some of the other great things MachineWorks has in the hopper but cannot talk about just yet -- you'll be tempted to upgrade your phone.", "date": "Nov 13, 2007"}