{"name": "Who Wants To Be A Millionaire 2", "name_review": "Who Wants To Be A Millionaire? 2nd Edition", "ref": "https://www.ign.com/articles/2000/05/24/who-wants-to-be-a-millionaire-2nd-edition-2", "text": "After we devoted a load of space to reviewing the original Who Wants to Be a Millionaire? game (if you didn't read it the first time around, catch up by clicking here), you may be wondering why on Earth we've bothered to review the seemingly identical Who Wants to Be a Millionaire? 2nd Edition. Aside from the fact that people spent more money on the first title than most countries produce in a decade, we felt that it was unfair to judge an entire series of games by just one entry (which also explains why Tal persists in reviewing  every single Extreme Game that oozes out of the Head Games studio). And, after spending a good week with this solid sequel, we're glad that we made the effort. Despite the fact that Who Wants to Be a Millionaire? 2nd Edition is nothing more than the first game re-released with a boatload of new questions, it manages to overcome quite a few of the problems that kept the first title from rising to the top of the puzzle pile.  If you're looking for an in depth review of Millionaire's gameplay, graphics or interface, scroll back up and click on that link I gave you earlier. In nearly every way, Millionaire 2 is an exact replica of the original release and I'm not so loaded down with extra time that I feel the need to repeat myself. What is different this time around are the game's 600 new questions (a good thing) and the voice files that go with them (a bad thing). For now, let's start with the questions themselves.  If you played a lot (and by a lot I mean more than five hours) of the original title, you'll already be familiar with our main complaint about the game. The questions repeated themselves on a regular basis ensuring that any long session of gameplay would eventually end up becoming a rote memory contest. In Millionaire 2, the team has included 600 new questions that, for some reason, don't seem to repeat themselves nearly as often as they did the first time around. We played this game pretty solid (a few hours a day) for nearly a week this time around and didn't start to see repeats until the very end. Better still, the questions also seem to be a great deal more challenging. It actually took us three days to get our first virtual Millionaire, which stands in stark contrast to the hourly winners we had back in December. Still, as in the television show, players can expect to get five or six really easy questions before the real pressure starts at around the $2,000 mark.  As with the original game (I'm saying that an awful lot), Millionaire 2 allows contestants to use any of there three lifelines on any of the questions in the game. This means that there are percentages and voice acting tied to all 600 questions  which is kind of cool. The first time around, the Phone-a-Friend actors were kind of goofy, but they gave a fairly realistic feel to the game by offering up loads of different quirky helpers from all walks of life. This time though it seems like JellyVision wasn't really trying as hard. A frighteningly large percentage of the Phone-A-Friend questions are answered by ~The Amazing Earl~, a gruff psychic who leaves vague responses to your queries on his answering machine. I can only assume that the cost of having Regis say, ~hello~ to a load of different actors became prohibitive.  Okay, that's about all that needs to be said about this quiz-game sequel. If you liked the original title, you should really go out and pick up a copy of 2nd Edition  it's everything the first game was with better questions. If you missed it the first time around, this new version is the one that you should grab  not only is it more challenging, but it offers a lot more replay for the dollar. See you again when version 3 hits the shelves...  -- Trent C. Ward This game just loses its charm really quickly. Perhaps that's inherent in a game based on this basic TV show, but the party game isn't there, and all you have left are super-tough questions. Quizmasters may enjoy this torture, but the appeal and value of the disc is just less than more exciting quiz games. Even if you're a master of the game and you love it, the most you can ever possibly win is 40 million dollars before you're through all of the game's questions.", "date": "May 24, 2000"}