{"name": "Resident Evil: Umbrella Chronicles", "name_review": "Resident Evil: The Umbrella Chronicles Review", "ref": "https://www.ign.com/articles/2007/11/14/resident-evil-the-umbrella-chronicles-review", "text": "Over the years the Resident Evil franchise has been split into two main categories: The traditional survival horror, and the gun survivor series.  While the latter of the two hasn't caught much of an audience outside of Japan, the series lives on through masterpieces such as the Resident Evil remake on GameCube, game of the year Resident Evil 4, and the highly anticipated RE5.  With so much acclaim put on the main series itself, the gun survivor titles or spin-off products such as PS2's Outbreak series get less and less of a push.  Ask us a year ago if the Resident Evil gun survivor series was even worth pushing, and a hearty ~hell no~ would have been your response.  Leave it to a system like Wii, however, to change things up a bit.   The gun survivor series may never have reached AAA status (or even A status, to be honest), but there was always a bit of allure for the niche group that followed the series.  It eventually ended here in the states with Resident Evil Dead Aim, but hardcore RE fans may remember that - despite its ~passable~ score - the title still had some charm to it.  Resident Evil: Umbrella Chronicles looks to take the gun survivor design one step further this time around, again dropping the free-movement control of Dead Aim, and focus on the more traditional light gun gameplay, allowing players to grab a Wii-mote, aim, and fire; no more, no less.  What you end up getting is an experience that isn't exactly Resident Evil, and isn't exactly a light gun game either; it's a merging of both.  Enter the survival horror.  Right off the bat RE:UC has a lot going for it.  The franchise has done well for itself over the last five years, and as a result this light gun tour of the series has a ton to work off of.  The thought of experiencing all the key RE moments over again is enough to peak the interest of a longtime fan of the series (us included, of course), as there's something amazingly cool about the entire design of Umbrella Chronicles.  You'll have a chance to relive the train incident, explore the mansion, hit the streets of Raccoon, and eventually march right up to Umbrella's doorstep.  You're getting the characters, locales, weapons, and enemies you remember.  In that sense, Umbrella Chronicles is a huge success, as it'll bring fans of the series down memory lane for 20+ hours.   After going the distance with Umbrella Chronicles there are certainly a few gripes to be had though.  For starters, the experience feels incomplete without the inclusion of RE2 and RE4.  You'll play through parts of Zero, the original RE, and RE3, but the game lacks any RE2 or RE4 goodness.  Why they were left out is anyone's guess (we're hoping that this is an early hint that Capcom is working on a new RE2 to team with the re-release of RE4 on Wii), but they're definitely missed, as those two games include a ton of great Resident Evil moments.      With that being said, fans will still get a chance to experience the police station and licker-killing goodness of Resident Evil, as the area is revisited in the closing chapter of Resident Evil 3.  Oh, and for the record, RE3 is hands-down the best portion of this game, with zombie police, lickers, an absolutely evil Nemesis fight, and the flashlight-only portions found in part two and three of the scenario, which are easily the scariest and most moody sections of all of Umbrella Chronicles.    Speaking more specifically on the gameplay though, Umbrella Chronicles leaves a bit to be desired.  For starters, the game's core zombie-blasting mechanic can get extremely tiresome after a while, as the main gameplay is centered around slow moving, multi-hit enemies.  Capcom tried to mix things up by including dogs, crows, crimson heads, hunters, spiders, and the like, but in the end the majority of the time is still centered around firing at slow-moving lumps of meat.  Even taking a look back at Dead Aim showed us a faster, more intense light gun experience.  If you break the experience up into shifts of 15 minutes or so it'll feel great, but with a game like Resident Evil - especially one with such a huge nostalgia factor - you'll want to really immerse yourself in the experience, and that won't always happen before boredom sinks in.   As a pure light gun game, RE:UC has a pretty solid amount to offer though.  Objects in the environment can be destroyed to unveil new weapons or bonus items, some sections of the game have multiple paths, there are tons of weapons to level up and experiment with, and the bosses are intense and difficult.  For the most part you've got exactly what you'd want in a shooter, but again there are some sections that fall just short of being remarkable.  The Wii's IR, for example, feels different in RE:UC than it does in any other title on the system, having very little responsiveness when moving slow, but sliding across the screen faster than normal during general movement.  This means it'll be easy to whip your aiming reticule to a specific region, but not always as simple to zero in on specific targets - a zombie's head, for example.    Aren't you supposed to be securing the area?  It's extremely difficult to break down on paper, but the smoothness of the Wii IR isn't quite there, and we found that virtually any IR-based title in production or currently on the market has mastered pinpoint accuracy better than UC, as games like Ghost Squad, Medal of Honor Heroes 2, Link's Crossbow Training, the shooter game in Wii Play, Trauma Center, or even the general Wii menu cursor all have a smoother, easier to use IR than RE:UC.  Most gamers won't be able to put their finger on exactly what feels off about UC at times, and some casuals may never even notice it, but it's there.   This feeling of overall lack of polish continues throughout the design, so while we've had a blast playing Umbrella Chronicles, there's no denying the game's weaker points.  The oddly implemented IR teams with an extremely specific ~sweet spot~ on each enemy as well, so while a well-trained Wii gamer is expected to center in on the tip-top of a zombie's head to deliver a head-exploding one-shot kill, the combination of small hit zone and finicky cursor will make trying to hit those spots a real annoyance.  We've had runs of perfect shots, dropping a dozen or so zombies in a row with one hit, but in general it's extremely difficult.      In fact, in most cases the spot is smaller than the actual area affected, so while a sweet spot on a zombie will decapitate it, 90% of the head can be shot with no reaction whatsoever.  Shots to the face won't blow off the head, but hit the spot where the hairline meets the forehead and you'll blow the entire thing clean off.  With UC following in the footsteps of games like House of the Dead - where shots not only blow off full limbs, shoot holes clean through torsos, or blast off actual chunks of a head based on entry point - the overall lack of effect your bullets do seems extremely archaic.    As for a few other issues, weapon switching can be a serious pain, as every type of weapon you pick up throughout a given chapter is kept on your scroll wheel regardless of ammo.  This means that when you're fighting for your life with a final shotgun shell at your disposal, you'll not only be worrying about what to aim it at, but how fast you'll be able to scroll through all your empty slots to get back to your infinite ammo pea-shooter pistol.  We've even lost boss fights because of this numerous times, as you'll want to horde your power weapons, unleash them on the bosses, and then switch back to your main weaponry as fast as possible.  In conjunction with that, most boss fights tend to have a few instances of nearly automatic ~get hit~ animations, where there's often only a few pixels of sweet spot available to interrupt an animation.  Team the small hit zones with long weapon reloads and scrolling through empty slots to get to the right weapon and you've definitely got your work cut out for you in the later levels.   Most of Resident Evil's gameplay issues take their toll on that final notch of quality that really skyrockets a product from being ~good~ to ~great~, but that doesn't mean the majority of the package is a total wash; it isn't.  The game's presentation is pretty impressive, giving off the Resident Evil vibe throughout by keeping sound effects, interface, and environments very in tune with the game's inspiration.  Pieces of levels - specifically found in the mansion section - seem to be remade brick by brick from their predecessors, with zombies, items, and weaponry exactly where we remember them years ago.    First aid can: $12. SE2 handgun: $27.  Poorly thrown VO amidst zombie-killing goodness:  Priceless.  In some instances we handed the controller off to other RE fans in the office (not gaming journalists; just fans of the old games) and shared some really fun moments, as players would actually shout at each other in two player mode that they knew specific items were coming up.  When traversing the laboratory from the mansion incident one player went as far as to say ~Wait, we've got the elevator coming up on the left, and there should be a green herb at the top of it.  It's broken though; we'll need to turn it on this way.~  Sure enough, we dead-ended at the elevator, backtracked through the laboratory, and switched the power on.  Resident Evil: Umbrella Chronicles is not only a retelling of the story, but it's actually a reliving of it as well, and that's pretty impressive.   As far as the ~Chronicles~ aspect of RE:UC, this is where the game goes from rental to purchase for the more hardcore RE-loving crowd.  Every level has bonus items that unlock file pages on enemies, character, items, and weaponry from the game, so while you won't be using the lock pick to open doors in the original RE, you will get info on that item and its hilarious ~master of unlocking~ history.  It isn't integral to the game in any way, but it is a nice shout out to the fans.  Aside from the three chapters in each of the four ~incidents~ in the game, you've also got side quests that open up along the way, so you'll have a chance to fill in the gaps of the story as the main plot unfolds.  Some of our favorite in the bunch revolve around Wesker, and while they're made up of the same level architecture and enemies, you're taking new paths and using different weaponry along the way, giving the game a bit more story and depth.  Whereas we originally thought the game was made up of 12 main chapters, it's actually about double that.     Unfortunately, the game's presentation isn't all remarkable, as some of the visuals in RE:UC can be pretty hard on the eyes.  The game runs in 16:9 and 480p, but many of the environments and models are made up of bland colors and some textures that are average at best.  The mansion incident in particular suffers from overly dark areas, drab lighting, and pretty poor visual presentation overall, especially when you step out of the mansion and into the darkness of the outside levels.  Some of the main zombies look pretty good overall, and the spiders and hunters are visually impressive, but so much of the game's enemy roster and environment work is well under GameCube's RE4 or ~REmake~ visual quality, and that's a shame.  It seems to be the case with every Resident Evil gun survivor game out there, but to really enjoy Umbrella Chronicles youre going to have to take the good with the bad.  As a tribute to the last decade of survival horror, RE:UC does a great job of turning back the clock and delivering on the nostalgia front  as long as you forget that RE2 and RE4, the top games in the series, exist.  The overall gameplay is made up of pretty straightforward light gun play, including tons of breakable items and upgradeable weaponry, multiple paths, huge boss fights, and some solid two player co-op, but it still lacks some serious polish as well.  The IR lacks the smoothness of virtually every other pointer-based Wii shooter out there, theres very little reaction from enemies when you pop them with dozens upon dozens of shots, and the sweet spot critical points on enemies are often smaller than the area they affect, so while five shots to a zombies head wont blow it off, one perfectly placed bullet on the top of the models forehead will.  There are occasional framerate drops and visual oddities as well, which is even more evidence that RE:UC is a second tier title rather than a primary focus for Capcom.At the same time, theres no denying the fun we had playing the game, and any Resident Evil fan out there will undoubtedly feel the same way after a few hours of Umbrella Chronicles.  It lacks polish, and it may have some annoying gameplay quirks that keep it from being a great game by definition, but as a tribute to the Resident Evil franchise, and a fun in-between game that works well in short bursts, UC delivers.  Theres a huge variety of RE-inspired levels to blow through, over 20 hours of play (gigantic for a light gun game), nearly a dozen weapons to find and upgrade, and a pretty ambitious amount of scripted cut scenes and classically bad Resident Evil voiceover work.  Its far from perfect, but its an entertaining addition to the RE gun survivor genre, and it simply boils over with fan service.", "date": "Nov 14, 2007"}