{"name": "Screw Jumper", "name_review": "Screwjumper! Review", "ref": "https://www.ign.com/articles/2007/11/15/screwjumper-review", "text": "Like most artistic creations in life, original game IPs can be very hit or miss, especially on Xbox Live Arcade. Sadly Screwjumper! falls in the latter category as a game that simply should not have been. It has a poor design, graphics that will make you think you're staring at a Dreamcast launch title and sound that could have been produced by the Super Nintendo. Yes indeed, Screwjumper! should have stayed confined to a designer's doodle pad rather than earning a slot on Xbox Live Arcade.   The premise for Screwjumper! is surprisingly inventive. You play an ex-mine worker who is currently unemployed because of the advent of automation in the mining industry. You've joined up with a brotherhood of other screwjumpers who are on a mission to bring down the mineshafts of their former employer, the EAC. The plot actually does sound fairly involved, but the only way you're going to hear about it is if you read through the various tutorial screens, otherwise the game has no point and no direction other than to send you down 20 different mineshafts across four different environments.   Each level begins with your character leaping from his ship into a mineshaft at which point you'll need to engage in the tedium that engulfs the entirety of Screwjumper!. The game is all about slamming into green objects in order to bring down the shields of the main reactor which lies at the bottom of the shaft. Once the shields are down it's time for your screwjumper to toss a stick of dynamite in and then bolt back out of the shaft. Standing in your way are several red objects (the constant battle between red and green continues!) that include mines, lasers, lava flows, ore grinders, and power cores, all of which can mean certain doom.    Hit that green! Given that you're basically floating down or shooting up a mineshaft for the whole play experience you'd assume that there would be some fairly realistic physics at work. While the game does convey the sense of sluggishly maneuvering through the air, it doesn't feel authentic at all. Instead it's just annoyingly inaccurate. Sometimes you'll swear that you're directly in line with that one green disc that's going to send the reactor into final meltdown, only to have your screwjumper somehow drift away from it. It's annoying to say the least.   Luckily Screwjumper! has a way to circumvent the tactic of running into the influx of green objects. Being that your screwjumper is equipped with 20 or so sticks of dynamite before each level all you need to do is save your explosives until the reactor is in sight, slow your fall using the air brakes, then chuck every last piece of dynamite at the sucker until it blows up. The tactic completely eliminates the point of launching yourself down the shaft and running into the steady stream of green objects, thus eliminating the point of Screwjumper! altogether. I've seen the reactor at 35% integrity by the time I get to the bottom and I've still been able to bring it to its knees with some speedy trigger presses.   As if all of this wasn't bad enough, the game perpetuates its failures by supplying gamers with an aiming mechanic that is extremely tough to work with. The aiming reticule is constantly resetting itself to the middle of the screen which, while it might help you keep track of it, is very frustrating when you want to leave it on a targeted item for any period of time. Then there's the inclusion of the first-person view that the game employs when you're rocketing back out of the shaft. There's no need for it and is much more finicky than it should be.    There's a multiplayer portion of the game and it does offer online or local play against a friend. Taking the game online allows you to play with three other blokes on any of the 20 levels, whereas playing locally limits you to seven levels against only one friend. Regardless, none of the multiplayer options are very fun, and even that is supposing that you can actually find someone online.   The look and sound of Screwjumper! are two pieces of the puzzle that obviously could have used more time in the shop. As we said before the visuals are on par with something you'd see from a Dreamcast game. We understand that this is a ten dollar investment on a digital delivery service, but for the love of God find a way to put high resolution textures into your game! Oh, and having level designs that aren't mirror images of each other would help too. Aurally Screwjumper! is a massive disappointment, less the techno funk that rings from the best portion of the game: the main menu. The explosions are hallow and tinny and sound more like a Super Nintendo title than anything that should be on Xbox 360.  We dont say this very often as were definitely in favor of developers trying new things on Xbox Live Arcade, but Screwjumper! just should not have been green lit by Microsoft. Theres nothing redeeming about Screwjumper!, no reason for anyone to give it a second look, and absolutely no way you should spend ten bucks for the download. With as many games as there currently are on Xbox Live Arcade everyone should skip  no, jump  right over this one.", "date": "Nov 15, 2007"}