{"name": "Beowulf: The Game", "name_review": "Beowulf Review", "ref": "https://www.ign.com/articles/2007/11/15/beowulf-review-4", "text": "If you're looking for a video game experience that does justice to the revered epic poem, a work that more or less served as the inspiration for Tolkien and all the spin-off fantasy media saturating Western society, get ready to be sorely disappointed. Things have changed in this new adaptation of Beowulf, the video game version of which differs even from the movie in its deviation from the original. Grendel's mother is much more involved in events, Grendel whines like a schoolboy over Heorot's merry-making, and the way at which the action arrives at the major plot points significantly differs. It's never exactly clear what's happening, however, as the continuity of the game's story is smashed apart by jarring scene transitions, anemic dialogue sequences, and an overall lack of personality.   Though there were certainly jarring transitions in the original poem, there's no excuse for it here. In the roughly 1300 years since Beowulf was written down, it appears all of five minutes was spent on the game's story. In it, you meet up with Grendel's mother in her den, like in the story, and then smash a button to defend against a gang of her doppelganger succubae. Confused? This happens three times, with little to no explanation of what it actually means. Eventually you'll piece things together, but the way the developers decided to make things so unnecessarily difficult to follow, especially considering they're offering a new angle on one of the classic works of Western Literature, is an embarrassment to the medium of video games and their ability to convey weighty narrative concepts in unique ways. Thank goodness Irrational made BioShock to prove story can be done correctly.   Umm... Beowulf utterly and completely fails to live up to the pedigree of the work on which it's based, and shamefully displays our society's tendency to try and cash in on a cultural touchstone. Hopefully the film's script does a better job with the rewrite than this pile of virtual garbage. If you've never read the poem before and don't particularly care about its significance and how the game relates to it, then you'll still have to sit through a narrative told with the precision of an oil spill.   On top of the regrettably muddled story, the game itself is rife with design problems, and delivers one of the most poorly constructed action sequences this reviewer has experienced all year. It places you, Beowulf, atop a hill along with your fellow soldiers, called Thanes. You're tasked with defending a stone relic, which sits behind you, against numerous waves of enemies. If only the combat weren't so imprecise, if only you could actually tell your Thanes to defend something instead of running around like addicts at a meth party, then I probably wouldn't have spent two hours unsuccessfully trying to keep this object intact. I actually had to shut down the game and restart on the lower difficulty setting to get through to the end, which, by the way, took four hours and fifty-one minutes.   Though the game is full of problems, it does seem to get the basics right. Beowulf starts out with simplistic combos of light and heavy attacks, the ability boost his Thanes' attacks, a dodge and counterattack move, and the ability to shift into carnal mode, where grabs, punches, and weapon slashes do more damage. You'll enjoy this system until you realize you never learn another move, but instead power up existing ones. Then you get out into the field and fight enemies, only to discover the exact same gameplay mechanics are repeated throughout the entire game.   Spoilers. The game flows like this: Beowulf enters an area, mindless monsters spawn and attack, then another wave charges, then another, and so on until the foes are vanquished and an intangible barrier goes down allowing you to progress. Sounds like God of War. On larger troll (what?) enemies you perform timed button-tap sequences to bring them down, ending with a brutal assault on their heads. Sounds like God of War's Minotaur fights. In fact, most of this game is God of War, only done with far less detail, depth, and knowledge of producing enjoyable gameplay experiences. You even get the slow-motion segments inserted into the regular flow of battle to try and make them seem more brutal, which is more or less pointless given how disposable the combat is.   Frequently you're forced to order Thanes to move a circular stone, turn a crank, free a rock, or row a boat. These sequences don't really get any more complex or involved as the game progresses, but rather get clumped together. So by the end, instead of completing a challenge that involves using your intuitive skills to adjust to a new problem based on the solution pattern introduced earlier, you just dislodge a boulder, turn a crank and roll a door all in the same room. Brilliant.     What's worse is Thanes stop working on crank-turning or door-heaving if they're attacked by even one enemy, meaning you need to defend them. Let's say you're trying to accumulate heroic points by using dodges and weapon-based attacks. First off, if you're not using one of the legendary weapons hidden throughout the game, whatever you're holding is going to break after a handful of swings. This leaves you with your fists or switching into carnal mode, the latter of which makes progress toward earning carnal points instead of the hero type. The problem with carnal mode is you can inadvertently kill Thanes, meaning it's not so good for protection. You could go grab an enemy and disarm him or snag a weapon off one of the ubiquitous racks, but then you've moved away from the crank-turning Thanes, ensuring they'll get knocked off their task. If a Thane not involved with cranking happens to get pinned by an enemy, you get the added luxury of watching the other friendlies stand still and stare at the victim, apparently content to wait for you as their buddy gets his face clawed off. In the meantime, the crank-turners have undoubtedly been interrupted.   You can choose to cheer them on, assuming you get enough space, by performing an imbecilic button input sequence. This barely ever becomes more demanding than when it's introduced at the game's beginning. As with the combat, which never evolves, the woefully inadequate Thane commands and the repetitive door, crank, and rock-freeing sections, it's more evidence that this game was never meant to be enjoyed for more than fifteen minutes, since there's nothing in it to keep you hooked after learning the basics. This is especially apparent when, at around 80 percent of the way through the game, you're asked to repeat the boat-rowing sections from the opening tutorial, only in a different setting.   Beowulf fights a one-eyed sea monster! Who's excited? One of the game's main features, the carnal versus heroic combat choices that ultimately determine what kind of ruler you're labeled as, is totally undermined by the challenges thrown at you. It's far more effective to use carnal attacks in some sections (a horribly repetitive Shadow Thanes fight comes to mind), likewise for heroic. Though you can choose which attacks to use, it feels more like the game dictates them for you, making the whole dynamic between the two relatively worthless.   But never fear, the game's monotonous, imprecise, and nauseating gameplay is given a jolt near the end by the introduction ofan ice level. Seriously? And let's not forget the wall clambering mechanics that feel like chicken claws on a sheet of plate glass.Ubisoft Shanghai and Tiwak did a magnificent job of butchering the reimagining of a classic tale and providing plenty of disposable, derivative gameplay to go along with it. Though you'll eventually understand the new tale, the absurd storytelling often makes deciphering events and motivations as difficult as a non-scholar trying to read the Nowell Codex. As far as gameplay goes, I can understand why a development studio would want to mimic many of God of War's concepts, yet it's still surprising to see it done so badly. Things start out simple, and that's how they stay, right up until the very end. That is, of course, assuming you can bypass an unbelievably aggravating protection sequence where the utter uselessness of your Thanes, heroic, and carnal attacks becomes painfully obvious. What a waste of time.", "date": "Nov 15, 2007"}