{"name": "Shrek-N-Roll", "name_review": "Shrek-N-Roll Review", "ref": "https://www.ign.com/articles/2007/11/15/shrek-n-roll-review", "text": "Shrek has become quite the videogame icon over the past six years. With his name adorning a plethora of mediocre titles across every platform in recent memory one would think that at least a few of them would go beyond being a visual showcase for the original Xbox. Alas, that's not the case. Hackneyed gameplay mechanics and an overall design that has been done to death has usually landed the games in the realm of not quite being bad, but being nowhere close to good. Shrek-N-Roll is the ogre's first attempt at bringing his gaseous mannerisms to Xbox Live Arcade, but we're sad to report that it's simply more of the same for the other jolly green giant.   The game hinges on what is essentially one game type. Players select two characters from an offering of more than 20 -- the list includes Puss-in-Boots, Charming, Fionna, and of course Shrek as well as a host of others that you'll recognize from the films -- and choose from four environments, each of which features four levels (making for 16 in all). The object of the game is to feed Shrek's numerous babies which are situated around the levels. Your characters are placed on opposite sides of a long plank, each has a crank on their side and you must contort the right and left analog stick up and down to manipulate a piece of food from one end of the board to the other. Get the food in the hands of the little ogre tikes and you're golden, but let the nourishment get sucked into one of the purple portals and you're up poop's creek sans paddle.   Feed those little bastards!  The level designs are varied enough, ramping up in difficulty towards the end of the game. Even still, the whole thing won't take you more than an hour or two to beat. The practice of feeding Shrek's little ones can be extremely tedious too. You'll likely feel like you're doing the same mundane task over and over again, and that's because you actually are. The formula goes like this: start at the bottom, avoid the purple portals, collect coins that are scattered around the level, feed the baby, and reset to do it all over again. You unlock characters and levels along the way, but the whole experience is just never that much fun.   The one redeeming mode that the game brings is the multiplayer, more specifically the co-op. While you can play locally (why no Xbox Live?) against a buddy, the co-op is by far the better choice. Versus mode simply presents the same style of gameplay but it splits the screen vertically and offers a few zingers to throw at your opponent. Capturing certain items allows you to steal their multiplier or make their plank disappear for a period of time, but it still feels all too similar to the mundane single-player mode.    Co-op is far more inventive as one player will man the left side of the board and one will control the right. Players have to work together in an effort to manipulate the plank in the proper way to feed the ogre children. The gameplay turns into something like this, ~Okay, ready, on three. 1, 2, 3, GO! You went too early!~ ~No, you went too early!~ But the feeling of nailing the timing just right and rocketing the food around the platform with some sign of skill is actually quite good.   Shrek-N-Roll delivers a decent visual representation of the world of Shrek with environments like The Swamp and Evil Queen's Castle that will bring back memories of the films. The character models perform decently well even though their animation set is ridiculously limited. It's also nice to see that they went the extra mile and included a good portion of the characters from all of the films. The audio in the game is a bit sparse and doesn't feature the main theme from the series of films. The original actors also aren't included, but that didn't stop me from getting more than a few chuckles from my favorite character, Gingy.   Taste me!Shrek-N-Roll is more boredom and mundane than fun and exhilarating, even for diehard fans of all three Shrek films. I originally thought that the game was going to be a mini-game compilation which would have likely offered a much higher fun factor. As it stands little tikes could learn a few things about dexterity and physics, but most will think Shrek-N-Roll should stay confined to the green grime of the swamp rather than the green bliss of your Xbox 360.", "date": "Nov 15, 2007"}