{"name": "LifeSigns", "name_review": "Lifesigns: Surgical Unit Review", "ref": "https://www.ign.com/articles/2007/11/16/lifesigns-surgical-unit-review", "text": "I love a game that begins by warning players that the surgeries shown differ greatly from real life ones, and should not be performed at home. I guess I won't be fixing any gunshot wounds with my DS stylus this week. Lifesigns: Surgical Unit is an odd blend of Trauma Center: Under the Knife and Phoenix Wright: Ace Attorney. The game follows the adventures of young medical graduate Dr. Tendo, a year into his hospital internship and ready to prove himself as an able, determined physician. The player is set up with information about their patient and the hospital denizens, and must question everyone around Tendo before ultimately heading into the operating room to slice their patient back to health.    This game is surprisingly talky, and involves substantially more time chatting with people around the hospital than actually doing any hospital work. Before Dr. Tendo can actually operate on a patient, the player must navigate him around the hospital, locate the patient and then make a series of inquiries about their condition, using medical reports and other items as points of discussion (like Phoenix Wright uses clues). Then the player must chat up all of the patient's visiting friends and family, as well as most of Tendo's colleagues, referencing whatever slips of paper he has in his pocket until finally, and somewhat randomly, it's time to perform the surgery.    A text-based interactive adventure built around touch surgery might sound like an interesting approach, and it does help differentiate the game from Trauma Center. But unlike Phoenix Wright, the player can really do no wrong with their decisions. Instead of thinking each situation through and deciding on the best course of action, the gameplay really just requires dragging a whole lot of icons onto a whole lot of people before one of the combinations will trigger an event that furthers the story. Players can expect to sometimes spend an hour or more chatting up hospital workers before Tendo actually gets to do anything interesting. These conversations can affect that game's outcome to a degree, but this doesn't make running through them any less of a chore.    To its credit, the characters and situations around the hospital are pretty amusing. Each character Tendo encounters has their own eccentricities, usually revolving around their lack of commitment to their job. The player can access Tendo's inventory at any time and get a colleague's advice on a patient or current situation. Through these dialogues, the player gets a better sense of each character's persona, which seems to be more central to the game than performing surgery. In fact, the game could really be described as more of a hospital internship sim than a surgery game. Many of the character responses are surprisingly wacky. Doctors talk about being hung over from drinking the night before a surgery. Patients bitch about having to pay hospital bills and being out of sick days from work, which makes cutting them open a less guilty experience.    Here's the problem. This man has two rib cages. But even with enjoyable writing, the game suffers from a lack of actual gameplay or purpose. The surgery sections, which play like a dumbed down version of Trauma Center, are spread too far apart and whatever charm the character dialogue has quickly wears thin, as the player is forced to engage in dozens of conversations to get even the smallest tasks done. People looking for a game revolving around touch surgery will be misled by the game's box, and disappointed to find Tendo spending more time working out issues with his father or being awkward around girls than saving lives.    When surgery does occur, it's usually pretty cut and dry (pardon the pun). Before the operation begins, Tendo must prod around on the patient until he locates the problem area. This can be a confusing process, as the game's text is often misleading and befuddling. When a patient explains that the pain is further to the right, she means her right and not the screen's right. If this is meant to mirror the frustration real doctors must face, mission accomplished. After diagnosis, the player is handed a tool and told exactly what to do, immediately before doing it. Tendo can 'concentrate' with the L and R buttons, which reveals guide lines of where to slice and adjust anatomy. And while Tendo can botch even the simplest surgery, killing his patient and sending the player back to their last save point, operating ultimately isn't as interesting or challenging as it was in Trauma Center.    The art in the game is somewhat generic in style, and looks like it could have been ripped out of any recent anime TV series. The characters however animate quite a bit and display a range of emotions and movements beyond that of Trauma Center. Bra and panty shots seem a little gratuitous in the game, and fondling a patient improperly plays a BOING! sound and displays angry text from the manhandled patient. This may sound inappropriate, but it's in line with the game's tone.    Occasionally Tendo will find himself out of the hospital, where the game offers up some non-surgery minigames, like collecting rolling fruit from an overturned fruit truck or playing air hockey. These are all pretty mediocre and further contribute to the game's lack of focus. As one might expect with such a text-heavy game, there are no real extras to be found, although there are multiple endings and individual surgical procedures can be replayed from a menu once the main story has been completed.I admit, the characters in this game occasionally made me smile. But they werent nearly charming enough to justify the hours and hours of wandering and chatting through this dull, unfocused game. Lifesigns: Surgical Unit definitely sets itself apart from Trauma Center and Phoenix Wright, but in a bad way. Its a polished, thought-out adventure, but it also feels incredibly pointless and at times achingly dull. The game needed some streamlining, or at least more pressing decision-making within all these conversations, rather than mindless drag and drop. Unlike Trauma Center, which cuts straight to the meat of the gameplay, Lifesigns: Surgical Unit leaves players in the waiting room.", "date": "Nov 16, 2007"}