{"name": "Metal Gear Solid: Portable Ops +", "name_review": "Metal Gear Solid: Portable Ops + Review", "ref": "https://www.ign.com/articles/2007/11/16/metal-gear-solid-portable-ops-review", "text": "Kojima Productions and Konami released an instant action classic with Portable Ops, a title that truly brought the Metal Gear Solid universe to the PSP.  Capitalizing on the technical strengths of the system, Portable Ops used Wi-Fi, periperhals and control scheme of the PSP to present a compelling story with incredible gameplay.  Almost a year later, this title has been expanded upon with the recent release of Metal Gear Solid: Portable Ops Plus.  While not a true sequel, this expansion pack of the award winning title is designed to add more to the overall gameplay experience.  Unfortunately, the improvements don't outweigh the features that have been stripped away from this franchise, making this release seem unnecessary.   The original Portable Ops was set a few years after the events of Snake Eater, and introduced Roy Campbell and the formation of classic Metal Gear elements, such as Outer Heaven and FOXHOUND.  With a story that was full of plot twists and turns, the game questioned Snake's loyalty to his country, the reasons soldiers fight, and other dilemmas in a compelling manner, while setting up elements for multiple sequels.  Unfortunately, Portable Ops Plus doesn't pick up any of these threads within the single player experience of the game.  In fact, there isn't really a plot to speak of within the single player mode, which is a significant letdown.  It also raises some rather strange questions, particularly if you've completed the original title.  Why would you include Boss Rush mode, which lets you take on boss battles from Portable Ops, if there's no story?  This seems to simply be thrown in as a way for players to potentially grab these characters if they didn't capture them from the first title.  Similarly, the reasons why you acquire certain characters, such as Old Snake and Raiden, are complete mysteries in this new story-less context.  Why do they join?  What's their purpose other than to have recognizable figures in an out of sequence game?  Elements like this simply don't make any sense.   Why are you here?!?! Instead, Infinity Mission places your teams on missions generated from random stages, each with their own specific objectives or goals which get harder to accomplish as you go on.  For instance, you may find yourself needing to find the exit to the stage while every enemy soldier is in alert status, or you may have to kill or kidnap everyone before the exit appears on that stage. Now, what is interesting about this formula is that the random sequence of areas provides players with the opportunity to acquire a ton of items, weapons and brand new soldiers in the field.  Unlike the first title, Portable Ops Plus now allows you to acquire up to 200 soldiers for your army, including porting over any soldiers from the original game.  This expanded force can be allocated to one of four different divisions.  The medical unit helps develop restorative items, while the technical corps develops new gear, weapons and ammunition.  Spies provide you with additional information on maps, enemies and other details for your squads.  Finally, your four man (or woman) sneaking teams enter the battlefield and accomplish objectives.  While the medical, technical and spy corps are still limited to having eight members on their staff (which forces you to discover the best people for the job and use them), the sneaking squads have been expanded from four to eight, allowing you to field a lot more people on a regular basis.   This is important because every team that goes on a mission in Infinity Mission Mode receives experience which can be used to expand your player's skills.  That means that the initial stats for weapon accuracy, stamina and health can be strengthened over the course of multiple missions, turning your troops into much better soldiers.  While this is a definite advantage to improving your forces, this creates a number of issues.  First of all, Metal Gear isn't an RPG and it's not about power leveling, which you'll inevitably perform as you go through the various mission difficulty settings.  Unfortunately, as you go through these stages over and over again and acquire stronger and stronger soldiers, your skills will start to eclipse that of the computer generated troops, which doesn't make it fun to play.  Also, if you've played the original game, you can take many of the unique characters and make them incredibly powerful, to the point where a squad of these maxed out warriors will wipe out just about any other force they go against.  Obviously, this also winds up unbalancing the online play, because someone who's invested a ridiculous amount of time in offline play for both games will probably wind up wiping the floor with someone else that's skilled with the title, but simply chooses to play here and there.  Granted, this is something that can be balanced out with your own deep investment into the game, but considering that one of the primary features of multiplayer is the ability to permanently lose your characters to another player, how many players want to really risk walking into this slanted minefield from the get go?   A trio of trouble. That isn't to say that the multiplayer isn't particularly deep - far from it.  Portable Ops Plus provides both ad hoc and infrastructure play in two different flavors: one from the original game and one for the expansion pack, which lets you access a number of new maps as well as some new online features.  A few of these are relatively minor, such as new saluting animations and the ability to take snapshots of in-game matches.  Other features are much more significant, such as the inclusion of a beginner lobby for newcomers to the franchise, along with a brand new chat room and a game mode called Shooting Range.  This mode forces you to shoot as many targets as possible before time runs out, turning those targets your team's color in the process.    However, there is one large issue that winds up popping up within the Shooting Range mode that we stumbled upon when we were playing the game: there is no ammo placed on any Shooting Range map.  Since you can't melee attack a target to gain points, you'll find yourself flying through clips of ammo as you run around stages attacking enemies or shooting these objectives. So if you want to deploy a team into the field to play this game, your soldiers had better be packing a ton of ammo and a steady weapon, particularly if the round is set for anything more than one minute (and even that feels a bit too long.)  As a result, you'll probably find yourself avoiding this mode in favor of the solo or team deathmatch or capture mission modes.   Shooting Range: good idea, poor execution. Speaking of avoiding things, Portable Ops Plus also eliminates some of the enjoyable features that made Portable Ops so impressive.  If you imported the GPS peripheral, you were able to walk around and acquire soldiers based on GPS coordinates.  That is no longer included in Portable Ops Plus.  Similarly, players could walk or war drive around and collect soldiers from wireless signals via the AP Scan feature, which give users a signal boosting mini-game to augment their chances of collecting a potentially unique character.  What made this feature is that you'd automatically gain a soldier if you found or boosted a strong enough signal.  Portable Ops Plus ruins this with arbitrary decisions made on the part of this prospective recruit, as they now evaluate your team and determine whether or not they like the skills or job traits found on a particular sneaking team. If they do, they join up, but if they don't, they provide a cryptic statement as to why they don't want to enlist.  The biggest problem is that they don't inform you of which member is pushing them away from your forces, so you can change up your team line up or even send new teams to recruit this character and they still aren't guaranteed of joining you.  Why this was broken when it was perfectly fine is beyond me.   Visually, Portable Ops Plus is identical to Portable Ops, since it uses the same Subsistence engine.  That means a lot of large, detailed characters, console identical animations and other features.  It also means that the visual issues, such as the textural tearing, slowdown and other visual issues still hampers the presentation of the game.  While we didn't expect this to be fixed (especially since the overall focus was more on creating multiplayer maps), it's one of those things that you do wish would be fixed if there ever is a true Portable Ops 2.   Not even Metal Gear can help this one... With voice acting playing no role within the game, you're forced to rely upon the exact same soundtrack and sound effects that came from Portable Ops.  This isn't a bad thing once again, since Hibino and Honda's songs are carried over without fail and the sound effects are still particularly top notch.  However, the missing voice acting really does subtract from the overall Metal Gear experience.  In fact, you'll find yourself wishing that there was a plot simply to have David Hayter and cast chime in with some commentary as you're boosting your squad.Sure, it may be twenty dollars, but unless you're a hardcore Metal Gear Solid fan, you're not really gaining much with this lackluster expansion pack, which loses more than it gains.  In fact, the title could've been handled better as a downloadable patch or update to the game file instead of a standalone that doesn't really improve on the formula. No story, unbalanced multiplayer and hampered recruiting mechanics all combine to make this a disappointing addition to one of the best games from last year.", "date": "Nov 16, 2007"}