{"name": "American Gangster: The Mobile Game", "name_review": "American Gangster Review", "ref": "https://www.ign.com/articles/2007/11/16/american-gangster-review", "text": "Grand Theft Auto has be one of the most influential (read: copied) games since Doom. Every publisher is looking to cash in on gamers wanting to freely roam around a city while stealing cars and shooting people. Even though it's been done to death, it's not going to go away. American Gangster is the latest in a long line of clones, but it still manages to keep your interest when you need a quick fix of illegal activity.   Loosely following the film you control both Frank Lucas, the infamous drug lord of Harlem and Richie Roberts, the cop bent on taking him down. The game is made up of small missions that you complete in order to advance the storyline. Unlike the open ended-ness (did I invent a new word?) of GTA, American Gangster is a very linear game. You can certainly run around the city shooting people and stealing cars, but there's no point to it. Cops will never chase you even if you run over every citizen in the city and crash your car into an entire patrol of police vehicles. I'm actually a fan of Point A to Point B games so this didn't bother me too much.   The missions range from arresting people to killing your competition depending on who you're playing as at the moment. Most of the game has you playing the role of Richie, so you spend most of your time gathering clues scattered around the city or trying to arrest certain people that have connections to Frank. Some of the missions make zero sense like the clue hunting missions. You basically just drive around the city looking for the Clue icons and walk over them. What these clues mean, I'm not sure. You're just told to collect clues. Collect the required amount of clues and you head back to the police station and start your next mission. If you want to arrest someone, you shoot them first, then walk up and press the 5 key to arrest them. You can arrest pretty much anyone you want, but I never saw what the rewards were for doing so unless it had something to do with your mission. Completing your mission earns you cash which is only useful to have two times in the game. Once when you buy Frank a new suit and the other when you purchase explosives. If there was an upgrade shop somewhere in the small city of Harlem, I never found it. Even if it did exist, you find machine gun and shotgun icons littered throughout the city, so there's really no need for monetary rewards when you can't do anything with the money.   Driving is a large part of the game. You can steal or acquire any vehicle you come across as long as it's slowed down long enough for you to press 0 and get in. There are two driving modes, basic and expert, but I'm not sure what basic did since I kept mine on expert mode. Expert mode consisted of using your direction pad to move forward/backwards and left/right. Perhaps basic mode drove the car for you. Cars range from ambulances to sports cars but there's really no difference in their performance sans speed. You can smash into any vehicle and push it out of the way no matter what you're driving so the choice is up to you on what you feel like driving.   There are two mini games that help to break up the monotony of your missions. They don't make any contextual sense but they at least offer a bit of variety. If you want to influence someone into being loyal to you, you play a game of Simon, repeating colors shown to you in the correct order. As you get deeper into your missions, this mini game will re-appear, but take longer to complete. The other mini game is a search word puzzle. You have to find words hidden in a box of letters. They can be spelled out forward, backwards or diagonal. You have a time limit, so this game is a tad harder than the memorization one. The word search game is Richie's test he has to take to get promoted to Detective status and only appears once.   The graphics are in the vein of GTA 1. Almost everyone looks the same and there appear to be about four or five different character models used. The cars look nice but in scope, seem too big for the scale of the city. As Richie, you're able to take any police car you want, but if you don't take the one the arrow points to at the beginning of certain missions, the next part of the mission won't start. Like I said, this is the most linear open ended game I've ever played. You can turn on the sound, but there's no need to unless you like to hear people scream when you run them over. Once you finish the game you have the option of playing just the alternate ending with Frank which was fun to see. Despite that, I don't see why you'd want to play this over again once the end credits roll.  American Gangster has a lot of potential, and if they worked out the small kinks and mission repetitiveness they could have had a nice pocket GTA clone on their hands. I'd like to see a bit more creativity when it comes to games like this, but at least things moved along at a fast pace and I got to run over people. Guess you can't ask for much more than that.", "date": "Nov 16, 2007"}