{"name": "Uncharted", "name_review": "Uncharted: Drake's Fortune UK Review", "ref": "https://www.ign.com/articles/2007/11/19/uncharted-drakes-fortune-uk-review", "text": "It says a lot about Uncharted Drake's Fortune that the thing most often used in solving puzzles isn't the hero's wit or athleticism but the explosive barrel. Whenever you're stuck or trapped, that anomaly of gaming is always present, stacked conveniently against a locked doorway or resting upon a crumbling pillar, just waiting for a stray bullet to clear the path ahead. Now we're not claiming that Uncharted is a dumb game, but subtlety and finesse aren't its greatest concerns. This is all about old fashioned, ripping yarn entertainment made to look cutting edge thanks to the beef under PS3's bonnet.   Nathan can carry two weapons at one time  one pistol type and one rifle.  This wholesome, Boy's Own feeling is established from the start as we're introduced to Nathan Drake, a lantern-jawed, wise-cracking young buck who's a sort of Gap-sponsored Indiana Jones on the hunt for the lost treasure of his ancestor Sir Francis Drake. Aiding him on his quest is feisty young reporter Elena, adding a bit of sexual tension, and Nathan's long-time friend Sully, bringing badinage as well as plenty of unwanted attention from a band of pirates working for some very bad men indeed. So begins a race through crumbling South American ruins to discover fortune and glory.   With its treasure hunting, tropical setting and third-person presentation, Uncharted will draw many comparisons with Tomb Raider. However, you'll soon discover that most similarities are merely cosmetic, with the two games having very different agendas. While Tomb Raider encourages exploration with intricate platforming and puzzles that require care and attention, Uncharted would rather you shoot first and think later. Better still, don't think at all. And with an endless stream of pirates to deal with and incredibly linear platform elements bordering on the perfunctory, this is a primarily a shoot-'em-up.   Fortunately for everyone, combat is extremely satisfying, with a near-perfect balance between how much damage Nathan can take and dish out. You don't have to empty an entire clip to take enemies down - they'll rush for cover when taking damage but can be stopped on the spot with a rally of body shots or a single headshot.   Elena takes care of herself in the shootouts.  This same praise can be applied to the game's easy-to-use cover system. Press circle next to a suitable lump of scenery and Nathan will press his body up against it to shield himself from enemy fire. L1 makes him pop out and take aim at the enemy, while a further press of circle makes him roll to the next area of cover. By combining all these moves together it's possible to weave through the ruins in a surprisingly fluid fashion, picking off opponents in short, controlled bursts. You've even the option for some fairly brutal fisticuffs, should enemies stray a little too close for comfort. The result is an intuitive, adaptable experience that ensures you look forward to each confrontation with confidence.     It's a good job too because you'll spend plenty of time knee-deep in enemy encounters throughout the course of Uncharted. It's testament to the control set-up and overall combat design that often-lengthy gun battles rarely become a chore. Admittedly, the relentless parade of pirate foes can occasionally grow tiresome, but that's largely thanks to some excellent narrative pacing which practically guarantees you'll want to reach the next glorious set-piece sooner rather than later.   The SIXAXIS is used for some balancing sections around the ruins.  Also negating any potential repetition is the fact that Uncharted is visually a simply stunning game. Naughty Dog has ditched the highly stylised art design of its fantastic Jak and Daxter series for a sumptuous photo-realistic experience. Characters are blessed with subtle and utterly convincing animations; whether reloading, swimming or hurdling over obstacles, Nathan performs every action with fluidity and grace.   Then there's the sublime attention to detail, such as the way clothes become soaked through contact with water then drip dry over the next few minutes. And this all takes place in beautifully-realised tropical setting, bursting with lush green foliage, rich textures and delicate, effective lighting. There's one moment where Nathan stares at the horizon over the forest canopy from behind a waterfall that's as stunning as anything from Tomb Raider Legend or Anniversary, making this game worthy of that expensive HD TV.   However, very little has been done with this wonderful environment and, for the amount of interaction you have with it, it might as well been pre-rendered. You see, Uncharted is as linear as a ladder. Even platform sections are simply clearly-marked pathways through the scenery. There's never a moment where you're left wondering what to do or feel the need to experiment with Nathan's move set. Indeed, there's absolutely no danger of you becoming stuck because the game continually prompts your progression with hints if you haven't made any progression in the last minute.    Nathan can rush enemies and take them out with a barrage of quick punches.  Uncharted promises a lot with its sweeping vistas and beautifully-rounded characters but ultimately delivers a surprisingly conventional action game that refuses to deviate from its relatively unadventurous ambitions. Even the vehicle sections simply reaffirm the notion that Uncharted is merely a joyride designed to drag you through to its conclusion before you realise there's barely an ounce of fat on its flimsy - if gorgeous - frame. That said, it's a hell of a ride all the same, with such an incredibly taught sense of pace, panache and heart it's hard to dwell too much on Uncharted's love of style over substance.How much you enjoy Uncharted will probably depend on what expectations you bring. If you're looking for an intelligent rival to Tomb Raider you'll be disappointed. If it's nine hours of giddying high-def, Hollywood-style entertainment you want, Uncharted more than fits the bill. Sure, we're still waiting for Sony's PS3 to offer some serious depth to its high-gloss exclusives but, if you're looking for reckless, rollercoaster adventure as the cold nights draw in, we know exactly where X marks the spot.", "date": "Nov 19, 2007"}