{"name": "Mass Effect", "name_review": "Mass Effect Review", "ref": "https://www.ign.com/articles/2007/11/19/mass-effect-review-2", "text": "BioWare endeared itself to Xbox owners the world over when it unleashed Star Wars: Knights of the Old Republic. It not only filled a void in the Xbox library with an RPG, Knights of the Old Republic did so with style. The follow-up, Jade Empire, solidified BioWare as the preeminent RPG developer on Microsoft's big, black box. Needless to say, expectations have been high for Mass Effect, the studio's first Xbox 360 release. After playing through the game more than once, we can say with confidence that Mass Effect delivers on those expectations. The ride may get a bit bumpy at times, but it's one you don't want to miss.The game begins with the creation of your Commander Shepard. You're free to go with the model that has been used in all of the marketing, or you can make your own; male or female and with a variety of background and visual options. The decisions you make here have a substantial bearing on the game itself. Some people you meet in the game will deliver different dialogue if you're playing as a woman. Which background options you choose for your character will also shape the way people talk to you throughout the course of the game. The most important decision you'll make will be which character class to start with.There are three primary character classes in Mass Effect; the solider, the engineer, and the biotic user. Hybrids that mix various aspects of each are also available. The kicker is that they all play vastly different from one another in combat. Based on your class, you'll have access to various powers (the biotics have more than a passing resemblance to the force powers you used in Knights of the Old Republic), technical skills, weapons and armor. The biotic class can use every power, but can only use light armor and pistols. The soldier only gets a single biotic power, but can use any weapon and heavier armor. The engineer, an afterthought class in many other games, steps up in Mass Effect to be a force of its own. He or she can hack locked consoles for info or loot, but can also be a powerhouse in battle. Many of the enemies in Mass Effect are mechanical in design and the engineer has skills geared specifically for taking them down.When we say the classes play differently, we mean it. Having played through the game first as an adept (full biotic user) and then as a soldier, we found the combat was a whole new ball game the second time around. Though the game looks like a standard shooter, it's an RPG through and through. Choosing how to equip yourself and your party with weapons and upgrades and when to use your powers is of the utmost importance. Once you do get into the flow, you'll find that the system can be a lot of fun and allows for substantial variety in the way you play.The combat takes a few hours to wrap your head around. Until you do, you'll want to save your progress after every battle. There's an autosave system in Mass Effect, but it isn't very effective. Nor are the almost non-existent tutorials. You'll probably find yourself dying quite often before you get into the swing of using cover effectively and making proper use of your powers.Perhaps the most disappointing part of Mass Effect is the method used for doling out commands to your party members. If you want, you can have full control over when and how your allies use their powers. As far as motion goes, however, you only ever have direct control of how Commander Shepard moves while your two party members act on their own, with questionable AI. You can give directives to the two, such as to find cover or to move to a specific point, but not individually. Both squad members act on one command. It's so rudimentary that it makes the entire concept feel rather pointless.Not the friendliest of faces. It goes a step further with the way powers and skills are activated. Adepts and engineers rely on them, but even a soldier class character will make use of their skills to stay alive. Use overkill just once with a shotgun and you'll be hooked. It's unbelievably awesome. To do so, unfortunately, requires you to pause the game momentarily. Only a single power can be hotlinked to a button. The rest are called up with the Power Wheel, which is activated by holding down the right bumper. From there, you can use powers of your own or command allies to use specific ones they possess. The catch is that you can't queue up commands. Unless you want to pause the game every other second during fights, you'll probably set the AI allies to use the powers on their own volition and just ignore them through the majority of the game -- much the same as you will with their squad commands.It doesn't help that the artificial intelligence in Mass Effect can be less than stellar at times. Your squad mates are quite often no more useful than cannon fodder to draw the enemy away from you. But then, the same could be said about the opposition. The game can still be, and often is, tough in spite of the idiosyncrasies of the enemies, but it certainly doesn't make the target very believable when it occasionally behaves like a moron.Even with the combat issues, Mass Effect will surely grow on you over time. Once you've unlocked a good number of powers and know how to work within the system, you'll find the combat has its charms. It never approaches the fluidity of the top tier shooters, but it blows most of the RPG competition out of the water.And in the end this is an RPG, not a squad-based shooter. The world and gameplay outside of the combat is arguably more important to the overall quality of the game. In this regard, Mass Effect is as good as they come.Mass Effect presents a new take on the morality system that has become BioWare's staple. Rather than offering good or evil options, Mass Effect takes the position that everything you do is justifiably good in some way. You are, after all, on a mission to save the galaxy from utter destruction. Whether you will be Machiavellian in your actions or take the high road is your choice, but you'll also have to live with the consequences. The choices you make have an immediate and direct impact on the game itself. It's not just for show -- how you behave will change the way quests are completed, create or avoid fights, and shape the way people view your character. Humanity is a newcomer to the galactic community and you are seen as an ambassador of sorts, and the game never lets you forget this.The squad commands could have been implemented better. The two sides of the coin are called paragon and renegade. Both will get the job done. The question, though, is at what cost? Are you willing to sacrifice lives to achieve your goals? Be careful how you answer that question. Mass Effect can be so brutal at times that it will leave you slack jawed -- stunned that a game can hit you at your very core. The decisions aren't always cut and dry. The line between doing the right thing and going too far gets blurry at times and smudged out of existence at others.Though you are faced with many tough decisions with the paragon and renegade system, few of your actions appear to affect anything in the long term. In KOTOR, you had one decision to gas a planet to make finishing a quest easier. Doing this, however, raised the price of medkits for the remainder of the game (since you just gassed the plants used for medicine throughout the galaxy). That same level of cause and effect seems fairly absent in Mass Effect.The only skills associated with the morality system are charm and intimidate, which simply open new conversation options (admittedly, there are a few places in the game where this is important). However, this isn't a Knights of the Old Republic type game where you'll be awarded new powers based on your alignment. Combat doesn't change for good cop or bad cop. Likewise, the overall story doesn't change based on how full your paragon or renegade meters are either.The RPG elements are fantastic. By presenting players with tough, sometimes impossible choices, BioWare has woven a series of small climaxes into the narrative of Mass Effect. Scratch that. They are by no means small. The story arcs are as powerful as they are well constructed. It's difficult to go into specifics without ruining the experience, so we won't. We'll just say that this is a game that has to be played more than once so that you can see the different ways each scenario can play out.The fantastic storytelling doesn't end with the main quest. Roughly 15 hours of side quests and exploration are woven into the game with an expertise that makes them virtually impossible to ignore. The same level of quality in voice acting and character development carries over into the side quests. These ancillary characters feel exponentially more real as they plead for your assistance with soft, beaten eyes.Let's not overlook the power of the spoken word. Every conversation in Mass Effect is voiced over and done so incredibly well. Shepard speaks every line, too. Since you can play as a guy or girl, that means multiple lines of voice work for every scenario. It's one of the big reasons Mass Effect is so engrossing.It's easy to ignore a paragraph of text asking you to fetch a random item, which is what most RPGs offer. Try passing up the offer to take up a quest when you have a voice filled with inflection asking for your assistance. Not just a voice; a being with real motivations that you can converse with, learn more about, and ultimately relate to. The voice acting is good, but the writing is even better. To think that this level of detail was put into some characters that you may never even interact with is mind-boggling.Of course, the characters you're sure to interact with have the most depth. Passing up the option to speak with your party members on board the Normandy in between quests would be a great mistake. Doing so reveals sordid pasts, hidden bias and can even result in a spark of love flaring up into a whole lot more. Talk with them enough and they may even open up to you in ways that give you new quests to partake in. These humans and aliens aren't just there to help you in a fight. They're there to help you make sense of the galaxy.It's a good thing that such care was put into the quests and characters, because some of the exploration elements in Mass Effect aren't as fleshed out. Each of the planets you travel to as part of the main quest is fully realized with city centers to explore, NPCs to interact with, and intriguing missions. Not so for the uncharted planets tied to a number of side quests.When you first gain control of the Normandy, an interstellar spaceship and the base of your operations, there are only a few star clusters and accompanying systems to visit and explore. More become open as you learn of them through info gleaned from the world or given to you with quest instructions. Through the use of a wonderfully designed galactic map, you can travel from system to system and have a look at various planets and satellites. Most can only be observed from afar and read about from text box briefings. Others can be scanned, awarding the player with some info or a reward to help you fulfill one of the numerous fetch quests. A small minority of the stellar objects can be landed on.Will you be a nice guy or a huge jerk? Each place you can land on follows the same general pattern. The explorable area is a barren wasteland of craggy rocks and mountains. Sometimes it's snowing or covered in a green skin to indicate the presence of life, but its still just colored rocks. Pulling up the map will show you a handful of points of interest and there usually will be at least one ~dungeon~ to access where the meat of a side quest takes place (usually combat). There are a few things, such as mineral deposits to scan towards completion of a side quest, that aren't always on the map but we never came across anything significant. Rinse and repeat the process and you have the bulk of your ~exploration.~ It would probably end up being more of a chore than fun if it weren't for the Mako, your cannon equipped buggy that you use to cruise around the barren surfaces. Talk about riding in style. Just driving it and bouncing around is enjoyable.Part of what makes the characters and story telling in Mass Effect so powerful is the excellent visual direction. Take a look at any screenshot or trailer and you can see the level of quality and detail put into the world. The character and alien design is fantastic and original, yet familiar to anyone who loves classic sci-fi cinema. From the morose sounding elcor to the oversexed, unisex, blue asari, these are all wonderful creations. None approach the classic HK-47 from Knights of the Old Republic, but then again, which game has characters that do?Speaking of classic sci-fi, much of Mass Effect plays like a nod to the goofy science fiction movies of the '70s and '80s. There's a grain filter that can be turned on or off to make the game look more like an aging film. The music, too, draws heavily from this era with liberal use of synthesizers to fill out the audio. We had flashbacks to The Terminator every time we died and a droning synth came on to accompany a red filter.The biggest triumph with the cinematic direction is the camera and animation work. Conversations are lip-synced incredibly well and they make use of camera cuts and angles that do wonders towards immersing the player in the experience. It's made even better through the way you input your responses in conversations. Your only job is to pick from a series of gut feelings. It's all done quickly and pain free with a dialogue wheel that pops up on the bottom of the screen. Once you've made your decision, Commander Shepard turns your feeling into complete thoughts. This concept is one of the great successes of Mass Effect. After playing the game, you'll have trouble going back to any RPG that puts static pictures and text on the screen to help tell the story.Classic sci-fi from start to finish. All of this success doesn't come without a cost. The framerate in Mass Effect is as erratic as they come. This isn't something that happens occasionally. It happens incessantly. The game also has issues loading textures in when you enter a new environment. Flat, boring scenery gets filled in with details piece by piece for a few moments each time you load in.We would be remiss if we didn't mention Mass Effect's numerous bugs and glitches. Clipping through the scenery is a regular occurrence, particularly when you make use of the singularity biotic. Shepard has a displeasing tendency to get stuck in objects, sometimes in the midst of battle. It happens to NPCs as well -- it isn't nearly as frustrating but it does kill your sense of immersion when an enemy ~phases~ through a wall. On occasion, the game stopped registering our button presses. Rarely, Mass Effect even went the whole nine yards and locked up. All of these bugs can be wiped away with a reset, but boy if they aren't annoying.We wouldn't be surprised at all if Mass Effect saw a series of auto-updates for Xbox Live members to fix some of these issues, but that really isn't any excuse for shipping a product with this many bugs.In a year that has seen the Xbox 360 library finally round itself out with a series of quality Japanese RPGs, BioWare has shown just how far ahead of the curve it is with Mass Effect. The cinematic design is nothing short of masterful. This is a game that takes the aspects of film that make cinema so compelling and crosses it with the interactivity of games with unprecedented success. Linear storytelling feels quaint by comparison.Mass Effect is game that is greater than the sum of its parts. Technical issues abound, but the majority of Mass Effect is so expertly delivered that it can transcend its weaknesses. Applying number ratings to a game like this doesn't do it justice because there is no way you can ignore its technical flaws. Simply put, Mass Effect is a game that must be played. Then it must be played again. Don't pass this one up.", "date": "Nov 19, 2007"}