{"name": "High Velocity Bowling", "name_review": "High Velocity Bowling Review", "ref": "https://www.ign.com/articles/2007/11/20/high-velocity-bowling-review", "text": "Oh, hey, look a bowling game on the PS3 that uses the controller as if you were actually hurling a 13 pounder down a lane. I can already hear the ~Hurrrr, Sony copies Nintendo again!~ comments. About the only thing High Velocity Bowling and the little bowling part of Wii Sports have in common is the fact that they both involve knocking pins over with a ball and that they both use an underhand pitching motion to do it.    Everything else, from graphics to gameplay to characters is entirely different, and though one could make a case that Sony is missing the reason why the bowling game is so popular on the Wii (hint: it's insanely simple), the effort put into HVB by Team Ramrod down at SCEA's San Diego studio actually pays off in a game that's surprisingly deep (at least for a downloadable title).   OVER THE LINE! Therein lies the biggest different between HVB's nearest comparison. You've got six players to unlock (each with their own skills), plus a handful of funky new bowling ball designs and matching alleys for each character to add to the roster. Actually unlocking the players is as easy as beating them in a one-on-one game -- Hot Shots Golf-style -- but unlocking custom bowling balls and adding stuff like alternate costumes actually takes a little more effort (coming out ahead with the top cumulative score over three games or completing custom challenges using props like ramps and chairs, respectively).    The actual process of virtually hucking a ball toward those 10 little pins is deceptively simple. Using the motion sensor, you twist your wrist to set starting position, then to determine the angle, cock back your hand and then swing away. Once you're into a game, technically only the X Button to confirm and L2/R2 triggers for spin are used (if you switch to a left-handed configuration, the controls are mirrored, meaning down on the d-pad confirms and the same shoulders handle spin). Not only does this have you holding the controller fairly close to the same way you'd hold a bowling ball, it boils throws down to a two-press affair.   The challenge is in consistently hitting the sweet spot. It's fairly easy to pick your angles and pretend to throw the ball, but nailing the perfect angle for consistent strikes isn't. The early characters lack solid enough stats to really lock down one of those sweet looking hooks that takes the ball from the edge of the gutter right into the pocket for a strike, so there's definite incentive to unlock the later characters. Throw in the challenges that test your ability to curl the ball around -- through or over obstructions -- and you have a rather pleasant amount of depth  until you've unlocked everything.    Pfft. Nice score. Online play would have been nice, although leaderboards are a nice gesture, but something tells me HVB will either play some part in Home when it finally gets released (there's an option to buy new characters on the main menu), or it's being kept intentionally slim so as to keep from encroaching too much. The character models in the game and indeed the overall style itself seems like a pretty natural fit for the Home characters, but obviously, I'm just playing what if.    One other little incentive to pick up the game: custom soundtracks. Though it doesn't yet support the fancy new playlists that were finally added with the 2.0 firmware update, all you have to do to load up your own tunes is tap the Select Button and pick a folder. Just like the XMB, you can sort by any of the stored info for your music, including title, artist, genre, year and so on. Tapping L1 or R1 will cycle you through the tracks, and you can set options for shuffle and repeat in a matter of seconds. Nothing beats sipping a White Russian while The Big Lebowski soundtrack plays in the background.Though High Velocity Bowling is a little short on overall content (and no, offering to let us buy more characters isn't really what we had in mind), it's a fun little game to fire up and play with friends. Sure, the basic idea is similar to stuff on other consoles, but the execution is definitely unique enough that both games can happily co-exist. Online head-to-head play would have been nice, but overall, HVB is surprisingly decent.", "date": "Nov 20, 2007"}