{"name": "Time Crisis 4", "name_review": "Time Crisis 4 Review", "ref": "https://www.ign.com/articles/2007/11/20/time-crisis-4-review", "text": "While other developers walked or ran away from the light gun genre, Namco Bandai has continually pumped out solid arcade shooting experiences for fans at home. With the Point Blank and Time Crisis series, players have blasted, sniped and exploded targets across two different Sony systems. The latest shooter released from Namco Bandai is Time Crisis 4, a port of the arcade game.  However, much more than a simple quarter muncher with a few stages to complete, Time Crisis 4 has a ton of exclusive game modes and features that makes the title very enjoyable to play.   The primary mode of the game, obviously, is the arcade mode, which features a generic action premise supported by a lot of fast-paced action.  One or two players can choose to be either Giorgio Bruno or Evan Bernard, members of the V.S.S.E., a global taskforce.  Dispatched to California, Giorgio and Evan are sent to stop a terrorist organization known as W.O.L.F. from getting its hands on a mysterious new biological weapon known as Terror Bites.  These creatures have the potential to destroy just about anything in their patch, and in the hands of these thugs, the entire planet is being held hostage.  It's up to you to shoot your way through the W.O.L.F. troops, eliminate the Terror Bites and save the world.     To help you in your mission, you have the ability to switch between a handgun, machine gun, shotgun and grenade launcher to destroy enemies and targets.  While you'll run out of ammunition quickly if you rely upon one weapon (with the exception of the handgun, which has unlimited rounds), you can replenish your gear by repeatedly shooting enemies dressed in yellow uniforms.  However, this can sometimes be a tricky task, as they are frequently surrounded or guarded by enemies that perform one of four different attack patterns, including bull rush charges with melee weapons and throwing items.  Fortunately, players also can take cover at will, avoiding the impact of most attacks while reloading their weapon at the same time.  Balancing your attacks with your need to seek cover and replenish your clips is a key tactic to surviving the arcade mode and helping to save the world.  In fact, you'll frequently need to take advantage of this move during the helicopter sections, where your only defense (apart from good accuracy) is to dodge behind a metallic shield.  You'll also find yourself taking on different level challenges known as multi-screen battles, where you'll need to rotate between different screens to see and repel incoming threats to barricades.  There is one thing that players will have to get accustomed to, however, which is that the firing lines and camera angles within the Arcade mode can suck at times, with some of your characters moving right in your line of fire in the middle of a battle.   Initially, it may seem like the game is based around surviving a large amount of gunfire that's being aimed in your direction, but it's much more involved.  Each section of the game is timed, and players have to eliminate all of the enemies on screen before time runs out to move forward or lose a life.  Accurate shooting, along with hitting a target multiple times and clearing an area quickly adds to your bonuses, which increases your score. Depending on the section of the game, you may also be presented with different bonus opportunities to quickly take enemies out with a weapon they are particularly susceptible to, thanks to what's called a ~Best Weapon~ moment. Not only do you gain bonus points for killing opponents with these guns, you can sometimes acquire additional ammunition for taking advantage of this weakness for your targets. What is a creative twist on the Arcade game is that you initially start with only three continues, which you'll quickly blow through until you get accustomed to the different threats and where enemies may wind up attacking from.  As you get better, you'll acquire more and more continues to make your way through the rest of the game, which can be fully completed in about an hour.  This is both a boon and a disadvantage.  What's nice is that you can unlock a number of different adjustments to the game, and you can take on the same experience with harder difficulty levels to extend the experience.  On the other hand, it is a very short experience to play through, and once you've got the hang of it, you can actually blast your way through enemies without losing a continue for multiple areas.     Terrorists step up to get shot down. Fortunately, the Complete Mission mode has been included to alleviate this issue.  Filling in the gaps of the story between each arcade stage, the Complete Mission mode includes first person shooter elements along with the standard areas and gameplay from the Arcade Mode.  The single player experience lets you take on the role of Captain William Rush, a special operative from the Army who's initially sent out to contain and eliminate the Terror Bite threat and finds his paths crossing with the two V.S.S.E. agents.  Rush is essentially a one man army, packing everything from grenades and machine guns to knives and ultrasonic pulse devices to eliminate Terror Bite infestations.  Unlike the Arcade mode, players will find themselves using every button on the GunCon to jump barricades, take over fixed turrets and perform other actions in the middle of a mission.  What's more, instead of simply moving on a rail from one location to another, players will have control over their character, exploring environments, collecting protective items like bulletproof vests and accomplishing objectives.    Set in rather large environments with a number of goals to take advantage of, the FPS sections of Complete Mission mode are surprisingly long: one stage can take you up to half an hour to fully navigate safely and eliminate opposing forces in your way.  This isn't without its odd quirks - for instance, players will experience some slowdown during these segments, particularly when you're being assaulted by large numbers of Terror Bites on screen at once.  Another oddity is the fact that Rush will regenerate health if he stands still in the middle of battle (though he can still fire guns as long as he's not moving).  While this can be particularly useful in the middle of some hectic attacks, it's odd to see this ~Halo~-esque feature being included in the game without any explanation as to why Rush has this ability.  This is further complicated by the fact that many areas have a ton of health kits lying around, so you wonder just why you need the ability if you happen to have a decent aim and manage to get behind cover.   Outside of the Arcade and Complete Mission Modes, Time Crisis 4 also features a number of diversionary elements in the form of Crisis Missions and shooting gallery mini-games.  The single player Crisis Missions can only be unlocked after you've completed the Arcade and Complete Missions, and provide a couple of quick tasks in environments taken from the earlier modes.  Most of these are based on quick reaction or accuracy tests of randomly placed marks, such as hitting a specific enemy scattered throughout a field of similarly dressed targets, or eliminating more than forty enemies in less than a minute.  Successfully accomplishing these tasks unlocks even more elements for the crisis mission, which further adds to the replayability of the game. The same can be said for the 18 mini-games for one or two players, which task you with eliminating a set number of targets within a specific amount of time.  You're not allowed to shoot rival colors or skulls and crossbones without failing the mini-game, but you get points for your accuracy, time and number of objects that you hit during the exercise.     Now, one thing you will have to get accustomed to is the brand new GunCon 3 peripheral, which is the main way of interacting with the game. Packing two analog sticks and six buttons (eight if you consider pushing in on the sticks), this is the most complex gun peripheral for the series ever made.  There are a few moments where this can sometimes get in the way of your play.  For instance, some of the buttons on the GunCon can get a bit sticky and will need to be broken in to respond the way you need them to in the middle of an arcade or FPS battle.  Another issue that you'll run into is the new light gun LED calibration system, which can sometimes be touchy even once you've calibrated the system.  I don't mean that you won't be able to play the game, but since it appears to focus primarily upon the depth and angle that you happen to be sitting at when you're playing the game, an adjustment of a few inches as you aim at different threats can affect the hit or miss response, as well as the speed of your reticle tracking and moving across the screen.   It's also a bit strange that the GunCon 3 controller doesn't feature any Bluetooth support considering that it's been released only on the PS3.  Instead, you're tethered to the PS3 via a USB cable, which can sometimes be odd when it comes to adjusting your aim to the perfect range for the peripheral.  Perhaps its because the response needed for the gun's action wasn't fast enough via Bluetooth, but considering that the Sixaxis isn't shackled to the system (apart from charging), this seems like a strange feature.  Speaking of the Sixaxis, you can play the game with the controller, although you will find a few tweaks.  It's somewhat easier to aim and fire at targets (especially during sniping shots) because the game does force a reticle on-screen as opposed to the GunCon, which only features this during FPS mode.  However, the speed of firing off shots is much slower than pulling the trigger on the Guncon. Left handed players will also have to learn to adjust to the fact that the molded plastic of the controller doesn't allow you to shift the movement analog stick and other buttons to the other side of the peripheral.  Sure, you can remap the buttons to change movement and camera controls, but it might not feel as comfortable in the hands of some southpaws.   I told you not to park in my space! While the environments of Time Crisis 4 are pretty diverse thanks to the action that takes place in the Arcade and Complete Mission Modes, they're not really pushing the bounds of the PS3.  However, character models are large and nicely detailed, and it's pretty easy to distinguish between the different kinds of Terror Bites when they appear or leap onto the screen to drain the life from your characters.  It's also easy to distinguish the varying effects between different weapons when fired, particularly with the shotgun and grenade launcher.  As I said earlier, you will experience some slowdown within the FPS elements, although you can cut down on the wait to load levels and navigate through the game by installing a portion of it to your hard drive.   The sound effects are good but somewhat limited.  The firearms have a distinctive sound based on their firing rate, but not necessarily based on the weapon themselves.  Obviously, this isn't going for exact realism, but it would be cool to hear certain weapons with different effects associated to them.  The same can be said about the soundtrack, which is fine, but not particularly memorable.  In fact, while you can access the music files after you've unlocked enough stuff, you're probably not going to spend a lot of time with this feature. Voice acting, however, is pretty atrocious.  Then again, considering that the Time Crisis games have never been known for their voice acting, it's right in line with the rest of the series.Packed with a ton of unlockable content and a large amount of replayability, Time Crisis 4 is a fun game for any shooting fan looking to blast away with their PS3.  The FPS Complete Mission mode places a new spin on the franchise, and the Crisis Missions and mini-games only extends the title's lifespan.  While it's disappointing that the controller isn't wireless, it does its job if you can wrangle the LED sensors properly. Time Crisis 4 is an amusing title that you may want to keep an eye out for.", "date": "Nov 20, 2007"}