{"name": "Undertow", "name_review": "Undertow Review", "ref": "https://www.ign.com/articles/2007/11/20/undertow-review", "text": "If Captain Nemo fought the citizens of Atlantis, who would win? It's a question that has stumped adolescent boys for decades. We may never know the true answer, but thanks to Chair Entertainment's first Xbox Live Arcade game, we can now play that battle out over and over again in 16-player online matches. With an independent developer at the helm, Undertow may not have the name recognition or marketing hype of some other games we've seen on the service. That doesn't mean you should pass up the chance to give it a shot. This is one of the best original titles on Live Arcade.   In addition to the Atlantians and Nemo's army, you can also take up the cause of normal humans. Earth has flooded in the world of Undertow, setting the stage for the battle of the century over the rights to rule the ocean. And what a beautiful ocean it is. When the explosions are ripping through the water and the battle is at full force, Undertow looks like a disturbed young child saw The Little Mermaid and then let his imagination run wild. It's vibrant and impressive, making full use of lighting effects to mask the fact that XBLA games can't have highly detailed textures due to space constraints.   It looks even better in motion. Undertow takes place in a 2D plane, though all of the graphics are done in three dimensions. This allows the game to have a simple control scheme and an easy pick up and play feel to it, but stand out as one of the most attractive games on the Live Arcade. If you've played Geometry Wars (and if you haven't, shame on you), then you won't have any problem with the controls. One analog stick is used for movement while the other fires your weapon. The right trigger is used to dash while the left drops depth charges.    That's all you really need to know to get into the game. The primary mode in Undertow, called conquest, plays a lot like an underwater Battlefield -- the goal is to capture and hold all five bases on the map so that the opposing team has nowhere to respawn. Failing that, you'll just have to drain all of their reserves before they kill too many of yours.   The extra layer of depth comes from the four unit types each faction has. These come in the standard flavors ranging from fast and weak to slow but powerful. Each is useful in its own right. Tanks are good at weakening the lines or holding down a choke point while the sleeker units can quickly slide behind enemy lines to capture unprotected bases. You can swap between the models at bases or before you respawn and upgrade each one up to two times during battle, allowing you the option to switch strategies at a moment's notice.   The reason it all works so well is that the level design in Undertow is top notch. It's clear that a lot of care was taken to balance the stages and create clear strategy/counterstrategy options. Hidden passages, traps to set off, and multiple routes in and out of each base are all common occurrences here. There will be a few favorites -- we prefer Glacial and Tidal -- but every map is attractive in its own unique way.   Nemo's inventions are a force to be reckoned with. While Undertow is designed as a game that casual gamers can get a quick chunk of fun out of, it's plainly apparent that some people at Chair are hardcore gamers. There's a System Link mode, options for including bots to round out an empty game and a solid lobby that allows you to keep playing with the same crew for hours, tweaking options between rounds without breaking up the party.   Undertow was clearly designed as a multiplayer, online game but the campaign is worth taking a look at as well. Spread across 15 stages that tell the story of the three initial factions, it's a brief but surprisingly enjoyable experience. When we first kicked off the campaign, which can be played co-operatively if you like, we assumed it would play a lot like the multiplayer game only lacking human teammates and opponents. For the most part, it does, but that's not all you get. Simple boss fights, a fun story, and a few surprises keep things interesting the whole way through.Undertow is a perfect fit for the Xbox Live Arcade. It's fast, fun, attractive and can support 16 players online. The concept is distilled down to the basics, letting the idea and its execution speak for themselves. At 800 Microsoft Points ($10 USD), this is a game that offers enough fun to support the price tag. Grab a few friends and dive in, the water's fine.", "date": "Nov 20, 2007"}