{"name": "America's Army: True Soldiers", "name_review": "America's Army: True Soldiers Review", "ref": "https://www.ign.com/articles/2007/11/20/americas-army-true-soldiers-review", "text": "In this job there are very few moments when the thought, ~Man, I wish I had a different life~ enter one's head. America's Army: True Soldiers is one of the rarest of games that fosters such a notion. It's a game that's so bad it makes me wish that IGN didn't have a hard and fast rule governing the use of expletives. Given the opportunity, this review would have been filled with f-bombs, s-words, and plenty of creative combinations of human body parts and sharp objects that would be followed by more f-bombs and s-words. The game is just that bad.    And now, on to our review.   First, with the good (don't worry, this won't take long): America's Army allows players to meld their own soldier... to an extent. You start with the shell of a recruit and then craft him by assigning attribute points that you've earned into five different categories such as marksmanship, physical training, fortitude, medic, and valor. You'll notice an obvious increase in skill and combat proficiency as you progress, but that's just assuming that you have the intestinal resilience to make it through some of the single- or multiplayer games.   Not nearly as fun as it looks. When you first pop in the game you'll be greeted with three core modes. There's basic training, war games, and multiplayer. Basic training is what you'd expect, just blast through each of the different weapons in the game to get a feel for them. But throughout the nine separate missions I couldn't help but wonder why the levels weren't consolidated into one lengthy training course. The fact that you have to hop in and out of menus and loading screens feels outdated and, to be frank, a complete waste of time.   Once you're well versed in the art of gunplay and explosives, it's time to take the fight to the missions against the dreaded terrorists, right? Wrong. After you're done with the training sequences it's time for you to engage in the ~war games~ portion, meaning that you and a squad of teammates are armed with paintball guns. That's right, paintball guns. When shot, enemies won't die; instead, they'll sit on the ground, hands crossed in their laps. The sense of achievement from this is overwhelming. Only not at all.   Once you're on the battlefield (re: paintball course) another one of the downsides makes itself known. You see, America's Army is just a poor imitation of Ghost Recon: Advanced Warfighter. The badly-modeled characters are your basic soldiers with sound clips that sound like they're out of a cheesy '70s flick, and the ~mission structure~ is nothing more than a series of rally points with accompanying baddies. The real kick to the nether-regions (or at least, one of the many) is that throughout each mission you're forced to stay within a certain perimeter of your commanding officer. This wouldn't so bad if the friendly AI were actually intelligent enough to wait for you after you've cleaned up the baddies they left, but they don't. Sometimes they'll even sprint away from you making it very tough for you to keep pace, thus leading to ~failure.~ But you can just restart from one of the handy-dandy checkpoints, right? No, that would have been way too functional for America's Army.    Another frailty in the gameplay isn't so much a frailty as it is an outright bug. Namely, the horrifically designed cover system. While the rest of the game copies Ghost Recon down to the menu navigation and radial menus, it completely nixes the useful cover mechanics and relegates players to using the left bumper to toggle the lean functionality. That would have been fine had it actually worked in the slightest fraction of a bit. See, when you start leaning back and forth, things might not seem so bad. You can peak out behind cover, return to cover, peak out, return, and so on. The real problem comes when you try to move after leaning (there would be an unruly number of f-bombs inserted here) and realize that you're stuck in place for nearly three seconds before you can start going again. Your character is making the walk animation, yet you can't move. You're stuck in place like Bugs Bunny but it isn't nearly as funny.    Bring the noise. The problem grows when you realize that enemies have the dreadfully stupid habit of blindly charging in your direction. They may be behind cover to deliver well-placed suppressive fire, but if that's the case, they'll still run out and shoot at you at pointblank range. That means you'll have to attempt to break free from the confines of leaning roughly three seconds ahead of their stampede or face certain death. Try not to throw the controller across the room just yet, there's still multiplayer.   It's obvious that the game's focus was playing with others, whether locally or on Xbox Live and the offering of modes isn't as nasty as the rest of the package... but the way it plays out is just plain poor. It wasn't uncommon to play games where I would stand in one place, my team would take care of everything, and I'd reap the rewards without having fired a round (or even seen an enemy, for that matter).   The upside to multiplayer isn't just the plentiful offering of rehashed modes or the fact that you can play with up to 15 other online warriors, you also have the ability to create or join a ~unit~ (clan) of other players. You can create your own complete with a motto, unit name, message of the day, and a custom website. Adorn your unit o' death with a logo and you're good to go. Much like the customizable soldier feature, the unit dynamic is decent and would have garnered praise had the core gameplay not been such an abomination.America's Army is essentially a poorly-rehashed version of the original GRAW. Not to mention, it has the worst cover bug weve seen in awhile. Its the kind of game that makes you want to write 43 and a half pages of cuss words, slam your head on your desk 13 times and hope and pray that you dont remember having ever played it when you wake up. This game is just plain bad.", "date": "Nov 20, 2007"}