{"name": "Geometry Wars: Galaxies", "name_review": "Geometry Wars: Galaxies Review", "ref": "https://www.ign.com/articles/2007/11/21/geometry-wars-galaxies-review-2", "text": "There's been a worrying trend gamers have had to face since the start of Wii Sports fever.  Whether they intend to or not, Nintendo sets standards in everything it does, and Wii's simplistic game design can often give publishers the wrong idea on how to promote titles on the platform.  Wii Sports was extremely simple, but it was also a free packing.  Link's Crossbow Training is also extremely simple, but again comes at the price of $20 including the Zapper shell.  In the world of Wii, price vs. product is a key issue, as there needs to be a certain level of accountability when delivering simple gaming experiences at a full price.   This was instantly a concern with us when looking at Geometry Wars: Galaxies.  The game got its start as an Easter egg in Xbox's Project Gotham Racing 2, filed away as a ~retro~ arcade game in the player's garage.  It was free, amazingly addicting, and managed to create enough of a buzz to warrant a full-fledged Xbox Live game at launch with Geometry Wars: Retro Evolved.  The game's XBLA price: $5.00.  ...and it's your job to dodge that.  You can see where we're going with this one.  A free game gains a cult following, heads to a download service for very minimal cash, and grows to become one of the most downloaded classic games this generation.  Now it heads to both DS and Wii, at the price of $29.99 for the pocket version, and $39.99 for console.  The justification?  A full-fledged package based on the cult classic download.  Whether it is enough to warrant a purchase, however, is going to end up being a case-by-case basis.   Here's the breakdown.  Geometry Wars Galaxies takes the same classic gameplay, and works a whole package around it.  You'll have double the enemies to fight, 10 galaxies to explore, for a total of 64 levels.  On top of that $40 will get you two player co-op, vs. play, and a mini Galaxies mode made up of 10 additional levels.  Tie that in with Nintendo Wi-Fi Connection support for online rankings (local, worldwide, and friends), and the ability to send the classic Retro Evolved game as a demo to any nearby DS system, and you've got the total package that hopes to make Galaxies worth the cast.    Since the game is entirely based on retro gaming, however, it's going to come down to how much you love the core gameplay.  Sierra kept the entire game's design in tact, having a main ship that can move and fire in eight direction independently.  Surround the ship with a basic level box, throw an endless wave of enemies at them, and add in a combo counter, and you've got the entire galaxies experience.  On Wii you've got the option of either moving with the nunchuk analog control and aiming via IR, or plopping in the Classic Controller for true dual analog support (the way the game has always run).  We moved away from IR control after just a few rounds though, as the experience is built on a specific control scheme, and works best within that dual analog setup.  On the flipside, IR control does work, with a small (customizable) indicator showing exactly where on the playfield your cursor is, and a laser sight connecting it to your ship in order to keep things simple to look at.  If you lack a Classic Controller you'll still be able to play - some may even prefer it - but when things get crazy it'll be a bit difficult to track the action.   While leads to Geometry War's presentation.  With the HD version on XBLA the game makes use of incredible visual effects, as the wireframe enemies burst into tiny pieces, bullets distort the background, and waves of firepower quickly turn the otherwise simple looking game into a static screen of chaos.  Remarkably, that same level of chaos is kept on Wii, and while the colors are certainly dulled down compared to any previous version of GW we've seen, the level of chaos, fluidity, and frame rate holds, which is very impressive considering just how much action fills the screen.      This is one of the reasons why Classic Controller is the better method though, as the IR can be lost instantly in the chaos, while you always know exactly which way you're shooting with dual analog.  In fact, the Wii Classic Controller is notched for eight-way play, so unlike the 360 controller you'll instantly feel if you're firing at a 45 degree angle, or perfectly vertical/horizontal on the screen.  As far as we're concerned, this is the best feeling Geometry Wars experience available across any console.   The core experience needed to stay the same in order to keep the amazingly addicting gameplay, so the only logical step was to add a ton of depth, and that's precisely what Galaxies offers.  Each level in Galaxies (64 in total) is a reinvention of the classic game, mimicking other games like Galaxian and Asteroids with varying themes.  So while the original Retro Evolved is easily worth $10 to any self-proclaimed retro freak, Galaxies takes the addictive gameplay and pushes it in a huge, huge way.  Some levels act like mazes, others have moving NPC blocks that act as walls for the player, but allow enemies to freely pass through, and others have mine-laying drones that encourage you to avoid spots all around the map, only to roll over one when in a pinch and begin a level-wide chain reaction that decimates everything on the map. If you like the core game, Galaxies will blow your mind with options and variant level design.  In this level, blue waves circle the playfield, acting like a washing machine that pulls in baddies, items, and you.  Don't fight the current.  To add even more to the experience, a new drone system is included, which basically gives you an on-screen buddy to share in the action.  The drone can be leveled up based on eight different behaviors, each gaining experience to grow up to level 10 overall.  As you kill enemies you'll collect geoms (the new currency of Geometry Wars), which not only increase your multiplier by 1 - with a cap of x150 this time around, leading to scores in the 100,000,000s - but also are used to buy new drone abilities, and unlock each galaxy and level respectively.  Each level also works on a three-medal system, with tons of experience and geoms being gained for huge scores.  Medal in each level, and open up huge chunks of the galaxy.  Add up the 64 levels, geom system, and level medals and you start to get a feel for how much larger Galaxies really is.   As far as multiplayer goes, Geometry Wars delivers a solid experience, but it isn't exactly deep.  Both vs. and co-op work within the same Retro Evolved world (with multipliers coming from kills, not geoms, resulting in generally lower-scoring games), with two players on-screen at once, working off the same litter of baddies.  If you've got to large of a spread in skill, however, both are rendered pretty useless, as a novice will easily get decimated in vs. play, and will bog down the team in co-op.  Of course that experience is totally flipped when you put two vets on the screen at once, so it really depends on the skill of those around you; same situation with the Galaxies Mode multiplayer as well.   Geometry Wars Galaxies still has a few gripes through, and they're worth noting.  For hardcore players, the new x150 point system will be a bit too easy, as every enemy drops a geom, and in extremely intense situations you can max a x150 multiplier in a matter of moments, rather than pushing yourself for upwards of five minutes to boost yourself into the upper echelon of scoring.  The interface is also a bit wonky, using d-pad and analog stick rather than allowing you to click levels via IR, and the rotating world can make things a bit disorienting when trying to figure out what levels you've played, or especially when hunting for your favorite stages to play again.      Leveling up your drone is also based on experience rather than geoms, so while the galaxies themselves take the difficulty of a level into account when assigning medal scores (some levels have bronze at as low as 500,000, while others can start at 8,000,000 simply based on the different style of the mission), you'll get far more experience on the higher-scoring levels, encouraging you to replay only a handful of stages over and over if you're trying to upgrade new items for your drones.  It would have been better to raise levels via geoms instead, as they're generally the same for each mission, and are used as a reward when medaling as well.  Geometry Wars Galaxies is about as hardcore of a game as you can get.  The entire experience is based on survival, gaining a ton of points for surviving through insurmountable odds, and being quick with kill-all bombs in order to push score multipliers to the highest level possible.  This is no casual game, so only retro fans need apply.  If you were a fan of the previous Geometry Wars games (or hark back to the days of Super Smash TV, Heavy Barrel, and Total Carnage), youll absolutely love what Sierra has done with the design, as Geometry Wars Galaxies is more of the same, but a whole lot more of the same.  On the other hand, the game is best suited for quick bursts of play, and still feels like a bulked up piece of download software, so its a shame that it hits the Wii at $40, rather than arriving on Wii Ware for a fraction of the cost.  If the game were $20 itd be one of the best values on the system (and in turn, scored much higher), but as it stands we can only recommend this one to gamers that know theyll be pushing the product to the limit, as the added content  amazingly cool it may be  comes at eight times the price from the original Retro Evolved.  If this sounds like your kind of game, by all means grab it on sight.  For those that wait, however, keep an eye on this one, as itll become an increasingly strong offering as it drops in price.", "date": "Nov 21, 2007"}