{"name": "Lemmings Revolution", "name_review": "Lemmings Revolution", "ref": "https://www.ign.com/articles/2000/05/27/lemmings-revolution", "text": "Hey there small, green and fuzzy dudes, long time no see.  Some of us kind of figured your careers were all washed up after that paintball debacle, but a few kept the faith.  It's not every day that rats have your kind of moxy, to just trudge forward into the sea, heedless of the consequences.  Damn shame that you blokes got tied up in that royalty contract with Psygnosis all these years.  We can't blame you for wanting to revolt.  Still, it's a quiet revolution one bears witness to in the most recent installment of the long-running Lemmings series.  Everything's switched over to 3D now, but the principles on which the gameplay is founded haven't changed one bit.  The player is yet again confronted with oodles of individual scenarios, each an adventure in and of itself.  Lemmings pop out of a box as always, bumbling ever forward into whatever fate awaits them. Faced with one obstacle after another, ranging from water and acid-filled tanks to perilous walkways, teleporters, anti-gravity pads, birds, crabs and weasels that sport boxing gloves, it's up to the little guys' benefactor to help them bypass the danger.  At the end of every level, one or more balloons lie in wait to carry our semi-retarded protagonists to safety.  Anyone familiar with the product line should be pleased to find that once again eight basic skills must be assigned to the little buggers so that they have a fighting chance.  Being blessed with attributes such as builder, basher, miner, or digger allow lemmings to carve out paths from their surroundings or forge new means of travel when no other movement options exist.  Climbers, floaters, and blockers all serve a purpose as well, making it possible to keep the critters hemmed into a limited area or granting them the ability to escape their prison by shimmying up a wall or doing their best impression of a suicidal jumper, albeit with an umbrella that doubles as a parachute.  And if something goes wrong or you need to remove a misplaced individual, exploder and nuke buttons are available. By the way, three species of lemmings exist, as in addition to the common garden variety creatures, you'll also encounter breeds that can walk on water and acid.  Hi ho then, it's off into the wild blue yonder we go.  Or maybe just into the scenario selection screen, which is in actuality a fan shaped pattern of branching levels.  Initially, only a few scenarios can be selected, but completing each branch allows you to progress further along the path.  This gives you the freedom to progress as cautiously or rapidly through the game as desired and is an excellent way to increase its appeal with players of all skill levels.  Novices can practice with the early stages until they're comfortable enough to move on, veterans can ramrod their way right to the end, and the rodent-obsessed can make it a point to explore and conquer every last level.  Due to this architecture, the learning curve couldn't have been better tailored to the title.  That, my friends, is what we call superb game design.  All of the action takes place on a fully rotatable column that supports several levels of platforms, traps, and associated gadgets.  A quick drag of the mouse while right clicking pans the screen left or right with no slowdown or undue hardship.  Easily accessible and located on the far left side of the screen, the skill menu lets you bestow abilities on the lemmings with one or two clicks.  Impatient bastards like myself should offer up a prayer to the gods of geekdom - the interface includes a fast forward button that switches the game into high gear when held down.  Hotkeys make it easier than ever to select individual lemmings out of a crowd.  Also, due to the 3D display, levels can be viewed in their entirety with a minimum of hassle, thereby revealing their contents to the diligent observer.  And diligent you must be if the lemmings are to be rescued.  The first hurdle to be overcome is having to hash out a reasonable approach to the potential pitfalls designed to whittle down the ranks of those under your protection.  Next, you'll need to test your theory, then adjust it as necessary or send the flawed blueprints back to the drawing board. Finally, once a foolproof strategy has been developed, you must implement it in real time, with lemmings constantly on the move, enemies drawing closer, and your hand-eye coordination getting worse by the moment.  Even then, you achieve victory only if you manage to keep a minimum percentage of the geezers alive to reach the balloons.  Mess up and it's back to square one you go.  Damn the people who ever dreamed up this crap!  It's not only frustrating as hell, it's also highly addictive and downright ingenious.  But it could have been better.  Why Psygnosis and Take 2 took the time to convert the this series' worlds to 3D and then didn't make the most of the matter is beyond me.  Although you'll see some beautiful backgrounds and levels, such as those set in mine shats, trees, and caverns (check out that waterfall), no stellar lighting or special effects are featured.  It's all a bit disappointing, though the fantastic cartoon style sound effects and voices of the lemmings, who chirp out remarks like ~yippee~ and ~let's go,~ take the edge off.  The smooth, happy soundtrack and option to zoom in for close ups are icing on the cake, yet you get the impression this delectable delight was made with fat-free ingredients and is desperately in need of zing.  Alas, it matters not, because you'll be hooked on Lemmings Revolution from the first bite.  They just don't make puzzle games this excruciatingly painful or entertaining anymore.  Originally a product whose fate was in peril, it's obvious that as this title journeyed to its final home with Take 2, a smidgen of the game's magic was lost along the way.  ~Unfulfilled potential~ would be the phrase that first comes to mind, but the ones which follow are ~disgustingly cute,~ ~immensely enjoyable,~ and ~you're a putz if you don't pick this up since it's only 20 bucks.~  -- Scott Steinberg", "date": "May 27, 2000"}