{"name": "Operation Creature Feature", "name_review": "Operation Creature Feature Review", "ref": "https://www.ign.com/articles/2007/11/21/operation-creature-feature-review", "text": "The PlayStation Eye hasn't had much software coincide with it besides Eye of Judgment (granted, they were packaged together). Yesterday's PlayStation Store update, however, changed that when it released a short title that relies entirely on the PlayStation Eye for gameplay, and that title is Operation Creature Feature. We won't really delve into the fact that the title doesn't make any sense because it's charming and we're content with that. We should instead spend our time discussing this relatively unique, motion-based puzzler than can now be pulled off the PSN for a meager $4.99. Whether or not it's completely worth that amount of money is debatable, but we'll get to that. All in good time.   You are an agent of the Alien Liberation Front (A.L.F.), determined to rescue the small creatures known as Blurbs who have been enslaved by a dark force in their parallel dimension. Although this story is told in a cute, stylistic cutscene at the beginning of the game, narrative is clearly not the emphasis of this downloadable title. The entire game simply resolves around your efforts to guide the Blurbs through mazes to the end portal, freeing them from captivity. In order to do so, you need to move your hands through the various puzzles, coaxing the Blurbs along because they're attracted to motion. The PlayStation Eye projects an image of you in the background and then registers every movement on camera as the alluring force that draws the little critters to safety (or, if you fail, to their demise).    Operation Creature Feature is very simple and very short. There are five worlds to the game, each with a series of singular mazes that require you to save a certain number of Blurbs, or else you'll fail out and have to start the world over again. While this might sound like plenty of content at first, we managed to get through all five worlds in about an hour, maybe a little more depending on how many times you make mistakes. So in certain ways, our biggest complaint is the game's length, but at such a small price, that's not overly problematic.   Perhaps more worrisome is the ease of the ~puzzles,~ because most of them just involve guiding the Blurbs through a winding tunnel, with no real thought involved. In fact, the only difficult section of the game was the final world (a fiery mine of sorts), but the difficulty arose not from the depth of the challenge but from the slight inaccuracy in the controls, as well as the fact that the Blurbs would continuously burst into flames when exposed to too much heat (poor little guys). The first four worlds require virtually no effort whatsoever, as long as you have at least some skill in guiding your charge through the cavernous mines. If you have control over your movement, you can breeze through the game.   You can fly through it even quicker because the minimum number of Blurbs that need to be saved is generally four or less. The game sometimes even places one Blurb right next to the exit portal to demonstrate what to do, so you often fulfill your rescue quota ten seconds into the stage, making the rest of it rather pointless.   Don't forget, kids: science can save monsters. For all these issues, Creature Feature does offer some pretty neat things. First and foremost, we were impressed with the overall sensitivity and accuracy to the video/motion control. The Blurbs follow your hands well as you move them around the screen and you can even keep them hovering in the air just by moving your fingers. We could even pass a group of Blurbs from one hand to the other just by alternating between stillness and motion. Although this control implementation is not entirely original, it's certainly refreshing and works relatively well.   Unfortunately, the game demands greater precision than the camera can give. If Creature Feature depended on raw, mind-boggling puzzles, than there wouldn't be an issue, because precise control would come second to creativity and problem solving. Instead, the game is more about quickly getting the creatures through a narrow and winding path, which just doesn't work sometimes. When you move your hand, your arm is also moving, so discrepancies can arise when some of the Blurbs follow the wrong part of your body. We suppose there's really no way to get around this, but it can be frustrating when you're trying to be exact with your movements.Operation Creature Feature is a short, fun game that serves as an excellent demonstration for what the PlayStation Eye can do. However, its disappointing length and imbalanced gameplay (precision vs. puzzles) may be cause for concern. If you're desperate for more games that use the PlayStation Eye, $4.99 is a reasonable price for something with some pretty impressive features to it, but be cautious of the super easy puzzles which may disappoint gamers looking to exercise their mind; you're really only exercising your arms in this one.", "date": "Nov 21, 2007"}