{"name": "Football Manager 2008", "name_review": "Football Manager Handheld 2008 UK Review", "ref": "https://www.ign.com/articles/2007/11/22/football-manager-handheld-2008-uk-review", "text": "You probably already know whether you're going to buy Football Manager Handheld 2008. That's because the Football Manager series, more than any other football game, captures all of the blind devotion, all of the irrational animosity, all of the emotional extremity of the beautiful game. So you've probably already decided whether you're going to like it or not. And that question ultimately boils down to whether you're going to like what basically amounts to the same game as the last one, updated with all the correct players and statistics for the current season. And the chances are that if you've found yourself ensnared by the labyrinthine depths of the last game, you probably already know you're going to buy this one too.   FMH 2008 doesnt offer quite as many leagues or competitions as the PC version.  If you haven't found yourself ensnared by the last game, then you probably haven't played it, so perhaps a quick summary is in order. FMH 2008 is the third version of Sports Interactive's seminal management sim to appear on the PSP. The idea is simple: pick a league from one of 10 countries, then pick a team from that league, and turn it into a financial and sporting success. Sign and train players to assemble a squad, set your tactics, and then send your team out to do the business on the pitch. It is unadorned by fancy graphics, or a la-de-da soundtrack. It is, mostly, just an array of names and numbers. It is the essence of strategy gaming: simple, but complex.   Compared to the PC version of the game, however, Football Manager Handheld is ruthlessly pared down, in order to fit the PSP screen and on a UMD, but also to make the game more suitable for portable play. That, actually, turns out to be the game's greatest strength. In shrinking the game to fit the PSP, Sports Interactive has been forced to constrain some of the bloated excesses that deter non-Stattos from dabbling with the main game. And that stripped back design cuts right to the essence of the management genre, without any off-putting distractions.   FMH 2008 adds the ability to customise your tactics, and share them with friends.  That much is true of the first two Football Manager Handheld games, and it's also true of FMH 2008. The major difference is, of course, that FMH 2008 features all the player data and stats from the current season - which isn't to be sniffed at when you're considering the irrational world of wish fulfilment. The other features, however, consist mostly of tweaks that will only really be discernible to Football Manager's die-hard fans.    There are no new leagues, for example, and only a few new cup competitions. A new interface layout and choice of skins provide just a cosmetic enhancement over last season's iteration. A more substantial alteration is the inclusion of a reserve squad, providing managers with more opportunities for long-term development of their footballing dynasty, as well as a wider range of players to support their squad rotation policies.      It's the sort of change that maintains the simplicity of the handheld game, while gently opening up the range of strategic options. Another such change is the new ability to customise your team's tactics. These are the sorts of changes that many players won't ever need to explore to shore up a moderate degree of mid-table success, but budding Mourinhos and Wengers will seize these new opportunities with both hands.   Ah, the local derby. What footballs all about.  Apart from that, it's very much business as usual. It's perhaps marginally more difficult for lower league managers, because it's marginally more difficult to snaffle all the youthful talent. And the match engine has, apparently, been optimised too - certainly the load times are quick and painless, and matches zip along (if you set the game speed to very fast, which you'll want to do). One minor complaint concerns the interface. It's certainly easy enough to navigate, but there are still times when all of the information you need isn't quite at your disposal - like when you want to compare potential new signings to your existing squad members, for example.   But yes, this is the largely the same game that's already appeared twice on the PSP. Which is, in many ways, a good thing. After all, the best managers tend to stick to careful evolution, and know the value of a low profile nip and tuck here and there, rather than risking everything with radical change. And even third time around, the game is still a strategic, wish-fulfilling treat. You'll quickly find yourself drawn into its carefully constructed, superbly coherent footballing world and you'll rapidly feel the need to fill all your waking moments wrestling with the thorny question of whether to press or whether to counterattack, or what to do about your central defender's impending retirement, or your new striker's delicate ego.   At the start of the game you can pick a team, or have one randomly assigned to you.  So Football Manager Handheld 2008 is a perfect fit for the PSP, just like the other two games were. It's a brilliant distillation of the best things about football management games, with all of the extraneous superfluity stripped out. Sure, there are minor niggles regarding some of the interface design, but this is as good a football management game as any portable platform has any right to expect. But, still, this is true of the last two games in the series, and the biggest problem with FMH 2008 is undeniably that it fails to sufficiently distinguish itself from the previous games.But then, you probably already knew that. If you spent the summer honing your technique on FMH 2007, well well you already know if youre going to buy this. And if you didnt, then youll need to sign up now if youre going to spend next summer honing your managerial skills on FMH 2008. In any case, now that England/Scotland/Wales/Ireland/Northern Ireland have been knocked out of Euro 2008, youll need some sort of footballing solace to see you through the winter months and beyond. It might as well be the best portable football management game in existence.", "date": "Nov 22, 2007"}