{"name": "Kane & Lynch", "name_review": "Kane & Lynch: Dead Men Review", "ref": "https://www.ign.com/articles/2007/11/27/kane-lynch-dead-men-review", "text": "Kane & Lynch may have one of the most unfortunate titles in the history of games. Although the name may inspire thoughts of racial injustice, IO Interactive's spiritual successor to Freedom Fighters and follow up to Hitman: Blood Money has nothing to do with race relations. Even so, it will manage to raise an eyebrow or two with its visceral story and characters that almost save the title from its clunky gameplay.    The game actually gets its title from the two stars of the game, Kane and Lynch. These are not your ordinary heroes. In fact, the game begins with the duo en route to death row. A mysterious paramilitary outfit that calls itself The7 breaks the two out. Kane, it seems, is a former member of the group and has a lot of money that they feel owed. Lynch, a medicated psychopath, is recruited to keep an eye on Kane while he gets The7 what they want. From there, the plot follows a series of twists, turns and betrayals with a whole lot of killing along the way.    The best thing Kane & Lynch has going for it is that it's a game that pulls no punches. It seems that the majority of high profile games out there today have some form of violence or at least one feature that could be called morally suspect, but few reach the levels of this title. Kane & Lynch ratchets everything up a notch to the point where you should feel uncomfortable playing this game around a young, impressionable mind. It begins with killing cops and moves straight on to curse words flying from the mouths of the various characters at unheard of rates. If you like four letter words beginning with the letter ~F,~ then the dialogue will be right up your alley.    Foul language alone wouldn't be enough to make Kane & Lynch stand out from the myriad other titles looking to gain some notoriety. This is where Kane & Lynch earns its stripes. Rather than employing a series of cheap shock tactics as so many other games have, IO Interactive crafted an intense and visceral story to go along with the game. Say what you will about the language being over the top, but these anti-heroes are wonderfully bent. It's no easy task to create such despicable characters and then give them motivations and situations that allow even the holiest of us to relate to their situation and feel for them. These are hard men put in an impossible situation. Following them on their journey is a wild and bumpy ride.   Helping to make the story and characters even more powerful is the great way they're presented. Traditional cutscenes and voiceovers are used in between gameplay, but the story and character development doesn't ever end. Kane and Lynch continue to interact, argue and reveal more of the plot straight through the action. This does a great service towards making the entire experience feel fluid and cinematic.   Lynch is one sick puppy. As well constructed as the plot is, one would assume the game would play smoothly. Unfortunately, it does not. Instead, it plays like a game that lacks focus and needs a few more months of polish. But then, most of the gameplay feels like it was pulled directly out of a game from the last generation, so perhaps more time wouldn't have done any good.   Kane & Lynch is a third-person, squad-based shooter that, on its surface, promises players the option to play with their own style. There's a squad that you can direct either individually or as a group to take up positions of cover or attack specific targets. These men will also act on their own, so you're free to ignore them if you don't want to manage them. There's a good range of weapons, a cover system, semi-destructible environmentsin short, all of the check boxes that gamers look for are filled in. It all sounds pretty good on paper.   Things start breaking down rather quickly once you start playing. For starters, the cover system is unwieldy at times and useless at others. It activates by pressing up against an object, but whether you actually get sucked into the wall is rather hit or miss, too often leaving you running into a wall head first while enemies have their way with the idiot who thinks he should keep running into a ledge. Once you do get into cover, it's oftentimes useless. Either the splash damage on weapons is turned up to high or there are clipping issues because quite regularly you'll find yourself dying while huddled behind a wall.     The enemy AI has just as many issues taking cover as you do. We've seen them press up against cover that doesn't exist and take cover on walls that leave them in plain sight. That is, of course, if they're even smart enough to do that, which isn't always the case. Call us crazy, but if we saw three friends who were standing right next to us get shot in the head one after another by a sniper rifle, we probably wouldn't sit in one place to wait and see what will happen. In Kane & Lynch, we've seen the AI do just that.   Without a good cover system, the game boils down to a pretty generic action shooter. Without a good cover system, the squad mechanics often break down into sending your team ahead as bait. New enemies are spawned when you cross specific points, so walking ahead on your own usually results in a quick death when you're ambushed.   The cover system is spotty at best. It all comes to a head during a few needlessly frustrating sections of the game. Without them, the game could be beaten in a day. With them, many people will simply give up and move on to another title. Some of these portions are annoying because of the gameplay shortcomings (Why add a stealth section when the game has no stealth engine?), though one in particular just isn't presented in an intuitive way. We won't spoil anything. You can find these sections and be driven nuts on your own, should you decide to give Kane & Lynch a shot. It's a shame that the game doesn't play as well as you would hope, because some of the levels outside of the frustrating points are genuinely cool. The night club scene is one of these, as is the prison break level.   While IO Interactive made significant steps forward in terms of presentation and story, the team appears to have been left behind by the rest of the development community when it comes to gameplay and graphics. This isn't a first-generation game -- new hardware has been out for two years. Why do we still have underwhelming explosions? Why do we still have characters that speak without their lips moving? Why are there occasional flickering textures and visual seams where those textures meet? For such a short game, it seems that it should have been possible to nail the visuals and give us the cinematic effects a game like Kane & Lynch deserves.    It's hard to imagine how the decision was made to leave out online co-op play in Kane & Lynch. You can play straight through the campaign with a friend, but only offline on a split screen. With new standards being set every day as more and more new releases push forward the boundaries of what is expected in a game, the absence of this feature is remarkable. It's made even more confusing given the fact that there is a separate online mode already in the game.   Fragile Alliance in action. Fragile Alliance, Kane & Lynch's online mode, is unique and a great deal of fun, especially if you have a group of friends you know particularly well to play with. The setup is this: Between four and six players are charged with collecting as much money or valuables as possible and getting out alive. The catch is that you have to split your take with the other survivors. Kill them if you want the spoils to yourself, but anybody that dies respawns on the opposite team (a team that is initially only controlled by AI bots). Come back on the other side and you can collect money from any of your former teammates that you kill and are even given a bonus if you take revenge on the person that betrayed you.   The Fragile Alliance mode sounds a bit confusing when it is first described to you, but it really is a great addition to the game. It not only fits the ~bad guy~ mentality, it also carves an online niche for the game in a season of game releases where a title really has to stand out to get noticed. The back and forth backstabbing in Fragile Alliance is the type of mode that only gets better the more you play it. If only the cover system and AI worked a little better, this would be a hitalso it would help if there were more than four maps. It would also help if anyone were playing online. It's not a fault of the game itself, but nearly two weeks after the game was released there are still under 100 people on the leaderboards.  Kane & Lynch is a game that many people will play through and enjoy simply because of the forceful story and characters. Others will find the gameplay isnt up to speed with the rest of the gaming world and wonder why anyone would bother. Frustration should never enter into a game because of the mechanics, but with Kane & Lynch it does. Loose gameplay, a brief campaign, and a single (albeit good) online mode with four maps hurt this title that could have been so much more.", "date": "Nov 27, 2007"}