{"name": "Painkiller: Overdose", "name_review": "Painkiller: Overdose Review", "ref": "https://www.ign.com/articles/2007/11/28/painkiller-overdose-review", "text": "Painkiller: Overdose is a throwback of sorts, to a time when the phrase ~first-person shooter~ meant only thatthe shooting of stuff from a first-person perspective. No confusing rules, no weirdo storylines, no RPG or adventure elements. Just tons of demons and/or monsters, almost as many forms of weapons, buckets of good old-fashioned blood, and more severed body parts than a chop shop. Like DOOM, Quake and all those other straight-up shooters before it, Overdose is all about high-speed mouse skill, twitch reflexes, and inherent aggression. Though it feels a bit more dated than its Painkiller predecessorsthe series began in 2004the latest installment nevertheless manages to crank out a gory, fast-paced good time that should please anyone with a strong distaste for murderous beasts from hell.   Actually, it's not quite hell. Overdose purportedly takes place in purgatory, a bizarre place between heaven and hell that doles out as much horror and harbors as many freakish ghouls as your doctor's waiting room. That the game's definition of purgatorya series of environments seemingly plucked ad hoc from across this big, wide world of oursdoesn't quite jibe with traditional values and doesn't really matter in the grand scheme of things. Who really cares if you're fighting in a Japanese tea room, a desert gorge, or in the midst of some ancient ruins as long as it looks good and delivers the thrills? For the most part, Overdose does both.    As ~Belial, son of Heaven and Hell,~ you're a half-demon, half-angel waging war against Lucifer, who imprisoned you here, and all his henchmen and hench-women. You stroll through the world, room to room or zone to zone, wasting everything you see. Each time you enter a new space, a gate or door swings shut behind you and the monsters come out to play. You are then expected to annihilate all attackers in order to open the next door to the next space.   Unlike so many games of this ilk, there are no doors to unlock or tedious puzzles to beat. You can save at any time, and the game often covers for you by saving automatically at regular intervals.   The key to Overdose is variety. For example, each of the game's seventeen levels and indeed many of the rooms and spaces within each of those levels feel and look impressively distinct from the next. One minute you're trapped in a darkened dungeon of some sort, battling the no-goodniks as much as the claustrophobia. The next minute you might be on a wooden walkway suspended over water or making your way over a sand dune or fighting your way through a rotting Grecian courtyard.    The sense of size and space is strong throughout. Towering above you are columns and mountain tops, decorative ceilings and strangely-colored skies. Beneath you are bottomless crevices of fire and murky oceans that'll swallow you whole. Boxes and barrels containing ammunition refills abound, as do vasesmany with bloodied body parts inside.   But that's just a hint of the gore that awaits. Bleeding, disfigured skeletons lurch toward you, only to be blown to smithereens. Asian kung-fu masters somersault in front of you, even with the harpoon you've just launched at them sticking out of their eyeballs. And should you crank the difficulty level to ~Trauma,~ there are so many monsters and so much carnage that the floor is literally coated with blood and assorted entrails.   The interplay between beast (be it insect, animal, robot, mutant human, giant, etc, etc) and weapon also helps keep things interesting. Some enemies just fall to pieces with the slicing and dicing ~hell cube,~ a near-magical device and holdover from past Painkillers that does all sorts of wacky things. Others are dispatched nicely with a crossbow to the brain.     The way cool thing about Overdose's eight main weapons is that each can be used in a primary and secondary mode, effectively doubling the fun. The canon, for instance, can be used in its secondary mode to temporarily freeze an enemy in place, thus ending the immediate threat and making said enemy ripe for the picking when you have a spare moment to do so. Some of the alternate fire modes are pretty wild to be sure, so prepare to learn what they can do before you can use them effectively.   And there are other things to do besides shooting and killing and dying. When you off a demon, its soul will escape and rise above its now useless body, floating in space for a few seconds before dissipating. That's you cue to grab it. Grab enough souls and you'll enter a stage wherein you become insanely powerful. It's a rush for sure, and one you'll want to experience.    The game also offers a series of level-specific challenges, such as completing a given section by using only a certain type of weapon. You aren't compelled to play it this way, but if you do, you'll garner extra power-ups that'll really help during future forays.     Nevertheless, even with the variety of enemies, weapons, environments, and challenges, Overdose gameplay often comes down to that tried and true formula of a gazillion simultaneous enemies. So, if you're not a fan of the DOOM school of gaming, wherein your entire line of vision is loaded with bad dudes trying to smack you and eat you and gore you and shoot you, you probably need to look elsewhere. Moreover, the re-load times are ridiculously longup to a minute on a fast PCand that's a serious buzz kill in a game that relies so much on frantic action and forces you to re-load seemingly every few minutes. Hello God mode.   Something else to rememberPainkiller hasn't changed much in its various permutations. Accordingly, and even though it's chock full of graphical variety, it tends to look a bit old. The monsters aren't as sophisticated as those found elsewhere, the lighting is good but not spectacular, and the weapons, though certainly creative, generally don't deliver that 2007 wow factor. Likewise with the audio. Belial's constant wisecracking and whistling is funny yet repetitious. Ambient noises such as creature movement seem to get lost in the shuffle. And weapon effects alternate between impressive and disappointing.     Multiplayer Overdose is just about what you'd expect from a title of suchsimplicity. The usual mini-games are here, including Capture the Flag and Free-For-All, and the gameplay options are strong. Sixteen people can play and kill and destroy together, and the frame rate keeps up pretty well. But the multiplayer arenas feel a bit small and the confines rather tight, so it's usually hard to remain unscathed for more than a few seconds.Painkiller: Overdose may be a case of dj vu to series veterans and those who regularly gravitate to this genre. Furthermore, there are a few flies in the ointment. However, it brings just enough new material to the table and it certainly doesn't lack for places to see and things to mutilate. Ultimately, hardcore shooting fans with a taste for that semi-stupor brought on by incessant gunplay and bloodletting will devour what Painkiller has to offer and come back for seconds.", "date": "Nov 28, 2007"}