{"name": "Ratatouille: Food Frenzy", "name_review": "Ratatouille: Food Frenzy Review", "ref": "https://www.ign.com/articles/2007/11/28/ratatouille-food-frenzy-review", "text": "Pixar's Ratatouille was one of the year's most delightful films, and publisher THQ and developer Helixe capitalized on its appeal with last summer's Ratatouille on DS, a solid blend of 3D stealth platforming and cooking minigames. Unfortunately the two companies decided to go back for seconds, throwing together the disappointing and uninspired Ratatouille: Food Frenzy, also for the Nintendo DS.    There are only seven minigames in this collection, a few of which were already used in the first DS Ratatouille game. The seven games can be played through in under an hour, with only increases in difficulty beyond that. The games involve repelling snails off a kitchen wall, flipping fish in a frying pan, sorting vegetables, slicing vegetables, stirring food in a pot, stirring food in a different pot, and making dishes presentable for the dinner crowd.    As opposed to the minigames in Cooking Mama, which ask the player to think about what they're adding to each dish before they add it, food preparation here never goes deeper than matching colors and dragging objects from point A to point B. When players do combine ingredients into a dish, they can usually dump everything into the pot in any order, so the game becomes a pretty mindless experience.    One thing that's lacking here, compared to better food-themed games, is any sense of importance to each of these challenges. Instead of making each of the seven games an essential step in the cooking process, they feel random and disjointed. Knocking snails off a wall doesn't seem to have anything to do with cooking, and there is too much overlap between some of the other games, with two of them involving soup stirring but with different play mechanics. The developers should have really made an effort to represent everything Remy the rat would actually go through each night in order to serve his public. Instead, we're given a handful of uninspired kitchen snippets.    Colette seemed prettier in the movie. Another problem with the game is its merciless difficulty in spots. I was able to make it through each of the seven minigames, but only after a wrist-numbing amount of repetitive, uncreative stylus scribbling. Instead of requiring players to occasionally stop and think, most of the games come down to flicking and dragging the stylus with constant precision and little or no break between each action.    This difficulty is compounded by a running meter on the right side of the top screen. As each minigame is played through, the meter fills when the player succeeds and empties the rest of the time. But the fill rate of the meter is so slow that a game that might have been fun for thirty seconds often takes several minutes to complete. Between this and the low game count, things get old pretty fast.    Touch input in the games, particular the slicing one is so unforgiving that younger gamers probably won't be able to advance. Slicing fish and vegetables requires brutal precision, with any broad strokes extending even remotely beyond the guidelines failing. I haven't been this frustrated with a DS game since screaming ~BLUE!~ into my copy of Brain Age. Even simple tasks like stirring a pot of broth have their touchable areas so tightly confined that it takes Ouendan-class spinning abilities in order to advance. Given the young audience, the touchable areas in this game should have been a little broader.    Instructions are handled poorly in the game, with only optional, limited text guidelines before each game and no available direction during gameplay. Since most of the games involve multiple actions, it's easy to forget what needs to be done, and with the constantly-draining meter any slip-up essentially starts the game over. Some sort of a top screen reminder of what to do, or even instructions at the pause screen would have helped immensely; instead, confused gamers will have to exit the game and re-memorize all instructions before trying again.    The art style of the game is the same as the previous Ratatouille DS title, mirroring the 2D paper cutout style of the film's end credits. While the art direction in this game is definitely unique and stands out among other licensed handheld games, the color palette is so washed out that it's sometimes hard to tell the difference between certain foods, especially in games requiring sorting. Use of 3D is good, with pretty seamless transition between the 2D and 3D art. 2D animation is limited but charming where it does occur. Music captures the feel of the film complete with percussion and accordions, although there isn't much variety between songs.    In addition to the main game, players can unlock free play versions of the games, as well as 20 high quality still images from the Pixar film. Players can access credits and see their current rating (high score) for each of the seven minigames, as well as their overall rating. There are no multiplayer modes, or anything else that would make this experience more than an hour's worth of gaming. Why does this game exist? Half of its contents were ripped from the previous Ratatouille DS game, and whats new is generally pretty bad. The art style is unique, but perhaps too washed-out. With only a handful of games and no substantial extras, most kids will tire of this title within the first hour of play, if the difficulty doesnt get to them first. THQ and Helixe should have left this game in the oven a bit longer, instead of rushing such a shallow, unbalanced and unfocused collection to market for the films DVD release.", "date": "Nov 28, 2007"}