{"name": "Star Trek: Conquest", "name_review": "Star Trek: Conquest Review", "ref": "https://www.ign.com/articles/2007/11/29/star-trek-conquest-review-2", "text": "See, this is why I really don't mind reviewing the run-off crap that most of the other guys on the PlayStation channel kick down to the lowly freelancer. Sometimes you get pleasantly surprised. Star Trek: Conquest probably should have been pure crap -- it had all the ingredients: value price (it's only $15 new), no actual actors or characters from the Star Trek TV series or movies, and more than a passing resemblance to the snooze-worthy Star Trek: Encounters -- and yet, stripped of all the normal selling points, the game ends up being awesome.   Well, awesome if you like Risk mixed with a healthy dose of the Star Trek mythos. It's all more or less a bunch of window dressing; you'll see the LCARS interface while playing as the Federation, you'll get little blurbs on familiar planets, races and systems, and near-cameo appearances from the Borg, Ferengi and Xindi add a little more flavor. The bulk of the game, though, is balancing the game's six different races' particular strengths and weaknesses while trying to take over as many systems as possible.   The Universe awaits. It's all done by way of a web-like series of interconnected systems. At the start of every game (and really there are only two modes, one that allows you to pick a race, the number of opponents and the difficulty, and another that lets you just square off in space battles), nearly all of the universe is neutral, and all of the systems must be traveled to and taken over by force. Once a system is conquered, a starbase and either a mining colony or research station can be set up. First race to stomp out everyone else wins, simple as that.   Okay, it's not quite that simple. Building anything in the game requires cash, and though you'll slowly build up stores of fundage with each round, those that don't want to by overtaken by force will invest in as many mining colonies as possible. With enough captured systems and colonies pumping away, cash can be poured into thickening up one of three fleets of ships. Three different craft can be built so long as you have the cash, ranging from nimble but fragile little scouts to full-on dreadnaughts that are loaded with armor and heavy weapons but steer like an oil rig. An oil rig in space.   Pew pew! Having a fattened wallet also opens up the ability to build bigger starbases in any of your systems, and turrets to protect those bases and any mining colonies/research stations you have. Because you're limited to three fleets of ships, you can't babysit all of your systems, which is where built-in defenses come in handy. To help speed things up, all conflicts, either you invading a system or repelling an invasion of your own, can be handled in three ways. You can tap a button and let the computer calculate the odds, tap another and have a little more control over defensive (more power to shields, less to weapons) or offensive (less shields, more weapon juice), or jump in and handle things yourself.   This is where the game most resembles Star Trek: Encounters. You can freely control any of your ships in your fleet, switching between them with the d-pad, firing primary or secondary weapons (read: phasers or torpedoes) steering your ship and giving it some temporary boost (which cuts down on the turning radius but can help you avoid incoming phaser fire). Targeting enemies is handled by sweeping the right analog stick around to hold enemies in a translucent slice that locks all fire onto that particular enemy. The same offensive/defensive formations can be used here with the added benefit of focusing all your fire on one target -- crucial to overcoming stacked odds when you're invaded.      Having research stations also gives you a bit of oomph to your special weapons meter every round, as well as filling an upgrade meter. With the former filled, you can pick from three weapons specific to the Federation, Breen, Klingons, Romulans, Cardassian and the Dominion. These usually revolve around disabling or damaging a system, or healing all your units on one of your own, but occasionally you'll find more deceptive moves like being able to teleport. Each race has their own advantages to things like being able to move multiple times in a turn, offense and defense, and these special attacks often augment that race's play style. The same goes for their upgrades, which can boost some deficiencies or strengthen particular fortes like shields or weapons. No two races upgrade in the same way, and it's here that the game gets the bulk of its variety.    It's obvious, too, in the presentation. Each race has their own HUD and radio chatter, and while they all essentially do the same thing, it was a nice little touch. Galactic backdrops that show black holes and massive suns in the background do a fantastic job of giving each system its own bit of life, though there are times during particularly meaty battles that the framerate can chug. The repetitive chatter from each of the races during battles can grate a little, but luckily the game's music not only feels right in line with the stuff heard in the movies and TV series, but unique enough to stand on its own -- even if the themes were pulled from the last Star Trek game.   ZOMG! Conquest does one thing, and does it well. Freed from all the TV actors and even the characters themselves, the game instead just rests comfortably in providing a tried-and-true game of strategy with enough variety and differences in play style to make every race feel like they can tackle the game differently. Granted, the limited scope means you won't be able to play the game for marathon sessions, but it's perfect in few-hour bursts.", "date": "Nov 29, 2007"}