{"name": "Castlevania: Symphony of the Night", "name_review": "Castlevania: Symphony of the Night Review", "ref": "https://www.ign.com/articles/2007/11/30/castlevania-symphony-of-the-night-review-2", "text": "It's actually debatable why I'd even need to throw a couple words at you about why you need to have Castlevania: Symphony of the Night in your collection in some form. It's arguably the best game on the PS one (rivaled primarily by Metal Gear Solid, No. 1 on our Top 25 PlayStation Games of All Time list), and though for posterity's sake it's probably a good idea to have the original PlayStation disc chilling somewhere in your game library, getting the game in digital form is certainly a close second. Symphony of the Night represents a rather unique snapshot in the history of games; it's the swan song of 2D as it went the way of the dodo (or at least the California Condor) and 3D gaming rose as the de facto standard. More recent games like Odin Sphere and GrimGrimoire are at least keeping the genre alive, but SotN was the pinnacle of 2D at the time -- even more surprising given that the PS one wasn't really supposed to be a 2D powerhouse.  Runnin'. But the game handles 2D beautifully here with smoothly animated sprites, the odd bit of parallax fanciness and a style that was (and in many ways still is) unmatched. Though the music in the game is synthesized, it has a fullness and range that scoots around the limitations of what you'd normally associate with a digital orchestra as it opts to ladle on generous amounts of breathy choir falsettos while dabbling in more diverse styles like jazz. The result is a game that is technically lo-fi (there's a bit of graniness to some of the sound effects) but feels much more grandiose than the disparate parts would have you believe.  Symphony also kicked off the birth of the so-called Metroidvania style that would eventually see plenty of GBA and DS sequels down the road. The layout of Dracula's castle, though, is arguably better than any of the others. It offers a constant string of impediments that are slowly unlocked as you search the castle for your lost powers. Yes, it's an unapologetic homage to the Metroid style of gameplay, but wrapped in a proper action-RPG setting where main man Alucard actually deals points of damage with every strike and slowly gains more hit points and hearts to use special items, it all feels fresh even today.  There's also the matter of the game's translation. No, the story isn't terribly amazing (Alucard, Dracula's son born to a human mother and his infamous father, rejects his vampric nature to side with the humans in destroying his father's castle before Daddy Drac can be reborn yet again), but hearing hilariously delivered lines like ~Mankind can ill afford a savoir such as you~ and ~What is a man? A miserable little pile of secrets!~ is almost reason enough to go for this version rather than the updated, retranslated version available in the Dracula X Chronicles.  The glory of combat. The fact that the game doesn't actually end once you've unlocked the ~regular~ castle just shows how much depth there is. I swear, the game took me far, far longer than the four and a half hours or so that I spent breezing through the normal game, but regardless, there's an entire flipped version of the castle and tons of hidden little nooks and crannies to explore before you finally square off against the final boss.  In fact, one of the biggest reasons why I have such an affinity for Symphony of the Night is because of the way the castle was designed. It's challenging in normal form, but Konami's brilliance in building it to be played upside down as well speaks volumes about the skill of the design team. Throw in much tougher enemies and parts that can only be explored once you've mastered all of Alucard's skills and you have a game that keeps giving long after it would normally be over (literally, you can push your completion percentage to 200+  if you seek out all the hidden passageways in both versions of the castle).  Nostalgia can be a powerful thing. I've gone back to games from the 8- and 16-bit era that I thought were absolutely brilliant then only to find them quaint by today's standards. It's an issue that's exacerbated all the more by the PS one's almost painful handling of most 3D graphics and gameplay that -- in a very real sense -- was struggling to properly move into three dimensions. Symphony of the Night has none of those problems; it takes everything that was good about 2D gaming and adds a fantastic amount of depth, tight controls and rock-solid gameplay, making it easily the best game you can get on the PlayStation Store right now -- and it'll probably stay that way until Konami decides to release MGS.If you don't own Symphony of the Night in some form, slap yourself for being so careless and get your butt over to the PS Store to grab you some Castlevania love. Now.", "date": "Nov 30, 2007"}