{"name": "Halo 3", "name_review": "Halo 3 Original Soundtrack Review", "ref": "https://www.ign.com/articles/2007/11/30/halo-3-original-soundtrack-review", "text": "Tag team composers Martin O'Donnell and Michael Salvatori are back for Round 3 of their Halo musical menagerie. Easily the most extensive of the soundtracks released thus far, Halo 3 Original Soundtrack is a 2-Disc, 31 track affair broken into 10 movements plus a Bonus Tracks section. For the most part the bulk of the tracks included here clock in well over 2-mintues in length, making them less of quick cues and more like individualized pieces in a larger suite. Additionally the duo's orchestration chops seem to have undergone some noticeably enhancements, relying on more organic sounding bombast than electrified ambiance. Not to fear, the latter is still in effect, it just gets augmented more by subtle piano, emotional strings, and other symphonic elements, creating a much richer sonic environment overall.   The ~movements~ on Disc 1 are broken down into Arrival, Sierra 117, Crow's Nest, Tsavo Highway, The Storm, Floodgate, and The Ark. Each movement fluctuates in how many sections it has. For example Arrival only consists of one, ~Luck~ while The Ark consists of three, ~Farthest Outpost,~ ~Behold a Pale Horse,~ and ~Edge Closer.~    In terms of musical vibe on Disc 1, it fluctuates between playfully mysterious on Arrival's ~Luck,~ which flow along to flute, haunting vocal passages, and drifting tone poems. Sierra 117's ~Released~ begins with muted drums and lumbering bass drone, then string tonal noise is methodically added along with synthetic burble, and finally a wash of alienated vocals slip into the mix. Meanwhile ~Infiltrate~ commences with darkly tainted bass flutters and strange metallic echoes before adding the drone of strings and more clipped rhythm shuffles. Crow's Nest is comprised of three sections. ~Honorable Intentions~ has plenty of violins, creating an introspectively emotional slant that eventually leans toward the militaristic thanks to a snare drum cadence and swatches of regal vocals. ~Last of the Brave~ continues the ceremonial stance, adding horns for grander effect. And ~Brutes~ keeps the thematics intact, albeit with a bit more flurried momentum that eventually dies down and becomes more haunting and restrained.   Tsavo Highway is built around ~Out of Shadow~ keeps in line with the previous movements in that it is built around haunting vocals and streamlined orchestration sounds keenly integrated with synthetic rhythm patter. Then ~To Kill a Demon,~ reverts to detached dread, utilizing piercing drones and driving strings amidst swirls of ambient eeriness to create a sense of tension and wonder.   For The Storm movement O'Donnell and Salvatori deliver ~This Is Our Land~ which returns to emphatic strings and driving bass drone to create a sense of purpose and command. ~This Is the Hour~ draws upon the familiar themes first explored earlier in the album, extending the orchestral empathy into deeper realms of richness.   The final two movements, Floodgate and The Ark are broken into 5 sections. The first two, ~Dread Intrusion~ and ~Follow Our Brothers~ evoke mystery and malevolence as well as reward and reconciliation. The latter three~Farthest Outpost,~ ~Behold a Pale Horse,~ and ~Edge Closer~more or less maintain the status quo in that they continue to use vocals, strings, and ambient texturing to create ethereal symphonic resonance that rolls from celebratory grandeur to lilting progressiveness and electro rambunctiousness.    Disc 2 is built around 4 movements: The Covenant, Cortana, Halo, and Ending. There is also a Bonus Tracks section tacked on at the very end. The first movement, The Covenant, consists of four sections. ~Three Gates~ reprises the familiar piano elements from the earlier ~This Is the Hour~ before dipping into electro reverbatory terrain. ~Black Tower~ is rife with stripped down ~tribalistic~ percussion. ~One Final Effort~ brings back the now all-too-familiar piano refrain. Cool as it is, having it reprised so many times starts to get a bit repetitive (at least in terms of being separated from the game and its storyline). Thankfully ~Gravemind~ goes for deep space isolation chamber theatrics, relying on wavering tones to create an otherworldly sense of impending doom.   For Cortana the duo break it into ~No More Dead Heroes,~ another introspective number that keeps things lean and mean in the orchestral department. ~Keep What You Steal~ again reverts to the requisite piano refrain, which should be called ~Master Chief's Song~ (that would be a snarky reference to the theme from ~Brian's Song~ since this piano motif is drenched in an almost saccharine styled sense of solemnity and heart-string pulling melodrama). The song does switch gears about  of the way through, incorporating the familiar elements of tribal percussion and hauntingly detached vocals amidst careening strings. Halo commences with ~Halo Reborn,~ using the theatrical vocals for appropriate effect. ~Greatest Journey~ continues along these lines, sounding almost virtually indistinguishable from its movement counterpart.   The final movement, The Ending, is comprised of four sections. ~Tribute~ lives up to its namesake, thanks to the militaristic cadence of snare drums embellished with strings, horns, and sweeping vocals. ~Roll Call~ is surprisingly dark in tone, going for a more ecclesiastical thematic with the vocals. ~Wake Me When You Need Me~ is a strange combination of ennui and slight romantic undertones. It almost has a defeatist sensibility about it when compared to the track that preceded it.  The final section, ~Legend,~ more or less sums up the overall musical themes of the score. It is rendered in fairly traditional orchestral terms, albeit there is a crazy ~wall of screeching sound~ (think the culminating moments of The Beatles' classic ~A Day in the Life~) that whites out everything in its path.   As for the Bonus Tracks section, it consists of four songs. ~Choose Wisely~ comes off as an extension of ~Legend,~ picking up where the screeching culminates and providing a dreamy counterpart to the previous track. ~Movement~ is a short refrain that reprises the nuts and bolts of the classic Halo 3 theme. ~Never Forget~ is a return to symphonic grandeur. And ~Finish the Fight~ more or less follows suit, bringing together the team's now familiar use of symphonics, minimal piano, and floating vocals. If you purchased the album via iTunes then there's a secret track in the form of ~LvUrFR3NZ (Love Your Friends)~, which was crafted by a band called Princeton who won a MySpace competition to be included on the OST. The track sounds like quite a lot of the post-emo-new-millennial pop punk that's floating around out there (think Fall Out Boy, etc) but with more of a fanboy element to it.   Like a number of other recently released videogame soundtracks, Halo 3 Original Soundtrack begins with a bit of a bang and then eventually sputters out. Without a doubt the best elements of the album are delivered early on as part of Disc 1 and with each passing movement and section the music begins to lose a sense of wonder, the album itself running out of steam as it buckles under the weight of its own material. In short, by the time the listener has reached Disc 2 many of the sections have begun to sound repetitive; the material having blended together into an altogether indistinguishable soiree of symphonia. This would have been a terrific collection had it been trimmed down and edited into a single disc package.   Download Worthy:  1.~Released~  2.~To Kill a Demon~  3.~Behold a Pale Horse~", "date": "Nov 30, 2007"}