{"name": "Sonic 3D Blast", "name_review": "Sonic 3D Blast Review", "ref": "https://www.ign.com/articles/2007/12/05/sonic-3d-blast-review", "text": "The Flickies are some special birds. Gifted with the ability to teleport around the world through the use of golden rings, they're a rare and powerful breed  and highly sought after by the villainous Dr. Robotnik. But as the bushy-mustached mad scientist schemes to capture and enslave the entire flock, Sonic arrives on the scene to stop him. It's Sonic 3D Blast, the last Hedgehog adventure to ever be published for the SEGA Genesis.   Now that plotline sounds pretty familiar, as it had already been Robotnik's plan in all the previous Sonic games to somehow take innocent forest creatures and bend them to his will. But story is about the only thing Sonic 3D Blast has in common with its predecessors, as its gameplay, graphical style and overall feel are completely removed from his original side-scrolling quests.   This one's isometric. Also known as the three-quarters perspective, it's a style of visual presentation used in some older games to offer depth on a diagonal  a rotated take on what might have been a birds-eye view. And while the title bills the view as ~3D,~ any gamer who's played an isometric game in the past knows that it's hardly a substitute for actual, genuine three-dimensional graphics. Because, for one, it's hard to control.   In a game world built on the slant, the most often-used directions of movement will be northwest, northeast, southwest  and southeast  the 45 degree angles. And the old Genesis D-Pad wasn't made with that in mind, meaning getting Sonic moving in the direction you wanted him to go was uncomfortable at best. Pressing two edges at once, trying to input the implied direction in the middle. It could be a hassle.   Even Sonic's looking kind of ticked at having to be in this game.  And still is, but, interestingly, Sonic 3D Blast's migration to the Virtual Console has done its control scheme a significant service  it's now compatible with the Wii's Classic Controller, which comes equipped with an analog stick. It seems easier to play now, if you use the CC. Not drastically easier, but easier.   The levels in Sonic 3D Blast are designed in a different way than those found in the side-scrolling Sonic the Hedgehog games, as the point here is not to blaze through to the goal as fast as you can. Instead, your mission is to rescue flocks of Flickies by defeating enemies, then take them to the nearest floating golden ring. There, they'll activate its teleportation abilities and open the path to forward progress for Sonic  step in, get transported to the next part of the level, then rinse and repeat. It's a constant loop of saving Flickies, cashing them in, saving more Flickies, et cetera.   And that's where the problems really begin for Sonic 3D Blast  because even if you're cool with the control or feel the VC's support of the Classic Controller makes that a non-issue, you can't deny that the game's core design is repetitive and, ultimately, kind of bland. The sense of speed and intense action that Sonic's name was built on is absent here, replaced by, essentially, a looping, lazy fetchquest.   It wouldn't be so bad if Sonic felt more like Sonic, but he doesn't really  this version of the Blue Blur maxes out his pace at a brisk hustle, and never gets to be any faster unless you grab a temporary speed booster. And, worse, he feels floaty after moving  kind of like Luigi in Super Mario Bros.: The Lost Levels, Sonic will keep on ~sliding~ a bit even after you let go of the D-Pad or Control Stick.   It's disappointing, and the rest of the experience does little to redeem it, as the pseudo-3D bonus levels aren't all that impressive and the supporting cast is lifeless, mute and immobile. Tails and Knuckles just stand there, in place, looking bored, if you find them in a level. And it's not surprising to see  they're stuck in a game that could have been better.Sonic 3D Blast has its moments, when Sonic's looping, rolling and spinning around as you'd expect him to, moving quickly, being himself. But those moments are brief and fleeting  you always end up back where you started, controlling a plodding, slipping version of the Hedgehog through a world that calls itself 3D but is really anything but. A better, more vibrant edition of this adventure made it out for the SEGA Saturn years ago, and had a few more redeeming qualities to it  but this version is simply fair, and gamers looking for a classic Sonic game would be much better off spending their 800 Wii Points on one of the side-scrolling adventures instead.", "date": "Dec 5, 2007"}