{"name": "Zanac", "name_review": "Zanac Review", "ref": "https://www.ign.com/articles/2007/12/06/zanac-review", "text": "There's a comfort in consistency. In knowing that what happens once will happen again, in the same way, the next time after. Like playing Super Mario Bros.  after all these years, you know exactly where that first Goomba will appear. And the second, and third. It's always consistent. There's a comfort in that.   But Zanac isn't quite so comfortable. Zanac is a shooter that isn't consistent, as it's programmed in a way that makes precise replication of past play experiences nearly impossible. It's different every time, made in a way that constantly adjusts the difficulty level of the design to adapt to how well you're playing.   If you're blazing through the enemies with ease, weaving and dodging every potential collision and thinning the aliens' ranks by the hundreds, the game will adjust accordingly  and send even more enemies out against you, filling the screen with even more potential collisions. If, though, by contrast, you're getting blown up, missing out on power-ups and generally stinking up the joint, the game's challenge will shift in the other direction and start to go a little bit easier on you.   It's a novel idea, and even more novel when you consider its age  this is a concept that came out over 20 years ago. Zanac was first released in America on the NES in October of 1987, and its innovation in adaptive difficulty made it one of the most unique shooters of its age.   A wide array of weird-looking bosses is lurking in later stages.  Unfortunately, the ALC (or Automatic Level of Difficulty Control) feature never went too far beyond this title, since Zanac remained the only entry in its own series for the rest of NES system's lifespan. Compile, the developers responsible for it, went on to other projects that were somewhat related, like The Guardian Legend, and ultimately jumped to the TurboGrafx-16 to create Blazing Lazers.   Zanac's core gameplay, beyond the fact that it shifts and changes its challenge over time, is about what you'd expect in a vertically-scrolling shooter. You have a fairly mobile flying craft at your command, armed with a forward-firing standard gun and, secondarily, a special weapon. The special weapon defaults to a four-way cannon in the beginning, and blasts in the direction that your ship is currently moving. It can be upgraded, though, to a variety of other different functions, including a localized shield and a screen-clearing bomb.   The enemies advance against you on two planes, as in Xevious  some soar in through the sky, others attack from the ground. You're tasked to avoid the assaults from all fronts and make it to stage-ending boss battles, where the scroll of the screen stops in place and a timer appears, counting down the set number of seconds you have to finish the fight. Succeed in beating the clock and you're off to the next level.   The thing to make clear about Zanac is that it's a considerable challenge. Even when the ALC is ~helping~ you by making the enemy swarms less massive, it's still tough  this is a game that will take a lot of practice and patience to get into. Seriously. Those gamers not dedicated enough will likely get frustrated, and quit playing before making it through even half of the game's 12 stages.    So be warned of that ahead of time. There's a continue feature that helps out, and can place you back to a restart point near where you lost the last of your lives, but even with that in place the game will still take its toll on you.Longtime fans of the shooter scene on the Wii's Virtual Console should already know about Blazing Lazers, which is one of the best vertically-scrolling shoot-'em-ups to come from the TurboGrafx. Since Zanac was developed by the same company, it should appeal to those same fans  with the footnote that this design is definitely more archaic and difficult as a result. The programming that went into Zanac's experience and that allowed for its on-the-fly adjustments to in-game difficulty is a novel feature, and worth a look for those curious to know how it actually plays out. But it's still a tough game even at its ~easiest~ setting, so only serious shooter fans should spend the 500 Wii Points on a download from the Shop.", "date": "Dec 6, 2007"}