{"name": "Kane & Lynch", "name_review": "Kane & Lynch: Dead Men AU PS3 Review", "ref": "https://www.ign.com/articles/2007/12/06/kane-lynch-dead-men-au-ps3-review", "text": "It's good to see IO Interactive taking a chance, stepping away from Hitman and kicking off a new IP. New blood in the games industry is always welcome as far as we're concerned, and the concept behind Kane & Lynch definitely had us intrigued from the moment the game was announced. This is not a game, you see, about the good guys. This is a game about a psychopath and a man prepared to do anything to protect his family, no matter how many innocent people get in the way.   Kane & Lynch opens with Kane on death row writing a letter to his long-estranged 14 year old daughter, telling her that he regrets being absent in her life. Gee, do you think something might happen to her? It's a pretty safe bet, and we soon find out why. On his way from his holding cell to Executions R Us, Kane is busted out and soon finds himself before 'The 7'  former associates and mercenaries who believe that Kane betrayed them and made off with a whole lot of loot. The proposition? Get the loot back and his former wife and daughter won't die.   Accompanying Kane on his mission is Lynch - a highly unstable, heavily medicated individual who's liable to flip at any moment and start killing innocent civilians, much as he killed his wife. Charming. The pair are certainly not your average videogame protagonists, in characterisation or in looks. Kane is badly scarred, with a dead eye, and spends the game with a strip of plaster across his broken nose. Lynch, on the other hand, is a balding (but with enough hair for a mullet), non-descript looking individual with massive 70s-style spectacles. These two aren't pin-up boys in other words.   Taking a page from Nelly's book evidently.  Indeed, from the moment the game begins you know that IO isn't going to pull any punches in its pursuit of a gritty, hyper-violent story. Police are fodder to be mown down without a second thought, every second utterance is a swear word and you're in relentlessly depressing dilapidated urban environments. The ambition is admirable certainly, but the execution leaves much to be desired.   Sure, we could talk about the laughable tutorial at the beginning of the game, which packs in all the excitement of laboriously taking and equipping weapons out of a car's trunk before taking cover behind a vending machine, but that's only a tiny fraction of the game. Less easily forgiven is the fact that IO essentially fails in its core ambition of providing tense real-world shootouts. The ingredients are certainly there  a variety of good set-piece locations such as busting into and out of a bank and a shoot-out in a packed Tokyo club, squad mechanics that allow you to direct Lynch (and any other crims that may be along for the caper) and a cover system to bring a little strategy to the action. Sadly, it all feels incredibly clunky.   Perhaps the biggest issue is the mind-numbing mediocrity of the AI in the game. Watching these mooks running through their little AI routines, oblivious to the wider nature of the battle is laughable. While it's most obvious if you take a step back and just watch what's going on, it's hard to miss in the thick of the action too, with rigid enemy behaviour and friendly AI that's more than happy to step in front of your gun time and time again. We're also firm believers that the day when shooting an enemy in the face results in no reaction should be long past. Honestly, if GoldenEye 007 could have body part-specific hit animations ten years ago it's a little shocking to still be coming up against enemies that obliviously soak up bullet after bullet before finally being tipped over the edge into death.   The AI also pulls you out of the moment when Kane goes down. If you take enough hits (or fall from a height of about eight feet, which apparently results in 'twin ankle blowout') Kane drops to the ground and can be revived with an adrenaline shot from a squad mate. Too many adrenaline shots and he'll overdose. It's a good idea for a mechanic, but again, when Lynch strolls over, literally surrounded by a gun-toting SWAT team, it's pretty laughable that he can ask for a time out while he injects you and while you recover. It's a necessary evil for the mechanic  it wouldn't be any fun if Lynch was to be killed repeatedly trying to revive you (and indeed, Kane can be killed trying to revive a fallen team mate), but the real question is; perhaps the team should have used a different mechanic altogether?   Take any scene in the game and I'd be willing to bet ten bucks the next word out of Kane's mouth is four letters long and starts with 'f'.  Mission design is often woefully average as well, which is particularly depressing because there are a number of good ideas that just aren't matured and thought through. Take, for instance, the aforementioned Tokyo night club mission. Putting aside the fact that the punters are composed of only a handful of character models, many of whom are dancing in sync, the effect as you step into the club is actually bang on  information overload as a huge number of tightly-packed bodies dance in near darkness. Again, we'll put aside the fact that Kane pretty much just jumbles his way through the immovable crowd  this isn't Assassin's Creed after all - and get to the mission at hand.   You're there to kidnap a woman  Yoko - whose father may be able to help get the briefcase back for The 7. After shooting your way into her office Lynch knocks her out and slings her over his shoulder. Time to find an exit then, with Lynch in tow. This involves shooting your way through several dance floors, all filled with panicking club-goers desperate to flee but never actually going anywhere. The gameplay is actually pretty compelling as you look out for the flashlights the guards are holding as they pursue you through the morass. So far so good. Eventually you make it into the fire escape corridor and just as you're about to step through to the rooftop, Yoko simply jumps down from Lynch's shoulder, feebly kicks him in the nuts and runs back into the club.   Now, you can't go back the way you came because the door leading into the club is now welded shut or something - you can no long interact with it. So be it. You make your way across the rooftop and jump straight back into Yoko's office from the skylight, knock her out and begin to take the exact same route through the club again. This time, however, the punters have been evacuated so you're moving through an empty  but still dark - club. Again, we like having the two very different situations within the mission, but the actual justification is so poor that we can't believe there wasn't a better, more believable way to structure this sequence. And unfortunately, that's just one example of several.    Another half-baked element we should mention is the ability to use cover. It's standard issue for third person action games these days, but it's only been half-heartedly implemented. For one thing, there's no 'snap to cover' button, resulting in the player doing a little jig in front of columns, walls, cars and, erm, vending machines, trying to lock in. Secondly, there are plenty of cover-worthy objects in the environment that you can't use as cover, making the whole thing rather unreliable. When it does work seamlessly it's pretty smooth, allowing you to pop out from either side of a column or up from underneath a window. That said, there are some clipping issues, whereby you'll have a clear line of sight to a target but wind up shooting the object you're taking cover behind. Or  more annoyingly - where you'll be hit behind cover.   Have you tried 'oh bother' or 'golly gosh' on for size Kane? Swearing doesn't make you cool or tough.  It's a real shame that Kane & Lynch so consistently reveals its artifice because there are some really cinematic moments and tense fire-fights on offer. Early in the game, for instance, you're holed up in a caf, ready for a mad dash across a car park to a donut shop, behind which a getaway car will be coming to pick you up. You look out across the car park as cop cars roll in and a jet liner swoops directly overhead, coming in to land. Moments like these really ground the game with a sense of place, and while environments are largely understated in pursuit of a realistic tone, they're generally very convincing. In terms of the action, the police snipers that pop up regularly throughout the game  at first a source of frustration, soon bring a cat and mouse element to the gameplay. As you step into the open the sniper's site pops up on screen so you can see if he has a bead on you. A sniper can take you down in one hit, so it's a matter of covertly working out where he is, then popping out from cover to direct Lynch to take him out. Sadly, for the most part the gameplay just feels clumsy and the moment to moment action gets pretty repetitive too.   It's all over a little quickly too (even with a couple of hugely frustrating missions), with only splitscreen (no online) co-op to bring you back to the single player game. Adding a little to the package, however, is Fragile Alliance, one of the more interesting multiplayer modes of recent memory. In it, players work their way through an environment (such as a bank, diner and traditional Japanese garden) as a team, taking down any cops that stand in their way. Loot is then distributed amongst the players that make it all the way to the end. In other words, the fewer people make it, the more cash you get, so why not bump off a couple of other players for a greater share of the spoil? It's all about balancing your need for allies to actually get to the loot, with betrayal, backstabbing and revenge. Fitting considering the themes of the single player game.   That's some serious cash-flaunting going on there. At the end of the day, Kane & Lynch succeeds in several areas. The story is well delivered  a mixture of cutscenes and dialogue during play, and is as unrelentingly vicious as its action and its twin protagonists; surely the most unlikeable leads seen in a game in recent memory. The world is well-realised too, suitably gritty in tone, with nicely detailed lead character models. Sadly, the positives dont outweigh the negatives, with the clunky gameplay, poorly structured missions and woeful AI making this game more of a chore to play than a joy.", "date": "Dec 6, 2007"}