{"name": "Puzzle Quest: Challenge of the Warlords", "name_review": "Puzzle Quest Review", "ref": "https://www.ign.com/articles/2007/12/10/puzzle-quest-review-2", "text": "Puzzle Quest: Challenge of the Warlords has become a cult favorite since it was released on handhelds earlier this year.  A deep, addictive experience, it lent legitimacy to casual games like Bejewelled that so-called ~hardcore gamers~ often ignore.  After the game's quick success, console ports were announced for just about every platform under the sun.  Puzzle Quest has arrived on the Wii, but the developers have made several detrimental changes to its design.  The addictive gameplay is still here, but this port is not easy on the eyes.   The folks at D3 and developer Infinite Interactive (with help from Vicious Cycle) have begun a socialization experiment that is finding gamers from both casual and hardcore camps playing the same game. Puzzle Quest attempts to marry characteristics of traditional RPGs with the pick-up-and-play mechanics of a casual puzzle game -- and succeeds.   All the usual suspects of classic RPGs are here: players select a character from a roster of different classes of knights, druids, and wizards; set out on quests; slay monsters; and collect experience points. Unlike most RPGs, though, battles in Puzzle Quest are played out on the Bejeweled field. If you haven't played the PopCap game, Bejeweled is a gem-matching puzzle title where you flip two adjacent pieces at a time in order to create matching rows of three or more jewels. As you create matches, they disappear and more spill in creating new match-making opportunities. There have been many variations on this simple, addictive formula, but Puzzle Quest is the first we know of to mix in fantasy art and deep RPG mechanics.   Eventually you'll fill in some of that wasted space.  But too much room has been relegated to spells and items while the puzzle field suffers. During battles, players go head-to-head against an enemy who is playing off the same field as you. You and your opponent take turns, so your move can end up being beneficial to the enemy's or vice versa. The four different colors of gems (red, blue, yellow, green) represent different types of mana. As you clear the field and build your reserves of each type, you can spend your mana in different combinations to cast both offensive and defensive spells. If you manage to clear four jewels at once, you'll receive an additional turn. Clear five and you'll receive the extra turn and a wild card will appear that can be used as any color of mana and multiplies the amount you receive. Skulls are peppered throughout the play field, and can be used to attack your opponent when cleared. The battle will rage on until one of the side's hit points are reduced to zero. Luckily, if you lose, you retain all the experience you collected during the match -- a feature that helps keep Puzzle Quest from becoming frustrating.   It wouldn't be much of an RPG if you couldn't improve your character's stats and outfit him or her with all sorts of stylish gear. Along with all the gems and skulls on the puzzlefield are gold pieces and experience stars. As you travel about the world map, each town has a shop selling weapons and armor. Some items require you to reach a certain level before use, however, which is where the experience stars come in handy. While you initially receive the same amount of mana/experience/gold as gems you clear (three to five pieces), leveling up your character's stats will result in bonuses in each of those areas.   Those are the basics of Puzzle Quest's gameplay, but as you make your way through the land of Etheria you'll realize that there is a lot more depth to be explored. You can expand your hometown citadel with additions like dungeons, towers, and stables. Each expansion grants you new abilities: once you have a dungeon you can capture your enemies; once you have a stable you can train captured monsters as mounts; once you have a mage tower you can learn spells from enemies. You can lay siege to other castles and bring them into the fold of your kingdom. A siege is handled on the field of puzzle, but castles will have much greater hit points than most monsters. Defeat the castle in battle, and its citizens will begin paying their taxes directly to you.    There is quite a lot of customization available to players who choose to delve into their many options. You can only have six spells ~equipped~ at a time, and you'll soon find yourself with dozens to choose from. Items generally enhance a certain mana or skill, so you can pick the gear that will be most effective against a given enemy. There are also plenty of side quests that are good for leveling up your character. All of this is optional, though, and a casual player who isn't interested in micromanaging their characters stats can play through the game ignoring most of these extras.   Players can use either pointer control or the Wiimote/Nunchuck combo in Puzzle Quest.  The pointer is intuitive and allows you to click your way through both puzzles and quests, but it slows you down quite a bit.  It's also too easy to make a mistake during battle, costing you your turn and a few hit points.  Attaching the Nunchuck provides more precise control, but then the menus are mapped to just about every button available in a confusing mess.  What's really puzzling, though, is that there isn't an option to use just the Wiimote in the ~classic controller~ horizontal position.  If you choose not to use pointer controls, you must have the Nunchuck connnected.  And if you're playing multiplayer with a friend, you both must use the same control scheme.   Sissy has not spoken with his father in some time.  Likely, he is still smarting over his given name. With all the addictive gameplay intact in this port of Puzzle Quest, it's quite disappointing to see the visuals taking such a hit.  Right off the bat you'll notice the game does not run in widescreen, which is, frankly, inexcusable in 2007.  But its biggest offence comes in the battle scenes, which squash the gem field down to a small section in the middle of the screen.  There is a lot of wasted space on either side for spells and items.  This makes the game feel cramped, like you're playing in a tiny hole.  The battles are the focus of the game -- they shouldn't be sacrificing real estate so I can see the items I already know I have equipped.   The music is another area that was apparently phoned in for this port.  While the tunes are the same (very catchy and appropriate), they don't segway from one to the next.  A song will jarringly stop in the middle somewhere and the next track immediately begins.  A simple fade-in/fade-out would have been appreciated.  When I was testing the multiplayer with other editors, we laughed every time this happened.  And we were not laughing with Puzzle Quest...   Local multiplayer is available for matches between profiles saved on your system.  Battle plays out just like in the single-player mode, with each user taking turns swapping jewels.Puzzle Quest has been one of the pleasant surprises of 2007. The unlikely marriage of puzzle gameplay with RPG mechanics makes for one of the most addictive experiences of the year.  At $30, the Wii version of Puzzle Quest is the most expensive out there.  But it looks, sounds, and controls worse than versions that cost half that.  The core gameplay is rock solid, and you definitely don't want to miss out if you haven't already played the game.  But what could have been one of the Wii's standout puzzle games ends up being a half-assed port.", "date": "Dec 10, 2007"}