{"name": "Fantasy Wars", "name_review": "Fantasy Wars Review", "ref": "https://www.ign.com/articles/2007/12/11/fantasy-wars-review", "text": "Fantasy Wars suffers from some of the problems the uninspiring title might hint at. The presentation values aren't grand, the story is not worth remembering, and it features unremarkable visual and auditory accompaniments. While on the surface the game might seem rough, the turn-based gameplay is actually very decent with a good use of terrain for strategic purposes and enough units and upgrades to make movement and combat decisions worthwhile and entertaining.   Fantasy Wars is a turn-based strategy (more like tactics) game that uses a hex board and sets various units of humans, orcs, and elves against each other. You're charged with moving your units across the board to kill enemy units, capture enemy towns, and eventually complete whatever objective has been laid out (usually the capture of a castle somewhere).     The story here is completely forgettable like many orc vs. humans vs. elves stories are and follows the emergence of an orc leader that unites the warring tribes into one huge army because, hey, orcs just gotta fight. But like I said, it's almost completely forgettable and is only there to provide a little bit of context for the various scenario maps.   Units are set up to work basically the same on each side. You'll find skirmisher units that can attack from afar without engaging and then withdraw to a safer distance, ranged units that can fire missiles over multiple tiles, and melee units, both mounted and on foot, that can attack directly but can then be counter-attacked. Each of the factions seems to have what basically amounts to the same units. There's a heavy melee unit on each side, basic archers, and so on. There are some differences farther down in the unit tree like the manner in which the flying units attack more ranged or melee type units and so on. In some cases the differences may be subtle, but they should be enough to really keep commanders on their toes in order to make the right decision about which units attack which enemies.   Fantasy Wars uses an experience system that allows each unit to gain bonuses through participating in combat. A choice of three skills pops up when a level is gained. These can be active, which means you'll have to activate them yourself, or passive, such as a trait that provides better defense in forests. These specializations really help make the units feel different in combat and useful for varying situations. It would have been nice to see some more visual cues to differentiate the units with certain abilities on screen, but it's easy enough as a right click to find that information as well. The experience also has the added effect of making you care more about your units since the upgraded ones can be much more useful. When one of your level four units dies, you'll be sad.     You'll want to check all of these skills out to make sure you're using your units wisely by sending them to the best terrain, using the urban assault crews to attack cities, put the ranged units behind the melee units for protection, and so on. There are plenty of tactical decisions that can be made in Fantasy Wars when it comes to both the units and using terrain effectively. Getting enemies to attack you on territory with a higher defense rating or one which is good ground for a particular type of unit is part of the trick. It also makes some of the map design very important. Assaulting a castle, which has a huge defense bonus, from a river, which has a huge defense penalty, is just asking for death. Moving units across a river at all can be dangerous because of the movement penalty, which often results in them getting stuck in the river and becoming easy prey for enemy units in the area. The approach to terrain here is good and gives an added layer of depth to the scenarios.    These factors are what make the strategic decisions interesting. Should I ford the river here or hope to move my men across the bridge quickly? Should I hold back and assail the castle with ranged units or do I have units that can risk an all out assault? The main issue is that patience is not a virtue here so decisions have to be made that will most likely put your units in peril. While you can sit and think as long as you like during a turn, there's a turn counter constantly going up. Once you've passed a certain number of turns, the day is lost and you'll need to either load up a save or start over. For those players that are even more aggressive than the game requires, there are extra trophies that can be earned by completing each level in fewer turns. Some of the gold trophies seem ridiculously out of reach, but I suppose that must mean that the level of skill that can be obtained after playing for a while must be pretty high.     The system definitely pushes the action out into the field, which can be good, but there's often little room for error, which might frustrate some of you turn-based fans that are used to exploring maps a little more thoroughly before time runs out. Because there are often so many enemies coming from so many directions, it can be very difficult to complete all of the secondary objectives with the limited number of units. You can place more units on the field (when the cap isn't filled) or reinforce existing units, but that takes money and money is almost always gathered by capturing cities, which can take a few turns. It'll push you towards the final objective even if you don't want to move on quite yet, usually for no well explained reason.   Visually, Fantasy Wars is full of bright colors and uses a fairly cartoony style. It's certainly not what I'd call impressive and manages to look better from afar. While it's nice to see some of the battles zoom in for an closer view of the action, it shows off the lower quality models than we've become used to on the PC. The character design is pretty standard stuff for the most part. There are a couple, like the main orc hero, that are pretty terrible designs, but otherwise there isn't too much to get vocal about either way.   Sound is either forgettable, as in the case of sound effects and music, or bad, as in the case of many of the voice-overs. The orcs in particular have cringe-worthy voices that at one moment mimic a constipated gorilla and the next a weasel having it's testicles squeezed in a vice.    Fantasy Wars has some gameplay features that make it worthy enough to check out. Its not as complex as many turn-based strategy titles out there, but thats not necessarily a bad thing. A great use of terrain, decent number of units, and large number of unit upgrades make the strategic decision about where and when to attack both important and interesting. The turn countdown is a decent idea as well and forces players out into the field a little quicker, but can tend to cut off the chance to fully explore a map in some cases. Either way, the challenge for those that choose to try and grab the gold medal in each level is going to be pretty extreme. Fantasy Wars doesnt have the slickest package around, but its heart is good and those looking for a pretty active turn-based combat game will likely find enough to enjoy.", "date": "Dec 11, 2007"}