{"name": "WipEout Pulse", "name_review": "WipEout Pulse: AU Review", "ref": "https://www.ign.com/articles/2007/12/11/wipeout-pulse-au-review", "text": "Playing WipEout Pulse for the first time was kind of like walking into a nightclub and entering a breakdancing competition without knowing how to breakdance. Amidst the flashy neon lights, kick-ass tunes and an atmosphere of sub-zero coolness, I walked on to the dance floor and proceeded to trip, luckily cushioning my fall with my face. The other anti-grav racers flew off the starting line in a graceful swoosh of afterburners and delicately balanced turns. At the same time, my flyer did its best impersonation of a shopping trolley with a wonky wheel, all while being dragged in opposite directions by tethered kangaroos. Instead of slotting neatly into the perfect racing line, my craft had an unnatural attraction to the trackside walls, filling the screen with sparks and smoke. I'd forgotten what an unforgiving lover WipEout can be.    For the first handful of races, my love for the sound of scraping metal meant I didn't place in the top three spots, necessary to unlock more events. To be pathetically honest, I didn't manage to arrive in the top seven. Out of a field of eight. But then it clicked, in the way that only WipEout titles can. I stopped thinking. Without realising it, my brain had soaked up the precise location of every corner and speed pads. When I stopped trying to remember where to go, my subconscious guided my hands as if I wasn't even there. I hit speed pad after speed pad, precariously missing the sidelines and flying through the course at speeds approaching that of a bullet. And that's when the warm fuzzy WipEout feeling hit me for the first time since I originally fell in love with the series on PS1. Even better, this time around I wasn't a sketchy mess after a night of sweating in a warehouse, listening to (cr)happy hardcore cranked to brain-melting levels.   Race or shoot - you decide.  If there's one thing that I've always admired about WipEout, it's the initially intimidating learning curve. It's not so much a curve as a cliff-face, reminding you of how inadequate your meagre human reflexes are. Frustrating to begin with, it's only after a thirty minutes or so that it all comes together. Pulse makes it a little easier this time around, with its Grid system of unlocking races. You start with access to a couple of events  pass these and those around you unlock in a non-linear fashion. Thing is, they're not just straight races  there's a variety of different challenges to cut your teeth on. Obviously some are your meat-and-two-veg race against the pack mode, but there are also different types of time trials as well as the beloved Zone mode. The new Elimination mode is a nice inclusion  the only way to win is to blast every other flyer off the track.   These modes are all unlocked in such a way that they help to train the synapses in your brain to fire just that little bit quicker, allowing you to progress steadily and smoothly through the game without realising just how damn good you're getting at it. By the last series of challenges, the PSP's screen is a blur of flying polygons and pixels. Yet you'll be in total control, piloting your flyer as if you've become some kind of Cylon raider, melding mind with machine.    If there's one issue with this new system, it's that you revisit the same tracks time and time again. That's because there's only twelve of them. But you'll need to revisit them so often if you're going to have any chance of winning in the faster classes. They're also reversed as well, doubling the amount of info you need to process at faster-than-light speeds. They're all nicely designed, with a nice mix between bendy, fiddly tracks and those with long, sweeping corners and booster-laced straights. The occasional shortcut makes an appearance, though whether or not I managed to make it into most of these was usually a matter of chance rather than any predetermined planning. The biggest new track feature has to be the mag-strips though. These suck your vehicle to the track like a lawyer to an ambulance, allowing the tracks, and your vehicle, to now rotate through 360 degrees. At times the tracks feel more like a rollercoaster than a serious racing road  and it's all the more fun because of it.    Compared to other racers (not just on PSP), the floaty yet highly controllable handling of the controls feels fresh and original. It's a similar syndrome to Sega Rally and Unreal Tournament 3, which both feel new by being old, if that makes any sense. It's been almost three years since the last WipEout, so we've had time to forget just how different the vehicles in the series control to everything else.    Doin' the bump and grind.  A plethora of online options completes the racing experience. Local network play for eight was to be expected, but the inclusion of online racing is a nice touch. Sadly I couldn't test this at the time of writing, but if it works well it'll be a captivating experience. There's plenty of downloadable content available already, and you can even whip up your own skin on the website, and then import it onto your vehicle.    Pulse's graphics are so sexy that you'll wonder whether the game's UMD has installed a sneaky firmware update, turning the PSP into a Silicon Graphics Workstation. The tracks are very detailed, the vehicles leave gorgeous incandescent burner trails and there's plenty of sparks and smoke all over the shop. More importantly, the track stretches for hundreds of metres into the distance, allowing your subconscious mind to recognise upcoming obstacles. Yet it all flies by incredibly smoothly, delivering the sense of speed the series is renowned for.    This immaculate presentation extends to every other area of the game, as expected from a series that spawned an entire design philosophy. The menus, the voices, even the loading bar  all are exquisitely crafted pieces of art. And did I mention the sublime techno soundtrack, including such icons as Kraftwerk and Aphex Twin? WipEout Pulse is the new racer to own on the PSP. It feels better, plays better, sounds better and looks better than every other racer on the system. Hell, it's better than certain next-gen racers that we dare not mention. Sure, its not a massive reinvention of the series. But with almost three years free of the brain-frying WipEout experience, were just happy to have something new which recaptures the glory days of old.", "date": "Dec 11, 2007"}