{"name": "NCAA March Madness 08", "name_review": "NCAA March Madness 08 Review [PS3]", "ref": "https://www.ign.com/articles/2007/12/11/ncaa-march-madness-08-review-ps3", "text": "The college basketball season is like a locomotive shooting down the side of a mountain. It starts slowly, pushing off from a fully stopped position then continues to build speed and momentum until it reaches its terminal velocity, symbolized in college round ball by the tournament to end all tournaments, otherwise known as March Madness. Each year EA Sports' collegiate contender of the same name goes through a similar process of releasing to little fanfare and then gaining popularity as the suspense and excitement for the NCAA Tournament builds. For basketball gaming diehards however, their fix for college b-ball has just arrived for the ensuing season. Does it perform under pressure or crumble at the first sight of adversity?Each year NCAA March Madness focuses on one new feature that will hopefully help to deliver a more complete basketball package to fans. This year that one focal point of development attention is low-post play, both on offense and defense. EA Canada has said that they intended banging on the block to feel like a mini-game of sorts and in some respects it does as most of the mechanic's features fit right in with the natural ebb and flow of basketball. On defense players can flick the right stick to switch their defensive stance around to give the offense different looks and on the opposite side of the ball there is a whole list of moves that can be pulled off once you get the rock. Your big banger can pull off pump fakes, up and unders, spin moves, and a few other moves, all of which are portrayed fairly well by the game's animation system.Our only concerns with the low-post play are that if your favorite squad doesn't have a dominant big man then the game can feel much more similar to last year's effort than EA would like to admit. Then there's the set of animations. While they do look realistic, you'll notice repeat movements a bit too early on, especially the spin and up and under moves.The rest of the changes and new features in March Madness 08 are mainly aesthetic, without much that alters the way you'll play the game. The dynasty mode features the same deep recruiting complete with challenges and school pride unlockables but it now has a shiny new ESPN.com display. It's a sexy paned style of information delivery that certainly ups the presentation value, but does little for the package as a whole. Don't get me wrong, the dynasty mode is as solid as ever, there just aren't many truly new features to be found.The arenas really come alive. The gameplay on the court feels a bit finer tuned than what we saw earlier in the year from NBA Live 08. Animations seem to link together with more fluidity, though it's still not up to the level that we see in College Hoops 2K8. Ball physics is something that needs to be rewritten and retooled for next year's game. The animations of the spherical piece of leather just don't look quite right which then takes away from the overall realism.Offensively you'll notice that the right analog stick still governs your four basic fancy dribbling moves, and while the list isn't as expansive as what you'll find in College Hoops, they still serve the gameplay well enough. The shooting mechanic is still way over-simplified. Simply hold the B button (circle on Playstation 3) and the shot animation will carry out without having to worry about kind of timed release or multiple button press. The defense in March Madness wisely chooses to leave NBA Live's new lock-on defense to the professionals and instead sticks with its lock down stick that debuted on Xbox 360 last year. There's much more skill involved here as you'll have to maneuver the left stick in conjunction with finding the proper angle with the right.As any true fan knows, a big part of the college basketball experience is delivered through the crowd, and March Madness does a solid job of bringing the student population into the game. The Impact Moment is an interesting ploy to up the level of interaction between the players and the crowd, but it feels a little under-developed. There's no true benefit -- no boost in stats or composure -- when you fill up your impact meter and activate it. You'll hear the crowd cheer and Vitale and Nessler will make a comment or two, but that's about it.Low-post play changes the gameplay a bit. Speaking of the classic commentating duo of Brad Nessler and Dicky V, they once again deliver solid energy to the broadcast-style presentation. Their comments might repeat a few times here and there, but they're still applicable to most of the major scenarios that happen through the course of a game. Couple their quips with the hysteria of a roaring college crowd and March Madness 08 winds up sounding fairly close to the genuine article.Erin Andrews is being touted as a big addition to this year's broadcast team and she regularly makes her presence felt by offering solid, if not a bit generalized, insight into the action. I prefer the former Florida Gator (I know way too much about Erin Andrews) to the 2K8 alternative of Tracy Wolfson, both in aesthetic appeal and reporting proficiency.The only other notable additions to the stable of features are the classic teams and online leagues that are making their way into the gaggle of '08 EA Sports games. The classic teams are what you'd expect. You'll see 74 squads represented from their heyday and though it doesn't add a whole lot of substance, diehard fans will get a kick out of playing with their out-dated alumnus. The online leagues support 32 users; sadly we'll have to wait for the full roster of 64 squads until next year's game. EA Sports is again using a more free-form schedule where players aren't constricted by having to meet at a specific time and play their games.Dunkeroo, baby! The graphical flair of March Madness is more or less equal to Hoops 2K8 offers. Compared to the livelihood of what 2K's baller brings with jerseys and shorts that flow with players' movements March Madness might pale in comparison, but the crowds in EA's game help to bring it back up. Sadly the PS3 version of March Madness is yet another casualty to the laziness of developers when it comes to porting a game to Sony's system. There's horrific aliasing, the frame rate is much lower with animations that look downright awkward on occasion and load times that are more than three times what we found on 360. The menu presentations are still much more stylish than what we see from 2K8 and the ESPN license once again helps to authenticate the entire experience but the PS3 is definitely a step behind Microsoft's system.NCAA March Madness 08 is a solid basketball title and is definitely a step above what we saw from Live 08. The improved fluidity is something that only 360 owners will get to enjoy, much to the dismay of Sony Nation. The March Madness franchise is definitely making strides (albeit short strides) in the right direction. There arent enough gameplay additions that push the package forward to warrant dropping the cash if you already have last years game, but if youre a diehard fan or havent laid your hands on March Madness in a few seasons (and dont own a 360), March Madness 08 is the best -- and only -- collegiate effort for the series available on PS3.", "date": "Dec 11, 2007"}