{"name": "International Track & Field 2000", "name_review": "International Track and Field 2000", "ref": "https://www.ign.com/articles/2000/06/02/international-track-and-field-2000", "text": "If we really needed a 3D update to the button slapping arcade action of the classic Track and Field games, then we darn sure need to be able to own the cartridge itself. Apparently we only need to experience all of that fun in limited doses because Konami's International Track and Field 2000 is only available for rent and IGN64 has concluded that it's at least worth a trip to Blockbuster. Not more than one trip, mind you, because we don't think your fingers or nerves could take the repeated stress.  The Facts   12 countries to choose from: China, USA, Russia, Germany, Cuba, Korea , France, Australia, Canada, Great Britain, Japan, and Kenya.   Real Olympic Events like the Shot put, Pole vault, 100m Dash, 100m Hurdles, Discus throw, Long Jump, Triple Jump, High Jump, Javelin, Hammer throw, and 100m freestyle swimming .  Motion captured animation.  Multiplayer support. High Resolution Graphics. 4MB Expansion Pak support.  Realistic 3D character models.  Authentic P.A. system.  Quick Play and Championship game modes.   Gameplay Few games in the N64 library can match Track and Field's ability to abuse and mangle the human body. Mario Party comes close, but T and F takes manual torture to a whole new level with all of its button tapping and analog stick twirling. Being the sadistic souls that we are here at IGN64, we happen to like the physical challenges T and F presents.   First things first. The button tapping is set up so that the top row of buttons on the N64 controller (B, C left and C up) and bottom buttons (A, C down and C right) serve as opposites. Tapping alternately between any button in the top row and any button in the top row will generate the speed or power necessary for the events. However it's not enough simply get in a rhythm in your alternate button tapping, T and F requires you to hit those buttons as fast as humanly possible to win medals or break records.   We do like the way each event in the game has its own controller challenge because it represents the real life challenge of the event. For example, the 100m sprint simply requires you to get the fastest rhythm you can. The 100m freestyle swimming event is more alternate button pushing, but it's more of a test of endurance since the race lasts nearly a minute. Furthermore events like weight lifting, gymnastics and the poll vault have very complicated controls that will have you balancing your speed, endurance, timing and reaction to be the ultimate athlete.   Track and Field has both a steep learning curve and skill curve, because learning how to do the events is only half the battle. Actually doing it is the tough part. Unfortunately however, once everything comes together for you, there's not much more to challenge you. That is, once you learn the pattern, pacing and timing of the hammer throw and get the process down, you'll be winning gold medals and setting world records immediately. You'll just have to get used to twirling that analog stick with the middle of your palm as fast you possible can without bleeding or screaming in pain. The game quickly becomes a pass/fail type of experience where you either get it or you don't and once you do there's not much left to challenge you.   Gathering around the TV with some buddies to see who has the most durable and fastest fingers can make for some great party gaming as well. In fact, these multiplayer experiences may be the best challenge of all because the bragging rights will be hard earned against human opponents.  There's not much variety however in either single or multiplayer competition with every event unfolding using similar camera angles and animations. The limitations put the ~track~ in Track and Field.  Graphics The game supports the Expansion Pak and boasts of a surprisingly crisp high resolution mode. It still looks like an N64 game, but the human characters (how we love them) look very solid and lifelike. Because the animations are so limited, there aren't too many significant drops in framerate.   By limited animations we mean that a guy clearing the high jump at 2 meters looks a lot like a guy clearing the high jump at 3 meters. Yes, the bar will be higher and he will travel further through the air, but it's the same set of animations used over and over again, but they're stretched out to get the proper effect.   The rest of the field of competition is pretty flat, literally. Other characters in the game, like the officials and timekeepers are super flat, sparsely detailed sprites that make the game extremely flat and surreal. In events where there are multiple polygonal characters, like the races, you'll notice stuttering framerates especially with extra human players involved.   Sound The best part is the grunt the hammer throw guys make. Regardless of national origin, the big brawny throwers put a lot of vocals behind the throws. Beyond this the sound in Track and Field is limited to squawky public address announcements.  The PA announcing is realistic in that you probably wouldn't be able to hear every syllable if you were actually at the various events but this is a videogame. The announcer is inside the television supposedly and we should be able to hear her just fine.   The sound effects are all appropriate with feet hitting the track and whatnot. Now that we think of it, Olympic athletes don't usually speak much when they're on the field of competition so we're not really missing anything there. And upon further review, athletics events on television are usually pretty quiet when you take away the constantly babbling announcers. So we'll say that Track and Field 2000 is authentic in many of its sound presentations, but again this is a videogame, and we want to hear a little more ambient noise and effects than what we have now. ITF2000 is worth a rental no doubt. IGN64 isn't going to change its standard for reviews simply because this game isn't going to be on store shelves. Renting is always a suggestion we make when a game will appeal to some but not the majority of N64 gamers out there. Since renting is the only way to experience Track and Field, we're sure it'll be worth it to the pain-loving blister fingered hardcore gamers out there. That and the fact that this makes for a nice alternative to the Mario Party when you want to get together with friends and waste a night playing games. No mushrooms or rainbows to deal with here, but the mini games of MP will prepare you well for the hand thrashing ITF2000 has to offer.", "date": "Jun 2, 2000"}