{"name": "Jewel Quest Expedition", "name_review": "Jewel Quest Expeditions Review", "ref": "https://www.ign.com/articles/2007/12/12/jewel-quest-expeditions-review", "text": "It may have an epic storyline and a Raiders of the Lost Ark-style title, but let's be honest: Jewel Quest Expeditions is merely a puzzle game that's ~inspired~ by what many of us have experienced as Bejeweled, Zookeeper, or most recently, Puzzle Quest. The Nintendo DS version is an advanced version of the downloadable version produced by iwin.com, made for computer gamers as well as for Xbox Live Arcade players. The update on the handheld brings a couple of new twists to the gameplay, and wraps it all together in a goofy presentation that features an archeologist explorer on a treasure hunting adventure through Africa. Skip over the stupid and unnecessary story and you'll have a good time with this fun, albeit completely unoriginal puzzle design.   In this design, the task is to group three or more of the same gem or treasure by swapping one's position left, right, up or down. Only treasures that have a match can be shifted positions, restricting your available moves on the playfield. Sounds like the usual Bejeweled fare, right? The twist in Jewel Quest is that you can only move on if you've activated a combo in every single sector of the puzzle. When every square of the board is lit up, you've won the puzzle and, hopefully, some bonus points for time left over on the clock.  Jewel Quest Expeditions changes things up slightly by altering the playing fields' shape and size. Each puzzle has a different form, which changes the strategy a bit since you now have to work with gaps in the field, and since you can only swap tiles' positions, having more edges to work with means more limits in where you can move.   Other additions include a coin system where you're rewarded with a free treasure removal if you match three coinsthis ability gets stored away until you need it. There are also treasured buried in rock that can only be freed up and played if you match like treasures next to them, otherwise they sit stagnant and can't be swapped around.   Puzzle game good, storyline stupid.   We already know the basic design works, since we've been playing this game for years as different editions from various game designers. And what iwin.com added to the mix works for Jewel Quest Expeditions  this game doesn't lose anything with the new twists and turns, and in fact we like the additions the company made to the core mechanic. And the addition of eight player competitions through single cartridge multiplayer? An excellent inclusion that doesn't go unnoticed.   But what doesn't work is the game's story. Between each puzzle you unfold the adventures of this exploration dude as he works through the jungles of Africa. It's all a bunch of ~who cares?~ and it completely disrupts the flow of the puzzle experience. And unlike other puzzle games, there's really no endless marathon mode in Jewel Quest Expeditions, so if you want to play this game you have to work though the story progression and its 180 different puzzle layouts. The game only keeps track of the player's accumulated score  no statistics or individual score tracking. That's a bit of a downer.Jewel Quest Expeditions is a solid puzzle experience that has a bit of Dj vu if you've played a handful of other, higher profile Nintendo DS games. There's a bit of unique personality to this title, but not really enough to say so, especially if you're already working through the much more satisfying and complete Puzzle Quest. You can't beat the price, though  fifteen bucks as of this writing is the perfect price tag for a game this simple and casual.", "date": "Dec 12, 2007"}