{"name": "Next Life", "name_review": "Next Life Review", "ref": "https://www.ign.com/articles/2007/12/12/next-life-review", "text": "Spoiler alert: The main character dies in the first two minutes of the adventure! It's a car accident, poor chap. Instead of burning forever in the bowels of hell for answering his cell on the road, he is sent to an island to be greeted by a rag-tag bunch of multinationals, who oddly can't seem to agree what year it is. They subsist on biscuits and water, and every evening after a bell tollsthird chimes the charmeveryone mysteriously falls asleep. Next Life is a point-and-click adventure in which you attempt to figure out what the hell is going on.   It's also a game in which you collect sticks and stoneseveryday. Unfortunately, there isn't much bone breaking to be done--mostly just making fires, prying doors-- although you do get to whack a fellow in the head, which is very satisfying after all the non-action. But then this isn't a game about action, this is a game about the search for the answers. It's about atmosphere and cleverness at solving puzzles.     Or rather, it should be. Mostly it's a game dealing with the tedium of the moment to moment movements of your stick-in-the-mud Bohemian (in the literal sense: ~Good day, my name is Adam and I come from Bohemia,~ which for those keeping track, is in the Czech Republic, where the game devs are located!) He is so stiff and so slow that you just want to physically pick him up and throw him across the screen. One of your first tasks is moving a boulder and getting to it involves climbing. Might as well have a bathroom break or something after you click, because he takeshis sweet time. For such a healthy-looking guy, Adam is severely lacking in agility. I want to adventure with someone who can handle the island environment, and not some jerk who has to turn in place before taking a halting step in the direction I pointed him.   Also, I'd be pleased if there were just one mouse button to click. Other adventure games have done just fine having you always clicked the left button. Interaction to be had? Left mouse button! Investigate to undertake? Left mouse button! Next Life felt the need to disrupt that simple formula by sticking the investigation portion on the rightbut is there really that fine of a line? It throws off the flow quite a bit when you start realizing you should compulsively right click everything rather than get stuck for an hour because of an arbitrary button assignment.     Not too far into the game Adam begins to have strange dreams, which play out in puzzle segments that take place off the island. The first of these, on the top of a huge crane, also introduces you to one of the more interesting, if a little frustrating, aspects of the experience: mini-games. Mastering your fear of heights by rolling 2-D marbles through a maze is one thing, but I think my favorite is the CPR mini-game that occurs later on, only because of its adorable icons. You block the lightening from entering an electrocuted mans heart, while allowing the blood drops to flow through.        Not quite as welcome as some of the mini-games, are the timed tasks. One example is infamous enough to be known as the ~seatbelt dexterity puzzle~ in the forums. The set-up: You're trapped in a car and for some reason the oncoming train refuses to acknowledge your existence even if you wave or honk the horn. Use your brain in the exactly way the developers intend or perish! Granted, adventure games always require you to puzzle things out, and that is half the point, but when you're not granted the leisure to do so, frustration escalates rather quickly. There are actually zipped save files you can download in the forums to bypass it, for the weary who still want to complete the game.   As for the atmosphere, the ambient noise is fine enough, but the voice acting is distractingly fraught with stereotypical accents, some of which are just poorly done, others plain incorrect. I've heard worse, but these could've been a lot better considering one of the main questions of the game is what a bunch of such random people are doing on the island.    Next Life also suffers from poor localization. I could give it the benefit of the doubt and say that the intent was for all these non-native speakers of English to sound authentic, except for the typos in the subtitles, and weird disparities between the spoken and text versions of the dialogue that betray less planning than required.  Next Lifes story gets moreintriguing? as you go, but the animation and gameplay continue to be a slow drip of super-clunk tempered only a little by a sprinkle of more action-oriented mini-games. The atmosphere is marred by uneven voice acting quality while the pressure of a time limit occasionally screws with players problem solving method. Your current life should have enough good games in it this time of year without having to adventure beyond the beyond.", "date": "Dec 12, 2007"}