{"name": "Link's Crossbow Training", "name_review": "Link's Crossbow Training AU Review", "ref": "https://www.ign.com/articles/2007/12/12/links-crossbow-training-au-review", "text": "Many Nintendo fans have fond memories of the NES' light gun. How many hours were whiled away as a kid, playing Duck Hunt? For myself, plenty, but looking back on it now, it seems that most of those hours were played  not for a pure love of the game  simply because my NES collection was paltry at best, and on those dull days where your friends are outside riding their bikes and burning things, the dedicated nerd-in-making needs something to play.   Which brings us to Link's Crossbow Training, the latest game destined to be played more for something to do than for its innate fun-ness. The game comes packed in with the new Wii Zapper, which is less a light gun and more an attachment for your Wiimote and Nunchuk. The core difference, as anyone who uses a Wii would know, is that you're not actually pointing at specific locations on the screen to shoot them, you're simply moving the reticule relative to the sensor bar. In other words, you're not actually able to 'look down the sight' to shoot at stuff, which makes this game a little easier on the arms, but definitely reduces the feeling of immersion, as well as the need to actually have a gun attachment.    The game allows you to adjust the horizontal positioning of the reticule so that you can make it feel as close to point-and-shoot as possible  plus you can change the speed at which the reticule moves, but it's worth reiterating that this is a fundamentally different system to a normal light gun. For instance, in a series like Time Crisis or House of the Dead, you don't actually know where you're going to shoot until you pull the trigger and see the icon on-screen, whereas in Link's Crossbow Training you always have a reticule which you simply move across the screen.   That's not to say Link's Crossbow Training is easy, just that it's a different kind of challenge. Across the game's nine levels (each of which is divided into three stages), you'll be challenged not just to shoot enemies and targets, but to hit consecutive targets to multiply your score, as well as to move about with the analogue stick to reach said targets.   This in-game advertising is getting less and less subtle. What's next - Big W?  What kind of challenges are on offer? Well, first up in each set of stages is target practice. At the beginning you'll simply be clocking stationary targets as they pop up, but as the game progresses things get a little more challenging. More gold targets (which are worth more points but are often retracted) are introduced, as are moving targets and crossed targets, which you're penalised for shooting. You'll shoot targets as they cascade down a waterfall, as they're being carried about by Ooccas (hit the Oocca instead of the target and you'll be penalised) or the camera may be moving on rails through Ordon Ranch as targets pop up.   The system is pretty good  you get more points for a bullseye, and each consecutive target that you hit increases your multiplier, meaning that you can generate huge points totals with a long succession of crack shots. You can also boost your score by targeting a number of other elements of the environments. Barrels, for instance, can be shot, and while most aren't worth many points, some contain a gold gem which can be shot for a decent points injection. And let's not beat around the bush - this is a game that's all about points. That's one of the things we really like about Link's Crossbow Training  it's got that old school high score mentality about it, with points totals for each level to reach, and corresponding medals (from shameful bronze to so-so silver, beautiful gold and powerhouse platinum) to earn.   Link's crossbow is a little more complex than your conventional weapon as well. Not only does it have scope functionality (hit Z), but you can also charge up an arrow by holding down on B until the crosshairs flash, allowing you to fire an explosive arrow which can take out a bunch of enemies in one shot. Plus, several of the stages have a rapid-fire pickup, for that fully automatic crossbow feel. You won't see either of these in the target practice stages, however, so let's talk about what else is on offer.    Other stages see Link rooted to the spot but able to spin the camera 360 degrees by pulling the crosshairs to the edge of screen. Enemies (such as Stalfos skeletons) emerge around you, or fly in (such as Keese bats) so you'll need to keep an eye on the radar to know which direction to aim in. Other levels are more kinetic, taking Link on-rails along a trip down Zora River or seeing him fending off enemies as he escorts a carriage to safety.    Shooting stuff for fun and profit.  Perhaps the most contentious style of stage, however, are those that finish off each set and give Link his legs back. 'Go little Link,' Nintendo cries. 'Roam about the countryside and bring me back the heads of 18/25 Skulltulas/Bulblins/Chilfos/Lizalfos/insert-other-silly-name-here.' Yes, it's an old fashioned hunt, and you can move through each area in forwards/backwards/strafe style with the analogue stick. Sadly, it all feels rather clumsy. Practice makes perfect of course, but compared to the silky smooth movement and aiming of a game like Metroid Prime 3, the implementation here is seriously lacking; unintuitive, with a rather stilted feel to movement. No moving and shooting simultaneously for you here.   Okay, so the gameplay ranges from 'competent, if uninspired,' to 'okay, but a bit clunky,' but surely the Zelda setting raises it above the usual fare to give it style and grandeur, right? Not really. While the game utilises the Twilight Princess engine, revisits many of the classic locations from the game (such as Ordon Ranch, Kakariko Village, Zora River and Death Mountain), and is chock full of Zelda enemies, it's just not as cool as you'd expect. Great idea, no doubt, but to be honest the strength of Twilight Princess was never in the environments themselves but in the way they were brought to life, and in the freedom you had exploring them. Sadly, a lot of the magic is lost here, and we're left with rather murky, visually unappealing arenas within which to hone our crossbow skills.  Links Crossbow Training is certainly competent, but its also pretty bland, and very much the main attraction in the pack  the Zapper works moderately well, but youre probably going to get your best scores without it. For AU $49.95 (as compared to US $19.99 in the states, which is much better value) were hard pressed to recommend it, especially since theres no simultaneous multiplayer. That said, if you live in a house with a number of Zelda-loving siblings or housemates, we can definitely see the appeal in attempting to beat each others points scores  both in Score Attack (across three levels) and in Practice, where you can notch up a score for each individual level. Nothing like seeing your Mii proudly proclaiming household dominance. Still, more miss than hit.", "date": "Dec 12, 2007"}