{"name": "Are You Smarter Than A 5th Grader", "name_review": "Are You Smarter Than a 5th Grader? Review", "ref": "https://www.ign.com/articles/2007/12/13/are-you-smarter-than-a-5th-grader-review-3", "text": "Are You Smarter Than a 5th Grader? is essentially Who Wants to Be a Millionaire with the added feature of feeling dumb when you get a question wrong. After all, a fifth grader could have answered that, right? Remove the whole showmanship out of the equation  you know, the little kids berating you for being so stupid  and you're left with a shallow quiz game. That's what the Nintendo DS rendition is. It's not terrible but it definitely lacks the charm of the television show production.   There's not much to Are You Smarter Than a 5th Grader, and breaking the idea down to its basics just shows how lightweight the concept is, and just how important all the television stage glitz is to expand it to an hour long show. It's just a bunch of multiple choice or true/false questions of elementary school levels of difficulty, aimed at showing just how much or little you paid attention in class. The addition of Millionaire-like lifelines extend the concept, like the ability to use a fifth grader's answer as your own.   Clearly the game was rushed to market, just in case the television show tanked. Jeff Foxworthy and the five selectable kids look to have been rendered by art school dropouts using a freeware 3D program. Luckily you don't have to look at the poorly lipsynching Foxworthy muppet for long since he only shows up on camera to introduce the game and to set off the Million Dollar Question. At least he continues his game show chatter for much of the game. Sure, they're relegated to the ~here is your question~ basics as well as the generic introduction script, but at the very least the game designers wrangled the ~You might be a redneck if~ comedian for a few hours in the recording booth. Why they didn't do the same for the five kids in the game...   I don't think even Poser Foxworthy knows the answer to this one.   Getting a question incorrect isn't as humiliating as it would be simply because Jeff's comments are one shot deals. Sure, you're not standing on a stage in front of thousands of people, but insults sort of lose their impact when they're said over and over and over again.   At least there's a decent line-up of questions in the DS cartridge. According to THQ there are more than 3000 questions in Are You Smarter Than a 5th Grader, but because they're spread out among 28 different grade school subjects, basic math suggests that you'll see a repeat question rather quickly. The game is apparently under a randomizer and doesn't record when you've already seen a question, so don't be surprised if you quickly find a repeat question in only two or three games.   Throughout the entirety of the quiz game your questions are multiple choice. The exception is the Million Dollar Question, where you have to spell out your answer. But the designers didn't apply any room for error; you answer it the way it's in the database or you're wrong. In one game, our question was ~Mark Twain's a pen name for~ and entering in ~Sam Clemens~ triggered a ~Wrong! It's Samuel Clemens.~ Sorry guys, Sam Clemens should work too. I'd hate to see what other answers are not allowed in this cartridge.Are You Smarter Than a Fifth Grader only gets half the show right. The questions are challenging in their own way, but 3000 of them can only take you so far. The showmanship just isn't the same in this virtual versionand if you thought Jeff Foxworthy was unbearable in real life, wait until you see how the game developers butchered him in this DS game. 30 bucks retail is asking a bit too much for a truncated, shortlived, single player quiz show experience.", "date": "Dec 13, 2007"}