{"name": "Impossible Mission", "name_review": "Impossible Mission Review", "ref": "https://www.ign.com/articles/2007/12/13/impossible-mission-review", "text": "Twenty years ago, you couldn't find a console or computer system that didn't play Epyx's Impossible Mission; back in those pre-NES days, if it was powerful enough and if it played videogames, you released your game on it. The game was a moderate success back then, successful enough for a sequeland even inspired the Epyx Lynx developers to produce a 3D version on the Atari-released handheld, eventually ending up as Electrocop. Time has not been kind to Impossible Mission. It may have had some innovative design ideas two decades ago, but bringing it all back in a straightforward Nintendo DS port probably wasn't a good ideait might've worked as a game in a bundle, but as a headlining retro release this one's a dud.   Not to be confused with Mission: Impossible, Impossible Mission is a game where you explore an underground base, room by room, owned by the sinister Professer Elvin Atombender (with a name like that, you pretty much forced into the Evil business). This is an old-school game design: no scrolling, and only the ability to leap around with a limber flip. The task is to hit the rooms, use the elevator platforms, avoid the robotic sentries, and inspect the furniture for pieces to the puzzle that'll shut down the bomb just aching to go off. It's a lot like the original Pitfall design, but far more complicated due to randomized room designs that require a lot of retracing footsteps due to specific elevator layouts.   It's old, but it's not    The Nintendo DS version has three flavors: the original C64 version, an updated version with subtle tweaks to the visuals, and a completely revamped version with entirely new visuals, characters and a techno soundtrack. In actuality, you're really just getting one version in three styleseven the ~original~ version isn't quite the classic since you have to manipulate the computers using the touch screen. But hey, it looks and plays like the original game, even with the addition of touch screen menu selections.   But that's the game's problem: as good and innovative as the game was all those years ago, it just can't hold up today. All the visual and audio upgrades in the world can't make a better-than-average mid-80s design a more fun game. The exploratory gameplay mechanics might've been a new thing back in the day, but now it's incredibly archaic and repetitive. I'm all for old-school designs, but reviving years-old concepts just don't work for some propertiesand Impossible Mission is one of those properties It's a budget-priced Nintendo DS game but even then it still feels a little inflated.   I owned Impossible Mission those many years ago, but my version  the one released on the Atari 7800  was literally an impossible mission due to a game breaking bug that worked its way into the final product. Even with the knowledge of that bug,  I really wasn't all that hot for the Impossible Mission design. I love reliving old-school designs, but in the case of the Nintendo DS version it should have been one of several games instead of a headlining solo outing.I owned Impossible Mission those many years ago, but my version  the one released on the Atari 7800  was literally an impossible mission due to a game breaking bug that worked its way into the final product. Even with the knowledge of that bug,  I really wasn't all that hot for the Impossible Mission design. I love reliving old-school designs, but in the case of the Nintendo DS version it should have been one of several games instead of a headlining solo outing.", "date": "Dec 13, 2007"}