{"name": "Mountain Bike Adrenaline", "name_review": "Mountain Bike Adrenaline Review", "ref": "https://www.ign.com/articles/2007/12/13/mountain-bike-adrenaline-review", "text": "As much as I like to bitch and moan about the games that are often pawned off on me, getting the dregs of the review pile is part of a freelancer's job description. However, on very rare occasions, playing the stuff that most people would just pass off as instant crap can sometimes end up exposing you to something surprisingly fun.   Unfortunately, Mountain Bike Adrenaline falls squarely into the ~crap~ category, but even as I bumbled through the game's clunky, unintuitive menus and regularly found my xtreeeem mountain biker getting high-centered on various little rocks or riding straight up tree trunks, I couldn't help but feel like the game could have been rather neat. Sure, it would need a far bigger budget and likely a much bigger development team, both of which are almost always the antithesis of a $15 game, but still, there's actually something to the basic design here.   Woo! That design is throwing six riders down four different mountains on a handful of licensed bikes from companies like Cannondale and Kona, and, uh, putting helmets on them. Along the way, they can feebly jump and spin their bikes while doing a whopping four horribly animated tricks. The collision is horrid and some of the challenges are as inane as they are impossible, but the game can actually muster a decent sense of speed in the later courses and, as bad as it looks, certain things like low-hanging, foggy little pockets of mist actually look good.    Again, it's little things that perk up from time to time; maybe it's a particular path that guides around corners juuuust smoothly enough to send you hauling ass down the mountain on the way to the next checkpoint during the Stopwatch Mode, or catching a speed boost in Challenge Mode. Sure, most of the game is an excruciating dance of restarts and cheap falling deaths (tipping over backwards is often a ~fatal fall~ according to the game, but plunging headlong into a pit of lava is just a normal fall), but parts of the game, given a little more love, could have worked.   Other parts just needed love. The wheelie challenges -- sections where you're asked to pop a wheelie and then hold it while steering through a winding course -- were actually a lot of fun and controlled well, but there weren't enough of them. The same can't be said for the dexterity challenges that necessitate that you burn some of the time-slowing Concentration Meter by tapping Circle to do things like make sharp turns, cross rail-thin sections of track and so on.    Roaming the forests. If not for things like weird collision and an auto-shift gear system that likes to step things up far too quickly, leading to the biker either hanging in place or burning through his stamina (which quickly refills when you're not pedaling), these little gauntlets would have been a lot more fun. Then again, those are problems systemic to MBA's whole approach.    That approach also includes moments where the framerate chugs and the resolution drops like a first-gen PS2 game, a camera that regularly gets buried in the sides of mountains (giving you a nice, clean shot of the world's skybox), tons of geometry pop-in as the game streams things off the disc, and character models that look and move not unlike a PS one character. Seriously, they have near-rectangular legs.     The audio is even worse, with a half-dozen tracks that don't stick to one genre and instead tend to butcher all of them. The ultra-cheesy solo-heavy guitar track almost works in a ~so-bad-it's-good~ way, but the quasi-hip-hop song that just repeats ~yeah, yeah~ and ~make some noise~ over and over again could probably be used to torture prisoners of war. Some of the bike sound effects, like changing gear and squeaking brakes sound decent enough, but there are next to no actual sounds from the riders (which may or may not be good given the rest of the game's production values), and the game has next to no ambience.Short of Downhill Domination, there really hasn't been anything in the way of a mountain biking game on the PlayStation 2, and the little glimmers of speedy paths found during some of the courses and even some of the bigger jumps in Mountain Bike Adrenaline show that it could be a decent idea -- an SSX without the snow, if you will. Of course, it would require a deeper trick system, a better approach to attacking the hardware and likely a little more in the way of interesting characters and a more refined approach to displaying the challenges. It could definitely be done.", "date": "Dec 13, 2007"}