{"name": "Barry Hatter", "name_review": "Billy the Wizard: Rocket Broomstick Racing Review", "ref": "https://www.ign.com/articles/2007/12/15/billy-the-wizard-rocket-broomstick-racing-review", "text": "The makers of Billy the Wizard: Rocket Broomstick Racing are banking on the hope that people buying gifts for Wii owners this holiday cannot discern the difference between a marvel like Metroid Prime 3 and an unplayable mess like, well, Billy. This budget title makes the promise of a magic-powered wizard kart racer, sort of a cross between Harry Potter and Diddy Kong Racing, but it fails to deliver anything remotely close to a good time. Saddled with bizarre, ungainly control, this wizard crashes and burns faster than you can say ~flippendo.~   Billy the Wizard is split into three events: Racing, book collecting, and dragon-fighting. This is actually the only good idea in the entire game, and it's woefully unfortunate that none of these events are as entertaining as they sound on paper. The series of races send Billy and his friends ripping around a storybook magical campus that a pale Hogwart's imitator. There are rings to fly through, speed boosts and power-ups to collect, and rival racers to blast with magic spells. Book-collecting sends the kid wizards back to school, charged with swooping through an increasing number of grimoires that have escaped from the library. In the dragon events, Billy and the buds must chase down a dragon that just escaped from Space Harrier and blast all of its segments while avoiding trouble from the flying lizard's pet imps. The latter is actually the best part of the game, but that says just so little about the overall quality of the production.   What positively ruins the game are those aforementioned controls; they make absolutely zero sense. To steer the little wizards, you use only the nunchuk. Accelerating and braking are assigned to the Z and C buttons. But actually moving Billy requires a constant struggle with the nunchuk itself. Tilting it up and down or twisting it left and right moves Billy around the track. Mastering the sensitivity of directing the wizard while accelerating is instantly discouraging and no reasonable amount of practice will get your head around it. As a right-handed player, I eventually had to switch the nunchuk and Wii Remote so my right hand controlled the wizard, but the poor response and control set-up thwarts you at every turn of the wrist. It's simply terrible. Hitting small targets, like books or power-ups, is just not any fun. Why not crib Excite Truck's tilting? Or even use the Wii Remote to point around the screen like the ultimately more playable spaceship sequences of Code Lyoko?   To make matters worse, releasing spells to attack the other wizards in a race (provided you can properly line up a shot) is painfully unresponsive. To cast a spell, you tilt the Wii Remote up while pressing A and then bring it down to let loose with the magic attack. This has a very iffy success rate of just registering the move, much less resulting in a smooth and well-aimed attack.   Not even close to the actual game.   If the awful controls don't keep you from getting into Billy the Wizard, the severely lacking graphics will certainly send you rushing for the eject button. We all know the Wii is no superpower, but with real care and attention, it's capable of delivering extremely pleasing and atmospheric visuals. Billy is plagued with muddy textures, annoying pop-up, and just generally uninteresting art direction. There is so little polish here that you almost wonder why anybody even tried if they weren't going to put some effort into the game.  There is actually a hint of cruelty in Nintendo allowing this game -- and many of Conspiracy Entertainment's budget Wii games -- to crowd shelves. They are just disappointment pressed into a disc, hidden inside a colorful box like some sort of gaming booby trap. Billy the Wizard is easily one of the worst games for the Wii and the kind of thing that kills momentum, much like that final crushing wave of crap that sealed the fate of the seemingly unstoppable Atari 2600.", "date": "Dec 15, 2007"}