{"name": "Spelling Challenges and More!", "name_review": "Spelling Challenges and More! Review", "ref": "https://www.ign.com/articles/2007/12/18/spelling-challenges-and-more-review", "text": "I suck at spelling. I always have. I just don't get it. I guess I was too busy drawing Teenage Mutant Ninja Turtles in the first grade to focus on where ~e~ should go when ~i~ shows up. The simple fact is that if journalism was still a craft that required typewriters, I would've gone into SCUBA diving.   So. With all that back story, you should know I entered into Spelling Challenges and More! with a bit of trepidation. Did I really need to be walloped over the head with my lack of spelling skills in my free time? Luckily, my fears were unfounded. Crave Entertainment has produced a frill-less UMD that really doesn't tax your mental acumen as it ~challenges~ you to spell words -- Bacon! Plantation! Closet! -- through a variety of modes.    The main mode you'll be trucking through when you fire up your PSP is Challenge. This option puts you into a spelling bee that is followed by three games randomly selected from the title's list of ten brainteasers. The spelling bee has the game recite a word, a definition appears onscreen, and you use the d-pad and face buttons to spell via an on-screen keyboard. After ten attempts -- whether they're right or wrong -- your bee is beaten, you're awarded money for your correct answers, your extra time is converted to dollars, and you move on.   Big Number? Just what do you move on to? Why, it's the ~and More!~ section -- a handful of games that test your ability to unscramble words and identify parts of speech. Odd One Out presents you with four words and asks you to find the misspelled one, Mishmatch wants you to find a word from the jumbled letters that matches the shown definition, and a word flashes in Hit or Miss while you decide if it's a verb or not.   Those games are clever enough, but the other seven games kind of repeat those themes. Much like Odd One Out, Right One has you picking a word but this time it's the one that's spelled incorrectly. Similar to Hit or Miss, Not a Noun has you picking words that aren't -- surprise -- nouns from a quartet of choices. Heck, Catchword is the exact same thing as Not a Noun and Hit or Miss except you're identifying adjectives.   Anyway, you go through each challenge's four parts, get a final score in dollars and see your rank, which depicts your place in the game's 100 difficulty levels. Do really well and you'll get to try out a Super Challenge and see if you can spell three harder words and jump a number of ranks.    Don't feel like a full-on, rank-boosting Challenge? You can tackle any of the mini-games in Quick Game in both practice and marathon modes.   Is it deerge? Did those descriptions sell you on Spelling Challenges and More!? If so, great, but if you're looking for more, you're about to spell D-I-S-A-P-P-O-I-N-T-M-E-N-T. Don't get me wrong -- there are spelling challenges and more in this game, but there really isn't anything else. Every one of those games is set over a burgundy background with the words in gold.    That's it. I've just described the look of every game.    Beyond that, there's a really ugly host who looks like he was ripped out of a PS One game -- think sharp edges and jaggies -- and opts for Chucky Cheese-style dialogue (i.e. his mouth randomly moves just before or during a voiceover). Sure, his instructions, the words to spell and the repetitive-but-catchy menu music sound good -- although there are a few glitches such as a weird rattle when repeating words and the omission of a few word announcements -- but it's nothing that makes this game any more enjoyable.   Oh, and that money you're winning in the challenges? It's just used for your score. You can't buy or unlock anything.If you love to spell or really feel like testing your vocabulary on the bus ride to work, Spelling Challenges and More! has the possibility of being something you might enjoy. The games are simple enough to understand, the 100 difficulties will give you a mountain to climb, and there seems to be a fair share of words to peruse.However, there's nothing that makes this title stand out or be a worthwhile purchase. The visuals are simple and muted, the host is an insult to what the PSP can do, and the gameplay is just the same few games reworked into ten challenges. This feels and looks like a title that is meant to cash in on the crop of casual gamers created by titles such as Brain Age, but the PSP isn't an everyman device and the barebones affair isn't likely to appeal to a hardcore gamer -- even at $20.", "date": "Dec 18, 2007"}