{"name": "NHL Blades of Steel", "name_review": "NHL Blades of Steel", "ref": "https://www.ign.com/articles/1999/07/20/nhl-blades-of-steel", "text": "Konami revitalized its old Blades of Steel arcade and NES series this year on the N64, but instead of going the way it used to be (exaggerated action), the company went with a decidedly more-accepted simulation style...and failed. Thankfully, the series continues its roots on the Game Boy Color, where Konami simply ported the excellent NES version of the game. We're not complaining -- this game is great.  Features  NHL and NHLPA license. Season tracking. Battery back-up Supports link cable for two players Exhibition, Season, Playoff, and  modes. Fighting and Penalty shots Gameplay based on an NES game. Only for Game Boy Color.   The Game Don't expect EA Sports accuracy here, folks. This game is full-out action. Five-on-five, drive the puck to the net action. There are no stoppages of play to speak of -- no offsides, no roughing, no icing, so get as vicious as you can to get the puck. The only penalty comes after a fight, where the loser gets sent to the penalty box. The gameplay has been simplified so a basic pass and shoot function. The only way to direct a shot is to follow the arrow that constantly moves up and down in the net. NHL Blades of Steel also features the line-up of the 1998 season, so you can play as a true NHL team all the way up to the Stanley Cup finals. You can even trade one player for another during a season if you want to make a prime team. The mini-games, penalty shots and practice fighting are a welcome addition (and were two great features of the  Since the game is based on a mid-80s NES game, NHL Blades of Steel isn't very complex. In fact, if you're looking for a true simulation, go elsewhere. The game lacks any real sound effects -- just a continuous looping MIDI music track and the occasional white-noise crowd cheer.NHL Blades of Steel is a great hockey title, but the controls are a little quirky and a bit loose. It's hard to follow the character you're controlling on defense, but you'll get used to it. We're great fans of classic NES games, and we're happy to report that Blades of Steel is a near spot-on port of the game that came out over a decade ago -- which is perfectly acceptable for the handheld. It's not quite a pixel-for-pixel port like Super Mario Bros. Deluxe, but it's a damn good version regardless. More NES ports!", "date": "Jul 20, 1999"}