{"name": "MX vs. ATV Untamed", "name_review": "MX vs. ATV Untamed Review", "ref": "https://www.ign.com/articles/2007/12/18/mx-vs-atv-untamed-review-4", "text": "Rainbow Studios has long been the king of offroad racing games. It nailed its entry into the genre with 1998's Motocross Madness for the PC and has been improving upon its formula ever since. With tight controls, great level design and an adherence to the sport it simulates that most other developers can't quite get, Rainbow's ~franchise~ has been king of the hill for years now.   Its seventh offroad game is upon us in the form of MX vs. ATV Untamed. The game takes most of the elements from Rainbow's previous games and continues to refine their design. Nearly a decade after its initial offering though, the studio seems to be running out of ideas on how to further the experience. Considering the options that have been in its games for years, that's not too surprising. There are new modes and event types, sure, but the core gameplay hasn't changed in a while, so while it's still strong, what you'll find here will feel very familiar.    What MX vs. ATV Untamed does very well though is retain Rainbow Studios' excellent control mechanics. Every vehicle in the game controls in a very arcadey manner, but with full simulation influence at your disposal. What we mean by this is that you can turn on a dime and the game is rarely punishing, allowing you to land some crazy jumps and cut corners like a knife, but at the same time you can use your clutch for cornering and acceleration techniques or drop your bike at the top of a jump to stay low in the air.   It's this mix between arcade and simulation controls that defines Rainbow's expertise, and MX vs. ATV Untamed keeps this in tow quite well. Each of the vehicle types, be it a bike, ATV, buggie, truck or what have you, controls differently, but quite well.   However, even though you'll need to change your driving techniques from race to race, this is largely the same thing we've been playing for nearly a decade and the racing can begin to feel monotonous after a short bit. The core racing mechanics work well and are enjoyable for some time, but it's only so long before it feels like you're hitting hill after hill after hill and that little will ever change. The different event types do help to change this up a bit, though you'll still grow weary of hopping over hills after a while.   It's fun, but only for a short while. There are two new events to be found in Untamed, Endurocross and Opencross. The Endurocross events have you race over what's essentially a Supercross track, except that it's littered with ponds, tires, rocks, tree stumps and all sorts of other obstacles. It's meant to be completely chaotic, but it's so littered with stuff that you'll be rounding the track rather slowly, and there's not a whole lot you can do about it. Gamers who take the time to learn the subtleties of the fastest route through each section will find enjoyment in refining their racing line, but more casual fans will find the overall speed to be uninspiring after a while. The Opencross stuff fairs a little better as you can keep your speed up over the race and the tracks do force you to balance between risk and reward pretty well.   Aside from the standard series of events you can take on in the career mode, you'll also find the new X-Cross Tournament this year. This works sort of like a reverse tournament structure in a way, where completing one competition will open up a couple more to partake in. It's a decent idea, but you'll find yourself in tournaments and such that you don't really want to race in anymore that you'll need to complete in order to progress from time to time. Since rounds can have four or more races in them, each of which has two stages, you'll be stuck in the middle of a series for a while before you're given any sort of option over what to do next.    There are a number of customization options that you'll find at your disposal, but the system is somewhat broken as you can earn a rather incredible amount of money quickly and purchase whatever you want right away. As well, most of the customization stuff simply has to do with colors and look rather than performance, so it's all just a matter of appearance rather than execution.   The online play works well as expected, and there are a couple of cool mini-games to play. Snake is the highlight here, a game that works like the lightcycles from Tron where your bike leaves a trail behind it as you race. The difference here is that your trail exists in three dimensions, so you can jump over or race under other racers' lines. This is quite possibly the best aspect of the entire game, and were it a standalone downloadable title, it would be a must-buy.    You'll also other mini-games like Graffiti, where the best trick total off a jump will cause you to ~own~ it until someone else bests you, along with your standard variety of regular events. Again, the online play is a solid experience overall.   From a graphical standpoint, the game is quite lackluster. Textures are rather bland and the vehicles and riders can look somewhat flat at times, especially when compared to other racing titles that we've seen on this generation of consoles. Whereas the Xbox 360 game looks boring, to put it bluntly, the PlayStation 3 game looks worse, as the texture resolution on almost everything is poorer. At least it runs well on both systems   There's no shortage of events to be found. MX vs. ATV Untamed is a solid game, but one that will eventually lose its hold on you. If you haven't played an offroad racer in a while, this is the one to get, but don't hold your breath for something that will entertain you for hours and hours on end.", "date": "Dec 18, 2007"}