{"name": "Disgaea: Afternoon of Darkness", "name_review": "Disgaea: Afternoon of Darkness AU Review", "ref": "https://www.ign.com/articles/2007/12/20/disgaea-afternoon-of-darkness-au-review", "text": "If Disgaea: Afternoon of Darkness took place in the real world, battles would all be very sensible, methodical and polite. Each side would patiently await its turn to inflict grievous damage on the other, while soldiers stand passively, watching their fellow soldiers get surrounded and torn apart. All is not well in this netherworld, and turn-based videogame logic is the least of these troubles. Prince Laharl, the blue-haired, red-eyed demonic progeny of the late-overlord of the underworld, is out to claim his place on the throne. Thus, the epic saga commences, making the leap from cult PS2 game to PSP re-release in the process.  For those who have never heard of Disgaea (and if you're in Australia, that's probably a lot of you) or need some basis for comparison, this is a turn-based strategy RPG along the lines of Final Fantasy Tactics or Advance Wars. Characters have a defined limit to their movement each turn, as well as a maximum reach to their attacks, based on level and weapons or items equipped. There are of course numerous modifiers that let you take advantage of the 3D battlefield  many of which are unique to Disgaea.   A main point of difference is the way in which the game handles co-operative gameplay  in a single and multiplayer sense. In a single-player sense, the key to effective strategy is ganging up and surrounding enemies while sticking to a formation. By determining the best stance of your troops on the board, you can effectively chain up combo attacks  which is brilliant, aside from when the punishing enemy AI takes advantage of this. Picking up and throwing characters around the screen also becomes a fundamental mechanic; not only can it be used to get your own troops farther across the map in one turn, but some characters, like the explosive Prinnies, which look like ragged anime penguins, become devastating projectiles.   Now, before this review dissolves into a whole series of jokes about tossing characters, tossing off, and so on, the mechanic has several other uses. Tossing one enemy into another is incredibly handy because not only does it deal more damage when using lower level characters than their standard attacks do, but it clears out the battlefield pretty quickly.   Geo symbols turn the maps into colour-coded puzzles that can flip the balance of a battle on a dime. These imbue squares and sections of the area with abilities that can enhance or tweak your or your enemy's statistics. They can be tossed around, at characters, onto other coloured squares or destroyed; each has a different impact on the battle. A blue Bonus Gauge  earns you items and moolah, while the whole battle is faster in pace than Final Fantasy Tactics.  Outside of this, the in-field combat works much how you'd expect. Characters have their predefined, weapon-based attacks, special attacks (usually dominated by mana-based magic attacks) and similar. It's par for the genre, but that's because it's balanced and it works. The real key to Disgaea's formula is in its accessibility, however. The game is only as complex as you want it to be. If you want to dive deep into the weapons and items management, you can. If you want to focus on evenly training every member of your squad gradually, you can do so. On the other hand, you can power-level your central character or two and make them unstoppable forces; it's up to you.  imageUrl=http%3A%2F%2Fpspmedia.ign.com%2Fpsp%2Fimage%2Farticle%2F777%2F777214%2Fdisgaea-portable-20070330001541442-000.jpg&caption=Impossible+hair%21+Penguins%21+It%27s+got+the+lot. The game also encourages you, by way of the Dark Assembly, to recruit new soldiers of varying classes, species and persuasions to join your cause. From here, you can begin to construct your ultimate party of healers, fighters, mages, warriors and more. Disgaea does a great job of keeping the balance in line for all of these classes with the standard statistics-sheet numbers; for casual players, this might go way over your head, but for the RPG devout, there's a surprising amount of flexibility to tweaking skills, weapon preferences and modifiers.   Part of the lasting charm of the PS2 game was its ridiculous and warped humour. While the voice acting is inconsistent in quality, the script is generally hilarious, touching on everything from nudge-nudge sex jokes and rampant cruelty to oddly self-referential moments where characters refer to themselves as pawns in a game.  This sense of humour is refreshing; most RPGs simply take themselves too seriously, asking you to buy into yet another strange fantasy setting full of weirdos with impossibly perfect hair and chibi-proportioned bodies. Disgaea bucks that trend, giving you a lead character that is jaded and bent on seizing power, while remaining likeable. Scenarios like picnics gone awry get milked for comedic value, and the charming 2D still cutscenes and sprites are simplistic but dripping with personality. Plus, any game that lets you beat up a whole netherworld council for overturning a proposal is alright in my books.   Complexity is a blessing in a game like Disagea; there is always something cool to do. The level cap is set at a ridiculously high 9999; the game loops its save system when you beat the game, allowing you to bring across items and stats. Multiple endings, hidden scenarios and maps and a whole new alternate-universe story mode are all unlockable in the PSP version too, extending replay value. Then there's the random-dungeon Item World, where you can journey into a weapon or item and do battle, level by level, against all sorts of enemies in order to level up your items. Brilliant.  Once again showing that 2D can be superior to 3D, Disgaea is gorgeous in an unconventional way. Now on the PSP's widescreen display, the quality of the animation and artistic design comes through; the sprites are small but animated with fluidity. During some in-game sequences, the faces animate and the characters bounce and bop around like jitterbugs. It's not going to blow your mind, but it's cute and effective stuff. Environments themselves are very simplistic on the whole; generally designed to provide varying paths from one end to the other over high and low terrain, around objects and environmental details, but not much else. More elaborate, impressive visuals are reserved for the magic effects, which are impressive, if nothing you haven't seen before in countless fantasy RPGs. The score is excellent for a midi production, and the inclusion of a Japanese dub is a very thoughtful touch too. imageUrl=http%3A%2F%2Fpspmedia.ign.com%2Fpsp%2Fimage%2Farticle%2F831%2F831584%2Fdisgaea-afternoon-of-darkness-20071030045338624-000.jpg&caption=The+battlefield+becomes+a+mess+of+colour-coded+squares+that+react+to+Geo+Symbols. There are a few points that stick in our sides though. The first and most obvious is the flawed camera mechanic, which limits rotation around the map to 45-degree wedges. This keeps the game field limited to isometric views, but characters still fall from view behind walls and around corners, which can be a pain in the butt. The save system is clunky, owing to the genre than a specific design fault. You need to exit all the way out of the battle area, back to your castle hub in order to save, which is fiddly and unnecessary. Occasionally, determining cursor movement along diagonal paths (again, thanks to the isometric viewpoint) can be tricky too, but you'll adjust after a little while. Voice acting varies from overenthusiastic and entertaining to half-arsed, poorly pronounced gibberish  but if you've played Disgaea 2 on PS2, you won't have a problem with the quality, since it's about on-par.  New to the PSP version is the ad-hoc multiplayer mode; it's not exactly the first game that we'd go for if we were itching for instant multiplayer action, but the modes are a nice inclusion. Although you can't play through the single-player campaign with a mate, you can gradually unlock separate head-to-head and defeat-the-leader style options. And that's Disgaea: Afternoon of Darkness in a nutshell. It's a huge RPG with a great sense of humour, some clever and inventive mechanics, memorable characters and a ridiculous emphasis on replayability. It's also gets very hard, very fast  emphasising the need for patience and, preferably, careful squad management. Some mechanics and the sheer depth might frustrate you, but it's an excellent and rewarding experience.", "date": "Dec 20, 2007"}