{"name": "MX vs. ATV Untamed", "name_review": "MX vs. ATV Untamed Review", "ref": "https://www.ign.com/articles/2007/12/22/mx-vs-atv-untamed-review-2", "text": "Rainbow Studios is no stranger to offroad racing titles, with its ~franchise~ dating back to the original Motocross Madness on the PC in 1998. Since then the developer has gone through a couple publishers before winding up at THQ and turning out 2004's MX Unleashed and 2005's MX vs. ATV: Unleashed.   This December saw the release of its seventh title, MX vs. ATV Untamed on the PlayStation 3, Xbox 360, PSP and PlayStation 2. The studio managed to churn out a decent take on the PS3 and 360 while Tantalus managed a decent port to the PSP. However, Incinerator Games' PlayStation 2 effort of the release falls short of the other releases in numerous categories, particularly in Rainbow's biggest strength, the controls.   Gone are the tight, responsive and, most importantly, predictable controls of the series. In its place lies floaty jumps, unresponsive turns and just sloppy control all around. When you take to the air off a jump, it just feels as though your rider and vehicle are defying gravity and floating above the Earth for a bit. Preload your jump to go higher, and it feels even worse. Missing is the feeling that you actually launch off a jump - instead, it simply feels like you float off it.    Take turns with the accelerator held down on an ATV and you'll slide off the track. It's almost as if having the gas pumped means that the dirt turns to ice. Let off though and you'll instantly be able to cut corners, never having to have touched the brakes. Most every vehicle in the game is too touchy, shooting your rider off in odd directions when you just meant to nudge your angle a bit.   The game features the same two heat races as the other versions, meaning that you'll have to do the same race twice in a row to get ranked. Being that many races are five laps means that you'll be racing the same track for 15 minutes straight with no sort of change, and you're stuck doing so until you're done. The custom event at least lets you change the number of laps...   The track design leaves a lot to be desired, partly because of the rather terrible graphics engine. It's hard to see which direction some turns are heading as you approach them, and since there are barriers without arrows, you aren't pointed in the right direction very well. Racing them can be a bit of a trial and error experience, which is never fun.   If only this were fun... MX vs. ATV Untamed suffers from the same repetition as its brethren. After having turned out a half-dozen offroad games prior to this one, it seems that there's not really much more that can be added to the formula, and after having played each of them over the past near-decade, there's not really much here to excite us anymore.   There's also a bit of a presentation issue related to the game's currency. It can take a long time to earn enough cash to start buying things from the store while going through the standard events, but you can quickly rake in cash by starting a quick event and choosing the ski jump, where you simply take a large jump again and again for three minutes. You can earn about fifty times as much money after one ski jump event as you can for racing, which can take up to fifteen minutes rather than three, which means you'll earn about 250 times more cash per minute via the ski jump than racing. And no, that's not an exaggeration.MX vs. ATV Untamed on the PlayStation 2 is a weak choice for a racing game, be it offroad or not. There are numerous problems relating to the controls, track design, presentation and so forth. If you're interested in an MX or ATV title, check out the previous release, MX vs. ATV Unleashed as it's much better.", "date": "Dec 22, 2007"}