{"name": "Rhythm 'n Notes", "name_review": "Rhythm 'n Notes Review", "ref": "https://www.ign.com/articles/2007/12/22/rhythm-n-notes-review", "text": "We love a good rhythm game. The Nintendo DS is perfect for the genre, and multiple games have already done well using a pretty simple formula of tapping in time with music. Perhaps trying to appeal to the rhythm impaired, or just the musically curious, Success developed Rhythm 'n Notes, an educational music program. Like a lot of education software, the title is not fun at all. Unfortunately, it's not even educational either.   Rhythm 'n Notes is hosted by a simple little cartoon girl named Tsumami. She's the obligatory character that all brain games also feel the need to have. She doesn't do much, but she is always there.   There are two parts to Rhythm 'n Notes: A rhythm section and a notes section. The game is split between these two categories, each with its own lesson sets. Players complete the lessons to move on to progressively more advance ones. No curveballs here. It's an educational tool.   What the game fails to do however, is make any attempt to actually educate the player. We started up the Notes section and it sent us to Chord Lesson 01. The game plays a chord, and then asks the player to identify it. Problem is: we haven't even heard the three different chords. How are we 'supposed to know if that was CEF or CBA?   Rhythm. Notes. Done. The game features a freeplay mode to players can listen to the chords before going into the test, but the game doesn't direct the player there first. Nor does Rhythm 'n Notes actually try to teach the player what their listening for. The differences between the chords are usually pretty subtle, since their in the same family. If this Tsumami chick that is hosts the game perhaps came in and told us the defining characteristics of each chord, so that we could listen for that slight rise in the end, or whatever, then maybe we wouldn't feel like idiots.   The biggest travesty is that the music quality is actually pretty poor. It would be perfectly fine for some other game's background music, but this is a game that is trying to teach the player to recognize notes and chords. It shouldn't sound like a Playskool Baby's First Keyboard.   Rhythm 'n Notes is also unforgiving in its difficulty. To progress at all, players have to score 100 percent on the lesson, then score 100 percent on a test right after (which is just the lesson, again.)  It took hours just to progress through a few lessons in the game, and we're fairly musically inclined. After making it through a few lessons we went back to the first one and found that we didn't even retain the knowledge of those chords. It takes all of our concentration just to focus on the three at hand, forget about learning them all.   The Rhythm section is the polar opposite, proving to be extremely easy. Players start off small, drumming simple 1/4 beats on a can, but move on to bigger, actual percussion pieces, like the timpani.   These lessons are far too basic to be any fun. And really, it's just the very basic mechanic behind DS rhythm games, which are already popular. Maybe if the Rhythm section had some songs, or made an effort to feel more like a game, it would be more fun. Elite Beat Agents will help players develop a sense of rhythm far better than this game will, plus it's a lot more fun and has real songs.There's no reason to get Rhythm 'n Notes. Anyone that is interested in learning the chords and notes on a piano should shell out the cash for piano lesson, because this thing isn't going to do anything. And anyone even remotely interested in rhythm games has a better selection in Elite Beat Agents. Hell, we recommend The Cheetah Girls as a better rhythm game over this bore fest.", "date": "Dec 22, 2007"}