{"name": "Assault Suits Valken", "name_review": "Cybernator Review", "ref": "https://www.ign.com/articles/2008/01/03/cybernator-review", "text": "The holiday season has come and gone, and January has arrived again. It's always an interesting month for gaming  inevitably home to a few of the previous year's delayed games, and the rare AAA release like Resident Evil 4 a few years back  but most of all the first four weeks of any new year offer fans of video games a chance to catch up. To catch their breath, and to look back over the preceding season's release lists to try to find any potential hits they might have missed. And with excellent disc-based titles like Super Mario Galaxy demanding Wii fans' attention through the final days of 2007, it's certainly likely that the retro downloadables hitting the Virtual Console went unnoticed by most.   So it's time to play catch up with the VC lineup, and what better place to begin than with a run-and-gun shooter? The Wii Shop has already been home to such fan favorites as Contra III and Gunstar Heroes for some time, so it's certainly a genre already well represented  but Cybernator offers something new. Robot suits. Giant, hulking robot suits.   Cybernator is a side-scrolling action/platformer/shooter in a style that could be called similar to Gunstar or Contra, but instead of controlling a human being with a spreadgun you're instead in command of a massive metal mech. It's an interesting shift  because the control feels definitively different as a result. You're not agile, you're not quick. You're a lumbering, but powerful, machine of war.   Yeah, those two little soldier guys really stand a chance against my huge freaking robot suit.  The suit is realized through a set of separate sprites, which all animate fluidly together to give you a good on-screen sense of the shifting weight and heft of your warrior. Little human soldiers show up on occasion as well, to give you the proper sense of scale, and you can step on them if you want. Always a plus.   But the control breaks down into three key components   your close-range combat, long-range weapons and movement. Close-range is the most straightforward, as you're able to punch your way through enemies' defenses with your massive metal fists. Long-range is a bit more complicated, as you're initially armed with a slightly-scattering distance gun but can upgrade its usefulness or replace it completely by collecting power-ups and completing objectives over time. Movement is the most important to master, as your Cybernator is slow and unwieldy at first, but a dash function lets you gain ground at a quicker pace and rear-mounted jets will extend your leaping distance if you hold down the jump button.   Movement gets mixed up, too, on several occasions  because Cybernator shifts gears into forced-scrolling shooting for some stages, and other areas have lessened gravity that essentially allows you to ~jump~ forever while the D-Pad directs your path of flight. Cybernator throws a fair variety of different scenarios at you throughout its total of seven or so levels, so it's certainly not a repetitive game.   One drawback that might take you out of the experience, though, is the near-constant in-game dialogue that plays throughout each mission and will forcibly pause the action on regular occasion. Cybernator takes place in a wartorn vision of the future, with you playing the part of one of many mobile suit driving soldiers  and the game won't let you forget that fact. The story is reiterated with chatter from your commander, your intelligence officer and your fellow soldiers all the time.    The amount of dialogue is actually toned down in this version as compared to the game's original Japanese edition, but it's still an annoyance (especially on later playthroughs, when you've already seen the same dialogue messages multiple times before.)Gamers who enjoyed past run-and-guns on the Virtual Console like Contra III, Gunstar Heroes and Super C will likely enjoy this overlooked shooter from the SNES, as it has many elements of design in common with those hits but still presents itself distinctively enough to stand on its own merits. It's not quite as accessible as those titles thanks to the adjustment needed to get the right feel for commanding a somewhat-unwieldy mobile suit as opposed to a shirtless jungle man, and its sometimes-overbearing dialogue can be an annoyance. But Cybernator's still a solid Wii Shop selection, and a good place to start if you're finding yourself here in January and playing catch up with the holiday season's overlooked releases.", "date": "Jan 3, 2008"}