{"name": "Eternal Champions", "name_review": "Eternal Champions Review", "ref": "https://www.ign.com/articles/2008/01/04/eternal-champions-review", "text": "One month ago  December 3rd  was supposed to be a big day for the Wii's fighting genre. It was supposed to be the day when the next installment of the Smash Bros. series, Super Smash Bros. Brawl, hit store shelves. But Brawl was delayed, is now still over a month away for we in the States, and fans of fighters in general were left with a massive hole to fill in the Wii's holiday release schedule. A hole Nintendo then attempted to plug with Eternal Champions.   We didn't get Brawl on December 3, but we did get a fighter  Eternal Champions, a 1993 one-on-one fighting game in the style of Street Fighter II and Mortal Kombat, launched on the Virtual Console that same day. This is a Genesis brawler, and is unique in that it was created specifically for SEGA's home console 15 years ago, and wasn't a port of an established arcade machine design as most other home fighters were in that era. It's also unique in its storyline, which proposes that nine of history's most capable warriors have been pulled out of their home time periods just moments before their impending deaths, and are being made to fight against each other for the chance to be restored to life.   But Eternal Champions feels forgettable aside from those two interesting aspects. The roster of characters feels generic, as if created by a committee of adults trying to figure out what kids in the '90s thought would be the most cool (and that's probably the actual truth of what happened), and the fighting engine, while home to a good variety of different moves and abilities, still handles clunkily.   Each stage in Eternal Champions includes an interactive   For the roster, take Larcen for example. Here's a character who looks like a blander version of Dick Tracy wielding a grappling hook, and for some reason he can crawl on walls like Spider-Man and is a master of ~Praying Mantis~ Kung-Fu. Right. Or Johnny Blade, the cybernetic police officer from the future who seems like he was invented on the off chance that the movie version of the game could potentially star Wesley Snipes. Or Trident, who is a merman from Atlantis in 110 B.C., but has somehow mastered Brazilian Capoiera. Even though he only has one hand, and that fighting style didn't originate until centuries later. Capoiera with a single hand to work with  sure.   So it takes a significant suspension of disbelief to get behind any of the fighters in this one, which somehow succeeds in making the fireball-throwing martial artists of Street Fighter and otherworld demons of Mortal Kombat seem more realistic and accessible by comparison.   Fighting in Eternal Champions is deep if practiced, but slow and more difficult to get into than those other more recognizable fighting games' systems. Most of the characters have a significant arsenal of unique punches, kicks and throws as well as a fair amount of special moves, but none of that depth is immediately noticeable upon first play.    You'd need to practice and experiment with each character in order to discover it, and the game facilitates that by providing a training mode that can help you get a feel for each fighter. You can choose to surround your chosen warrior with traps to practice your dodging, take on a room of bouncing balls to master your attack placement and timing, face off against different opponents  it's pretty robust. And nearly necessary, because you'll likely find your fighter face down on the floor, defeated, if you try to jump straight into the game's story mode.    Also requiring a bit of a time investment to comprehend is the game's ~inner strength~ meter, which appears next to your character's life bar and is the factor that dictates how often you're allowed to pull of your special moves. Eternal Champions is designed specifically to limit your access to specials, so you can never pull off cheap tactics like throwing endless Hadokens across the screen. You'll only be able to execute two or three special techniques at a time here, after which you'll need to wait for the yin-yang icon represented the meter to recharge.As one of the many different one-on-one fighting games released in the early '90s, Eternal Champions was able to set itself apart a bit with its unique storyline and absurdly mish-mashed characters, and by the fact that it was a Genesis console exclusive, developed directly for the system and not a watered-down port of a superior arcade edition. And SEGA fans from 15 years ago with fond memories of the title's original cartridge release could still be served by this VC translation. But everyone else should just stand clear  because Eternal Champions isn't a game that has much ~pick up and play~ appeal, instead requiring a fair amount of invested time to practice each character and learn their wealth of maneuvers, and it's not likely that many players who've never previously heard of the game will have the patience to spend that much time getting to know it. Better to save the eight bucks and keep on waiting for the real Wii fighting experience that was meant to release on that same December 3  Brawl is only a few more weeks away now.", "date": "Jan 4, 2008"}