{"name": "Battle For the Pacific", "name_review": "The History Channel: Battle for the Pacific Review", "ref": "https://www.ign.com/articles/2008/01/04/the-history-channel-battle-for-the-pacific-review-2", "text": "You may be wondering, if you've stumbled across our previous Battle for the Pacific coverage for the 360 and PC, why we're writing an entirely new review for the PS2 and Wii versions of the game. The reason for this is quite simple: the games are completely different. The PS2 and Wii versions are not only developed by different studios, but they're also, plain and simple, different games. The only similarity between the PS2/Wii versions and the 360/PC versions is that all of them are FPS games and take place during World War II. That's about it.   Unfortunately, this version of Battle for the Pacific is much worse. You may find this hard to believe, considering how low the other versions scored, but we can assure you that the PS2 and Wii experience is inferior.    Battle for the Pacific puts you in control of Lieutenant Jonathan Farrell, an American soldier originally stationed in Europe. At the beginning of the game, Farrell is selected to be the single member of the special-ops group called ~Eagle Rage,~ where he will carry out a variety of missions in the Pacific against the opposing Japanese. The only palpable advantage that this version has over the others is the presence of an actual narrative and dramatic voice, presented primarily through Farrell's monologue at the beginning and end of most missions. Unfortunately, Farrell's voice actor is unemotional and apathetic, causing the story to dissolve before it even begins. Some of the lines are almost laughable, thanks to the said voice acting and mediocre writing. Thus, the game's one distinct ~advantage~ becomes just another one of its weaknesses.   Poor narrative isn't the game's biggest problem. First of all, it looks awful. Not only does everything in the game appear completely outdated, but it runs at an embarrassing rate. Surprisingly, the cutscenes perform even worse than the gameplay itself, which is somewhat abnormal. Bad graphics and poor framerate don't always condemn a title, but Battle for the Pacific's gameplay does absolutely nothing to save the experience. It's an annoyingly slow, clunky, boring and nonsensical shooter. We can't possibly imagine anyone having fun playing this game, unless he or she has never played an FPS title before.   Let's discuss some of the above points a little more thoroughly. Battle for the Pacific is slow. Farrell moves at a snail's pace and the action itself chugs along almost deliberately. For a game attempting to recreate a war, it's not doing a very good job. Worse still is the fact that this slow gameplay is also boring. There's nothing new to do here, and the invincibly dull world doesn't lend itself to immersive gaming. Even the occasional ~stealth mission~ or rail-shooting segment do little to spice things up.   So you may be wondering why we chose to use the word ~nonsensical~ to describe the gameplay. Easy. Your opponent's actions in Battle for the Pacific don't make any sense. Get up close to them and they'll run about harmlessly or fire off a few lazy rounds without trying to finish the job. However, get far enough away and every enemy solider suddenly becomes super human. Their aim is impeccable, and they will often spot you long before it would be humanly possible to do so. Say, for example, a solider is about five hundred feet away from you (or more) and a vast expanse of brush, trees and humongous vegetation blocks your line-of-sight. Guess what? Not only can they see you coming, but they can hit you almost every time. Needless to say, it's very frustrating.   This thick jungle not only makes it nearly impossible to locate your opponents, but it's also very difficult to navigate. You'll be hard pressed to differentiate between a passable group of trees and an invisible wall. Most of the time, you're just forced to run down a very linear path as the Japanese take ridiculous shots at you.   Don't forget to reload. These various shenanigans are painful on the PS2 version but even more aggravating on the Wii version due to the change in the control scheme. Unlike other FPS games on Wii, Battle for the Pacific gives you absolutely no options for customizing the controls and remote sensitivity, making things feel quite awkward. Furthermore, controlling Farrell with the Wii Remote and Nunchuck is, generally speaking, a disaster.   While the setup is vaguely reminiscent of control schemes found in titles like Metroid Prime 3 (moving your targeting reticule outside a small invisible box at the center of the screen will cause you to turn), movement and aiming in Battle for the Pacific are atrocious. Aiming down the sight of your gun is virtually useless because the sensitivity is off, and activating your melee attack is sketchy at best. FPS games such as this (at least the good ones) require a lot of precision when handling a weapon, and these controls just don't deliver.   Of course, we shouldn't forget to mention that you can't jump, nor can you interact with the environment. Oh well.There's little left to say in regards to Battle for the Pacific, besides the fact that you should probably avoid it. If you absolutely need to try it out, we suggest you give either the 360 or PC version a try. Then again, you probably shouldn't bother. This is just a terrible game, and Jonathan Farrell needs to find himself a better job.", "date": "Jan 4, 2008"}