{"name": "The Golden Compass", "name_review": "The Golden Compass Review [PSP]", "ref": "https://www.ign.com/articles/2008/01/08/the-golden-compass-review", "text": "Games that are ~direct~ translations of movies generally don't turn out very well, and The Golden Compass game is a perfect example of a title that suffers from this tragic tradition. Developed by Shiny Entertainment and published by SEGA, this quasi-adventure/platformer is all over the place and pretty much does nothing well. Even its rare positive elements can't brighten the infinitely dull experience that the game provides.The Golden Compass is based on the film and follows the story of Lyra Belacqua and her journey to... well, that's the first big problem, really. This title does an absolutely horrendous job in telling a story, even when it's already been told in film and novel form. In fact, we can only assume that the game was designed with the pure and unbridled assumption that the player has already read the book or, more probably, seen the movie. We were flabbergasted at how convoluted the game narrative was, because so much dramatic potential is utterly lost in the transition.Roughly speaking, the game is poorly attempting to recreate the story of Lyra's journey as she seeks out a bunch of missing children, including her dear friend Roger. Although there are clips from the movie featured throughout the game's narrative, they seem to be thrown in rather haphazardly and are often spliced together with a hasty narration dubbed on top. It's almost laughable at how cluttered the end result feels while playing.Bear combat! The Golden Compass mixes (about) four main elements together to create gameplay, but only one of those elements is remotely interesting. A good portion of the game involves you controlling Lyra as she runs, jumps and hides in a variety of bland, usually linear environments. It ends up being typical platforming/adventure fare, but it controls poorly and fails to satisfy. The only notable aspect of playing as Lyra is the presence of Pan, the embodiment of her soul, who can transform into four different animals and supplement her abilities. For example, turn Pan into his Hawk form and help Lyra glide from one platform to the other.The second main element involves repetitious and unexciting mini-games, which are usually connected to Lyra deceiving people. When interacting with certain NPCs, you successfully lie to them by succeeding in a series of ten-second mini-games. The games usually involve a bunch of glowing orbs and either avoiding them, controlling them, collecting them, or some other nonsense. It's completely unrelated to the weak narrative -- and it's not even fun. There are a few Quick Time Events also, but they're even less exciting than usual.The third mechanic in Golden Compass is controlling Iorek as he bounds through a bunch of easily beatable enemies. The combat system is entirely simplistic and almost epitomizes the button-masher, so these segments did little to alleviate the pain of the slow-moving Lyra sections.She's ready for action... The final gameplay dynamic features Lyra's truth-telling Alethiometer. Even though these segments were repetitive, they were at least a touch more interesting than their counterparts. Throughout your journey, you actually collect the meanings behind the Alethiometer's symbols, which you can then use to divine the answers to questions. However, if you haven't yet uncovered a symbol's meaning, you can guess at it. For example, say the one keyword you're missing is ~Sin.~ You can actually look through all the different symbols and choose the one you feel best communicates that word. In this case, the answer would be the Apple, but there are many others to choose from. This aspect of the game easily had the most promise and could have been even better with more polish and depth.We should quickly mention now that if this does sound like your type of game (somehow), you may want to consider playing it on a 360 controller. The keyboard works fine, but controlling a platformer with anything other than a joystick can sometimes be tricky.Besides lousy gameplay, The Golden Compass has little else worth mentioning. The graphics, regardless of which system you play on, don't push the hardware at all. The sound is almost never properly synchronized with what's happening on the screen, and the overall presentation is embarrassingly cheap. Truthfully, there's only one genuinely great thing about this game: the orchestral score. We were shocked at how beautiful the music was -- music that was written specifically for the game. It was almost surreal to hear such majestic, charming pieces streaming from the speakers when the game itself is pitiful.Even if you were completely charmed by Philip Pullman's work or enjoyed the movie adaptation, there's absolutely no reason to give this game a try. Even the music, as pretty as it is, can't redeem such poor gameplay and atrocious presentation. There have been a ton of great game releases recently, so just give one of those a try instead. We assure you that you're not missing anything by sitting this one out.", "date": "Jan 8, 2008"}