{"name": "MTV Cribs", "name_review": "MTV Cribs Review", "ref": "https://www.ign.com/articles/2008/01/08/mtv-cribs-review", "text": "Remember when MTV used to play music videos instead of lame reality shows that cater strictly to pre-teens? MTV Cribs is one of those shows and makes the translation from your TV screen to your cell phone screen in a game that doesn't exactly make you want to holla, playa.   You play as an up and coming rapper determined to make it to the top and fill your crib with as much gear as it can handle. After recording your first big hit, the studio has given you an enormously huge house crib that you need to decorate. You have 52 weeks to become the #1 superstar and get your home crib filled up with all of the hottest furnishings. Forget playing a puzzle or action game. If you're like me, you wanna spend your time decorating your living room!   Your agent will be your guide, supplying gigs and providing weekly bankroll updates. Because your house is so huge you have large upkeep costs, and you will lose money on a weekly basis unless you earn some cash cheddar. So how do you get enough money dolla dolla bills to furnish your place crib? By playing gigs and recording albums. Each week you have a choice of mini games you can play to elevate your status and build your bank. MTV Cribs has four main games but in reality it's only two.   DJ Freestyle requires you impress the crowd with your DJ skills. Do this by pressing the key in correspondence to your hands onscreen. If your hand is on the record to the left, hit the left key. It will switch quickly between left, up and right in a random order, so if you have chubby fat fingers this may be a difficult challenge for you. Get the crowd excited hyped up enough and earn top dolla. DJ Battle is the same game but this time you're competing against another DJ. This game will usually earn you the most cash out of the four because the competing DJ will want to place a bet with you before it starts. Fill up your meter before he does and you win.    MC Riddle and MC Flow require you match falling icons to the pattern shown at the bottom of the screen. Riddle only allows you to swap a few times, while Flow simply scrolls down and you have as much time as it takes you to match the pattern. You do this by pressing up to swap icons and left/right to move between icons. The game starts off with a pattern of three objects but as you get further along in the game the difficulty increases with 4 and 5 icon patterns. These two are the weakest of the games and don't earn you a lot of money Benjamins.    Creating an album is a compilation of all the games. If you're good dope at all of the games you'll have an album out on the streets that will earn revenue for weeks while you continue to do gigs. I'm not sure what qualifies as a hit record though. I did almost perfect on all four of the games and on one review it said my album was a hit and on another it said to only buy it if you're a fan. How disappointing. Now I know how musical geniuses like Britney Spears and Clay Aiken feel when someone writes a bad review about their music. You can also go on tours where the games are random and earn you a lot of bank.    But you cannot do gigs week after week. Your stamina goes down and your agent requires that you chill at your crib before continuing on with your grueling schedule. But if your crib isn't decorated, he'll advise you to do that before you chill. He'll also alert you if you're going broke and need to do more gigs. But you can't do more gigs if you have to chill and you can't chill if you have to decorate. I think the agent the game uses is insane and I wish there was a 'fire agent' option.   This brings us to the second part of the game and that's decorating your crib. Your agent will warn you two weeks ahead of time when MTV will be coming to visit and check out your crib. A top down view shows the layout of your virtual palace. You have the choice of decorating everything from the main entrance with fountains, to the bathrooms with platinum toilets, closets where you can purchase golden robes with diamonds and other accessories for the kitchen, etc. Purchase cars to fill up your garage but make sure you upgrade your cars with the latest in audio equipment and throw on the hottest wheels while you're at it. You can also purchase indoor basketball arenas, arcades, a weight room, and even a jet for your jet hanger. Yes, you have a jet hanger. Staff is very important to purchase because you need people to help with the upkeep costs. At least I think they're important. I found that even by purchasing staff my weekly costs were still through the roof. You may earn $300,000 in a few weeks, but it quickly disappears once you start shopping.   What's good about this part of the game is the ability to decorate your house however you see fit. You can move your icon over any part of the mansion and do the rooms you want to do. But even if your crib is valued at over $500,000 MTV can still rank it as a shack. What's bad about it is I couldn't figure out how to earn enough money to buy a lot of more expensive things you'd want in your crib, like a casino, planetarium or recording studio. Sure, I can build an Olympic sized swimming pool, but is that what MTV is looking for? I have no idea because the game doesn't really give you any indication of what's important to buy first. It's a crapshoot at best. I decorated every room in my crib but had no money for cars or staff, so my ranking still sucked. Each room seems to have a little progress bar and I'm guessing when's it's filled it's got the best stuff in it and you can move on to another part of your crib.   The graphics are fine for each of the games but the biggest disappointment is that you never get to see what your crib looks like. You merely get the top down view and that's it. I know cell phone games are limited in their memory and capacity for graphics but I think cutting out the lame games and just keeping the decorating portion to impress MTV would have been better if it gave me the ability to actually view all of the goofy things I purchased. It's called MTV Cribs, right? So let me see my crib.  MTV Cribs falls a bit short of the mark when it attempted to target audiences who like to decorate their homes with indoor bowling alleys. With repetitive games and a taxing portion of your time used to decorate a crib youll never actually get to see, youre stuck playing for no visual reward. There is an option to upload your crib to the internet so you can see how well your mansion stacks up to others. Gamers who like money management type of games can find a few things to enjoy, but the rest of you will get bored rather quickly. In the crowded neighborhood of wireless games, this is one crib not worth checking out.", "date": "Jan 8, 2008"}