{"name": "Omega Five", "name_review": "Omega Five Review", "ref": "https://www.ign.com/articles/2008/01/09/omega-five-review", "text": "Side-scrolling shooters are becoming commonplace on Xbox Live Arcade. However, many of the shooters currently available are re-releases of older games. Natsume's Omega Five is a breath of fresh air. An original shooter made specifically for XBLA, this gorgeous game is certain to please those who like dodging enemy fire from all directions.    You play as one of several unique characters with the sole purpose of blasting your way to the end of each of four stages. Why you are doing this and whom exactly you're fighting is a mystery. Omega Five doesn't concern itself with story or making a lick of sense. All that matters is there are some strange creatures standing between you and victory.   As with most side-scrolling shooters, it's a real challenge to make it to the end of each stage alive. Fortunately, you have the tools necessary to wipe out the enemy. Each character has three different guns that can be acquired and upgraded with power-ups. The type of gun you choose can change your approach. While there isn't always a dramatic change between weapons, you will find that there is often one type that serves you better for a specific stage. More intriguing are the alternate attacks and special abilities. These vary considerably between characters. Ruby launches a satellite that latches onto an enemy and does considerable damage. Tempest can reflect shots with a well-timed flick of the right thumbstick. You also have the aid of a smart bomb, which does massive damage to everything on screen. This is powered up by collecting pink triangles released by destroyed enemies. It's an effective tool, especially in the rare moments when the screen is crowded with baddies.   Omega Five gives you a single life and only a couple of continues. There is a learning curve, so expect some tough times for the first hour. As you play, you'll slowly unlock bonus credits giving you more chances at making your way through the end of Omega Five. In fact, with your increased skill and added credits (eight total after three hours of playtime), it becomes moderately easy to make your way to the end.    Omega Five is a gorgeous game; easily one of the prettiest XBLA titles to date. The character animations are spectacular and show a real attention to detail. The enemies are inventive, the environments vivid. It's the kind of game you see someone playing and must stop to watch. It's the type of game that drops your jaw for a few minutes. But the pretty explosions, enemies flying in from the background to fight, and peculiar characters don't quite make up for some of Omega Five's flaws.   Side-scrolling shooters typically move fast and have an unreal number of enemies on screen. Omega Five is slow-paced that forces you into tight spaces rather than swarming you with enemies. Though there are a few moments where you'll find yourself surrounded, you likely won't feel overwhelmed. The pacing of Omega Five is necessary, because the four stages are small and if things moved more quickly, the stages would end too fast. The bosses prove the toughest element of Omega Five. But the bosses are difficult primarily because you lose your gun upgrades if you die. And it is common that you will die right before or during a boss fight. With powered-up weapons, the bosses are pretty easy.   Co-op has been included in Omega Five. Unfortunately, it is local play only and adds little to the experience. You and your buddy share credits and power-ups, but there is no increase in the number of enemies or the difficulty. Even if co-op play were online, it wouldn't add all the much. In fact, it's tougher to play with someone else, as it become more of a challenge to see what's happening on screen.   Omega Five comes with quite a few unlockables. Along with new characters, you also open some new modes as you play. You unlock a Challenge Mode for each stage you complete. Challenge Mode tasks you with earning as many points as possible with one life. Not only is your score placed on an online leaderboard, but you can also upload and download replays. Omega Five is pretty but shallow. It's the trophy wife of XBLA games. That doesn't mean it isn't fun for a little while, but it's ultimately not among the top-tier Arcade titles. If you enjoy horizontal shooters, Omega Five is worth picking up. It probably won't last you more than a week, but there are enough enjoyable elements to put a smile on your face.", "date": "Jan 9, 2008"}