{"name": "The Dynastic Hero", "name_review": "The Dynastic Hero Review", "ref": "https://www.ign.com/articles/2008/01/10/the-dynastic-hero-review", "text": "It's the second time it's happened. Earlier on, on the Virtual Console, we witnessed an occasion where the same game showed up on the service twice, under two different names. They were Dr. Robotnik's Mean Bean Machine, which arrived in the Wii Shop in late 2006, and Kirby's Avalanche, which followed last September. Though the two titles originated on different systems and held different graphical presentations, they were essentially the exact same game. One design, two separate coats of paint.   And now the release of The Dynastic Hero marks the second time the same thing's happened, as it's a game that is an almost perfectly direct copy of the Genesis title Wonder Boy in Monster World, which came to the VC last Spring. The Dynastic Hero is the TurboGrafx-CD version of the design, and swaps out many of the character graphics, names and bits of the storyline, but the layout of each level and core gameplay are exactly the same as Wonder Boy's.   It's a bit annoying to see games like this come to the Virtual Console, especially when the spots they take up in the Shop could instead be filled by unique, original titles  and I'll tell you straightaway that there's no sense at all in considering a download of The Dynastic Hero if you've already grabbed Wonder Boy in Monster World. But for those who haven't yet and may still be weighing out a purchasing decision, let's have a look at what potential benefit there might be to choosing this version over the Genesis edition.   Wait, didn't I explore this exact same castle sometime last Spring?  Firstly, the gameplay is unchanged. The game is still a side-scrolling action/platformer with RPG elements, in which you quest through an interconnected set of environments laying waste to enemies with an arsenal of short-ranged weapons and mediocre jumping ability. You still collect gold from fallen foes, and use it to buy new weapons, armor and items that you then equip through a pause menu inventory screen. And you still interact with a variety of non-player characters, all of whom beg you to save the kingdom.   But in The Dynastic Hero, the kingdom is a different one. And the enemies, NPCs and main character are altered as well. In this version, you're a young man named Dyna who's dressed up in a suit of blue armor fashioned to look like a beetle. You're out to save the land of Tarron from Mandra, who is a giant lizard wizard, and the fair fairy in distress is named Brenna. It's really a storyline that's just as inconsequential and forgettable as the one in Wonder Boy in Monster World, but it's slightly more compelling in its use of the insect boy theme.   The graphics are upgraded just a bit, with a more diverse and appealing color palette coming from the TurboGrafx-CD as opposed to the Genesis. And The Dynastic Hero offers a more dynamic, animated opening cutscene that seems powered by the more advanced tech of the TGCD. But the real and most major change, thanks to the CD-based media that The Dynastic Hero hails from, is in its sound.   Compact disc quality music will greet you as you leap through the levels of Dynastic, and those players who've had the opportunity to experience some of the previous TurboGrafx-CD games on the VC know what to expect  like Gate of Thunder or Super Air Zonk before it, The Dynastic Hero separates itself from the competition of its originating era by featuring a richer, fuller soundtrack that sounds as if it's years ahead of its time.   It's an impressive aspect of the game, and does finally offer something definitively unique over Wonder Boy. Exceptions to its appeal are, though, that on a few occasions the music might sound too good  if that makes sense. When you're playing a game that looks like it should be accompanied by 16-bit chiptunes, it can be off-putting when the music strays too far from that comfort zone and gets too dynamic. Like playing the original Super Mario Bros. while listening to Super Mario Galaxy's orchestral arrangements  it doesn't exactly work.When Wonder Boy in Monster World first came to the VC last Spring, our contributing reviewer Mark Birnbaum awarded it a final score of 8.0 and a hearty recommendation. And as The Dynastic Hero is essentially the same game, it would perhaps be easiest to give it the same grade. But, interestingly, playing this version of the design doesn't inspire the same confidence in me that Wonder Boy must have in Mark. I find a different game in the series to be more compelling, actually  Dragon's Curse, which is also on the VC but offers a more unique gameplay mechanic focused on morphing into different character types. If you're going to download a repainted TurboGrafx Wonder Boy game, I'd recommend that one over The Dynastic Hero, especially since it's two bucks less in the Shop. But if you're dedicated to the idea of acquiring either one or the other of this game's versions on the VC, you could still choose Dynastic with confidence. Just make sure you have enough space clear on your Wii's hard drive, because its CD-based origins mean it will take up more blocks of space than the Wonder Boy in Monster World version.", "date": "Jan 10, 2008"}