{"name": "Aquaria", "name_review": "Aquaria AU Review", "ref": "https://www.ign.com/articles/2008/01/10/aquaria-au-review", "text": "Aquaria is a game that revels in simple pleasures: in the joy of lithe movement in its underwater world; in exploring new and potentially treacherous areas; in slaughtering harmless fish. Indeed, your first half an hour with the game is almost meditative  swimming through caves and tunnels, mastering the straightforward movement controls, avoiding predators and communing with the surprisingly friendly jellyfish. It's a smooth introduction, and a mirror of protagonist Naija's heretofore solitary life. Who is she and what happened to her people? These are the questions that spur her on into the wider world of Aquaria.   Within its lovingly hand-painted environments Aquaria very much takes a number of classic game designs as inspiration. You'll see shades of Super Metroid and Castlevania in Aquaria's progression system, a smattering of Zelda in the song spells, and a decent dose of space shooter gameplay in its combat. That's by no means a bad thing, and indie developer Bit Blot  comprised of two guys  has done a great job pulling it all together (for the demo or to buy the full game, head to the website).   Therell be no accusations, just friendly crustaceans, under the sea!  The most striking element as you progress through the game is the size of the world  it's absolutely huge, and comprised of a massive network of interconnected caves and tunnels, just begging to be explored. There's no linear path through this world, and by the time you're a few hours in you'll have access to several huge areas simultaneously. As you'd expect, however, the world is revealed in stages, with many paths and secrets locked off until you return with the requisite skill. In other areas currents push and pull you about, dictating where you can swim.   Initially a defenceless denizen of the deep who must out-swim anything threatening, it's not long before Naija earns her first transformation ability, which is triggered - along with other spells - through song. Holding the right mouse button brings up a radial menu consisting of a number of coloured icons, each associated with a note. Move the cursor across the icons in a particular order and Naija transforms into a being of pure energy  Dark Naija essentially. In this form she can fire off streams of energy and a charge up homing attack. Switching between the hunter and the hunted becomes a core component of the gameplay, as Naija is more versatile in her base form, but exposed. It's only in her base form, after all, that she can cast spells, so clearing away rocks to reveal a path, or harvesting fruits from plants brings with it an element of risk in more dangerous waters.   A fish, a fish, a fish, a fishy oh. That went wherever I did go!  The controls are largely very good. Naija can navigate the waters entirely through mouse control should you wish. Just hold down the left mouse button and move the cursor to guide her, or you can click at a distance to dash in that direction. There's also direct control using the old WASD config, and we found ourselves using both. Combat in Aquaria can get quite hectic  some chambers are filled with predators chasing you and firing off projectiles, so the ability to directly control Naija through the maelstrom, while shooting and aiming with the mouse, is an important option.   Controls aren't perfect, however. We found the dash move  which is also used to dash and grip to walls  a little frustrating. In enclosed spaces we found ourselves leaping from wall to wall when all we wanted to do was move through the area at speed. Despite this small niggle the sense of gliding and smooth movement has been captured fantastically well. There are also other nice touches in the controls too, such as the ability to spin the cursor around Naija to create a whirlpool of sorts. Very handy for clearing off the hard-shelled little creatures which occasionally attach themselves to Naija and slow her movement.    The map system is pretty solid too. On entering a new area it shows you the full layout of tunnels, with areas lighting up once you've explored them. There are a couple of drawbacks, however. One is that the map is divided into sections, with the area you're currently in focused upon. Unfortunately, while you can see the layout of the other areas beyond the current map, you can't see which sections you've explored and which you haven't unless you swim into that particular section again. In such a large world, where it can take quite a while to get around, that's a bit of a drawback. It also would have been great to be able to annotate the map. It's all too easy in such a large world to come across  say  a blocked entrance, then to forget where the hell it was when you've gained the ability to open it. For some that will be part of the appeal, but for us it meant that we wound up spending a lot of time scouring areas a second or third time, making sure we'd explored every possible avenue.   Not pictured: the lost city of Atlanta.  Treasures, after all, lurk in the far flung corners of this world. Some can expand your life force, while elsewhere you may find plants that contribute vital cooking ingredients to your store. Yes, Aquaria also has an item-making component. All sorts of things yield ingredients, from plucking plants and fruits to killing marine life. Indeed, your inventory will quickly fill with all sorts of items, from berries and bulbs to oils and eggs, meat and tentacles. It's not immediately evident what the vast majority of ingredients do, but as you play you'll learn recipes in order to transform raw ingredients into active foods. Combining plant leaf, fish oil and spicy meat, for instance, will yield a Spicy Roll, which gives you a +1 boost to your energy form shot for 45 seconds. Others, such as the Hearty Soup (which is stored in an air bubble  this is underwater after all) give you +1 speed for 30 seconds and increased defence for 15. Sadly, aside from healing foods, they're not all that useful, and it's not exactly clear what '+1' even means, given an absence of stats for Naija. It's a shame the cooking system doesn't feel more integral to the game. In fact, it may have worked better if you could use it to bestow permanent stat increases on Naija, on the back of a more RPG-esque levelling system. Oh well.   Still, it's easy to see why developer Bit Blot didn't go in that direction. This isn't a game about numbers; it's a game about exploration and experience. The interface is deliberately minimal, and the song system keeps the spellcasting and changes of form grounded in this mystical world. That said, the use of song sometimes stretches a point. While the idea of riding a seahorse and controlling it via song may sound appealing, it's rather clumsy in practice.   Kelp Forest - just one of many uniquely stunning looking areas.  There's one area above all others, however, in which we believe Bit Blot missed a great opportunity  puzzles. While there are certainly some neat puzzles in the game  both in opening the way forward and in defeating some of the more terrifyingly large beasts you'll come up against, a stronger emphasis on them would have been appreciated. As it stands, the gameplay is much more focused on exploration and combat, which can start to wear a little thin. More puzzles would have resulted in a more rounded gameplay balance.   Even so, Aquaria is quite a stunning effort from such a small team, and it's hard not to be won over by the game's sense of atmosphere and visual style. As opposed to a title like Undertow on XBLA, Aquaria is much more old school in its approach to visuals, utilising hand-painted environments and creatures. It may not have fancy real-time lighting, but when a shaft of hand-drawn light pierces the water in this game, it's every bit as impressive. Bit Blot has also made great use of colours and tone in creating its world. The difference between rich blue sea close to the surface and exploring the deep, dark depths is obviously marked, as is exploring the warm cocoon that is Naija's home versus the ruins of ancient civilisations, or the kelp forest, or the occasional fleshy, blood red tunnel.  Aquaria has been available since mid-December (you can download the demo and buy the full game through www.bit-blot.com), so our apologies that this review is coming to you so late. The upshot, however, is that this is probably the perfect time to play it. If youve powered through Christmass PC heavy hitters and are looking for something a little different, then Aquaria may just fit the bill.", "date": "Jan 10, 2008"}