{"name": "Dead Rising", "name_review": "Dead Rising Review", "ref": "https://www.ign.com/articles/2008/01/11/dead-rising-review", "text": "Mall zombies. We've all seen them, shuffling from store to store, swiping plastic and accepting goods that will one day just be shoved into rented storage. And we shake our heads at the excess, all while sipping an Orange Julius and thinking that will certainly never be us. But while filmmaker George Romero saw this as a springboard for a very clever attack on our consumer culture, Capcom instead used the mall in its Xbox 360 hit, Dead Rising, as a huge storehouse for makeshift weapons to use against a literal zombie scourge.   It's been over a year since Dead Rising splattered crimson all over your 360. That game was filled wall-to-wall with shambling horrors and so much real estate that it was hard for me to imagine just how Capcom could capture the essence of the game -- ripping through a crowd with a buzzsaw -- on the smallest screen. Yet this download actually does manage to get the mood right. Sure, the screen isn't thick with as many zombies, but this game -- unlike it's bountiful enemies -- has a pulse. When you do pick up a shopping cart and use it as a battering ram to flatten an incoming bruiser, there is a certain satisfaction, even if its not rezzed out in 720p.   And because Capcom nails the atmosphere and a handful of the game's selling points, such as a laundry list of fun weapons to use against zombies, it actually succeeds as one of the better console-to-mobile ports in recent memory. (It's certainly better than Capcom's mobile take on Lost Planet.) Of course, this whole thing crumbles if you are unable to scale expectations. Should you be unable to divorce yourself from what you played on the 360, don't even bother.   The game somewhat mirrors the story of the console game. You are Frank, a photo journalist that finds himself in the middle of a zombie crisis, stuck inside a mall. While there, he will learn the origin of the zombies and try to fight his way out to live another day. The mobile game is split into seven chapters, each inching Frank closer to the truth. Frank may be a journalist, but he's not a bad brawler either. He starts out as a mildly effective zombie-killer, but the more he criss-crosses the mall to meet his objectives, he levels up his skills. Strength and speed are important to improve, so make sure you don't avoid combat. Pick up a meat cleaver and mix it up.   Combat is very simple. With some weapons, such as the chain saw or lawn mower, you just run into a zombie and watch the blades chew it up. Ranged weapons, such as guns, have a nice bit of auto-aim on them so as not to slow the pace. Melee weapons like baseball bats and shovels are a little trickier, as you have to press the attack button and connect to do damage. I found myself always seeking out the mower and chain saw, not just because they were easier to use, but because it's just more fun to use those than time a shovel swing.   Frank also has his camera and can take photos of the zombies or people, but this is admittedly not the game's best feature. Using the camera is a tad sloppy, as you have to ~arm~ the camera and then physically move the viewfinder around the screen to frame your shot. This process is not fast. It's very to get munched while trying to frame a photo.  Dead Rising is a small surprise. I really wasn't sure if Capcom could nail the essence of the 360 smash, but they did. You dart into stores to pick up useful weapons and then run into the heart of the mall to rip up zombies. The game does a decent job moving the story along through its chapters, capping things off with some solid boss fights. With the right expectations, Dead Rising delivers some fun mobile thrills. After all, whose mouth doesn't curl into a smile when running over zombies with a lawn mower?", "date": "Jan 11, 2008"}