{"name": "Petz: Hamsterz 2", "name_review": "Petz: Hamsterz 2 Review", "ref": "https://www.ign.com/articles/2008/01/12/petz-hamsterz-2-review", "text": "In its first appearance on the Nintendo DS, Ubisoft's Petz brand offered up four different virtual pet experiences  Dogz, Catz, Horsez and Hamsterz Life. Of the four, the Hamsterz game proved to be the most interesting and original. It was somewhat realistic, but more often wacky and ridiculous  with its hamster stars speaking English, dressing up in cowboy hats and doing a variety of other unhamsterlike things.   Now, in the second wave of Petz-branded titles, history seems to be repeating itself. The sequels to Dogz, Catz and Horsez have all made great strides and are more focused and solid products than their predecessors were, but the follow-up to Hamsterz still manages to be the best of the four. This game, Petz: Hamsterz 2, is a focused, fun and relaxing rendition of what it's like to raise a hamster in real life, and it's got the right kind of casual pace to appeal to core virtual pet fans.   Interestingly, though, this ~sequel~ has little in common with the first Hamsterz on DS. The non-realistic elements have been excised  gone are the conversational English sequences where you spoke back and forth to your pet through the DS mic, gone are the fanciful costumes, gone are most of the wacky mini-games. What's left is a straightforward sim, more streamlined and fully-featured than before, but lacking that extra quality of whimsy that made the first Hamsterz Life so memorable.   New to this edition is the chance for your hamsters to breed and give birth.  From the very beginning, the depth and realism of Hamsterz 2 is apparent. The game allows you to customize your own identity and environment first, and then introduces the story. Your cousin visits your home and asks for a favor  his pet hamster has just had a child, and he'd like you to take care of the baby. You agree, of course, and begin your journey as a new pet hamster owner, with a small starting cage and a standard set of hamster care equipment pieces, like a water bottle, food dish and little wooden house.   The early interaction is slow. There aren't a lot of different ways to play with your hamster right from day one, and you're mostly just relegating to petting the creature, picking it up, putting it down and rearranging the ~furniture~ in its cage, if you choose. Players of the first Hamsterz Life might be disappointed at this point, as that game offered much more immediate involvement and a faster entry into more of the game's potential. In Hamsterz 2, you're forced to be patient.   You're forced to be patient until such time as your hamster care has earned you enough stars (they appear when the hamster's happy, after eating, drinking, being petted and the like), after which you can head out to the local Pet Store and spend the stars as currency to buy new toys, bigger cages, food and water, and more. You'll want to invest in the famous ~hamster wheel~ as quickly as possible, because seeing the little guy try to run in that thing, then running too fast, then getting flung out of the side of it at high velocity is just too hilarious to miss.   The most interesting new feature of Hamsterz 2 is that you can have your hamster interact with other owners' hamsters  either wirelessly with a friend who also has a copy of the game, or in-game with non-player characters like your virtual cousin. This is rewarding, first because you'll earn a lot more stars a lot more quickly when there are two hamsters interacting together on the screen, and secondly because there's also the potential that two differently-gendered animals will become ~partners.~ Partnership results in eventually pregnancy, which means new hamster babies  Hamsterz Life 1 didn't have that aspect, so it's something fresh and new. And seeing the little baby hamster walk around the cage with its mommy is excessively cute.   Beyond that, it's just comforting to see the clean, organized menu system utilized in this design. Lots of other virtual pet titles feel messy, with spotty navigation or cluttered screens. Here, it's concise and easy to get around. You can easily move from your current cage to a different one, or go to a friends' house, or visit the pet store. You can read up on how to play with an in-game tutorial book, which will also educate you on various different breeds of hamster. You can keep track of your personal information and seamlessly activate the title's wireless connectivity features. And, while playing with your hamster, you're given full control over the camera, which allows you to smoothly zoom in, out and around your hamster's cage. It's such a well done implementation all around that it actually enhances the sense of calm in the game, and helps you to have fun continuously over a long period of time.And that's Petz: Hamsterz 2, really. It's just a casual, accurate, accessible virtualization of real hamster ownership, with a slow overall pace. It should provide a relaxing solution to virtual pet fans looking for a new experience on the DS. The negative to level against it is that it isn't much of a sequel, as it doesn't share much of anything in common with the first Hamsterz Life game beyond its branding and the fact that it's also focused on hamsters  this is because Petz: Hamsterz 2 is an Americanized port of a Japanese hamster game, one that was developed by a different team and different company than those who originally did Hamsterz Life 1. So if you're a fan of the first game, be aware that you might be disappointed by what you'll find here. But if you haven't played the first one and that issue doesn't concern you, give Petz: Hamsterz 2 a look. It might have a sequel's numeral on the end of its name, but it's really a solid standalone game.", "date": "Jan 12, 2008"}