{"name": "Emergency Rescue: Firefighters", "name_review": "Emergency Rescue: Firefighters", "ref": "https://www.ign.com/articles/2000/06/06/emergency-rescue-firefighters", "text": "Real-time strategy games are a dime a dozen.  Ever since '97, a glut of crap titles claiming Command & Conquer and Warcraft 2 as inspiration have flooded the market.  With so many derivative products, and ultimately so much to choose from, it's a given that 95% of the stuff released during the past three years was overlooked by the public and left to languish at the bottom of bargain bins.  And unless you're one of the paltry few that actually picked up TopWare's ill-fated Emergency, WizardWorks' Emergency Rescue: Firefighters is probably your first encounter with semi-violent, real world themed strategy gaming.   Firefighting may not be the world's most glamorous profession, despite what you may have seen in Backdraft, but it's a respectable way to make a living.  Believe it or not, the guys at the fire department don't just organize bake sales; they also put their asses on the line on a daily basis.  Where there's smoke there's a fire and where there's a fire there's usually a team of firemen risking life and limb to pull people out of burning buildings and contain the flames before they can spread to surrounding areas and cause serious damage.  Plus they're cool enough to get a license to drive at top speed on the wrong side of the road, even if that job perk is offset by the obligation to help old farts rescue cute little kitty cats out of trees.  Logic, or the back of the box in case you're slow, then leads us to conclude that Emergency Rescue: Firefighters is a firefighting simulation.  Presented with 23 scenarios featuring various and sundry objectives, your overall goal is to follow orders and use the limited amount of personnel provided to save the day.  Hosing down fires is the least of your worries though, because your primary concerns are the rescue of trapped victims, getting a handle on each situation, and saving buildings/objects from certain destruction.  Because mission briefings are based upon emergency tips and the caller's description can be inaccurate, there's an element of unpredictability tossed into the missions.  One never knows what they're going to find until they show up on the scene.  Afforded a chance to adequately assess your predicament, the next major task is putting your squad to work.  As you race against time, you'll have to alternate between units, assigning them to combat flames in both indoor and outdoor settings.  Four basic units are provided, including the regular - who can rescue people, the axeman - who can chop down doors and other barricades, the backpacker - who carries a portable hose and limited water supply, and the digger - who can create trenches that are impassable to the conflagration.  Hose teams are available as well, although their unlimited water supply cannot be brought to bear against indoor blazes.  Send them off alone or in bunches to increase efficiency levels. The choice is up to you.  Shots are called through an odd user interface.  Selecting and moving firefighters is handled in the traditional point, click, and/or drag manner, but changing up the pool of units is where things get weird.  A fire truck sits parked outside each scene, which can be clicked upon once a unit is selected to bring up a menu of icons.  Choosing from one of four pictures, each of which represents a specific unit type, causes the currently selected character or group to become that sort of unit. The transformation automatically removes the unit(s) in question from the screen, counts down a timer, then places your new acquisitions a few steps in front of the fire truck.  Imagine that, eh?  The fire department really should share their advances in teleportation technology with the rest of the world.  In short, bear in mind that while reinforcements are provided on occasion, essentially you'll have to recycle to gain new resources.  As the inferno rages, you'll frantically slide from unit to unit in order to coordinate an assault against one of nature's most powerful forces.  A semi-transparent view of structures and the immediate area reveals the position of your firefighters, but the only way to see what they're up to is to select each individual.  Enjoyable at first, but ultimately frustrating, the gameplay is schizophrenic, requiring you to be in ten places at once.  Scenarios are also exceedingly difficult, as you've got to know exactly when to pull members of your crew off of one job, transform them into useful units, and reassign them to a new task.  Throw in a need to salvage predetermined levels of property value, keep character fatigue to a minimum, and continually refuel your backpackers' water supply, and you've got the blueprints for an incredibly challenging game.  Somehow, I don't think the target audience is going to appreciate all the work involved.  But if consumers don't warm up to the proposition, at least rescued victims show the proper respect for their saviors.  Emails come in, bearing thanks and positive wishes for a job well done.  News reports, displayed as screen captures with accompanying voice-overs, document the day's work.  Details such as these give the title some personality, which the unremarkable visuals and isometric viewpoint otherwise fail to convey.  Music plays only during mission briefings, though it's a nice touch, as is the voice of the captain, urging you to get out there and get the job done.  The speech samples which indicate the presence of people nearby are severely annoying, such as the kid who quips ~can we do it again?~ after being dragged out of an inferno.  Yeesh...if only we could convince the little bastard to play 'Drink From the Firehose.'  All told, Emergency Rescue: Firefighters is more complex than it needs to be.  The game contains an admirable amount of content for a budget title, yet you can't help but feel that the designers tried and failed to pack more features into the scope of gameplay than was prudent.  Had the interface been cleaned up, the pathfinding routines tweaked, and the level of micromanagement adjusted a tad in favor of the end user, this would have been a product that more than justified an already reasonable $19.99 price tag.  Under the current circumstances, however, Emergency Rescue: Firefighters is a slightly below average game that should sizzle its way off of your hard drive a scant few days after purchase - and that really burns my buns.  -- Scott Steinberg", "date": "Jun 6, 2000"}