{"name": "Brain Challenge", "name_review": "Brain Challenge Review", "ref": "https://www.ign.com/articles/2008/01/14/brain-challenge-review-6", "text": "While scrolling through the lists of upcoming games, a shiver runs down my spine when I see anything that includes the word ~brain.~ The barrage of brain games have not only been no fun whatsoever, but all too often are so bad they induce migraines. But Gameloft may have done a first with their newest title, Brain Challenge. They created a third party brain game that manages to actually be fun and functional, and didn't make me feel like my head was going to explode like that guy from the beginning of Scanners.   Okay, you all know about brain games. If you like the genre, you probably already own a Brain Age or Big Brain Academy. So the most important factor is: what makes this one special? Well, for starters, Brain Challenge throws in a Stress Training mode. The basic premise being that it takes one of the brain tests (or multiple brain tests) and has you play while undergoing stressors. Some games require multitasking like managing traffic on a bridge, while others have bosses yell at you, or loud sirens blare while you struggle to do math equations. It's not the main function of the game, but the stress games have their own tests that measure your stress level, and since they generally require multitasking and quick thinking, they almost feel like real minigames.   As an extra feature, Brain Challenge offers nine unlockable bonus modes. The extra ~games~ promote creativity and relaxation. They're not worth booting up the game just to check out, but some of the features, like the fish pool, are neat little distractions.    Brain Challenge opts to move away from the cartoony style that so many other brain games use. Instead they give the player a 3D rendered doctor to guide them through the game. The doctors look more like soap opera actors portraying medical professionals, but hey, I'm not complaining that my brain trainers are a hot blonde chick and a dude with rock hard pecs and a tight t-shirt.   Saying I'm a 'Future Genius' is a nicer way of saying I'm 'Dumb Right Now.' The test is standard fair for the genre. The player is given five minigames that each measure an aspect of cognition: Logic, Math, Memory, Visual, and Focus. At the end of the test the player is given a percentage based on how well they perform. The object is to move away from using only 10 percent of your brain (an erroneous theory anyway), eventually working up to 100 percent. It's a little misleading since the whole concept of percentage of brain used is an actual scientific study. Just recognize it for what it is: an arbitrary number to track your progress.   The games are a mix of things you've probably seen before in other brain games, and some newer stuff. Focus games require players to concentrate of specific things while ignoring others. Logic makes you deduce things through evidence. Memory is... well, I can't remember. Point is, the presentation is pretty similar to Big Brain Academy, except Brain Challenge opts for a shinier, more realistic style. It's crisp and clean and is far higher quality than some of the other crap I've had to endure.    Between the multiple modes there are 33 different games. Most show up in the tests, but it will take weeks of playing to unlock them all in the training modes.   There are some major things that Brain Challenge got right, like the ability to track progress. I can't believe how many games leave that feature out, and thus ruin the title right off the bat. Brain Challenge keeps line charts to show you your progress overall and in each of the five areas, and has a bar graph showing what level you're at for each area, so you know which ones need work.   Brain Challenge also features really solid handwriting recognition for the number related games. The game not only recognizes the number quickly, but, during my time playing, it never read my chicken-scratch handwriting incorrectly, a feat Brain Age cannot claim.If you're the type of person that loves brain games and has been dying for another decent one to come out so you can prove your cognitive prowess, then Brain Challenge is the third-party answer to your prayers. For the rest of us, who have likely played brain games before, this title isn't going to offer a tremendous amount of original features. The Stress Test mode is different and does make the task of performing simple mind tasks more exciting. And hey, if the only motivation you need is hot doctors, Brain Challenge has the floating head of Dr. Kawashima beat.", "date": "Jan 14, 2008"}