{"name": "Paperboy", "name_review": "Paperboy", "ref": "https://www.ign.com/articles/1999/07/20/paperboy-5", "text": "Digital Eclipse comes through with another Game Boy Color port of a 1980s Atari arcade machine, but unlike its past efforts such as Klax and Defender/Joust, Paperboy comes off like a quick hack. It honestly doesn't feel like the programmers went the extra mile to make the game feel, sound, or play just like the original, and even as a standalone Game Boy game Paperboy just isn't that much fun. Features  Digitized sounds effects and MIDI music. Three difficulty levels. Gameplay based on a 1986 arcade game Only for Game Boy Color.   The Game Grab your baseball cap and put it on backwards -- you've got a delivery route to maintain. The game is broken down into seven days,  Monday to Sunday, each increasing in difficulty. The idea is mindlessly simple: ride your bike, giving your subscribers a paper on the doorstop by tossing a bundle in its direction. Deliver it, and you keep the customer. Miss the house or smash the window and you lose them on the next day. But because you're not the most honorable paperboy, you score points by smashing non-subscribers houses. A perfect delivery will net you an additional subscriber on the next day. The challenge is to get through your route without crashing your bike into the many evil objects on the sidewalk and street -- oncoming traffic, rabid cats, punks on unicycles, runaway tires...you name it, they're in there trying to knock you off your bike. At the end of the route, test your skills on the Training Grounds by hitting jumps and knocking over targets with your newspapers.  In all honesty, the Game Boy Color version of Paperboy is definitely the worst rendition of the game, even beating out the Atari Lynx's waterdown port of the arcade game. The gameplay slows down whenever there's more than three papers in the air or whenever a digital sample needs to play, and the music is absolutely horrendous -- Paperboy was always about great audio, and this game has none of it. Even the speech from the arcade is missing. The game just isn't Paperboy without shattering a window and hearing ~Service with a smile.~ All this, and it's extremely difficult to judge exactly where a paper is going to hit on a house. The collision detection isn't exactly spot-on, that's for sure. Digital Eclipse has a great team of retrogaming fans, but even it can't pull off a Game Boy port of a classic Atari game successfully 100 percent of the time -- first with 720, and now with Paperboy. Granted, no one's been able to truly port Paperboy with the same magic as the arcade, sans the awesome PlayStation port on Atari's Greatest Hits 2 title (also by Digital Eclipse). The Game Boy Color version of Paperboy is a no-frills, straight-forward, flawed conversion, and nothing more than that. A shame.", "date": "Jul 20, 1999"}