{"name": "Burnout Paradise", "name_review": "Burnout Paradise Review", "ref": "https://www.ign.com/articles/2008/01/17/burnout-paradise-review", "text": "Criterion Games' Burnout franchise has now long been the king of arcade racing. Its tight controls and overwhelming sense of speed have catapulted it to the top of the genre, and few games have come even close to matching the series' strengths. But while Criterion has garnered tons of praise from both gamers and critics alike, the studio never sits still. With every release, the developer tweaks the core formula in an attempt to offer something new to gamers.   Burnout Paradise sees what are arguably the biggest changes in the franchise's history, with nearly every single aspect of the game having seen some sort of shift in design. Some of it works really well, and some of it not so well, but what we wind up with still remains an intense, blazingly fast and perfectly controlling racer, one that you shouldn't miss.    The biggest change introduced in Burnout Paradise is the move to an open world, the streets of Paradise City (cue Guns 'N' Roses title track). The entire city is open at the start of the game, with the idea being that you can do whatever you want, whenever you want. Not all of the events are present at the start, mind you, and you'll have to put in a lot of time to unlock the game's roughly 75 cars, but you're never limited in the options before you.   There are bits of good and bad to this. The good is that the city design is great, offering up plenty of varying spots for you to race in and tons of hidden areas to find. There is no shortage of tucked away passages, underground runs and all sorts of cool spots to hit. You'll find jumps littered everywhere, including small ramps with kickers on the side to send you into a barrel roll, which are great for the Stunt runs (which we'll come back to in a bit).   The main downtown area of Paradise City is very reminiscent of the downtown tracks in the last couple games, while the western section of the city harkens back to the long, winding, countryside courses of past games as well. A couple of highways will put you dead in the middle of traffic and give you plenty of road to get up to speed on.   The car designs are fantastic. Paradise City is very dense, especially the eastern, downtown section, offering you a myriad of ways to get through a race. When a race starts, you simply must race from point A to point B as fast as you can, along whatever route you want. While this means that you're given the freedom to create your own course, it also means that you'll be stopping the action and referring to the map fairly often to make sure that you don't take any wrong turns. Since there are so many different tunnels, highways and such to take, it can be easy to make a wrong turn and wind up going off course for a bit. Until you've memorized the bulk of the map, which given its complexity, will take quite a long time, you'll likely have to pause and check the map two or three times during a race to make sure that you're on the right path.   There's an in-game indicator of where the finish line is, but it just points in the compass direction and doesn't help with turns or anything of that sort. This is understandable to a degree since Criterion (rightfully so) wants you to create your own routes and not rely on what it thinks you should do, but it does mean that you'll be at the mercy of the pause screen until memory starts taking over.    Another downside to the overall design of the open world setup is that you cannot simply pause and restart an event. This means that if you race from one side of the map to the other, which you will often do, you'll need to turn around and drive all the way back to the starting point to try again if you lose. While this sounds, and can be, annoying, changing the way that you approach the game helps to overcome this for the most part. Knowing that this was the case, instead of trying to perfect every event as we went along, like we've done in the past, we instead tried an event and, regardless of the outcome, just tried something else nearby when it was over. Playing this way makes for a much more organic experience and will help greatly in lessening the annoyance of not being able to quickly restart, though if you're aiming for a 100% completion rating then you will inevitably have to drive back to the starting line when you're down to the last few events in the game.   Of course, races aren't the only event type to be found in Paradise City. Of everything in the game, it's perhaps Road Rage that has seen the smallest amount of change, which is perfectly fine by us. The only major difference this time around is that instead of having three target cars at any one time, you'll now have five or six at a time to take down. It's a small change, but Road Rage is even more chaotic now because of it as you'll see more cars than ever before crashing in front of you and flying over your windshield. We still can't get enough of it.    The Crash mode of old is essentially gone, replaced by Showtime events. Rather than racing up to a streetlight and spinning your wheels to begin it like most every other event, Showtime can be started at any time (even as you're already crashing) by hitting two shoulder buttons. Your car will immediately begin flipping and you'll start racking up a score for the street that you started the Showtime on. While the street that you begin the event on is where your score will apply to, you can actually flip and crash across the entirety of Paradise City if you're good enough.   There are major differences between Showtime and the Crash events of old, however. You can keep your crash going so long as you keep moving, which you can prolong by bouncing your car if you have some boost. Boost is earned every time you hit a car, which also increases your score, of course. However, you only earn points for cars that you actually hit, not those that crash around you, and you only earn multipliers for hitting busses. The bus-only multiplier thing is disappointing because you can go for 10 minutes without seeing a bus during one Showtime, but start another and hit a handful right away, thereby giving you exponentially more points simply because of randomized luck.   Regardless of that, there isn't a whole lot of skill involved in the Showtimes, aside from seeing how absurdly long you can keep it going. But the required scores are easy as pie to hit, and since there's no planning or anything involved in what you're doing, it feels like most of the challenge (and thereby fun) of the old Crash modes is gone.   Road Rage is largely the same, but it's still the best incarnation yet. Showtime events are coupled with timed runs for each street. If you head to one of the ends of any road in the game and start driving on it, a counter will begin ticking up that shows you your time. It's a very simple and very natural way of including time trials in the game, and as simple as it is, it works really well.   Stunt events are the freshest addition to the Burnout formula, tasking you to rack up a certain amount of points in a given timeframe. While you'll earn points for sliding around turns and boosting, you'll only earn valuable multipliers for jumping off ramps, crashing through gates or performing a barrel roll, which gives you double goodness. It's a pretty awesome event that'll have you screaming down streets, looking for just one more ramp to hit to help keep your combo alive. The only downside here has to do with the different types of cars you can choose and how they affect a Stunt event's difficulty...    Each of the 70+ cars in the game falls into a certain category, either Stunt, Speed or Aggression. The Aggression vehicles are large and heavy, perfect for Road Rage, but not so much for events that require agility. Cars with the Stunt classification are designed to be good for jumps and drifting, and most resemble the rides that you'll find in past Burnout games. Speed cars specialize in excessive boosting as they allow you to chain together Burnouts to keep your boost going forever, but they have a downside in that you can only start a boost when your meter is full.   Having to wait until your boost meter is full means that the Speed cars are more finicky during races, though the payoff on long straightaways can be greater. But during Stunt events they wind up being terrible picks since a quick tap of the Boost in any other vehicle will immediately extend your combo meter. In a Stunt or Aggression car, you can take a jump for points, cruise for a bit while looking for your next jump, and then tap the boost for just a second when your combo is about to expire to extend it. Not so in the Speed cars. This boosting difference would make more sense if the Speed cars were noticeably faster than the other types, but they're not.    One pretty cool thing relating to the vehicles in the game is how you earn them. When you get a new license, you'll be rewarded with a new ride in your junkyard for driving immediately. All of the other cars, however, have to be taken down first. When you ~unlock~ a car after an event, it will then appear somewhere in Paradise City and drive around on its own. In order to fully earn it, you have to find said car and then take it down. Like our approach to event selection, we found this to be best when we didn't bother hunting them down after unlocking them, but instead kept doing our thing while keeping our eyes peeled. Then when a car crossed our path, we'd drop everything and head out with a new ride in our headlights. It's a pretty awesome mechanic that helps instill life into Paradise City.   Perhaps the most well-implemented addition to the franchise is the way that online play works. Instead of having to jump out to a separate menu to get online, invite friends to your game, set up challenges or whatever else, all of this is manageable in-game with the D-Pad. Pressing right on the D-Pad opens up the online menu where you can then hop online, invite friends to your game, set up race events or whatever else you want, all while your engine is still running.   When a friend or two (or seven) hop on, you have a number of options. You can create a custom race where you can set start and end points and drop any number of checkpoints onto the map. You can even save these routes for play later on so that you don't have to keep making them. You can also start a Freeburn Challenge of some sort. There are 50 challenges for each number of players in the game. In other words, there are 50 challenges for two player, 50 different challenges for three players, and so on and so forth, giving you an absolute ton of Freeburn runs to complete (yes, 100% completion will take a long time). These are as simple as having two players race from opposite sides of an open bridge and crashing in mid-air to having every player do a barrel roll through a hoop. They're all good fun and give you tons of different things to do.   Speed, speed and more speed. Oh, and some extra speed for flavor. Regardless of everything we've talked about, the most important part of any Burnout game, and the reason they've been so successful in the past, is simply how well (and fast) the driving mechanics work. Criterion has nailed the formula once again, offering gamers the pinnacle of arcade racing mechanics with cars that control exactly how you would expect them to, with the perfect amount of inferred weight sent to the player. As well, the sense of speed we've seen in the past is here 110%, with roadside objects blurring by your outside mirrors at uncountable speeds.   Lastly, it's worth mentioning that Criterion has also once again delivered a game that runs incredibly smooth and sounds fantastic. The game runs at a blistering 60fps, which ties perfectly with its controls, and it looks impressive at that. The crash effects are fantastic, slowing down to show you your crumpling wreck as the steering wheel is shoved into the driver's seat. Were there a virtual driver sitting there, he'd be dead.Burnout Paradise has its share of flaws, but it's also incredibly fun. The change to an open world brought its share of issues, like having to use the map as a crutch to get around for a while, but it also allows for freedom unseen in any recent racing game. Most importantly though, Criterion has once again delivered a racing experience that can best be described as controlled chaos, one where even crashing is immensely rewarding. If you're even a remote fan of racing games, be sure to check this out.", "date": "Jan 17, 2008"}