{"name": "Baseball Stars 2", "name_review": "Baseball Stars 2 Review", "ref": "https://www.ign.com/articles/2008/01/18/baseball-stars-2-review", "text": "Fast-paced, flashy and over-the-top in almost every aspect, Baseball Stars 2 is a sports sim on steroids. Previous baseball games to come to the Wii's Virtual Console have been tame  the simplistic 8-bit NES launch title Baseball came first in January of '07, and was followed by the forgettably middle-of-the-road TurboGrafx effort World Class Baseball last September  but Baseball Stars 2, which originally hails from the NeoGeo hardware, is anything but boring. This high-octane take on America's favorite pastime is immediately inviting, and just a joy to play. If you've been waiting for a worthwhile baseball game to finally come to the Wii Shop, one's certainly arrived now.   The manic pace of play, schizophrenic graphics and overly colorful style presented in Baseball Stars 2 come from its origins as an arcade title. With arcade-goers only earning themselves three minutes' worth of playtime with each quarter spent, the game had to be instantly engaging and quick to get to the action  and even though this version of the game is no longer limited by how many coins you can drop into it, the ~arcade~ feel is still perfectly intact.   You begin a game of Baseball Stars 2 by either launching into a head-to-head match-up against a human friend, or jumping into a 15-game season where you'll pick yourself a team of potential winners and try to take them all the way to the championship. There's no option for a quick, one-shot single player contest, which is odd. But in a game as ridiculous as this, you won't really mind.     The teams are all the stuff of fantasy, as nothing even remotely resembling an official MLB license is anywhere near this one. Instead you'll find squads like the New York Monsters and Taipei Hawks ready to roll, each stocked with players whose names reference their team in some way  there's a character named ~Hayabusa~ on the Tokyo Ninjas team, for example. A little nod to Tecmo's Ninja Gaiden series, there.   Taking the mound, things play out as you'd expect. As the batter, you can adjust your stance and position in the batter's box, and choose to either swing away or bunt. As the pitcher, you can control the flight path of pitches in the air with the D-Pad, either choosing to throw straight heat or more deceptive pitches, like knuckle balls. You can also direct the ball to bean the batter with relative ease, but be wary of doing that  because a just-beaned batter will often charge the mound and punch your pitcher in the face.   That event plays out in a brief, two-second cutscene that focuses on the batter running north from homebase and then ends with a close-up stillshot of his fist hitting the pitcher's jaw. Brief cutscenes that highlight dynamic action moments like that are all over Baseball Stars 2  when you slide into a base, or when a fielder makes a diving catch. An example of one such leaping grab is shown in the screenshot up above. You get a lot of detail in these moments, and they accentuate the energy of the game.   Also keeping things colorful is the game's nearly overly vocal announcer, whose comical comments call the action as it happens. He'll also occasionally just cry out the name of the game for no reason whatsoever, but it's hilarious when he does so. ~B-b-b-b-b-b-Baseball Stars Twooooooooo!~ Genius.Baseball Stars 2 is a blast, and by far the best baseball title to come to the Virtual Console so far. It presents America's signature sport in ridiculous fashion, with a great, over-the-top presentation that's full of energy and a lot of fun to see. Its gameplay is fast, but still respects the rules of the game  this is still baseball, even though it's flashy and exuberant. At an asking price of 900 Wii Points, it may seem a little expensive. But it's definitely worth investing the extra couple of bucks over the alternative options of NES Baseball, or the Turbo's World Class. Give it a shot, sports fans.", "date": "Jan 18, 2008"}