{"name": "Ape Quest", "name_review": "Ape Quest Review", "ref": "https://www.ign.com/articles/2008/01/19/ape-quest-review", "text": "The PSP has received its fair share of digitally distributed love thanks to the PlayStation Store, which has provided more than 20 titles to download and play via memory stick.  Some of them are classic PlayStation One games, while others were UMDs or PSP-specific games.  However, while there's been a ton of sports, racing and platforming titles, there haven't really been a lot of RPGs available from the store, until now, and it comes from an unlikely source.  The simians of the Ape Escape have broken away from their academy, escaped from their nets and are exploring new islands with Ape Quest, the recently released RPG.  But is the title worth your hard-earned bananas?   The initial premise behind the story of Ape Quest is one that you've probably heard in a number of RPGs, albeit with some mild adjustments to fit the subject: a long time ago, a land filled with apes was invaded by an evil group of monsters known as Apetrons.  These malevolent beings threatened to wipe the peaceful monkeys out, but fortunately, a light descended from the sky in the form of a magical statue known as a Spectral Bank (which looks like a golden figurine of Specter, for Ape Escape fans).  This artifact stopped this hazard in its tracks, imprisoning them within a large structure known as an Apetronolith.  With the aid of a mystical seal banana, the Apetrons were kept away from the rest of the world.   Which way should I go? You play a dimwitted prince with a penchant for bananas that is heir to the throne of the land (of course, I'm sure that you can see how this will end).  Your father calls you before him one day and decides that you must be tested.  Unfortunately, during your test, you wander across the magical banana, plop it into your mouth, and release the Apetrons onto the land once more.  It then falls upon your shoulders to venture forth, find a way to defeat these monsters and save the land of the apes.   At first, it sounds like a pretty standard premise, as you buy and sell items collected in towns, forge new gear at the smithy and acquire quests from guilds to perform.  Many of these quests are typical fare, such as deliver an item to one place, escort a character to an area, or find an artifact.  However, players aren't allowed to wander freely around environments like you would in other RPGs.  Instead, movement is dictated by specific arrows that define the prince's movement along pathways that crisscross the land.  Once you get to the end of a path, you choose a different direction and head along a number of paces until you get to the next junction. These trails aren't free of distractions or other events; as you proceed, you can potentially run into one of three random events.     Expect to see these faces...A lot. The first might be a mini-game based on different tasks, such as deflecting incoming arrows or scaling rock walls.  These mini-games frequently result in some experience bonus if you succeed, or a Guts penalty (the equivalent of health) if you fail.  If you really blow a mini-game, however, you're not completely out of luck, because you can always access a feature known as the Banannals, which lets you practice any mini-game you've unlocked across the game.  This is a cool feature, although you will find that some repeat more frequently than others, which can get old after a while.  The second event could be a situation, such as an ape asking you for help or a trade for items. While you have to make a decision within these situations, it doesn't usually have an impact on your character.  His stats aren't typically affected, and the story doesn't particularly change because you decided one thing over another.  This is more of a letdown by comparison to the mini-games, where you at least feel like you're gaining something for your time, even if you burn out on some of them.    Finally, you could get in a fight against up to three different monsters.  Since Ape Quest doesn't provide party members, you're going solo against these beasts.  However, you're not helpless by any means.  Every hit you land on your enemies builds your technique meter, which can be used to trigger special attacks (based on the weapon you have equipped).  What's more, if you need a little extra firepower, you can attempt to call in The Ape-Team, a group of monkeys that you befriend over the course of your journeys that sell you various items.  By paying them extra chips (the currency of the land) in the middle of battle, they'll run to your side and attack any creature you want them to, inflicting additional points of damage. Chips also have a larger advantage within the game, as you can use them to purchase specific favors from the Spectral Bank.  Some of them are relatively basic, such as unlocking music or healing your wounds from battle, while others are more involved, such as teleporting from your present location to a town or unlocking a dungeon that you can explore.  As long as you have the chips and you're not in battle, you can purchase as many items from the bank as you wish.     The trademark Ape Escape humor is intact. There is a significant caveat that RPG fans should know, however, when it comes to battle sequences.  The biggest problem that exists within the game is that the variety of monsters is extremely limited.  Most random battles will pit you against either a skeletal footsoldier or a floating skeleton magic user that you fight.  Sometimes, there will be a giant version of the same two monsters for a little variety.  While there's only so much that you can expect from a downloadable title, this is particularly disappointing.  In fact, the only real variety comes when you go up against an Apetron monster or main quest creature, which appears to be an animal made up of energy.  Since they are restricted to these quests, it's really annoying to attack intriguing monsters as a ~boss battle~ and have to slog through the same enemies fight after fight.   Even with the combat detraction, what makes Ape Quest stand out from many other RPGs is its episodic-style gameplay feature.  While the initial starter pack of the game is free and gives you a taste of what the gameplay is like, it can be completed in a half hour or less.  To fully complete the game, players need to download either the Blue or Gold Chapter as well as the Red Chapter to complete the game. Each chapter is much longer, with more quests that players will need to complete before they face off against the Apetron of that chapter and move onto another section.  However, if you happen to power level your simian through one of the earlier chapters, you may find that taking him through the hazards of the other two are way too easy, making their completion more of a bore than an enjoyable time.  Another funky element of the chapter is that it completely replaces the content of the previous title, meaning that you have to re-install each chapter if you want to return to a previous level.  This is particularly confusing if you happen to download everything to your PS3 and find that you've overwritten the chapter info over and over again.     Over the top, monkey -- Over the Top! Visually, the artistic style of the Ape Escape series definitely comes through, whether it's the ridiculous costumes that different apes wear through the course of the adventure or the different mini-games that you play through.  For instance, it's pretty amusing to see apes being fired from cannons, watch monkeys splitting coconuts with machetes or attempting to be samurai.  It's obvious to see that a lot of attention was paid to the animation of the monkeys and their movement.  This does come at a price, because the textures and environments can be relatively bland and generic, which really stands out on the PSP screen.  Sound is good as well, with a nice variety of musical tunes and sound effects associated with environments, battles and mini-games.  While you will need to unlock some of them to experience them, they are pretty diverse and interesting enough.Overall, players will need to evaluate whether it's worth it to pay $9.99 each chapter (or $19.99 for a bundle of all three) to fully go through Ape Quest.  Packed with mini-games and RPG elements, the game is an amusing diversion for your PSP.  However, you'll have to accept or completely overlook the limited combat and repetitive nature of some mini-games to find it within this title.", "date": "Jan 19, 2008"}