{"name": "Deal or No Deal", "name_review": "Deal or No Deal Review", "ref": "https://www.ign.com/articles/2008/01/19/deal-or-no-deal-review-2", "text": "Hey, remember Bobby's World? Man, that cartoon was great. I remember one episode where Bobby made a joke by mixing up the words ~tentacles~ and ~testicles.~ Aah, comedy gold. Sorry, I'm desperately trying to remember the good old days of Howie Mandel's career because, after playing the Gravity-I developed Deal or No Deal for the Nintendo DS, I don't think I ever want to see his smug, germophobic face again. It's a boring, broken mess that offers less features than the Plug-and-Play version of the same game.   The premise for Deal or No Deal is very basic. There are 26 briefcases, each with a different monetary amount, from $.01 to $1 million. The contestant picks one briefcase, then listens to Howie Mandel make bad jokes and wash his hands for another half hour. At the end they get some money. Seriously, if you don't know how this gameshow is played, you wouldn't even consider buying the game, so I'm moving on.   This isn't the kind of game show that seems like it would translate well into a home game. It's not like Jeopardy or Who Wants to be a Millionaire which both require contestants to answer questions. Deal or No Deal is all chance. It's gambling on primetime. The only reason the show is exciting is because people could win a bunch of money. When there is no real money involved, and you're not on TV with a former celebrity, the game isn't fun to play.   You know what else makes games not fun to play? When they're freaking broken! Deal or no Deal has the number values preset to certain briefcases, which means that every time the player turns the game on, the money is in the same damn briefcase. If you play multiple rounds without turning the system off, the game randomizes the cash values, but once you shut it down, the money goes back. Briefcase 3 always had the cool million, and Briefcase 13 always had the penny.   What's wrong with his face? and his hands? And those girls? There you have it. Deal or No Deal is broken from the start. It's playable only once before any sense of challenge or fun (what little there was) is completely shot. It's unbelievable how dumb this mistake is, especially considering that it would be incredibly simple to fix.   That should be enough to dissuade any purchase of this title, but, in case you're thinking of getting the game for your friend or relative with anterograde amnesia, you should know that the game sucks in every other respect too.   Howie Mandel doesn't look like nearly as big of a jackass as he does on the show. Instead he looks like a leukemia patient with huge banana hands. Creepier yet, his 26 babes that hold the briefcases look like cheap department store mannequins, the kinds with no facial features.    The sound has an interesting dichotomy of offering way too many one liners from Howie, and barely any other sound effects. The crowd has two noises: disappointed and mildly excited. Is it too much to ask that they get a little more enthusiastic when I win a million bucks (six times in a row)?   The game also has no save feature whatsoever, so there is no way to track your winnings, or compare scores. As soon as you win, it kicks you right back to the title screen. It'd be like them shoving the contestant off camera as soon as that last briefcase opened.   Deal or No Deal does offer two extra game modes, but these are even less exciting than the main game. One is a Mastermind style game involving guess a safe combination, and the other is High-Low, but with the briefcases. Neither of these games are very interesting, and don't even have Howie hosting them. It's eerily silent at points, and they don't even have a game show feel to them. It's like you're just hanging out with 26 robot mannequin ladies.This game never should have come into existence to begin with. Deal or No Deal is not a game show that translates well to video game form. But hey, since Gravity-I went ahead and made it, they could have at least bothered to make it work. At least then Deal or No Deal would be a boring, pointless, annoying game. Instead, it's a boring, pointless, annoying game that is fundamentally broken and thus rendered completely absurd, much like Howie Mandel himself. To top it off, the game isn't even budget priced, making it an even worse deal.", "date": "Jan 19, 2008"}