{"name": "One Piece: Unlimited Adventure", "name_review": "One Piece: Unlimited Adventure Review", "ref": "https://www.ign.com/articles/2008/01/24/one-piece-unlimited-adventure-review", "text": "The One Piece series has had a pretty impressive track record over the last few years.  We wouldn't go as far as to nominate the games for our year-end awards or anything, but as far as licensed games go, there's no denying the momentum Namco's property has.  For One Piece loyalists, Monkey D. Luffy and the gang have delivered everything from mini-game compilations to full-on adventure style games, but all along the core success came from the battle engine, which mixed the franchise's humor and visual style with free-form battle inspired by games like Power Stone on the Dreamcast.  If you were a fan of One Piece, you had some solid gaming to go with your collection of DVDs, manga, oversized Luffy slippers, and inflatable Nami ~snuggle~ doll.  Unless we're the only ones that order those   The bar was set pretty high with One Piece: Grand Adventure, as it was the final entry to the PS2/GCN engine, and had upwards of one million options and modes to play with (that isn't a fact, so don't quote us).  With Wii, Shonen Jump's lovable anime made the transition to full-on adventure, mixing in the expected combat along the way, but delivering a more graphically mature, high budget feel.  Gone are the days of super-deformed characters and Power Stone fighting, as the series moves away from combat, and towards motion-inspired adventure.  More production value, different direction.  Straight away you'll notice that the soul of One Piece is still alive and well in Unlimited Adventure.  That is to say, if you dig the show or comics, you'll be pleased with what you get in Unlimited Adventure.  The vs. mode (a smaller extra game experience this time around) is home to 40 fighters, each with multiple basic and attack animations, whle the core experience revolves around the traditional cast of Luffy, Zoro, Nami, Usopp, Sanji, Chopper, Robin, and the amazingly disturbing Franky.  Each character can be switched to on the fly throughout the adventure, and each has their own move set, health, and SP bar (used for dashing and advanced techniques).  Switching is as quick as hitting the minus button and scrolling the analog stick.   And while the initial move from fighting to action/adventure is a bit of a drastic step, One Piece again feels less like a slapped together experience, and more like a full-fledged offering for fans.  Each fighter is well balanced, having Usopp build up ranged attacks while the over stimulated Chopper (basically a tiny dog-child with insane speed and agility) runs about the battlefield breaking apart the ankles of the enemy.  The more you use a character, the more their attacks build, so while it's annoying to use the same punch over and over again with Luffy, you'll quickly unlock more gum-gum goodness.  This also means that while you have access to all eight players from the start of the game (or within about 15 minutes), you can decide who you actually want to use.  Franky flexes a bit much for our liking, so we'll stick with the strong fighting, good looking Nami instead.    Speaking of nice scenery, Unlimited Adventure also had to open the world up a bit more this time around, as you're now traveling through open world environments with optional enemy engage points.  Characters fade in, you fight, and move on.  And while the larger world is more ambitious than any of the previous games in the series, we can't say they're as much fun, as you do a ton of item hunting via kicking trees or knocking over groups of bushes over, and over, and over again.  As the game builds you'll gain access to motion-activated tools such as a pick-axe, bug net, and fishing pole, but they're pretty simple in design, and a bit unreliable in execution.  We often had to do the swing motion for the axe numerous times to get it to land, for example.    The larger world also makes for a ton of backtracking, as you're constantly hunting for items, moving around the world in the process, and then retracing your steps to a specific area where those items are needed.  A mysterious orb is used as a focal point for the game, having Luffy and the gang feed it with specific items to give it enough energy to morph the world, and while the concept of feeding an item with other items is interesting (and admittedly fun for a while), it definitely draws thin.  You start to wonder how many times you'll need to fight the same group of spawning enemies, run past the same rock or tree, or beat up the same group of pretty, well-to-do flowers.  It's times like these where we wished the game would have kept the new look, but focused on the battle aspects in a much bigger way.  Luffy kicks a little butt.  There's still some definite fun to be had, as the game was designed with an obvious level of forethought (rather than just being a garbled mess of assets), so things like character auto-lock for combat, the automatic skill increases, and multiple character strategy can still hold their own for a while.  The combat system even uses an on-screen attack prompt not too different from something like Tony Hawk's trick attack mode, so you'll have a list of attacks to pull off, and as you do your character powers up a final focus attack.  Throw in a ton of VO for each of the characters, some pretty impressive (though minimalist in style) CG work, and you've got a package that  while not the best we've seen in the series  still has some pretty recognizable high points.  So it all begins again on Wii, as we take a look at One Piece: Unlimited Adventure.  It's a new design, fresh take on the franchise, but also a bit of a thin overall product; at least in its first effort.  Eight playable characters means tons of diversity, as you can level up and work with the character you like, and the new adventure style  while still a bit too empty overall  certainly increases the scope of the game.  Gone are the days of chibi-fighters and Power Stone gameplay, but in turn we've got a more mature, rounded experience with Unlimited Adventure.  Remove some of the needless fetch quests and bulk up the core of the game, and you'd have one of the best anime experiences on Wii to date.  As it stands right now, One Piece will most certainly satisfy fans of the anime/manga, but won't reach too many players beyond that.", "date": "Jan 24, 2008"}