{"name": "No More Heroes", "name_review": "No More Heroes UK Review", "ref": "https://www.ign.com/articles/2008/01/29/no-more-heroes-uk-review", "text": "It's not often we're so utterly blind-sided by a game that we haven't the faintest idea where to start talking about it. Actually, come to think of it, last time it happened, it was for Grasshopper's other maniacally bonkers experiment in game design, Killer 7. If you ran for the hills five minutes into that one, it's probably reassuring to know that No More Heroes eschews its predecessor's fascinating, if near-incomprehensible, narrative structure and left-field play mechanics for something far more accessible.   Like Killer 7 though, No More Heroes positively drips style  whether that's through its hipper-than-thou character design, high-contrast comic book visuals, stellar soundtrack or near-omnipresent eighties-retro-punk trimmings. Oh, and also like Killer 7, No More Heroes' is likely to be as divisive as hell.   Santa Destroy welcomes careful drivers!  On the surface though, it's a far more conventional affair this time around. The premise is simple: you're Travis Touchdown, ranked eleventh most deadly assassin in the United States. With lightsa sorry, beam katana, in tow, your goal is to rise up the ranks, picking each wannabe contender to the throne off one by one. That's pretty much it  kind of. Trouble is, there's a lot more going on beneath it all and it's near-impossible to take No More Heroes  and its endless parade of quirks and idiosyncrasies - at face value.   At its heart, No More Heroes is a celebration of popular culture - from the great to the downright awful. Whole reams of its plot are cribbed straight from classic 80s movies, including more than adequate nods to Star Wars and Back to the Future. In fact, the game embraces the era of VCRs and arcade cabinets with reckless abandon and everything from retro shooters to side-scrolling beat-em-ups are paid their dues - even if it means sacrificing traditional design wisdom to fit its agenda.   No More Heroes: literally the coolest game ever made.  Pared down to a bare minimum, No More Heroes is essentially two-part third-person action brawler, one-part open-world explorer. Looking at both of these with joyless critique hat firmly in place, No More Heroes is a peculiarly erratic experience. In creating the streets of Santa Destroy, Grasshopper has crafted an utterly soulless slice of generic small town Americana. That empty over world oddness is likely to flummox anyone expecting a traditional free-roaming experience but it's no coincidence that, for all the town's relative enormity, the only places you'll ever visit are tied directly to Travis's self-absorbed otaku obsessions.   You'll spend maybe a third of your time out on the streets, racing your Schpel Tiger motorcycle from hilariously mundane employment at the job centre to shadier pursuits in the employ of the assassination bureau. Ultimately, your goal is to line your pockets enough to pay the admin fee for your next rank-raising assassination mission. As the game progresses, you'll also have cause to slap down ever-escalating piles of cash to improve your weaponry, stretch your wardrobe and tone your gut for some juicy stat upgrades.     Compared to the breathless third-person action portions of the game, No More Heroes' free-roaming side-quest structure is a bit harder to swallow, whether you're in on the joke or not. Earning cash is knowingly as shamelessly repetitive as real-life hard graft and perpetual returns to Santa Destroy occasionally threaten to undermine the flow of the game as a whole. Somehow though, the utterly arbitrary odd-jobs you'll do around town succeed in a perversely sadistic way. No More Heroes is a game that's intent on stripping down what it means to be a gamer and for every blood-thirsty fantasy on display, there's the mundanity of reality to deal with too. As you're waddling across the beach carrying watermelons to a stall vendor or endlessly mowing the lawns of suburban Santa Destroy, you'll be yearning for the breakneck action of ranked assassination missions - and No More Heroes delights in making you wait.    Motion-control is reserved for key combat moments - and works a treat.  Eventually though, Grasshopper truly lets rip and, once you've left the empty streets of Santa Destroy for more traditional third-person play, No More Heroes offers an almost overwhelming assault on the senses. With one of the most visceral combats systems ever created at your disposal, it's an always tough, but constantly engaging slog through hordes of henchmen to reach your target. Once you're face-to-face with your next major opponent though, things switch even further up a gear, offering some of the most inventive and downright hilarious boss battles ever to grace the small screen. Given how so much of the game's appeal comes from experiencing the unexpected, it would be unfair to give away details on your ten formidable opponents  suffice to say though, crotch-mounted lasers are par for the course.   Using a combination of traditional analogue control and motion-thrusting, wielding your beam katana is an absolute joy. What's more, Grasshopper has utterly nailed the Wiimote here  potentially exhausting sword-swinging is tethered to button input while motion-sensing is reserved for satisfying final flourishes. First impressions can be deceptive though and, early on, it's easy to mistake combat for a simple button-masher. It's not until later levels that you're really forced to use your entire arsenal of moves - mastery of high and low attacks, evades, blocks and timed combos becomes absolutely essential, which can be a brutal shock to the system. And that doesn't even factor in the swarm of motion-based wrestling moves you can unleash once your opponents are sufficiently dazed.   Fact: Suda 51 really loves wrestling.  Certainly, alongside its razor-sharp script, it's this level of assured creativity that truly makes No More Heroes a wholly unique endeavour. Packed full of visual flourishes, in-jokes, sly winks and allusions, it really is complete mayhem on a disc. In fact, so hell-bent on subversion is No More Heroes, we're not even all that comfortable pointing a finger at its apparent technical deficiencies. For every frame-rate hiccup, there's at least one deliberate inclusion of enemies juddering around completely independent of their surroundings  it's so wilfully self-referential, the best thing to do is give yourself up to its charms and ride along on its relentless wave of lunacy.Ultimately, youll probably look at No More Heroess peculiarities as either inherent flaws, justifiably, or accept them as deliberate design decisions. Think Silent Hill 2s purposefully debilidating combat and endless procession of locked doors. Similarly to Konamis horror opus, in fact, the more you invest in exploring No More Heroess minutiae, the more youll get out of its singular mode of story telling  theres barely a lump of on-screen furniture or intentionally duff moment here that doesnt have some relevance to proceedings. True enough, that doesnt always make for the most riveting gameplay experience by design but anyone who lives for creativity  and indeed games that dare experiment with an entire lifetime of clichs and conventions  would be foolish to miss Grasshopper's relentlessly inventive, uniquely entertaining Wii debut.", "date": "Jan 29, 2008"}