{"name": "Legend of Mana", "name_review": "Legend of Mana", "ref": "https://www.ign.com/articles/2000/06/07/legend-of-mana", "text": "Nostalgia can be a tricky thing sometimes.  It can cause you to expect something that isn't arriving, and it can lead you to miss something you didn't expect, which is a pitfall I was afraid I might encounter when playing Legend of Mana, the fourth installment in Square's series of Seiken Densetsu action-RPGs.  The second Seiken Densetsu game arrived in the US as the SNES classic Secret of Mana, a personal all-time favorite, and I would be lying if I said my little fanboyish heart wasn't hoping for something very much like it.  I didn't get it, of course.  Legend of Mana is very much unlike its immediate American predecessor - in fact, it's a very unusual game no matter what you compare it to.  But that's hardly a knock against it.  Though it may prove an acquired taste for many, and even more will probably be entirely discouraged, Legend of Mana grew on me immensely as I worked my way through it.  It's a slow, meandering sort of game, without the strong, unifying central storyline that drove Secret of Mana (and more or less every other RPG out there).  Featuring a large array of small adventures and side-quests, Legend of Mana doesn't pull you through its world so much as it lets you live there for a little while.  Whatever can be said about what you're able to do there, though, it's an undeniably lovely place to visit.  If this is the last hurrah of 2D on the PlayStation, and by extension perhaps one of the very last 2D games, I can't think of many better notes to go out on.  In the beginning (yes, this game leads one to occasional delusions of creative power), you have to build the world yourself.  The realm of Fa'Diel begins as nothing but a barren plain, perhaps with a few bodies of water here and there.  To raise the world into being, you need Artifacts, magical objects that harness the energy of Mana to transform into locales like forests, mountains, cities, and pirate ships (well, actually, there's just the one pirate ship).  Create a land and you can travel through it, finding new items, people, and adventures.  Once you've built your first land is where the questing begins.  Though Legend of Mana doesn't drive you directly into each adventure, you're not liable to spend much time wandering around without something to do.  Quests are everywhere, and while the progression of the game is far from linear, they lead helpfully into each other.  Once you complete a quest, you'll often be given a new Artifact or two, or at least pointed in the direction of a new adventure.  In a couple of cases, quests will connect to each other as part of a larger plotline.  To use a literary analogy, Legend of Mana is more like an anthology of short stories than a single long novel.  Some of the quests are short, requiring only a little wandering around town, while some of them are lengthy, spanning many dungeons.  Some of the stories they tell are deadly serious, and often quite poignant, while others are like one-liners, providing a little comic relief.  Puzzle-solving, character interaction, and combat all take turns playing a role.  There are more than a few simple dungeon crawls, but there are also some surprisingly innovative concepts here and there.  For example, in one city you need to sell lamps to the Dudbears, a clan of stitched-together teddy bears.  First, you have to find someone to give you a brief tutorial in their language, and then you have to remember enough of the fundamentals to navigate your way through the conversation menus.  It's simple, yes, but it's something new.  The Dudbears, incidentally, aren't anywhere near the only unusual characters to make Fa'Diel their home.  Legend of Mana is home to some of the most original character design this side of Silhouette Mirage, featuring Sproutlings, Flowerlings, jewel-hunting Jumi, a race of sentient teapots, a floating stained-glass window, the monstrous earth-sprit Gaeus, and diminuitive magic students in big spiky hats, among a cast of many, many others.  They feel like characters from a fairy tale, but there are none of the cliches that that term might imply.  The majority of the designs are markedly original, and a few are genuine classics - try not to chuckle when the teapots strike up a conversation with you.  If you feel like a break from questing, you can simply wander around the world, meeting people, seeing what there is to see and hearing what there is to hear.  There are also a few unusually deep side activities that you can engage yourself with.  For example, one of the recurring cast members from earlier in the series is Watts the blacksmith, the irascible little dwarf in the horned helmet.  Once you unearth his hammer from the depths of the mines, he'll teach you how to forge your own weapons and equipment; it's a simple system, but it holds a great many different possibilities.  You begin with a particular raw material, a type of rock, metal, or wood, and forge it into a basic item.  Then you can temper it with a wide array of other items, increasing its power or changing its elemental properties.  That's one of the many ways in which the combat system differs from its predecessors - it seems as if some evolutions begin in Seiken Densetsu 3 have moved markedly forward in the latest game.  The percentage meter is gone, letting you attack with full force at any time.  The Crystalis-esque special attacks are drastically modified: special combos are far fewer, and you can trigger them at will if you build up your special meter with a succession of regular attacks.  Those special moves aren't a major part of combat, though.  The most common attacks are manual combos, which you execute by mixing up the quick and strong attack buttons, although basic maneuvers like jumps, lunges, and ripostes also play an important role.  Beyond the facts, then: do I enjoy the new combat system?  To some degree, yes.  I like the greater speed, and though they were dang cool to watch, it's nice not to have to deal with the delay that the old special combos demanded.  Also, magic and items play, respectively, little and no role in battles.  Attack and support spells are rarely necessary, and you don't need healing items at all.  If you survive a fight, your hitpoints are automatically kicked back up to the maximum.  Again, this adds speed at the cost of depth, which is a trade-off I'm not sure I like.  One thing I can unequivocally say: I miss the multiplayer game from Secret of Mana.  Legend only lets you play with two players, and limits your options greatly: since there's only one hero, player 2 has to be an NPC or an imported hero from another saved game.  But the side quests and activities bring depth of their own.  Like the one that grants you the smithy, another quest allows you to create your own musical instruments, which can be put to a couple of different uses.  In battle, you can play them to cast elemental spells, but even more interesting is the system of elemental contact.  Instruments are created by mixing a raw material with an elemental coin, which you gather by making contact with elemental spirits.  To contact the elementals, you have to play them music, an aspect of gameplay where I believe composer Yoko Shimomura has had an influence.  When you want to play a tune, you can pick multiple instruments, assign them to melody and harmony, and select what sort of tune you want to play - and that's exactly what you'll hear.  The instruments each play their appropriate part, and a sad, serene, or contemplative tune fills the air.    The other wild creature you have to deal with are monsters, or rather monster whelps, who wander about encased in eggs like Sheldon from the old U.S. Acres strip.  After luring them home with the appropriate sort of food, you can raise them and train them to fight alongside you.  They start out a little weedy, as low-level Rabites or the like, but a steady diet of dragon steak and demon meat, along with judicious training, eventually develops them into tough little cookies.  The problem with this - yes, there is one - is that I'm not certain whether there's much tangible benefit in pet raising, weapon forging, golem building, and the like.  Fighting through the game on my own, with whatever allies came by, a pet level-five Rabite, a fairly pedestrian complement of arms and armor, and hardly any magic, I stomped the opposition flat, dying only when I didn't even bother with a semblance of strategy against some bosses.  I'm not what you'd call a glutton for punishment - leveling-up and repeating boss fights are aspects of RPG gameplay that I'm happy to see off into the history books - but neither do I like the sensation that a game is going easy on me, and the low level of difficulty hurts the game's replay value in many ways.  None of the dungeons are very deep, and the quests and battles sometimes move a little too fast, especially compared to some of the tortuous boss fights in Secret of Mana.  The many side activities, which might have been an really vital aspect of gameplay, feel a little bit tacked-on; there's no substantial drive to delve into them.  But to pull an example out of a hat, even if there may not be an immediate profit in elemental taming, the music is still beautiful.  That comment could be adapted to apply to many aspects of the game.  Legend of Mana is simply a wonderful game to experience.  The exquisitely shaded sprites and 2D backgrounds possess a kind of beauty that will die with this generation of videogames.  It's sad, but it's true - the last honest 2D system is already long gone, and the PlayStation will join the Saturn soon enough.  Maybe, in a few years, the PlayStation2 or one of its competitors will be able to render something as beautiful as this in 3D, but until then, all we'll have is the forests, mountains, and cities of Fa'Diel, brought to life by sparing animation and lavish, yet carefully applied color.  The soundtrack, though composer Shimomura is a newcomer to game music, is about as good as any that you'll hear today.  Thanks be to Square's newly enlightened localization staff, the opening theme remains wonderfully unchanged, and the background music throughout the game brings intensity to battles, suspense to , and subtle nuance to emotional moments.  Speaking of that localization staff, they have my thanks for doing a superb job with Legend of Mana's English script.  The music is entirely intact, the text is almost typo-free (I counted two errors), and most of all, the characters speak like people, not RPG characters.  There's nothing broad or forced about the dialogue, it's just quietly well-written, with a very laid-back sense of humor.  For example, at one point in the game, you'll encounter a large pink hippo that teleports you somewhere - never mind where.  When the hippo teleports you, he says ~Boink.~  You laughed when you read that, didn't you?  I did, anyway.  I'm not entirely certain why - the word ~Boink~ just sounds funny.  That's how you can tell somebody with a proper grasp of English edited this script.  There's solemnity, eloquence, and the occasional light touch of the absurd.  Comments:  The point?  Legend of Mana, in some ways, is less of a game than a more general aesthetic experience.  While a great many players may grow frustrated by its structure, those who enjoy smelling the roses during an RPG will find much to reward a little patient wandering.  The way the plot and combat system have been organized make this a fair bit less of a complete game than Secret of Mana, and the multiplayer game is sorely missed, but perhaps that was intentional on the part of the developers.  Perhaps they wanted to create something with a little less story focus, to let the game's aesthetic qualities shine through.  Or maybe I'm just making excuses, I don't know.  Maybe the most meaningful comment I can make is that I played through Legend of Mana entirely, and will do so again.  I want to complete the side quests I missed, I want to raise a few more monsters, I want to see how large a band I can assemble, and most of all, I want to spend a little more time seeing the sights of Fa'Diel.  I think you might want to see them as well.  -- David Smith", "date": "Jun 7, 2000"}