{"name": "Counter Force", "name_review": "Counter Force Review", "ref": "https://www.ign.com/articles/2008/01/29/counter-force-review", "text": "Never have we loved a mediocre game as much as we do Counter Force.  As yet another chunk of Wii shovelware, we've passed up Conspiracy Entertainment's latest quick cash-out time and time again, only now sitting down with it for any play time whatsoever.  You'd expect this to be just another piece of software that is in no way worth your cash, and for the most part you'd be right.  There is, however, a deep-rooted sense of nostalgic fun in this one, and while we'd still recommend it for less than 1% of the Wii crowd, that's more than we can say for most quick-cash efforts on the system.   Counter Force is basically a free-cursor take on SEGA's Space Harrier.  Players select one of four flying robots, each with their own power, speed, energy, and weapon readouts, and then take to the skies in classic tunnel-shooter action.  The analog stick moves the robo in space (though there's a weird rubber band mechanic set up in place, so a lack of analog stick will pull the craft to the outskirts of the screen), the A button fires wherever the Wii pointer is aiming, and a smaller fixed reticule in the middle of the screen is moved via your robot's flight, essentially staying in the center 10% of the screen at all times.  She's not much of a looker, but she's got a nice personality.  There's no story for Counter Force, or at least none important enough to know.  What there is, however, are a crapload of generic enemies, gigantic bosses, and a lot of blowing upping (to put it eloquently).  While the extent of your offense is usually revolved around mashing the Z (missiles) and A (semi-automatic fire) together in an attempt to kill everything the instant it spawns, there's also a bit of strategy thrown into the chaos.  Flicking the nunchuk left and right will cause your robo to dodge to the appropriate side, and it's actually pretty accurate at reading left vs. right movement.  On top of that you've also got a kill-all bomb on the 1 button, and a multi-lock system for your missiles on the C button.   With a pretty decent arcade control scheme setup, it's no wonder that Counter Force actually has some entertaining moments.  The game certainly drew a crowd at our desk, if only for the reason that there's giant N64-like enemies and environments cascading all over the place, and random explosions constantly going off as we struggle to stay out of the never-ending assault.  Unfortunately, Counter Force is far from a quality game, as levels and in-game objects are about as low-poly as you can get on Wii, and the mash of effects and explosions, coupled with a short draw distance for levels, makes for an extremely chaotic presentation.  Icons, HUD pieces, and power-ups often cover up oncoming fire, and in the end your strategy will come down to again mashing Z and A as fast as possible, hoping to god you can see oncoming fire in time to flick the nunchuk.   Once you're finished with arcade mode, there's nothing else to do but select another fighter, and boot it up again.  There's no two player, no extra content, and no reason to play Counter Force for more than a half hour or so (unless you really dig the design, in which case this may be the greatest bargain bin title of all time depending on how cheap you can find it).  In the end it's still just a mish-mash of assets and random interface design too, as you'll get badly translated options, a lack of continuity in stage name capitalization or punctuation, and background screens that switch instantly from random Macross-inspired art to a gradient color fill.  It's as if someone gave a really inspired team a $15,000 budget and two weeks, and just said ~go nuts~.  Counter Force is a fun game.  In fact, once were done writing this review, were going to sneak away and play it again.  Mixing the gameplay of Space Harrier with IR control and some we do whatever the hell we want artistic design and execution, Counter Force has the same kind of appeal as niche shooters like Sin & Punishment, if such classics were done by a chop-shop and never really saw the light of day.  Hardcore arcade fans may enjoy the rough, unapologetic look to the game, but when it all boils down to it Counter Force isnt really a title youre going to want to throw real cash at.  If it was on Wii Ware for $5, wed have a hard time not nerding out entirely, as the game lacks any and all graphical prowess or technical polish, but still has the courage to make a totally obscure (and kind of kick ass) shooter experience on Wii.  What it really comes down to, though, is that Counter Force is one of those games you used to see in dying arcades.  Youd walk by, think about dropping a quarter to see what this beaten, abused puppy of a game design actually is, but then walk right on by.  Some of you may stop and drop a quarter on in, but few of you would treat that puppy to a delicious steak dinner.  Dont buy Counter Force a $30 steak dinner.  If anything, wait until you find it in a bargain bin and throw it a $3.99 plate of Chinese food.", "date": "Jan 29, 2008"}