{"name": "Rez", "name_review": "Rez HD Review", "ref": "https://www.ign.com/articles/2008/01/30/rez-hd-review", "text": "Rez is the manifestation of every '80s or '90s pop culture take on the future of videogames, minus the virtual reality headset. Flashy and bright, filled with trance music and designed with the discerning burnt out raver in mind, Rez is what happens when cyberpunk and videogames collide. Though it was first released roughly six years ago for the PS2 and Dreamcast, Rez is just as much a mind trip now as it was back then.   Rez HD is a rail shooter at its core, but the sum of its parts makes it so much more than that. The psychedelic visuals kick off the presentation to let you know right off the bat that this is going to be different from most anything else you've played. Then the music comes in, slowly at first while the controller begins thumping to the tune. As you play you'll begin to notice that your attacks on enemies weave extra layers to the trance music. You're not creating the song per se; you're just rounding it out. That's when Rez hits you. The sounds, visuals and vibrations come together as one to make the gaming experience something special.      As Tal Blevins, VP of Games Content at IGN, put it, ~This is the perfect game for stoners.~ Or as Tetsuya Mizuguchi, creative director for Q Entertainment described it, ~Everything is becoming Rez.~ Take your pick. Both work fine.   Rez HD lands on the Xbox Live Arcade just how you remember it (or don't), only better. The graphics have now been reworked for a widescreen display in high definition. You can still play the original Rez in this release if you want to remember just how jaggy it looked, but we don't recommend it. The improved visuals are sleek, smooth and a joy to zone out to.    There are a few other additions as well. The ever present achievements are there to offer a decent challenge. In a throwback to the trance vibrator peripheral you could purchase for the PS2 to give you more vibration, Rez HD allows you to turn on up to three more Xbox 360 controllers that will each vibrate with the music. You know, in case you need more vibration. There's also a replay save system that allows you to save your best runs or download others' from the online leaderboards. It's a great way to watch and learn, but there is one catch: The vibration features are disabled while watching the replays.    Stylish. There is one major caveat you should take into account before making a purchase and a quick spin on the demo will give you the answers you need to make the decision. Rez HD is not a very long game. There are just five levels in the main game with a few extra modes and stages that can be unlocked by playing well. Perfecting a run through a level is difficult, but beating the game is not. The point of the game is to experience the assault on your senses and work towards perfection and so repetition of a few levels should be expected. At 800 Microsoft Points (US $10) this is a much better deal than it was when released at retail, but the length is still something to keep in mind.   The game lends itself well to perfectionists with a small amount of depth and a lot of patterned enemies. Attacks can't be dodged so it's up to you to dispatch enemy viruses before they attack or shoot down their incoming projectiles before they hit you. Play well enough and collect enough power-ups and you can evolve from a floating sphere up to a hovering Buddha that blasts out laser beams. If that isn't cool than we don't know what is.Rez is a cult classic with good reason. It's fun and different but perhaps a bit too wacky for its own good. The mass market might not ~get~ the experience. Regardless of what side of the fence you sit on, this is a game that is at least worth trying. There's simply nothing else like it on Xbox 360 or Xbox Live Arcade. The improved visuals are indeed pretty and though the new additions may be minimal, the game was pretty darn good without them.", "date": "Jan 30, 2008"}