{"name": "Shadowgrounds Survivor", "name_review": "Shadowgrounds Survivor Review", "ref": "https://www.ign.com/articles/2008/01/30/shadowgrounds-survivor-review", "text": "The follow-up to 2006's Shadowgrounds, Frozenbyte brings back the frantic alien-blasting arcade-style shooting that made the first so entertaining with Shadowgrounds Survivor. For anyone who played the original you'll find quite a bit familiar here as it has basically the same background story and many of the same enemy types as in the first. That being said, you still get a quality top-down arcade shooter that's been improved in many ways, and it serves as a nice break if you've been slogging through some of the more complex releases of 2007's holiday season.   On June 20th 2096 a colony on Ganymede was attacked by hostile aliens who had to be exterminated, and that's basically all you need to know. Over the course of the game's missions you'll flip between three playable characters, all with their own unique weapons and upgrades. The weapon upgrade system is a little more involved in Survivor than in the original, as you're given the option to unlock character abilities, like better bonuses from health packs and activating a personal radar. In addition to a few general traits, each character also gets unique abilities, both for themselves and for their weapons. For me, this made for a more interesting experience, as it added extra layers of gameplay to a title which didn't really need a whole lot to be entertaining in the first place.   Here's how it works. You start the game as Luke Giffords, a soldier capable of wielding pistol, pulse rifle, and rocket launcher, which unlock as you progress through the game. Blasting baddies will yield experience, leveling up Luke and making available new upgrades for himself and his arsenal. Splattered foes also drop upgrade power-ups of weapon and personal types, which can be allocated as you see fit. With Luke you can eventually unlock cluster bombs, better damage resistance, nuclear warheads for the rocket launcher, an instant-kill target lock for the pistol, and radiation bullets for the rifle, among other things. Bruno Lastmann, the second playable character, totes a shotgun, flamethrower, and minigun. These can be upgraded with things like improved loading and accuracy on the shotgun, double damage minigun bullets, and the need to reload flamethrower canisters can be removed. Eventually Isabel Larose is unlocked who brings a railgun, plasma rifle, and pistol into combat. She gets a few useful upgrades like poison bullets for her pistol that do damage over time, a ricocheting shot for her railgun, and the ability to slow time.    As you can see, for a mindless overhead shooter there's a decent amount of depth here. Running around on the ground unloading ammunition at foes is broken up by ~survival~ sections, in which invisible barriers trap you in large rooms, forcing you to fend off waves of vicious insect-like invaders. You also get armored turret and mechanized walker sections which, along with the upgrade system, keep things from getting stale. Foes include everything from puny crawling bugs to hulking armored lizards with arm-mounted cannons. The latter type don't show up until later in the game, and considering every other type don't do all that much damage you can expect to breeze through roughly the first two-thirds of the game if you're not playing on the hardest difficulty setting.   After you've run the campaign gauntlet the game provides a few options for continued play. Six survival sections in the game can be shot through as self-contained stages on which you're scored. Then there's co-operative play, which is done locally, meaning you'll need to have a bunch of extra control inputs lying around. Like any good arcade game, there are also a bunch of extras hidden away within each of the stages. Should you take the time to explore every hole in a fence or darkened facility room you'll find little glowing symbols that unlock bonus features. Once you've beaten the campaign you can go back through with these activated, which can do things like unlock all weapons and give you bonus upgrade points or enable ~super physics~ which makes environmental objects fly all over the place. In terms of control there's not much to learn  you move around with WASD, can lock the camera to your aiming cursor or rotate the screen independently, and otherwise use a small selection of keys and the mouse buttons to obliterate enemies and consume health packs.   While the story and presentation are bland and downright bad in some spots, the action in Survivor manages to shine thanks to fluid controls, fast action, destructible environments, and some flashy lighting effects. Though gameplay should generally stand out as a reason to play a game, the visuals and physics in this one really do add incentive as they've been upgraded from the original. After all, with top-down arcade shooters, what else is there really to be done? There are lots of enemies and lots of ways to shoot them, and that's basically all you need. The destructible boxes that splinter and bounce all over, cartoonish gore effects when enemies are blown to pieces, the shimmering air above flamethrower fuel fires, and an eye-catching flashlight beam that helps show off some impressive lighting effects really add to the game's intensity, creating a more engaging experience.    Then there's the sound, which ranges from excellent to grating. The latter descriptor might be a kind way to describe the voice acting. Horrid might be another, but then again you're not really playing this game for believable characters, you're playing to kill things and, ideally, set things on fire in the process. The music, though, is generally well done. During battle you'll be treated to some textured electronic pieces that do a solid job of complementing the onscreen chaos of exploding bugs, gunfire flashes, and your frantically shifting flashlight beam to immerse you in the fighting. Toss in some serviceable weapon effects and it's a pretty good audio package overall, especially for a budget game.   Though it's hard to dislike Shadowground Survivor, there are a few glitches here and there. The graphics, which we cranked all the way up, chopped up occasionally on our system with an Intel quad core, 8800 GTX 768 MB, and 4 GB of RAM system. Though you don't need to run the game on the highest setting to enjoy its visuals, the performance is still something worth pointing out. There also seemed to be a problem with AI pathing, as enemies would occasionally run into walls and get stuck against obstacles. This wouldn't happen all that often, but enough to be noticeable. It shouldn't deter you from checking this out in any way, because ultimately any enemy is going to wind up a pile of mush anyway.Maybe I've just been playing the wrong kind of games lately, but Frozenbyte's latest caught me off-guard with its mindless yet entertaining action.  It had moments that brought me back to the days of playing Smash TV and Robotron 2084 at bowling alley arcades. Once the nostalgia faded, I was happy to find the game still played great. Shadowgrounds Survivor isn't anywhere close to as difficult as the top-down shooters of yore, but it's an excellent throwback title to a type of gameplay that doesn't require 600 hours of dedication to get to the good part, memorization of unnecessarily complicated technology trees, or the need to page through thousands of lines of dialogue options to get anything accomplished. It's simple, enjoyable, pretty, and perhaps best of all, it's cheap.", "date": "Jan 30, 2008"}