{"name": "Devil May Cry 4", "name_review": "Devil May Cry 4 Review", "ref": "https://www.ign.com/articles/2008/02/04/devil-may-cry-4-review-3", "text": "Devil May Cry fans know what they expect from the action series: they look for fast paced action sequences that require solid timing instead of button mashing. They expect large scale battles with insane bosses and hordes of monsters that barely give the player a second to breath. They also expect characters to take the dangerous settings lightly, with a large dose of sarcasm and a snarky outlook towards the supernatural surroundings they find themselves in. Well, DMC fans, take heart: Devil May Cry 4, the latest chapter in the series and the first true sequel in the Devil May Cry chronology maintains all of these trademarks while showcasing the power of the 360 fairly well.   That is, for the most part.   See, Dante fans may find themselves a bit disappointed in their favorite character's new role within the series: instead of taking over the spotlight as he has in the previous three games, the anti-hero takes on a secondary position to franchise newcomer Nero. DMC4 is really more of his story and his coming of age within the Sparda-influenced universe than a tale that picks up after the events of DMC1. Is this a bad turn of events? No, not really, although some of the hardcore might wonder if the game could've had a different title with a Dante cameo instead of a Devil May Cry chapter.    The story of Devil May Cry 4 is set in and around the coastal town of Fortuna, which has an interesting tale by itself: it's governed by a militant theocracy known as The Order of the Sword, and protected by a group of Holy Knights. The people of the town worship the demon knight Sparda as a god and savior. During a ceremony in honor of their deity, Nero, a young knight, sees Dante crash through a window and slaughter the leader of the Order, as well as many of his friends. While he doesn't know who Dante is or why he's attacking them, Nero wants revenge for Dante's actions. What follows over the course of 20 missions is a quest of revenge and betrayal, as well as salvation and sacrifice, as Nero hunts Dante down across the land.   Apathetic and dismissive of authority, Nero is a younger, more angst-filled character than Dante's older, wiser and more sarcastic outlook on the world. However, he's just as skilled as the Son of Sparda, with a wide range of abilities to support him in combat. The first, and perhaps most obvious element, is the Devil Bringer, his demonically-enhanced right arm that allows him to project an energy arm ahead of him. This allows Nero to grasp distant objects, which he'll use to reach new areas or scale heights, as well as grab, throw and punch opponents. While this can be used to start or extend obvious combos, perhaps one of the most intriguing elements is that the arm responds differently when used against each opponent in the game. For example, players will grip and throw some creatures by their tails, while others may be pulled apart or even used as weapons against their allies. This can be factored into players' plans when using Nero's primary attacks in battle.   Showdown at the Fortuna Corral. Nero has access to both projectile and melee strikes thanks to his unique weaponry, the Blue Rose and the Red Queen. The Blue Rose is a double-barreled pistol that allows Nero to fire powerful blasts at distant opponents. While slow to fire, the power of these blasts is quite strong, and can eventually be charged-up to provide even more punch. His more devastating attacks come in the form of the Red Queen, a motorcycle throttled, gas-infused sword that can be revved-up to add additional strength behind each combo or blow inflicted on an enemy. This boosting of the sword is known as the Exceed system, and allows Nero to charge the sword up three times, turning the blade red hot with energy and lashing out with fiery blows.    The Exceed system is one that can take a little getting used to. Continually pulling the trigger to rev the sword doesn't work nearly as well as slow, consistent pulls, which boosts the gears of the blade more. It also drops Nero to a slow walk as he reaches behind him and revs the motor of the Red Queen, which can be tricky to pull off consistently in the midst of battle, particularly because it leaves you open to attacks. While you can work on your timing after an attack to instantly charge up the blade, you won't always nail it, so the difficulty of this move is rather high. However, there's another, more pressing issue with the Exceed system, which is that you don't need to use it at all to quickly and efficiently eliminate the monsters within the game. Thanks to the strength and power of Nero's various combat skills and combos, you're better off eliminating your opponents with standard attacks than spending the time to charge up your blade.     What's more, Nero will eventually gain access to a Devil Trigger, which allows him to project the demonic entity that inhabits his arm behind him. Not only will you regenerate lost health, you'll significantly strengthen sword strikes and gunshots. While the duration of the devil trigger is limited by the amount of magic power that you have available, the attacks that you can make are much stronger than anything that the Exceed system can provide, which makes the optional battle tactic somewhat useless by comparison. This is exacerbated when you realize that you can purchase additional magic power and decrease the speed of the magic drain by purchasing enhancements.   Just like other DMC titles, you'll be evaluated at the end of every single mission on how quickly you complete the stage, the number of red orbs that you collect, and how stylishly you eliminated demons in the game. Style, of course, is the most important of the three, since you'll continually be evaluated in battle on the variety of your attacks. This ranges from D (for Deadly) to SSS (for Smokin' Sick Style), and are only mildly degraded if you rely upon the same strike or are hit in the course of battle. These three classifications provide you with a final grade for that mission, which translates into proud souls. These can be redeemed for new abilities and skills, just as red orbs can be redeemed for new items at Divinity Statues.   So what if I look emo? There are two cool aspects to this system. The first is that while you can quit a mission at any time, you'll still receive a certain amount of orbs and proud souls for your progress. Like previous DMC titles, orb farming is a key facet of the game, and you'll wind up constantly trying to amass as much as possible to help you along your way. This could be either through playing secret missions, or playing a stage over and over to just collect what you can. The second feature is that you can always return any skill or ability that you don't use, receiving a return on your investment towards something that you will want to use. Obviously, this encourages a significant amount of replay of missions and levels to collect as many abilities and items as possible, especially to make the game easier to fight through with either Nero or Dante.   Yep, Dante eventually does make an appearance within the title as much more than a plot device. He does take over as a playable character, and brings with him some of his considerable talents from DMC3. Dante wouldn't be caught dead without Rebellion, his large sword, and Ebony and Ivory, his twin pistols. Ebony and Ivory are much faster than Nero's Blue Rose, and lets you blast away with quick bursts of gunfire at enemies, and they allow you to charge up their blasts for stronger shots. For harder shots, Dante can use Coyote, his sawed-off shotgun to knock monsters down. However, while these weapons are particularly strong in battle, it's their use within Dante's weapon styles that helps define his combos and his battle abilities.   This just ain't your fight, Dante. Dante retains his four styles from DMC3: Trickster, Royal Guard, Sword Master and Gun Slinger. Unlike the previous title, you can choose to switch between styles on the fly instead of having to select one at the start of a mission. For example, you can start one combo in Sword Master, switch to Trickster and evade an attack, and finish off a monster with Gun Slinger. This allows you to string together some stylish attacks, particularly if you get the timing down on each style's moves. Dante also has access to his Devil Trigger as well, so you can quickly eliminate monsters or bosses with a concentrated use of this spiritual energy.   However, there are a couple of downsides that you'll find when it comes to Dante. The first is that he doesn't have nearly the same kind of focus that he's had in previous games. His play time isn't nearly as long as that of Nero's - it's more like 30% compared to Nero's 70%, which is somewhat disappointing. (Before you ask, no, you can't take him through Nero's sections of the game.) This disappointment extends to other characters, like Lady and Trish, who feel like more of an afterthought than an addition to the game itself. What's more, the change almost feels abrupt; you'll be relatively used to playing as Nero after a while, and suddenly find yourself switching over to Dante, which will force you to readjust your tactics and moves. It doesn't hamper or wreck the gameplay by any means (and I'm not saying that one of the characters is better than the other; I'm sure players will quickly establish their own favorites), but it is a significantly noticeable change in the way that you approach battle.    Related to this diminished role is that Dante simply doesn't have nearly as many weapons as he did in DMC3. Instead of managing to acquire five guns and five Devil Arms, you'll only have the opportunity to acquire three different weapons within the game. They do have an impressive amount of strength, and fit in quite nicely within the tone of the series. Whether it's the striking power of Gilgamesh, the explosive blasts of Lucifer or the over the top nature of Pandora, the three weapons can all be powered-up and used by Dante's various styles to help him through the various battles. However, if you've fought your way through the fierce difficulty of DMC3, you may feel shortchanged in the equipment department.   What's more, the amount of backtracking and repetition makes the game feel somewhat half-heartedly finished in the design department. Don't get me wrong - I know that there's a certain amount of backtracking that you are going to do within a DMC title; it's almost inherent to the series. But the way in which it's handled in DMC4 is practically a travesty. Without revealing any plot details, I'll just say this: instead of taking Dante and his part of the adventure through new areas, or even forging radically different paths, you'll find yourself trekking back through extremely familiar territory with minimal changes made. This is pretty sad, especially when combined with this reduced role for Dante in the game. It merely serves to highlight the larger role that Nero plays in the game. Then again, Nero doesn't escape repetition that drags out gameplay meaninglessly, either. Believe me: you'll know it when you see it, but you'll gain a new hatred for board games.   Do I make you randy? Repetitive level design aside, you will want to stick your way through these elements, partially because you'll unlock harder difficulty levels. Initially, the game starts with two levels available: Human and Devil Hunter. It could be me, but after surviving titles like DMC3 and Ninja Gaiden, playing through these two levels weren't particularly difficult at all. However, DMC4 has multiple difficulty levels, six in all, which are only fully unlocked after you complete the game five times. One of the cool parts about these additional difficulty levels is that the game does vary up the gameplay in stages as you climb up in difficulty. The position of monsters or other demons will change, puzzles will get harder and enemies will get access to different weapons or abilities, which help to keep the game fresh.   Personally, I found four of the levels to be a piece of cake, but Dante Must Die mode is much harder in this game than it ever was in DMC3, and will probably result in numerous controllers being shattered in frustration. Seriously, this mode will kick you when you're down and laugh at you mercilessly. The fact that there is another level beyond it that is much harder just mystifies me, and it will take incredible skill and possibly superhuman reflexes to beat it.   Beautiful?  Yes.  Demon infested?  Absolutely. Regardless of the level you wind up playing the game on, you and your progress will be recorded on the game's leaderboards, which will rank every mission that you've played and the rating you receive. Not only can you check to see how you did across the various difficulty ratings, but you can also check to see how your score stacks up against the world's best as well as against those of your friends. Apart from these bragging rights, successive playthroughs will unlock the Story Theater, which will allow you to watch any cutscene within the game individually or together in one continuous movie, a gallery with bonus art and character info, and a game library that provides information on every element of the game. Players will also unlock the Bloody Palace, a survival mode where stylish hits add time to a steadily-decreasing clock, giving you another option to farm orbs and souls.    Like most multi-console games, any review would inevitably have to come down to which system is better, and for this instance, the PS3 winds up winning out just slightly. It's not in the gameplay department, because DMC4 plays the same regardless of which system that you play on. Nor is it in the visual department, because visual issues are virtually negligible. For example, the 360 has some harder edges to some characters during cutscenes, and a little more screen tearing than the PS3 at times. The PS3 can be a wee bit darker during some scenes, though. Both systems show off a certain amount of render passing that pops into focus on sweeping vista shots, but they occur at the same time on each system and are quickly dismissed. However, observing these differences will only come via frame-by-frame analysis of each game side-by-side. Even then, you're still receiving an incredible visual experience.   No, the edge comes in the fact that the PS3 installs a large amount of game files to the hard drive, dramatically reducing load times between stages and cinematics. I've timed the game on both systems numerous times, and each time has been consistently in the PS3's favor. Transitions to gameplay from starting menus are relatively close, frequently within half a second or so of each other, but when you're loading up a cutscene or having another pause in the action, the 360's times are easily three times that of the PS3.   These weeds are deadly. However, even with the load time discrepancy, the presentation of the game is phenomenal, from the incredible character models to the beautiful environments that you'll fight your way through. This is visually arresting work, and Capcom is to be applauded for its efforts. I know that every time I've had the game on in the office, people have stopped and remarked on how amazing the title looks, and it's definitely a showcase for what each system can do. Very little needs to be said about how striking it is -- simply look at the dozens of pictures or watch one of our many videos on the game and you'll see how outstanding the graphics are.    The lone downside comes with the camera angles, which can be somewhat iffy. Sure, you can readjust the camera with the right analog stick, but part of the problem is that there are some places where the game will initially frame the action poorly. For example, you can be running along a path and find that because the camera angle has changed, you suddenly are running in the opposite direction. Another reason why this is bad is that some monsters phase their way through walls or floors, or are hidden by environmental objects for a few seconds, making it harder to see who you're attacking.    Gimme Five! Apart from the visual presentation, you'll find that the sound is, for the most part, top notch. There are a few lines that are delivered somewhat weakly, but overall, the dialogue is excellently done. Dante and Nero manage to strike the right tone of gravity and sarcasm, and the other characters are performed well. The music features the classic electrometal sound that the series has become known for, which is strikingly contrasted with choral arrangements upon menu screens and certain poignant moments.Though the focus might be more on Nero than Dante, and could've been named something else with a Dante cameo, DMC4 still has everything that fans expect of the game  over the top fight sequences, tons of replayability and an experience with an excellent production value. Whether it's on the PS3 or the 360, action fans are going to get one incredible experience with this game, and if you own either system, you'll have a great time.", "date": "Feb 4, 2008"}