{"name": "Devil May Cry 4", "name_review": "Devil May Cry 4 UK Review", "ref": "https://www.ign.com/articles/2008/02/05/devil-may-cry-4-uk-review", "text": "If you want to see how far videogame hardware has come in the past six years or so, try running Devil May Cry 4 alongside the PS2 original. When it came out, back in 2001, the original Devil May Cry was one of the best looking games on the console. Now, in 2008, Devil May Cry 4 is one of the best looking games on both Xbox 360 and PlayStation 3. It's got all the cutting-edge, high definition graphics you'd expect, of course, but just as important is its gratuitous, ridiculous sense of style, full of monocled mad scientists, underground labs, Mephistophelian rivals, bulge-veined creatures, deceptively lesbian snow demons, and assorted femmes fatales.   In this, rather over-the-top, approach Devil May Cry hasn't changed a bit. Another thing that hasn't changed is the underlying design formula. In all its fundamentals, the game is the same as previous Devil May Cry titles: wade through relentless legions of underworld denizens, taking care to dispatch them with SSS-ranking aplomb, and solve puzzles to open up new areas and items. This is no revolutionary reworking, along the lines of Resident Evil 4.   New character Nero may look like Dante, but in combat he functions very differently.  Rather, it's another refinement of Capcom's signature blend of action and exploration  a blend that the company has been evolving across its big-name franchises, Resident Evil, Onimusha, and Devil May Cry. Capcom's DNA is evident throughout the game: in the way the world gradually reveals and discloses its secrets; in the gothic (and sometimes baroque) splendour of its environments; in the grace and poise of its characters; in the jarring segue from moody organ music to high-octane metal that accompanies the game's almost improbable brand of balls-out action.   Indeed, of those three series, Devil May Cry has always offered the most hardcore action, and Devil May Cry 4 is no different: it's a game that's aching for you to smash things up, whether that's the scenery, or one of the inspired selection of evil demons. It's a game that's full of inventive moments, from a snakes and ladders-style dice game, to the various skills that you acquire throughout the game, such as bouncing off special platforms, or entering bullet-time to avoid whirring blades and whizzing lasers. As usual, some of the game's finest moments arrive with the game's bosses, which are universally well designed (Capcom evidently liked them all so much they threw them in again at the end of the game as part of a climactic boss rush  which might not appeal to everyone, but provides some seriously sustained intensity).    DMC4 is full of dramatic set-pieces and inventive moments.  Equally well designed are the characters. Although there's a new lead character, it won't be spoiling anything for anyone who reads the manual to reveal that you also get to play as Dante at certain points during the game. The two certainly look similar, but Nero doesn't share Dante's laugh-in-the-face-of-danger insouciance, or devil may care attitude. They also each have a very different feel in terms of gameplay: Nero's missions are more exploratory, with a greater emphasis on puzzle-solving; Dante's are mostly all about speed, with several having a time limit of some sort.   You can see it in the rewards they each receive after beating the game's many bosses: Nero receives some new key, or item to unlock new areas; Dante receives some new weapon with which to deal ever more inventive violence. They also handle very differently in combat. Dante's strengths stem from his wide arsenal of weapons (including the utterly insane, transforming, Pandora's Box), giving him a wide range of speedy and direct styles. Nero's strengths are to be found in his demon arm, which he can use to reach enemies from afar, and the new Exceed system.     This new system complements, rather than replaces, the Devil Trigger system, so both Dante and Nero are still free to transform into a super-powerful death-dealing dervish. But while Dante retains the ability to switch styles that he acquired in Devil May Cry 3, Nero is able to charge up a special gauge (by hitting the left trigger in time with each of his attacks) that can be used to unleash more powerful attacks and combos. Neither system is totally essential at the game's lower difficulty levels, but they're neat enough additions.   Dantes strengths lie in his ever-expanding arsenal, including the Lucifer weapon.  And talking of difficulty, much has been said about the extreme difficulty of the Devil May Cry series. In fact, one of this game's strengths is that the difficulty curve is as forgiving - or unforgiving - as you want to make it: plunge straight into Devil Hunter difficulty and it'll offer a relatively severe starting point from which to gravitate to the more extreme difficulties.   Start off by admitting that you're only human and you can take a relatively easy stroll through the game's 20 chapters. So by the time you've graduated to Devil Hunter you'll have amassed an inventory of recovery items, unlocked a wider range of combos, acquired a larger life bar, and, of course, you'll have gained more experience. The result is a gentler introduction to the upper reaches of the game's difficulty levels. You can even opt to switch on 'automatic' mode, to make timing combos easier  although unlocking all of the game's achievements will still be a fairly monumental task.   Secret missions reward you with health upgrades - great for tackling tougher bosses.  Much has also been said about the backtracking in the game too. It's true that when you reach the game's halfway point, you'll find yourself forced to travel back through many of the areas that you've just waded through to get there. But then, it's difficult to think of one of Capcom's action adventure games that doesn't have any backtracking in it. And since half of the joy of Devil May Cry 4 comes from getting tooled up and playing it through again, it seems absurd to criticise it for a bit of backtracking. Indeed, the game is built around replay value, whether it's working your way progressively through the different difficulty levels, or simply tooling up and working on those SSS ranks.In doing so, you'll discover that Devil May Cry 4 is a game that actually does deliver a genuine, honest-to-goodness, chest-fluttering surge of adrenaline. In that respect it's the ultimate action game, blessed with its own inimitably strange sense of style. It's polished and slick, it's got gargantuan-sized gods, near-musical interludes, and infernal, flaming bosses. It's nothing short of brilliant. It might rub some people up the wrong way, with its insistence on repeated playthroughs and recycled locations, and its rock hard list of achievements. But for anyone who buys into Capcom's unique brand of action adventure, it's as good as anything else that the Xbox 360 has to offer  up there with the likes of Gears of War and Oblivion and all the others.", "date": "Feb 5, 2008"}