{"name": "Godzilla: Unleashed", "name_review": "Godzilla: Unleashed Review", "ref": "https://www.ign.com/articles/2008/02/05/godzilla-unleashed-review", "text": "Why is it so hard to make games involving giant monsters fighting in recognizable urban landscapes fun? Going all the way back to the NES, Godzilla games are rarely more than a cheap, mediocre cash-in on the Toho license. Kaiju fans will likely get more enjoyment out of watching Godzilla vs. Monster Zero for the millionth time than giving the giant lizard's latest game a play.   Godzilla: Unleashed is another four-player brawler starring the radioactive lizard and all his giant monster buddies. The roster includes a good chunk of the kaiju creatures fans know from the movies as well as two new abnormalities called Obsidius and Krystalak. Each beast shares the same control scheme but has its own special attacks and throws.  There are several real-world locations such as San Francisco, London, and Seattle just waiting to be leveled by you and your otaku friends.   This is not a nuanced fighting game requiring timing, reflexes, or strategy. This is a button masher  or, rather, a Wiimote waver.  The A button handles your punches while B controls your kicks, and you wave the controller in different directions to get different attacks.  The process is not fun.  It's also not responsive.  There is a good deal of lag between when you swing the Wiimote and when your monster attacks.  When launching a ranged attack the right stick can be used to aim but it proves rather difficult to hit your intended target.  All too often you'll throw your opponent to the ground and ready your fire breath, only to end up shooting it in the opposite direction.   As with many Wii games, camera control has been sacrificed due to the lack of dual analog sticks.  This becomes problematic when you have multiple enemies to deal with and the game can't figure out which one you'd like to focus on.  There are also weird camera issues with some of the monster intro animations at the beginning of each level.  Sometimes the camera will zoom-in too close on the bigger monsters, giving us a not-too-cinematic shot of their chest.    All too often you'll find your foe lying in front of you, and for some reason you'll fire your radioactive breath into the sky. The single-player mode is extremely repetitive. Each level plays out the same way -- whichever monster you're playing as will perform the same beginning animation, then you beat up one or two bad guys. The story mode is over very quickly, which may or may not be a bad thing in this case.  The environments to be battled in are only ~interactive~ in the loosest sense of the word. Buildings will be knocked down, and smaller ones can be picked up and thrown, but that's it. I would like to have seen the arenas play a larger part in gameplay: trick your opponent into stumbling over a low building, push taller skyscrapers over onto the enemy, pick up telephone poles to use as clubs The best games indulge your imagination, rather than leave you wishing you could do more.   An inane storyline unfolds over cut scenes that consist of still artwork matching most cartoons these days -- meaning it is generic and bland. Voice acting is awful, although that might be appropriate for a Godzilla game. These cut scenes also drone on for way too long.  And as the icing on its phoned-in cake, the developer has even employed the use of clichd stereotypes in its storytelling.  When you travel to London, the voice-over actor will exclaim ~bloody hell!,~ and the Australian newscaster of course yells ~crikey!~   Unleashed is not very easy on the eyes. Cities vaguely match their real-world counterparts, but lack detail. Buildings don't crumble -- they sink into the ground leaving no rubble. Structures fade away as monsters move through them.  As Godzilla, who weighs somewhere between 20,000 and 60,000 tons (look it up), makes his way through water he makes a tiny little splash. When the beasts fall clouds of dust erupt regardless of whether they are on land or water.  The whole game is lacking the little details that sell you on the environment.  There are even text glitches.  For instance, when you unlock a new monster faction a notification will pop up over the usual level completion text, causing a word jumble that is difficult to read.   Kaiju fans will be glad to hear the authentic roars for each monster have been included. However, the recognizable Godzilla march is noticeably absent. In its place is some of the cheesiest videogame metal this side of Eye of Judgment.   I gathered up a few IGN editors to try out the four-way multiplayer battles, and after just a few rounds nobody wanted to play anymore. It's nice that there are a lot of options for customizing your melees, but there's not enough gameplay variety to keep most gamers' attention past a few minutes. Once you've seen each monster's special moves the game holds no other secrets to be discovered. Godzilla fans deserve better than this. Unleashed isn't pretty, isn't compelling, and isn't nearly as fun as stepping into the skin of giant monsters should be. Everything about this game is phoned in.  This being the third Godzilla game Pipeworks has worked on, you'd think the studio would know what it's doing by now.  The Toho monsters have a long, rich history that should make excellent fodder for games.  It's a shame the license keeps being wasted with repetitive gameplay, shoddy camera and controls, and graphics not even the most diehard kaiju fan should forgive.", "date": "Feb 5, 2008"}