{"name": "Dancing With The Stars", "name_review": "Dancing With The Stars Review", "ref": "https://www.ign.com/articles/2008/02/06/dancing-with-the-stars-review", "text": "With Wiis installed in the living rooms of grandmothers, aunts and other casual gamers across the nation, it makes sense that the trends sweeping primetime television would bleed over into the world of the non-Xbox Live sect of gaming.   Such is the case with Dancing With The Stars.   A popular reality show that teams a C-list celebrity with some dancer you've never heard of and has them compete for the glory of a created trophy, coverage on Entertainment Tonight and another taste of the limelight, Dancing With The Stars is now available for the granny-grabbing Wii and the hardware-comparable PlayStation 2 with the goal of making you feel like you're on the hit TV show.     How does it do that? Well to begin with, the game packs nine couples from the show's past -- Brian Fortuna/Monique Coleman; Emmitt Smith/Cheryl Burke; Joey McIntyre/Ashly DelGrosso; Joey Lawrence/Edyta Sliwinska; Mario Lopez/Karina Smirnoff; Louis van Amstel/Lisa Rinna; Jesse DeSoto/Shanna Moakler; Maksim Chmerkovskiy/Laila Ali; and Tony Dovolani/Stacy Keibler -- can challenges you to take them through routines ranging from the cha-cha to the foxtrot to the waltz.   There are two ways to control the action on the PlayStation 2. See, silhouette feet are placed in the center of the lower portion of the screen and as the duos cut a rug in the background, colored feet/arrows come in from the right and left sides of the screen. Your challenge is to hit those moves as they enter the empty silhouettes by either tapping the buttons on your PlayStation 2 controller -- the d-pad works for the directions on the left and the face buttons work for the directions on the right -- or using a dance mat and tapping your feet in rhythm.   If you really are a Dancing With The Stars fan who is looking to get into this game, I'll break down the dance mat in a bit more detail. If you're a gamer just checking out this review, feel free to skip ahead because this is just an explanation of how Dance Dance Revolution works. Anyway, if you're going to use the mat you'll need to buy the version of Dancing With The Stars that comes with a dance pad packed in or borrow a DDR mat from a friend. These plastic pads connect to the PS2 and lay on the floor while you stand in the center of them. From there, you start the game and use your feet to tap the corresponding arrow as it crops up on screen.    Jazz hands. Get it? You're moving your feet as if you're dancing.   Of course, it's not as simple as tapping arrows as they come. Dancing With The Stars tosses its variations on the motif such as having to hold steps (keep pressure on the arrow as long as the move is stretched out), Flair Steps (sparkly portions that are worth bonus points), and Combo Multipliers (get enough steps right in a row and the game multiplies your score by two, three or four).   Okay. You've got the basics. You'll take that operational knowledge into the game's four modes. Practice allows you to try out parts of or full versions of the game's 36 songs -- stuff such as Tom Jones and Destiny Child covers -- and see where you're supposed to be stepping on the mat, quickplay lets you jump right into the competition of your choice, multiplayer allows you to dance with or against a friend for the best score, and Single Player challenges you to take each couple through four routines in a quest for the coveted Dancing With The Stars cup.    If you're a fan of the show, Single Player is where you'll probably spend the most time.   You'll start the mode with two couples unlocked and need to play through each of their four songs to unlock the next couple. After you complete a routine, Carrie Ann, Len and Bruno will tell you what you did right and wrong before giving you a numerical score. If you do poorly, you'll repeat the routine. If you do well enough, you'll move on to the next number. Complete all four and you get the trophy and the next couple. Once you complete a couple's career on the amateur difficulty, you can go back for the professional challenge.   And that's pretty much where the music dies for Dancing With The Stars.    For a game that's trying to make you feel like you're the one leaving it all on the dance floor and dealing with Bruno's jabs, you'll quickly find yourself quarantined from the action thanks to the use of full-motion videos for the dancing on screen. Sure, these videos of people who barely look like the stars -- apparently, Activision bought the right to use the names and photos of the dancers but not their models -- dance nicely around the stage, but because they're movies, they never react to your flubs. That means you could miss every step the game throws at you and your mamboin' duo would never react.     The developers flipped to use the likenesses of the real judges, but the non-blinking animations and herky-jerky movements make the panel seem like robots from the Hall of Presidents. While you wait for the scores to be announced, the game will show the panel sitting there in silence, smiling and staring straight ahead with their dead eyes.    That doesn't make me feel like I'm on the show.   The news doesn't get much better from there. Thirty-six songs is a weak showing -- especially considering the 60 or so tracks you'd get with a DDR game -- and the gameplay modes don't offer much of an incentive to keep on trucking. I mean, it'd be awesome to play as former WWE Diva Stacy Keibler, but once you've rumba'd and samba'd through 32 songs, I doubt her final four are going to blow anyone's mind.Dancing With The Stars isn't a bad game, but its limited modes, linear career and weak visuals make the whole game feel like it should be retailing for less than a full-fledged game. It isn't. If you're aching to dance your heart out on a videogame system, the Dance Dance Revolution titles offer more modes, challenges and songs than this title ever could -- there just aren't terrible representations of Emmitt Smith and Joey Lawrence, but that's a good thing.", "date": "Feb 6, 2008"}