{"name": "Mario Golf", "name_review": "Mario Golf", "ref": "https://www.ign.com/articles/1999/07/29/mario-golf-4", "text": "Camelot developed the extremely addictive Hot Shots Golf for the PlayStation and it proved to be a solid sports title despite its overtly cute and child-oriented presentation. That same group of developers put their codes to work to bring us Mario Golf for the N64 and the results are the same. Nintendo is aiming Mario Golf at both the 8-14 -year old group and the 19+ group. How is one game supposed to satisfy the short attention span of grade schoolers and the finicky attitude of college age gamers? Read on and you'll find out how Mario Golf is a great combination of wacky fun and superb golf simulation.  The Features:   18 playable characters from the Mario universe, with some hidden.  A user-friendly play system, suitable for beginners but deep enough for golf fans. Cartooney, polygonal 3D graphics with lush greens and realistic courses. Dynamic camera angles. Features a unique new play mode, called Ring Shot. 64GB Pak compatible so you can download characters from your Game Boy Color to Mario Golf. 6 championship courses with different challenges and obstacles.   Gameplay: The variety of modes is how Mario Golf is going to please everybody. For the youngsters, or anyone else that wouldn't know a divot from a lob wedge, the tutorial is very deep and comprehensive. By the time you finish reading and practicing how to drive, pitch and putt with the greatest of ease you will be able to play this game. Not only that, but you may be able to take some of your fresh knowledge out on the links. Learning how to strike a ball in just the right way with your sand wedge so you can get some backspin will be valuable both in MG and when you hit the local municipal course.  The reason the tutorial mode is so helpful and in depth is because the game's engine is so complete and exhaustive. To be successful, you'll have to learn proper club selection, how to judge win direction and velocity and, just like the PGA Tour pros, you'll have to develop a swing ritual that's as sure and automatic as riding a bike. When it's the ball won't fly as far and will hardly roll at all when it does land because of the soppy grass and mud. Each selectable character has his, her or its own swing style with hooks, slices, fades and different power ratings. Every player has a limited number of 'power shots' that will allow you to let 'er rip every once in awhile so you can get back in a match. When it comes to the intricacies that make golf the most loved and frustrating game on the planet, Mario Golf has it all.  We'll say from experience that putting will be the toughest part of Mario Golf. It's not going to be enough to nail a perfect 250 yard tee shot and a beautiful 85 yard chip to set up your birdie attempt. Not only will you  miss the birdie but you can easily put up an 8 if you haven't figured out the nuances of putting. Judging the roll of the green and the strength of the shot is a science Mario Golf has really mastered.  We put up enough ~snowmen~ in one player games to finally give in and practice putting for an hour in the tutorial. And it was worth it.   Just like in real life, overcoming the intimidating obstacles and forces the course has aligned against you is one challenge, while going up against an opponent, human or computer controlled, is a whole different set of hurdles to be dealt with. Of all the game modes, MG's five multiplayer modes offer some of the best golfing fun. Skins Match, Miniature Golf, Club Slots, Stroke and Match Play will all have you and some friends sweating out the details since bragging rights will certainly be on the line. Stroke Play is your standard tournament style play that you're used to seeing on television. Match Play has players competing to win the most individual holes in a best-out-of-18 format. The Club Slots is something nice thrown in for the advanced players where you select clubs for a hole in ~roulette~ fashion and you have to do what you can with the clubs that you're given. This is one of those feature put into the game for those 19-and-overs we mentioned earlier.  The courses get progressively more difficult and will require players to learn and master skills as they move from the relatively easy Toad Tournament played in Toad Forest to the Mario Open played on the Mario Star course. Of course to use the advanced courses in some of the other multiplayer modes, you'll have to unlock them the hard way in single player matches. Gamers taking on Mario Golf by themselves will find plenty to challenge them in the Tournament, Get Character, Ring Shot, Speed Golf, Miniature Golf, Stroke Play and Training Modes.  Get Character Mode is a no-nonsense direct way to unlock the majority of the 18 players in the game since you only start with five in the one player mode. The picking are slim at first with Luigi serving as the marquee character. The early characters, which includes Baby Mario, are easier t use with their short maximum driving distances and relatively straight shots. As you unlock more advanced players, you'll see that they can hit the ball farther but they tend to hook and slice their shots at severe angles in exchange. Soon you'll be crushing 300 yard drives with Donkey Kong but that won't do you much good on short, complicated courses that you'll see later on in the game, will it? But that's the nature of the game in real life. How many times has Tiger Woods played on a course that's ~taken the driver out of his hands.~  Graphics: The game is cloaked in typical Mario style cuteness and honestly it's this syrupy wholesomeness (the sounds fit right in with it) that ends up being the worst part about this game. There are no problems with frame rate or animation since Nintendo is going to make sure Camelot tightens up all of the mechanics on such a strong flagship title. The familiar mushroom and turtle shapes from the legions of Mario universe games are all there and it can either be a nice nostalgia kick to see a great big mountain with eyes watching you play golf or a total turnoff.  There's a little lens flare here and there and the fluttering flag on the game screen that tells you how hard the wind is blowing is very well done. The Exciting Camera (versus the Simple one) is  a great feature that shows the flight of the ball from a variety of angles. Once a players has chosen the direction and power of the swing, the exciting camera chooses a variety of angles to show the player swinging, the ball on it's ascent and it's landing. There's transitions from shot to shot and there seems to be dozens of camera angles available to show the action.  Sound: The sound is appropriately Mario-esque with lots of characters making silly noises and bleeps and whatnot. The human characters say recognizable things in English thank goodness and really add to the experience. Mario Golf has a great taunting feature with each character assigned four specific phrases or sounds that you can blurt out. They can be effective weapons in multiplayer games when you suddenly have the characters yelling ~great shot!~ or ~Wow!~ just as your opponents start their swing sequence. For a nice twist of sarcasm you can even tell some one they hit a great shot as their ball rolls into the water or gets lost in the forest. Excellent.  The music is generic and will remind you of an extra long ride in an elevator or wasting away in the waiting room at the doctor's office. It is highly recommended to turn it down so that you can keep your sanity. There's nothing more likely to make you snap than nervously trying to line up an impossible putt that'll force a playoff than to hear some sappy music tooting along as if everything was fine. Silence is definitely a part of golf.  While I initially resisted Mario Golf because of its extremely cute presentation, I couldn't put it down once I picked it up. You would think that such a kiddie looking game would be a snap to play, dominate and finish. It was a lesson in  humility once I saw that MG had some golfing challenges that would get under the skin of the coolest, most collected gamers. I still have a problem with the way the game looks, but there's really nothing that can be done about that as long as it's going to be a game based in universe of Nintendo's mascot character. The dichotomy of the game's look versus the way it plays may not matter this deep in to the N64's run since we were able to get over it with games like Mario Kart. Mario Golf is fun, plain and simple. It's better than Waialea Country Club hands down, offering a much richer game of golf. While I eventually learned to tune out the cartoon-style characters and focus on the tougher parts of the game, it may be tough to reel-in those 19 year-olds like Nintendo wanted because it just doesn't look like a game they'd enjoy. That's too bad because there's plenty of fun underneath all of those layers. There are better sports games out there to be sure, but right now, Mario Golf should be the golfing game of choice.", "date": "Jul 29, 1999"}