{"name": "Karaoke Revolution Presents American Idol Encore", "name_review": "Karaoke Revolution Presents American Idol Encore Review", "ref": "https://www.ign.com/articles/2008/02/08/karaoke-revolution-presents-american-idol-encore-review-2", "text": "With many cross-platform titles, the Wii ends up getting a carbon copy of another SKU. Like it or not, Nintendo fans. Now, that's not necessarily a bad thing; if a title excels on one platform, copying it to the Wii is an easy way to get your product to as many people as possible. But it turns out to be a bad decision with Karaoke Revolution Presents American Idol Encore.   Along with releasing on the PlayStation 2 and the Xbox 360, Encore has come to the Wii. Now, the PS2 version of this game was actually pretty impressive with a ton of modes and cool customization features while the Xbox 360 version was a barebones affair that left players wanting. When Konami and Blitz Games decided to come to the Wii, they had to decide which of those two versions they wanted to run on the Nintendo platform.   They picked the wrong one.     If past Karaoke Revolution games have passed you by, getting a handle on the gameplay is simple enough. Encore has 40 songs such as ~Come Sail Away~ and ~Copacabana~ packed onto its disc and challenges you with singing them for points and praise from the judges -- yes, Randy, Paula and Simon are present and accounted for. Each time you choose a song, the words and syllables begin scrolling across the screen with pitch and timing bars above them. You sing the words and try to keep the arrow that reacts to your voice gliding over the on-screen lines. Keeping the arrow in the proper place means messing with the octave you're singing in and holding notes for certain amounts of time. Confused, 50-year-old Idol fan looking to pick this up as a way to connect with your gaming kin? It'll be second nature once you get the mic in your hand.   Once you get the basics of how to sing and adjust your performance, there are a couple of caveats you need to get down. First up is phrases. When you're playing, you'll find the song broken up by vertical white lines -- these sections are phrases. When you hit a white line, the game will score the phrase you just sang with a written descriptor ranging from lousy to great. You can track how you're doing on a given phrase by watching the Phrase Meter on the left side of the screen fill and change color. If you can get a ~good~ or ~great~ rating on three phrases in a row, you'll start a combo and get bonus points for every phrase you nail from there on out. Above that is a crowd meter that lets you know how you're doing with the fans. Nail the sparkly lines of text and you'll get a crowd boost.   In the end, all these boosts, phrases and points are tallied for a final score that breaks down how many goods and poors you've received as well as ranking the performance.   Eat it, Avril! Although I've already set it up that you're going to be disappointed with Encore, it's important to point out that this isn't a broken game. In fact, it's got some things going for it. What sets this apart from the most other Karaoke Revolution games is, duh, the American Idol license. Although this isn't the first time Fox's peanut butter has gotten into Konami's chocolate, the experience is by no means stale. When you boot up the game, you basically have the option of jumping into an American Idol competition or just singing your little heart out.   If you go the route of the show, you'll find the formula that's made the program a pop culture icon. You'll choose your character, audition for the judges, go to Hollywood and compete in a handful of rounds as you try to work your way down to being the last crooner standing. After each of your performances (you're not subjected to watching the other singers) Randy, Paula and Simon break you down or build you up, you're given a score, and if it's an elimination show, the contestants are listed, rated and cut while a disembodied voice intros the next round (Seacrest out).    A nice addition to the mode is the ability to customize it to the amount of time you feel like putting in. Sure, you can save after every performance and walk away at will, but the game also allows you to choose do a Quickplay, which is just one song with the judges judging at the end, or choose between four-, eight-, 13- and 18-round single-player competitions. Want a full Idol contest with up to seven friends offline? Encore's got you covered: Multiplayer Contest let you and your friends square off against each other and the computer in one to seven rounds of a full-fledged show. Don't feel like a full-fledged Idol-thon when your pals are over? You can also perform duets or battle head-to-head.   So what holds Encore back from being the greatest karaoke videogame ever? Basically a lack of options and excitement.      When you start an American Idol competition, the game just doesn't feel like the show. To begin with, your character customization options are extremely limited. You can't create a singer from scratch and can't change a model's body type. Not being able to adequately make yourself kind of knocks the wind out of trying to become the next Idol superstar and is even more depressing because these options are included on the PlayStation 2 version of this game.   With its debut on the Wii, you'd expect Konami to push what we've come to expect from Karaoke Revolution's visuals, but Encore doesn't. In fact, it appears the game is so grounded in trying to look real that it has no flair or soul whatsoever. The judges are lifeless models, the performers on stage barely move, and the sets are pretty bare.    It's vanilla.   When you get rolling in the competition, things seem okay at first as far as making the game feel like an episode of the show. Each judge is voiced by their real-life counterpart and has a seemingly hefty pool of quips to use, but when you advance to Hollywood or whatever stage is up next, you're taken to a static screen where a list of names is cut down to show who gets to move onto the next round. C'mon, I don't even get the chance to stand on stage with my opponents and watch them sulk off in disgust?    The pain! Sure, duets and battles are nice, but those multiplayer options pale in comparison to what you'd find on the 360 and PlayStation 2. Over in Xbox land, there's downloadable content and three online modes. In Sony square, there's a traditional karaoke mode with no points or judging, medleys and sing-offs. If you didn't know these options existed elsewhere, you'd probably just think the Wii selection was weak, but knowing what could've been, you'll think the selection is weak and cheap.    The biggest problem: there's no Ryan Seacrest. Instead, an unknown, disembodied voice lets you know about the next round when you play through the American Idol mode. I needs my 'crest!There's no doubt that singing My Heart Will Go On and Knockin' On Heaven's Door is fun, but Encore's limited customization, barebones modes and ho-hum visuals are stacking the deck against you putting the time into the more than 20 unlockables. In its first foray onto the Wii, Karaoke Revolution has turned in a performance that isn't Ashlee Simpson bad but is far from the headliner we've cheered for in years past.", "date": "Feb 8, 2008"}