{"name": "Tomb Raider: Definitive Edition", "ref": "https://www.gameinformer.com/games/tomb_raider_definitive_edition/b/playstation4/archive/2014/01/24/tomb-raider-definitive-edition-review-game-informer.aspx", "text": "Crystal Dynamics has held the reins of the Tomb Raiderfranchise since 2006, when publisher Eidos decided that Core Design had run theseries into the ground. After two solid new titles and an updated remake of theoriginal games, the studio finally hit a home run with 2013's Tomb Raider, areboot of the series that many - myself included - felt was the best game in franchisehistory.In many ways, Tomb Raider recalls the trio of recent JamesBond films starring Daniel Craig; both reimagine a British entertainment iconin a harder, less playful fashion. Don't expect this Lara Croft to engage inquippy banter; the violent, often grim tale pushes her to the limit as sheturns from a girl to a battle-hardened woman.Aside from the subpar multiplayer and a few suspect plottwists, the game is nearly flawless. The big questions are: What's new in this~Definitive Edition,~ and should I buy it? The answer is...it depends.The grandiose subtitle might fool some into thinking thisre-release is more significant than it really is. In essence, this is anext-gen port of Tomb Raider packaged with all of the post-release DLC content.There are a few Xbox One- and PlayStation 4-specific added features like voicecommands and touchpad controls. You can say ~stealth~ to switch to a silentweapon (which isn't as fast as doing it with the d-pad) or use the PS4'stouchpad to light a torch. The PlayStation 4 controller glows red when you havea torch. The Xbox allows you to tilt your head during platforming sequences toshift the camera angle. As you'd expect, it's all clever but inessential.A good selection of bonus content is also included:multiplayer maps, characters, and weapons previously released as DLC and theDark Horse digital comic book ~Tomb Raider: The Beginning,~ an art book, and amaking-of documentary. Six new outfits allow you the unprecedented ability todress Lara in clothing that's actually appropriate for the weather conditions.The most notable new addition for fans is the only new single-player content,the Tomb of the Lost Adventurer, an all-new Tomb found off to the right in thearea before Lara and Whitman enter the large tomb doors in the first hour. Likethe others, it's short and mediocre.The biggest draw of Tomb Raider: The Definitive Edition isthe improved graphics. They're simply stunning in perhaps the best-lookingconsole game I've ever seen. Running smooth 1080p resolution, this new versionadds an incredible level of detail to the newly modeled characters and lushenvironments. From Lara's uncannily realistic hair to the shimmer of waterreflections on a cave wall, every inch of this game is visually striking. It'sa tantalizing glimpse at the wonders that these new consoles have in store forus.Are these improvements worth $60 if you'vealready played the game? Without knowing your bank balance, I can'tdefinitively answer that question. For me, it's simply a great port of a greatgame. The added content is a welcome addition, but didn't markedly affect myenjoyment of Tomb Raider. That said, it's undeniably the best version of TombRaider yet - and the best game currently available for Xbox One and PlayStation4. If you haven't played it, I don't know what you're waiting for. The EdgeThe PS4 version appears to have a better framerate at times. However, Tomb Raider looks good on both consoles and the discrepancy didn't affect my enjoyment of either version.", "date": "on Jan 24, 2014", "grade": "9.25"}