{"name": "Zoo Tycoon", "ref": "https://www.gameinformer.com/games/zoo_tycoon/b/xboxone/archive/2013/12/03/zoo-tycoon-review-game-informer.aspx", "text": "At most zoos, numerous signs and railings adorn every habitat, designed to keep hapless patrons from coming face-to-face with the wildlife. Thats a practical and life-saving maneuver in the real world, but keeping people at a distance doesnt work in video games. As cute and entertaining as Zoo Tycoon can be, too much of the simulation is behind the glass. Youre free to look, but any sort of compelling interaction is kept out of reach.  The first zoo I created was a runaway success. The animals were content, people had fun, and I made plenty of money. I should have been happy, but this prosperity felt hollow since I didnt really do anything to earn it. I set down some habitats, then filled them with animals that the game explicitly indicated would thrive in those environments. I didnt do any fine-tuning. I didnt worry about layout. I didnt weigh any decisions. And yet, everything went perfectly.This isnt because Im some Zoo Tycoon savant; this reboot of the simulation series just doesnt have depth. You can decide which animals you want and where their habitats go, but you dont get any chance to fail or cause mischief. For instance, incompatible species cant inhabit the same environment, and all animals dutifully stay within their exhibits. Im not saying I need the ability to place ferocious lions in dangerously flimsy cages, but for a simulation to be truly gratifying, you need the opportunity for things to go wrong. Previous entries in the series got this right, but it doesnt carry over here. Zoo Tycoon doesnt make you think about how you might do things differently on later playthroughs, because you are herded down the same path to success each time.To the games credit, building your zoo still has its share of memorable moments  despite shortages of variety and strategy. Seeing your facility grow is fun as you attend to the needs of animals and patrons by adding specific fixtures to meet demand. Zoo-goers dont just want to see animals; they want entertainment and food, and building those things keeps everyone happy. The system is simple, but the ability to customize the basic look and layout of the zoo gives you a sense of ownership. Research allows you to slowly improve your offerings, and a steady stream of new objects (like larger environments and more exotic animals) unlocks as your zoo gains renown. Adopting new kinds of lions, giraffe, elephants, and chimps is inexplicably exciting, considering that they dont have a major impact on your zoos function. Developer Frontier (the studio behind Kinectimals) has wisely leveraged its expertise with cute animals for Zoo Tycoon. The detail is impressive, and the animations  especially on the babies  are adorable. The use of Kinect is especially cool, since it lets you interact with the animals in certain areas. The best one involves the chimpanzees; you walk up to a glass pane with a chimp on the other side, then start making various faces. Blinking, smiling, grimacing  the chimp mimics these expressions to hilarious effect. You get the chance to appreciate these touches when you assume control of a zookeeper and wander around the grounds. Direct third-person control is one of the two views you use while managing your growing park, the other being a traditional top-down perspective. I spent the majority of my time using the overhead option; exploring your zoo on-foot is neat, but not efficient if you want to get any actual work done. The strangely cumbersome interface gets in the way regardless of your view, since it forces you to wade through multiple menu layers to accomplish simple tasks. Placing a tree or adopting an animal is a multi-step process, and even then, you can only do one at a time. If you want to do any sort of extensive decorating or fill a large animal habitat, too much of your time is spent simply navigating to the things you want.The other big problem is the inability to build to your hearts content. Despite having a sprawling area for your zoo to occupy, a size restriction keeps you from filling it up. Every exhibit, animal, and concession stand contributes to this total, and when it fills up, youre done. I was able build most things I wanted, but was annoyed that this artificial ceiling kept me from continuing to expand  especially since there was so much space remaining on the map.Zoo Tycoon isnt ambitious, but generally succeeds at providing a low-impact simulation. Even with the interface issues and space restrictions, starting a zoo from scratch and building it up is entertaining, though it isnt complex. The ability to share zoos in the cloud and play online co-op also makes this a good title for friends and family to play together. Its easy and accessible fun, but Zoo Tycoon has a long way to go before it has the depth to make it rewarding.", "date": "Dec 03, 2013", "grade": "7"}