{"name": "Super Motherload", "ref": "https://www.gameinformer.com/games/super_motherload/b/playstation4/archive/2013/11/22/digging-deep-shallow-play.aspx", "text": "Playing in a big sandbox is fun, and sandboxes dont get much bigger than Mars. Super Motherload is all about digging ever deeper down into the ground, and regularly returning to the surface to refuel, sell items, and upgrade your abilities. The repetition of going up and down so many times gets increasingly tedious, and little changes about the gameplay over time. After several hours I had mined deep into the planet, but I was hungry for a little more depth in the action.You are employee 1001 of the Solarus Corporation, and you must reinvigorate the companys mining operations on the red planet. Each new tunnel you dig fills your cargo space with new minerals, but its not long before you need to turn around and start again. A story of madness and ancient Martian secrets unfolds through occasional pop-up text boxes and spoken dialogue. While these interludes provide overtones of horror, theyre not frequent or involved enough to paint a complete picture. The best part of Super Motherload is the fun of upgrading your vehicle, speeding up your drill, and increasing the size of your fuel tank  though everything in between is a grind.The richest rewards are hidden behind small puzzles, challenging you to use your explosives in interesting ways to acquire the goods. However, I didnt feel compelled to engage with these puzzles, since I knew that ever-better rewards await just a little farther down. Mounting frustration comes through the endless cycle of dig, climb, and repeat. The depths between outposts get longer, until by the end youre spending many minutes just to reach the site of the final boss. Die in that encounter (which you will), and its back to the last outpost to start the whole process over. I appreciate the opportunity for some 4-player local (but not online) cooperative play, and some minor strategy is involved in combining different minerals during a dig to create more valuable objects. These small wrinkles arent enough to keep players invested. Play Super Motherload if you love the pure joy of the Dig Dug-style carving out of the ground, but dont be surprised if theres not enough buried beneath that layer.", "date": "Nov 22, 2013", "grade": "6.75"}