{"name": "Killer Instinct", "ref": "https://www.gameinformer.com/games/killer_instinct/b/xboxone/archive/2013/11/22/killer-instinct-review.aspx", "text": "I have fond memories of playing Killer Instinct in the arcades nearly 20 years ago. Lengthy combo counts, the guttural shouts of the announcer, and the excitement of pulling off an ultra combo always brings a smile to my face. Its ridiculousness set itself apart from the juggernauts of the era (like Street Fighter and Mortal Kombat), and I expected no less from this reboot of the series. Killer Instinct on Xbox One stays true to the fun and silliness of its past, but also has a deep, competent, and innovative engine driving the action.The base formula for stringing together combos is largely unchanged from the original game. You start with an opening special move, press a button for an auto double, another special move for a linker, another auto, and finally a finisher. This approach isnt as rigid as it seems; its more of a starter recipe that you can add to or take away from as desired. The engine gives a lot of wiggle room to allow the player to create freeflow combos. Execution requirements are lenient, giving the player ample time to buffer their next attack in a string. This leniency in execution ensures that you wont have to commit several hours in the training room, and lets the player have fun and pull off kick-ass combos right out of the gate.Being attacked in other fighting games is usually a frustratingly passive affair, but Killer Instinct lets you take more of an active role in how badly you get pummeled. The iconic C-C-C-COMBO BREAKER was an innovative mechanic back in the original, and the tradition continues. At a glance, combo breakers may seem like a glorified game of rock-paper-scissors. You need to press a button combination of the same strength level of the attack youre attempting to break, but the combo-breaker metagame only begins there. If you anticipate your combo being broken, you can now perform a counter breaker to shut down your opponent and continue with your onslaught. Attempting to break a combo or a counter is risky; incorrectly guessing can open you up to all sorts of hurt  even locking you out of combo-breaker attempts for a short duration. Dishing out damage by getting in your opponents head is hugely satisfying. The risk/reward of performing combo breakers is ripe with opportunities for mind games.Obviously, getting in the head of an AI opponent is impossible, but if you do want to duke it out with a computer, there arent many options available to you. The never-ending survival mode helps you earn points to unlock some cool collectibles. Costumes and accessories for your fighter are available as well as titles, icons, and taunts for your profile. KI nostalgists will likely spend some time racking up points in order to unlock audio tracks from the old Killer Cuts CD or to enable the classic announcer voice. The lack of a traditional story or arcade mode might be a bummer for some, but shouldnt be a deal-breaker.Playing against real opponents is where the fun lies. The offline multiplayer captures a classic arcade experience, but online offerings are disappointingly limited. Exhibition matches are only one-on-one with no spectator capabilities. Ranked matches are handled by the developers own SmartMatch system, but Id rather set criteria like latency and player rank for myself. Online experiences will vary, but the netcode seemed solid in my time playing ranked matches.Killer Instinct doesnt cost any money up front; you get one character for free  Jago at launch  and the other five are available as a bundle ($20) or individually ($5 each). The scant number of characters is atypical of modern fighters (though two more are promised via DLC). On the other hand, KI focuses on strengthening archetypes instead of padding the roster with carbon copies. Well-balanced, rushdown, mixup, projectile, and grapple types are all represented, and each feels different. Though the faces are familiar, most characters movesets and command motions have been altered significantly. The new kid on the block is a character named Sadira  a female assassin with high mobility and speed that lead to mind-boggling mix-up situations.Killer Instinct is an absolute blast to play, and appeals to both my casual and hardcore fighter sensibilities. It has one of my favorite fighting game engines in recent memory. I hope that more characters are added, and players get the ability to create spectator lobbies in the future. Despite those problems, Double Helix has exceeded expectations in resurrecting this franchise as a fun and accessible fighter.", "date": "Oestreicher on Nov 22, 2013", "grade": "8.75"}