{"name": "Tearaway", "ref": "https://www.gameinformer.com/games/tearaway/b/playstation_vita/archive/2013/11/20/more-than-an-iota-of-charm.aspx", "text": "I love games, but I seem to spend an undue amount of time around virtual jerks. Foul-mouthed criminals, shouting marines, evil nemeses of various stripes  it gets old after awhile. Thank god for Media Molecule. The English studio, which won acclaim for the LittleBigPlanet series, has a knack for creating worlds and characters that exude a playful charm, something thats in short supply in both gaming and popular culture today.In many ways, its a simple game. You play as Iota (or his female counterpart Atoi), a living envelope tasked with delivering a message to a mysterious figure in the sky. Thanks to the Vita camera, this godlike figure is actually you peeking out of the sun. Iota journeys through a series of surreal worlds, engaging in fairly straightforward 3D platforming.Tearaway doesnt reinvent the genre, but rather builds a strange version of it made entirely of paper. Inspired by papercraft, Media Molecule has created a world that feels unlike any other Ive experienced. Its a pop-up book come to life, with worlds and creatures that unfold and move in ingenious ways. Drag a finger across a level, and it folds out to reveal a new path. Moving platforms dont magically float  they are propelled up and down by accordion-like structures.Along the way, the game encourages you to take part in the creativity. You can take pictures with the in-game camera (which pays off to great effect at the end) that even has Instagram-style filters you can buy. Iota can be altered and tweaked with dozens of cut-out eyes, mouths, and other silly objects. By taking pictures of certain creatures, you unlock real-life papercraft plans that can be printed out on your computer. Whens the last time a game inspired you to take up a new hobby?At certain points, you find a character who wants a new hat or some other object. Here, you are sent to a virtual work table where you can design and cut out paper designs with pencil and scissor tools. Its fun and gives you a sense of ownership in the game; I loved seeing my sad, asymmetrical cowboy hat display on my character throughout the adventure.The papercraft theme carries over to the controls, which offer a more tactile experience than most games. You can unroll walkways like wrapping paper or even poke your finger through the bottom of the world and send your enemies flying. Your finger actually appears to burst through the game world, and the back camera even displays a bit of the floor below you around the edge of the tear to add to the illusion. Later, you use this mechanic to solve environmental puzzles, moving bridges and the like to let Iota pass. Much of the platforming is done with the back touchpad, as you bang on large drums that send Iota bouncing to the next checkpoint. In the last third of the game, you even use the Vitas tilt functions. In many ways, its the game the Vita was created for  not one aspect of the hardware goes unused.Its not perfect; developing a 3D platformer is a new challenge for Media Molecule, and there are some technical hiccups. At times, the framerate lags, and I experienced some camera issues. Iotas movements feel a bit sluggish, and the combat is fairly repetitive and hampered by a very small selection of enemies. These are flaws that should be acknowledged, but none of them really impact the sense of wonder and fun this game provides.Tearaway is brilliantly out of step with much of mainstream game development. Its gentle, distinctly British brand of whimsy and imaginative visual style makes it an experience unlike any other youll have this year. The core gameplay isnt exceptional, but its solid enough to let the brilliant puzzles, art, and level designs shine.Its a journey worth taking, and just when you think youve reached the end, you encounter a surreal third act that cemented its place as one of my favorite games of the year. I hope Tearaway can find its place among all the blockbusters and new consoles that will be vying for your attention this year. It certainly deserves it.", "date": "on Nov 20, 2013", "grade": "9"}