{"name": "NBA 2K14", "ref": "https://www.gameinformer.com/games/nba_2k14/b/playstation4/archive/2013/11/19/nba-2k14-ps4-review.aspx", "text": "What a long, strange trip my first NBA season has been.After dominating my rival at the rookie showcase, I expected to go in the topfive, but after the Phoenix Suns shunned me for that same rival, the NewOrleans Pelicans grabbed me sixth overall. Being a high draft pick, I expectedto get regular minutes, but with Jrue Holiday and Eric Gordon cemented in thestarting lineup, I was relegated for the bench for my first few games. Onlyafter Gordon twisted an ankle did I get my first taste of the NBA experience. From here, unpredictability was the rule of the day. Ifaithfully suffered through rookie hazing by agreeing to carry Jason Smith'sluggage for every road game, but drew the line at wearing a clown nose duringpress conferences. A few good games boosted my league popularity and earned memore minutes, but then I hit a slump. During this rough patch Holiday actedlike a true leader, taking me under his wing and spending off-hours watchingfilm and practicing with me. My game rebounded, and after a particularly strongperformance some teammates encouraged me to join them out on the town. Iobliged and woke up the next day with a crippling hangover already late forpractice. Photos emerged on social media of me leaving a club at 6 a.m., andmanagement was none too pleased. At a sit-down with the GM following mytransgression, he suspended me a game for conduct detrimental to the team. Laterat practice, I had a heated run-in with Smith, the player who invited me out,after taking him to the floor while running though his pick. Reports of thescuffle emerged on social media, again casting my reputation in a negativelight. Welcome to the life. Since it debuted the MyPlayer mode in NBA 2K10, Visual Conceptshas been at the vanguard of the single-player sports experience, allowing youto shape the career of a professional basketball player from his performance onthe court to his conduct in press conferences. To kick off the next generation,the studio has doubled down on this mode (redubbed MyCareer last year) byincorporating these storytelling elements, which hasn't been present in a videogame since NBA 06, the Sony title that chronicled the life of an NBA player but never had the gameplay to support it. While playing the actual games is still the centerpiece ofMyCareer, you now get a deeper glimpse into the life of a professional athleteby managing relationships with teammates, conversing with the general managerand coach, and carrying a rivalry throughout your career. Much of this ishandled via cutscenes with a Mass Effect-like dialogue system. All of yourchoices have repercussions. If you lean on the general manager for moreminutes, it may fracture your relationship with your head coach. If you don'tstand up for a teammate who gets fouled hard in the middle of a game, yourchemistry with the team suffers but you avoid taking a hit to your publicreputation. Turning down that offer to hit the town after the game costs you avaluable opportunity to bond with teammates, but doing so also keeps you out oftrouble. This depth of storytelling creates a greater degree ofimmersion than any other sports game I've ever played. That said, the modewould benefit from another layer of polish. Some major locker-room moments,such as star players getting injured or the general manager trading for newblood, go by without so much as a news update. The dialogue also jarringlyalternates between spoken segments with the fictitious characters and writtenconversations with real players and coaches (an understandable hurdle thatwon't likely be cleared any time soon). Because the story plays such a big rolein the mode now, you cannot sim to key games like you could in previousversions, either.Visual Concepts took a similar kitchen sink approach torebuilding MyGM. Much like the MyCareer mode, this new version of Associationmode puts you in the role of a fledgling general manager responsible for overseeingthe draft, signing free agents, keeping players happy, and working togetherwith a staff that oversees finances, coaching, and training. Many of yourduties are surfaced in a conversation system, so you don't spend hours divinginto menus to make sure you don't miss a scouting opportunity or a chance tosign your star player to a contract extension. As you win games and performtasks assigned to you by the owner, you earn virtual currency (VC) to spend onupgrading skills that affect your ability to sign free agents, make palatabletrade offers, improve team facilities, and manage the organization's budget.If you play every game, it's easy to progress. By simming,you can only earn the paltry amount of VC awarded for completing the ownershipgoals. This leaves you at a major disadvantage when it comes to upgrading yourabilities, spending VC on player improvements, or responding to the wishes ofyour coach. Rick Adelman constantly requested that I build a film room so theplayers could study, but in three years of managing the organization viasimming I still didn't have enough VC to even unlock the ability to buy newfacilities. Though I generally appreciate MyGM's new approach tofranchise modes, it has its share of birth pangs. Sometimes the conversationsyou have seem completely out of context. While my team was on a 9-1 tear, mystarting point guard (who has a happiness rating of 100) came to my office tocomplain about the team's direction. You also can't look at the list ofprospects during the draft, which makes it tough to assess whether or not youwant to trade up or down. Since the mode operates on auto-saves, if youaccidentally hit the wrong option when negotiation a contract you have zerorecourse for going back. If you set up your MyGM while your console is online you have to be connected online to continuesince it operates on VC, which is stored on 2K servers. As an alternative you could create a purely offline MyGM save file by disconnecting your console and starting up the mode.On the court, don't expect much of a difference between thenext-gen version of NBA 2K14 and the current generations outside of thedrastically improved graphics. Player models look fantastic, especially thefacial animations. The only other major difference is I saw more clipping than I remember seeing while reviewingthe 360 version, particularly when players are banging in the paint. If you prefer playing online, your options aren't great. Mostof the basics are here, including MyTeam, head-to-head matchups, and anabridged online season that caps out at 56 games. A blacktop mode called The Park(which is oddly hidden within MyCareer mode) lets you play pickup games withyour MyPlayer, but it lacks a proper league structure and suffers from wildly inconsistent performance. I had trouble getting into The Park at all on most attempts, and when I finally was able to play a game the framerate was far from smooth. If you're looking for an online franchise mode, you're out of luck.Ratherthan simply port the current generation version of NBA 2K14, Visual Conceptsdeserves praise for drastically renovating its two most popular modes for itsnext-generation console debut. Both MyGM and MyCareer are promising redesignsthat take the franchise and single-player modes in interesting new directions,making this the definitive version of NBA 2K14 to own if you prefer to play this way.But once again, Visual Concepts has left online fans wanting.", "date": "Nov 19, 2013", "grade": "8.5"}