{"name": "Path of Exile", "ref": "https://www.gameinformer.com/games/path_of_exile/b/pc/archive/2013/11/19/clicking-and-collecting-on-its-own-path.aspx", "text": "While my co-workers saw me playing Path of Exile at my desk, they usually asked why I was playing Diablo. I cant blame them for their confusion. At a glance, Path of Exile looks just like Blizzards click-and-collect action series, with a similar formula involving combat, co-op, and loot. However, a few innovations separate Path of Exile from its clear inspiration.At its outset, Path of Exile throws a lot at you with little direction. Tiny icons dot your user interface, and a comically huge skill tree resembling Final Fantasy Xs sphere grid looks intimidating even before you zoom out to see the whole thing. The experience is not friendly to newcomers, but it rewards you for spending the time and effort to learn its intricacies.I felt like I started to get a handle on things once I realized my character wasnt collecting money. You dont collect gold from the monsters you defeat  you collect loot, and that serves as your currency. Instead of purchasing items from shops and other players, you barter loot. Its a strange and unfamiliar system, but one I grew to appreciate. The idea of loot as currency is for the prevention of unnecessary inflation, and it seems to work. It also adds a level of realism to an otherwise fantastic world, which I liked. Path of Exile also tries something different with its skills and special abilities. The gigantic skill tree primarily contains passive bonuses, such as increased health and damage. More active powers, like launching fireballs, come from how you customize your arsenal. Special colored crystals embedded into your weapons and gear unlock new abilities, and they can be exchanged and moved without penalty. However, not every crystal fits every weapon, so you may need to weigh the benefits and drawbacks of switching to new gear. It adds an extra layer of interesting decision-making to managing equipment.Combat will be familiar to anyone who has taken on Diablo, or ventured into the depths of Torchlight. As you make your way across the continent of Wraeclast, avoiding your felonious past and banding with others to survive, you will point and click a lot of monsters. Special abilities are mapped to the three mouse buttons and five keyboard keys, giving you access to worthwhile sampling of your skills at all times. Its empowering to throw a bunch of magical skills out at once at a crowd of deadly crabs without having to dig into your menu.You can play the game entirely on your own, but Path of Exile does require players be online. Other players mill around the safe areas where you get missions and perform trades, but theyre easy to ignore if youre looking for a single-player experience. If you are interested in teaming up with others, all it takes is a quick gander at the noticeboard. Players have parties awaiting new members with specific level requirements all laid out. If youre looking to play cooperatively, Path of Exile makes it as easy as possible.Perhaps Path of Exiles most impressive bullet point is its free-to-play model, and its monetization features are difficult to track down. Your real money is used to do things like purchase additional inventory slots and make cosmetic changes. I never once saw anything resembling a pop-up or an alert reaching out to remind me I could spend money on the game.Path of Exiles loot collection and combat looks and plays like others in the genre, but its innovations have widespread effects separating it from the competition. Its multiplayer longevity is difficult to predict, but as a campaign-driven action-RPG, Path of Exile succeeds.", "date": "Nov 19, 2013", "grade": "8"}