{"name": "Resogun", "ref": "https://www.gameinformer.com/games/resogun/b/playstation4/archive/2013/11/14/the-accessible-next-gen-shooter.aspx", "text": "One problem that goes along with the launch of a new console is that the biggest games are sometimes months or years away. Resogun attempts to deliver a small game that invites repeated playthroughs and inspires competition while you are waiting for the heavy hitters. Geometry Wars admirably served this role when the Xbox 360 launched in 2005, and while Resogun does provide some quick thrills it wont keep players coming back.Resoguns base gameplay takes the premise of twin-stick shooter  stay in one area and blast enemies from all directions  and simplifies into a more accessible game. Your shooting is limited to just the left and right, so your attention is focused in fewer directions. The playing field is wrapped around a transparent cylinder, instead of a flat playing field. This setup that helps tremendously with assessing danger, since you can see enemies before they become threats. When levels fill up with too many enemies  which they will  the ability to assess danger makes everything feel much more manageable. Resogun is not an easy game, but if you find the challenge too much, you can drop the difficulty at any time.Your main goal is to stay alive and defeat the boss at the end of each level, but a secondary goal to save humans adds additional worthwhile challenge. Defeating certain enemies causes humans to fall from their safety cells and begin aimlessly exploring the cylinder. Activating your temporary high-speed invincible boost to snap up wandering humans before they are killed, and chucking them to safety are some of the most intense and enjoyable moments.Partnering up with a friend online is quick and easy thanks to the PlayStation 4s improved online party system. Its fun to have a friend around to play catch with humans before dropping them off in the safe zones, and to help collect power-ups for you. Adding an extra set of guns also helps, but it does little to add additional tactical layers beyond lets shoot everything and make sure we dont die.Resogun doesnt define the future of next-gen graphics, but the particle effects and voxel explosions that fill the screen without slowing anything down are impressive. Five short levels and three distinct ships make up Resoguns offering, so getting through the game and seeing the credits can be done in one relaxed sitting. The leaderboards are organized by level, but comparing those results doesnt inspire the same spirit of competition as sharing a single high score. Its great for showing off your new system and acclimating to a new controller, but a dearth of content prevents Resogun from earning much praise beyond being a solid, fun launch title.", "date": "Nov 14, 2013", "grade": "8"}