{"name": "Bioshock Infinite - Burial at Sea Episode 1", "ref": "https://www.gameinformer.com/games/bioshock_infinite_-_burial_at_sea_episode_1/b/pc/archive/2013/11/11/bioshock-infinite-burial-at-sea-review-game-informer.aspx", "text": "The way seemingly trivial choices ripple out and create larger consequences is part of BioShock Infinites core. In the story, small changes can have a significant impact on events; Irrational Games aims for the same effect on the gameplay front with Infinites first story-focused DLC. A new setting and minor changes to the combat present something different, but Burial at Sea isnt so far removed that its unrecognizable. The highlight happens right away. As a version of Booker DeWitt who lives in Rapture, you step out the door into a pristine version of the iconic setting from BioShock 1 and 2. You see a new side to the underwater city, unclaimed by the ocean and unmarred by excessive genetic manipulation. Shops are open for business. Citizens use plasmids to make their lives easier. The Big Daddies dutifully maintain the outer structure. You dont engage in any combat during this introductory segment, so youre free to explore, eavesdrop, and find audio logs. For fans of the series, the opportunity to see Rapture thriving is worth the price of admission ($14.99) by itself.You cant bask in the glow of civilization forever. The story propels Booker and Elizabeth  now a noir detective/dame duo  to search for a missing girl in a sunken prison. Since the plot holds the biggest surprises in the DLC, Im wont say too much about it beyond this: You should make sure you finish the main game before playing this DLC. The characters are the same, but their motivations are different; you arent just playing through a compact and reskinned version of BioShock Infinite. Whether or not the story ultimately pays off remains to be seen (this is only the first of two episodes), but I enjoyed the direction it takes in this installment, and Im anxiously awaiting the resolution.Once Booker and Elizabeth descend to the more decrepit parts of Rapture, Burial at Sea starts feeling more like a retread. The prison isnt much different from the Rapture players already know from previous entries. The rubble, broken storefronts, puddles of water, and assorted corpses convey the same sense of ruin that Rapture always has, without adding any additional layers. Rapture is still an interesting location, so it isnt unforgiveable that the majority of this episode takes place in these desolate areas. However, returning to the formula is disappointing after the strong (and novel) opening showing the city in its prime.Combat also doesnt stray far off the beaten path. The nuts and bolts of the gunplay are the same, with rails to ride, tears to open, and bad guys to shoot. However, minor tweaks produce a different (though not necessarily better) battlefield. The weapon wheel returns after being absent in Infinite, so you can hold more than two weapons at a time. Expect to swap your equipped gun frequently, since you cant hold much ammunition anymore. This adds a higher degree of tension and desperation to combat, forcing you to be more careful with your shots and resources. Expect more moments where youre low on Eve and only have one more shot in your shotgun  and even though Elizabeth can scrounge up items, they arent always enough to keep you comfortable. I had fun experimenting with new approaches, but a few more new weapons and powers would have gone a long way.The biggest letdown in the whole package is the implementation of the new items. These additions just dont inject fresh excitement into combat. For instance, the new gun is a hilarious radar beam that turns opponents into living bombs, but you get it so late (like, the last 15 minutes) that you dont have the chance to appreciate it. The extra plasmid is called Old Man Winter, but it is practically identical to Winter Blast from BioShock 1 and 2. Plus, you dont have access to the full complement of weapons and abilities from BioShock Infinite, so I often felt hamstrung instead of powerful, despite the new additions.On one hand, Im thankful Irrational Games took this unconventional approach to DLC. Instead of re-using all of the same assets from Infinite, the team recreated Rapture and found a way to meld successful elements from several games in the series. On the other hand, the additions are minimal at best, leaving players to go through the same motions with a different backdrop. For a world that invites infinite possibilities, I was hoping for less familiarity.", "date": "Nov 11, 2013", "grade": "8"}