{"name": "Batman: Arkham Origins", "ref": "https://www.gameinformer.com/games/batman_arkham_origins/b/wii_u/archive/2013/10/25/the-younger-less-experienced-bat.aspx", "text": "Gotham City is oddly silent on Christmas Eve. No taxis shuttle last-second shoppers to toy stores. No children visit Santa Claus to make sure he knows exactly what they want to see under their trees. The only commotion on the citys streets is the fluttering of snowflakes, warning of a storm. Even with Gothams citizens embracing the warmth of their homes on this joyous night, Batman is hard at work. Black Mask, the head of the citys largest crime organization, infiltrates Blackgate Penitentiary to snuff out police commissioner Gillian Loeb. As Batman races to save Loebs life, he learns that Black Masks plot extends to another target: He wants Batman dead. A sizeable purse goes to the assassin who delivers his corpse. Eight of Gothams most feared killers receive this invitation, and Batman knows they are coming for him.This is an intriguing introduction for a Batman story. Gothams sworn protector isnt eliciting fear into others on this night. Hes the prey. Hes on edge. He knows hes a target. He just doesnt know when or how he will be attacked.I was fully onboard with this premise, but it never truly takes root as the central focus. Other story threads pollute the hunt; a thin lead puts Penguin in the crosshairs, the Falcone family gets involved, conflict arises with Gotham Citys police department, Anarchy seeks citywide mayhem, Black Mask becomes a part of a greater mystery. Batman has his hands full. The assassins are pushed to the back of the mind, and most of these deadly foes become stopgap boss battles (two of these bouts even take place in a dedicated combat arena). Thats not to say that the various story threads are unwanted or void of compelling events. I enjoyed most of these arcs, but for the first third of the game, there isnt a cohesive narrative to follow; its more a scattershot of mini-tales. But just when it seems this story could become even more convoluted through additional developments, a sinister smile creeps across the screen. At that point, the plot is given new life filled with clarity and excitement. Some of the other threads continue on, but the Joker takes over and it becomes his game.Hes revealed in a plot twist that is shades of Scooby Doo silly, but most of his story is mesmerizing, diving deep into his psyche to illustrate his disturbing first moments as Gothams clown prince. Actor Troy Baker (replacing the great Mark Hamill) does a remarkable job mimicking Jokers haunting voice from the first two Arkham games. Roger Craig Smiths interpretation of Kevin Conroys Batman is also incredibly close. The title Arkham Origins speaks mostly of these characters first encounter, which is a new take outside of the comic and movie lore.Voice acting aside, the most impressive form of imitation comes from developer Warner Bros. Montreal, which is faced with the tall task of creating a prequel game to Rocksteadys incredible run with the Bat. Although were looking at a younger Bruce Wayne, hes the same physical specimen weve come to know over the years, relying on various martial arts and a familiar arsenal of gadgets to topple his opponents and explore his fair city.Combat scenarios play out with the same levels of grace and brutality that weve seen in the past, pushing the player to use attacks, counters, cape strikes, and an array of gadget abilities to strategically chain together impressive combos. New animations are peppered in (including less painful strikes against police officers), but its very much the same satisfying song and dance we've seen before. Traversal once again combines the Bat-claw, glide, and dive bomb techniques as a means of soaring across Gotham. Detective Vision is used frequently for stealth sequences, and to reveal secrets hidden from plain sight.The gameplay rarely breaks free from being more of the same. Warner Bros. Montreal uses this formula to deliver sizable thrills, but many sections use recycled gameplay techniques ad nauseam. Batmans cryptographic sequencer, for instance, is tapped so often that it almost becomes comedic. It's used eight times alone in the GCPD. Before Gotham was turned into a prison, it was apparently a password-protected nightmare.The gadgets come across as Warner Bros. trying too hard to emulate Rocksteadys formula. The glue grenade, which replaces the freeze grenade, handles the same function of gumming up deadly steam vents, and, well... I need to use my glue grenade to make a raft, Batman says. A glue raft? Is that even scientifically possible?In the later stages of Batmans quest, he obtains a pair of shock gauntlets that are similar in concept to BAT mode from Arkham City's Armored Edition. No foe can withstand the might of these kinetically powered devices. Shield carriers, larger heavy units, and any foe you come across in standard combat situations can be knocked down or weakened with one shock gauntlet strike. Sure, its enthralling to control a version of Batman that doubles as an electrically charged pinball on the battlefield, but above all else, the shock gauntlets break the careful balancing of combat. Finding windows to disarm shield carriers and stun heavy units is an integral part of Arkhams intense combat. Removing those elements leads to mindless brawling, and thats what this game becomes in its final leg.The most enjoyment I got out of Arkham Origins came from Jokers story, and a few of the gameplay scenarios tied to specific villains. Mad Hatter takes Batman on a crazy adventure that showcases fantastic environment designs. An encounter with Firefly unfolds across unstable terrain and impressive setpiece moments. I also liked Warner Bros. Montreals new take on investigations. They favor science fiction-like ideas over traditional sleuthing to show us exactly how the crimes were committed. They get fairly complicated, and give us a good look at how Batman breaks down crime scenes.Gotham City is considerably larger than Arkham Citys walled-off version, but that doesnt mean more time is lost to gliding between destinations. Fast travel stations are placed in each borough, and the city is designed in a way that allows Batman to stay airborne with the Bat-claw. If you dont use fast travel, Gotham Pioneers Bridge is enormous and takes a considerable amount of time to navigate.This world is littered with secrets and villain-specific side activities. Riddler returns as a welcome foe that has hidden extortion files all across Gotham. For those of you who will track all of them down (a doable feat with a handy in-game locator) and aspire to hit 100-percent completion, Challenge mode is loaded to the hilt, pushing players to collect 288 gold medals. And if you really want to dive into this game, New Game Plus is once again unlocked after the story concludes. Theres also I am the Night mode, which only offers one life and no saves.Batman: Arkham Origins delivers more of what made Rocksteady's games great, but doesn't break new ground. Like a youthful Bruce Wayne, it isnt as crafty, and it takes its dings during combat, but still puts on a hell of a show when it needs to. Once Joker steps into the spotlight, it becomes a hard game to put down.", "date": "Oct 25, 2013", "grade": "8.5"}