{"name": "Hometown Story", "ref": "https://www.gameinformer.com/games/hometown_story/b/3ds/archive/2013/10/22/hometown-story-review.aspx", "text": "Yasuhiro Wada has spent the past 17 years knee-deep in hismost famous creation, Harvest Moon. In Hometown Story, he drops the hoe andwatering can to break into the shopkeeping business. The parallels to HarvestMoon are clear, with a heavy focus on interacting with townspeople and buildinga livelihood from nothing. Unfortunately, much like the farming sim's firstentries, Hometown Story has potential, but plays it too simple and safe. As a business newbie, you won't have shopkeeping 101 to teachyou the rules; instead, you're thrown into the action and must learn themajority from experience, from tracking down rare items to learning the customers'tastes to maximize profit. The biggestchallenge isn't the financial struggle, but balancing your time between runningthe shop and getting to know the townspeople. Everything revolves around thecommunity and needing them to get by, so you're dependent on the villagers forcrops and fish to sell. While you're earning money to expand your shop, you'realso investing it back into the people by saving up for special items thatbolster their relationships. Lending a hand for someone else's benefit isclearly the point. The maingoal isn't merely to succeed, but decide if you want to put your effortstowards the happiness of others by choosing a character and fulfilling theirbiggest wish.Despite the intent, this tone is more campy and preachy than uplifting.With these main concepts, Homestown Story starts off strong, buteach day feels too much like the last. The customers mutter the same, tireddialogue, often making contradictions. They'd say they're looking for a tool, andI'd put it on the shelf immediately, only to have them buy cake instead. Thefaulty AI is confusing, as it makes you wonder if it matters if you listen tothese random NPCs, which goes against the premise of the game: Getting to knowyour customers.The pacing is also painfully slow. I didn't expect to be anovernight success, but more meaningful interactions would have made it lesshumdrum. For example, I was helping the restaurant owner learn new meals tobring more people to her establishment. She'd request I get special ingredientsfor her to practice. I'd stock the shelf with them, which would lead to acutscene. With multiple requests, I watched that cutscene of her prepping a mealand failing numerous times. Although this advanced my relationship with her, itstill was boring to watch the same exact cutscene without any progression. Evenif one meal didn't taste as bad as the last or she cooked me somethingdifferent, it'd be a great small step to show she's at least developingsomewhat.The other problem with the townspeople is that they shouldlend Hometown Story its spirit, but the characters are mostly archetypes, likethe grouchy old man or the mysterious girl - with unimaginative predicaments.Not many stand out, which is disappointing when I'm supposed to want to helpthis community. To Hometown Story's credit, new characters enter the town as thedays wear on, which is a nice touch. This changes the dynamic; for example, anewcomer may now provide an item, like jam that you can now stock. The progressionextends to your shop, which becomes more populated. How the town grows with your success is byfar the best part of the journey.While unpopulated houses steadily become inhabited, the townitself isn't all that interesting. Without varied dialogue and plenty of wideopen, barren space, I didn't feel compelled to leave my shop, but forced myselfto in hopes I'd unlock a new cutscene with one of the villagers or find freegoodies to sell. The game itself is repetitive, so to have a town to explorethat doesn't have much appeal only makes it feel that much more.I can't deny Hometown Story has charm with itspremise and I love the ideas, but the execution needs work. Owning a shopshould be more frantic and rewarding. If the developer, Toybox, can smooth out the rough edges,it may one day match the lure of simulation games like Harvest Moon and AnimalCrossing. Sadly, it's not in the same league.", "date": "Oct 22, 2013", "grade": "6"}