{"name": "Lego Marvel Super Heroes", "ref": "https://www.gameinformer.com/games/lego_marvel_super_heroes/b/ps3/archive/2013/10/22/game-informer-review-lego-marvel-super-heroes.aspx", "text": "One of the best lines in The Avengers comes in an exchange between Loki and Tony Stark. I have an army, the trickster god gloats. We have a Hulk, comes Starks deadpan response. Not only does Travellers Tales have a Hulk with Lego Marvel Super Heroes, but it has a Thor, a Spider-Man, a Captain America, a Wolverine, and a closet filled with Iron Man suits. As Marvel fans know, theres no shortage of heroes and villains in the comics universe, which is something Lego Marvel Super Heroes takes advantage of in ways I havent seen since Marvel: Ultimate Alliance.Travellers Tales is through tinkering with the series core gameplay, and now its all about refining what works. Levels take you through iconic areas like Stark Tower, Asgard, and the Savage Lands, where your heroes face off against a whos who of villainy. The battle against Sandman in the opening level is of a size and scale that would normally be reserved for end-game boss encounters, and it only grows from there. I wont spoil Doctor Dooms endgame is, but hes in cahoots with one of the universes biggest threats.The rosters in the Lego games have always been impressively robust, but theyve largely been padded with character clones and nobodies. For every Legolas or Batman, theres a generic archer or construction worker. That bumps up the number of choices that players have  almost always a good thing  but it also makes it clear who the real heroes are in each title. Lego Marvel Super Heroes smashes through those boundaries, offering more than 100 different characters that are actually worth playing. Its impossible to miss the amount of love and care that went into each of those characters.Iceman glides along in long strides, arms tucked behind him like a speedskater. Sandman transforms into a cannon for long-range attacks. Even Spider-Mans mercurial boss J. Jonah Jameson brings a unique style to battle, attacking enemies with a barrage of newspapers  not bad for whats essentially a throwaway gag character. Marvel Heroes2472154385001 has some deep cuts on the roster, too, and unlocking and playing as some of these obscurities (Howard the Duck or H.E.R.B.I.E., anyone?) is particularly fun.In addition to taking your favorite characters into previously beaten levels via free play, you can roam around the New York City hub world. The closest comparison would be Lego Batman 2: DC Super Heroes version of Gotham, though Lego Marvels city is a much calmer locale. You arent constantly on the defensive from leagues of bad guys, which makes exploration less annoying. A variety of points of interest are dotted throughout the map, which include combat challenges (New York isnt completely toothless), races, and puzzles. Another highlight is the Deadpool-narrated bonuses. These goofy, quickie levels take place in smaller, more focused areas. Theyre home to some of the funniest moments, too, and theyre worth the effort that comes with tracking down the elusive gold bricks you need to unlock them.Ultimately, Lego Marvel marks the first time Ive had as much fun in the hub world as in the story-based missions. Variety abounds, and the split-screen lets players explore the city on their own. I made it my mission to find bricks and solve the unexpectedly clever puzzles to unlock extras, while my son was happy to rampage through the streets as Venom.Travellers Tales continues its streak of making every one of its games better than the last, and I recommend it to anyone looking for a lighthearted game with plenty of replay  whether or not they have a closet filled with polybagged first editions.", "date": "Oct 22, 2013", "grade": "9"}