{"name": "Skylanders Swap Force", "ref": "https://www.gameinformer.com/games/skylanders_swap_force/b/ps3/archive/2013/10/13/interchangeable-fun.aspx", "text": "My living-room floor resembles a battlefield on the Island of Doctor Moreau. Severed legs and torsos from various animals are scattered across it; warriors with weapons raised high stand triumphant over the grisly tableau. Making like the Doctor, I rummage through the sea of body parts, attaching the tentacles of a squid to the upper body of a parrot. I place the spliced abomination on the Portal of Power and it comes to life, a mighty beast possessing the powers of both wind and water. Tentacles streak across the terrain, thwacking any foe foolish enough to get in his path, and razor-sharp wings dance furiously to fend off any attacks from the flank. My created beast excels in close quarters but has no way of defending itself against volleys from afar. Maybe Ill swap the parrot parts for those of a gun-wielding snake.No matter what bizarre creature you craft, Skylanders: Swap Force handles the empowerment of playing god convincingly. The amalgamated beasts that now roam Skylands open up new combat and traversal possibilities, and also add another much-needed wrinkle to this series well-worn gameplay formula.Creating your own monsters  even if it is as simple as snapping two pieces of an action figure together  is more fun than I expected. I spent a fair amount of time experimenting with these hybrids, seeing which upgrade paths best fit their unique dynamics, and made a contest of unleashing the most ridiculous-looking beast possible (the owl-snake wins). Even if youve assembled a hefty war chest of Skylanders figures from Spyros Adventure and Giants, youre going to feel the itch to run out to the store to purchase more of them  and you have to if you want to see everything this game has to offer. In addition to the eight elemental types and the Giants, this installment introduces eight new ability zones that can only be entered by Swap Force figures. These areas are not extensions of the levels like weve seen with the element types, and are instead standalone minigames  all of which are quite enjoyable.Zoo Lou is the Skylander equivalent of a Green Lantern. He's just one of the great new core figuresThe minigame tied to the Spin ability should give any gamer whos played a Sonic the Hedgehog bonus stage a nice blast of nostalgia; the character bounces off of bumpers in an attempt to chisel away at blocks that are protecting a prize. Other challenges include timed races, platforming sequences, and frantic Q-Bert-like hopping across rings. These sections reward the player well with hidden items, and stars that feed into the new Portal Master rank. Leveling up the Portal Master allows you to activate more Legendary Items, which carry various attribute bumps like +10 armor and +5 gold.You need the help from those bonuses; this is the most challenging Skylanders game yet. Kaos desire to evilize everyone produces a more lethal crop of foes. Many of them are armed to the teeth with weapons that rain down death. Others soak up immense amounts of damage. Some are heavily shielded. Many are invincible during their attack phases. All of these foes demand different strategies, and make you work for your experience.Developer Vicarious Visions, which is on its maiden voyage with the console version of the series after previously developing the 3DS ports, works wonders with the enemy formations, giving players a true run for their money in most combat situations. In some battles on the normal difficulty setting, I lost five or six Skylanders in a level. On hard, many stages led to a dozen-plus casualties. Two or three hits is all it takes to fell a level 15-plus critter.All of the Skylanders characters are now equipped with the ability to jump, which is used frequently to navigate elevated terrain and platforms (not to mention a few fun sidescrolling sequences), but is most effective in giving the player a new way to dodge ground-based blasts. Its a nice addition that gives combat another layer of skill and strategy. I rarely could plant myself in one spot in battle sequences; I was almost always on the move, sprinting and leaping to find attack windows or safety zones.Although most encounters are exciting, the level designs are often rote, clinging for dear life to the everything in video games has to happen in threes or more clich. A nice sense of scale accompanies most stages, but isnt enough to shake the feeling of repetition that eventually hits halfway through most of them. Several stages lean heavily on concepts from previous entries, such as redirecting light to doors, and pushing blocks in the right sequence to create passages. A tedious new lock-picking minigame also rears its head far too often. That's not to say there aren't original and great moments in many of the levels. I enjoyed firing suicide-bombing snowmen into airships. The rail sliding moments are always entertaining. Most of the elemental bonus zones bring variety and their own enjoyable missions.Some of the bonus areas require two elemental types be used at once. This either means digging through your toys to create a Swap Force character comprised of both elements (which I found to be an annoying little task), or playing the game co-op, which I recommend if you get the chance.Swap Force's overall gameplay package delivers everything youve come to expect from this series: collectible hats, crates filled with shiny treasures, and plenty of unwanted guided rail-gun sequences. Its still the same experience at its core, but it just pushes players to be better on the battlefield. A wealth of post-game content is offered to extend the experience. I wasn't too keen on the Time Attack stages, but did enjoy Score mode. Both of these avenues feeds into the Portal Master rank.Despite the level designs sapping some of the fun out of this adventure, Vicarious Visions has crafted an excellent continuation for this annual series. The story unfolds across beautifully animated sequences loaded with hilarious Kaos and Flynn banter (and yes, Glumshanks is abused heavily for our amusement). The new roster of characters ranks right up there with the first game's. I got a big kick out of Zoo Lou's summon attacks, and Roller Brawl's speed comes in handy. The most impressive aspect of this installment is the focus to deliver a more challenging experience, one that pushes the player to experiment and find strategies that work best for specific scenarios. And that plays right into this titles hallmark feature of building Frankensteined monsters to meet these demands. Sure, it may be a design that pushes the player to use more toys (and perhaps buy more), but the result is a more thrilling adventure.I feared of franchise fatigue going into this review, but this installment shows us that a few great ideas can keep this action figure-based experience alive and well.", "date": "Oct 13, 2013", "grade": "8.5"}