{"name": "Beyond: Two Souls", "ref": "https://www.gameinformer.com/games/beyond_two_souls/b/ps3/archive/2013/10/08/beyond-two-souls-review-playstation-3.aspx", "text": "I think of David Cage as an auteur, a distinction that would no doubt please him. His studio, Quantic Dream, makes games unlike any other in the industry, doubling down on quicktime button-press events and advanced graphics technology to create digital stories that are at once startlingly lifelike and completely surreal. Hes nothing if not distinctive.Cage fancies that hes bringing true emotion into games, and  to an extent  hes right. His bizarre serial-killer noir Heavy Rain was weighted down with themes of parental love and loss. These carry over to Beyond: Two Souls, a game that tells the convoluted tale of Jodie, a girl linked to the afterworld through her connection to an omniscient dead soul named Aiden.In a story told through out-of-sequence chapters, we see Jodie grow from a small child with mysterious powers to a lonely teen adopted and held captive by researcher Nathan Hawkins (played by Willem Dafoe). Later, she puts her abilities to use as a CIA operative.Though I like his work, its worth noting that Cage, for all his cinematic ambitions, isnt much of a writer. He just doesnt have a feel for realistic dialogue; conversations often come off stilted and awkward. He also has a flair for melodrama that lends his games an artificial, overwrought quality. However, its less of an issue in Beyond, due to excellent performances by Page, Dafoe, and former A Different World star Kadeem Hardison. They are seasoned actors, and it shows. Page isnt afraid to underplay a scene  a virtue in a game as overblown as Beyond.The core gameplay mechanics will be familiar to fans of Heavy Rain. You experience the game through mashing buttons and quick directional presses on the analog stick. Quantic Dream has made the onscreen interface more minimal; instead of onscreen indicators, you have to observe the direction that Jodies moving in a brief window of slow motion and move the stick accordingly. It makes the action both more challenging and more immersive.You also play as Aiden, the soul who is tied to Jodie throughout her life. As Aiden, you float through walls and use your powers to throw chairs, possess or kill enemies, and help Jodie peer into the past of the people she meets. Its thrilling but also limited; too many times you cant perform one of your powers simply because the game wants you to solve a puzzle in a different way. Still, the combination of characters makes this the deepest and most diverse gameplay experience that Quantic Dream has delivered to date.Its a desire to emulate the huge action moments of more conventional games that leads Beyond astray. Cages talent as a designer is finding gameplay in moments that most overlook: the excitement of cooking dinner for a first date or the tension of navigating the social interactions of a teenage party. Instead of leaning on that strength, Beyond often sets up plot points weve seen far too many times: third-world military maneuvers, CIA training, infiltrating an underwater base worthy of a Bond flick. Even worse, this focus on action sequences comes at the expense of Quantic Dreams trademark interactive conversations. There are fewer of them, and most of the choices you make dont seem to have much impact on the story.All this jumping between different time periods and settings makes the story seem muddled; it doesnt help that theres a lengthy detour about halfway through the game that has little relation to the rest of the plot. Thats too bad, because there are some moments of real power in Beyond. Page is stunning as Jodie, and learning of her troubled childhood and later relationship as Hawkins ward is genuinely gripping.I wish the story would have focused more on its emotional core than blockbuster theatrics, but I was still struck dumb by the impactful last hour. In the end, you make a truly profound choice, and see its consequences. There are multiple endings  none perfectly happy, each powerful. Thats how Ill choose to remember Beyond  brilliant and flawed at once.", "date": "on Oct 08, 2013", "grade": "7.75"}