{"name": "NBA 2K14", "ref": "https://www.gameinformer.com/games/nba_2k14/b/ps3/archive/2013/10/01/nba-2k14-review.aspx", "text": "Toutedas the second coming of Michael Jordan as early as his junior year of highschool, LeBron James has shouldered the burden of outlandish expectations hisentire life. But four MVP awards and two championships into his storied career,he still has more than his fair share of haters. Most of this ill will springsfrom the public relations gaffe where LeBron rebuffed his hometown fans onnational television and announced his intentions to take his talents to SouthBeach alongside Dwayne Wade and Chris Bosh. After back-to-back championshipssome of that hostility has abated, and NBA 2K14 serves as another step in therehabilitation of his reputation. Inthe LeBron: Path to Greatness mode, players assume control of King James to tryand best Michael Jordan's six NBA championships, which is the benchmark manyNBA fans expect the Miami Heat forward to reach if he wants to supplant Jordan asthe best player of all time. You can take two tracks to achieve this goal -either stand tough in Miami or join LeBron on a ~fantastic journey~ where hetakes his talents to New York and eventually returns home to bring achampionship to Cleveland.VisualConcepts gives Path to Greatness as much attention to detail as the stellarJordan Challenge from NBA 2K11, creating running storylines and providingcontextual commentary throughout the experience. The craftsmanship of thesewhat-if scenarios is impressive, but it comes off as a public relations stuntbuilt to communicate that LeBron's successes should be celebrated by all NBAfans -including the shunned masses in Cleveland.Ifyou're not a LeBron James fan, NBA 2K14 doesn't bring much else to the table interms of game modes. The Association mode is showing its age with curious GM AIbehavior that offers mystifying trades and does a poor job with teamconstruction. One rebuilding team offered me the center it just drafted numbertwo overall in exchange for a package centered around my backup small forward.The popular My Career mode, which is still a destination mode, is largelyuntouched, and relegating the restored five-on-five Crews mode to pickupblacktop games is a missed opportunity. MyTeam, which is the 2K Sports version of EA's Ultimate Team, adds another tier of players, tournaments, and the ability to match up your team with a friend's.Onthe court, NBA 2K14 continues to improve its game. This year's primary changecomes in the form of a reconfigured right analog stick, which now handles alldribbling and shooting moves without the need for a trigger modifier. Thissystem works well once you learn the subtleties of switching between dribbling(where moves are activated by tapping the stick quickly in any direction) andshooting (holding the stick in any direction).Freeingup the trigger allowed Visual Concepts to surface freestyle passing. Pullingoff highlight reel no-look passes is as simple as holding the trigger andpushing the right analog stick in the direction of the intended player, thoughyour success rate is largely dependent on the skills of the passing player. Onthe other side of the ball, blocking shots is easier, and players defend offthe ball move with more urgency than in past iterations.Elsewhere,the on-court action needs refinement. Players clip through one another toofrequently when battling under the basket, balls warp strangely into playershands during some transition animations, and defenses tend to sink too far intothe paint, leaving perimeter shooters way too much room to operate.Like the superstar whograces its cover, NBA 2K14 features an undeniable sense of greatness. Itspresentation is the best the sports genre has to offer, and the gameplayrefinements improve an already stellar game. It's a shame Visual Conceptsdidn't put the same level of effort into improving the popular My Career or Association mode.", "date": "Oct 01, 2013", "grade": "8.5"}