{"name": "Rain", "ref": "https://www.gameinformer.com/games/rain/b/ps3/archive/2013/10/01/rain-review-game-informer.aspx", "text": "I dont know how Sonys united team of developers came up with the idea of a game full of invisible characters who can only be seen when theyre in the rain, but its certainly a creative starting point. Rain seems like it could be an art-house classic, but design decisions made along the way dont live up to the originality of the concept.Rains story begins with a boy waking in the middle of a rainy night. He dashes outside to help a ghostly girl in the street, and he soon becomes invisible himself and must help the mysterious girl while avoiding similarly invisible monsters. In the rain, all characters look like clear action figures. When out of it, they go completely invisible (except their footprints). Most of the game is a linear path through the city where you hide under shelter, wait for an enemy to pass, and dash to the next hiding spot.The mix of puzzle and stealth never evolves in a satisfying way. You make noise to distract monsters, then run the other way. Even when you start working together with the girl later on, you mostly push blocks around to clear her way or to stop an enemy. She can be slow at times, forcing you to wait around so you can team up to push something. Outside of a few unique locations, the world feels like one long slog through unremarkable gray alleys and streets.Rain tries to tug at the heartstrings, but I never felt connected to the characters. These two silent protagonists cant communicate outside of miming. Youre told whats going on via text narration integrated into the environment. Sometimes it offers insight into the characters thoughts, but many times it explains what you can already clearly see happening (e.g. The girl pointed at a light in the distance). The old adage show, dont tell could be put to great use here. The melancholy music sets the gloomy tone well, but its tasked with nearly all of the emotional heavy lifting. In the end, I still dont know who these kids are. Theyre just two people in a weird situation who stick together to try to escape. Just because theyre invisible doesnt mean they have to be empty.For more on Rain, watch our recent episode of Test Chamber.", "date": "Oct 01, 2013", "grade": "6.5"}