{"name": "Pro Evolution Soccer 2014", "ref": "https://www.gameinformer.com/games/pro_evolution_soccer_2014/b/ps3/archive/2013/09/24/pro-evolution-soccer-2014-game-informer-review.aspx", "text": "The PlayStation 2 heyday of the Pro Evolution series didn't transfer to this generation of consoles. Too many iterations rode the coattails of earlier versions or dinked with control changes instead of upgrading the graphics, for instance. The increased competition from EA Sports' FIFA franchise has also put PES in a weakened state. It may seem odd to make a major overhaul of your gameplay engine for the last iteration of this console generation, but it's better to take your lumps now and get your ducks in a row and not risk repeating history.I was most concerned about how dribbling, shooting, ball physics, and player interaction would feel with the new engine, and for the most part I'm satisfied because it feels like I expect a Pro Evolution game to feel. The ball moves separate from the players, the weight of passes and shots is excellent, and for the most part the wealth of commands at my fingertips are responsive. I encourage you to mess with the support assist settings to find out what mixture of automatic and manual controls you like best for shots, passing, through balls, teammate runs, etc. No matter how you configure them, the game gives you the tools to create some beautiful moments on and off the ball that you won't see anywhere else. The new Combination Play set strategy sequences are fun to tinker with to try and exploit defenses.Perhaps most interesting is the blending of the optional auto-feints system with normal touches on the right analog stick. Combined with player movement via the left analog, it allows you to produce skilled touches that help you escape opponents and keep possession without having to memorize a command list of special moves (although there are still those). You can similarly protect yourself and the ball by flicking the right analog stick in anticipation of contact. Both of these are absolutely necessary to retain possession.While I found controls like these easy to pull off in the run of play, I found others, such as sending teammates on runs, more temperamental. In the heat of the moment you don't want to send the wrong guy on a run, and when they are sent it would be nice if they would make an attempt to stay onside. Also, is it necessary to have a low shot require two button presses?While some of this complexity is nothing new for the series, returning fans may rue other aspects of this game, such as its reduced feature set. The day-in-day out schedule of the Master League has been thankfully condensed, but it is missing the equipment feature, staff hiring, and player conversation systems from last year. You can at least, however, coach a national team and/or switch club jobs from year to year. The Master League has taken a step back and must once again find a way to infuse some drama and personality into what is otherwise a sufficient experience.As far as the online version of Master League goes (all of the game's online features are available via a day-one patch), you can now thankfully implement a salary cap system, but overall PES' online features are less alluring than FIFA. Apart from bringing the Master League online, they have languished in their paucity of modes and lack the hook the keeps that series relevant year round.A lot of things could have gone wrong in the introduction of a new engine, but PES 14 handles the change well; it sacrifices little of the feel while introducing some new concepts that I hope stick around. While aspects like the bid to introduce emotion to players remains inconclusive and I'd like the developer refine its control scheme, for the first time in a while the future of the franchise is more exciting than its past.For more on the game's Combination Play strategies, check out this video.", "date": "Sep 24, 2013", "grade": "8.25"}