{"name": "Gone Home", "ref": "https://www.gameinformer.com/games/gone_home/b/pc/archive/2013/08/15/gone-home-review.aspx", "text": "Have you ever walked into someones house and got a sense of who they are? The objects we leave are remnants of the lives we lead, and they say more about us than we realize. Bedrooms are a portal into our personalities: old receipts reveal our interests, books showcase our passions, and the hidden things often mark our fears.Gone Home is The Fullbright Companys ambitious attempt to let objects tell a story without action-packed gameplay or heavy-handed cutscenes. It tests whether curiosity surrounding real-life issues is enough to drive an entire game, and is a great example of what video games as a medium can do with storytelling and what games can be. You control Katie, a woman returning home from a year abroad only to find her familys house deserted and a note from Sam, her younger sister. Within, Sam begs Katie not to worry and says she doesnt want anyone trying to find out where shes gone. Obviously, Katie missed parts of her sisters life while she was away and the only way to find out what happened is to search the house for answers. Thats the initial pull of Gone Home, but as you delve into the house, you find much more than that.The Fullbright Company clearly spent a lot of time crafting the setting; trophies are propped on a mantle, papers clutter tables, and family portraits hang in the halls. Set in the mid 90s, before cell phones and e-mail kept electronic records of lives, Gone Home has plenty of references to wax nostalgic over, like Street Fighter II, Kurt Cobain, and cassette tapes. What really drives the story are the notes, answering machine messages, ticket stubs, and other paper trails revealing whats happened to the family.Unfortunately, the developers showed their hand far too soon. I figured out rather quickly whats going on with Sam. Usually this would destroy a game based around discovery, but the plot has more to offer than just that single point; the how matters so much more than the what in this mystery.Looking at objects, even ones that offer no insight into Sams whereabouts, becomes an addiction. I left no stone unturned throughout the process, even doing small things like opening the fridge to see what the family eats. Upon finding an important object, Sam narrates what the item means to her. These moments have some of the best writing Ive seen in a game. Theyre set up like shes reading her diary, completely confessional, with genuine emotions. Often she comes to such a true-to-life statement that it stuck with me long afterward. When talking about a field trip, stick with the group comes to mean something more than I expected.While Gone Home is Sams story, smaller threads weave their way in. Investigating the parents careers and relationship is just as engrossing as discovering Sams story. The father is a writer, and you get glimpses into his successes and failures. You read letters from editors, and posted on a bulletin board is a desperate phrase, You can do better! In the end, the resolutions to these side stories are just as satisfying as Sams.Gone Homes biggest strength is how it tackles more complex and realistic subject matter than most developers would dare touch. The raw and honest writing is refreshing, providing something so different than the standard narrative. It may not last more than a few hours, but I never put the controller down because I was so captivated. When it ended, I wished I could play it for the first time again. It may blur the lines defining what you consider a game to be, but sometimes evolution comes from radical change. Go in with an open mind and come away with a story that says something real about the way we bond with people and how relationships impact our lives.", "date": "Aug 15, 2013", "grade": "8.5"}