{"name": "Bloodmasque", "ref": "https://www.gameinformer.com/games/bloodmasque/b/ios/archive/2013/08/12/bloodmasque-review.aspx", "text": "Square Enixs Bloodmasque has everything that successful mobile games often do impressive graphics, simplistic gameplay, and camera integration. The problem is  Bloodmasque is soulless. Its vampires-meet-Infinity Blade gameplay is completely derivative despite its competence, and the only thing more dangerous than a vampire sucking its victim dry are the mictrotransactions going after your wallet. The basic structure surrounding these vampire-hunting adventures is sound. You select your allies from other people playing the game, kill a slew of vampires, get the loot they drop, and level up to your hearts content. You take on missions with other players from four distinct enemy clans with varying bonuses. Being able to choose allies that give you more gold, more damage, or better gear depending on the situation is a nice touch, as its really the only strategic decision you have outside of picking the best equipment.Square Enix obviously took a few pages  perhaps even an entire volume  from Epics Infinity Blade. Combat is straightforward: tap on the screen to attack, swipe left or right to dodge, and after striking your opponent enough, unleash a super attack. Unfortunately, the simplified battles mean that repetition creeps in much quicker than it would otherwise. Tap-tap-tapping becomes mindless and theres little time penalty for repeatedly dodging, so even if you dont get a counter-attack by timing it just right, you can spam dodge to keep from being hit. Missions also are extremely repetitive; you accept them, fight some weaker vampires, and hit a boss that has two forms  Bloodmasque hardly strays from that formula.However, Bloodmasques loot system is even more exasperating. You use two different currencies: gold is earned via quests and selling equipment, and rubies are obtained when you level-up or by spending real dollars. Rubies are so rarely earned that youre essentially forced to throw down real money much more often than you should. Want extended timers for opponents? A restart after falling in combat? Get your credit card.The worst offender is how Bloodmasque handles its equipment. You acquire every single piece of gear that falls off of your vampiric foes, but the quality of that equipment is determined by the kind of stake you use to destroy them. Wooden stakes are in infinite supply, iron stakes are better by a slim margin and cost in-game currency, but gold stakes use rubies  and theyre not cheap. After spending $7 on a mobile game, its insulting that a single gold stake costs $3 to buy or requires a huge time investment to earn. This might make sense if Square Enix released this game as a free download, but having microtransactions forced down your throat after paying a premium in the first place is absurd.Square Enix put in one fun feature that lets your character, and other human allies, select either default faces or those entered in via the devices camera. The idea is to create a character with your face, but I was unable to make a decent-looking character, and most others looked just as bad. The best part was completely unintended by Square, though  I fought vampires as a 7-up bottle, a cat, and a Cheez-Its box. Seeing what other people online did with their creativity was great, too.Another unfortunate feature is that the game requires a dedicated Internet connection. Mobile games are usually played on the road, where internet is not always available, so this is baffling. What if youre on an airplane without internet? Playing while in the car? I lost progress when halfway through a mission my Internet went out and the game instantly cut me off. For a game meant to be played at ones convenience, it is hardly accommodating. If you dont have a stable internet connection or know you will be offline at points, do not even think about Bloodmasque.Thats not the only downside to the performance  I initially installed Bloodmasque on my iPhone 4 (Im waiting for the next model). The framerate was so terrible that I couldnt even get past the games second battle. Looking at the requirements on the iTunes page, it even lists the iPhone 3GS and original iPad  devices that cant run the game at all. This is more than a little deceptive, so if youve got an older device, beware.Had Square Enix stripped Bloodmasque of its microtransactions and left it as a whole game for $6.99, Id still be leery to recommend it because its so generic. The base gameplay is mildly entertaining, and while the production values are superb, it doesnt have a fantastic story or quality voice actors to take full advantage of them. Throw in the in-game purchases, the slow, repetitive grind, and the always-on internet requirement and all thats left is a pile of potential with little else going for it. Decisions made by Square Enix to keep Bloodmasque profitable are the same ones that keep it from being particularly fun.", "date": "Aug 12, 2013", "grade": "6"}