{"name": "Shin Megami Tensei IV", "ref": "https://www.gameinformer.com/games/shin_megami_tensei_iv/b/3ds/archive/2013/07/16/shin-megami-tensei-iv-review.aspx", "text": "How much willpower do you have? Can you jump from battle to battle hundreds of times, staying one step ahead of the enemy without slipping? Do you explore every inch of an area just to find a hidden destination or treasure? Do you thrive on a maddening level of challenge? This is the essence of Shin Megami Tensei IV. It tests your perseverance in a demon-cluttered world, but it also forces you to make difficult choices between law and chaos  then makes you evaluate your confidence in your beliefs. The core of SMT is the harrowing struggle to survive, but the series has also never hesitated to ask tough questions or tackle difficult subject matter. This entry is no different. It presents a dream of different worlds: one with social structure and everlasting peace, and another where the strong dominate. These ideals represent SMTs law and chaos dichotomy.After being chosen to be a samurai of the Eastern Kingdom of Mikado, your character meets two other samurai, Jonathan and Walter. They represent the law and chaos ends of the spectrum, and attempt to sway you to their side as youre presented with choices. Should you keep a demon alive or slay it? Jonathan and Walter have different opinions, like an angel and a devil on your shoulders. The downside to using characters to embody different ideals is that they dont feel like real people - they exist mainly to represent different sides of an issue. Uninteresting characters can be a death sentence for an RPG, but it works here because the most compelling parts of the tale are the decisions you make along the way. Atlus does a good job at showing each viewpoint as a shade of grey and forcing players to think beyond just whats statistically optimal and expands into the philosophy of existence. Questions about religion, hierarchy, and humanity and whats right abound. Is singling people out because theyre different okay if their differences give them an advantage over others (like tall basketball players)?Simply pondering the issues is entertaining, but seeing how your choices impact the story provides the most fulfillment. The law and chaos routes arent about good or evil; unfortunate circumstances arise no matter what you choose. I thought I was going to follow law, but many times I found myself conflicted, even siding with chaos on occasion. Events play out differently depending on your choices, and the consequences are anything but ordinary. In fact, they can be downright twisted. These decisions, like sparing or killing a person, ripple throughout the experience; seeing the consequences your actions create is mesmerizing.At the 20-hour mark, tougher questions start presenting themselves and the narrative picks up steam. For example, two groups handle demons in different ways; the Ashura-kai have a leader who has decided to work and coexist with the demons, while the Ring of Gaea believe in free will and survival of the fittest, regardless if the strongest is human or demon. You can side with either group, but the whole time the game is presenting an Adam/Eve decision. Will you be tempted by complete free will, or blindly follow orders? What price will you pay for doing either?More cutscenes could have better augmented the emotions of your discoveries. I wont ruin any surprises, but seeing how a certain group keeps its mission going is downright demented  though it could have been presented better. Static images and minor text accompany many of the shocking revelations, deflating the intensity.Between story moments, youre trekking through dungeons, recruiting demons, finding treasure, and taking on side quests. Battles play out traditionally, selecting actions for your main character and demons, while one human party member is AI-controlled. Exploiting weaknesses and landing critical attacks grants you extra turns, making it a key part of victory. However, the enemy can exploit the same systems, leaving you at a disadvantage. The system is simple but keeps you paying attention and strategizing to get the maximum use out of each turn; its one of the best traditional systems around.Creating a balanced party is equally important, and thats where demon recruitment and fusion comes in. Fusing different demon types so your party has diverse skills and strengths and weaknesses is essential, and the most engaging part of the gameplay. Finding new demon fusions and seeing the skills you can transfer over to them becomes an obsession; as soon as I gained a level, I looked to see which demons I could create.Battles are punishing  especially if you cant compensate for your weaknesses or let the enemy get the preemptive strike  but rarely do battles feel unfair. If I lost to a boss, it was usually due to my strategy and equipped demons. You arent backed into a corner with demon selection, and can easily fuse new demons in dungeons to adjust your tactics.While the battles didnt frustrate me, figuring out where to go next did. Directions are cryptic at times, causing you to wander. Talking to a specific NPC might give some guidance, but other times you have to figure it out yourself  a process made harder by a high encounter rate in dungeons and the overworld. The amount of backtracking is also a major issue. A destination marker would have eased the guessing games, as back-alley passageways or secluded stairways are easy to miss in the urban sprawl.Regardless, SMT IV is still hard to put down; it puts enough small decisions in your hands to stay entertaining. For instance, you can transfer abilities from your demons to your main character, though youre limited to how many you can equip. Additionally, as you level up, you get points to disperse into different perks, like restoring MP between battles. Even during boss battles, demons taunt you with questions, and your answers provide perks or drawbacks.Despite its shortcomings, SMT IV is a handheld adventure that RPG fans are sure to embrace for hours on end. While it doesnt go in too many new directions, it makes some bold story moves that kept me reflecting long after I stopped playing.", "date": "Jul 16, 2013", "grade": "8.5"}