{"name": "Magic: The Gathering - Duels of the Planeswalkers 2014", "ref": "https://www.gameinformer.com/games/magic_the_gathering_-_duels_of_the_planeswalkers_2014/b/android/archive/2013/07/11/magic-the-gathering-duels-of-the-planeswalkers-2014-the-freedom-to-build-your-own-decks-is-finally-here.aspx", "text": "Now in its fourth iteration, Magic: The Gathering  Duels of the Planeswalkers has found its place in Wizards of the Coasts storied franchise. What was initially viewed as a simple standalone, pay-once translation of the grandfather of collectible card games is now the best entry point to the game. Magic isnt easy to learn without a good tutor, and the training battles in this title fill that role well. I already know the mechanics, but my nine-year-old daughter picked up the basics quickly and is now eager to move onto my physical decks (proving out Wizards of the Coast's approach to this branch of the brand). Giving players an understanding of the card types and then letting them loose to finish the sample battle is a smart way to teach critical concepts.Once through the tutorial, players are treated to a campaign that takes place across five different planes. Each area contains a set of thematic encounters where the enemies make the same plays every time. This is one area that's been improved this year, as your opponents have more flavor. For instance, you face off against a deck focused on zombies and other undead creatures as the story details fetid marshes. These thematic moments offer a thin narrative thread, assisted by the motion-comic cutscenes featuring familiar Planeswalker Chandra Nalaar.At the end of each area is a mini-boss and a battle with another Planeswalker. These play out as more traditional (and challenging) battles, with both sides randomly drawing from the deck. You can unlock more of the 30 additional cards by replaying these battles, but the tedium from the grind may not be worth the flexibility you gain.As in past years, the 10 constructed decks in campaign and multiplayer have limited customization options. Unlockable cards can be used to tune their associated deck, but not fully remake one out of the available 151-card pool featured in Duels 2014. Im not fond of having to unlock the additional cards or the limits this places on customization. However, for the impatient among us, decks can be fully unlocked for an additional fee. This has been a sticking point for many players over the years, and developer Stainless Games has added something new for fans.Last year's Planechase format is out, with a new Sealed mode replacing it. This is by far the most interesting offering. Players start with six boosters of fourteen cards each. Decks in this mode are typically smaller (40 cards), and the tools available for construction are fantastic. As you add cards to the deck, the display shows converted mana cost on a curve, the synergy of the included cards, and recommended land distribution. If youd prefer to avoid manual construction, the computer can automatically assemble the strongest deck or build around one or more chosen cards. There is an abbreviated campaign associated with Sealed mode that unlocks three more boosters to diversify the pool.Each set of 84 cards is completely random, and players can go through the deck creation twice with different pools. Should players wish to take advantage of additional sealed pools, they are available for $1.99. This is a blatant grab for additional revenue, and quickly quells the joy of opening packs. Decks can be wiped and reconstructed at will within a pool however, which allows for some experimentation.Both constructed and sealed decks can be taken online, but my experiences weren't perfect. Members of the community are experiencing multiplayer issues of varying severity; I had some matchmaking problems, and my opponents dropped out mid-game more than once. I wasn't sure if it was because I was winning or because of connection issues, but its frustrating regardless. Thankfully, matches continue with an AI opponent filling in.Challenges return to hone higher-level skills. These scenarios are the equivalent of football's two-minute drill. Each tasks players with winning the game in one turn, often under seemingly insurmountable odds. These logic puzzles are some of my favorite inclusions in the annual series, and they continue to entertain here.In addition to standard dueling, offline and online options for two-headed giant (two teams of two players sharing turns and a life pool) and free-for-all (a two- to four-player mode that is both chaotic and fun) are available. These are enjoyable variations, but they lose something in the digital format. Table politics and the wince of inevitable betrayal just dont translate.Duels of the Planeswalkers isn't the full Magic experience. It's a taste of the broader landscape to entice players and make them more comfortable attending a casual Friday Night Magic event. If you're new to Magic: The Gathering, Duels of the Planeswalkers remains the best way to learn how to play without the intimidation of other players. Even with the online connection issues and additional purchases tied to making the most of Sealed mode, this is the best version to date. It's easy to recommend for new players just learning and veteran spellslingers looking for new single-player matches.", "date": "Jul 11, 2013", "grade": "7.5"}