{"name": "Muramasa Rebirth", "ref": "https://www.gameinformer.com/games/muramasa_rebirth/b/playstation_vita/archive/2013/06/25/muramasa-rebirth-review.aspx", "text": "As an HD port, Muramasa Rebirth does its job. It takes the Wiis Muramasa: The Demon Blade from 2009 and brings it to the Vita with a handful of improvements. However, the source material that serves as the foundation is far from flawless. Just because this is an accurate reproduction doesnt mean that the game at its core has gotten any better with age. Muramasa lets players choose one of two playable characters  Kisuke and Momohime  and slice through feudal Japan in fast-paced 2D action. Each character technically has a different story, but plot development is a minor aspect of the experience. Instead, the emphasis is placed squarely on exploration and combat. Kisuke and Momohime control exactly the same, with no unique abilities. They also visit the exact same areas (in a different order), so the choice between characters is ultimately superficial. You see most of the same content, except you fight different bosses and read different dialogue.The new translation is the most noteworthy bonus that Muramasa Rebirth delivers. It gives the characters more personality than the previous localization, and makes the story more understandable (but not much more important). The stunning art direction also benefits greatly from the re-release; the amazing character designs and backgrounds are better than ever on Vita. I would regularly stop my in-game activities to admire the beautiful artwork, vivid colors, and impressive animation.I wish Muramasa played as great as it looks. Like its original incarnation (read the review here), the combat is entertaining at first, but wears thin over time. The mechanics are responsive and feel natural (especially since you can remap the buttons in this version), and making lightning-quick switches among your three equipped swords forces you to pay attention to the action. Unfortunately, your repertoire doesnt change. The frequent combat encounters are too repetitive when youre basically fighting the same enemies using the same moves. Forging new swords with different special attacks helps alleviate the tedium, but all of the swords fall into three basic categories, so even that doesnt add enough variety.Combat isnt the only place where Muramasa gets repetitive. Long segments of backtracking remain, forcing players to take long, uneventful treks through conquered areas in order to progress to the next section. Dont expect any kind of fast travel option, either. No matter how good the environments look, I dont want to run back and forth through the same forest multiple times.The most dubious advantage of this Muramasa Rebirth over its predecessor is the opportunity to spend even more money. DLC featuring new playable characters (each with their own additional stages) will be available at some unannounced point in the future. When youre re-releasing a four-year-old game, withholding new content of that magnitude just feels like a cash-grab rather than a service to fans.Muramasa Rebirth is exactly what developer Vanillaware intended it to be: a better-looking version of the 2009 release. However, achieving that goal doesnt make Muramasa any more entertaining today than it was back then. Yes, the art and animation are even more gorgeous, but none of the core design problems from the original version were addressed. The result is a familiar experience that feels both faithful and flawed.", "date": "Jun 25, 2013", "grade": "7"}