{"name": "Batman: The Telltale Series  Episode 2", "ref": "https://www.gameinformer.com/games/batman_the_telltale_series__episode_two/b/xboxone/archive/2016/09/19/bloody-fascinating.aspx", "text": "After completing the first episode of Telltales Batman series, I questioned why it was rated M for mature. A few broken bones and a squirt of blood are a little more gruesome than we typically see in Batman stories, but didnt come close to fitting the rating. The second episode, Children of Arkham, shows us why you should hide this game from your children, and why you should give this series another shot, even if you thought the premiere was a snooze-fest. The first episode spent too much time establishing characters and motives, but episode two lets the bullets fly, and they dont miss their intended targets. This chapter is dark, and is loaded with shocking moments and riveting character twists.In episode one we learned that Bruce Waynes father may have been in bed with Gothams biggest crime families. This puzzling revelation is further explored, but ends up being a secondary story thread to the arc of Oswald Cobblepot, who is more of a ruthless terrorist than a waddling underworld boss. Comic book villains often talk big games, but how much bite do they really have in those stories before they are locked away in Arkham Asylum? Telltale gives this version of Penguin a voracious appetite for chaos. This take is alarming, but also one Ive never seen for this old-school character. He's mesmerizing and the best part of this episode.Harvey Dents campaign to become Gothams mayor is still a big hook, but dont worry, Telltale appears to be done with boring fundraisers and rally speeches. The political landscape is the vein that bleeds into the other conflicts at hand, of which there are many, and they all have a nice pulse in this episode. An air of uncertainty hangs menacingly over all of it. For Batman fans, Im getting a Long Halloween vibe from this story, and yes, thats a great thing. Batman is once again used sparingly, but I hardly noticed it considering how quickly the plot races ahead. Bruce is front-and-center most of the time, and you are even given a choice to continue playing as him instead of Batman in one critical story moment where mayoral candidate Hamilton Hill needs to be questioned. In no universe did I ever think I would want to play as Bruce instead of Batman, but I happy did to make the story flowed the way I wanted it to. The choices flow naturally in this episode, and while a couple hold ~no-win~ qualities, none are jarring or feel like they are forced into the narrative.As vastly improved as this episode is, it does have some moments that made me roll my eyes or laugh. In one scene in which Bruce visits the site of his parents murder, we learn that hes repressed memories of the event for over 20 years  even though he replays that moment over and over in his head. Realizing that hes done this, he suddenly remembers everything. Its a cheesy moment that is made far worse by this series take on Alfred, a character who looks like hes here just to try to make Bruce cry. Hes always prodding him about his emotions and trying to make him reflect on terrible things. Another puzzling moment is when Bruce says I better keep a low profile, but then proceeds to hang out in a crowded bar. He is rightfully attacked seconds later.Some of the logic is a little puzzling, but the bigger picture that is established is something to behold for Batman fans. The dialogue for all of the characters (sans Alfred) is fantastic. I especially love Hill telling Bruce that Nobody born into a pile of crap that deep can be clean when his integrity is questioned.Telltales Batman looked to be a disaster in the making that didnt quite grasp the Batman source material, but is now shaping up to be a unique take on this beloved character that everyone should play. ~Wow moments are plenty in this episode, and they hit you when you least expect them. Best of all, this story makes you think about Batmans storied history as much as it wipes the canvas clean to tell a new tale with faces youve never seen before.", "date": "Sep 19, 2016", "grade": "9"}