{"name": "Deadpool", "ref": "https://www.gameinformer.com/games/deadpool/b/xbox360/archive/2013/06/25/slayed-by-the-merc-with-a-mouth.aspx", "text": "Deadpool knows hes in a video game. After refusing to read the games script  opting instead to draw pictures of Wolverine and busty women on it  he dives headfirst into the experience High Moon Studios crafted, but he isnt exactly a willing participant. He frequently breaks the fourth wall to communicate with the player, barking complaints about the gameplay, level designs, and mission objectives. When Deadpool loses interest or sees something he doesnt like, his imagination takes control. The game changes to fit his immature, offensive, or twisted whim. In one stage, he replaces famed X-Man Cable with a big-breasted woman who is his biggest fan. Some of his changes draw the ire of High Moon Studios; the game director calls him on the phone to complain about spending too much money on a scene filled with explosions, death, mass destruction, and effects galore.I wish I had Deadpools power to complain within the game and cry out for more entertaining experiences. The game High Moon Studios created puts Deadpools wild persona in the spotlight, letting his mouth spew shocking words and his hands perform even fouler actions. Hes every bit the loose cannon he is in Marvels comic book universe. He favors crude jokes about male genitalia and talks about the little Deadpool in his pants at an alarming rate. Voice actor Nolan North nails the role of Marvels odd super-mutant, giving the voices in Deadpools head distinction, and his main voice captures the grating and annoying tones I always thought he had when I read the comic books.Spending a significant amount of time with Deadpool is one of the biggest challenges. Sure, he spits out legitimately funny lines occasionally, but hes always talking and complaining and saying ridiculous things, much like an annoying grocery-store clerk who wants to talk about every item you are purchasing. I turned the game off twice because I needed a break from Deadpools mouth.Moments of brilliance are tied to his gun-fu. Combos seamlessly blend the slicing and dicing of swords with forceful shotgun blasts. Arkham Asylum-like counters can keep the strings going for hundreds of hits. Deadpools movements are fluid and followed up with buckets of spilled blood. Putting together these impressive strings relies on by-the-numbers button mashing, repeating the same combo commands for all three melee weapon types. I called upon the same combos for most of the game. The upgrade system is successful in making the weapons and their wielder more powerful, but doesnt offer much in terms of expanding Deadpools acrobatic arsenal.The repetition in moves collides unceremoniously with repetition in enemy types. Deadpool is opposed by waves upon waves of clones. When new enemies are introduced, many are enhanced versions of the same types, wielding a shield or a new power. Flying enemies are nuisances not just from their ability to rain blasts upon Deadpool when hes engaged in melee, but because of the shoddy targeting and lock-on systems he uses to take them down.High Moon didnt just craft a brawler; the player can switch to running and gunning at any point, usually to dispatch foes at great distances or in sections where every foe is using some form of firearm. The gunplay is as crude as the melee. Successfully targeting enemies entrenched behind cover is a crapshoot  sometimes it works, sometimes bullets hit an invisible barrier, sometimes the enemy AI freaks out and maneuvers wildly to different positions. I never felt like I mastered the firearm action. Frustration and luck drove almost every trigger squeeze.The gameplay cocktail High Moon forged falls apart more and more with each passing level. What starts as a game where Deadpool and his hundred-plus hit combos command the battlefield eventually becomes a war of desperation, where button mashing and hasty retreats are commonplace. The final boss battle is maddeningly unfair. The big bad can down Deadpool quickly, even if he has his combos working for him.When I finished this game, I walked away unfulfilled. After a weekend away from it, I found myself chuckling over the crazy things Deadpool said and did. His obsession with Wolverine is particularly funny. The memories I took away from the game were worth the time I put in, even if playing it was a chore. I wouldnt say it falls into the its so bad, its good camp, but like a cheesy Nic Cage movie, it sometimes hits the right comedic notes, but it just doesnt hit them enough.", "date": "Jun 25, 2013", "grade": "6"}