{"name": "Prime World: Defenders", "ref": "https://www.gameinformer.com/games/prime_world_defenders/b/pc/archive/2013/06/05/review.aspx", "text": "A colorfully animated tower defense with a decent card-collecting progression hook is exactly the kind of game that I will always make time for. Unless, of course, the developer decides to crap it up with a brutal random-mission grind that might as well be ripped from a second-tier Korean MMORPG from the early 00s. Nival chose that path for Prime World: Defenders, and it sucks all the joy out of an otherwise competently executed title.Prime World: Defenders hits every tower-defense trope in approximately the same order that weve seen those concepts introduced time and time again: slow, regenerating enemies; fast, weak enemies; flying enemies; enemies that turn invisible; enemies that break apart into more enemies; and big boss enemies. The tools you use to stop their advance are the same as always. Figuring out the right balance of single-target versus anti-air, slowing, area-effect, and long-range towers to combat each wave is a fine diversion. Unfortunately, the challenge never finds the sweet spot between tension and reward.The root of the poor balancing is how everything in Prime World: Defenders flows from your card collection. Completing levels earns you new cards, which represent towers and magic spells. Fusing and evolving those cards unlocks more damage, higher tiers of towers, and additional effects like better range or better slowdown. Increasing damage output is the real draw, as a leveled-up tower could do twice or more damage than a basic version  especially for rare and unique towers that have a higher level cap. The difference is stark; Ive gone from an early, unavoidable loss to waltzing into a perfect completion after a single round of upgrades.After a handful of introductory levels, each story mission requires grinding through multiple random battles to obtain the resources you need to improve your card collection to the point that the battle is possible. The process is glacial; you have a single chance to win a new card after each three- to ten-minute match, and multiple cards must be sacrificed to boost your main towers abilities. Worse still, those random matches require hardly any strategy and carry little risk of failure. The end result is an enforced period of intense boredom with few rewards, after which you unlock the next story level only to repeat the process.The randomized gameplay rewards and horrendous grind are reminiscent of a badly designed free-to-play game that uses tedium to encourage players into spending money on skipping it. The lack of a real-money currency for buying booster packs here may be less exploitative, but its not any more fun.Prime World: Defenders had an exceptionally low bar to clear to get me on board, but the staid design and brutal grind managed to miss even that simple goal. Because the power differential between basic and improved cards is so great, the difficulty ticks over from impossible to trivial out of nowhere. Neither extreme is much fun, and unfortunately neither is Prime World: Defenders.", "date": "Jun 05, 2013", "grade": "5"}