{"name": "Fuse", "ref": "https://www.gameinformer.com/games/fuse/b/xbox360/archive/2013/05/27/review.aspx", "text": "For over a decade, Insomniac has proven itself to be one of the industrys leaders when it comes to creating unique weaponry. Across numerous Ratchet & Clank and Resistance titles, the star of the show has typically been the varied tools of destruction. This trend continues in Fuse, a solid new IP with several annoyances sprinkled throughout.If youre interested in playing Fuse, you should absolutely make playing with friends a priority (either online or via its split screen mode). Much of the appeal comes from the ridiculous combination of four super-powered weapons. Jacob shoots flaming crossbow bolts that explode into scalding mercury, Naya tears enemies apart with a gun that creates black holes, Izzy crystallizes enemies with her rifle, and Dalton tosses enemy ammo back at them with his powerful Mag Shield.When four humans are taking on waves of enemies, its often hilariously chaotic. Black holes create chain reactions, bodies melt away, and so many helicopters crash. Frequent moments of crazy action are fun for a while, but it eventually becomes routine. Destroying the same small variety of standard grunts, shielded enemies, helicopters, and larger mech enemies (all controlled by the games mediocre AI) can only stay novel for so long.Playing by yourself, its a soulless experience. Utilizing the leap mechanic, youre able to inhabit any character you want at any time. This doesnt alleviate the problem of having three brain-dead AI partners standing alongside you, however. Without having a few friends on the couch or laughing with you over a headset, the shootouts seem muted.Amplifying the level of destruction is the upgrade system, which looks more promising than it is. This tiered series of combat enhancements seems cool at first, with bonuses that power your grenades with the volatile Fuse element, unlock powerful Fusion abilities that grant infinite ammo, and add homing tendrils to your grenade blasts. I was excited to see the different skill trees offered to each character, but was disappointed to learn that theyre all very similar. Giving each character a unique Fusion ability at the end of the tree would be a nice reward, but theyre all saddled with the same bonus.At roughly seven hours long, it seems like a game that should be ripe for replayability. There are four different characters to level up, and plenty of collectibles to go back and find. Unfortunately, you cant skip cutscenes, even if youve seen them plenty of times. Id be much more inclined to jump into a quick mission with some friends if I knew I didnt have to watch the same scenes over and over again.If youve beaten the game and want to level your characters without rewatching these cutscenes, the Horde-like Echelon mode is the perfect arena. With several maps that feature huge waves of enemies, its a great way to hop in and blast baddies without being saddled with the mediocre story. However, it doesnt add any innovation to the basic Horde mode formula; its main use is just grinding levels.I left Fuse with several frustrations sticking in my head. I was bothered by the cutscene situation, the basic AI (both friendly and enemy), a couple of glitches that forced restarts, and the dramatic change in fun factor when playing solo. That said, I cant deny that I spent a lot of time laughing while playing with three others. If chaotic, over-the-top shootouts are your thing, theres plenty to like in Fuse amongst the frustrations. Just be sure to bring some friends along for the ride.", "date": "May 27, 2013", "grade": "7.75"}