{"name": "Badland", "ref": "https://www.gameinformer.com/games/badland/b/ios/archive/2013/05/01/badland-review-elegance-through-simplicity.aspx", "text": "Badland is controlled by only pressing a single finger against the screen, but it defies easy classification as yet another simplistic mobile title. Developed by two of the minds behind Trials Evolution, Badland shares many traits with the obstacle-course mentality of that excellent game, but transposes the experience from a dirt bike track to a weird alien world. Your motorcycle is replaced by a bulbous floating bat creature. Players navigate this oddly cute animal through one full day in the jungle, slowly unraveling its mysteries, and marveling at the intricate physics simulation. Things start off in a straightforward manner. Hold a finger to the screen, and your fat bat flaps its wings and moves forward. The screen immediately scrolls to the right, and the race is on; get left behind, and youre back to a checkpoint restart. Jutting spikes, spinning blades, falling rocks, and other obstacles are the primary challenge. Sometimes those objects kill you outright, or other times they just halt your progress until the screen catches up with you. Each stage ends as your bat is sucked up through a tube and sent on to the next area. The backdrop changes over time, since the levels are each split into different times of the day, eventually taking you from a lambent dawn all the way through a twilit night. Each level is designed to test new abilities, and a seamless difficulty curve constantly ups the challenge. Even after finishing a stage, you get three special goals to go back and shoot for on replays, adding a new layer of difficulty once you complete the whole game.Pressing the screen and flapping your wings might grow tiresome as a mechanic if it werent for the myriad ways that Badland changes up the experience through power-ups found in each stage. One pick-up makes you grow larger, and the physics of your flight change in response; you feel heavier and more unwieldy, but youre more able to push heavy objects. Another object changes your speed, letting you zip past a crushing rock before it falls. Most importantly, many pick-ups create one or more clones of your creature, all of which take on the properties of any pick-up that just one of them acquires. Cant squeeze your flock of gargantuan bats through a tight space? Maybe you can allow a few of them to drop down and pick up that shrinking power-up near the spinning blade  sure, those few wont make it back, but the rest of the team bustles forward.By combining smart level design and careful power-up placement, Badland is about path planning and quick reflexes. Players cant relax into familiar methods, since the physics of movement and navigation are constantly in flux. Generous checkpoint placement rarely sends you too far back, but plenty of trial and error is required to overcome an obstacle. In fact, one of the only things I dont like about Badland is that some deaths really come out of nowhere, making it almost impossible to succeed on some levels through the skills you bring to that stage. I wish that careful observation always offered a clear clue about what to avoid in the coming landscape.While Badlands gameplay arc is great fun, its made better through evocative art and sound. The shadowy outlines of objects in the foreground are juxtaposed against vivid forest backdrops, where skittish animals occasionally peek out from their holes. The naturalistic soundtrack is mesmerizing, but things never sound or look so strange that you dont understand them  theyre always just bizarre enough to reinforce an otherworldly quality.If youre looking for a more casual experience with Badland, the shared-screen multiplayer mode makes for a great party game. Four players can huddle around the screen to tap a quadrant, each struggling to surge ahead of the other players creatures and leave them behind. All the mechanics and power-ups in this game mode remain the same as in single-player, but the tone of play is far more frantic and less focused on observation. Because of the simple controls, anyone can hop in and give it a try.As you flip through the menus of Badland, its hard to miss that the entire game campaign is labeled as Day I, while a tantalizing Day II option is listed with a Coming Soon banner. No matter what Frogminds plans are for subsequent downloadable add-ons, the existing game is one of the most refreshing and robust adventures on iOS. Without any of the microtransaction complications that so characterize the mobile scene right now, Badland stands apart as a world that draws you in completely and immerses you in its charms free of distractions.", "date": "May 01, 2013", "grade": "8.5"}