{"name": "Pro Evolution Soccer 2017", "ref": "https://www.gameinformer.com/games/pro_evolution_soccer_2017/b/playstation4/archive/2016/09/13/game-informer-pro-evolution-soccer-2017-review.aspx", "text": "I generally hold the Pro Evolution series in high regard. Some years I may have thought the controls were needlessly complex, obscuring the larger gameplay, or wished the career or online modes were more substantial, but I understood and appreciated what was being attempted. PES 2017 crosses that line between an object that is admired and respected to one that is purely loved. The title is not perfect, but its gameplay is so natural that it feels like there's little between you and what happens onscreen. It's modes aren't complete, but they are absorbing. Like anything that is loved, the answers may be incomplete but the feeling is total.Gameplay has long been a strength of the franchise, but this year what stands out is how the controls and animations that govern what you see on the screen don't act as filters that translate your intentions. They rarely get in the way of what you want to perform on the pitch and what you expect to see. Thus, I'm not getting stuck in animations for as long, and I'm not even using some controls as much, such as double tapping for a standing tackle, since I can trust the game to resolve possession naturally.Sports games often add animations from year to year, and while PES 2017 is no exception, the game does so without sacrificing any of control or fluidity. One of the noticeable areas for new animations  physicality between players  goes hand-in-hand with another improvement for the title: better refs. Whether it's a player finishing off a crunching tackle, clipping a player's foot and getting him slightly off balance, or the flailing aftermath of two players contesting a header, the outcomes are not only cool to see, but fair. PES 2017 strikes a great balance of calling the fouls you expect to see without going overboard. Speaking of fixes, goalkeepers' saves are vastly improved and similarly balanced correctly  a massive improvement.A revelatory demonstration of the game's controls, animations, and reffing occurred when I contested a loose ball. I performed a standard tackle like I would have done last year in anticipation of the other player getting the ball. I ended up stepping on my opponent's foot as a result and getting a foul. If I would have trusted the game instead, I would have won the ball and never gotten the foul in the first place.Apart from the joy of controlling players, PES 2017 engages your inner manager through the new Advanced Instructions. These augment the usual normal preset tactics and are easy to implement. I can't tell you how smart it feels to switch tactics and open up play after being stymied by your opponent. I even became attuned to which players on my team were better suited toward which instructions. Additional maneuvering is possible through the new attacking and defending strategies for corners that create more movement and chaos in the box.Just as enhancements in a few areas make a big difference in PES 2017's gameplay, the Master League career mode continues to improve. Separate transfer and wage budgets, the ability to set transfer policies for your players, and different loan periods enrich the mode. I also like that transfer deadline day is broken down into hours, with each action performed taking time. Thus, it pays to plan your moves weeks in advance versus trying to address team needs at the last second.While it's nice to see players adapt to being moved to new positions and being able to see exactly which attributes are affected by the expanded training options, I still don't fully understand how form is calculated in Master League. Furthermore, the mode needs to have a player morale system to reflect the personalities of footballers  an important component of the sport and putting together a squad.In MyClub assembling your dream team is easier thanks to the new auction system that allows you to find, buy, and combine agents and scouts to pull specific players. This system doesn't sacrifice the mode's overall mystery but lets gamers attain the players they're looking for.Previously Pro Evolution has produced sublime moments on the pitch that felt like a big payoff, such as a wonderful strike for a goal. Those still exist, but they aren't in isolation. That feeling of jubilation happens all over the pitch and in the game, in moments big and small, and it increases when you realize that this is your game to control. Your game to conquer.PS4 vs. Xbox OneLike last year, PES 2017 on the Xbox One doesnt look as sharp as its PS4 counterpart, and it also lags behind because it doesnt allow you to use option files. Option files allow PlayStation and PC users to import fan-created files to re-create teams real-life uniforms  very handy since the game doesnt have licenses for some well known teams and leagues. Check out our how-to-guide on option files here.This review pertains to the PlayStation 4 and Xbox One versions. It also appears on PC.", "date": "Sep 13, 2016", "grade": "9.25"}