{"name": "Terraria", "ref": "https://www.gameinformer.com/games/terraria/b/xbox360/archive/2013/04/18/terraria-review.aspx", "text": "Some people like to take a new box of Legos and scatter them across the floor, then start building whatever comes to mind. Others like to take those same Legos and look at the instruction manual, carefully piecing together the elaborate creation featured on the front of the box. Terraria was designed for that first set of people, and those in the second camp may feel easily lost in Terrarias expansive free-form worlds.The elevator pitch for Terraria could easily have been its Minecraft in 2D, and the similarities between the two games are obvious from the beginning. In Terraria youre dropped into a vast, randomly generated landscape and given free rein to explore, collect materials, and craft an endless sea of tools and items that help you continue the cycle. The big difference between Minecraft and Terraria is that everything is made out of squares instead of cubes, which makes the world more of a 2D picture than a living 3D world.Even though you can still build in Terraria, it is more about exploring than sculpting, and the diverse biomes ensure you are always seeing new things. Your starting forest has plenty of wood-yielding trees, but you also want to acquire the resources locked within Terrarias sand-filled deserts, snow-capped mountains, and corrupted forests (which hold some of the rarest metals and deadliest creatures). You may also find floating islands in Terrarias star-filled sky, but digging through layers of soil is the biggest draw. As you tunnel through Terrarias resource-scattered world, you find pockets of rare ore, buried chests filled with priceless tools, and hordes of unique enemies to combat. My favorite pieces of equipment include magic mirrors that teleport you back home, rocket boots that let you briefly take flight, and potions that allow you to breath underwater. Acquiring these items and armor is rewarding in itself, but a couple of boss monsters give you goals to aim for as you power up your character. Unfortunately, Terrarias massive size makes is intimidating to newcomers, and the game does a poor job explaining most of its mechanics. You wont know what you can create until you have the resources to craft that item, and even then you need to create it to find out what it does. Some people find this kind of exploration exciting, but I think it is tiring and frustrating. An in-game crafting tree or list of items and their uses would have helped immensely. Fortunately, all of that information can be found online; once you start digging into Terraria you should keep one of the games online wikis bookmarked for constant reference.The other big problem with the console version of Terraria is its control scheme. Since Terraria originally released on PC back in 2011, it was designed with PC inputs in mind. Re-Logic has done a commendable job adapting the controls to a gamepad, but not everything translates perfectly. An auto-targeting system now directs your cursor, but you can still access the manual cursor by clicking down on the right stick. Sadly, the auto targeting doesnt always select the thing you want to chop, mine, or attack, and controlling a manual cursor with a joystick is awkward.After making a home for yourself in Terraria, consider expanding it to a village for you and your friends. The game opens up even more when youre exploring a world simultaneously with eight players. Not only does it make fighting many of the bosses much easier, but you can share resources and acquire some of the best stuff that much faster.Terraria may not be accessible, but this sandbox is so deep that you might find yourself buried in self-appointed goals and chasing that carrot of upgradable gear into the early hours of the morning. The combat and controls could use more polish, but a nearly infinite well of items and randomly generated worlds make up for those faults. A lot of games try to hold your hand through a scripted experience, but Terraria makes a good argument for the merits of directionless creation.", "date": "Apr 18, 2013", "grade": "8"}