{"name": "Shin Megami Tensei: Devil Summoner: Soul Hackers", "ref": "https://www.gameinformer.com/games/shin_megami_tensei_devil_summoner_soul_hackers/b/3ds/archive/2013/04/16/shin-megami-tensei-devil-summoner-soul-hackers-review-.aspx", "text": "Shin Megami Tensei has made a name for itself catering tothe mature and hardcore RPG crowd. Statistics, elemental weaknesses, and demonfusion keep battles intensely strategic alongside complex stories and memorablecharacters. Soul Hackers helped create this legacy in 1997 for the Sega Saturn,but it never made its way to North America. Now with an enhanced 3DS version,admission is finally open to the futuristic tale about technology going awry. Thewait was worth it. Soul Hackers is an addictive journey with a grippingstoryline and contemplative combat. The story about a soul-stealing virtual city is intriguingand full of twists, and the futuristic backdrop also works well. The idea ofexploring a cyberpunk city is not new to RPGs, but the atmosphere immersed mefrom the get-go, with inhabitants dressed in flashy, high-tech gear andcomputerized beats blaring through the city. Even with a great setting, where Soul Hackers makes itbiggest impression is with its cast. One character has two disparatepersonalities in her body, and the well-written banter between them addslevity. The mature tale also touches on dark themes, but it stands out byfocusing on the importance of family and its hardships. For instance, it hassome great interactions with an angsty character and his father struggling tocommunicate and understand one another. It also handles loss in a compellingway, and watching these multi-dimensional characters confront tough issues is ahigh point. Soul Hackers hooked me with its demon recruitment, whichadds layers to its traditional combat. You lure demons to your side by choosingthe correct dialogue responses or giving them items. Additionally, demon fusionprovides plenty of opportunities for more powerful combatants. You can evenfuse demons for higher damage-dealing swords. Not much strays in battle fromthe classic SMT/Persona formula. The party consists of two regular charactersand four slots for demons; the four demons allow for party customization,letting you take on skills your main characters lack, or buff up on valuablepowers like healing. Experimenting with different party combinations is fun,and kept me power-hungry for better demons. Demon personalities also play a role in strategy; those withkind personalities prefer to heal, while wild types fancy attacking. If youselect the opposite, sometimes they won't follow your orders and use the turnto their preference. This can be infuriating, but the unpredictability forcesyou to adjust your strategy around their potential insubordination.Soul Hackers isn't for the faint of heart; boss battles areharrowing and demon selection can make-or-break battles. For instance, one bosswith a weakness to magic blocks it after two turns. That means you have tocapitalize on those first turns to stand a chance. Still, the bigger battlesgave me an adrenaline rush, causing me to think and study my party before eachturn. I can't say many turn-based systems have caused me to consider theconsequence of misusing a turn like Soul Hackers. Dungeon design wasn't at its high point in 1997, and this isclear in Soul Hackers. Dungeons are bland and the places you visit, mostlyfactories and warehouses, aren't that exciting. However, a few make animpression, like the art museum where you jump into paintings and the hauntedhouse with story narration. To its credit, even with all the requiredbacktracking, the grind doesn't wear on you because of the option to talk yourway out of combat. It helps not being forced to fight every battle, as does thereasonable encounter rate. Soul Hackers isn't an easy fight, but it's worthevery moment that it beats you down. It became my addiction; I was completelyenamored with besting bosses, recruiting demons, and finding out where thestoryline would go next. I still can't believe that a game that came out in1997 feels so fresh and exciting over 15 years later.", "date": "Apr 16, 2013", "grade": "8.75"}