{"name": "Dungeon Hearts", "ref": "https://www.gameinformer.com/games/dungeon_hearts/b/pc/archive/2013/03/29/a-pointless-way-to-match-three.aspx", "text": "Mixing classical puzzle elements with other genres has resulted in some of my favorite games of the last decade. Dungeon Hearts attempts to give its match-three gameplay context with a Final Fantasy-like battle framework, but fails to meld the two in a meaningful way. Far more damning, however, is the weakness of the core gem-matching mechanic itself.The four tracks of the playing field correspond to your four heroes, as do the four colors of blocks (the fifth color, grey, is tied to monsters you fight). As the blocks proceed right to left, you drag them around to form groups of three that can be transmuted into attack gems, which can then be popped to damage the enemy and destroy any enemy blocks in their row and column. Attack gems chain, so you can clear large swathes of the field and do huge damage with a well-constructed assault. Any blocks that reach the left edge of the field are gone forever, except for enemy gems that activate when they get there. Such enemy attacks work just like player attacks, linking to other gems in their row/column and damaging your heroes.This setup seems fine in theory, but the actual gameplay falls flat. The tiny playing field and quick scrolling demands reaction instead of thought and planning, but the clunky way you drag blocks around ensures constant mistakes as you frantically try to make useful patterns. Moving blocks around corners  which you do often  results in losing the block off your finger or mouse pointer if you end up cutting the corner at all, which is bound to happen with the constantly sliding playing field. A single one of those mistakes can start a downward spiral, as one of your heroes being knocked out makes all blocks of his or her color inactive and basically dooms your playthrough unless the enemy is nearly dead already.After defeating a monster, you get to play the frustrating level-up minigame. Still based around matching three of each color, the brief window of opportunity to get your characters the necessary power-ups to defeat ever-harder monsters starts almost full of gems. If you dont find the single thread that lets you start making matches and clearing up space to make more matches within three or four seconds, youve almost certainly doomed your party to a tiny fraction of the leveling they should have gotten. Dungeon Hearts should win some sort of prize for making leveling up a punishment.Once heroes are sufficiently leveled, they gain access to skills that let them shake up the battlefield by clearing away blocks, healing wounded allies, or doing huge damage to the enemy. Special blocks come into play later, like monster attacks that take multiple hits to clear, silence or poison your heroes, or have other unusual effects. These are again good in theory, but being able to fire off a special move a few times every five minutes does effectively nothing to mitigate the poor core gameplay, nor do a few curveball block types.Dungeon Hearts basic mash-up of ideas and charming aesthetic could have set it on the path to casual-game stardom, but fun gameplay would have done a whole lot more. This may have match-three and RPG elements, but Puzzle Quest it most certainly is not.", "date": "Mar 29, 2013", "grade": "6"}