{"name": "Bioshock Infinite", "ref": "https://www.gameinformer.com/games/bioshock_infinite/b/xbox360/archive/2013/03/25/enjoying-the-view-from-above.aspx", "text": "In BioShock Infinite, players must be comfortable with the concept of parallel realities. What appears to be a peaceful street could be a war-torn battleground in a different version of the world. A person can be alive in one place, dead in another. Male here, female there  or never even born at all. As hero Booker DeWitt confronted these truths through the abilities of his companion, Elizabeth, I toyed with the same ideas in my own mind. If just a few things had happened differently, how would my life change? Could I be smarter? Richer? Happier? No matter how many parallel realities I ponder, I cannot imagine one in which BioShock Infinite is not among the best games Ive played. It all begins with Columbia. The floating paradise isnt just Rapture in the sky; it is divided by its own political problems, and driven by its own ideals. The city is beautifully realized, from the early 1900s-era buildings bobbing on the clouds to the zeppelins soaring by. As Booker walks down the streets, he is surrounded by a living Norman Rockwell painting; kids play in the water from a leaking hydrant, people gawk at technological marvels at the local fair, and a general store sits unattended but for a note about the honor system. Life in Columbia seems perfect, but the real fun comes from discovering the ugly side of the city.Dealing with themes like religion, racism, and xenophobia, Columbia is a richer and more nuanced setting than even Rapture, and the unveiling of the citys culture is masterfully executed. Whether youre looking at a piece of propaganda, listening to an audio log, or participating in a horrifying raffle, almost everything you encounter contributes to your understanding of the floating world. This is one of the ingenious ways Infinite blurs the lines between its component parts; Columbia may be a backdrop for the action, but the setting, narrative, and combat all loop back to reinforce each other.Booker wanders Columbia alone at first, but once he saves the young woman named Elizabeth from captivity, the adventure begins in earnest. Elizabeth is with Booker for most of the events that follow, and she is among the best AI companions Ive ever had. You dont ever need to worry about protecting her, which prevents the experience from feeling like an escort quest. Not only does Elizabeth stay out of harms way, she actively helps Booker by finding ammo and health, making her a valuable ally in gunfights. She can also open doors to alternate realities called tears, bringing objects like rocket launchers, automatons, and cover in from other worlds. She can use this ability as often as you want, but can only maintain one object at a time. This means you have a lot of options in any given encounter, but you can still adapt your approach and try new strategies.Bookers tools in combat are less mysterious. He plows through enemies using firearms, brute force, and creative powers. I picked off foes with my shotgun as they fought off the murder of crows I summoned. I possessed a robotic George Washington and watched him cut down my Columbian aggressors. I jumped on the roller coaster-like skyline, boarded an airship, and jammed my skyhook into a foes throat. The upgradeable weapons and abilities  augmented by the skylines and Elizabeths powers  give players plenty of space to develop their own style of play. The encounter design could use more variety (you walk into a lot of wide-open areas full of tears and wait for enemies to pour in), and the meager penalty for death doesnt keep stakes high unless youre playing on the brutal-but-rewarding 1999 difficulty. Despite those issues, combat on the whole is fun and satisfying.My favorite aspect of Infinite is the one about which I can say the least: story. The build-up is slow, but it works wonderfully thanks to the small ways other elements flow into the narrative. Elizabeths observations help you get to know her, and when she assists you in battle, it strengthens your connection to her. Opening tears keeps you thinking about the possibilities of other realities. Hearing the Beach Boys God Only Knows being sung in 1912 reminds you that you have a lot of questions that need answers. My only complaint on the narrative front is that the hulking Songbird is under-utilized; for such a cool concept, the beast is relegated to the role of screeching deus ex machina. Otherwise, Irrational ties the remaining story threads together to create one of my favorite game endings in years.Replicating the achievements of the original BioShock is a challenging goal (as 2K Marins sequel demonstrated), but series creator Irrational Games returns with a fresh vision and redefines what the BioShock name means. Infinite is more than a new setting, story, and characters; those elements are seamlessly integrated with complex themes, a mysterious plot, and entertaining combat to create an amazing experience from beginning to end. Familiar threads run through it  a lighthouse, a strange city, a charismatic antagonist  but they are homages to the past rather than attempts to recycle it. The core of Infinite is unlike anything else on land, sea, or air.The EdgeI did not notice a drastic difference in performance between the console versions. The PS3 may have a slight edge, but it also has the comically clunky Movecontrols. The PC iteration certainly has a graphical advantage, but I initially had issues getting the mouse-and-keyboard controls to work properly. If you go the PC route, you may want to stick to the gamepad, which worked fine for me.", "date": "Mar 25, 2013", "grade": "10"}