{"name": "Sniper: Ghost Warrior 2", "ref": "https://www.gameinformer.com/games/sniper_ghost_warrior_2/b/xbox360/archive/2013/03/22/city-interactive-s-covert-op-should-remain-classified.aspx", "text": "Sniping is one of the most empowering and satisfying acts you can perform in a video game when its done well. Dialing in a tricky shot from hundreds of yards away and watching your enemy ragdoll rarely gets old. Sniper 2: Ghost Warrior attempts to stretch those memorable moments into a full game, but its mission results in failure.Sniper 2 is derivative of every sniping mission youve ever played. Specifically, the excellent Chernobyl mission in Call of Duty: Modern Warfare. You sneak past huge patrols of soldiers in a conflicted European country, take aim on an enemy VIP from a bombed-out apartment complex, and even shoot down a chopper. Those moments, along with an uninspired trek through China, are part of a bloated campaign that lacks originality. City Interactive further insults its source material with mindless military jargon-filled dialogue and one of the worst Russian accents Ive ever heard.Military shooters have been criticized for their linear design in the past, but Sniper 2 takes it to a new level. Players are constantly told where to walk, who to kill, and when to hide. With so much hand-holding, I was surprised one of my follow-the-leader NPC buddies didnt just take my rifle and do the shooting for me. Nearly every target is indicated for you, designating the order of your kills in a boring shoot-by-numbers design. Dont look here for anything resembling an intense sniper duel. Most of your targets  even skilled enemy marksmen  stand around like mannequins.Killing these lifeless dummies isnt as simple as lining up your crosshairs. Sniper 2 tries to be hardcore by accounting for variables like elevation and wind, which means you spend several beats waiting for a secondary reticle to appear in your sights. This true reticle allows you to pull off dramatic, slow-motion bullet-cam kills. Pulling the trigger and watching your perfectly lined-up shot travel from your barrel to an enemys head (or groin) is consistently satisfying. But having played Rebellions Sniper Elite V2, its hard not to miss the lack of brutal x-ray kill cams.If the monotonous campaign bums you out, dont turn to multiplayer for redemption. The online offering is embarrassingly sparse. The only mode available is team deathmatch on a whopping two maps. These maps are functionally identical  two multi-leveled bases separated by a huge chasm with a single narrow bridge connecting them. Lining up shots on player-controlled characters is tricky due to their jittery animations, and the unresponsive controls exacerbate the issue. I was robbed of several lined-up shots because pulling the trigger simply didnt do anything. Switching to your pistol is also painfully slow, leading to frustrating close-quarters deaths.Sniper 2: Ghost Warrior feels like a bad parody of military shooters, but with poorly textured environments and sub-par mechanics. I like being the lone-wolf sniper as much as the next shooter fan, but Sniper 2 fumbles the power-trip from start to finish.", "date": "Mar 22, 2013", "grade": "5"}