{"name": "Star Wars Pinball", "ref": "https://www.gameinformer.com/games/star_wars_pinball/b/xbox360/archive/2013/02/28/three-sci-fi-tables-worthy-of-your-collection.aspx", "text": "ZenStudios has released its first DLC pack based on the Star Wars universe,containing three tables that run the gamut of visual themes and play styles. Ifthese new tables are an indication of the quality we can expect from the restof the series, then pinball fans have a happy year ahead.Pinball FX's DLC packs usually end up containing atleast one table I don't like, largely due to personal tastes in table design.With Star Wars Pinball, I find myself liking all three tables for completely differentreasons. The Empire Strikes Back retells the events of the movie in anentertaining way and contains the most side missions, hurry-up modes, andmultiballs - at any given time you're working towards a handful of differentgoals, making it one of the most replayable tables Zen has released yet. BobaFett, on the other hand, is mainly focused on a gameplay loop of activating, completing,and turning in bounties. While I found the table's other side missions lesscompelling, the massive payouts for turning in intergalactic criminals had me constantlylooking forward to the next bounty. Clone Wars is (perhaps unsurprisingly,given its source material) the most accessible of the three tables, andfeatures constant action thanks to its numerous ramps, none of which areparticularly hard to shoot. I've never been particularly interested in theanimated series, but it contains a few of my favorite modes from the pack,including a clone training mode that features two distinct mini-playfields,making it another welcome addition to my rotation.All three tables are also loaded with Star Warsdetails, from the voice clips and dot matrix reenactments of movie scenes inThe Empire Strikes Back to the CG-inspired characters of Clone Wars voiced bythe actors of the show. I can't help but feel a twinge of nostalgia every timeYoda offers some cryptic advice, or when a favorite bit of Star Wars music popsup to introduce a new mode.You don't need to be a Star Wars fan to recognizethe creativity Zen has brought to the new tables. The company continues to includemore fantasy elements in its designs (though nothing as crazy as thetable-flipping antics of Infinity Gauntlet), which may turn off old-schoolpinball fans, but I enjoy launching pinballs at Darth Vader and locking ballsinto a floating Slave I, even if such antics would be impossible on a realtable. While Zen Studios continues to hone its tabledesign, Star Wars Pinball is presented to players within the aging structure ofPinball FX 2, providing no new improvements or surprises in terms of tableguides, social features, or tournaments. It also lacks the Balance of the Forceand custom ranking features of the standalone Star Wars Pinball. Having thetables accessible within my main table library is worth it, but I wish itwasn't an either/or proposition, and I yearn to see what new features afull-fledged Pinball FX sequel might have. In the meantime, Star Wars Pinballprovides players three more entertaining tables well worth a spot in theirever-growing collections.", "date": "Feb 28, 2013", "grade": "8.5"}