{"name": "Pudding Monsters", "ref": "https://www.gameinformer.com/games/pudding_monsters/b/ios/archive/2013/02/01/combining-blobs-to-combat-the-evil-alfred-hitchcock.aspx", "text": "Pudding Monsters comes from ZeptoLab, the creators of the highly successful Cut the Rope, one of the titles that have come to define the iOS gaming experience. Pudding Monsters shares little with Cut the Rope as far as mechanics go, but it has charm  an area where ZeptoLab is proving to be very adept.Pudding Monster tasks players with moving pudding globules around a frictionless board in order to combine them into one intimidating blob. If you slide a globule and nothing impedes its path, it flies off the edge and you have to restart the puzzle. The ultimate goal is to combine all the available blobs into one giant blob, but in order to get the familiar three star rating for each puzzle, you want to make sure you gather your blobs in specific locations.You may recognize this type of puzzle, as it has appeared before in games like The Legend of Zelda, but usually in the form of moving ice blocks. Pudding Monsters mixes it up beyond the ice block formula by adding sleeping blobs, blobs that create sticky paths, groups of blobs that only move together in unison, and blob cloning machines in the later collection of puzzles. These different blobs make these puzzles feel much different than comparable games, but the core sliding mechanic is always prominent.The Pudding Monsters are designed simply with few features, but they project a lot of character with what theyve got. The eyeball animations make the blobs seem inquisitive and humanoid, and adding something as simple as a mustache (which appears on blobs every now and then) somehow adds maturity and makes them seem fatherly. I felt bad for them when I accidentally flung them off the side of the board.The puzzles are somewhat bland. It may be a product of playing these types of puzzles before, but I rarely felt excitement or reward for completing them. The puzzles arent easy, especially if you are going for the three stars on each level, but I never got a sense that I was thinking through a problem, so much as I was lazily sliding blobs around until they were stuck together. The different types of blobs keeps things from getting monotonous, but there was a sense of tedium that I never felt I could get past.The collection of bonus puzzles after completing the game do offer meaty puzzles with limited solutions, which is where the game shines the brightest. It wasnt until these last few puzzles that I got to the brow-furrowing, plan-in-advance sort of puzzle solving that I love. Replaying completed levels for additional solutions also offers a difficult puzzle challenge, but there is little reward for pursuing those extra objectives.ZeptoLab continues to set a high bar with its presentation and gameplay, but Pudding Monsters comes up short in the innovative puzzle department. I ripped through it very fast, and though there is the promise of free additional puzzles in the future, I dont think I will be returning to stick more blobs together.", "date": "Feb 01, 2013", "grade": "7"}