{"name": "Antichamber", "ref": "https://www.gameinformer.com/games/antichamber/b/pc/archive/2013/01/31/antichamber-review-a-lesson-in-originality.aspx", "text": "Antichamberhas been racking up awards at indie game conferences since 2009, and stumblingmy way through the game made it easy to see why. This indie puzzler establishescreator Alexander Bruce as the M.C. Escher of game development, providingplayers with a sprawling and satisfying network of challenges that requirenovel thinking to overcome.LikePortal, Antichamber's puzzles exist in an environment where the laws of naturedon't apply, allowing players to think in ways that reality doesn't require.Whereas Portal ~only~ bent the rules of space, Antichamber throws everythingyou know out the window, stripping you of your preconceptions before building youback up with a new set of skills and rules to play by.Anearly puzzle teaches me the importance of not taking anything for granted. Afterwalking down an L-shaped corridor, my path diverges into two choices: a bluestaircase that leads upwards and a red staircase that leads downwards. I choosethe blue stairs, which lead me up to another L-shaped hallway. When I turn thecorner, I'm confronted by the same two staircases. I spend the next few minutesalternating between the two paths, but no matter which one I choose, it leadsme back to the same stairways. Confused, I begin walking towards them again,then pause in a moment of clarity. I turn and walk back the way I came, peeringaround the corner. Lo and behold, it now leads to a new area.Eachtime you solve a puzzle in Antichamber, you come across a plaque with a sayingthat sums up the lesson you've just learned, many of which have real-worldvalue as well. These lessons are the core of Antichamber, and it teaches youeverything you need to know with virtually no on-screen instructions. Instead,you learn from your failures, and every time you expose a trick the world hasplayed on you, your knowledge base grows a little.There'sno hint system in Antichamber, so if you get stuck on a puzzle, you have two choices:bang your head against the wall until you figure it, out or tackle one of theother branching paths that make up the ambiguous laboratory/compound you'retrapped in. Thankfully, you can exit to the map room at any time (once youfigure it out, anyway) and fast travel to the puzzles you've discovered. You dothis a lot. Sometimes your progress is hindered by a tool you've yet toacquire. Sometimes you botch a puzzle and need to reset it. Sometimes a pathsimply leads to a dead end. Despite these pitfalls and abstract puzzles, I rarelyever felt stuck or frustrated by a lack of progress  a testament to Antichamber'spacing and design.Thegameplay evolves when you discover a gun that allows you to collect and placecubes in the world, providing you with the literal building blocks you need toovercome challenges. You upgrade the gun several times, building on yourabilities and the complexity of the puzzles you're confronted with. Theupgrades also make redoing many of the earlier puzzles a breeze, easing thepain of backtracking through environments while searching for missed secretsand abandoned puzzles.Below: Watch our Test Chamber video.Itwasn't until the very end that tedium began to set in, as I tried to hunt down thelast few paths I had missed. That boredom was erased as soon as I entered the multi-roomedgauntlet of puzzles standing between me and Antichamber's enigmatic ending, afinal test of the lessons I had learned. Regardless of the lack of story, overcomingthose challenges filled me with a greater sense of achievement than thecountless ~save the world~ missions I'm used to taking on in video games.Gamers would be hard pressed to find a more unique, engaging puzzle game.", "date": "Jan 31, 2013", "grade": "9"}