{"name": "Hundreds", "ref": "https://www.gameinformer.com/games/hundreds/b/ios/archive/2013/01/08/hundreds-review.aspx", "text": "In its short history as a gaming platform, iOS (along with other touchscreen operating systems) has proven itself to work best when the control input feels like a natural fit rather than a hindrance. Far too many games featuring awkward d-pad replacements litter the App Store, but others (Jetpack Joyride, Tiny Wings, Angry Birds) have embraced the simplicity of touch control to successful results. Hundreds is one of the good ones, with simple gameplay that would be virtually impossible with traditional console controllers.Recently released for both iPhone and iPad, Hundreds tasks the gamer with an initially simple goal. Various circles populate the screen, and you have to hold your finger on them until they grow larger, causing a counter to reach 100. What starts as a job simple enough for a child becomes gradually more complex. When multiple circles are on the screen, you need to inflate both of them without having their edges touch. At any point that youre holding a circle, it turns red. A frequent warning message is If they touch when red then you are dead, meaning that if they come into contact with virtually anything in this state, you fail.Tons of new obstacles and circle types quickly enter the equation. Jigsaws bounce around the screen, reducing the counter of any circles they touch. Snowflakes freeze everything, whether its your spheres or other objects like jigsaws. Hundreds does a great job of consistently introducing new elements like these throughout its hundred levels, and most of them add to the experience in a positive way.While most of the features improve the experience, some introduced at the very end of the game are extremely frustrating. Moving circles that disappear and reappear are a massive pain, as I frequently failed stages by coming into contact with obstacles that are impossible to detect. Despite these supremely annoying few levels, most of the hundred stages are a lot of fun.Because of its nature, bumping into circles that your hand is blocking is a problem. This typically only occurs on especially crowded or hectic stages, however. I did find that the general experience of the game is better on iPad, thanks to the increased real estate the screen offers.Hundreds is one of the stronger examples of a mobile title making great use of a touchscreen device. It isnt perfect, but its packed with tons of clever levels and puzzles. Many will require 10, 20, or more attempts, but its always a great feeling when your patience and wits move you one more step ahead. It wont take long to complete, but its certainly a fun ride while it lasts.", "date": "Jan 08, 2013", "grade": "8"}