{"name": "The Elder Scrolls V: Skyrim  Dragonborn", "ref": "https://www.gameinformer.com/games/the_elder_scrolls_v_skyrim__dragonborn/b/xbox360/archive/2012/12/11/dragonbornreivew.aspx", "text": "On paper, Dragonborn sounds like an extraordinary addition to the Skyrim experience. It boasts dragon riding, a trip to Morrowinds coastal island of Solstheim, new armor, weapons, and adversaries  and at the crux of it all is a showdown between two all-powerful Dragonborn characters. As impressive as these talking points are, they are all eclipsed by the surprising inclusion of the Oblivion plane of Apocrypha. Clearly a love letter to the work of H.P. Lovecraft, Apocrypha is infested with slimy tentacles and creatures with as many eyes as they have mouths. The hallways sway with life, sometimes collapsing or expanding as you walk down them. The architecture teems with shelves filled with lost tomes and scrolls. Dare to look upon one and the lettering comes to life for a brief moment before teleporting you deeper within this eerie, labyrinth-like realm.After you see Apocrypha, the giant mushrooms littered across Solstheims terrain look unremarkable, yet are still a nice change of pace from Skyrims snow-covered terrain. Apocrypha is a welcome show-stealer. The big bad that lurks inside of it, Hermaeus Mora, is equally as gawk-worthy and cool. Hermaeus Mora is the Daedric prince of knowledge and power, who chooses to appear as a mess of tentacles when dealing with mortals. Conversing with this intelligent abomination is as fascinating as it is dangerous.Hermaeus Mora shares the spotlight with another great character: Miraak, the first of the Dragonborn. These finely penned characters are tied to all of the significant plot points for the central story. Hermaeus Mora adds intrigue with his propositions and view of the world. Miraak makes your blood boil by his actions; he steals dragon souls from you, and is driven by an insatiable thirst for power. The battle between Miraak and your Dovahkiin is grandiose, but unfortunately proves far too repetitive in its unraveling. Miraak doesnt have a great defense for close range attacks  especially if youre using the Dragon Aspect shout, which is unlocked within this quest line.When you use Dragon Aspect, your character is adorned by magical armor that increases damage bonuses for weapons and shouts. This shout can only be used once per day, but stays active for a significant amount of time. If you lean on melee for most encounters, this shout is invaluable. I used it throughout most of Dragonborns campaign, and wished I had it in my arsenal when I first journeyed through Skyrim. Battlefield dominance also stems from the Bend Will shout. When the first word is unlocked, you gain control of animals. The second word turns mortals into temporary slaves. The third word allows dragons to be tamed.Although your character can jump up on the neck of one of these gigantic beasts, dont think for a second that you get full control over it. All you can do is tell it who to target and where to land.These beasts stutter and stop as they fly, and often look like they are going to glitch out of existence. They lack aggression, too, attacking at a snails pace and delivering little in terms of damage. Long story short, the dragon-riding mechanic is a disaster. Id rather see backwards-flying dragons return than use this power again.Thankfully, for campaign purposes, you only have to tolerate it once, and for no longer than five minutes. After that, its usage is entirely in your hands.Dragonborn delivers a great adventure that rarely apes content from the core game. The dungeon designs are inventive  especially the water temple  and flow nicely from quest to quest. Solstheim is a fun island to explore, offering a wealth of side content and locales to uncover. The dragon-riding and battle against Miraak in the final act are rough, but the story stays strong and is tied to one of of Skyrim's most enjoyable quest lines.Dragonborn requires The Elder Scrolls V: Skyrim game, and is available now on Xbox Live for 1,600 Microsoft Points.", "date": "Dec 11, 2012", "grade": "8.5"}