{"name": "Rise of the Guardians", "ref": "https://www.gameinformer.com/games/rise_of_the_guardians/b/xbox360/archive/2012/12/10/rise-of-the-guardians-review.aspx", "text": "Gamers don't expect a lot from games based on mediocreDreamWorks films. While Rise of the Guardians is built on a solid foundation ofhack-and-slash action and co-op multiplayer, the simplicity and monotony of thegameplay quickly becomes obvious.Rise of the Guardians allows up to four players to takecontrol of Santa Claus, Jack Frost, the Sandman, the Easter Bunny, or the ToothFairy in their quest to overthrow the nightmare-inducing super villain Pitch. Thechildhood legends have gotten a serious dose of 'tude since you last saw them; North(a.k.a. Santa) has ~Naughty~ and ~Nice~ tattoos on his arms and speaks with aRussian accent. Bunnymund (the Easter Bunny) is now Australian for some reason.He throws boomerangs at his foes and says annoying one-liners like, ~You justgot bounced!~Don't expect the charm or production values of the movie,however. The cutscenes are the cheapest example of animated storyboards I'veever seen in a game; I doubt young kids would even recognize who the charactersare supposed to be, or be interested at all in the story the sparse cutscenesare attempting to rehash.On the plus side, the in-game assets fare much better, andthe gameplay provides some simple fun. You can cycle between all fivecharacters on the fly by pressing left or right on the D-pad, and eachcharacter has three unique special attacks that can be unlocked as you levelup. You also have a handful of stats to upgrade for each character, and unlockablegems that provide passive bonuses.Much of this is largely inconsequential, however. Thevariety in the special attacks is nice, but rarely did I ever have to doanything other than mash a single button to defeat my opponents. I never evenused the block button other than the one time the tutorial prompted me to tryit out. After maxing out the strength and speed abilities and equipping a fewgems for each character (which took an hour or two tops), leveling up didn'tmatter much either.Rise of the Guardians' five realms are the most interestingaspect of the game, as each one has a unique visual style based on itscharacter. You can visit them in any order you choose, though your missions arealways the same, and involve either killing a bunch of shadow enemies in agiven location or picking up a collectible. All of the mission types are devoidof challenge; I only fell once during combat, which required me to use one ofthe three of revives you have at your disposal at any given time.The EdgeRise of the Guardians seems like a natural fit for the Wii U. Not only is everything about the game family friendly, but the GamePad allows you to always have the menu open for checking your map and upgrading your characters. This convenience doesn't outweigh the fact that the Wii U version has more frame rate problems, which were even an issue when playing solo. For that reason I'd recommend going with one of the other console versions.All of the missions are location-based, and you canundertake or ignore them as you see fit. A penchant for completionism had me100-percenting every level  as a result, I unlocked and completed the final(and underwhelming) boss battle before even stepping foot in two of the fiverealms. I returned to the game for another hour or two of grinding to finisheverything off, but it didn't add anything to the story  or my sense ofachievement, for that matter. All in all, you complete the game in anafternoon, without much reason to worry about the leftover objectives orminigames.Perhaps my most damning criticism is Rise of the Guardiansis that it isn't more fun with co-op partners. The mind-numbing gameplay leftus steamrolling our enemies in silence, and didn't really speed up the combatover playing with the mostly competent AI allies. Co-op also introduced anoccasional stutter in the frame rate.Rise of the Guardians isn't entirely unpleasant, but even ifyou're looking for a co-op game that's safe for the whole family, you can findbetter options on the market.", "date": "Dec 10, 2012", "grade": "6.5"}