{"name": "Far Cry 3", "ref": "https://www.gameinformer.com/games/far_cry_3/b/xbox360/archive/2012/11/21/you-know-where-you-are-you-re-in-the-jungle-baby.aspx", "text": "The idyllic beaches, lush jungles, and warm weather make the South Pacific islands intriguing vacation destinations, but the region also has a darker side. From blackbirding in the 19th century to seedy drug and human trafficking operations in modern times, visits to these remote locations arent always memorable for the right reasons. When a group of trust-fund kids unknowingly parachute onto an island inhabited by pirates, their sheltered, picture-perfect life is given a cruel dose of reality.After escaping pirate captivity, Jason Brody vows to drop his silver spoon and pick up an AK-47. With the help of the island natives, he starts down the path of the warrior, taking over enemy encampments, learning to live off the land, and trying to find his friends before they are sold into slavery. This sudden transformation from harmless party boy to savage killer feels implausible, but Far Cry 3 introduces so many other compelling characters (especially the tribal leader Citra and the madman Vaas) and throws so many activities at players that you find yourself invested in the world nonetheless.When youre not searching for your fellow one-percenters, you can participate in races, compete in shooting challenges, hunt down wanted islanders, climb towers to reveal more of the map, or capture pirate camps to free the surrounding territory of their influence. This ability to reclaim areas of the map is a welcome addition to the series, since the infinite enemy respawns of Far Cry 2 and unforgiving checkpoint system derailed the experience. The island also has several types of collectibles to search for, some of which make sense (relics) and others that seem baffling (drug recipes).The pirates represent the gravest threat on the island, but they arent the only danger Brody faces. The wild is filled with deadly predators like tigers, Komodo dragons, and sharks. If you dont pay close attention to your surroundings, you may meet your untimely demise like a foolish Steve Irwin wannabe. Killing them and gathering their hides allows you to construct new pouches for carrying more weapons, ammunition, syringes, and money. It doesnt make sense to force a player to find a rare animal just to craft a new wallet that can hold more cash, but it encourages you to explore the rich and varied island terrain, which includes ancient ruins, huge waterfalls, and wrecked ships.Like the best open-world shooters, Far Cry 3 excels because it lets you approach objectives in any way you see fit. For some missions I would sneak in to the base, turn off the alarms, and stealth kill as many people as possible. In others I would use an overlook to snipe unsuspecting pirates with a suppressed long-range rifle. My favorite approach is introducing the chaos of the wildlife into the encampment. Driving Komodo dragons into the bases or letting caged tigers loose helps you even the odds. While the pirates desperately try to subdue the animals, you can open fire with their backs turned.This kind of freedom is exhilarating; I only wish the AI posed more of a challenge. They too frequently pour into the same positions where their friends just died, and cant discern elevation changes. Rather than work their way up a cliff to attack after spotting me, for instance, they just stood at the base of the incline, making it extremely easy to take them all out with one well-placed grenade.As you hone your killing skills, Jason Brodys growth as a warrior is chronicled by a tribal tattoo on his arm. By completing missions and side activities, you earn XP that can unlock new special abilities like more health, improved shooting accuracy, or cinematic takedown moves. Far Cry 3 offers a wealth of options, but you dont need to be picky. If you tackle a fair amount of side activities you will unlock most of them before you reach the end of the story.In addition to the impressive single-player campaign, which features one of my favorite narrative conclusions this year, Far Cry 3 also offers a standalone co-op mode complete with its own story. As four players work together to hunt down a cruise-ship captain who sold out his crew and passengers to pirates, you encounter scripted sequences that require you to work together to take out bridges or compete against one another in shooting challenges. The co-op largely abandons the open-world format that makes the single-player experience, but its a fun diversion nonetheless.Far Cry 3 also features a full-fledged multiplayer mode complete with player progression, unlockable weapons/attachments, and four game modes. The sluggish movement and questionable hit detection keep this game from competing against the top online shooters, but if the community embraces the map editor, it could still find a niche in the overcrowded space. The modes dont offer much you cant get elsewhere, but the island setting, survival instinct effect that highlights enemies for poorly performing players, and amusing match endgame that allows the best player on the winning team to either humiliate or show mercy to the best player of the losing team give the game its own feel.After two remarkable but uneven offerings, Far Cry finally pulls everything together in the third installment. The diverse open-world action, compelling story, and an alluring environment that begs exploration are all high water marks for the series. This is an island adventure all shooter fans should experience.", "date": "Nov 21, 2012", "grade": "9"}