{"name": "Hitman: Absolution", "ref": "https://www.gameinformer.com/games/hitman_absolution/b/xbox360/archive/2012/11/18/hitman-absolution-review-agent-47-returns-at-the-peak-of-his-game.aspx", "text": "After a six-year hiatus, IO Interactives consummate hitman is back in business. Just like its titular assassin, the developer has honed its skills to a razors edge, providing the best gameplay the series has seen to date.Hitmans clone-filled narrative has always been the series weakest link. I was left with mixed feelings about Absolutions story, which focuses on Agent 47 protecting a young girl from his shadowy agency at the behest of handler-turned-target Diana Burnwood. On one hand, the story ditches most of the sci-fi nonsense of past installments for a more personal narrative and features a solid voice cast. On the other hand, most of the characters are insufferable exaggerations, the dialogue is erratic, and many of the sensationalistic twists are just plain offensive. I get that unsavory henchmen might be prone to using homophobic slurs, but that doesnt make their usage any less detestable, especially when theyre delivered in a joking manner. The ham-fisted narrative ultimately succeeded in making me dislike the characters I was meant to kill, but the constant attempts to court controversy are unnecessary and unwelcome distractions.Thankfully, the rest of the game has been improved in virtually every way. Absolution features a lengthy campaign (it took me more than 20 hours to complete) that offers significant incentives for replaying missions. The levels are sprawling, gorgeous, multifaceted playgrounds to hunt down and kill your targets in, and feature some of the most impressive crowds seen this generation.Better yet, the environments feature numerous kill options, including dropping a massive whale skeleton on an unsuspecting target, impersonating an insane criminal to get thrown into a courthouse jail, and sabotaging an electrical box to zap an unsuspecting henchman as he takes a whiz  sometimes the best hit isnt the classiest. You also have an armorys worth of firearms and improvised weapons to take out targets with.Absolution offers two divergent mission types. Most assassination missions are accompanied by one or more levels where your objective is to infiltrate or exfiltrate a target location. Unlike the original Hitmans mediocre action diversions, these escape sequences play to the series core strengths: using distractions and disguises to traverse the environments sight unseen. These levels are shorter and more linear than the assassination missions, but are still fun.Absolution adds even more deadly techniques to 47s repertoire while simultaneously simplifying the series cumbersome control scheme. Your instinct power, which lets you spot objects of interest and enemies through walls, cuts down on much of the frustration and radar watching of past installments. Likewise, the new blend ability provides an invaluable security net for evading nosy guards. Even when a botched mission turned into a killing spree, I always felt in complete control of 47, who now performs like the unstoppable killing machine hes always supposed to have been.The challenges, environmental kills, and Easter eggs built into each level provide a good deal of replayability, but the new Contracts mode is the real boon in this regard. Creating and uploading your own mission is as fun as playing other players contracts, and the scoring system and global leaderboards should be compelling to hardcore fans. Its still a far cry from an actual level/mission editor, but I can envision spending plenty of hours creating the perfect contract  and many more completing the missions of others.Despite all of Absolutions improvements, Hitman still isnt for everyone. The pace remains slower and more methodical than most action games, and youll find yourself reloading checkpoints countless times, in part because they are frustratingly tied to physical locations. If you take a different approach than what the developer had in mind, you may miss them completely. Attaining the rank of Silent Assassin still requires patience, skill, and more than a little trial and error. But while Hitman is still slower than most games, its also smarter. Devising a strategy, using the environment and disguises to your advantage, and leaving before anyone knows youre there are the hallmarks of a perfect hit, and Absolution proves Agent 47 is still gamings premier hitman.", "date": "Nov 18, 2012", "grade": "8.75"}