{"name": "Epic Mickey: Power of Illusion", "ref": "https://www.gameinformer.com/games/epic_mickey_power_of_illusion/b/3ds/archive/2012/11/16/epic-mickey-power-of-illusion-review.aspx", "text": "Epic Mickey: Power Of Illusion has all the right ingredients on paper. Its a spiritual sequel to the beloved Castle of Illusion starring Mickey Mouse for Sega Genesis. Its developed by DreamRift, the creators of the innovative yet flawed Henry Hatsworth in the Puzzling Adventure and Monster Tale, one of my favorite Metroid and Castlevania-inspired games from the last few years. Despite its pedigree, Power of Illusion went seriously wrong somewhere along the way.The main offender is the forced painting and thinning mechanic. At first, its not too offensive. You trace a drawing on the touch screen to make platforms and other objects appear in the top screen. Similarly, you can remove objects in the top screen by erasing images with the stylus. It soon becomes positively frustrating after you have to stop what youre doing every 10 steps to doodle and then wait around while Mickey shoots paint or thinner to make the object appear/disappear. Imagine if you had to sketch in every barrel cannon in Donkey Kong Country before launching yourself around the level. Then, the cannons disappear after shooting you a couple times so you have to draw them in all over again. You cant even choose where you place platforms or decide what shape theyll take. Theres a pretense of creativity implied with painting that never rings true here.This drawing frustration extends to boss battles as well. Instead of focusing in on an enemys pattern, you have to stop what youre doing and trace/erase constantly. This completely kills any rhythm you try to build. Normally, if you pause during a tough boss fight in any other game and come back youd fail pretty quickly. Youre out of the zone and not as focused as you could be. If just feels weird. But here its the core mechanic.This complaint is mostly aimed at the final boss, Mizrabel, who for some reason is now Maleficent from Sleeping Beauty instead of the Evil Queen from Snow White. The earlier bosses are ridiculously easy. In fact, the entire game goes from cakewalk to infuriating deathtrap about halfway through. The worst part is that you lose all of the money and collectibles youve nabbed along the way when you die and restart at the beginning of the level or the inconvenient checkpoint. So you have to redraw everything you already did over and over and shoot for all the tricky collectibles again.I dont know whom this game is for. Casual players will probably never make it to the end due to spike-covered later levels and cheap enemies. Hardcore players will be surprised how fast theyll finish if they can power through (my game clock read 95:13 after the credits rolled).You could always go back to collect missed Disney characters and items, but whats the point? Every conversation with these chumps goes the same way. I was walking through the forest/castle/etc. and I somehow ended up here, the character says. Well, golly, Mickey replies. Weve got a fort you can stay safe in. Sounds good, the character says before dematerializing, which seems like they could have done it at any time. I wish I could warp back to the time when Power of Illusion was full of mysterious promise.", "date": "Nov 16, 2012", "grade": "5"}