{"name": "Call Of Duty: Black Ops: Declassified", "ref": "https://www.gameinformer.com/games/call_of_duty_black_ops_declassified/b/playstation_vita/archive/2012/11/14/black-ops-declassified-review.aspx", "text": "Nine months after the Vita launched in North America, it still doesnt have its killer app. We have enjoyable titles like Tales From Space and Gravity Rush, but nothing has made the portable a must-have for mainstream audiences. Vita versions of the Uncharted, Resistance, and Assassins Creed franchises proved to be lackluster, but Sony has one last big name to draw on in 2012. If Call of Duty cant move units for mainstream gamers, what can? Unfortunately, Declassified is an absolute mess.Releasing on the same day as the solid Black Ops II, Declassified in no way resembles that games level of quality. Instead of an ambitious single-player campaign, this version offers gamers 10 standalone missions with no noteworthy story outside of the inclusion of Black Ops characters Mason, Woods, and Hudson. Imagine the mediocre Vita title Unit 13, then subtract most of the missions, throw in some broken geometry, and make the enemy A.I. literally suicidal. At one point, I saw a soldier throw a grenade directly at a wall, which then bounced back and killed him. In the same mission, an enemy was shooting at a nearby car that he was using for cover. He continued to do this until he died in a fiery explosion. Those are the more dramatic examples. Most enemy soldiers are content to hide behind a wall and fruitlessly shoot into it until theyre killed.These 10 missions can be completed in about three or four minutes each. All told, I beat the primary single player mode in 42 minutes. A time-trial mode gives you a handful of obstacle courses (which I typically beat in under a minute), and the final mode is an uninspired horde clone. If youre looking for a fun single-player shooter experience, youd be hard pressed to find an experience less complete than Declassified.Its a shame, as the core mechanics tend to work more often than not. Aiming and shooting may not feel as tight as the console installments, but I rarely struggled to find my target. Outside of some goofy touch controls for throwing grenades and steadying my aim while sniping, these controls would have been acceptable if the rest of the game was anywhere close to decent.Many Call of Duty fans flock to multiplayer first and foremost, but Declassifieds online play is far from a saving grace for this awful title. On launch day, I was rarely able to connect to a match. When I actually got into one, it was filled with enough glitches to make it unplayable.After downloading a near 400 MB patch on the second day, I was able to connect more often. Even then, I was frequently kicked out of lobbies to a background screen that I couldnt exit out of (forcing me to restart the system). When it does work, multiplayer features many of the series trademarks. You can create classes, customize killstreaks, unlock new weapons, and equip perks. All of this is on a much smaller scale than its console brothers, however. Customization isnt the only thing thats been whittled down, as the maps are claustrophobic and uninspired battlegrounds.Call of Duty: Black Ops: Declassified is appalling. In dramatic fashion, it completely fails to live up to the high bar of quality gamers expect from the Call of Duty name. Its also a discouraging sign for gamers like me who shelled out $250 for a Vita in the hopes of console-quality experiences on handheld. I cant recommend Declassified to anyone; casual FPS players and Call of Duty fans alike will recognize the train wreck Nihilistic Software has developed.", "date": "Nov 14, 2012", "grade": "3"}