{"name": "Angry Birds Star Wars", "ref": "https://www.gameinformer.com/games/angry_birds_star_wars/b/ios/archive/2012/11/13/angry-birds-star-wars-review-a-new-hope-for-angry-birds.aspx", "text": "The Muppets may be a better license to bear the Angry Birds name  both properties prominently feature pigs in space  but Rovio has done a tremendous job making Star Wars feel like it belongs in the birds universe. The strengths of both brands are exercised in clever ways, making Angry Birds Star Wars a must-play game for Jedi and bird-hurlers alike.Gravity remains the weapon of choice to crush the evil Pig Empire, but the birds can also tap into the Force to magically move objects, swing lightsabers to cut through debris, and volley laser fire to take out multiple pigs at once. These new mechanics fit nicely with the series well-established slingshot gameplay, and are tapped to create a variety of strategy-intensive levels that are among the most challenging and rewarding I've seen in an Angry Birds game.When the new mechanics are used as the primary puzzle-solving method for a level, don't be surprised if you have to experiment a handful of times to figure out how to slay all of the pigs. In some levels I had to Force push in the opposite direction of my bird's trajectory to cause two points of destruction at the same time. Other stages pushed me to ricochet laser fire off of metal surfaces, deflect shots with perfectly timed lightsaber swings, and sling birds into timed laser blasts to vary their flight just enough to hit a TNT box. The majority of the levels are excellently crafted, often making the collapsible constructs look like vehicles or scenes from the Star Wars films.The biggest surprise in Angry Birds Star Wars is its faithfulness to Star Wars story. The game follows A New Hopes arc surprisingly well. When Luke Skywalker is introduced, hes just a farm bird who cant do much of anything other than ram his face into solid objects. After a few levels are completed, he runs into Obi-Wan Kenobi, who gifts him with a lightsaber he can use in subsequent levels. Han Solos bird is added after Luke and Obi-Wan travel to the cantina. Luke even dons his X-Wing gear when the Rebel Alliance attacks the Death ~Pig~ Star. The only disappointing aspect of the story: Greedo doesnt fire a shot at all. Thats even worse than George Lucas alteration to the Special Edition.A New Hopes story is broken up into 80 levels. Golden Eggs earned along the way unlock challenging bonus levels featuring C-3PO and R2-D2 as playable birds. C-3PO explodes into a handful of pieces  a nod to the Ugnaught dismantling on Bespin  and R2-D2 uses his electrical shock ability. These stages are the hardest Ive seen in an Angry Birds game, and most are based on Angry Birds Spaces orbital level designs.The Empire Strikes Back and Return of the Jedi are also featured to a lesser degree. Empire is represented with Hoth, which will be a free update at a later date, and Return of the Jedi takes players to Dagobah. The catch: You can only play one Dagobah level in the base game. Youll have to fork out another $1.99 to get the other 39 stages. These levels repeat many of the strategies used in the core game, but do have some interesting puzzles tied to Force-levitated objects generated by the spirit of Darth Vader.Ive played through all of the Angry Birds games, and had the most fun with this Star Wars-themed version. And thats not just because its Star Wars. This game shows Rovio is at the top of its game, using a beloved license to deliver the series most creative levels to date.", "date": "Nov 13, 2012", "grade": "8.5"}