{"name": "Pid", "ref": "https://www.gameinformer.com/games/pid/b/xbox360/archive/2012/10/31/retro-platformer-sticks-too-close-to-its-roots.aspx", "text": "In the beginning of Pid, an adorable tyke named Kurt gets on a bus and finds himself on a strange planet. Time seems to have slowed to a crawl, and the robotic inhabitants have lost their royal family. Our reluctant hero is determined to get home, navigating the planets myriad traps and discovering the source of an evil robotic scourge along the way. The premise is interesting, featuring imaginative characters in a beautiful world. Unfortunately, Pids retro styling includes plenty of old-school gameplay elements that have long since been abandoned  with good reason.Kurt gets a gravity beam item early in his adventure, and its an indispensable part of his repertoire. The item allows him to toss up to two glowing balls into the 2D world. Kurt can float and drift in their altered gravity fields, reaching high places and avoiding deadly obstacles. Some enemies and surfaces are unaffected by the gravity beam, so youll have to discover alternate paths.Zero-gravity is fun for getting around, and the tool is used effectively in the opening puzzles. Ultimately, the beam doesnt have much staying power. I grew tired of repeatedly solving what are essentially the same puzzles. Repeatedly using beams to slowly hover across spiked pits isnt fun (or interesting) in the games first hour, let alone the eighth. Adding a co-op buddy does add a spark of complexityeach player can only toss one of the beams at a timebut it doesnt add enough to make much of an overall difference. Pid picks up a bit of momentum at the halfway point, when Kurt gains access to a variety of different items.One of Pids strengths is how puzzles can be solved legitimately or by using items and brute-forcing your way through. The puzzles typically arent difficult  move a crate onto a pressure pad, carry a key to a nearby door, etc.  but I appreciated how much time I could save by using a smoke bomb to zip past a guards line of sight, for instance. There are a handful of fantastic puzzles, including a section where you use your beam to move a light source through a spiky maze. Those high points are a great buffer between tedious switch puzzles; I only wish there were more of those creative moments.Robots are Kurts main foes, and they look like a mix of marionettes and machines. Theyre another one of Pids high points; Kurts interactions with them are limited to canned dialogue, but I always looked forward to meeting the next one. I felt the same way about the bosses, from a purely aesthetic angle. Some of the highlights include a geriatric, gun-slinging balloon and a robot that needs to be fed via conveyor belt. They all suffer from a broken formula of having too much health, too many attack cycles, and wearing out their welcome way too early. Like many other aspects of Pid, bosses are much more enjoyable when youre just watching the action.Kurt is a husky little dude, and he moves around with a noticeable lack of urgency. Thats fine when youre navigating through puzzles, but it makes boss battles a chore. Kurts equally lethargic with his slingshot  great for moments that require precise aiming, but irritating beyond belief when a boss is bearing down on you. In one of the games most memorable sequences, I found myself repeatedly dying and restarting, hoping each time that the game would randomly dump the item I needed in the boss lair. If you happen to hit a checkpoint when Kurts armor rating is low, you have my deepest condolences. This kind of punitive mechanic wasnt fun back when it was the norm, and its certainly no better now.If it got a visual downgrade, Pid would be right at home during the 8-bit era. Might and Delight have created a fine homage to retro gaming, but it comes with that eras often redundant gameplay and maddening boss battles. Game design has moved on, and unless youre ready for a frustrating experience (with a few key moments of promise), I suggest doing the same.", "date": "Oct 31, 2012", "grade": "6.5"}