{"name": "Pokmon Unite", "ref": "https://www.gameinformer.com/review/pokemon-unite/pokemon-unite-review-a-thunder-shock-to-the-system", "text": "The MOBA genre is a competitive space, as it typically features robust rulesets, requires team cooperation, and has a high skill ceiling that doesnt always welcome new players. Games like League of Legends and Dota 2 continually change their gameplay meta with the release of new characters, which is a hurdle for fledgling players. Newcomers have much to digest, but if you put in the effort, youre rewarded with loveable characters, strategic battles, and interesting gameplay mechanics. Pokmon Unite distills the genres characteristics into an easy-to-understand format and brings its beloved pocket monsters into the fold, resulting in a genuinely fun and approachable MOBA, albeit with a flawed microtransaction system.Unites Standard Battle mode is the centerpiece of the experience, featuring battles between two teams of five Pokmon. After selecting characters, consumable battle items, and stat-boosting held items, each team starts the match on opposite ends of the map. Experience points are earned by eliminating smaller Pokmon, destroying enemy goal zones, and defeating other players. You slowly unlock new abilities throughout the match, and after enough experience, fully evolve your Pokmon into their final form. I like that Unite doesnt shake up the mold, because the series loveable monsters and flashy powers are a perfect fit with this format.Unite features over 20 playable characters, ranging from fan favorites like Pikachu and Venusaur to lesser-known Pokmon like Cramorant and Crustle. Theres a nice range of Pokmon including originals from Red and Blue all the way up to popular monsters from Sword and Shield, though strangely there isnt a single Pokmon included from the series second generation, Gold and Silver. Each character is grouped into one of five battle classes: All-Rounder, Attacker, Defender, Speedster, and Supporter. While characters dont have elemental weaknesses like in mainline Pokmon games, each critter has unique stats, ability trees, and Unite Moves that make them distinct from one another. This is where Unite shines.Each Pokmons moveset remains faithful to the franchise but also makes sense in the context of a MOBA, and I love experimenting with different ability loadouts with each Pokmon. Sometimes I pick abilities like Flamethrower and Fire Blast that allow Charizard to be a spellcaster, and in other games, I focus on melee fights by unlocking Fire Punch or Flare Blitz. Charizards Unite Move, Seismic Slam, is pure spectacle, as he jumps into the air and soars above the map, spewing molten flames onto enemies below. At the end of his Unite Move, he picks up the nearest enemy Pokmon and slams them back into the pavement.When Im not playing as an All-Rounder like Charizard, I prefer to play as Crustle, who has a completely different role. As a Defender, this crustacean assists the team by stunning enemies, tanking damage, and blocking paths with his Rock Tomb ability. I love partnering with an attack-focused Pokmon and working together to lock down and isolate enemies from the other team.Each path on the map is populated with goal zones teams must attack or defend by obtaining Aeos Energy. Players collect Aeos by defeating wild Pokmon near the path, and then slam-dunking that energy into enemy goal zones. After depositing enough Aeos energy, a goal zone is destroyed, opening the next part of the lane. After 10 minutes, the team with the most deposited points wins the match; these short time limits make losses easier to swallow and help to cultivate an online environment that focuses on fun.Matches are full of additional objectives to conquer, like Zapdos, that pop up throughout the match. Zapdos, in particular, is incredibly powerful and doesnt spawn until the last two minutes of the match. The team that successfully defeats the Legendary bird is rewarded with an enormous goal-scoring buff that can potentially change the tide of battle. While I really like the catch-up potential this brings to the game, theres nothing more frustrating than playing strategically for the majority of the match and losing Zapdos because one teammate isnt paying attention. But to be fair, thats part of what makes MOBAs so exciting.On the top path, players can battle and escort the electrically charged Rotom to leave enemy goal zones vulnerable. Meanwhile, Drednaw resides on the bottom path and grants a shield buff to whichever team successfully defeats him first. These Pokmon are fun to hunt and have my imagination racing with ideas for other characters they could swap in during future events.Pokmon Unites microtransaction systems let you purchase a battle pass and all sorts of fashionable cosmetics for your trainer and Pokmon. This is standard fare for free-to-play games. Unfortunately, Unite drops the ball by allowing players to purchase item enhancers that can level up a Pokmons held items and boost their stats. Players can obtain these item enhancers for free by simply playing the game, but it takes months to fully upgrade an item to its level cap. I havent experienced a tangible disadvantage playing the game without purchasing microtransactions, but this systems pay-to-win potential certainly diminishes its long-term competitive integrity.Pokmon Unite is a fun way to spend your time despite these frustrations. The game eats away the hours of my day as I reassuringly say to myself, Just one more match. Battles play out with the spectacle that the Pokmon series is known for, and with so many abilities to choose from, no match feels the same as the last. The games simple mechanics and recognizable characters make for an approachable MOBA experience; and with a potential catalog of nearly 900 Pokmon to pick from, my hopes are high for the future of Pokmon Unite.", "date": "Jul 30, 2021", "grade": "8"}