{"name": "Bound", "ref": "https://www.gameinformer.com/games/bound/b/playstation4/archive/2016/08/15/game-informer-bound-playstation-4-review.aspx", "text": "Bound is a fun game to watch. The majority of the experience takes place in an imaginative world that undulates and breathes as you move through it. The landscape moves and flows with the same grace as your protagonist, who was born from the motion-capture of a professional dancer. It works in tandem with a connected, but visually separate story taking place in the real world, following a woman recalling her past and working her way towards a decision. Its narrative is a small, personal one that is engaging to the end. It will likely betray the expectations established when you first step out of Bounds real world and into its abstract one, but as a consistently engaging gaming experience, it comes up short, even if it leaves behind an impressive visual memory.Bounds two interwoven stories are never fully explained. In the abstract world, you are a dancer who must protect your kingdom against an ambiguous threat, periodically encountering a giant monster who must be avoided. The real world story serves as interstitial moments providing some connection between each of the unreal worlds stages. What happens or happened to either of the women you control is never fully explained, but Bound has a resolution that left me satisfied and eager to see its alternate ending.Your protagonist moves through the world (and the story) with the grace of a skilled ballerina. Watching her move as you direct her is stirring and made me enjoy the skill of a dancer in a way I never expected. My appreciation of ballet doesnt extend far beyond recognizing that it looks difficult, but Bound made me see it in a new way  one that made me admire the discipline that must be required to move in such a way. The face buttons offer little in the way of gameplay additions or useful abilities (aside from a graceful leap), but do offer impressive displays of movements I enjoyed seeing during my early experience.Bounds collection of platforming staples, like leaping between platforms, climbing ladders, and walking along slender beams achieves a new level of visual grace, but they feel like barriers to the end as opposed to a fun challenge, as they offer none. I enjoyed unraveling the story and looking at what was happening on-screen, but found no joy in clearing the small gaps or slowing things down in order to creep along a wall or tiptoe across a beam, regardless of how gracefully my character was able to do it.Despite the impressive visuals, making your way from the beginning to the end of each stage can be tedious. The stages are technically distinct, but due to their constantly shifting design, they blur together. They all begin from the same starting point, and end with a visually impressive ride along a ribbon to recap your journey. By the end, I breathed sighs of bored relief when I reached a levels end, more eager to see the next little snippet of story than to begin the next stage.Bound tells an interesting story and prides itself on its impressive visuals. It eagerly encourages you to take photos of your journey by mapping the photo-mode button to the R1 trigger, but the gameplay feels forced and is loaded with artificial barriers blocking progress. Seeing Bound instantly begs the question, What are you playing? but its movement mechanics make it unsure if it wants to be an engaging platformer or a passive relaxing experience. It lives somewhere between the two worlds; never fully embracing either, but it sure looks pretty.", "date": "Aug 15, 2016", "grade": "7.75"}