{"name": "Medal Of Honor: Warfighter", "ref": "https://www.gameinformer.com/games/medal_of_honor_warfighter/b/xbox360/archive/2012/10/25/a-medal-of-awful.aspx", "text": "In a bid to keep pace with Activisions front-running Call of Duty, competitor EA devised a two-tiered approach: Give its star first-person shooter franchise, Battlefield, the stage every other year, and alternate it with Medal of Honor, a once-glorious series that has struggled to match the quality and excitement of its early World War II games. The studio tasked with this revival, Danger Close, was given many of the necessary tools to compete on this hyper-competitive genre: two years of development, a decent marketing budget to drive awareness, and the keys to the powerful Frostbite 2 engine. Even with all of these advantages, Medal of Honor: Warfighter more resembles an untrained insurgent trying to figure out a state-of-the-art rocket launcher than a Tier 1 soldier. Given the relatively short campaigns of modern shooters (this one clocks in at around six hours), multiplayer often makes or breaks these games. Warfighter tries to carve a niche in the overcrowded market by hedging its bet between the fast-paced, lone-wolf action of Call of Duty and the team-oriented approach of Battlefield. With a healthy assortment of unlockable weapon attachments, comprehensive stat tracking, player progression, and five game modes, Warfighter checks off all the multiplayer boxes. Danger Close just forgot to bring the gameplay.The setup is promising. Players choose between six classes  sniper, spec ops, point man, heavy gunner, demolitions, and assaulter. Classes are distinguished by their class abilities and support actions (kill streaks). Once you choose your class, you are paired up with another person to form a two-man Fireteam. The ability to resupply and heal your teammate encourages pairs to work closely together, and when your partner is gunned down, his killer appears with a red halo around him so you can exact revenge.The Fireteam construct is a great building block, but with inconsistent hit detection, sluggish movement, and a confusing user interface that obfuscates what new weapons or attachments youve unlocked, the multiplayer has its share of problems. Danger Close even bungles the basics, like respawn locations and terrain navigation. The game allows you to spawn next to your fellow fireteam member when he or she isnt engaged in direct combat, but when playing modes like Hotspot (which charges you with attacking or defending various locations), choosing the fall back option occasionally respawns you directly into the line of mortar fire or right next to an enemy.Outside of the occasional chopper appearances that become available as high-tier support actions, the concentrated maps keep the focus on infantry battles. Some maps give the appearance of being open, but thanks to invisible barriers that prevent you from leaping over certain fences or taking cover in patch of grass on the other side of a short embankment, they largely play as a network of corridors.Most of the objective basedgamemodes stress strategy and cooperation, and Danger Close includes a hardcore modifier called Real Ops that allows you to experience two of the modes with the HUD elements pared down and friendly fire turned on. I thought my favorite mode was going to be Combat Mission, which operates like a streamlined rush mode with only three M-com stations to destroy, but the boundaries that prevent the defending team from venturing too close to the attacking teams respawn camp are ill-defined and located way too close to the control point. My preferred mode is the sport-like Home Run, a 10-round competition where teams alternate defending two flags. Each player is only given one life per round, so the stakes are high.Like the multiplayer, the single-player mode botches most of its mission objectives. Danger Close includes all the ingredients of the blockbuster shooter recipe  explosive set pieces, cinematic cutscenes, and a replayable tutorial mission ripped straight out of Call of Duty 4  but the lack of creativity, sloppy execution, and a jingoistic narrative derail the experience. The only redeeming feature Warfighter brings is the slick secondary scope mechanic that allows you to switch between two different magnified scopes on the same rifle, which is great for alternating between close and ranged combat.The globetrotting campaign tours terrorist hot spots like Pakistan, Yemen, Somalia, and the Philippines, but the weak narrative thread barely holds these disparate missions together. To help deliver authenticity to the experience, Danger Close enlisted real Tier 1 soldiers to write the story, but rather than give us insight into moral, emotional, and physical tolls combat takes on soldiers and their families, the game falls back on heavy-handed tropes that paint war in the most simplistic hues.Outside of a few thrilling (but out-of-place) car chase sequences that would feel more at home in a James Bond or Jason Bourne game, Warfighter brings nothing new to the table. The level design is painfully linear, and Danger Close puts a strange over-emphasis on breaching techniques. The laughable enemy AI is prone to taking cover from grenades in the middle of the street, and your oblivious squad members set up shop in your line of sight or even push you out of cover because they are scripted to position themselves in that spot. The occasional audio glitches, ugly building textures, and awkward lighting choices prove Danger Close isnt comfortable controlling the powerful Frostbite 2 engine, as well. I even experienced a checkpoint bug that forced me to restart an entire level.The uninspired single-player campaign, uneven multiplayer execution, and rampant presence of glitches undermine Medal of Honor: Warfighters efforts to join the Tier 1 of military shooters. If Danger Close keeps executing this poorly, this once-loved series may be dangerously close to being put in a casket.", "date": "Oct 25, 2012", "grade": "5"}