{"name": "The Ascent", "ref": "https://www.gameinformer.com/review/the-ascent/the-ascent-review-mindless-mechanical-mayhem", "text": "From the iconic works of Philip K. Dick to the seminal table-top RPG by Mike Pondsmith, fans of the cyberpunk genre are familiar with the theme of characters in search of an identity and purpose. The Ascent suffers from a similar identity crisis in its attempts to pull from dungeon-crawling RPGs and twin-stick shooters, but it never ascends to the heights of either genre. This mindlessly fun co-op experience features bombastic gunplay, engaging cybernetic abilities, and a visually impressive world to wreak havoc in.The Ascent takes place in the tech-obsessed world of Veles, controlled by maniacal corporations, and players control an indentured laborer who becomes wrapped up in a mystery as they battle for their freedom. While I enjoy the cyberpunk genre, The Ascents grating narrative contains all my least favorite tropes: incessant expletives, human rights abominations, and a profoundly bleak world. Those tropes arent inherently bad when handled with nuance, but the main story never dives into anything of substance, making those dark themes more set dressing than meaningful commentary. Combine that with a lot of confusing jargon and lore, and I found myself wanting to skip through dialogue to get back to what the game does best: turning you into a cybernetic warrior.Combat is The Ascents main strength. The moment-to-moment gunplay is exhilarating, with waves of varied baddies headed your way at virtually every moment. Developer Neon Giant also ups the fun with a diverse inventory of weapons and some truly fantastic augmentations and tactical weapons that can send enemies flying. Some of my favorite moments included blowing away corporate goons with a rocket-spitting Gatling gun then finishing them off with a devastating energy punch.While most of the fights left me satisfied (if not overwhelmed, but more on that later), the combat grows slightlymonotonous as the game goes on. Through an upgrade vendor, I started to find my favorite weapons and boost them, which outpowered most loot drops, making them largely irrelevant. That lack of variation also extends to your armor as well.The Ascent is a shallow RPG experience, with stats that dont always feel purposeful. I was always thankful to have points to boost my health and energy levels, but I found some of the other categories and even the armor inconsequential outside of the generic protection buffs. Its hard to know what specific attacks youre even trying to protect against. I seldom paid attention to attributes such as fire protection because I could usually blaze through enemies with the right tactics and augmentations. That was especially true when playing with others when the onscreen tumult becomes extremely difficult to track.The Ascent is best experienced in co-op. Up to four players can enjoyably play the majority of The Ascents 15-20 hour story. The bombastic fights are more manageable with a team alongside you, and the combat starts to sing when youre synched with explosive weaponry and chaotic augmentations.While co-op is the highlight, co-op play still has a plethora of annoyances. A limited pool of health drops aided in my teams demise, as the number of HP pickups doesnt seem to scale to the greater player count. It is also hard to find your partners in the world as player indicators blend in with the rest of the map. That problem is exacerbated thanks to a surprisingly large play space. My other complaint is how progress is handled. I jumped into a coworkers game for a few hours, only to find my progress was utterly gone because I wasnt hosting the match.Co-op is the main draw, but solo players shouldnt despair. Half of my time was spent on my own, and I still enjoyed the experience with some caveats. Picking up health is easier alone, but I grew frustrated in many encounters as I was quickly overwhelmed by the sheer number of enemies  it seems that the game was balanced with co-op in mind. These encounters arent impossible, but youll have to play smarter and plan your augmentations instead of the normal running and gunning.The games other great strength lies within its presentation. Neon Giant has crammed a staggering amount of detail into the world. Each corner of Veles is disgusting in the best sort of way, with its denizens throwing garbage onto the dilapidated metal plates of the sprawling megacity. The games lighting is equally beautiful if, at times, a little bit of a neon-soaked strain on the eyes. The camera work is also impressive and moves in cinematic and engaging ways. Finally, the music hits a high mark, with clear callbacks to iconic sci-fi fiction of the past, such as Vangelis work on the original Blade Runner film.The world of Veles is worth exploring, but doing so can also be a hassle. I was grateful for the fast travel points, but it still takes too long to get from point to point. I also found my co-op partnersand I sometimes had the same objective, but our tracker would occasionally take us in entirely different directions. It also didnt help that wed consistently run into groups of overpowered baddies that would instantly shred us. Neon Giant does a great job of rewarding curiosity with loot, but I found myself exploring less out of fear of another ambush and a game over screen as time went on.The Ascent has issues, but those issues dont detract from my overall enjoyment of the game. I wont write my thesis on its commentary on capitalism, but Ill fondly remember my co-op sessions where I tore through this cyberpunk world. That being said, the shallow RPG elements, lack of meaningful narrative, and exploration frustration were constants that really dragged the experience down. Neon Giant has made a solid foundation to build on, and I hope we can see future installments grow into something truly worthy of ascension.", "date": "Jul 29, 2021", "grade": "7.25"}