{"name": "Professor Layton and the Miracle Mask", "ref": "https://www.gameinformer.com/games/professor_layton_and_the_miracle_mask/b/3ds/archive/2012/10/19/professor-layton-and-the-miracle-mask-review.aspx", "text": "Professor Layton and the Miracle Mask debuted as a 3DS launch game in Japan way back in February 2011 (before North America even got The Last Specter). Despite being one of the earliest implementations of Nintendos new technology, its one of the best uses of 3D Ive seen on the system. Instead of the flat, static backgrounds of previous games, Miracle Masks surroundings brim with flowing fountains, fluttering flags, and bustling crowds. Turn the 3D slider up, and it looks like youre peering into a stunning paper diorama. While the 3D effect can still strain the eyes, I always made sure to look at each new screen in 3D at least once.The traditional tap-to-search scan for hidden coins and puzzles has been replaced with a magnifying glass cursor that turns orange when you pass a point of interest. This also moves the camera around slightly, further selling the illusion of three dimensions. Its nice to feel like Im not chiseling away at my poor screen as well.Instead of using static 2D art for character interactions, Layton and company now emote and move their lips as 3D avatars. It was strange at first, but now I think it would be tough to go back to the old style. Hand-drawn animation purists can still enjoy the plentiful traditional cartoon cutscenes.Miracle Mask is the second entry in the prequel trilogy and the fifth Layton game overall. After receiving a plea for help from an old friend, the good professor explores Monte dOr, a city terrorized by the theatrical Masked Gentleman. Some chapters jump back to Laytons hatless youth when he was first pushed into puzzle solving.While I always enjoy the character interactions, the overall story didnt do it for me this time. Youll be able to deduce the big mystery right away, so it feels like youre simply guiding the characters along to reach the conclusion you reached 20 hours ago. It helps that there are still plenty of smaller revelations along the way and that the post-credit video teases the next game brilliantly.I find it harder to rate the puzzles with each successive game in the series. They all have challenges that make you feel like a genius or that youve been robbed. There are some that enthrall you, while others are such a pain that you make it rain hint coins just to move on. The only real shake up here is the top-down dungeon exploration section that appears later in the game. Here you control Layton in real time, rolling boulders, dodging mummies, and digging up treasure. Im not sure Id enjoy an entire game like this, but it is a pleasant diversion from the standard formula.More new elements like this and a less predictable story would help push Miracle Mask up in the overall Layton ranks.", "date": "Oct 19, 2012", "grade": "8"}