{"name": "007 Legends", "ref": "https://www.gameinformer.com/games/007_legends/b/ps3/archive/2012/10/16/007-legends-review.aspx", "text": "James Bonds history in video games features titles with just about every level of quality. Youve got classics like GoldenEye, a solid outing with Everything or Nothing, passable entries like Agent Under Fire, the mediocre GoldenEye: Rogue Agent, and plenty in between. Near the bottom of that list is 007 Legends, a mess of a title thats uninspired at best and nearly broken at worst.Its problems arent any fault of the concept, which is novel if a bit nonsensical. In a scene showcased in the trailer for the film Skyfall, Daniel Craig, as 007, falls off a train. At the beginning of 007 Legends, this causes Bonds life to flash before his eyes, which plays out in the games five missions (each based on a different Bond classic). If you get past the fact that this doesnt make any sense (considering Casino Royale effectively reset the franchise with Craig as a young Bond), it isnt a bad idea. The film franchise has so many memorable moments and villains, and paying tribute to them could pay off well in a video game. Except it doesnt.When everything is functioning correctly, Bond does little more than follow onscreen indicators that basically scream PRESS THIS, SHOOT THIS, HACK THIS at every turn. Youll occasionally do a basic investigation of a baddies office or trudge through awful stealth sections, but the bulk of the gameplay is as cookie-cutter shooter as they come.Above: Trailer for the Goldfinger missionEach of the showcased Bond villains receives the same terrible quicktime event boss battle. Youll press an analog stick up or down to punch them until a life bar depletes, and occasionally tap a button quickly to disarm them. Youre never in danger during these  most bosses cant even hit you once.Its a bad game when its working, but there are plenty of moments that make you wonder how it even got cleared for release. Enemy AI frequently freaks out, causing soldiers to endlessly sprint against walls (often firing their guns at the ground). At one point, the framerate dropped to unplayable levels, except it wasnt during a firefight  I was just walking around. The visuals are cheap, with doorknobs drawn onto textures like this was a Nintendo 64 game. As I entered one room, enemies materialized out of thin air and dropped to the ground in front of me. These troubles carry over to its simple multiplayer mode, which features lag, terrible character animations, and an upgrade system that cant even clear the poor mans Call of Duty bar.Everything about this experience points towards a rushed development that focused on releasing the game close to the films opening. Rocksteady has shown us that a great IP can make for a great game if given the appropriate development team. The world of James Bond seems custom-built for an awesome gaming experience, but Activision seems intent on making every possible wrong turn with 007 Legends.", "date": "Oct 16, 2012", "grade": "4"}