{"name": "Borderlands 2", "ref": "https://www.gameinformer.com/games/borderlands_2/b/xbox360/archive/2012/09/17/review.aspx", "text": "Three years ago, gamers were treated to an ambitious title that appealed to fans of first-person shooters, lootfests, and RPGs alike. Its sequel would have been a step up (and a multi-million seller, assuredly) even if Gearbox only expanded upon the narrative. Instead of taking the easy route, the studio has taken everything that impressed in the original and greatly enhanced it. From major bullet points like the story to smaller details like the UI and inventory system, Borderlands 2 surpassed my expectations and stands as a prime example of how to knock a sequel out of the park.Unlike the first game, players have a very specific enemy in mind as they shoot their way across Pandora. Handsome Jack has taken credit for the original vault hunters actions, and has tapped into a vast supply of the valuable element Eridium in his rise to power as leader of the Hyperion corporation and dictator of Pandora. When a new set of vault hunters catches wind of his ultimate plans for the planet, they set out to reunite with familiar faces and put an end to Jacks reign. With an entertaining antagonist, some surprising twists, and cutscenes you actually want to watch, the story is one of the many significant steps up from its predecessor.The new classes are vaguely similar to classes from the original game, but their abilities and skill trees make them uniformly superior. My playthrough was a blast as Zer0, the robotic ninja with the ability to cloak himself and deal massive damage with sniper rifles and his sword. His deception ability is more flexible than I anticipated, and it saved me in numerous scenarios. In most circumstances, Id use it to sneak around enemies as they were distracted by my holographic decoy, and surprise them with a super-powerful melee attack. In other instances, Id use the ability to aid my escape from deadly situations, distract enemies as I revived my partners, or use it as an opportunity to retreat to an ideal sniping position.Utilizing the same user-friendly co-op framework as the first game, experimenting with the classes unique abilities in tandem is rewarding. While an enemy is suspended in the air by Mayas Phaselock, Axton can lay down a turret and unleash a torrent of firepower. After Salvador draws the attention of enemies by flipping them the bird, Zer0 has a great opportunity to sprint behind the pack for silent assassinations. Gunfights are rarely generic affairs, as the interplay between characters assures unique scenarios.Having four distinct classes allows for a variety of gameplay experiences, but the replayability doesnt stop there. Each class has three distinct skill trees to explore, and your playstyle can vary wildly depending on how you choose to distribute skill points. My Zer0 was a melee machine. I opted to take down Pandoras baddies with my sword just as often as with my bullets. If I had chosen to follow the sniping skill tree, Zer0 would instead be a long-range threat with quick reload times and high critical hit percentages. Its almost like Borderlands 2 has twelve different classes instead of four.We didnt get much of a chance to learn about the vault hunters during the first game, but by taking Roland, Brick, Lilith, and Mordecai out of the players hands, Gearbox has freed itself to do more with the characters. They return to help the new crew, and theyre just a few of the many colorful characters that assign quests. Fetch quest missions and generic objectives are rare in Borderlands 2, as even seemingly inconsequential sidequests have plenty of entertainment value. Outside of the main story, you find yourself participating in activities as diverse as solving a murder, inspiring Scooter as he writes a romantic poem, robbing a train, getting a skag to defecate on a bomb, having a pistol duel in an Old West-style town, and helping Claptrap organize his birthday party. Throughout the game, the dialogue and clever missions display a sense of humor on par with the best in the industry.While the new classes and focused narrative are the marquee bullet points when it comes to this sequels improvements, thats barely scratching the surface of the multitude of smaller upgrades. Inventory management and the user interface are much better, allowing for simple buying, selling, and comparing of items. Character customization allows players to alter their classes with different heads and skins. A new token system rewards players for completing challenges by granting stat bonuses that carry over to any character on the same profile. Enemy characters are more varied, including both appearance and behavior. Its now possible to crawl to safety while waiting for a partner to revive you. These may not all be blockbuster features on their own, but they all add up to a noticeably superior experience.All of the improvements would make for a standout title even if it were constricted to single-player. Considering Gearbox has continued to put this franchise in a league of its own when it comes to co-op, it elevates the game to something more. With its unmatched co-op gameplay, intense shootouts, addictive loot collecting, expansive skill customization, hilarious dialogue, and insane level of replayability, Borderlands 2 is one of the most rewarding gaming experiences of this console generation.", "date": "Sep 17, 2012", "grade": "9.75"}