{"name": "Brutal", "ref": "https://www.gameinformer.com/games/brutal/b/playstation4/archive/2016/08/02/a-serviceable-stylish-rogue-like.aspx", "text": "Brutal is fixated on capturing the dark allure of an earlier time in gaming history, when maps were represented as numbers and symbols on screens instead of well-drawn diagrams  when heroes didnt wield guns but wands, axes, or swords instead. Much of this time travel is attractive and welcome, a plunge into goofy nostalgia that lets you build and imbue weapons with magic powers capable of setting monsters aflame or transfiguring them into measly cockroaches to be squashed beneath your boot. In these moments of pure power fantasy Brutal works best, letting you rise from nothing into a powerful warrior or mage capable of clearing rooms of enemies. Unfortunately, Brutals attempts to capture the past often bleed into slavish devotion, hamstringing a would-be great game with cheap deaths and tediousness.Every game of Brutal begins the same. You select a generic fantasy class (Warrior, Ranger, Amazon, Mage), all of which have the special abilities and weapon expertise youd expect them to have, and then enter the first floor of a huge, procedurally-generated dungeon. The goal is the same for every floor: find the exit. Lots of doors require keys for you to unlock, which often means finding chests or killing special enemies to get them. You earn experience by both killing monsters and smashing the environment around you into pieces; leveling up gives you access to new skills, like enchanting weapons with magic or giving your weapon of choice a special attack. Dungeons get harder as you go, filling up with trickier enemies like a nymph who will temporarily steal away your weapon if you try and kill her with anything other than bare fists, and expanding the number of rooms you have to traverse in search of keys and treasure.Brutals structure and rhythm, as well as enjoyable squishy combat, more often than not results in a fun time. However, a number of issues can easily deflate the amount of fun youre having. As part of its homage to Rogue and other ASCII titles, the game features permadeath. This in itself is not a problem until you discover just how easy it is to perish in later stages. For example, plummeting off a broken bridge will end your game, and thats a problem because the camera angles in the hallways where these bridges are located are often so awkward that its hard to tell how you need to jump. You can spend a whole hour working through half of Brutals 26 dungeons only to die and lose everything because a bad camera screwed you over. This infuriating experience is lessened slightly because you can use treasures you uncover during your dungeon crawling to buy lives from altars that might give you another chance if you screw up a jump. However, its still frustrating to lose one of those lives that could have been useful in a tense battle thanks to something thats out of your control.Brutals enchantment and weapon collecting systems are neat at first, forcing you to start each game with only your bare fists and search floors for ASCII letters to create weapons like broadswords, pikes, and axes as you go. The drop rate for letters are generous so youre never too worried about having to rely solely on your fists and shield for too long. Once youve assembled enough letters you can build a weapon, and later on you can enchant it with fire, poison, or another kind of magic. The crafting system is superficial but pretty much all of Brutal is that way. Its most interesting qualities are gimmicks  the ASCII visuals, the procedural generation, a shield that you can throw like Captain America because why not? That doesnt stop these things from being enjoyable and the meaty combat and the reliable but occasionally unpredictable structure of each game session are enough to prop up this rogue-like even after the sheen on those gimmicks has faded. However, its hard not feeling like Brutal could have had a more impressive showing given the size of its bag of tricks.", "date": "Aug 02, 2016", "grade": "7"}