{"name": "The Trouble With Robots", "ref": "https://www.gameinformer.com/games/the_trouble_with_robots/b/pc/archive/2012/09/03/trouble-with-robots-review.aspx", "text": "The line between simplistic and elegant is thin and hard to define when it comes to game design. The Trouble With Robots, a charming little card-based strategy title from tiny indie studio Digital Chestnut, leaves no doubt that it falls on the better side of that divide. Though the game gives players only a handful of options, the few decisions required of you are impactful and interesting enough to make for a good time.Each of the 16 levels consists of a series of sub-stages in which your AI-controlled forces butt heads with a pre-set enemy army. Your interaction with the battlefield is limited to using cards that either summon additional units or have some other effect on the battle. You assemble three random cards from a deck before the level and these are added to your hand at the beginning of each sub-stage, and a constantly recharging wand holds up to five charges for playing those cards or dumping excess power into weak single-shot lightning bolts. These basic rules are simple, but the interactions between cards and the wide variety of challenges posed by enemy types make the game shine.The cards that you start with are uninspiring, summoning a few peasants and/or elven archers and healing your forces. A new sub-stage starts, you summon whatever guys you drew, and fire off heals when someone gets close to death. Defeating waves without suffering any casualties quickly unlocks more interesting cards: dwarves who permanently increase everyones health when summoned, elves who increase your wand power instead of costing a charge, and books that let you draw additional cards.(click on the screenshots for high-res versions)Enemy types quickly ramp up from the basic melee robots at the beginning into far more challenging foes. Ranged enemies of any kind are constant threats to perfect scores, easily cutting down retreating wounded peasants with their random targeting. Rocket-launching robots can decimate tightly packed armies, and large tank-like enemies can one-shot non-upgraded peasants. Without the ability to control your forces manually, the right mix of summons and support spells is key. Choosing which cards to bring is only half the battle; using them well is the difference between scoring ten perfect waves and failing to pass the level at all.Playing through on hard mode after beating the game (which shouldnt take more than a few hours) is absolutely worth it for the chance to experiment with and see some of the more dominant card combinations in action against worthy tests. Using the larger card list youve unlocked can see you steamrolling levels with an invincible screen-filling army of several dozen peasants led by a slew of griffons with good playing and a little luck, and its a sight worth seeing.I went into The Trouble With Robots expecting nothing and discovered a well-executed little strategy game that rewarded my investment of a few afternoons most satisfactorily. The game is small and simple, but cleverly designed and avoids the common mistake of trying to be more than it can. Its minimal story  is a tongue-in-cheek tale of unrequited love, confused evil robot overlords, the pros and cons of shopping malls, and allies who take professional pride in their laziness  is easy to ignore but worth a chuckle or three. Ill be keeping my eye on newcomer Digital Chestnut, and I suggest you do the same.The Trouble With Robots is so indie you even can't find it in stores  even digital ones  quite yet. Visit Digital Chestnut's official website to try the demo and/or buy the game.", "date": "Sep 03, 2012", "grade": "8"}