{"name": "Transformers: Fall of Cybertron", "ref": "https://www.gameinformer.com/games/transformers_fall_of_cybertron/b/ps3/archive/2012/08/21/transformers-fall-of-cybertron-review-variety-in-all-things.aspx", "text": "If youve ever wondered why that friend of yours so fervently loves these transforming robots, High Moon Studios has crafted an answer for you. Larger-than-life characters flung into dire straits, giant explosions combined with potent sci-fi storytelling, sacrificial heroism pitted against megalomaniacal villainy, and robots that transform into cool cars and planes  this is wish fulfillment at its finest. Even if its not the deepest interactive experience, Fall of Cybertron is certainly one of the most enthusiastic and boisterous digital adventures youll have this year.Fall of Cybertron opens after the bad guys have won. Countless battles have ravaged the planet, and the heroic Autobots are abandoning their home. Unwilling to let them leave, the marauding Decepticons are doing their best to wipe their enemies out before they can escape. The simple premise keeps the focus squarely on the characters and their adventures, and the storytelling is surprisingly well paced and cogent. Nearly every level switches up the point of view character, but maintains a consistent narrative thread that is at turns humorous, exciting, and full of nods to the history of the fiction.High Moon has taken a big chance on multiple playable characters. Each one offers a distinct gameplay style, from melee powerhouses to flight combat. Its a credit to the studio that every one of those characters is fun to play, and that the pacing from one to the next is so smooth. Optimus Primes military sci-fi shooting flows naturally into Cliffjumpers stealth, making Jazzs subsequent sniping exciting. The variety in gameplay is Fall of Cybertrons strongest feature, but also its biggest limitation. While most levels feel challenging, the characters mechanics rarely reach the depth that another action game hero might get to experience over the course of a whole game.The theme of increased variety carries over into settings and enemies. Taking to heart criticism of the limited visual novelty of its previous Transformers game, High Moon has invested serious time in making sure each level stands apart, and takes us to corners of Cybertron that fans have never seen before. Individual battlefields are memorable and graphically stunning, thanks especially to multiple distinct metal types. Whether its gears grinding, walls shifting, or rust storms blowing, the game world is always in motion.The wide array of different enemies follow their own behaviors in combat, and learning how to tackle each one when they first appear is fun. The coolest enemy types base their actions on what form theyve transformed into, so attentive players have clear visual cues about how to react.Eschewing the two separate campaigns seen in the earlier War for Cybertron, this new games structure flows better, and by controversially abandoning cooperative play, every level is built to a particular characters strengths. The adventure is filled with titanic set piece moments, and the developer isnt afraid to take short breaks from the action to nail home the atmosphere or an important plot point. In the name of pulling players forward through the adventure, the whole affair is linear and lacking in real choices, but the reward is some of the best scripted moments in this generation of games.If the ongoing story lacks some player agency, the sting is lessened through the addition of an engaging choice-driven upgrade system. All the weapons are worth exploring, and many fall outside the cookie cutter norms, from bouncing metal saw blades to guns that fire jolts of electricity. More importantly, energon shards earned over the course of the story can be spent to refine weapons and equipment in meaningful ways, or gain universal perks that improve everything from health to movement speed (go for these first). Improvements carry over into subsequent games on your profile, offering ample reason to try out the next difficulty setting.The big kicker for multiplayer is the opportunity to create your own Transformers to take into battle. Limited options for the four classes in the beginning blossom into increased weapon and cosmetic choices the longer you play, and the visual variety you see from other players far outstrips anything from comparable online shooters. The familiar modes of play arent going to blow anyones mind, but a healthy selection of 10 strong competitive maps is welcome. As of launch, frame rate isnt ideal, but I have no complaints about the balanced action or highly mobile battlefields.In addition, the wave-based cooperative Escalation mode returns, and implements all the improvements of the single-player game, including better enemies, weapons, map design, and shooting. These levels offer the chance to play several legacy characters not available in the campaign, and your choices include a balanced mix of a healer, a powerhouse, or other specialties that promote staying together and cooperating. Id love to see expansions or sequels offer some other experiences beyond shooting, like cooperative stealth, or even a dedicated Dinobot squad level.Fall of Cybertron is the Transformers toy battle you imagined as a child, transposed onto the TV in front of you. Its the most faithful treatment of the Transformers brand for fans across any medium in recent years, and it manages the feat while remaining welcoming to new potential players. Its also a clear message to the world that High Moon Studios has joined that most rarified breed of game developer that can create an honest-to-goodness great licensed game.", "date": "Aug 21, 2012", "grade": "9"}