{"name": "Rhythm Thief and the Emperor's Treasure", "ref": "https://www.gameinformer.com/games/rhythm_thief_and_the_emperors_treasure/b/3ds/archive/2012/08/07/an-attempt-to-revive-the-rhythm-genre.aspx", "text": "Rhythm Thief & the Emperors Treasure strives to innovate the rhythm genres tried-and-true formula by adding an interactive story to complement the gameplay. The result? Sega proves rhythm games can exceed expectations and move into new territory, but not without a few missteps. Set in Paris, the narrative centers on the missing casket of Napoleon Bonaparte and a ritual to revive the Little Corporal. The main character, Raphael, takes a special interest in the mystery when his father turns up missing. Fearing a connection to the stolen casket, he assumes a secret identity called Phantom R, donning a flashy suit and fedora. The narrative is charming, but doesnt have the same pull as other graphic adventure titles like Professor Layton or Ace Attorney. The characters are quirky, but not vibrant enough to be memorable. Still, the plot twists and unfolding mystery should keep you tapping to the beats.Despite a large focus on the story mode, Rhythm Thief never forgets its musical roots and does a great job shaking up its gameplay. The basic structure consists of exploring for clues followed by a rhythmic minigame. These minigames are constantly changing; some are quirky, like using your dog to bite security guards rears, while others are intense, like soccer matches. The game also pays homage to some of Segas older rhythm games, with stages in the vein of Space Channel 5 and Samba De Amigo. Rarely are minigames repeated, and if they are, they include a variation. The controls follow suit. Some minigames purely focus on tapping the stylus, others use button presses, and a handful even combine the two.Strategy also constantly shifts between visual and sound pattern recognition, so you must pay attention to every part of the experience, as it could cue you to your next button push or stylus tap. Unfortunately, for a rhythm game, the music is uninspired. The tracks arent the driving force. Instead, the intensity of the gameplay and the unfolding story take center stage. The classical tunes for the violin sequences are the best of the bunch, while the kitschy J-pop tunes arent catchy enough. The questionable beats are disappointing, especially considering all the creativity infused into the minigames. Another drawback to Rhythm Thief is that, in its pursuit of variety, it tries to do too much. For instance, some levels use the 3DSs gyroscope. The idea is well-intentioned, but the controls are more frustrating than fun. This is especially apparent when the gyroscope controls are inverted in a flight minigame. Puzzles are another weakness; they dont bring anything new to the table and are absurdly easy. That doesnt carry over to the rhythm aspect, though, as an adequate challenge awaits the musically inclined with a hard mode. Unfortunately, easy mode is absent, so beginners may find Rhythm Thief daunting. The unforgiving difficulty means missing one button tap can knock your score back two letter grades.The opening scene of Rhythm Thief professes, Imagination rules the world, and what it delivers follows suit. For its minor slip-ups, the game still innovates in the rhythm genre by offering a real story. If anything, the final product proves that extra creativity can make a difference, but it needs to be spread through all aspects of a game to make it a top contender.", "date": "Aug 07, 2012", "grade": "7.5"}