{"name": "Tony Hawk's Pro Skater HD", "ref": "https://www.gameinformer.com/games/tony_hawks_pro_skater_hd/b/xbox360/archive/2012/07/18/tony-creates-a-new-kind-of-stalefish.aspx", "text": "I vividly remember how the demo for Tony Hawks Pro Skater on PlayStation sucked me in. With the passing of time and the fall of the franchise, that nostalgic moment has passed and is not fully recaptured in this downloadable title encompassing parts of the first two Tony Hawk games. I wouldnt want it to be exactly the same, but Tony Hawks Pro Skater HD adds some of its own problems and preserves a few from the original games.Pulling off insane trick combos and traversing the expansive and varied environments is still surprisingly easy. It may feel like your hands are manipulating the controller like youre doing a Rubiks Cube speed run, but the gameplay is solid enough that your hands can keep up with your mind. Tricks can also be executed with the 360s left analog stick, which I liked  except for tricks where you must tap twice in the same direction. The d-pad, meanwhile, is up to the task, albeit a little stiff.Robomodo has culled a good selection of levels from the first two games. I particularly like the mall, warehouse, Venice Beach, and the downhill jam from the first game. The level design goes hand-in-hand with the trick system, allowing you to put together all unique runs no matter how many times you play the levels. The injection of manuals and switch stance also creates possibilities.As strong as the gameplay is, a few hitches take it down a peg. Half-pipes runs are hampered by the fact that your skater tends to drift away from the lip of the pipe while in mid-air. This means that you sometimes land in the middle of the transition and fail landings you would have made in the original games. Moreover, the lack of transition animations robs the skating of fluidity and sometimes makes skaters jarringly jump to new railings. The physics and collision systems also sometimes propel you spectacularly into the air.Adding to these technical problems, one aspect of the original titles that hasnt aged well is the objectives. Kudos to developer Robomodo for adding new objectives to the levels in the spirit of the original games, but most of these are fetch quests. While I dont love the crazy objectives in the later Tony Hawk games, having to collect X amount of objects in a level wears thin. Moreover, the menu has a map of all the collectibles in the level  including the secret tape and hidden areas. This undercuts the fun of exploring the levels.A handful of multiplayer games  Trick Attack, Graffiti, and my favorite, Big Head Elimination mode  are slightly more successful. In Big Head mode you must constantly pull off tricks so your head doesnt swell up and explode before your opponents.Tony Hawks Pro Skater HD recreates the gameplay that made the franchise famous, but to mixed results. It lands the trick, but doesnt do it cleanly.The XBLA Summer of Arcade ExceptionTony Hawks Pro Skater HD is one of Xbox 360s Summer of Arcade titles, but it will also come out on PSN later in the summer. Well evaluate that version at a later date and publish a separate review if it warrants one. If not, consider this the definitive review.", "date": "Jul 18, 2012", "grade": "7.5"}