{"name": "Endless Space", "ref": "https://www.gameinformer.com/games/endless_space/b/pc/archive/2012/07/17/review.aspx", "text": "Endless Space is a well-executed attempt to take up the grand space strategy torch where Master of Orion II dropped it back in 1996. Its dramatic scope and the broad latitude it gives to players in crafting their empire and ships have merit, but I would be more inclined to crown this indie PC release the successor Ive desperately wanted for a decade and a half if it didnt fall into the same traps as Steve Barcias classic, along with finding a few new pitfalls of its own.Endless Space is a turn-based strategy game in the traditional mold. Players explore randomly generated galaxies, expand their empire to new planets and star systems, exploit the rare isotopes and organisms found on exotic worlds, and ultimately exterminate their enemies. Venturing down the expansive tech tree unlocks powers from the mundane to the godlike. Technology allows colonies to be formed on inhospitable celestial bodies, starships to be crafted on an ever-larger and more destructive scale, and industrial developments that give Euclid the finger as they exploit quantum mechanics for market advantages.The strong aesthetic of the minimal-yet-functional interface makes it easy to lose yourself in Endless Space. Informative tooltips tell you everything you need to know about any of the hundreds of weapons, improvements, planets, resources, and more in the game. Notifications bring up critical information without taking over your entire display. This is one of the best UIs Ive ever seen, adapting the best part of genre standards to Endless Spaces particular wrinkles and making a complex game intuitive to navigate.Prioritizing research, and therefore your empires overall development, is fraught with nail-biting decisions. Expanded manufacturing capacity isnt worth anything without the ability to build ships that can stand up to enemy fleets, and the best laser in the galaxy doesnt do much if your people are so unhappy that theyre striking in the shipyards. The tech trees four branches are expertly crafted to have soft dependencies linking the branches while still giving players the freedom to develop whatever they think best.Expanding and developing your empire is a well-crafted sandbox to play in even if the spreadsheets under the hood are a little too obvious at times, but Endless Space starts to run into trouble just as the intensity should be ramping up. Tedium starts to accumulate around 50 turns in, as each colony (a moderately sized empire should have between 6 and 15 at first contact) requires constant attention to make sure its building the right items, which change every 3-12 turns thanks to the breakneck speed of tech breakthroughs. By the hundredth turn, letting the crappy AI governors set your systems build queues looks appealing, despite their awful decisions, just to speed through the boring bits and get to the fun parts of interstellar diplomacy and conquest.Unfortunately, the braindead AI leaders you inevitably clash with lack anything approaching character;they make their bare few diplomatic decisions according to a transparent set of parameters. Their empire management isnt any better, as they love to spend huge amounts of resources building worse-than-useless system improvements that do nothing (improving gas giant production in a system with no gas giants, for example) except drain their treasuries with upkeep costs. Massive amounts of cheating on the AIs parts make the higher difficulties challenging, but beating them holds few thrills thanks to how bland Endless Space makes massive space battles.Managing fleets on the strategic level is fine, not least because of a simple set of actions that abstract naval maneuvers to interdiction, defense, and invasion of any given system. Combat, however, is a huge missed opportunity. By the time youre fighting anything larger than a skirmish between scouts or defending against minor pirate raids, youve invested a significant amount of time in researching, designing, and building your ships. Instead of letting players play with their toys and smash up foes with them, Endless Space lets you pick a tactic for each of three combat phases which then play out according to simple calculations. Watching a few low-rent animations of guns firing and missiles launching as two convoys pass by each other in deep space is no replacement for even the most simplistic of tactical combats.Despite those many gripes, Endless Spaces outstanding multiplayer implementation mitigates its worst faults while emphasizing the games strengths. Seamless drop-in/drop-out play with AIs taking over any slots vacated by humans makes finding a game or hosting your own a breeze. Simultaneous turns mean little waiting unless youre playing with a real slowpoke. Playing with other people obviously takes care of the AIs many problems. The tedium is still there, and combat is still lame, but appreciating what Endless Space does well is much easier in a multiplayer setting.Endless Space is far from a disaster despite its bad AI and unfortunate micromanagement issues, with excellent online play making it one of the better multiplayer turn-based strategy games around. My decade-and-a-half wait for the space empire savior continues, though.", "date": "Jul 17, 2012", "grade": "7.25"}