{"name": "Theatrhythm Final Fantasy", "ref": "https://www.gameinformer.com/games/theatrhythm_final_fantasy/b/3ds/archive/2012/06/28/solid-rhythm-gameplay-meets-a-legendary-tracklist.aspx", "text": "Final Fantasy games are adored for their music just as much as their stellar stories and RPG gameplay. Just one measure of any Nobuo Uematsu composition is enough to get your nostalgic juices flowing. Theatrhythm allows players to enjoy a plethora of Final Fantasy tunes by tapping along to the rhythm on their 3DS. The basic formula is simple and fun, despite some useless experience based-progression garnish.All the favorites are here, from the rousing 8-bit battle theme you killed your first goblin to in the original Final Fantasy to the distorted guitars of Final Fantasy XIII. Your job is to tap and flick the stylus to the melody as colorful notes pass by on the screen. The game recognizes every move without flaw. You only have your own lack of rhythm to blame if you fail a song, but that shouldnt happen often given that the game is easy to a fault on all but the most challenging difficulty level.Theatrhythm allows you to customize a battle party of popular characters, including charming cartoony versions of favorites like Cloud and Terra. They dont do much aside from prance across fields and aimlessly hack away at monsters, but they look adorable doing it. Your party acquires experience points and items as you progress, but I didnt notice any significant change to the core gameplay despite my characters leveling up and automatically tossing around potions and other items. The hollow progression feels like an excuse to play the iconic victory fanfare at the end of each piece. Despite feeling useless, the superfluous layer of complexity doesnt detract from the fun.Players can jump around the series timeline to play a collection of three tracks from a specific game, take on tunes at higher difficulties in challenge mode, or team up with a buddy to tackle random ditties in the chaos shrine. Up to four players can play together locally in chaos shrine mode, but sharing the burden of missed notes is more nuisance than fun and can lead to quick game overs.As a big Final Fantasy fan and enthusiast of video game music in general, I love being able to appreciate these classics in a new way. Ill always get a chill listening to the intense orchestral version of One-Winged Angel or the happy-go-lucky chocobo theme. The tacked-on progression system may be unsatisfying, but it doesnt stop Theatrhythm from being a fun, simple rhythm game with an amazing musical library.", "date": "Jun 28, 2012", "grade": "8"}