{"name": "Brave: The Video Game", "ref": "https://www.gameinformer.com/games/brave_the_video_game/b/xbox360/archive/2012/06/22/disney-39-s-latest-adaptation-delivers-action-and-kid-focused-co-op.aspx", "text": "Families have had it pretty good on the games front lately, with a solid crop of releases coming every month or so. Disney in particular has done a great job of translating its Pixar licenses into playable form. Brave: The Video Game comes off a nice wave of adaptations that includes Cars 2 and Toy Story 3, and it more than holds its own.You play as the movies heroine, Merida, as she battles to defeat the so-called demon bear Mordu and lift a curse. As with the film, Merida isnt a traditional damsel in distress. Shes strong and independent, and quite handy with her bow and sword. Shes a nice change of pace from Disneys traditional princesses, and her battle prowess makes her a perfect fit for a game.You swing your sword with the tap of a button, and use Meridas bow by aiming the right stick in the direction you want to fire. Ive always been a fan of twin-stick shooters, so the controls pleasantly surprised me. Its easy to take potshots at the wolves and malicious tree spirits from afar and then switch to the sword when they get too close. Targeting is generally accurate, though one crow-type enemy does a great job of avoiding your shots. I dont know whether Brave isnt great at tracking flying enemies or if crows are just crafty, but theyre a particular annoyance throughout the game.Fortunately, the rest of the game pulls no punches. Collectibles are hidden throughout levels, and they provide gameplay bonuses instead of the concept art and other useless doodads that typically pop up in licensed games. Merida is a powerhouse by the end of the game if you keep your eyes open for alternate paths. Even if you dont scour levels for collectibles, youll wind up with a solid arsenal. Enemies have elemental weaknesses, and you can swap between the appropriate magical attacks to quickly defeat them. Weapon effects are varied and can be charged up. Those beefed-up moves include an earth attack that spawns helpful explosive sprites and an ice effect that temporarily holds enemies captive. When you beat the bad guys (or pound unsuspecting flora), they explode in a shower of coins. Those can be spent on a variety of weapon and ability upgrades. Plenty of so-called grown-up games feature less character progression than Brave.No self-respecting family game can ship without co-op, and Brave is no exception. Behaviour Interactive made a smart decision in how it approached two-player action; a second player can join in as a friendly wisp. This character has unlimited lives, and can pop up next to Merida at the press of a button. This character is a natural for a younger player who might not have the chops to go it alone. I wish more developers would incorporate this kind of gameplay; inexperienced gamers-in-the-making can keep up without accidently dragging down the team.Brave provides a nice tour of the films highlights, and cleverly adds its own elements. Gameplay expands beyond its core formula, too. Three little bears help Merida gain access to blocked areas in puzzle-oriented sections. Theyre centered on buttons and levers, and require a fair amount of character swapping. That may sound dull, but I got a kick out of them. Some are even challenging.One of my favorite things in gaming is when a character gains access to a powerful item or transformation power, and uses it to mop up previously annoying enemies. Brave satisfies in that department, thanks to several short sections where you play as a ridiculously strong bear. A few Kinect-based archery games also factor into the mix, which I could take or leave.I had a lot of fun with Brave. The core action is simple, but the progression and element-based combat offer enough flexibility to keep things interesting  at least in the short term. Brave doesnt break the licensed-game mold as far as longevity is concerned. Once you play through the story and find all the collectables (which arent exactly obscure), youll be forgiven for shelving the game. You can replay levels and fully upgrade Merida, but at that point youd only be doing it for completions sake.That shouldnt dissuade you from checking out the game. Brave is charming and entertaining (while it lasts), and its one of the better kid-friendly co-op games out there. Its also a nice reminder to girls that females can be more than something to be rescued or objectified.", "date": "Jun 22, 2012", "grade": "7.75"}