{"name": "LEGO Batman 2: DC Super Heroes", "ref": "https://www.gameinformer.com/games/lego_batman_2_dc_super_heroes/b/xbox360/archive/2012/06/19/xxxx.aspx", "text": "The days of Batman mutely stalking Arkham Asylums escapees are behind us; the Caped Crusader finds his voice in Lego Batman 2. Despite being made entirely out of plastic pieces, this version of the character closely mimics the Batman from the animated shows. He speaks in deep tones, is cold and calculating, and above all, reminds us how he hates Superman. This is the first time characters speak in a Travellers Tales Lego game. The series brilliant use of pantomiming to deliver story will certainly be missed, but dont think for a second that the humor is gone. The banter between characters is funny, and the animators are responsible for a handful of great sight gags. The dialogue exchanged between Batman and Superman is the highpoint, and nearly worth the price of admission alone.Switching to spoken dialogue helps deliver a coherent narrative, something the first Lego Batman didnt do. The story once again draws parallels to Batmans animated shows; the Joker rudely interrupts Gotham Citys swank Man of the Year award ceremony, and Bruce Wayne, who is a candidate, ducks out to change into his Batman costume. From here on, the plot centers around the ensuing chase.As Joker rampages across Gotham and more villains are thrust into the spotlight, Batman eventually calls upon Superman and his Watchtower-based friends for help. This escalation of events is divided into three acts (although the game doesnt label them as such). The game starts with Batman and Robin working together for a few levels, shifts to Batman and Superman (the Worlds Finest) for a few stages, and then concludes with a small group of DCs mightiest heroes (the Justice League) working together.Although Lego Batman 2 still drops players into linear levels filled with construction-based puzzles, 10 hidden Minikits, and rooms filled with Lego objects that can be smashed, this is the first Lego title set within an open world. Lego Indiana Jones 2 explored the idea to a degree, but this game represents the full realization of that concept. The entire city can be explored from the outset, and is loaded with hundreds of secrets.Soaring across Gothams skyline as Superman is a real treat, especially since the Superman movie theme kicks in as soon as he takes flight. The flight controls work well in open spaces, but can be troublesome near buildings or in tight areas. Screaming down Gothams streets in the Batmobile (a thrill I hope to experience in a Rocksteady Batman game someday) is equally exciting, but is rarely used for anything other than driving from the Batcave to your mission.As beautiful as Gothams architecture is (much of it including giant, metal Lego titans), the activities in the overworld are repetitive and lacking the creative spark Travellers Tales has shown in its Lego games. If one gold brick is found behind a steel plate only Superman can remove, you should be on the lookout for a dozen more. Many of the gold bricks are hidden in the same ways, and it becomes a laborious task to hunt them all down. Dont worry, this isnt Grand Theft Auto  you dont need to search high and low without guidance. All of the hidden bricks, unlockable characters, and citizens in need of help are highlighted on the map. Travellers Tales has even included a handy marker that will lead you to your desired location.The most enjoyable secrets to track down are tied to Batman and Robins different suits  which often require a platform-heavy ascent up a skyscraper. The suits in the first Lego Batman game clashed with the Batman mythos. In this sequel, Robins hamster ball power is a head scratcher, and I dont know why Batman would ever engage any villain without invisibility on, but for the most part, the new multi-purpose suits are a better fit for this universe. Robin wears a hazmat suit to clean up Jokers chemicals. He also wields Mr. Freezes ice gun. Batman once again has his heavy armor and makes good use of his cape for gliding.Playing as the different Bat-types is fun, but their usage for puzzles and secrets is repeated far too often. The Justice League characters bring a wealth of new powers, but they are mainly used in the final stages and for the post-story secret hunting. These god-like characters are great additions  I just wish they were a larger part of the game. Flashs speed is harnessed beautifully, and Superman is the unstoppable juggernaut weve always wanted him to be in video games. This isnt saying much, but Lego Batman 2 is the best Superman game yet.Travellers Tales took some chances with Lego Batman 2. The addition of spoken dialogue paid off well, and I hope it becomes a standard for all of this developers games moving forward. Transferring the classic Lego gameplay into a vast overworld is also a success, but the redundancy in secret solutions in this play space hurts the experience, almost turning it into a mundane collect-a-thon. Thankfully, the classic Lego gameplay dominates the main game, making Lego Batman 2 another goofy brick-building blast to play.", "date": "Jun 19, 2012", "grade": "8.25"}