{"name": "Civilization V: Gods & Kings", "ref": "https://www.gameinformer.com/games/civilization_v_gods__kings/b/pc/archive/2012/06/18/review.aspx", "text": "My love for Civilization V is enthusiastic and unapologetic. Gods & Kings is an outstanding expansion for players like me who found reasons to sink 200-plus hours into the base game. The major features it adds, religion and espionage, integrate smoothly into the Civ V experience and add interesting options without introducing unnecessary tedium or micromanagement.One of Civ Vs strongest aspects is how forthright and direct the consequences of your decisions are, and Gods & Kings maintains that core design tenet. Each belief incorporated into a religion or skulduggery undertaken by a spy has an obvious, powerful impact. Instead of adding together minor multipliers to tweak your research efficiency, youre rigging city-state elections, stealing technology outright, converting whole cities to new beliefs, or enabling entirely new religious buildings.Gods & Kings greatest success is how it enhances the Civ V experience without adding appreciable complexity. With rare exceptions, the players input into matters of religion and espionage are limited to single decisions every five to ten turns or so. As streamlined as it is, Civ V is still a massively complex strategy game. The way that the expansion keeps the players attention on big-picture global politics and empire development is a significant accomplishment.Fleshing out a great deal of diplomatic nuance that the base game lacked is Gods & Kings third pillar. Though your responses to rivals statements are still binary in most cases, most have real consequences now. Chiding a belligerent empires aggression toward a friendly city-state could spark a war, while forgiving their actions dramatically hurts relations with that minor nation. Breaking a promise to stop expansion near a neighbor has wide-reaching negative diplomatic effects. Rather than the often-obtuse decisions by AI leaders in the base game, you can usually see the path of reasoning that led to the current state of geopolitics. Additionally, the quests given out by city-states to win their approval are much more varied, and foster richer interactions.Balance is different in the expansion, and Im torn on whether its an improvement or a step back. The addition of new luxury resources as well as the ready availability of happiness boosts through religion makes it much easier to maintain civic order. This makes expansion far simpler, and unfortunately the AI often cant keep up. Even with a large, sprawling empire, I have been able to maintain happiness in the 30s and higher (levels unheard of in vanilla Civ V) while largely ignoring happiness buildings like colosseums and theaters. As in the base game, AI leaders regularly leave vast swathes of territory inexplicably uncolonized and consequently get buried under larger empires. Rapid expansion has always been the dominant strategy in Civilization, and the change to happiness in Gods & Kings swings the needle farther in that direction after the base game went to such pains to ensure that smaller empires had a viable path to victory.The Civ V AI that many players despise is improved in Gods & Kings, but not by a lot. It still fails to capture cities it should easily roll over thanks to baffling tactical stupidity, and it still doesnt expand as far as it should in most cases. At least you dont run into unimproved tiles around AI capitals in the mid to late game anymore, and its much better about upgrading its units instead of sending warriors to die uselessly against crossbowmen.My enthusiasm for Civ V has continued unabated for a full year now, and this expansion adds new fuel to the fires of conquest that still burn in me. Despite the days of playtime Ive put into the base game, I cant imagine going back after a few rounds with Gods & Kings. I strongly recommend this expansion to all Civ V players  though you may need to jump a difficulty level to account for how powerful the new toys are.", "date": "Jun 18, 2012", "grade": "8.5"}