{"name": "Metal Gear Solid HD Collection", "ref": "https://www.gameinformer.com/games/metal_gear_solid_hd_collection/b/playstation_vita/archive/2012/06/15/metal-gear-solid-hd-collection-vita-review.aspx", "text": "No matter how theyre shuffled, remastered, or repackaged, Metal Gear Solid 2 and 3 are great games. The exploits of Solid Snake, Raiden, and Big Boss have generated some of the most memorable experiences in gaming, and that isnt going to change. Despite that, Konami seems to be making a focused effort to wear out fans patience with this handheld HD Collection. It isnt ideal for newcomers or for longtime fans, diminishing both its audience and value. Included in the collection are enhanced versions of the two PS2 entries in the Metal Gear series. Each one includes the bonus content and extra features added after their initial releases; you get VR missions and Snake Tales in MGS 2, and improved camera control along with the original MSX versions of Metal Gear and Metal Gear 2 in MGS 3. On one hand, this collection provides two awesome games to play on the Vita. On the other hand, it feels like a weak effort when compared to the PS3 and Xbox 360 collection of the same name.The most baffling and noteworthy difference is the exclusion of Metal Gear Solid: Peace Walker from the Vita release. Peace Walker is far from my favorite MGS game, but it continues the story of Big Boss and picks up some important threads from MGS 3, so its hard not to feel cheated by the omission. Peace Walker was also the only way to experience multiplayer in the console release, so this handheld collection is strictly a single-player affair. In other words, Vita players have waited longer for this collection only to get considerably less.My other problem with the Vita version is that the addition of touch screen controls rarely help  and occasionally hinder  the gameplay. Item selection is no longer on the triggers, so you switch your loadout by touching the screen and sliding your finger around. The old menu system was far from perfect, but in fights with frequent weapon swapping, the new mechanic feels even sloppier and more jarring.The back touchpad also has spotty implementation. Its used for knife stabbing in MGS 3, and for slight first-person camera adjustment in MGS 2. However, my grip on the Vita resulted in several errant swipes across the pad, which was annoying but never had disastrous results. Other control switches, like pressing down on the d-pad to raise and lower your weapon, are necessitated by the Vitas lack of pressure-sensitive buttons. These changes arent nearly as distracting as the touchscreen stuff, but they certainly arent improvements, either.Despite an entire game being excised from the package, the MGS HD Collection still costs $40 on Vita  the same price as the PS3 and Xbox 360 version at most retailers. If you already own the title on PS3 and want to transfer your saves between devices to play Metal Gear on the go (and maybe earn some extra trophies), then maybe this trimmed-down version is worth considering. If youre not that kind of Metal Gear fan, then you dont need to waste another thought on this release.", "date": "Jun 15, 2012", "grade": "7.75"}