{"name": "Dirt Showdown", "ref": "https://www.gameinformer.com/games/dirt_showdown/b/xbox360/archive/2012/05/24/turning-into-dust.aspx", "text": "Dirt Showdown tries to tackle a tall order, and not because the games aggressive driving is a slight tweak on the sim-based off-roading of previous titles in the franchise. The progression path of a game like Gran Turismo entices gamers with a trickle of new cars, but since Dirt Showdown has to keep and hold players attention with exciting and unconventional ways to race, the stakes are higher. While Dirt Showdown creates a fun new avenue for the franchise, its hard pressed to sustain its surprises throughout the entire experience.As you make your way up the career ladder, youll hoot and holler at events like 8 Ball (the track folds in on itself and creates opportunities for jarring T-bones), demolition derbies such as Knockout (you drive opponents off a raised platform and earn double points in a last-minute frenzy), or Hoonigans Head 2 Head races that mix enclosed rally-cross tracks with gymkhana objectives. I expected this to be just the beginning, but as I progressed up the career tiers and wanted the game to expand and offer new race types and experiences, I was disappointed that this didnt happen to the extent that I was hoping it would.For its part, multiplayer does add some options. You can play any of the games race types in eight-player free-for-alls or with teams, or participate in multiplayer-only events like Smash and Grab (similar to Halos Oddball). The freestyle gymkhana compounds also return with multiple areas to open up and loads of objectives to knock down. Unfortunately, these free-form gymkhana areas are not open to multiplayer apart from leaderboards.Despite Showdowns limitations, as it has with its other games, Codemasters has provided this title with a solid foundation. The handling of the cars is thankfully easier than the base Dirt series (including in the Hoonigan events), and the balancing on the Boost ability is great. Codemasters first try at this offshoot series is decent. Its limited more by its execution than its premise.", "date": "May 24, 2012", "grade": "7.5"}