{"name": "Joy Ride Turbo", "ref": "https://www.gameinformer.com/games/joy_ride_turbo/b/xbox360/archive/2012/05/23/marginally-better-without-kinect.aspx", "text": "Kinect Joy Ride was a great approximation of driving a car with a stuck accelerator. The game handled the gas and brakes automatically, leaving players with the odd sensation of steering an out-of-control vehicle with an imaginary wheel. The Kinect launch title did an adequate job of giving the peripherals new owners something to show off to friends, but it ultimately strengthened the case for traditional controls.Interestingly enough, Joy Ride didnt start out as a Kinect title. When Microsoft revealed the game back at E3 2009, it was a free-to-play downloadable release. The plan was that players would take their newly announced avatars to the track in a series of microtransaction-fueled races. BigPark closes in on that original vision with Joy Ride Turbo, though the game is now available in one big chunk on Xbox Live Arcade.If youve ever played a kart racer before, you should have a pretty good idea of what to expect from Joy Ride Turbo. The bulk of the game is split up into several championship series, comprised of three races apiece. Each of the three horsepower tiers (essentially difficulty settings) also has a longer grand prix event based on five-lap races instead of the traditional three. Score enough points over the course of a series, and congrats. Youre a winner!Of course its not entirely as simple as merely outracing your opponents. This is a kart racer after all, so success is as dependent on avoiding your opponents traps and attacks as it is memorizing optimal racing lines. The formula is relatively standard, and Joy Ride Turbo checks off all the appropriate boxes. For instance, youve got your missiles, exploding item boxes to fake out your rivals, and speed boosts. Fortunately, the game has enough tricks of its own to keep things from feeling too stale.Joy Ride Turbo has 10 different tracks to race on, including all seven from Kinect Joy Ride, and theyre all nicely designed. With only three new tracks, this is more of an incremental upgrade than a full-fledged sequel. Aside from cosmetic differences  palace grounds, airplane graveyard, seaside resort, etc.  each track has its own feel. In the returning Cannon Crossover, for example, players race into cannons to explode across vast sections of the track. Gold Rush Road is filled with ramps and alternate paths. Badlands Motorplex is the biggest departure from the games focus on fantasy, with its lack of weapons and emphasis on precise cornering. Ten tracks may not seem like much, but the overall emphasis on exploration and shortcuts can make each lap feel fresh. Aside from shaving precious seconds off your time, driving off the paved path has its own rewards. There are a ton of crates scattered throughout the tracks, and collecting them unlocks additional cars and skins.Unfortunately, the vehicles feel heavy and sluggish, which can be a drag. Steering is certainly more responsive than its Kinect-based predecessor, but even the fastest-accelerating rides carry the sensation that theyre towing invisible trailers. One of the ways you earn valuable boost juice is by performing midair spin tricks and flips, and even the most petite convertible sails through the air with the grace of a dump truck. I did eventually grow accustomed to the way each trick crawls to a start, but it never felt satisfying.In addition to the championship series, you can play quick races (with or without weapons) or play with friends via four-way splitscreen or against up to eight people online. I had the most fun in the games stunt park. In that mode, players pick from a pair of large, open areas and basically dink around. There are crates and trophies to collect, and a wide array of ramps and half-pipes, and other fun places to explore. My favorite part is how you can choose to race around on your own terms, or pick up tokens scattered throughout the grounds. Those collectable tokens are arranged in lines, which lead you through interesting sections and areas to visit. It would have been great if some of the other modes featured in Kinect Joy Ride were present, such as more structured stunt modes, but for my money the freedom that the stunt park offers makes up for those omissions.Joy Ride Turbo may not reinvent kart racing, but there are enough interesting spins on the genre to make it worth a try. This time around, it feels like an actual game and not just an extended tech demo. If you can shift down your expectations somewhat (and give up your dreams of breaking any land-speed records), Joy Ride Turbo delivers a solid arcade-racing experience.", "date": "May 23, 2012", "grade": "7"}