{"name": "Dragon's Lair", "ref": "https://www.gameinformer.com/games/dragons_lair/b/xbox360/archive/2012/05/22/time-hasn-t-been-kind-to-dirk-and-company.aspx", "text": "Dragons Lair is finally (inevitably?) available on the Xbox 360, which begs the question: What took so long? The arcade game has been ported more than five dozen times to various systems since its 1983 release, and the Xbox 360 has been on the market for six years. What does that patience get you? Well, the Xbox Live Arcade version adds Kinect support and is a faithful recreation of the original. In other words, its the same awful experience that it was 30 years ago.Audiences were easily wowed in the early days of gaming. Compared to contemporaries like Spy Hunter and Mario Bros., the original release of the fully animated Dragons Lair was a revelation. The games attract screen did its job, drawing in passersby with the prospect of actually playing through a cartoon. Thats right, you could take control of an animated character and lead him through an epic adventure in a trap-filled castle, slaying a dragon, and even saving a beautiful princess.In reality, players who dropped two quarters into the slot were treated to a repetitive and barely interactive slog. The gameplay was simple, even by that eras standards. Watch Dirk the Daring enter a room, stumble into a deadly situation, and then tap the joystick or sword button at the appropriate time. Hit the correct input, and Dirk would proceed unscathed. Miss the cues, say by trying to attack an enemy instead of instinctively knowing to move up, and you die.Even as a kid, I knew it was a complete rip-off, and Ive been bewildered by its continued rereleases over the years. This is, after all, a video game thats barely a video game by any objective measure. You can play it on a standard DVD player, for crying out loud.That being said, the Xbox 360 version is as close an approximation of the real deal as you could hope for. There are a bunch of different options to play with, such as adding helpful onscreen prompts and additional lives, or you can stick to the vanilla game. The truly adventurous can put Dirk through his paces using Kinect. I found this to be particularly frustrating. Dragons Lair requires a degree of precision that Kinect simply cant consistently deliver. Hopping in the four cardinal directions works in some slower-paced sections, but with some encounters  such as with the Black Knight  the window is too small for it to be reliable. The motion-based sword attack doesnt fare any better; I could get it to recognize the maneuver roughly 20 percent of the time. Theres also a turn-based co-op mode which seems to exist for the sake of existing; it doesnt add anything to the experience.Despite absolutely loathing the game, I still look at Dragons Lairs characters fondly. Dirk is a fun hero, and I still get a kick out of watching him bumble through his quest. I just vastly prefer watching it all on someone elses dime or its auto-play mode. Thats because, as a game, it remains a spectacular failure.Dragons Lair is a lot like the chicken pox. Its probable that youll experience it once in your lifetime, and thats more than enough.", "date": "May 22, 2012", "grade": "3"}