{"name": "Awesomenauts", "ref": "https://www.gameinformer.com/games/awesomenauts/b/xbox360/archive/2012/05/18/a-moba-for-the-rest-of-us.aspx", "text": "Dont be fooled by the screenshots. Awesomenauts may look like a Mega Man-inspired 16-bit throwback, but its actually a 2D, pared-down version of popular MOBA (multiplayer online battle arena) games like League of Legends. In many ways, its a perfect introduction to the concepts of the genre, within a framework that will feel familiar to gamers that grew up on more conventional action games.From the first moment you boot the game up, Awesomenauts displays a sly sense of humor and great deal of charm. Its clearly inspired by late 80s and early 90s cartoons, and even has a great Power Rangers-style cheesy rock theme song. The song perfectly captures the vibe of shows like Mighty Morphin Power Rangers. The cast of characters is diverse, from the corny hip-hop amphibian Froggy G to the Mars Attacks-inspired Voltar the Omniscient. At first blush, the game appears simple. You and two other players descend into the level via small crash landing pods, attack the opposite teams fortified gun turrets with the help of small blast droids that spawn automatically on the battlefield, and try to blast through them to destroy their Solar drill and win the match.In many ways, it is that simple. However, after I got my butt kicked for a few matches, I saw the tremendous amount of depth hidden behind the cartoonish aesthetics. Each character has a diverse set of abilities. Some, like Froggy G or Sheriff Lonestar, have fairly conventional movesets and carry guns of various sorts. Voltar is a defensive healer, which can be frustrating if you prefer combat. However, good teammates will learn how to work together  pairing Voltar with one of the lumbering tank characters like Clunk can be a powerful combination in battle. Even though, like many, Ive all but given up on voice communication with random strangers online, Awesomenauts really does reward good planning and teamwork.You must also use your blast droids and turrets effectively. Turrets defend themselves automatically with powerful mounted guns. On offense, you must wait for your droids to approach them and block the gunfire so you can attack  or attack from a higher platform while a teammate draws fire below. On defense, I found it effective to use a push or pull attack  like Sheriffs stampeding bull or Leon Chameleons tongue grab  to force enemies into turrets, exposing them to heavy damage.Each character has a jump, main attack, and two face button slots to equip for special attacks. All abilities can be upgraded before or during a match near the entry point for the level (a quick warp button makes it easy to jump back to the inventory store to buy new upgrades). As you gain XP and level (up to level 45), youll unlock new upgrades for all abilities  and youre even able to select the three upgrade levels that are available to you during a match.Once you dig into mastering each characters abilities and upgrades, youll realize just how much depth developer Ronimo Games has integrated into an accessible, easy-to-learn design. However, this comes at a bit of a price. Since upgraded abilities are so key to victory, a snowball effect frequently occurs during matches. Better players stay alive longer, unlocking more attack upgrades, therefore becoming even more powerful. During nearly every match I played online, one player seemed to be dominating the action (spoiler alert: it wasnt me). Still, I was never frustrated. Like any well-done multiplayer game, you learn something new in each loss, and eventually I was holding my own.If youre looking for single-player, look elsewhere. There is a practice mode with bots, but no single-player campaign. I have no problem with this decision  developers have to focus, and Ronimo was clearly intent on creating the best multiplayer experience possible. I also appreciate the fact that the game allows you to play online with three players on one console  a big plus if you want to engender true team play. Even playing solo, I found that the quick matchmaking worked admirably. I never waited long to get into a match, and dropouts and rage-quitters were instantly replaced by bots until a new player could be found. If youve been curious about MOBAs, you couldnt pick a better place to start than Awesomenauts. The three-on-three battles are easier to get your head around, but theres still a ton of depth in balancing your team and each characters various power-ups and load outs. Its one of the years early multiplayer highlights. Dont miss it.", "date": "on May 18, 2012", "grade": "8.5"}