{"name": "Minecraft", "ref": "https://www.gameinformer.com/games/minecraft_xbox_360_edition/b/xbox360/archive/2012/05/09/minecraft-xbox-360-edition-review.aspx", "text": "The indie darling Minecraft has now forged its way onto consoles, giving those players a chance to see what all the fuss is about. To its credit, Minecraft Xbox 360 Edition is largely the same fascinating game as its PC counterpart, giving players an open world and the tools to make the most of it.If youre not familiar with Minecraft, let me quickly break down the basics for you. You start out in a massive, randomly generated world with only your wits and a map (a nice starting bonus for console players). The game is divided into days and nights, and youll quickly learn that the difference is more than cosmetic. When you begin, you start by punching trees to collect wood, which can then be crafted into planks and sticks. You combine those materials with other scavenged materials, like stone, to make better tools and structures. During the daylight hours, you can accomplish these tasks hassle-free, but the freaks come out at night (unless youre playing on the games peaceful difficulty setting).When I fired up my first world, I squandered much of that initial day roaming around massive sand dunes, towering waterfalls, and clusters of bleating sheep. By the time the sun went down, I was woefully unprepared. I had to frantically dig in the sand to stay safe from the encroaching zombies, giant spiders, and notorious creepers. Even though the only penalty for dying would be losing my meager possessions, I was determined to at least live through my first virtual day. After spending an excruciatingly long evening in a hole, I was determined to get to work. I climbed atop the tallest dune I could find and started work on my palace. Fortunately, I found enough trees and stones in a nearby glade to get me up and running.I was relieved to see that the cursor moves smoothly and that placing and mining blocks became second nature. You do a lot of those things in the game, and not being able to plop blocks down exactly where you want them would have been a frustrating deal breaker. As it stands, I was able to build just about everything I envisioned with ease, from torch-lined staircases that plunged deep underground to sanctuaries and statuary.The interface has been tweaked to accommodate the 360s gamepad, and it works well. I thought it was a bit clunky at first, but handy shortcuts such as quickly shuffling items between inventory space, equipped items, and storage are godsends. The crafting interface has been overhauled as well, replacing the original games trial-and-error ingredient box to something that provides welcome direction. Items are grouped by their basic category in tabs, such as tools or building components, and once selected theyre arranged in a horizontal row. Variants, such as wooden, stone, and iron pickaxes, are then selected by moving up and down. If you imagine something along the lines of the PS3s cross-media bar, you wouldnt be too far off. The required components for a particular item are shown in a box at the bottom, which is helpful if you dont know how to go about making beds or doors or torches from scratch.Eventually, I had a nice home filled with a crafting table and furnace, hardwood floors, and a cozy bed to snooze past the night. A torch-lined wall kept interlopers at bay, and I built a sentry tower on the roof to monitor my homestead. After digging deep beneath the dunes for rare minerals (which was largely in vain), I swam across the inlet toward the jungle Id been eying. An hour later, and I had built up an all-new area, even better than my initial home base. Ive kept repeating that cycle for hours upon hours, and for some strange reason it still remains fresh and exciting. Its true that the worlds in Minecraft 360 Edition are smaller than on PC (only about 1,000 blocks versus nearly infinite width), but I never ran into the invisible walls unless I was setting out to do so.Purists may scoff at the fact that the 360 port sheds the originals this plus that does what? crafting mystery, but I didnt miss it at all. For me, Minecraft is more about exploring the environments and making the most of your world rather than bungling through arcane recipes. Better still, the entire game can be explored with four players via splitscreen on one console, or with up to eight players online. I was a bit disappointed to see that elements from the 1.8 Adventure Update didnt make the transition, however. Mostly, I missed the additional construction materials, such as panes of glass, and NPC villages. The hunger meter? Not so much. Future updates are promised, and itll be interesting to see if the console version ever reaches parity with PC Minecraft.Those shortcomings aside, Minecraft more than delivers in most other ways. Ive always been a fan of games that emphasize exploration and freedom, and thats what Minecraft is at its core. I absolutely love the feeling I get from scaling a blocky mountain and seeing a wide-open expanse of pure possibility in the distance. It was revelatory when it was released on PC, and Xbox 360 players now have a chance to experience all the wonder that Minecraft offers.", "date": "May 09, 2012", "grade": "8.75"}