{"name": "The Walking Dead Episode One: A New Day", "ref": "https://www.gameinformer.com/games/the_walking_dead_episode_one_a_new_day/b/ps3/archive/2012/04/27/telltale-breathes-fresh-life-into-the-zombie-apocalypse.aspx", "text": "Telltale Games hasnt always been able to live up to the promise of its licensed properties, but not for lack of trying. The company stays true to the heart of each franchise; the Sam & Max and Strong Bad titles tap into the unique humor of both franchises, and Back to the Future feels like a real trip back in time. These titles werent bad, but they held little appeal to anyone other than diehard fans of the properties. The Walking Dead, on the other hand, might be the companys first game that can reach beyond an already devoted base and earn a broader audience.The game opens in the back of a police car. You are Lee Everett, a convicted felon whose crimes are ambiguous. As you banter with the sheriff behind the wheel, it quickly becomes clear that something terrible is happening within the city behind you. Police convoys wail towards the city, and the shortwave radio sitting in the front of the car is squawking with activity. Eventually, disaster strikes your transport, and you are set free  free to survive a world gone to hell. The Walking Dead is an artfully told narrative; Lees backstory and crimes are slowly revealed, and watching this character evolve throughout the episode is one of the most compelling aspects of the adventure.This first installment  and presumably the rest of the five-episode series  is about struggling to survive in a world gone mad. How do you find sustainable food sources in a world that wants to eat you? The comic and the show do a good job of exploring this topic and Telltales adventure slides neatly into the series fiction. Lee quickly teams up with a small crew of survivors and bonds with a young girl whos lost her family. The game even offers Walking Dead fans a chance to interact with franchise mainstays like Hershel and Glenn.Many games about the zombie apocalypse feature frantic action and gunplay, but the majority of Telltales experience is crafted around making quick decisions. Most of the dialogue choices  and all of the important decision moments  come with a time limit. Wait too long to choose and characters assume youre opting for the silent treatment. Hesitate to act when people need your help, and they die. The full effects of these choices likely wont be seen until two or three episodes down the road, but Telltales splintering narrative is certainly intriguing. These choices carry extra weight because of how they affect the storys progress. If you stand up for someone during a fight, that person will remember your loyalty and thank you later. If you dont stick to the truth and your story starts to contradict itself, someone might pull you aside and call you out on your lie. The cast varies depending on who you assist during crucial story moments. Thankfully, no matter who you end up with, the ensemble is always interesting even if the voice acting is a little uneven. Every character is well written, featuring a mix of heroic traits and flaws.The Walking Deads narrative is strong, but the title shambles along in a few other areas. Players have few reasons to explore the small, self-contained environments due to the limited number of interactive objects and a meager selection of items. Some of these tools also function as weapons, but you wont feel empowered while using them. The Walking Dead isnt an action game, but taking down a zombie rarely feels rewarding because the combat is overly simplistic. Occasionally, youll go toe-to-toe with one of these flesh eaters, but all you have to do during these sequences is highlight the area you want to attack and tap a button. In this way, combat boils down to clicking over a zombies skull while holding a hammer or an axe or some other destructive tool. Fortunately, combat is rare, so its faults dont detract much from what the story does well.Puzzles are few and far between, but unlike combat, theyre enjoyable. Rather than solve a block puzzle or rearrange chess pieces on a desk, you must overcome environmental challenges. For example, how do you clear out a street full of zombies so that you can run across the street? How do you take down a group of zombies with a sparkplug, a pillow, and a gun without making a ton of noise and attracting a larger horde? I enjoyed working my way through situations like these, but they arent frequent enough. I wanted more puzzles to balance out the narrative-heavy experience. With The Walking Dead, Telltales experimentation with an unusual formula pays off. With its focus on dialogue choices and puzzles that more naturally fit into a narrative, The Walking Dead is a unique experience. In less than three hours, the game delivers a thoughtful, character-driven story that takes a refreshing look at the zombie apocalypse. And like any great episodic show, I'm eager to see what happens next.", "date": "Apr 27, 2012", "grade": "8.25"}