{"name": "The Splatters", "ref": "https://www.gameinformer.com/games/the_splatters/b/xbox360/archive/2012/04/17/throw-goo-at-bombs-in-this-experimental-playground.aspx", "text": "The Splatters began its life as Confetti Carnival in the indie games circuit, but after some consideration from developer Spiky Snail, it received a name change to more accurately reflect the main gameplay goal, which is to splatter goo.The Splatters is a puzzle game where you throw colored goo at bombs. Soaking the bombs in the splattered goo causes them to explode. Destroying all the bombs completes the level. It sounds simple, but as any good puzzle game demonstrates, its much more complicated than that. What begins with goo splashing across bombs quickly turns into experiments in physics and frequent prayers to Lady Luck.Pulling the trigger reverses the trajectory of everything in the air, momentarily stopping your goo in mid-flight and sending it in the opposite direction. You can propel your goo into a wall to soak a few bombs on the left, then tap the trigger to send it speeding to the right to take out the bombs on the other side. Sometimes, your goo wont soak a bomb, and instead knocks it from its original position, and when you perform a reversal with a dislodged bomb in the air, it goes flying across the stage.All the splashing goo gives The Splatters a feeling of controlled chaos, something you dont often get from a puzzle game. Usually youre planning out your moves and looking for the single solution to move forward. The Splatters gives you the freedom to try many different approaches, and it makes the game feel different while still settling comfortably into the puzzle genre. Its easy to promise yourself one level and play for three hours when there are so many approaches to each puzzle.Much of the experimental nature comes from the option to reverse trajectory, which is unlimited. The only disadvantage to using it repeatedly is that your combo timer (which is unaffected) continues running down, causing your score to take a hit. You have a limited number of goo blobs to throw at the bombs, but you can keep them in the air building momentum for as long as you want.Every level can be solved in multiple ways  a feature with advantages and disadvantages. Without a single solution to strive for, you miss out on the puzzle-solving epiphanies. Instead of experimenting until you have a clear moment of discovery, you try the same things over and over with small changes until the liquid physics work in your favor.The biggest problem with The Splatters is that doing the same thing over and over doesnt always yield the same results. In Tetris, dropping a piece to create a full horizontal line will always delete the line, but in The Splatters, crashing goo above a group of bombs will not always take them all out. It can be frustrating, especially in the later levels when every ounce of goo becomes important. Luckily, holding the back button restarts the level quickly when your plans dont pan out.The Splatters simple mechanic of flinging liquid to destroy bombs feels like a cross between Angry Birds and Peggle in all the right ways. You have a lot of control over the direction of your flying splatters, but an element of luck (maybe too much) determines how many bombs you are able to take out. When you mess up, blaming the game is easy, but the successful runs make it worth trying again over and over.", "date": "Apr 17, 2012", "grade": "8"}