{"name": "World Gone Sour", "ref": "https://www.gameinformer.com/games/world_gone_sour/b/ps3/archive/2012/04/13/sweet-and-sour-elements-abound.aspx", "text": "I initially had very little confidence in World Gone Sour. After all, whats to separate it from previous crap advergames like Doritos: Crash Course and Yaris? For one, this costs $5 to play, unlike other free offerings. The price tag isnt necessarily unwarranted; I can safely say that World Gone Sour is a real game, and a not-too-shabby one at that.You control a green Sour Patch Kid and platform your way through a movie theater concession stand, a kids room, and a creepy shed. All the standard running, wall jumping, and ground pounding is here with only mild floatiness to the controls. The design was taken directly from LittleBigPlanet, with little guys running around large, realistic environments with lots of depth of focus. Its amusing to jump across french fries dipping in and out of boiling grease, read fake book titles and candy brands, and dodge steak knives hooked to rotating poles. Though after awhile you start to see the same gags and obstacles again or maybe a hammer tries to crush you instead of a piston.Your Sour Patch Kid runs around trying to find other kids, get collectibles, and stomp on the end-of-stage springboard. The kids will follow you around, functioning like the eggs in Yoshis Island; you toss them at enemies like gum creatures and dust bunnies, or use them to hit switches. After you gather enough kids, you can grow to medium or large size at the press of a button. This makes you jump higher, throw farther, and slam down harder. Staying big is the ideal strategy most of the time, but some platforming is easier with a little guy, and its the only way to get through small cracks.Collectibles are generously littered across the stages, and theyre all satisfying to pick up. My favorite activity was crossing off the list of different ways to kill your candy kid followers on every level. Burned: check. Impaled: check. Flung into oblivion: still need that one. Completing this, along with other collection goals, grants a score boost at the end of a level. Sadly, the only reward is a higher spot on the leaderboard.The worlds are fun to explore and navigation captures the right balance between challenging and doable. Checkpoints are generous and things youve already killed or collected stay that way so backtracking isnt an issue. Two players can also team up in local-only co-op. Here youll have to split the stash of kid followers and it can get cluttered with all of those similar looking candies running around. On the plus side, you share one giant score and can resurrect your partner at any of the several checkpoints without losing a life (of which there are a ridiculous number anyway). The strangest aspect of World Gone Sour is the way the story is told through the narration of Creed Bratton (of The Office fame). He maintains the craziness of his TV character, yet makes it clear that he couldnt care less about the purposely dopey plot of a candy kid who just wants to be eaten. At the end of the game, he half-heartedly exclaims, Whoop-de-do. You won. Its ballsy to give voice to disinterested gamers before they can come to that conclusion themselves. Im just disappointed that he all but disappears outside of cutscenes once the tutorials are over.That pattern continues throughout World Gone Sour. Everything starts out surprisingly fun, but before long things get repetitive. Gameplay gets old, songs keep repeating, and after awhile youre ready for it to be over. The absurd cutscenes and occasional boss battles pull you through, and then youre rewarded with an awesomely ridiculous music video from Method Man based on Sour Patch Kids.I have to hand it to Kraft for letting its brand be portrayed in such a weird and dirty light. While World Gone Sour wont win any awards, it at least earns some street cred as a genuine video game. Perhaps thats all the corporate giant wanted anyway.", "date": "Apr 13, 2012", "grade": "6.75"}