{"name": "Tropico 4: Modern Times", "ref": "https://www.gameinformer.com/games/tropico_4_modern_times/b/pc/archive/2012/03/29/tropico-4-modern-times-review-the-future-of-city-simulation-is-now.aspx", "text": "If youre waiting to play the new SimCity, I suggest checking out Tropico 4. You should play the base game right now, and then pick up this outstanding expansion. Tropico 4s blend of Internet geek humor, tongue-in-cheek references to Cold War politics, and deep yet inviting gameplay is as skillfully executed in this expansion as in the excellent base game.Basic gameplay mechanics are unchanged, as youd expect. You still lure immigrants to your island, make sure they have jobs and needs like housing, food, and religion covered, and exploit their labors for your own glory. A happy populace is a productive populace, but so is a cowed one  repressing your peoples rebellious tendencies with secret police and a strong, loyal army is as valid as making them so happy with your rule that they gladly re-elect you in a landslide.Modern Times takes the originals 50s to80s time frame and pushes a decade further. Electronics factories, borehole mines, and solar power plants take the place of subsistence farming and dirty coal plants. More advanced farming techniques make supporting your populations basic needs easier and open up the opportunity to invest your treasury in taking your economy to the next level. This is fun in itself, but more importantly lets the campaigns scenarios throw tough, innovative challenges at the player.I never thought Id fund a mad scientists experiments or deal with a zombie plague in a laid-back city builder like Tropico 4, but Modern Times starts there and only gets wackier. The story doesnt even begin to take itself seriously, but the caricatures of pop culture figures and send-ups of Internet memes are recognizable enough frameworks to prop up this goofy tale. The finale could have been more explosive, but I thoroughly enjoyed every minute.The one thing Tropico 4 and Modern Times both do poorly is engage players in sandbox mode. A decent randomizer for natural disasters and more sliders to customize your experience would greatly extend replayability, but developer Haemimont continues to drop the ball. The mod scene could have filled that void given the map editors solid integration, but it has yet to really take off.I have some qualms about Modern Times balancing, particularly the ludicrously profitable factories and fish farms, but those cast almost unnoticeable shadows on the games otherwise impressive accomplishments. At this point I hope SimCity lives up to Tropico, not the other way around.[Note: Tropico 4: Modern Times is coming to Xbox Live Arcade as well, but we were unable to obtain a copy for review quite yet. If there are any substantial differences, we will publish a separate review. In the mean time, please take this as our definitive review.]", "date": "Mar 29, 2012", "grade": "8.5"}