{"name": "Angry Birds Space", "ref": "https://www.gameinformer.com/games/angry_birds_space/b/ios/archive/2012/03/23/angry-birds-in-space-review-angry-birds-in-spaaaaaace.aspx", "text": "Angry Birds Space could have easily been a slightly modified version of the game we already know and love. As long as the structures holding the pigs were new and the art was different, Rovio would have still sold plenty. Instead, the developer released a game that feels like a true sequel to the physics-based title that has helped define modern mobile gaming.Angry Birds Space, as the name so expertly clarifies, takes place in space. You launch assorted birds at sleeping pigs in questionable structures, with and without the aid of gravity. Sometimes you use the gravitational pull of small planets to help slingshot birds towards their destination, reminiscent of the gravity shenanigans featured in Super Mario Galaxy. Launching your birds into the black void is an awesome feeling, as is watching them get pulled into a planets orbit and striking down the poorly assembled pig structures. These new mechanics mean that luck plays a larger role in Angry Birds Space. I had a few occasions where my bird would do a few rounds flying around a planet before it finally hit the pig it was going after. It was exciting, but coincidental; I didnt feel as though I had any control when this sort of thing happened.Most of the birds are carried over from previous games (or familiar but modified), though two new types join the cast. The first one explodes and turns everything around it into weakened ice, but the other new addition is even better. The second new bird gives you nearly full control over the flight path. After you launch the triangular purple bird, you can tap any location on the screen to send him on a collision course towards your finger. It lets you target specific locations, and is invaluable when it comes to working around gravitys pull.There is also a new power that allows you to use a bird to create black holes and rip apart the levels that are giving you the hardest time. Ive already dubbed these fowls the cheat birds. Theyre cool, but its difficult to escape the feeling that you are taking advantage of dark powers that shouldnt be meddled with whenever you use them.Angry Birds Space also has boss fights. You get a larger cache of birds to throw at a pig in a moving mech suit, and it feels different from the main game. Youre not attempting to knock over stacks of wood to crush pigs, or doing the same amount of careful planning. You can use explosive birds and boxes to launch asteroids at the boss, or simply throw birds directly at him. Knocking the pig out of his mechanical walker is far more rewarding than knocking down flimsy buildings.Two stages with 30 levels each are included in the initial download, with some day-one DLC to add an additional 30 levels for a fee. There are also special eggs hidden throughout that will take you to weird black hole levels. These levels are radically different, taking cues from classic games like Breakout and Space Invaders. Imagine those two aforementioned games, but instead of shooting bullets, youre launching birds. They offer a worthwhile diversion from the core gameplay, so I always went out of my way to grab the special gateway eggs when I spotted them.I enjoy Angry Birds, and understand why so many have grown to love it, but personally I never felt compelled to play more than a few levels. With Angry Birds Space, I was disappointed when I made it to the end. I wanted more. It offers an experimental take on the original games concepts, and surpasses them in most respects. Its a better game than Angry Birds, and I cant wait to play more of it with the inevitable update that Rovio is probably already planning.", "date": "Mar 23, 2012", "grade": "9"}