{"name": "MLB 12: The Show", "ref": "https://www.gameinformer.com/games/mlb_12_the_show/b/playstation_vita/archive/2012/03/22/mlb-12-the-show-vita-review-a-solid-player-with-a-hole-in-its-swing.aspx", "text": "The Shows Vita debut isnt so much a port of the console release as it is an experience tailored to take advantage of the hardware and meet the needs of the gamer on the go.Sony offers touchscreen controls where they make the most sense. On the field, they can be used to place pitches  which ends up being the most reliable way, thanks to an overly sensitive left analog stick. One flick of the finger on the rear touchscreen in the direction of a desired base will initiate a steal, pick-off attempt, or fielding throw.All of the frontend and in-game menus offer handy touchscreen controls as well. Hitting X to select a mode and pressing down on the analog stick to scroll through a roster works just as well, but the touch controls speed up menu navigation. Touch controls can also be used to get a closer look at instant replays, but all camera rotation and cursor movement is still handled with the analog sticks.Although the console version offers an enhanced presentation this year, Sony removed most of the broadcast-like camera cuts from the Vita. This increases the speed of play, but doesnt mean youll be cruising through games in a matter of minutes (unless youre playing Road to the Show). Think 20 to 30 minutes for a game, depending on how aggressive you are at the plate and on the mound. The abridged presentation is most noticeable in the commentary. The announcers have little to say and sometimes fall a play behind.Even though the Vita version offers a slightly different experience than the console version, it stacks up nicely. The coolest addition added to both versions is the ability to load a Road to the Show or Franchise save file onto to a cloud. The Vita save file can be loaded into the PlayStation 3 game (and vice versa) to continue your progress. In the three weeks Ive spent with this game, I frequently used this technology to continue my franchise when I didnt have access to my PS3.Although the Vita version features the same pitching and batting mechanics found in its console counterpart, the timing and execution are slightly different. Pulse Pitching (which I detail fully in my PS3 review) is more difficult on the Vita. For my Road to the Show player, the pulse flashes faster on the Vita, making pitch placement more challenging. With that said, in 10 PS3 games, I posted a 1.89 ERA with 82 strikeouts. In the Vita version, I posted a 2.43 ERA with 77 strikeouts. Obviously, the gap between the two isnt that great, but I did find myself leaving the ball over the plate more on the handheld version.I also had more trouble mastering the aiming of the bat due to the touchy left stick. I ended up switching over to the Timing mechanic just to keep my franchise stats inline. I batted .089 points lower using either Zone or Zone Analog options. I even tweaked the sliders to make CPU pitchers a little tougher, given how easy it is to make contact in Timing.The way the ball bounces is also different on the Vita. New ball physics are incorporated into the mix, and prove to be just as dynamic as the PS3 counterpart. Towering shots hook around foul poles, bloopers die in the outfield, and balls bounce unpredictably off of bases and players. Some hit trajectories are repeated too often, however. The most frequent result I saw was line drives ricocheting off the pitchers plant leg. This is an exciting play, but I saw it roughly once a game. I rarely saw any repeat hits on the PS3.The options offered in Road to the Show and Franchise modes across both systems are identical. If you played last years game on PS3 or PSP, Franchise mode offers subtle tweaks to the CPUs trade and lineup logic. The CPU makes better decisions across the board, but I still found ways to take advantage of them and lure star players away from their club for practically nothing in return. If your franchise mode enters a fourth or fifth year, the fictional rookies' attributes offer realistic skill sets, opposed to the heavily balanced batch seen in previous iterations.Road to the Show offers new training drills and also doesnt let your created player start the season on the bench. Position players are thrown into the starting lineup on day one, and pitchers wont have to prove themselves in mop-up relief first.Online play remains a sore spot for this series. Although connecting is easy thanks to a streamlined menu system that allows games to be joined from the community or exhibition menus, the gameplay is hindered by lag. Every match I played was plagued with runs being scored due to frozen fielders or outs being recorded from pitches crossing the plate without me even realizing it.The biggest omission from the Vita version is the new Diamond Dynasty mode. Im not a big fan of it, but it has become the primary mode of play for many PS3 owners.The Shows solid debut is very much in line with the experience offered on PS3, but the sensitive analog controls put a big hole in its swing. If the Vita is your only avenue of play, though, there are workarounds. If you use this version as an extension to your PS3 play, it negatively affects your stats to a degree, but its still a suitable companion that allows you to play more video game baseball. Especially when your significant other is hogging the TV.", "date": "Mar 22, 2012", "grade": "8"}