{"name": "Silent Hill HD Collection", "ref": "https://www.gameinformer.com/games/silent_hill_hd_collection/b/xbox360/archive/2012/03/20/silent-hill-hd-collection-review-old-nightmares-reborn.aspx", "text": "Silent Hill 2 wowed gamers from the first moment they saw protagonist James Sunderland standing in a decrepit, meticulously detailed bathroom. From the streaked mirror to the stained porcelain, the rest stop looked like the last place on Earth youd ever want to be. Silent Hill 2 helped usher in the PlayStation 2 era of horror games with beautifully grotesque visuals, and its sequel iterated on the successful formula. Now Silent Hill 2 and 3 have been updated with high definition visuals and new voice acting, allowing you to revisit the games as your nostalgic mind remembers them.Both the original versions of Silent Hill 2 and 3 have aged quite well, but this HD collection replaces all the muddy textures and character models with cleaner visuals. The fuzzy fog of Silent Hill feels more oppressive when contrasted by the crisp storefronts and glossy mannequin monsters.Early survival horror games are notorious for their awful voice acting, and Silent Hill is no exception. Konami has rerecorded every line of dialogue, resulting in more believable performances and better-delivered lines. Im most thankful that the private investigator Douglas horrendous voice over has been replaced with someone who sounds like they actually learned to speak on Earth.While the game looks and sounds better than ever, the controls are still an obstacle. Players can use the classic tank controls or choose an option where the character moves in the direction you point the analog stick. I suggest the latter. The restrictive movement and camera controls can make the game difficult to play, which is where much of the suspense comes from. If combating archaic controls and monsters at the same time sounds frustrating to you, you probably wont have a good time. If you dont mind sacrificing some power in exchange for decent thrills, give it a shot.My feelings about the core games remain unchanged from the first times I played them. Silent Hill 2 is still the best the series has to offer, with an intriguing story of a man searching for his dead wife and the horrifying introduction of the now iconic Pyramid Head. James Sunderlands quest becomes a little ambiguous and misguided at times (shoving soda cans down a garbage chute to dislodge trash?), but overall its a journey worth taking. Silent Hill 3 is one of the weakest entries in the series, but still delivers spectacular scares. One chilling encounter with a decapitated mannequin torso still sticks with me.Unlike the God of War and Team Ico collections, the Silent Hill games have a more polarizing legacy, meaning the series may not be for everyone. Hardcore survival horror fans itching to return to the corrupt town of Silent Hill in the second and third games will enjoy the enhanced graphics and new and improved voice acting. Gamers unfamiliar with the eras clunky controls are better off hunting for more modern thrills.", "date": "Mar 20, 2012", "grade": "8"}