{"name": "Monster Hunter Generations", "ref": "https://www.gameinformer.com/games/monster_hunter_generations/b/3ds/archive/2016/07/12/tiny-tweaks-and-massive-beasts.aspx", "text": "Youre out of potions, your weapon is worn down to a blunted toothpick, and poison is ticking at your depleted health. You attempt a last-ditch effort, running up the snowy mountaintop and diving into the massive mammoth with a smashing combination assault that you finish off with a flourish, changing into a powerful hunter-art skill with enough power to slay the beast and finish the quest. The prolonged encounter taxed you and your abilities, but the defiant, exhilarating victory is made even sweeter by harvesting the monster for resources. The next fight will be that much easier as you upgrade your arsenal with shells, bones, and claws.Big battles are the essence of Monster Hunter Generations, a thriving loop of material acquisition, weapon enhancement and customization, and thrilling boss encounters. Sticking with the systems until you learn the delicate balance between timing and attack, and exploring combos (even using the new hunter arts to cap off or begin a combo) is rewarding. Players who dont give up during their first bouts with challenging monsters will enjoy an addictive cycle of exploration and customization, as new weapons, new armor, and new zones to explore.Those familiar with the Monster Hunter franchise will feel right at home in Generations, which adds a bevy of new options and tweaks to traditional elements. Players select from 14 main weapons, choose a hunter style and can master various hunter arts  special moves that need to be charged up before execution in battle. Along with a more robust Palico companion system and a ton of nostalgia-laden villages and environments to explore, these new options make this one of the most content-rich offerings in the entire franchise. The additions dont substantially change the gameplay, but they are especially compelling for veteran players that want to show off their skills with some of the incredibly precise hunter styles.When you become skilled with one weapon type, you have plenty of different ways to play with it, with styles and arts that facilitate beginners and masters. The difference between how weapons work is immense; it isnt a simple a sword is faster than a hammer distinction. Each weapon has a signature playstyle that features different abilities, related support items, and techniques. This adds a lot to the longevity of the game, especially if youve played previous titles with one or two weapons and want experience something new. I decided to leave the heavy bow gun (my old standby) behind in favor of hammers and longswords, and had a blast learning a completely different way to play.That said, while the beginning difficulty level for the default hunter style may be the most welcoming and accessible option for the series to date, the game continues the trend of carefully meted, deliberate, and fast-paced combat. Battles are not dumbed down, especially late in the game, allowing players to go up against altered versions of monsters with new movesets and attack patterns. These more unpredictable encounters are enough to challenge even the most seasoned hunter.Robust upgrade systems give the player an excellent amount of control in carefully selecting decorations (think of them like socketed gems that confer bonuses) to create the perfect hunter. I enjoyed preparing a few different sets to handle any situation, like earplugs to resist the deadly roars of beasts, and an herb-focused set to get the most from munching on local flora.Especially for Monster Hunters who prefer to go it alone, the Palico system is perfect for providing the player with proficient cat companions that can be tailored and customized from core templates like bombers, healers, fighters, and more. You send your extra Palicoes out on missions while you quest, and they bring back extra resources for you to craft with, outfit them with powerful weapons and armor, and even have them teach each other abilities to create the ultimate assistants. The Palico system is the best it has ever been, giving the solo hunter more competent and more customizable companions than previous entries. For those who enjoy hunting in a group online, that gameplay remains one of the strongest hooks in the series, as nothing beats joining up with friends or random players and taking a behemoth to task as a unified (or chaotic, depending on the group) force.For the first time ever, you can also play as a Palico. Controlling Palicoes may appeal to some, but it feels like a superficial addition solely for the sake of having something new to tout. I didnt care for Palico gameplay, which is unique in that it offers unlimited stamina, nine lives, special moves and no consumables, but it functions fine as a cute option for hunters who want to go beyond traditional choices and are looking for something completely different.Whatever your playstyle, you eventually hit the deep endgame to try and collect the best gear from deviant monsters, challenging encounters that have different abilities that the hunter wont be ready for. Players can easily spend most of their time with Monster Hunter Generations at the endgame, hunting down the best of the best armor and weapons while tackling ferocious beasts.While Monster Hunter can be distilled down into a basic loop of hunt, gather, upgrade, micromanage inventory and Palico perks, rinse and repeat, the process is quite satisfying as the boss barrage continues to serve up interesting encounters across snowfields, volcanos, and lush islands. Monster Hunter Generations offers some minor new tweaks to the franchise, but keeps the core completely intact, an easy winner for series veterans and the best point of entry for a new player looking to cut their teeth on some challenging creatures.", "date": "Jul 12, 2016", "grade": "8.75"}