{"name": "Mario Party 9", "ref": "https://www.gameinformer.com/games/mario_party_9/b/wii/archive/2012/03/09/mario-party-9-review-a-small-step-towards-positive-change.aspx", "text": "It has never quite reached the release consistency of a franchise like Madden, but there have been 10 Mario Party games in 13 years, each iteration barely building off of the original. Mario Party 9 has changed a few things to make the luck-of-the-draw experience more tolerable, but winning a coin flip is still about the same as winning a game of Mario Party.The biggest change comes in the form of board progression. Each computer- or player-controlled character takes turns driving a vehicle that everyone is riding in together to move around the board. The driver rolls the dice, moves everyone forward, and takes the benefits or disadvantages of the spot they land on, and then its the next players turn to drive. This means no more disparate player locations or scanning the map to decide where you want to go next. Everyone moves together on a linear path towards the end. It streamlines the game, making turns move faster.There are two bosses in each level, one occurring at the mid-point and another at the end. The bosses encourage teamwork, but still afford opportunities to compete. They serve as a good mid-point marker, and create a worthwhile finale to every board.Items are gone, but you are able to collect and use dice with smaller sets of numbers. Instead of rolling the standard 1-6 dice, for example, you can roll a 1-3 dice in an attempt to make sure that the person who is controlling the vehicle next hits the negative spot that is 4 moves away. It adds the teensiest level of strategy to a game that still relies far too heavily on luck.Also gone are the coins and stars. Instead of collecting single stars through minigames and landing on specific spots, now there are groups of three or more mini-stars all over the place that you collect just by passing by them. Whoever has the most mini-stars at the end of the game wins. Im sure this changeover to mini-stars was in the interest of speeding up the process, and I think it helps.There arent any standout new minigames, but I can thankfully report that only about 20 percent of them use motion controls. Most have you holding the Wii remote sideways to control your player. The best ones are the ones that turn the game into a platformer (you know, that thing that Mario is universally known for) where players race to the end of a group of clouds. The end game also provides an interesting twist from time to time, where Bowser requires you to play the games you know, but the first person to lose is the one who wins the most mini-stars. It provides a nice little change of pace when you are trying to get hit by a spiked ball or take the longest to get to a destination in a race.Mario Party 9 also includes a single-player mode that has a throwaway story where you play the game with computer-controlled teammates against a one of Bowsers cronies. The biggest problem in single player is that if you lose to Bowsers player, you have to restart that board. I played for about 45 minutes against Magikoopa and I aced every minigame, only to be usurped in the end by what I can only assume was my poor dice-rolling skills. In order to progress, I had to restart, and since luck wins against ability, its absolutely infuriating.As you play, credits are earned that can be used to unlock mostly useless crap that you would never look at, like star constellations. You can also waste your credits on fireworks to shoot off while you are looking at your stars. I cant imagine anyone would consider this a worthwhile reward.True to its name, in the extras menu are some extra things, some of which are worth a glance. One mode I like is the Perspective mode, which allows a single player to play some of the minigames with a re-aligned camera. It doesnt make the games any more fun necessarily, and in some cases it makes them intentionally more challenging, but its a weird take on some recognizable games and it elicited a vocal, hmm interesting, from me when I figured out exactly what it was. Its weird to see these games you have been playing from an isometric view up close, and in some cases made it feel as though I was controlling a character in a traditional 3D Mario game.There are things about Mario Party 9 that make it a better experience than previous entries, but overall its still a disheartening experience. The best times I experienced with the game were the times when co-workers and I were laughing at each others stupid mistakes while playing, but you really dont need a video game to fuel stupid mistakes worth laughing at.", "date": "Mar 09, 2012", "grade": "5.75"}