{"name": "Nexuiz", "ref": "https://www.gameinformer.com/games/nexuiz/b/xbox360/archive/2012/02/29/review.aspx", "text": "I loved the glory days of fast-paced shooters like Unreal Tournament and Quake. Then again, I wasnt playing them with gamepad controls or waiting 15 minutes for matchmaking. Nexuiz is a throwback to a beloved era of gaming, but the genre has moved on in so many ways that this lackluster attempt isnt terribly necessary. Nexuiz content is extremely limited. So long as your preference of mode is for team deathmatch or capture-the-flag, it has you covered. Each of the nine maps is keyed to one of the two game types, and they only work well with a full complement of eight players. Since you can only play six-player games until the planned 1.1 patch drops, this is a problem. The maps themselves are decent enough examples of the kind of symmetrical, fixed weapon spawn design that was popular a decade ago, but theyre nothing special compared to the better class of Quake/UT/Counter-Strike levels.The best part of Nexuiz, and its sole noteworthy innovation, is the dynamic mutators. These can be found as pickups on a level or awarded for kill streaks, and temporarily change the rules in powerful (or sometimes just goofy) ways. Once a mutator is available, youre prompted to choose one of three effects with a press of the d-pad. You may get a personal boost to your shotgun firing rate, give your whole team double-height jumps, or replace all sound effects in the game with fart sounds for everybody. These add a nice dimension of randomness, and offer opportunities for teams to execute interesting strategies from time to time.Nexuiz makes a minor concession to the notion of persistent progression, which smartly ties into the dynamic mutator system. As you play, you earn points that can be assigned to weight the die roll toward particular mutators that you prefer. Its not a huge draw that is going to keep players coming back if the gameplay hook isnt enough, but I appreciate that it doesnt noticeably change player power levels while offering a way to customize your experience to your personal tastes.The developer boasts about the exquisite balancing of weapons and maps born out of the eponymous Quake mod that originally released for PC in 2005, and that may be true at high levels of play. The only lasting impression of the gameplay that I came away with, though, was that Id much rather be playing Unreal Tournament 2K4. The weapons are mostly unimpressive rip-offs of the UT arsenal, but the larger issue is that this is gunplay that was obviously designed for mouse-and-keyboard control and makes few concessions to gamepad users. Remember how Halo: Combat Evolved was awesome back in the day because it slowed things down and had an arsenal that worked really well with an Xbox controller? Nexuiz is a reminder of the profundity of Bungies achievement; you cant just shoehorn PC gameplay onto a console and expect it to work.On top of the general lack of inspiration that plagues Nexuiz, I had serious problems with the technical aspects of network play. Matchmaking takes forever. Its frustrating to sit in the queue for 10 minutes between each 10-minute round, which all too often ends up marred by someone on the losing team leaving halfway through to protect their stats anyway. Additionally, I frequently saw significant lag and host advantage as well, though those vary so much by host and network conditions that its hard to come down too hard on the developer. Still, I would be remiss to not mention the shoddy network performance in this review. Sure, you can play against bots, but thats a pale shadow of proper multiplayer.Players have limited use of personal jetpacks, but they do little to make up for the game's other shortcomings. The additional vertical gameplay vector is fine, but more important is how smart jetpack use lets players make jumps that can be useful shortcuts. Dedicated players will no doubt wax poetic about how Nexuiz' jetpacks differentiate it from the UTs and Quake Arenas of the word, but the relatively minor impact they have isn't in the same ballpark as the game's technical problems and otherwise archaic design.As beloved as the subgenre and the original Nexuiz mod are among a certain crowd, this Xbox Live Arcade remake is nothing more than a haphazard port of a 2005 mod for a game that came out 10 years ago  except you have to pay money for it. Those of us older folks who are nostalgic for the gameplay Nexuiz emulates likely have a PC that runs any of the dozens of excellent alternatives, and the younger console crowd has plenty of more modern shooters to choose from.[Nexuiz is scheduled for later release on PC and PlayStation Network. If the game is different enough on those platforms to merit separate reviews, we will publish those when those versions become available. For now, please take this as our definitive review of the game.]", "date": "Feb 29, 2012", "grade": "6"}