{"name": "Rhythm Heaven Fever", "ref": "https://www.gameinformer.com/games/rhythm_heaven_fever/b/wii/archive/2012/02/29/rhythm-heaven-fever-review-nintendo-s-bizarre-musical-experiment-finds-a-home-on-the-wii.aspx", "text": "Rhythm Heaven Fever is not for everyone. Its a bizarre game that wears its Japanese origins on its sleeve, and you will get frustrated if youre not at least somewhat musically inclined. With that disclaimer out of the way, I can say that the Rhythm Heaven series (Fever included) offers interesting, creative, and challenging gameplay  and you wont find anything else like it.Rhythm Heaven Fever comes from the same group of developers as the WarioWare series, and the two franchises have a lot in common. Along with a similar art direction, both games are made up of a string of miniature games. I use the whole word miniature and not the abbreviation mini because these games deserve more than to be lumped together with standard minigame collections. These require a lot more skill and are far more engaging. You play badminton while flying a plane, dance on a beach as a shrimp, spin around in an office chair as a pig, and go on a double date with a gopher  and all of it is set to an infectious beat.Every game starts with a short training sequence to familiarize you with the basics of the musical premise. You get a couple of tries to get the hang of the rhythms, and then youre off. Each game lasts about a minute and a half, and there is no failing out. Whether you hit the beats or not, the game moves on until the end where you are awarded a fail, a pass, or a medal for being perfect or nearly perfect.There is absolutely no use of the motion control with the exception of navigating the menus with a pointer, but even that is entirely optional. Every game is built around pressing the A button, and occasionally both the A and B buttons at the same time. There is no need for wild gesticulations or a nunchuck. You can play the game with one hand, and the lack of motion controls means you can tap the Wii remote along with the rhythm without any worries of it affecting your game. Its much easier than the tap-and-flick gameplay seen in Rhythm Heaven for the DS.The challenge-to-fun ratio is occasionally off, specifically the game involving fish and another with shrimp (sea creatures dont have good rhythm apparently), but for the most part all the games are full of surprises and smiles. After beating the seven tiers of games, you can unlock more activities that rework the games you have already played, giving you reason to return.Rhythm Heaven Fever has a multiplayer mode you can unlock, just like WarioWare: Smooth Moves. The fact that it isnt immediately available creates an unnecessary barrier to players bringing in their friends, but its entertaining once it is available. Multiplayer reworks the games you already know into cooperative versions. Sometimes players are trading off beats, and sometimes they are hitting beats simultaneously. The multiplayer mode gives tangible, measured feedback on exactly how well you and your partner do, which is something I wish single-player offered. I also found that the multiplayer games are surprisingly fun when played alone with two remotes.Rhythm Heaven Fever is an unforgiving game, which is not characteristic of typical Nintendo releases. You cant instantly restart if you feel like you may be failing, and even though the option to skip tough games is available, it's not immediately apparent how to do so. Also, in an odd design decision, games are randomly selected to be replayed in order to unlock bonus content. You have to get perfect runs on these randomly selected games in order to receive the desired unlock.Outside of those few complaints, which have little to do with the core gameplay of Rhythm Heaven, this is an addictive, original, and often hilarious game. Some players may get frustrated by the unforgiving gameplay, and others wont get its bizarre characters and concepts. For those who dont mind a quirky challenge, Rhythm Heaven Fever is worth a shot.", "date": "Feb 29, 2012", "grade": "8.5"}