{"name": "Tales from Space: Mutant Blobs Attack", "ref": "https://www.gameinformer.com/games/tales_from_space_mutant_blobs_attack/b/playstation_vita/archive/2012/02/21/killer-blobs-return-triumphant.aspx", "text": "DrinkBox Studios first title, Tales from Space: About a Blob, introduced PlayStation 3 gamers to a unique 2D hybrid of LocoRoco and Katamari with plenty of creative elements all its own in February, 2011. Players controlled a little blob tasked with rolling up items to grow, rescuing its hidden blob friends, and thwarting a conniving scientist at every turn. Almost exactly a year later, the team is back with a follow-up to the downloadable cult hit exclusively on Vita. At first glance, Mutant Blobs Attack looks very similar to the original, though new players shouldnt feel obligated to go back and play it before jumping right into the sequel. The retro cartoony presentation and music returns. You search for hidden blob pals and get a high score to win medals (though you dont have to pick up every scrap to get a gold this time). I was happy to see the magnetic powers return, which allow you to cling to certain walls and ceilings using the shoulder buttons or sling yourself across large gaps using reverse polarity.Thankfully, you no longer have to hold a button down to absorb objects  it just happens when you get close. The new blob (who now only has a single creepy eye instead of two) has traded out electrical and item-tossing abilities for touch screen controls in which you can manipulate platforms to make a path, swing planks down to chip you across the map like a golf ball, create shielding from lasers, and more. As with many touch games, it can be annoying when your hand blocks the action, but these sections are spaced out enough so theyre not overdone. A lot of them are in relatively low-stress situations so you can take your time with the puzzle and not worry about missing a twitch reaction jump. In most instances, this showcases the possibilities for intriguing button/touch hybrid mechanics that the Vita could use to stand apart from mobile gaming.A new flying gameplay mode has players steer with the left analog stick and hit the X button to propel the blob like some wild rocket. Specific flying zones let you explore for pickups and also challenge you to maneuver through laser hazards and spike-filled tunnels. This gets extra tense when a creeping death wall gets thrown into the mix. Its a blast balancing speed boosts and the slower, fine movement propulsion to narrowly escape instant crushing death.End-of-world bosses are absent this time around, but I didnt miss them all that much. The game pulls back on combat in an overall sense, reducing the number of times youre dodging deadly projectiles and enemies. The challenge meter now points more in the direction of maneuvering past traps and deciphering environmental puzzles. Amusing transitional moments (ruining a college graduation, for example) now close out the worlds, and Im fine with it. Mutant Blobs Attack is slightly longer than About a Blob, which some thought was on the short side (24 levels versus 17). Many of these new stages fall under a new gameplay type called tilt-a-blob in which things switch to a top-down view and you use the motion sensor to move the blob. The first stage of this type is the most difficult and frustrating as you get to know the controls while trying to avoid a multitude of progress-ending holes in a trip through a maze. Later stages play like an easy, enjoyable, top-down Katamari where youre just trying to grow and reach the exit with little to no pressure. By the time the later challenging obstacle course comes along it feels like youre prepared with the skills to navigate it. I think a little rotation in the order could have gone a long way in curbing an early, seemingly random, spike in difficulty. Otherwise, the smooth, inviting difficulty curve and constant use of inventive new tricks makes Mutant Blobs Attack stand out in the crowded Vita launch lineup. While some other, more buzzed-about titles have come up short, DrinkBox has delivered on the promise of the Vita for platforming fans old and new.", "date": "Feb 21, 2012", "grade": "8.5"}