{"name": "Blot", "ref": "https://www.gameinformer.com/games/blot/b/ios/archive/2012/02/21/xxxxx.aspx", "text": "Majestic Software's Blot is an odd amalgamation of artistic expression and art theft. If you can look past the adorable ink blot protagonist who is always smiling and staring deep into your soul with his shifty eyes, the backdrops behind him are filled with stunning black and white illustrations of wars, ponies, majestic forests, snakes, milkshakes, gigantic candy bars, aliens, and pretty much any spectacle inserted with the hope of stealing the player's attention away from the action. Perhaps it's a clever way of pulling focus away from the gameplay design, which is just a jetpack shy of being a clone of Halfbrick's renowned Jetpack Joyride.Blot may have the magical power to fly, but gravity is always pulling at him. When the player touches the screen, he ascends. Let go and he falls. This simplistic control method works flawlessly, and, if you've played any Jetpack Joyride before, feels like a well-worn glove. It's kind of scary how similar Blot's floating feels to Barry Steakfries'. Blot is a little heavier than Barry, but the rate of ascent and tactics required successful navigate a perilous path are identical. Even the act of collecting coins brings about obvious comparisons, as many of the coin configurations spell out words and messages.Blot doesn't have to worry about electrical fences, but instead must steer clear of pointy pencils and pins. The challenge that arises falls more on the side of skill than luck. Obstacles are not highlighted in any way before they reach the screen, yet rarely did I find myself in a position where I couldn't quickly maneuver out of the way. As a result, my runs lasted much longer than in other cave flyers. Blot separates itself from its inspiration through its power-up system. If Blot touches a ~boost buddy~ he'll grow in size, both making navigation more difficult and coins easier to grab. Once four boost buddies are consumed, the camera zooms in and Blot launches across the screen uncontested, grabbing any coins and boost buddies he touches along the way. This mechanic adds unique challenges and excitement to the tried and true cave flyer formula it wholly apes. Blot also offers dozens of unlockable skins (including one that SpongeBob SquarePants' legal team might take issue with) and 28 achievements, including one that can only be unlocked if you fly past a walrus riding a unicycle.Cave flyers are littered throughout the App Store, yet found myself engaged with Blot's colorful presentation and unique spin on power-ups. It's worth a look, both for the fun it delivers and also to see how closely it comes to mimicking the genre conventions. It's available now in Apple's App Store for 99 cents.", "date": "Feb 21, 2012", "grade": "7.25"}