{"name": "Ultimate Marvel vs. Capcom 3", "ref": "https://www.gameinformer.com/games/ultimate_marvel_vs_capcom_3/b/playstation_vita/archive/2012/02/13/the-game-remains-the-same.aspx", "text": "We game in a generation where a fighter can be a nearly identical experience on a handheld and a console. Super Street Fighter IV 3D helped bridge the gap on the 3DS, and Ultimate Marvel vs. Capcom 3 now makes the leap with this Vita iteration. Having a full-fledged version of the stellar fighter on a handheld is stupendous, but a lack of innovation holds it back from becoming truly marvelous.The main appeal of Ultimate Marvel vs. Capcom 3 on the Vita is the ability to hone your combos on the go. The Vitas tiny analog sticks and slick d-pad do the intricate battle system justice. I never once blamed my inability to pull off a tricky move on the new hardware. Ill always prefer a beefy arcade stick, but fighting fans who can comfortably duke it out with a controller will be happy with the feel of the game on the Vita.This is a straight port of Ultimate Marvel vs. Capcom 3, as it hit consoles last November. All the characters that were on the disc then can be found here. Newcomers like Nemesis, Taskmaster, and Rocket Raccoon are still a lot of fun to tinker around with. This portable version features the same barebones online infrastructure and standard fighting game modes like training and missions that youve come to expect. Fortunately, the gorgeous shaded graphics youve come to appreciate also return, and look terrific on the Vitas crisp display. If you go into this Vita version expecting exciting gameplay changes, enhancements, or bonuses, youll be sorely disappointed. Besides the ability to save replays of your matches, this is the same game. The only standout addition is the laughable touch control mode. Players simply tap their finger on the Vitas screen like an impatient DMV customer and a flurry of expert combos are unleashed on the unsuspecting AI. Plowing through the game with a single finger is a cute novelty, but anyone over the age of three will scoff at the mind-numbing mode.Ultimate Marvel vs. Capcom 3 is best suited for two types of Vita users  those obsessed with the series who cant tolerate having it out of arms reach, or anyone looking for a good fighter who hasnt played it yet. If youve even spent a single night with Capcoms comic crossover, youve already experienced everything the old workhorse has to offer.", "date": "Feb 13, 2012", "grade": "7.75"}