{"name": "The Darkness II", "ref": "https://www.gameinformer.com/games/the_darkness_ii/b/xbox360/archive/2012/02/07/a-lovesick-killer-loses-his-soul.aspx", "text": "In the comic book business, its common for high-profile writers and artists to leave a series before completing a story arc. The change in talent often produces a jarring shift for readers. The plot can head in a direction the previous creative team may not have intended. Alterations to character appearances and dialogue can give them entirely new personalities. Even if this comic is technically picking up where it left off, its tonal and cosmetic changes can make it feel like an alternate reality continuation.The Darkness, a video game series based on the Top Cow comic, is afflicted by a similar creative malady. Developer Starbreeze tapped this license to create a powerful shooter that played out like a slow-moving stealth game with protagonist Jackie Estacado lurking in the shadows, summoning his darkling minions to systematically take down his foes. For the sequel, newly appointed developer Digital Extremes keeps Jackies story alive, but the framework for the experience is aimed more toward the fast-paced shooter crowd than people looking for a creepy supernatural thriller. Thats not to say Digital Extremes didnt create a decent game full of mindless action, but the soul that Starbreeze nurtured and made Jackies driving force is nowhere to be found.This time around Jackie comes across as a lovesick broken record, going on and on about his dead girlfriend Jenny. Two years have passed since her tragic death, and he hasnt found peace. Hes obsessed with her memory to the unhealthy degree that he sees hallucinations of her and is continually reminded of the great moments they had together. One of the best moments from the original was Jackies quiet night on the couch with Jenny. Digital Extremes tries to evoke this same feeling from players on numerous occasions, but they all feel forced and disingenuous. No offense, Jenny, but I feel like Digital Extremes is beating a dead horse.A new antagonist and reason for Jackie to seek vengeance are introduced early on in this tale, but as youve probably gathered by now, loverboys head isnt exactly where it should be. As he becomes unhinged, Jackies mind lapses into a reality without the Darkness where Jenny still lives. These sequences have Jackie talking to his mob buddies and Jenny, adding humor to the grim tale, but the gimmick is revisited too often. The resolution to the entire plot hangs on Jenny, and sadly doesnt reach closure until after the credits, where another ridiculous Jenny revelation awaits.The gameplay struggles to find its pulse just as much. Combat relies on reflexes more than strategy this time around; Jackie can rarely get the jump on an enemy, and the Darkness is just a weapon rather than a tool. Most encounters begin when Jackie passes an invisible trigger point in the environment. Foes crawl out of the woodwork, descend from rooftops, and almost always rush his location, resulting in more close-range encounters and challenging battles.Jackie can quad-wield weapons (two guns and two Darkness serpents), allowing for a variety of grisly kills. Placing two bullets into an opponents leg makes him reel, giving Jackie enough time to lift him off of the ground with a serpent. As the foe dangles in agony, the second serpent can rip off his head or puncture his chest. The gunplay and serpent mechanics are beautifully implemented, and once mastered, empower the player with the sensation of superiority on the battlefield.Feeling powerful is fun, but combat encounters lack the necessary variety in design and enemy types to remain fresh. Even with an extensive upgrade system in place, the action doesnt evolve from its initial form. I must have summoned my serpents to perform the grotesque wishbone kill (ripping a foe in two from the crotch to the face) at least 100 times in the seven or eight hours it took to complete the game.The only diversion from the repetition is the rare instance where control switches to a darkling. This foul critter occasionally sticks his fingernails into human eye sockets, but mostly performs boring actions like scurrying through vents and disabling fuse boxes. His most memorable accomplishment is peeing on dead enemies, which isnt a good sign. I should also point out that this darkling is always onscreen playing the follow role seen in the Call of Duty games, motioning you in the right direction. The odd thing about this handholding technique is that the game already offers a light-up breadcrumb trail waypoint system. If you use it when hes on screen, the trail goes right below his feet. I have to ask: At what point did we become so bad at navigating linear environments that we need two redundant Help me! Im stuck! systems?The Darkness II is more of a rebirth for the series than the sequel its trying to be. The action is mindless and fevered, and Jackie has transformed from a vengeful protagonist into someone who probably listens to Dream Weaver as he cries himself to sleep. I found it to be an interesting journey, mostly just to see how different it is from the original, and also to see how a demonic superhero can be whipped by a dead woman.", "date": "Feb 07, 2012", "grade": "7.5"}