{"name": "Postal III", "ref": "https://www.gameinformer.com/games/postal_iii/b/pc/archive/2012/01/30/postal-iii-review-offensive-for-all-the-wrong-reasons.aspx", "text": "From its previous two iterations and the infamous Uwe Boll-directed film, Postal has gained a reputation for being a franchise that runs down the limits of good taste before backing up, climbing out of its truck, and taking a leak on the remains. If you have the ability to be offended by a joke, the team over at Running With Scissors will figure out a way to make it happen. Thats not necessarily a bad thing; popular shows like South Park thrive on a similar brand of button-pushing humor. The difference is that the people behind Postal III dont have the writing ability to back up their gutter-dwelling mouths. As it turns out, they also dont have the design or programming chops to create a stable game.Whatever problems people had with Postal 2, it was at least interesting from a structural point of view. The main character  referred to only as The Postal Dude  was let loose to wander around the city of Paradise, completing tasks or getting into trouble at his own pace. Even that little bit of intrigue has been removed from Postal III. From the opening tutorial to the credits, the game barfs out a barely cobbled-together series of mostly linear levels. Though objectives technically run a wide range of seemingly mundane tasks such as collecting apples or returning stolen Segways, they all end up breaking down into boring shoot-outs with huge numbers of brain-dead enemies.If the snore-inducing levels werent bad enough, the game commits the unforgivable sin of referencing its own soul-crushing design choices as though that makes them better. ~Postal has vehicles now? Real f---ing funny,~ the protagonist quips in one level that forces you to drive poorly controlling Segways. Its not funny. Its a bad decision that makes for awkward gameplay, and the people making the game clearly knew that. Another levels intro text dares players to try not to turn the game off in anger. Most gamers will lose that dare and will be better off for it.Even if you call the developers bluff and keep pushing through, the game might stonewall your attempts to play it. The number of bugs and technical problems in Postal III goes well beyond the point of needing patches and into territory that has me thinking its just unfinished. The game crashed at least once every hour that I played it, and when a level did load, it was often with a framerate drop and a message stating, ~Node graph out of date. Rebuilding~ One level is an escort mission in which the introductory text warns, ~Dont leave him too far behindor he will frustratingly disappear. Fair warning.~ If that sounds like a lame way to cover tracks for a bug that should have been fixed before the game shipped, well, it probably is.Even with all of these problems dragging it down, Postal III could have at the very least provided a nice, dumb outlet for aggression, a way to let off steam by mowing down stereotypes. Sadly, the game doesnt even accomplish that. The Postal Dude carries a huge list of increasingly wacky weapons, such as rabid cats, a shop vac, pepper spray, and a laser pointer that sends your dog after enemies, but most of this off-the-wall arsenal is pretty much useless. I found myself quickly switching back to the regular old shotgun and assault rifle to save myself the pain. The game is also bizarrely difficult and plagued by bothersome inconsistency in when and how much enemies hurt you. A Sarah Palin look-alike with a pistol drained my health in seconds while a SWAT team member with a heavy machine gun barely injured me.Even moving beyond the immature, purposefully offensive sense of humor, theres nothing redeeming about Postal IIIs frustrating, buggy gameplay. When I completed the game, it challenged me to go back and try finishing levels using non-lethal means to unlock new areas, a suggestion that warranted one of the only laughs I had through the entire experience. At one point Postal III tasks you with collecting HIV-infected cats; Id rather do that in real life than play this awful game again.", "date": "Jan 30, 2012", "grade": "1"}