{"name": "VVVVVV", "ref": "https://www.gameinformer.com/games/vvvvvv/b/3ds/archive/2012/01/16/the-indie-platformer-survives-the-transition-to-3ds.aspx", "text": "Theres a lot to be said for simplicity in game design, and VVVVVV is a shining example of how far a good hook and clean execution can take you. This indie platformer came out in January of 2010 on PC, but this 3DS version is very much the same game. Making your way through hours of punishing 2D gauntlets with Captain Viridians singular ability to invert gravity is a natural fit for Nintendos portable, and the experience is alternately rewarding and frustrating just as it is in VVVVVVs original PC release.VVVVVV makes excellent use of a small but potent gaming vocabulary. The player can run left or right and switch gravity. The rooms consist of walls, spikes, moving platforms, checkpoints, and mobile dangers. Thats it, outside of some one-off levels where youre dealing with screen-edge wraparounds or companions that must be shepherded through the deathtraps and the like. Beautiful sentences are built out of these limited nouns and verbs as you make your way through room after room, solve puzzle after puzzle, and eventually rescue your scattered crewmembers.A simple VVVVVV puzzle might be walking on the ceiling to avoid a row of spikes. A slightly tougher one might have a moving platform that introduces a timing element. An even harder one could add a cannon shooting deadly blasts at regular intervals. As you make your way through the massive game world, youll encounter brutal spike-lined narrow corridors, multiple projectiles and mobile platforms, and level-specific wrinkles that constantly cycle new challenges into the mix. Overcoming each obstacle brings a wonderful sense of accomplishment, particularly since the difficulty quickly ramps into frustrating territory.Liberal distribution of checkpoints cuts the frustration aspect somewhat, but VVVVVV is not for the faint-hearted. Unless you are possessed of world-class reaction times and platforming skills, the tougher rooms will require dozens of attempts to complete. I dont mind having to make my jumps and pull off tough stunts, but the split-second timing VVVVVV calls for on a regular basis is a high bar to clear even for a fan of Super Meat Boy or N+.The larger issue I have with VVVVVV is that rather than coming up with a creative solution to the problem at hand, its incredibly obvious that there is one path through each room and you just have to find it. This is true of many puzzle games, but the skill with which the designers hide it can play a big part in the overall experience. Portal, for example, always made me feel smart for getting through each test chamber. VVVVVV makes me annoyed at its contrived solutions as often as not  especially when I keep dying because my stupid characters momentum takes him a fraction of a step too far. If youre going to make me follow the one true path, dont make me do it over and over again because it demands pixel-perfect execution.All that said, VVVVVV is a charming little indie puzzle/platformer that youd have to completely fail to click with to not get your $8 purchase price worth of entertainment out of. When its good, its great. When its bad, its merely annoying for fifteen minutes at a stretch rather than desk-poundingly awful. I wouldnt tell anyone to drop everything and download VVVVVV this instant, but gamers with a taste for indie fare or who value creative ideas over a smooth, high-budget experience should have a great time with it.", "date": "Jan 16, 2012", "grade": "7.75"}