{"name": "NFL Blitz", "ref": "https://www.gameinformer.com/games/nfl_blitz/b/xbox360/archive/2012/01/09/review.aspx", "text": "Back in the late '90s, Midway pulled off a nearly-impossible feat. With the initial NFL Blitz titles, the publisher managed to make football games appeal to gamers regardless of their interest in the sport itself (as they did a few years earlier with NBA Jam and basketball). Even though I had only casual interest in the NFL, Blitz became one of my favorite games of that time period. Despite its initial success, the future of the series looked bleak after EA gained NFL exclusivity, causing Midway to release two unlicensed Blitz titles before shutting its doors. However, like they did with NBA Jam, EA has resurrected the arcade football experience 15 years after it first invaded arcades. Thankfully, this resurrection (mostly) delivers the same brand of over-the-top, cartoonish charm as the original.NFL Blitz still features wild tackles, goofy hidden characters, and entire teams catching on fire, but one trademark of the series is noticeably absent thanks to interference from the NFL. If you ask any gamer what their memory of NFL Blitz is, its a safe bet that many would recall the chaotic late hits and player pile-ups at the end of each play. Living up to their stingy reputation, the NFL has vetoed any kind of late hits in the new Blitz. Upon completion of each play, your controls are frozen to prevent any kind of post-play shenanigans. For fans of the original games, it feels like something substantial is missing every single time a play ends. Its comparable to when fatalities were toned down in Mortal Kombat vs. DC Universe. The core gameplay was still solid, but the absence of a significant series trademark negatively impacted the experience.Its disappointing to see the omission of late hits, but the rest of the gameplay is pure Blitz. Everything feels almost identical to the original, from the intentionally limited playbooks (featuring classic plays like Da Bomb and Sub Zero) to the rubber band A.I. that makes most games come down to the wire. Pass interference is still a non-issue, so youre free to take out all three of your opponents wide receivers if the QB is spending too much time in the pocket. The original directional method for selecting receivers is the default while youre on offense, but I highly recommend the icon passing setting if you prefer functionality and responsiveness over nostalgia.Exhibition matches feel like old times, but added modes make the new Blitz a more complete package. My favorite is the Elite League, which functions similarly to Maddens Ultimate Team mode. Using Blitz Bucks that you earn in online play, you can purchase packs of playing cards that serve as your lineup. I struggled with Matt Cassel as my QB for several games, but my team improved dramatically once I acquired a Michael Vick card. Swapping players out and looking at stats after buying new packs is a blast, and its rewarding to see your initial lineup evolve and improve as you purchase new cards. If you feel like snagging valuable cards from online opponents, you can put your own collection on the line in Risk vs. Reward games. Its a great way to improve your line-up if you win, but its crushing to watch your opponent leaf through your cards after a loss. Unfortunately, you don't get full credit for the win if your opponent rage quits. I was up 49-14 in the 4th quarter of one game, but was denied my Blitz Bucks winning bonus thanks to my XBLA opponent bailing on me.As always, multiplayer is the way to play NFL Blitz. The Elite League and regional leaderboards give you reason to play against random opponents, and local play is as raucous as ever. If you prefer going solo, you can jump into exhibition matches or the new gauntlet mode. This ladder has you facing a stream of opponents that are broken up with occasional boss battles. Teams of ninjas, clowns, cowboys, and more (including an assortment of power-ups) share the gridiron with you during these games, and youll unlock their skins for your own use upon defeating them. Gauntlet mode is a passable distraction, but these games cant compare to the online experience.Even with the omission of late hits, NFL Blitz is an old-school arcade experience that hasnt lost the fun factor it had a decade-and-a-half ago. As a casual football fan who hasnt seen more than three regular season NFL games this year, it still managed to win me over with its fast-paced action. Blitzs gameplay will seem unmistakably familiar to fans of the original, but its still a great title to have in your library to pull out for the occasional game.", "date": "Jan 09, 2012", "grade": "8"}