{"name": "Kung Fu High Impact", "ref": "https://www.gameinformer.com/games/kung_fu_high_impact/b/xbox360/archive/2011/12/14/kung-fu-high-impact-review.aspx", "text": "When Kung-Fu Live was released last year, some wondered why it utilized the Playstation 3 and its basic camera instead of the Xbox 360's newly-released Kinect. A year later, developer Virtual Air Guitar Company has brought the game to Microsoft's console in the form of Kung-Fu High Impact. Like many games for the peripheral, this will have you flailing about like nobody's business. Unlike many other Kinect games, however, this one works well, picks up on your intended motions more often than not, and is good for a few laughs.What makes this feel better than most Kinect games is that you directly control the onscreen character. Instead of triggering animations for an avatar of some sort, your character is represented by a live version of yourself. Other than the gesture-specific magic attacks, you're free to do whatever crazy punches and kicks you'd like as you progress through the 14 stages. I messed around with silly attacks like David Lee Roth kicks, Shawn Michaels superkicks, and dropping to one knee to ~speedbag~ my opponent's groin. All of these attacks worked well, and it was refreshing to have freedom like this in a Kinect game for once.Watch below to see some of Kung-Fu High Impact in action:As you progress through the game, you'll unlock four magic attacks that are governed by a constantly-recharging meter. The most useful is the Power Punch, which sends your character flying to the left or right and delivering a double-fisted attack to whoever is in your way. It's especially useful thanks to its ability to move you left and right quickly, as this can be difficult to pull off otherwise. Other attacks include a ground pound, lightning bolts, and a gesture that stops time.Jumping around like a fool and kicking enemies in the face is fun (and funny) for a bit, but the game's flaws become apparent after playing a few chapters. Moving around the stages isn't easy, which can be a pain when you're trying to jump up onto a specific platform to collect a health power-up. Enemies feature visual indicators that let you know where attacks are coming from, but they appear too early to be of any use. Kung-Fu High Impact attempts to feature a counter-attack/dodge system, but it has trouble interpreting your motions fast enough to matter.Outside of the 14 story chapters, the game also features multiplayer and survival modes. The latter is what you'd expect, with wave after wave of baddies testing your endurance. Multiplayer mode allows up to four friends to grab controllers and attempt to take down your onscreen representation. It could have been fun if pulled off correctly, but unintuitive controls make this an easy mode to pass up.If you're not averse to the idea of making a fool out of yourself, it's hard to not get at least a couple of laughs out of Kung-Fu High Impact. Comic book intros to each mission feature you in ridiculous and humorous poses, and the gameplay is inherently silly. Once the initial laughs are over, however, this is a short and relatively one-note experience with its fair share of control issues. If you're looking for a Kinect novelty to pull out when company is over, Kung-Fu High Impact may serve that purpose. If you're looking for a game to help you look at Kinect as more than just a gimmick, this isn't the one for you.", "date": "Dec 14, 2011", "grade": "6"}