{"name": "Joe Danger Special Edition", "ref": "https://www.gameinformer.com/games/joe_danger_special_edition/b/xbox360/archive/2011/12/14/the-down-on-his-luck-stuntman-finally-lands-on-xbla.aspx", "text": "Hello Games surprised many of us at the office with 2010's fantastic Joe Danger on PSN. The quirky downloadable title featured tight controls, entertaining objectives, and a charming visual style that all contributed to it becoming our highest-reviewed game the month of its release. It's now a year and a half later, and the down-on-his-luck stuntman has landed on Xbox Live Arcade. At its core, Joe Danger: Special Edition is the same game as the PSN version, but some fun bonuses and features have been added. Our original review of the game should fill you in on the basic information about Joe Danger, but you can read on to learn about the changes made for Special Edition.Everything that was included in the original game is here, and the career is still a blast. Hello Games has made minor tweaks, tightening the bike handling and drastically reducing load times, but overall it's mostly the same experience. Joe Danger veterans will want to head straight to The Lab, a series of brand-new, challenging levels that were originally created by the development team to test the game's controls. They've blown these test levels out into their own experience, complete with traditional objectives as well as the new pro medals. These are only unlocked if you satisfy every other course objective in a single run, so they'll be badges of honor that prove your mastery of the game's controls.While The Lab is a significant addition, smaller bonuses have been made in the way of ten unlockable characters, new multiplayer levels (split-screen and online), avatar awards, and an improved level editor. These bells and whistles are welcome add-ons, but it's The Lab that makes the biggest splash by far. I played a ton of the original game, and one of the later stages still took me over 140 attempts to clear. Joe Danger: Special Edition offers enough new content for a fan of the original to enjoy, but it's a must-download for Xbox owners that never had a chance to play it.", "date": "Dec 14, 2011", "grade": "8.5"}