{"name": "King of Fighters XIII", "ref": "https://www.gameinformer.com/games/king_of_fighters_xiii/b/xbox360/archive/2011/11/22/king-of-fighters-xiii-review-fans-will-love-it-newcomers-may-scratch-their-heads.aspx", "text": "King of Fighters XII hit the fighting scene in 2009 with an emphasis on new character design. The big, pixelated sprites were an ocular treat for retro-minded fans, while some found the dated design a messy alternative to slick fighters like Street Fighter IV. Regardless of what you thought about the revamped roster, King of Fighters XII was lacking in content. This sequel welcomes a batch of new fighters and a variety of stages into the fray, and incorporates some modes that should have existed from the start  not the least of which is a substantial story mode. While the additions will likely appease the most frenzied King of Fighter fans, the confounding plot and steep learning curve present a poor jumping-on point for new fighters.King of Fighters XIII completes the story arc revolving around the nefarious Ash Crimson, which began with 2008s entry. Only the most rabid fans of the series will have any idea whats happening in this cockamamie tale. The plot details I gathered from the oodles of text stretched across panning artwork involved paranormal investigators, time paradoxes, and demonic summoning. While one trek through the mercifully short story mode was all you need to get a sense of the absurdity, dedicated gamers can explore divergent paths to earn subtly different narrative experiences.When youve recovered from your confusion-induced nosebleed, a bunch of new modes are available to check out. The most important addition is a sloppy but necessary tutorial. This barebones guide to King of Fighters fighting system offers a glimpse at the basics, but youll want to turn to the new mission mode to explore each characters potential combos and get a feel for the games timing. Unlike mission modes in other fighting games, King of Fighters XIII boasts the useful addition of a preview of the combo in action. Seeing your character perform the full combo helps perfect the timing and rhythm of complicated moves.You can also take the fight online and practice while you wait for challengers to enter your lobby. I only encountered a few laggy fights while being matched with combatants looking to beat the snot out of me, but only time will tell if the lacking netcode has been improved since the last game. I enjoyed how easy it is to save match replays post-fight. Rewatching my losses frame-by-frame afterward is not only a good way to keep my ego in check, it also allows me to uncover my weaknesses in combat.The new additions to the roster are primarily returning characters from past games. Fans bemoaned the absence of the busty battler Mai in the last title, and she returns with all the overt sexuality youd expect. If thats your thing, youll also probably enjoy the tattered clothing effect some female fighters suffer after losing some matches. While I enjoyed the swift moves of the lithe Vice and the sheer might of seasoned martial artist Takuma, these returning veterans felt just as generic as the rest of the cast. Longtime fans will be happy to hear that the preset teams from past games returns here. I liked having Fatal Fury characters grouped together on the versus character select menu, but being restricted to preset teams for story mode is a drag.No matter which character you choose, the fighting itself feels more responsive than the previous game, and its easy to grasp. Im not an expert at performing critical counters or drive cancels, but some good old-fashioned defense, timed combos, and quarter circle special moves took me pretty far. I like having three fighters at my disposal without having to frantically swap between them like Marvel vs. Capcoms tag-team matches. One the other hand, loading between rounds robs the momentum from bouts. Overall, the fighting is fun whether you have a controller or fight stick, but newcomers will feel overwhelmed without a mentor or lots of deep research into the fighting engine.SNK has proven with King of Fighters XIII that it cares about the fans. Nearly every bit of negative feedback about the last game has been addressed here, resulting in distilled fan service in disc form. Devout King of Fighters fans left wanting last time wont have much to complain about here. And while the tutorial and missions mode offers some guidance for casual players, I cant recommend this over other superior fighters on the market.", "date": "Nov 22, 2011", "grade": "7.75"}