{"name": "Raving Rabbids: Alive and Kicking", "ref": "https://www.gameinformer.com/games/raving_rabbids_alive_and_kicking/b/xbox360/archive/2011/11/22/raving-rabbids-alive-amp-kicking-review-the-party-39-s-over.aspx", "text": "The name Rabbids in a games title can be seen as either an enticement or a warning, depending on your tastes and endurance. Since the series debuted in 2006, Ubisoft has released a sequel in an annual cycle thats as reliably timed as flu season. Raving Rabbids: Alive & Kicking delivers the same gross-out minigames and no-nonsense stupidity that the franchise is known for, with a twist: This one uses Kinect.The premise this time around is that the Rabbids are trying to reproduce or something and then a cow goes into a hot tub and the Rabbids multiply and suddenly you have to play a bunch of minigames. Fair enough. Up to four players can simultaneously revel in the aftermath, making it one of the more ambitious Kinect games out there. So far, so good.Unfortunately, Kinect has to go and be all Kinecty, which ruins much of the fun. Games that require simple movement, such as wildly banging your head to create a lump onto a Rabbids skull or simply flailing around as much as possible, work as well as you might imagine. When youre required to do more precision-oriented tasks, things fall apart. The augmented reality portions look pretty cool, but the game doesnt do a reliable job of following your relative position in the room. Its frustrating to get penalized for not dodging missiles or running into obstacles when the image on your screen shows you doing exactly that. I even lost points for apparently not lying down flat enough on the floor; thats either a passive-aggressive hint that I need to lose weight or, more likely, an issue with Kinects lackadaisical tracking. The Rabbids games have always been about silly, disposable fun, and Alive & Kicking at least delivers on two of those fronts. This installment includes the additional challenges of long load times, poor controls, and a palpable sense of dj vu. These might not be deal-breakers for everyone, but at this point Im ready to let the Rabbids rage by themselves.", "date": "Nov 22, 2011", "grade": "5"}