{"name": "WWE 12", "ref": "https://www.gameinformer.com/games/wwe_12/b/ps3/archive/2011/11/21/review.aspx", "text": "Like clockwork, every year THQ releases a WWE game, with Smackdown vs. Raw serving as the core franchise since 2004. With so many entries, longtime wrestling fans have started to wonder what new elements can be introduced outside of aesthetic updates and tweaked gameplay mechanics. When THQ announced WWE 12, the publisher trumpeted it as a reboot rather than another incremental update. It certainly feels different than the previous games in the series, but most all of these differences are negative. Thanks to a severely downgraded story mode and a lack of substantial improvements, this is the weakest WWE title in years.Recent titles in the series touted Road to Wrestlemania as the marquee single-player mode, where players choose their superstar and follow their career through a months-long story that culminates at the Wrestlemania pay-per-view. WWE 12 instead presents a larger 18-month campaign that features three different stories. Players start with Sheamus and his tumultuous alliance with the new United Kingdom faction, then move on to Triple Hs quest to recapture the WWE championship, and end the Road to Wrestlemania by playing as rookie Jacob Cass (represented by a created character) as he takes on a posse of former WCW stars.I appreciate the attempt to present a lengthy, ongoing campaign instead of the smaller stories of previous games, but its thoroughly unenjoyable. In an attempt to make the game resemble WWE programming more, matches rarely end in a simple pinfall victory. Instead, they are littered with run-ins, disqualifications, and backstage brawls. These may be frequent elements of Raw and Smackdown episodes, but they dont translate to an entertaining gameplay experience. Most matches boil down to hitting your opponent with strikes and grapples until a prompt appears above their head that triggers the post-match cutscene. Instead of feeling like you won the match, you feel like youre doing a chore to unlock the inevitable disqualification cutscene.It would be one thing if these moments were limited to DQs and run-ins, but the method of triggering these events is the worst part. The majority of matches require annoyingly specific actions that detract from the experience. During a triple threat match involving Big Show and Alberto Del Rio, my objective was to finish off Big Show in the ring. Naturally, I tried to beat him up and pin him for a three-count. Confused at why the pin button wasnt working, after I landed another finisher I realized it was disabled because the scripted outcome required Big Show to pin Alberto Del Rio, making it an unwinnable match.Frustrations like this occur in most Road to Wrestlemania matches. The game disables basic actions like pins and tags without warning you, youre forced to trigger cutscenes in poorly explained areas, scenes usually require loading times that take you out of the match, and you often endure ridiculous segments involving getting beaten up in the same backstage area. Throughout all three of the stories, I rarely was allowed to simply wrestle a standard one-on-one match without frustrating requirements.If you forgo the painful Road to Wrestlemania, theres less frustration involved in exhibition matches, online play, and the returning WWE Universe mode. At the very least, these allow you to partake in wrestling matches without having to follow a strict script. WWE 12s new control scheme is fairly solid, but the omission of the training arena from the previous two entries is baffling. Practicing controls in an open ring was helpful, but its nowhere to be seen in this reboot.THQ is fond of hyping its new Predator Technology animation system, which allows for animations to be interrupted easier. Unfortunately, it also adds a floaty feel to punches and kicks. While it stops players from warping to the center of the ring when certain moves are performed, these jarring cuts still happen frequently when Road to Wrestlemania cutscenes are activated.WWE 12 only introduces a few welcome elements. Setting up opponents for finishers with wake-up taunts is fun, the new comeback moments are a nice way of getting back into the match, players can now target specific limbs during grapples, and new creation options (like the new create-an-arena) make the series more customizable than ever before. However, none of these can make up for the awful Road to Wrestlemania. If WWE 12 represents THQ and Yukes going back to the drawing board, lets hope they grab some erasers and start from scratch for WWE 13.", "date": "Nov 21, 2011", "grade": "5.5"}