{"name": "Star Ocean: Integrity and Faithlessness", "ref": "https://www.gameinformer.com/games/star_ocean_integrity_and_faithlessness/b/playstation4/archive/2016/06/27/star-ocean-integrity-and-faithlessness-review-game-informer.aspx", "text": "The Star Ocean series earned a devoted following for coolsci-fi settings, fun customization, and fierce action combat. Unfortunately,the B-tier franchise has seen better days. I thought Star Ocean was kaput afterits mediocre fourth entry, The Last Hope. Seven years later and it seems like Tri-Aceand Square Enix haven't learned from the mistakes of uninteresting characters,bad storytelling, and repetitive encounters. I wanted to write about howIntegrity and Faithlessness captured the magic of earlier entries, but insteadI'm scratching my head at why the series was brought back if the end result is sosoulless and frustrating. Integrity and Faithlessness is one of the most boring RPGsI've played in years. The cast is vanilla, though not as grating as The LastHope's. Protagonist Fidel is like every hero you've seen before a do-gooderwho wants to prove he has what it takes to live up to his father's legacy. Hischildhood best friend, Miki, is always at his side, filling the typical supportrole and giving him awful nicknames like Fiddly. I hoped the characters wouldget more exciting as the game went on, but they evolve in such predictableways. I couldn't even care about them in the midst of dramatic events, liketragic deaths or a nave character coming to terms with the harsh world.The story isn't entertaining, either. The nation isembroiled in war, but matters get even more complicated when Fidel and Mikimeet a mysterious child who has strange magical powers. Of course, they getcaught in a predictable quest to find answers. Only toward the later hours doesthe story make any semi-intriguing revelations, and even those feel half-bakeddue to poor pacing and aforementioned underdeveloped characters. Scenes oftenplay out with long-winded dialogue, where you see nothing except the backs ofyour party members' heads. This kills the intensity of key moments  even bigspace battles. Additionally, many interactions feel unnatural, as conversationsdouble as load times. These happen in the field, restricting your movement tomolasses speed and disrupting the flow of the game, giving the appearance ofcontrol where there is none. A few cutscenes are littered about, but they're fewand far between.At the very least, controls have improved greatly. Executingspecial attacks is as easy as holding down the button for your strong or weakskills. The action combat gets frenzied, as you chain up combos with your largeseven-member party all fighting at once. I liked the chaos of these fightsuntil I realized my A.I. allies were incompetent. I constantly had to swap toother members just to keep them alive, which thankfully you can do with a clickof a button. I had times where they ran into objects in the environment,preventing them from helping me attack enemies. Other times, they would headstraight into attacks, killing themselves. Don't even get me started on how frustrating it is when an enemylaunches an area attack, often knocking out multiple characters because theA.I. doesn't try to defend itself. This is even worse in missions where youmust protect a character and your entire party goes rushing toward the sameenemy, exposing the escorted character and ensuring her death.The role system is supposed to help alleviate thesesituations by allowing every member of your team to equip different tactics.For instance, you can set a character to focus on weakened allies, which alsoadds a perk of extra defense. You have a limited number of roles for each partymember, and you can level them up to make them more powerful and unlock betterones. However, my party members still weren't smart enough after severalupgrades, even when the role was supposed to enhance judgment. For example, despitehaving Miki set to revive party members as soon as possible, I always had tomanually switch to her to cast it because she would rarely follow through onthe tactic herself. My defeats usually came down to party members doingsomething asinine no matter how safe and strategic I played it. I love a challengingboss battle, but not when it ignores skill and instead relies on elementsbeyond my control. The role system could have been a cool way to upgrade yourcharacters and build them to suit your play style, but instead it's anotheridea with poor execution.To add insult to injury, some of the bigger fights whereyou're supposed to be in the middle of a war are a bore. You repeatedly andmind-numbingly kill waves of enemies, and the battles never play out ininteresting ways. Be prepared to visit the same places and backtrack plenty oftimes from one side of the map to the other. Once you get your ship, some ofthis is alleviated, but you still have to grind through familiar locales. Itgot to the point where I would be elated just to see some different scenery,even though most of the dungeons and environments are sparse and generic.Star Ocean: Integrity and Faithlessness makestoo many missteps to forgive. Recycled content, excessive grinding, boringfetch quests, and bad save points are just some of its smaller shortcomings.What's more concerning is its inability to give you reason to care about the charactersor the journey. In a generation where RPGs are pushing the boundaries withbetter storytelling and unique worlds, this just isn't going to cut it. It'ssad to see a franchise that once captivated me continue to fall from grace.", "date": "Jun 27, 2016", "grade": "5"}