{"name": "Need for Speed: The Run", "ref": "https://www.gameinformer.com/games/need_for_speed_the_run/b/xbox360/archive/2011/11/15/exploring-flyover-country.aspx", "text": "The premise of Need for Speed: The Run is very intriguing. Races at breakneck speeds, out-of-the-car segments offering new experiences, and an over-arcing story to tie it all together could have created a breakthrough racing title that solved the genres repetitive nature. Although The Run contains all of these constituent parts, it fails to execute or combine them in a way that is engaging. After I finished the game, I had raced across America, escaped the mob, and cheated death numerous times, but was left with relatively few postcards to remember the experience by.My main problem with the game is that its cross-country trek simply contains too few highlights. The out-of-the-car moments can be counted on one hand, and when they finally do occur, the fact that they are little more than quick-time events dampens them as a novel gameplay experience in an otherwise foreign genre. The one standout, non-QTE sequence takes place in Chicago with protagonist Jack escaping from a crashed car before an oncoming train flattens him. I liked it because I actually had some choice (or rather, the illusion of it) in how I freed myself. However, this is the only time being out of the car works well.The racing itself isnt boring, but its not novel enough in and of itself to make the game great  especially since its not being bolstered by the on-foot segments. I will say this, however: The racing environments across America are well chosen. Whether its the Nevada desert, the Rockies, cities like Chicago, or even middle America, the races themselves look great and are filled with their share of heart-stopping racing through oncoming traffic, past pursuing cops, and down perilous back-country roads. As fun as the racing is, I wish there were more crazy set-pieces in the game such as when you escape an avalanche or race through the New York subway system. Furthermore, I wanted more variety in the race types themselves, and that fact that the tracks (especially the urban ones) are linear beyond some shortcuts is unfortunate given that rival series Midnight Club has been doing branching races for years.As much as the on-foot vignettes are a lost opportunity for The Run, I also feel like it drops the ball on the story as a whole. Fight Night Champion is a great example of a title that successfully placed a story and characters on top of a genre where it didnt normally belong. There is no depth, character interest, or story twists beyond The Runs stated premise, and I soon detached from it because of that.The game also has an extensive Autolog tracking system to feed you race suggestions, as well as a separate Challenge mode that lets you earn medals for a list of races, but they simply arent enough to hold my interest. Need for Speed: The Run is by no stretch a bad game; it just fails to capitalize on its chances. San Francisco to New York is a long haul, and its even longer when not enough happens in between.", "date": "Nov 15, 2011", "grade": "7.75"}