{"name": "Rayman Origins", "ref": "https://www.gameinformer.com/games/rayman_origins/b/xbox360/archive/2011/11/10/rayman-origins-review-no-rabbids-required.aspx", "text": "When I started playing Rayman Origins, I didnt have any particular fondness for the character or the series in general. I always felt that, amiable as he might be, Rayman was a junior varsity player in a league of professionals. Call me a convert. After putting down my controller for the last time, I cant wait to see what else Ubisoft has in store for Rayman, Globox, and the rest of the crew.Rayman Origins is an undeniably beautiful game, with vibrant environments and richly defined characters. The graphical fidelity is astounding, even when you scrunch your face against the TV screen. Characters kick up eyelash-sized tufts of grass when they land, and the backgrounds are layered with loads of tiny details.Ubisoft Montpellier didnt just create a pretty game, though. Rayman Origins holds its own with the best platformers out there. I was a little concerned about the game when I saw the intricate animations; while I appreciate how nice they can look, I also know that those lovingly crafted frames of animation can translate into imprecise controls and generally mushy-feeling action. Ubisoft managed to hit a sweet spot here, creating stunning characters that are also responsive.That level of quality is present in the traditional platform-hopping stages and bleeds into more exotic areas, such as the mosquito-piloting shooter sections. Whenever I died (which wasnt an infrequent occasion), I usually had only myself to blame. Aside from a section with a cannon-blasting pirate ship, the game skillfully teeters on the edge of being fair but difficult.One of the things that I appreciate about Rayman Origins is how it constantly shovels new things at the player. Whether its a new ability, new gameplay styles, an unlockable character, or another breathtaking level to discover, Rayman doesnt stick to the same old path too long. And even when Rayman delves into themes and areas that seem to be mandatory for platform games in general, Ubisoft puts enough of a twist on the norm to make it seem fresh again. I never thought Id look forward to playing underwater levels, but between the exceptional diving controls and the sea anemone backdrops that approach photorealism, I was absolutely hooked.One of the only big problems I had with the game is how it blocks the end-game content until youve collected enough Electoons to pass. These smiling orbs are the games currency, earned by finding hidden stashes and picking up a variety of collectibles scattered throughout the world. If you dont make collecting them a priority from the start, you may find yourself grinding earlier levels like I did. There are certainly worse ways to pass the time, but it feels like a chore, particularly when the final area is as lackluster as can be.If you only know about Rayman from his affiliation with the now-ubiquitous Rabbids, that probably wasnt the best introduction. Rayman Origins is the proper way to catch up with the character, who finally has a game that puts him squarely in the majors.", "date": "Nov 10, 2011", "grade": "8.5"}