{"name": "Super Mario 3D Land", "ref": "https://www.gameinformer.com/games/super_mario_3d_land/b/3ds/archive/2011/11/09/super-mario-3d-land-review-mario-returns-to-rescue-the-princess-and-the-3ds.aspx", "text": "The 3DS has a couple of great games from Nintendo. The problem is that theyre remakes of N64 titles. Gamers were glad to experience classics like The Legend of Zelda: Ocarina of Time and Star Fox 64, but no one buys a new system to play games over a decade old. That all changes with the excellent Super Mario 3D Land, an all-new adventure in the Mushroom Kingdom  that mixes in plenty of entertaining references to Marios back catalog.3D Land takes level progression all the way back to the original Super Mario Bros., with eight linear worlds to beat one by one. Every stage ends with Mario jumping onto a flagpole, and when he takes damage he shrinks down rather than losing a slice of pie from a circular health bar. All levels include three hidden star coins to collect, which youll eventually spend to gain access to later areas. At first you may be concerned that each world only contains five or six levels, but dont worry. After you complete the main career, theres more than enough content to keep you busy for quite some time.Just looking at screenshots, it can be tough to determine what kind of platformer 3D Land is. The simple answer? All of them. Sometimes it feels like 2D platformer New Super Mario. Bros. Other times the camera will follow behind you like Mario 64 or Galaxy. Youll also see isometric views and a top-down perspective inspired by classic Zelda games. The camera often changes multiple times during a single level, but its done so smoothly that youll hardly notice. I always felt like I was in complete control of Mario no matter what the theme of the level, and the camera is always in the perfect spot for the situation.The controls are spot-on and easy to pick up right away. I initially questioned why 3D Land needs a run button in addition to the analog controls of the circle pad, but I was thankful during later tricky sections that require a deft touch. I eventually played 3D Land like a 2D Mario game, with my thumb covering both the run and jump buttons. The left shoulder button rounds out the arsenal making Mario crouch so that he can get into small tunnels and toggle long and high jumps.Power-ups blend the classics in with a few new ones. Fireballs provide an offensive boost while the Tanooki Suit (not seen since Super Mario 3) grants an infinitely useful floating ability thatll help you past more difficult areas. You can store an extra power-up on the lower touchscreen and tap it anytime to access it. The old item then goes down to the bottom screen so you can easily toggle back and forth between the two. The new boomerang ability fits right in with these classics, and you can purposely dodge the returning projectile to keep it flying around and destroying enemies. Mario can also climb inside propeller blocks for some extra vertical flying power similarly to the propeller helmets from New Super Mario Bros.The level designs are as clever as ever, and provide plenty of new Mario memories. You stomp koopas in green fields, walk along tightropes, hit the gas on a controllable platform, and swim away from a giant sea serpent. I loved navigating the many ominous airships and taking down Bowser by running under his jump and hitting a switch to make him fall into hot lava just like in the first game. Few things are more satisfying than crushing a goomba underfoot after falling several hundred feet.What surprises me most about 3D Land is how well the 3D effect is handled. I kept the 3D slider up most of the game, since the levels pop to life with added depth and plenty of effects. Massive spike pillars thrust toward the screen on airships, Mario looks like hes swimming around in a tiny handheld fish tank during underwater scenes, and the heights feel even more staggering when you have to jump off a massive cliff and navigate small platforms on the way to the flagpole far below. Rest your arms on a table to keep the 3D screen in the sweet spot and you wont be disappointed.Super Mario 3D Land isnt perfect, but the few complaints I have (like the lack of variety in boss fights and some re-hashed levels) cant bring down this entertaining mix of nostalgia and innovation. It lives up to the level of quality set by previous entries and is easily the best reason to own a 3DS.", "date": "Nov 09, 2011", "grade": "9.5"}