{"name": "Tokyo Mirage Sessions #FE", "ref": "https://www.gameinformer.com/games/tokyo_mirage_sessions_fe/b/wii_u/archive/2016/06/22/tokyo-mirage-sessions-%23fe-game-informer-review.aspx", "text": "Crossovergames have a tendency to be silly in order to make two disparate universescollide. Tokyo Mirage Sessions #FE is no exception, combining the worlds ofShin Megami Tensei and Fire Emblem into one heavy dose of Japanese popularculture, ranging from pop stars and actors to fashion and anime. This uniqueexperience merges the two long-running franchises together in interesting ways,since anything goes; you fight by performing songs to damage enemies, wearingelaborate costumes on a vibrant stage. With a colorful cast, fun upgradesystem, and challenging battles, Tokyo Mirage Sessions provides an entertainingperformance through and through. The amusing(and predictable) plot has sinister Mirages taking control of renownedperformers, stealing their creative energy to fuel evil deeds. You play as Itsuki,an ordinary high-school student who notices something is awry when his bestfriend Tsubasa enters a singing competition and members in the audience startdisappearing, opening a portal to the mysterious Idolasphere. The story has agood mix of humor and tender moments, from helping Tsubasa gain confidence in herselfto achieve her pop-star dreams to dealing with your drunk talent agent andanime-obsessed instructor.The FireEmblem characters come in by lending their powers to the main cast to stop thebaddies. For instance, Fire Emblem Awakening's Chrom provides Itsuki a slew ofsword attacks. The most interesting parts of the story come later when youstart piecing together why the Fire Emblem characters are in this differentworld, since they have no memory of how they got there. The story isself-contained, so even if you don't have experience with either series you canstill follow along. The gameplay leans more toward SMT's traditional RPGgameplay; don't expect the strategy battles or relationship system that FireEmblem is known for. Everythingrevolves around the entertainment premise, including the dungeons and battlesystem. You trek through themed landscapes, often focused on modeling and TVprogramming. While I liked having dungeons related to different aspects ofentertainment, they could be more interesting to explore. Every dungeon hassome main puzzle mechanic, but the puzzles are often tedious, requiringbacktracking for tasks like pulling switches on opposite sides of a room orgoing through doors in a specific order. You're also dealing with enemy encounters during the process, which slows you down even more. Mirages appear on screen and lunge as soon as they spot you, so they're often hard to avoid. Though you gaina skill to temporarily turn off battles, I hated having to constantly cast itwhenever I needed to figure out my route.Theturn-based battle system focuses on exploiting enemy weaknesses, which will befamiliar to anyone who has played a Persona or SMT game. However, in TokyoMirage Sessions, when you hit an enemy weakness, you trigger combos with partymembers who have skills that complement it. I enjoyed the battle system,especially how it progresses. Characters learn extra skills that spontaneouslyactivate, making attacks hit more than one enemy, or even team-up for specialperformances which damage the enemy and add perks like status ailments orhealing. Unfortunately, the grinding necessary to reach recommended levels forbosses made the combat lose some of its magic.Some of myfavorite features have nods to Fire Emblem, especially the upgrade system. Youcan master and craft various weapons that open up new skills, but can only equip acertain number at once. Once you get to a certain level, you can even change toa more powerful class using a Master Seal just like in Fire Emblem. As a fan ofboth franchises, I was disappointed by the sparse connections to Fire Emblem;this game loses its strategy-focused gameplay altogether and its characters areancillary, not getting much that much screen time until the final story beats.When you'renot in battle, you can walk around various locations in Tokyo such as Shibuya andits famous Harajuku district. They're not exact 1:1 recreations, but they getthe basic atmosphere down with convenience stores and vending machines aroundevery bend. Various side quests also incorporate fun stuff about Japaneseculture into them, such as tracking down exclusive anime memorabilia andwatching silly TV shows with premises like a girl changing her personality whenshe sneezes. This attention to detail creates a powerful sense of culture andplace, which works well to make the characters' everyday interactionsbelievable.Tokyo Mirage Sessions #FE is a solid RPG withits own unique style and appeal. I could do without the tedious dungeons, but Istill found plenty to love about the zany ride.", "date": "Jun 22, 2016", "grade": "8.25"}