{"name": "Sonic Generations", "ref": "https://www.gameinformer.com/games/sonic_generations/b/ps3/archive/2011/10/31/sonic-generations-review-a-suffering-hedgehog-s-life-flashes-before-his-eyes.aspx", "text": "Sonic Generations aims to bridge the gap between old and new fans by revisiting stages throughout the series with both 2D and 3D gameplay. The result is a timeline that starts out strong and slowly deteriorates, serving as an apt history lesson for the struggling series.The quest begins with side-scrolling tributes to memorable Genesis-era stages as classic Sonic. These levels rekindled the magic of being a wide-eyed kid seeing Sonics world for the first time. Platforming is slightly tighter than in Sonic 4, which makes landing precise jumps easier. Tearing through loop de loops in Green Hill and bouncing across clouds in Sky Sanctuary are among my favorite Sonic moments, and they translate perfectly. Unfortunately, the good times fade when Sonic begins cruising through 2D versions of levels from post-Dreamcast Sonic games. Traversing the burning ruins of Crisis City from the awful 2006 Sonic the Hedgehog reboot is an exercise in frustration packed with unfair drop-offs and annoying gales.Playing as modern 3D Sonic presents the same steady drop in fun. Speeding across double helix pipes and dodging chemical geysers in Chemical Plant makes for some of the best 3D Sonic Adventure-style action the series has seen, but things go south when you break into the last-gen titles. Sonic Unleashed and Sonic Heroes didnt thrill me, and revisiting reworked versions only serves to remind me of how uninspired they are. Legacy issues, like wonky platforming and poorly communicated pitfalls, plague these later levels.The last half of the game serves only to remind you of how far the series has fallen from its original form. I felt smothered by Sonic Teams insistence on shoehorning recent Sonic games, no matter how awful, into the 20-year timeline. Why would Sega pass up full level tributes to Sonic 3 or Sonic CD in favor of a remixed version of a stage from Sonic Colors, which released only a year ago?At the end of the game, old and new Sonic part ways. As they do, modern Sonic says to his retro doppelganger, Hey Sonic, enjoy your future, its going to be great! If he only knew.", "date": "Oct 31, 2011", "grade": "6.75"}