{"name": "The Cursed Crusade", "ref": "https://www.gameinformer.com/games/the_cursed_crusade/b/xbox360/archive/2011/10/26/cursed-crusade-review-what-a-horrible-night-to-have-a-crusade.aspx", "text": "Denz de Bayle and Esteban Noviembre are unlikely companions in an unlikely setting. Beginning in 1202 A.D. in Europe, The Cursed Crusade spans several years and many countries to tell a cinematic tale of two honorable knights fighting for their freedom from an ancient curse. The locales and core concept are different enough from the average action game to carry a lot of potential. Too bad the game is so boring, broken, and unfulfilling. Whether fighting in a tournament in France to gain entry to the Fourth Crusade or sacking the city of Constantinople, almost every mission of Cursed Crusade consists of the same structure. Denz and Esteban crack poorly written jokes in an intro cutscene, fight a wave of opponents, move forward a few feet, fight another wave, and so on until you get an end-of-mission cutscene. Simple boss fights, brain-dead puzzles, and infrequent set pieces involving ranged battles and siege equipment do little to break up the combat. Though the level structure of Cursed Crusade reminds me of a beat-em-up, the combat is as slow as anything Ive ever played. I picked up and mastered a huge range of weapons, including swords, spears, axes, and maces, and the game forced me to play with all of them. No matter what weapon type you wield, it breaks after taking out two or three enemies, meaning you have to constantly grab foes dropped weapons.I can handle games that pace combat slower than the average hack-n-slash  see Dark Souls  but Cursed Crusade makes the unforgivable mistake of constantly putting the player into situations that the mechanics dont allow you to handle. As the game progressed, missions frequently put me up against groups of as many as 10 enemy soldiers at once. With a broken lock-on system, a touchy counter-attack that doesnt provide much help, and enemies attacking from every angle, my emotions quickly moved from slight boredom to controller-throwing rage. Cursed Crusade isnt all frustrating realism. The games titular curse provides Denz and Esteban with the supernatural ability to bathe the world in hellfire and set enemies aflame. Sadly, this power is limited by a very small meter that runs down with each blast of fire shot at enemies. When the meter empties, the characters health bars begin draining as the literal embodiment of Death approaches. The meter can be filled beyond the point that it automatically refills to during regular melee combat, but in the most difficult encounters against legions of enemies, I found it easier and safer to stay back, switch into curse mode, shoot off a few blasts, then switch back until I was ready to call on the curse again. Needless to say, this is not a satisfying gameplay loop.Even if you find something to enjoy in the awful combat, its hard to get over Cursed Crusades numerous bugs and checkpoint problems. Some missions only last five to ten minutes, but in others I made it twenty-plus minutes in only to die and discover I had to replay the whole thing. Even worse, on at least two occasions I got stuck behind friendly NPCs who wouldnt move, forcing me to restart a mission halfway through. Gruesome kill animations clearly inspired by Assassins Creed turned laughable as my weapons clipped through enemies in awkward ways, and every time I beheaded an opponent, his head turned into the same untextured, bald crown  even if it had a full beard before my sword separated the head from the shoulders. All of the gameplay problems are less surprising when you look at how much time Cursed Crusade devotes to its story. Clearly the team at Kylotonn Games had lofty goals of crafting an entertaining interactive story, but the narrative falls just as short as everything else. Denz and Esteban arent remotely likable, so its difficult to care about their quest to save themselves from eternal damnation, especially as they ride along on the Fourth Crusade and murder plenty of presumably innocent soldiers protecting their homelands. The rules governing the supernatural curse seem completely arbitrary and made up as the game goes along, with the only consistency being that any characters you meet who are in a place of power are almost certainly cursed as well. Kylotonn attempts to leverage the drama with moments of levity, but the jokes feel out-of-place and overdone. Having the starring duo talk about achievements as you unlock one? Oof. A 300 reference? Yawn. If you push through the dumb writing and get to the end, youre be rewarded with one of the most anti-climactic finales ever  a ~really, thats it?~ moment that suggests the developer might be expecting to do a sequel. Theyve got their work cut out for them if thats the case.Since Esteban appears in every mission, Cursed Crusade can be played cooperatively. In most reviews, this is the part where I would say, ~If youre going to play this game, do it with a buddy,~ but that would be a cruel lie that would likely cause you to lose a friend. Not even co-op can save this experience, and besides, if you really want to make it through this game, youll want the near-invincible AI-controlled Esteban over your weak, fleshy, real-world friend. But instead of choosing between a co-op or AI partner, you should just avoid playing this game. The only thing of any value that Cursed Crusade has left me with is a blight that will remain on my Xbox Gamerscore until the end of time.", "date": "Oct 26, 2011", "grade": "3"}