{"name": "Disney Universe", "ref": "https://www.gameinformer.com/games/disney_universe/b/xbox360/archive/2011/10/25/disney-universe-review-not-an-e-ticket-ride.aspx", "text": "Playing through Disney Universe reminded me of Disneylands own Its a Small World ride. My initial exclamations of aww gave way to AHH! after enduring the same cutie-pie shtick on repeat. Even though the lyrics may change slightly, its the same cloying tune over and over and over again.In the games world, Disney Universe is a virtualized version of a Disney theme park, giving players a chance to explore familiar settings and visit with friendly faces from some of the companys biggest franchises. Before the friendly computer guide can finish with the introductory tour, the game inside the game is infected by a cybervillain named HEX. The formerly idyllic world is now home to nefarious AI villains. Its the players job to set things straight by beating the ever-loving bits out of the bad guys.When it was first revealed at E3, Disney Universe drew comparisons to LittleBigPlanet. While it may share a similar aesthetic if you squint really hard, it has more in common with Travellers Tales series of LEGO games. At first, theres a lot to like. The characters are delightfully cute, with dozens of different familiar costumes. The settings incorporate a whos who of classic Disney properties. The Lion King! Aladdin! Pirates of the Caribbean. Wall-E? Eh, close enough. The gameplay is pretty basic stuff, but it has to get better. Right?Unfortunately, what you see is largely what you get. Each of the different worlds offers obvious cosmetic differences, but the overarching gameplay is largely unchanged between them. Sure, a key may take the form of a lamp or a sword or a sword swallower (dont ask), but the functionality is identical. Punch the bad guys, kill the bad guys, unlock the latest barrier, move forward a little bit. The few gameplay variations (arcade games within a game about a game!) are cute, but theyre about as interesting in the long run as a 30-second Mario Party minigame. While Im all for a little hand-holding, Disney Universe takes helping the player to ridiculous extremes. Blue arrows point players to their next immediate objective, reducing what puzzles there are to simple fetch quests.Disney Universe gets more interesting when you grab three friends (or kids) and play together, but so does just about everything. Theres a nice little competitive element in the game, and players can sabotage their friends efforts by hoarding power-ups and triggering traps. That said, the game is so shallow and repetitive that only the most easily amused will be able to slog their way through to the end credits, with or without companionship.", "date": "Oct 25, 2011", "grade": "6.5"}