{"name": "Kirby's Return to Dream Land", "ref": "https://www.gameinformer.com/games/kirbys_return_to_dream_land/b/wii/archive/2011/10/23/kirby-review.aspx", "text": "In the past year, Nintendo has released three decidedly different Kirby experiences. Epic Yarn is a charming yet consequence-free Wii platformer, and Mass Attack is a solid DS entry with some similarities to Pikmin. Both games were well received, but neither is reminiscent of classic Kirby gameplay. With Kirbys Return To Dream Land, the pink puffball is back in the form(s) that made him famous. Its classic Dream Land gameplay, with our hero inhaling enemies to gain their various powers. Revisiting these classic mechanics is great for nostalgic purposes, but its the four-player co-op integration that breathes new life into the formula.Possibly inspired by the success of New Super Mario Bros. Wii, Kirbys Return To Dream Land features a remarkably simple method for friends to join the fun. If youre playing single-player, friends can hop in and out with the press of a button. No menus, no well get you in once I get back to the world map  just press a button and select your character. As I reviewed the game, a steady stream of editors kept jumping in for a level or two throughout my sessions. The ease of joining and leaving is better than any Ive seen in a co-op game. My only complaint regarding co-op play is the way lives are handled. If anyone but player one dies, their lives are subtracted from a shared pool. However, all four players will be sent back to the last checkpoint if player one dies, regardless of how many shared lives the group has. If you dont want your entire team to suffer thanks to this questionable system, youll want to make sure player one isnt prone to frequent deaths.Return To Dream Land is a blast with friends, but its also worth playing solo. Each level features a set amount of energy spheres (there are 120 total), and collecting these unlocks new single-player challenge levels and entertaining multiplayer minigames. Completing most of the levels isnt terribly challenging, but finding all of the energy spheres is a worthy challenge for completionists.Each of the four characters (Kirby, Meta Knight, King Dedede, and Waddle Dee) has his own control scheme and attacks, but Kirby is the only one able to assume enemy forms. Many enemies give Kirby powers previously introduced in the series, but the new ultra attacks are satisfying screen-clearing ordeals.While it doesnt have the challenge of Donkey Kong Country Returns or the charming art style of Kirby Epic Yarn, Kirbys Return To Dream Land is another formidable entry in a line of great side-scrolling Wii platformers.", "date": "Oct 23, 2011", "grade": "8.5"}