{"name": "Professor Layton and the Last Specter", "ref": "https://www.gameinformer.com/games/professor_layton_and_the_last_specter/b/nintendo_ds/archive/2011/10/18/professor-layton-and-the-last-specter-review-another-quality-adventure-with-an-rpg-apprentice.aspx", "text": "When gamers talk about the Professor Layton series, most have played a game or two in the series, but few have made it through the entire trilogy. Level-5 wisely steered the fourth game in the series back to the time when Layton and his apprentice first met, kicking off a new prequel trilogy. This way new players can jump in without feeling lost and veteran players can skip any missed entries without the guilt.This time around, the professor heads to the town of Misthallery with his original puzzle-solving apprentice, Emmy Altava. Its nice to see him run around with another capable adult, and when they team with Luke, it creates an entertaining rivalry. Interesting new characters abound, like the He-Man policeman Grosky and the strange hide-and-seek enthusiast Goosey. While the story isnt quite as good as the excellent Unwound Future, it still hits all the right beats and knows how to tug at the heartstrings at the end.Most of the mechanics remain unchanged from the advances made in the last game. This is fine by me, since those changes addressed a lot of my previous complaints. Youll recognize a lot of the same puzzle types from previous entries like block sliding, tracing tangled wires, and basic geometry. I suppose its not easy to create the 155 in-campaign puzzles from scratch, but Id take fewer puzzles for a little more innovation.What really sets Last Specter apart from previous entries is the impressive all-new London Life bonus game, which is playable right away. Its touted as a 100-hour RPG, but this is more Animal Crossing than Final Fantasy. You create your own avatar and then ride in on the Molentary Express to Little London, a Disneyland-style mash-up of all four Layton games characters and locations. The small city grid (spanning approximately five blocks) is the primary location, with a couple side areas to explore. London Life is all about running errands for people, buying new clothes, and decorating your place. To earn some extra scratch, you can wander around town and pick up trash for city hall, participate in a juggling minigame in the park, and several other activities. The game frames the main point as a choice between money and happiness, but I was happy to discover that you can get plenty of both in no time flat as long as you check the newspaper for quests every in-game morning.Going into London Life, I had hoped to hoof it from town to town with Layton and Luke, clearing out dungeons in turn-based battles along the way. Now that Ive played the real thing, I understand why this direction was chosen. There is very little fighting in the Layton series; its more about walking around and talking to people. This ends up being a charming way to revisit a pixelated version of the Layton world for fans and its the best bonus content the series has ever had. Once youve beaten all the puzzles in a normal Layton game, theres very little reason to put the cart back into your DS. London Life will ensure plenty of gameplay to bridge the gap to the next 3DS Layton chapter.", "date": "Oct 18, 2011", "grade": "8.5"}