{"name": "Time Machine VR", "ref": "https://www.gameinformer.com/games/time_machine_vr/b/oculusrift/archive/2016/06/10/time-machine-vr-game-informer-review.aspx", "text": "In a near-future world, the fate of humanity is in question and you are the only person who can save it. How many games have you played with that premise? Time Machine VR injects you into this same scenario, but its far from the way youd imagine. Rather than shooting your way through dangerous ruins to find a powerful artifact, Time Machine VR tasks you with returning to different prehistoric eras to research various underwater dinosaurs in hopes of finding a cure for an ancient disease that has recently resurfaced. Though the premise is intriguing, the brief campaign feels more like an innovative VR museum exhibit than a form of entertainment. You assume the role of a cadet working at a futuristic research facility. Your training is interrupted by the news of a disease that originated in prehistoric times. The melting ice has allowed it to resurface, so youre tasked with returning to its periods of origination to research a cure. The story serves as an adequate device to help give purpose for what youre doing, but the main draw of Time Machine VR is the educational experience of learning about these creatures.The main campaign is composed of four fairly short missions. In each mission, you navigate your pod through underwater sections and observe dinosaurs as they swim and feed. The pod is responsive and controls well, but it scoots along rather slowly. At one point, I went exploring a bit in between objectives, only to find a long haul back to the area I needed to be at in order to progress.Viewing the dinosaurs as they swim around you is a sight to behold, and youre given eight different tools that unlock over the course of the campaign to learn more. From a probe that helps you identify the creatures initially to echography scans that let you do ultrasounds on targeted regions of a dinosaurs body, Time Machine VR gives you the tools you need to learn about these aquatic beasts (but if you just want to absorb the facts, youd be better off entering the dinosaurs name into Google). The devices are used almost like weapons  you aim using the head-tracking of your VR headset  but youre never hurting them, save for when you bait predators into eating other creatures.I enjoyed learning all that these devices told me about prehistoric creatures like the mosasaurus and the neoparadoxia, but I rarely felt the rush of excitement and wonder that should come with swimming among these beasts thanks to the schoolbook-like structure of the missions. The first time I encountered a dinosaur in my pod, I stared in awe of the sheer size of it. The sense of presence that you feel in virtual reality is effectively translated through Time Machine VR. Unfortunately, that wonder only lasts so long, as by the second mission, the novelty of looking into the eyes of a massive beast in VR is largely lost and the monotony of the actual missions takes hold.Traveling from one point to another, performing probes, ultrasounds, and exo-scans take up the bulk of the campaign. Successfully scanning a creature is mildly satisfying, if only due to the ticker that flashes on your screen showing you how it affected your progress on the current level. As you complete each objective, your A.I. assistant Rob gives you detailed instructions of what to do next, which made me feel like I was on a guided tour of the different prehistoric eras rather than exploring them myself.The most thrilling moments came when a dinosaur actively hunted me. In an early mission, I got a little too close to a carnivorous pliosaurus, which caused it to attack my pod. Using my time freeze ability, I stopped it in its tracks, scanned its anatomical features, and escaped with my life. Other times I wasnt so lucky, but I appreciate how getting caught in the jaws of a predator didnt cause me to lose any progress. Instead, it reset me just out of the creatures feeding grounds so I could attempt my approach again. Sadly, these experiences do not happen enough during the main campaign, as the fun gives way to tedium.Once the campaign wraps up, youre given the ability to travel back to previous areas in order to explore more and gather more data. This opens up the possibilities for replayability as you can push your research to be more complete, but nothing compelled me to return to every single mission area to complete all of the data collection.Time Machine VR is a unique tool for learning about certain breeds of underwater dinosaurs, but it isnt fun. I enjoyed the more dangerous moments in the campaign, but the scales are tipped too far to the academic side. If youre looking for a distinct interactive way to learn about prehistoric creatures of the deep, thats exclusively what Time Machine VR accomplishes.This review pertains to the Rift version of Time Machine VR. The game is also available on Vive.", "date": "Jun 10, 2016", "grade": "6"}