{"name": "Ace Combat Assault Horizon", "ref": "https://www.gameinformer.com/games/ace_combat_assault_horizon/b/ps3/archive/2011/10/11/a-new-way-to-fly.aspx", "text": "Assault Horizon feels a little different from previous entries in the Ace Combat series. Its not wildly different. It hasnt suddenly changed genres and turned into a turn-based RPG, but it is different enough where there is a slight possibility that long time fans may be turned off. Possible new fans though, are welcome with wide open arms.The biggest change in Assault Horizon is the Dog Fight Mode, or DFM for short. DFM is entered by tailing your opponent closely for a certain period of time until a green circle appears over your combatant. After that you press the shoulder buttons, you are locked into DFM. The camera pulls up tight behind your ship and control over the jet becomes limited, but thats a good thing. The broad controls are left to the computer meaning you dont have to perform the chase. All you have to do is get your reticules aligned to blow up some flying villains. The camera shakes and shifts depending on what weapon youre using, and it adds a tangible feeling of intensity to every battle. Instead of simply chasing green triangle markers around hoping your bullets and missiles land, you are now in the middle of an intense visually pleasing airship battle. Once youve taken out your target, the camera jumps to the wreckage allowing you to enjoy your handiwork.Camera movement is a big part of Assault Horizon. Along with the visual movements employed in DFM, you will also take control of the camera from time to time during cutscenes, and have your attention diverted with the press of a button in order to focus on important happenings. The camera is constantly moving in interesting ways and it adds a level of seriousness to a story that doesnt stray too far from the clichs of video game wartime storytelling. Allegiances are broken, surprise twists pop up, and there are at least three massive explosions witnessed close range from the first-person perspective. Its nothing we havent seen in a Call of Duty, but it is enough to make you move onto the next level to see what is going to happen.Initially there seemed to be a strong focus on the characters of Assault Horizon starting with what appeared to be a very personal story of the lead pilot. As the game moves forward though, much of that is lost in favor explosions on top of explosions.Along with the standard jet, youll also be controlling combat helicopters and the door guns of gunships. The jets are easily the most fun, but the additional vehicles mix up the action well. The gunship levels are straightforward. Look through your nightvision goggles and take aim at the evildoers. The combat helicopter is more fun as you hover around blowing up everything in sight doing cart wheels to avoid rockets. None of the vehicles feel particularly realistic, but its in all in favor of a more enjoyable and more cinematic experience.Multiplayer consists a few different modes and the option to play through missions cooperatively. The capital conquest and domination modes require teamwork and cooperative planning. The former has players focusing on specific targets to ultimately open up a bomb run on your opponents base, while the latter is the familiar mode of capturing and holding specific color-coded areas. The most fun though is found in the simple deathmatch mode. Jumping in and out of DFM with real opponents to raise your kill count is a lot of fun. As you progress through multiplayer you will unlock assorted ships, skills and ship colors to help set you apart during future online sky battles.The cooperative mode allows for two to three players to take on slightly adjusted versions of the missions from single player. The enemies are harder to take down in coop mode, and you can do fancy things like coordinate DFM runs on single enemies to totally eliminate their chances of survival. Its a lot of fun working together to take out a single enemy, or to even see your buddy annihilate an enemy pilot from close up. You will often find yourself flying through the wreckage of a downed ship that you had the pleasure of watching your partner take out.DFM can be very jarring at first as it does whip and shake the camera in disorienting ways, but once youve gotten a handle on the perspective it becomes hugely rewarding to fight with it. Youll be tailing enemy ships through crowded cities spraying them with bullets and missiles until they explode in slow motion emptying oil and debris all over your windshield. You may even see an enemy pilot or two flying through the air after theyve ejected from whats left from their ship. Ace Combat fans might not like the new mode, but give it a bit of time, and you will likely come around. If youve been looking for an entryway into the flight combat genre this is a great place to start, and if youre already a fan, Assault Horizon has something a little bit different to offer you that you can definitely appreciate.", "date": "Oct 11, 2011", "grade": "8.25"}