{"name": "Sesame Street: Once Upon a Monster", "ref": "https://www.gameinformer.com/games/sesame_street_once_upon_a_monster/b/xbox360/archive/2011/10/11/everything-s-a-ok.aspx", "text": "As someone who makes a living via the written word, this may get me into a bit of hot water: Im tired of the alphabet. Ive just about had it with numbers, too. If youre the parent of a young child, you know exactly what Im talking about. Just about every age-appropriate video, TV show, and educational game hangs its hat on those two standard lesson plans. Enough already. Thats why Warners Once Upon A Monster game seemed like such a revelation when it was announced. First, it was based on the Sesame Street characters that are so revered in my house. Next, it was educational, but with more of a focus on social skills and other often-neglected subjects. The fact that it was being developed by Double Fine Productions was just a delicious extra layer of icing.Make no mistake: This is a game for young players and their families. Only the most die-hard Achievement hoarders will have the endurance to stick through it if they didnt start off with a love for Sesame Street and its characters. If youre under the games intended umbrella, however, its one of the best family focused games ever made.If you had to distill Once Upon A Monster to its essence, its a series of educational minigames that you play with Kinect-based motions. Reducing it that way would be a mistake, however. Double Fine absolutely nailed what makes Sesame Street what it is, from the Muppets loveable personalities to how educational content is cleverly masked beneath storylines that kids can relate to. Its all strung together in a series of vignettes that make up larger chapters in the games virtual storybook.For instance, the games first chapter focuses on a long-limbed monster named Marco. When Cookie and Elmo run into him, Marco is sitting on a stump alone, celebrating the saddest birthday party ever. The three fuzzballs then go out into the world to round up some guests for a proper party. For example, one would-be attendee wont go unless hes wearing the perfect outfit (an opportunity for a quick lesson on colors), another needs help creating music for the shindig, and Grover has gotten sidetracked trying to figure out how to fly. All of these tasks and more are accomplished through intuitive gestures that Kinect recognizes with ease.I was curious to see how my four-year-old son would take to the game. After a few afternoons with it, its basically all he wants to talk about. I was surprised to see how easily he took to the controls, especially since tasks such as flying via arm flapping and leaning seem so complicated. When he did have trouble, the game didnt penalize him for it. Rather than punish players who dont duck out of a low-hanging branchs way or have poor garbage-chucking aim, Once Upon A Monster focuses on praising successes. It encourages cooperative play through seamless drop-in and out gameplay, and none of the tasks are based on competition  so you dont have to feel obligated to cut your wee one some slack.Once Upon A Monster is the educational game Ive been wanting since I first had kids. Its approachable and easy for them to grasp, while still remaining enough of a game to keep me engaged, too. If youre a parent whose kids already know their ABCs, Double Fines game is a fantastic way to reinforce often-neglected (but critically important) skills like empathy, responsibility, and friendship. Plus, you can make Grover flap his stringy little blue arms like nobodys business.", "date": "Oct 11, 2011", "grade": "8.5"}