{"name": "White Knight Chronicles II", "ref": "https://www.gameinformer.com/games/white_knight_chronicles_ii/b/ps3/archive/2011/10/07/mediocrity-breeds-laziness-in-this-boring-rpg-sequel.aspx", "text": "I'm always disappointed when a developer I like puts out a bad game, but you know what offends me even more? When a developer I like puts out a lazy game. The first White Knight Chronicles was a mediocre experience when it arrived in early 2010, but its sequel shamelessly recycles content to a degree that has me seriously questioning the abilities of once-trustworthy developer Level-5.As with the first game, White Knight Chronicles II is a clearly Final Fantasy XII-inspired, MMO-light Japanese RPG. Whether going solo or playing online with up to five other players, you will fight across complex dungeons, massive plains, and other open settings. Each character in your party can be tailored to focus on almost any weapon or magic type, providing a great deal of flexibility for combat. Sadly, that flexibility is wasted in a game world that offers little of interest. Twenty hours into White Knight Chronicles II, I was still fighting the same giant bugs, spiders, and scorpions that were primary opponents at the beginning of the first game. Level-5 didn't create many new creatures for the sequel, and everyone tends to have the same strategy anyway: Discover which type of attack they are weak against and hack away until they fall. Even when you summon the impressively huge titular White Knight, the plodding pace of combat doesn't improve.One of the first major plot points of White Knight Chronicles II involves the party of over-powered teenagers using a book that allows them to travel through time. What's their first destination? The exact same events that kicked off the first game. Not only does this sequel largely use the same maps and enemies, it actually wastes time retreading the same narrative ground for large stretches.The only highly positive thing I can say for White Knight Chronicles II is that it has an absurd amount of content. The sequel itself can easily last well over 50 hours depending on how much side content you do and whether you get pulled into multiplayer, but a remastered version of the first game is also packed in. You can choose to skip right to the beginning of the second, but if you play both back to back there is well over 100 hours of grinding and questing to keep you busy. Then again, in a game that's this tiresome after 10 hours, maybe that's not really a good thing?White Knight Chronicles II is destined to be one of those examples forum trolls point to when they're explaining everything that's wrong with Japanese RPGs, but the biggest problems with this game aren't due to genre conventions. There are plenty of scenarios here that should be interesting  from journeying into the past to fight a poison-spewing dragon to invading a volcanic island inhabited by an aggressive opposing army. Where the game falls depressingly short is in Level-5 ignoring the many valid criticisms of the first game and churning out a cookie-cutter sequel that is even more of a rehash than the average yearly sports title or shooter franchise.", "date": "Oct 07, 2011", "grade": "3.5"}