{"name": "Spider-Man: Edge of Time", "ref": "https://www.gameinformer.com/games/spider-man_edge_of_time/b/xbox360/archive/2011/10/06/the-great-locked-door-caper.aspx", "text": "Spider-Man: Edge of Time's story plays out like a StephenHawking book  if Stephen Hawking was a comic book-addicted third grader. Theterms ~quantum causality,~ ~Einstein-Rosen Bridge,~ ~temporal paradox,~~wormhole,~ and ~timestorm~ are thrown around at will with little regard forscientific fact, and are mostly used as explanations for incomprehensible plotpoints. This tale starts out with an easily graspable hook. In theyear 2099, an evil scientist named Walker Sloan figures out a way to alterhistory. Through his tinkering, he's turned his company Alchemax into atotalitarian powerhouse. The Spider-Man of this day, Miguel O'Hara, knows thatthis isn't the way that history originally played out. To save the future, hemust revert the past to its original form. Now here's where things get a littleweird. In this altered past, Peter Parker works for Alchemax (as opposed to theDaily Bugle). He's forced to submit his DNA to the company for...youknow...reasons. In 2099, Miguel uses this DNA to create a chronal device thatallows him to communicate directly with Peter. Think of it as a timephone...that runs on DNA strands...and can apparently only be used after Petersubmits his DNA  rather than a day or a few years before bad things starthappening. Working together across time, the Spider-Men must reverse thepolarity of the chronal energy to right the events of the past and future.Chronal energy polarity, eh? This is starting to stink of a Q plot on Star Trek: The Next Generation. SPOILER:From what I could gather, this polarity shift was accomplished by throwingDoctor Octopus' mechanical tentacles into a wormhole. Science?Getting to this point requires time altering events. For instance, if Miguel runs into a dead end, Peter can alter thepast (usually by punching bad guys or breaking devices) to open up a new path inthe future. The way that this is telegraphed to the player is quite cool. Whileplaying as Peter, a picture-in-picture view of Miguel appears in the lowerright-hand corner of the screen. Once Peter succeeds in his mission, Miguel'sscreen expands to full-frame and control is seamlessly handed off to him. Thissystem removes the boundaries of running through bookended levels and makes thegame seem like one gigantic story-driven adventure.No matter how much Peter changes in the past, he cannot helpMiguel open locked doors. Given how frequently they are used, Activision should reprint this game's packaging withthe bullet point: ~Dozens of locked doors and keys to find!~ Most of themissions feature a locked door or two or three. Some doors even require threekeys to open them. The video game clich of everything happening in sets ofthree is abused to the point of absurdity. In one frustrating boss fight,Spidey must gather his foe's DNA three times to complete a strand. Science?Edge of Time's combat mechanic is similar in design toBeenox's previous Spider-Man title, Shattered Dimensions', but is made hard tofollow through the infusion of time-based powers. Miguel can phase throughtime, leaving an imprint of himself that enemies attack. Peter can speed up hismovements to cover ground at a pace similar to Quicksilver's. When these powersare used frequently, which is a smart tactic, keeping track of Spidey'slocation is kind of like playing ~Where's Waldo,~ especially given how manyvisual effects are tied to most frays. I mashed the attack buttons, used thephasing/speed powers whenever I could, and was able to rack up 100- and 200-hitcombos frequently. Truth be told, having an unfair advantage over combat iskind of empowering, but when the end result is almost always getting a key soyou can move on to the next combat area, there isn't much satisfaction tied toit. A fairly large list of combat upgrades is offered to individualize playerstyles, but none of them really seemed to give me a benefit over the phasing andspeed.The one Spider-Man trait that is rarely touched on isSpider-Man's web swinging ability. Since this entire game takes place inside ofAlchemax's facility (both in the present and future), most of the environmentsare enclosed spaces that make combat intimate and web swinging an afterthought.Yes, the Spider-Men can still swing through these areas, but it's mostly onlyuseful to shift quickly from one end of the room to the other. Only a few areas in this game allowthe player to gracefully swing over large expanses and the gameplay tied to these moments is fairly unremarkable.Allof this culminates in an experience that doesn't necessarily feel like it wastailored for Spider-Man. I applaud Beenox for trying something different withthis iconic character, yet ultimately find myself thinking about how many locked doors Iopened rather than the story, combat, or character-based moments. For me, thegame just seemed to get worse as it went on and more frustrating as the sametypes of mission objectives were recycled. Shattered Dimensions was good fun (agame I would have given an 8 to if I had the chance to review it). Edge of Timeis a major step back from the formula that worked.", "date": "Oct 06, 2011", "grade": "6.5"}