{"name": "X-Men Destiny", "ref": "https://www.gameinformer.com/games/x-men_destiny/b/xbox360/archive/2011/09/27/build-your-own-mutant.aspx", "text": "X-Men Destiny has a rewarding premise. Create a brawling-heavy action game starring a brand new mutant in the X-Men universe. Choose his or her powers, and upgrade them over the course of the game. Throw in a little RPG conversation and storytelling, and the option to choose sides in the bubbling conflict. If only the battles and mission structure kept pace, there would be a lot to enjoy. Sadly, those elements feel repetitive and generic, and the whole experience is hamstrung as a result. The game dives head-on into the X-Men fiction, setting up an alternate version of the story where Professor X has been killed, and mutant/human tension is at an all-time high. Cyclops and the X-Men struggle to maintain the peace, even as Magnetos Brotherhood nudges things closer to chaos. A mysterious and deadly attack on a peace rally in San Francisco pushes the conflict over the edge, and the city falls into chaos. One of the unlucky bystanders at the rally happens to be an undiscovered mutant whose powers burst forth during the crisis. You control this confused youngster  one of three distinct characters, each of whom can choose one of three unique power sets. One turns your mutant into a rampaging bruiser with fists of stone. A second option sets you up with blasts of ranged energy. A third is an agile melee option utilizing shadow matter  think the unholy offspring of Nightcrawler and Wolverine. No matter your choice, your power set develops in thrilling ways over the course of the game with powerful new combat moves and one-off specials. That customization extends to special collectible abilities you find in the world, each of which is tied to a well-known X-Men character. Put on Quicksilvers iconic lightning bolt costume. Gain Icemans freezing capabilities. Adopt Colossus armored shell. While this approach to power acquisition might strike comic fans as a little off kilter, its a fun dynamic within a game universe. By the end, your character is a formidable powerhouse. Along the way, youll get to meet a cavalcade of familiar faces from the comics, each of whom will exhort your allegiance to either the X-Men or the Brotherhood. Theres not much to the conversation system  mostly exposition and character introductions  but the occasional choice does take the story down different paths. Along with the unique power choices, it makes a good argument for a second playthrough. Beyond the occasional chat, most of these heroes and villains join you in the fight. Some of the most memorable sequences have you fighting side-by-side as Cyclops bursts out his optic blasts, or Juggernaut bowls over his foes. Your initiation into the X-Men (or Brotherhood) comes via a series of missions across a ruined San Francisco. Almost without exception, these uninspired quests require you to kill a certain number of enemies before moving on to the next arena-style battle. The teeming enemy attackers have all the strategic wherewithal of swarming bees, and they look about as distinct. You can only fight so many identical fellows with electric batons before things start to go south. Button mashing carries you through most of the game, and the occasional death is probably only because you stopped paying attention. As an opportunity to devastate an endless string of baddies with impressive-looking powers, it succeeds. As a full-featured and challenging combat system, it fails. Add in some middling environment and character visuals on top of the lackluster gameplay, and X-Men Destiny has some big problems. Five years ago, I would have a lot more positive things to share about the game, but action titles have advanced in that time, and Destiny doesnt keep pace. Even so, as an X-Men fan, I got a kick out of all the character cameos, not to mention the extensive customization features. Take the game at face value  as an opportunity to be an overpowered superhero for a few hours  and you could enjoy the ride.", "date": "Sep 27, 2011", "grade": "7"}