{"name": "Dragon Quest Monsters: Joker 2", "ref": "https://www.gameinformer.com/games/dragon_quest_monsters_joker_2/b/nintendo_ds/archive/2011/09/13/dragon-quest-monsters-joker-2-review.aspx", "text": "Most gamers dont see monster collection as a genre, since one series garners almost all of the attention: Pokmon. While Dragon Quest Monsters shares many qualities with that franchise, it also has more hardcore appeal. Like the previous entry, Joker 2 touts more robust RPG elements than Pokmon  dungeons, boss fights, skill points  that give it more depth than your average catch-a-thon. The big draw of any title in this style is the monsters, and Joker 2 has over 300 of them to collect, level, and breed. The gameplay revolves around recruiting wandering beasts, and then fighting turn-based battles to build up their skills and stats. The story surrounding these activities is practically non-existent, so the majority your time is spent grinding through the ranks. This basic formula has sustained Pokmon and its ilk for years, but its wearing thin, and Joker 2 doesnt do enough to keep things fresh.If you get tired of the endless barrage of battles, the few diversionary quests and arena battles wont do much to give you a break. That leaves you wandering around, fighting through dungeons, and training monsters without reprieve. The repetition can be dull, but if you enjoy the grind, Joker 2 has ways of rewarding your perseverance. The skill system lets you choose which skills (from various trees) your monsters learn, so you feel like youre customizing your team rather than just learning certain abilities at set levels. You can further tailor their performance by buying and equipping items, lending a more traditional RPG flavor to your party. The big payoff comes once the monsters hit level 10, when you can combine them in a breeding process more akin to Persona than Pokmon. This additional complexity is welcome, but it doesnt fill all of the gaps in Joker 2.Something about this installment lacks the elusive charm that keeps players coming back to the competition time and time again. The environments in Joker 2 are generic, the characters are flat, and it feels practically identical to its predecessor. The cast of monsters also has something to do with it; Ive been playing Dragon Quest for years, and I like the stable of creatures, but Id take Charmander over Platypunk any day. The most notable improvement over the last entry is the expansion of online options. You can battle other players locally or online, and the DS Tag Mode opens up new monsters to recruit if you connect with owners of other DQ titles. Players can also join in weekly online tournaments for in-game prizes, but to be competitive, youll have to spend plenty of time with the single-player quest.Dragon Quest Monsters: Joker 2 may not be the most innovative creature-collecting game on the market, but it does a good job dangling carrots in front of players who dont mind constant grinding. The underlying systems are solid, and the addition of online battles gives it more longevity than the previous title. You wont find many other new features if you played the original Joker, but the familiarity doesnt keep the formula from working on a basic level.", "date": "Sep 13, 2011", "grade": "7.5"}