{"name": "Disgaea 4: A Promise Unforgotten", "ref": "https://www.gameinformer.com/games/disgaea_4_a_promise_unforgotten/b/ps3/archive/2011/09/06/the-formula-still-works.aspx", "text": "Nippon Ichis quirky anime-styled strategy/RPG series burst onto the scene back in 2003, winning over gamers with its cutesy charm, self-deprecating wit, and an intricately crafted design that held up whether you played a 50-hour straight shot through the story or dumped 1,000 hours into fully conquering the game. Disgaea 2 and 3, while decent fan service, did little to advance the series. This fourth entry doesnt eclipse the high water mark set by the first game, but its intriguing approach to online play and the usual host of minor improvements across the board are enough for me to recommend it to lapsed fans and newcomers alike.As always, Disgaea revels in subverting tropes from all across nerd culture. The story occasionally dips into seriousness with explorations of morality and absentee parents, but most of Disgaea 4s dialogue is a lighthearted dance of tongue-in-cheek jabs at conventions from anime, RPGs, sci-fi, fantasy, and more. Cultural humor is often lost in translation, especially genre-specific jokes, but Disgaea 4 embraces worldwide gamer culture rather than referring to Japan-specific ideas and memes. The occasional flat joke or clumsy translation is easily forgiven; I chuckled well more often than I groaned.Disgaea 4 is mechanically identical to its predecessors in all but a few ways. You still create dozens of characters to fulfill roles as broad or specific as you like, wade through thousands of items, recruit monsters great and small, dive into randomized item worlds, bribe the Dark Senate for favors, and do everything else youve done in Disgaea forever. The conflict is still turn-and grid-based tactical battles that range from straight-up slugfests to intricate Geo Puzzles and everything in between. The Evil Deputy system, where you set up your characters on a board and link them together with the Tetris-like shapes of Evil Symbols, is a fun metagame that can add a lot of depth to your tactics if you dig into it. Having your two main characters support each other with jaw-smashing bonus attacks every turn, for instance, makes a big difference.Sending your own pirate raiding crews, created levels, and Dark Senators out into the network to work your evil will is a powerful ongoing draw. You dont control any online interaction directly (other than item trading and chat), instead uploading your content to PlayStation Network and having the system randomly insert them into other peoples games. You reap the rewards, though  bribes offered to your Senators appear in your game, your pirates come back with plunder from any heroes they defeat, and more. The system is a perfect fit for Disgaeas endless improvement treadmill, and I foresee myself coming back to the game over and over in the coming years to tweak my levels and get ever-better items and characters.The network is the only place Disgaea 4 breaks much in the way of new ground, but its a wonderful complement to yet another iteration of an already slick design. Absent a major rework of Disgaeas foundation, this is about the best that we could ask for  even if you have to remind yourself that youre not playing the same PlayStation 2 game from 2003 once in a while.", "date": "Sep 06, 2011", "grade": "8.25"}