{"name": "Resistance 3", "ref": "https://www.gameinformer.com/games/resistance_3/b/ps3/archive/2011/09/06/review.aspx", "text": "Launching with the PlayStation 3 back in 2006, the original Resistance: Fall of Man signaled that Sony wanted a blockbuster FPS franchise to call its own. Insomniacs alternate history shooter deviated from clichs set by both WWII and sci-fi games with a story about an alien invasion in the 1940s. Its sequel made some odd decisions, such as limiting the single-player loadout to two weapons instead of the well-liked weapon wheel from the first. After fans gave the sequel negative feedback, Insomniac made some significant changes heading into Resistance 3. Unfortunately, theyre not enough to keep the game from being a decidedly average shooter, and the most disappointing entry in the series.After ending the misery of previous protagonist Nathan Hale during the dramatic climax of Resistance 2, Joseph Capelli takes over the marquee role despite the limitations of his bland personality. Overused plot devices, such as the mitten of Joes sick child he carries during his journey, fail to endear the player to the new series star, and Capelli never develops interesting or likable traits. More importantly, I never felt he was capable of anything significant on the battlefield. As players, were tasked with trekking across the United States and almost single-handedly taking out a massive alien force while utilizing a character with all the menace of a Walmart greeter.Capelli ultimately needs to get to New York City, where a massive Chimeran tower serves as one of the primary structures of the enemys war effort. The map of the U.S. shows you advancing through Oklahoma, St. Louis, Pennsylvania, and beyond, but none of the areas have a distinct visual quality outside of the occasional landmark like the Gateway Arch. Its disappointing to see such bland environments from the same developer that created the vibrant worlds of Spyro the Dragon, the imaginative and varied planets of Ratchet & Clank, and the initially intriguing locales of Resistance: Fall of Man. Outside of an entertaining boat ride and a surprising turn of events about three-quarters of the way through the game, players spend most of their time traversing underground passages and cookie-cutter towns in various stages of disrepair.As you progress through these areas, the combat situations feel anything but dynamic. Each one is scripted beat-by-beat, with waves of enemies appearing like clockwork whenever you cross an invisible line. The only element that shakes up these sequences is the omission of a regenerating health system. When youre desperately sprinting across the battlefield to collect a health pickup, it adds a sense of urgency to the proceedings knowing you cant just duck behind a rock for five seconds.The predictable level designs do Resistance 3 a disservice, but numerous glitches prove more damaging. I can live with the occasional floating body, but other bugs halt the flow of the game entirely. One area required me to wait for an NPC to open a door before I could proceed, and he simply stood in front of it and stared at the ceiling. I turned around to clear the previous area of enemies to see if that was what was stopping him, and two Chimera walked into the room. They stood directly in front of me, stopped, and stared at the ceiling. I walked around them and tried to get their attention, but they didnt pay me any mind. Once I killed both of them, the NPC snapped into place and proceeded. This wasnt an isolated incident  I couldnt proceed past several areas because one enemy would be caught in the environment or was otherwise out of the field of vision. Once I ascertained where their grunts were coming from, Id chuck a couple grenades in the appropriate direction and the game would continue.Insomniac has a long history of creating unique weaponry, and the entertaining guns at your disposal in Resistance 3 are the games strongest aspect. While most of the selections on the returning weapon wheel are old favorites (Bullseye, Auger, Carbine, etc.), the new additions fit right in. Whether youre freezing enemies with the Cryogun, electrifying them with the Atomizer, or mutating them with the (you guessed it) Mutator, its nice to have variety when it comes to taking the Chimera down.These weapons cross over into the multiplayer space well, but theyre about the only thing that hasnt been lifted wholesale from Call of Duty, Halo, or Battlefield. Whether its the hologram and bubble shield abilities from Reach, the killstreak reward system from Call of Duty, or the Battlefield-esque Chain Reaction mode, everything has a unshakable been there, done that feel. They didnt even bother to rename the identical Bandolier and Scavenger perks from Call of Duty. The multiplayer is unoriginal, but that doesnt mean it cant be fun to play. Considering how bland the campaign is, the average online play is the best part of the overall package.Insomniac approached Resistance 3 with no lack of ambition, expanding to a three-year development cycle in an effort to make this its biggest title yet. The team succeeds in some ways, as the various hand-written notes and journals youll find on your trek to New York City help to flesh out the story. However, more effort seems to have been put into minutia than the gameplay itself. With no reason to connect with these characters and little in the way of action to separate itself from the packed FPS crowd, Resistance 3 makes it clear that the series doesnt belong amongst the triple-A competition in the genre.", "date": "Sep 06, 2011", "grade": "7"}