{"name": "Dungeons of Dredmor", "ref": "https://www.gameinformer.com/games/dungeons_of_dredmor/b/pc/archive/2011/07/20/an-indie-roguelike-for-everyone.aspx", "text": "Judging Dungeons of Dredmor solely on its charm and wit would make it a Game of the Year contender. The rest of the game doesnt clear that high bar, but this indie roguelike hits enough of the right notes to be one of the best five-dollar gaming options for your PC.Dredmor is a classic 2D turn-based dungeon crawl. Starting out with your choice of seven skills and a few crappy pieces of beginner equipment, players attempt to make their way through the dungeons many levels to defeat the big baddie at the end. Your first few hours with the game, however, will mostly be spent laughing out loud at the massive volume of nerd culture references, puns, and jokes that Gaslamp stuffed into Dredmor. Aside from chuckling, playing Dredmor is about bashing monsters, leveling up, exploring the randomly generated dungeon, and working the loot angle. The skill system is simple, giving players a single choice per level-up that can bring any of the seven skills you picked at character creation to the next level. Some boring passive increases pad out the skill paths, but most of the choices grant powerful new abilities or procs that randomly activate during combat with interesting effects. Leveling the same skill set a different way gives a drastically different experience, not to mention trying whole new combinations.Dredmor uses a few dozen tiny icons to represent its many different statistics, from Necromantic Resistance to Caddishness and Block Chance. The sprawling system can be a lot to wrap your brain around, but after a few games it should make enough sense that you can make reasonably informed decisions about equipment and skills. A couple more games in, and you should have a good idea of which stats to prioritize. The lack of second-order effects (i.e. you dont have to worry about stacking percentage modifiers onto flat increases, or how stats boost or interfere with one another  plus-two damage is plus-two damage, and thats as far as it goes) keeps things pleasantly simple and transparent.Inventory plays a big role in combat as well. Potions, wands, food, mushrooms, bombs, acid flasks  anything and everything you find serves a purpose (even if that purpose is to be transmuted by the Horadric Lutefisk Cube and tithed to the Lutefisk God). Managing your consumables is an important skill to learn, but the first lesson is that its better to die with an empty backpack than one full of items that might have saved you.Dredmor has a relatively deep crafting system that comes at the cost of dramatically increasing the already formidable headaches involved in inventory management. Backpack space is such a limiting factor that carrying around a dozen bits and bobs for later combining into equipment or gadgets is a significant investment. On the plus side, if crafting drives you as crazy it does me, you can ignore it entirely by not choosing it at character creation  even if creating healing and mana potions with alchemy is arguably the most powerful skill in the whole game. When youre not busting a gut or digging into the many mechanics surrounding combat, youll likely be busy dying. Like any good roguelike, Dredmor will kill you. A lot. Gaslamp has lessened the sting of death in a few ways, though. Half the fun of the game is experimenting with choosing new skills at character creation. Getting through the first couple levels of the dungeon doesnt take long at all once youve done it a few times; even a long run through the dungeon wont take you more than a few hours. And finally, you can turn permadeath off if you simply arent willing to deal with it (which I am compelled to go on record as strongly opposing, but Im the crazy guy who wont let myself reload saves in Civilization or Total War because having to live with your decisions makes you a better player).The game can occasionally fall into ruts where youre powerful enough to smash through the current selection of enemies with basic attacks, the junk on the floor is barely worth picking up, and youre not doing much of interest other than watching your experience bar slowly creep upwards. Unlike the ever-present doldrums of managing your backpack, you usually wont stay bored with exploration for long  certainly not after the first time you open a door and encounter a monster zoo filled with 50 (or 80, or 100) monsters packed together just waiting for the chance to get at your tender bits.Dungeons of Dredmor isnt Diablo III. Its not even Dungeon Siege III, but it makes no pretensions about it. The game barely takes itself seriously enough to have proper swords, much less tell an epic story or rewrite the rules of a genre. Gaslamp Games mission was to make a fun, accessible, lighthearted dungeon crawl with enough interesting mechanics to make exploring the games systems as intriguing as diving through its dungeon. Dungeons of Dredmor is a solid success in those terms, and easily exceeds expectations for its five-dollar price tag.", "date": "Jul 20, 2011", "grade": "8"}