{"name": "Transformers: Dark of the Moon", "ref": "https://www.gameinformer.com/games/transformers_dark_of_the_moon/b/ps3/archive/2011/06/15/dark-of-the-moon-prequel-game-is-more-than-meets-the-eye.aspx", "text": "Licensed movie games have different expectations attached to them. How well does the game capture the characters and world of the film? Has the gameplay and presentation come together despite what was probably limited time and money? How has the developer shaped an exciting and fun experience, despite what were possibly severe creative limitations set by the licensor? All important questions, but beside the point for the final game review. How does the game stack up against all the other games out there, license or not?Transformers: Dark of the Moon is one of the better movie games of recent years. For fans, it tells a prequel tale to the new film, setting the stage for many of the characters and plot points that will show up. Visuals look quite good, especially the robots themselves and their seamless transformations. Theres a surprising amount of gameplay variety thrown in, mixing stealth, driving, and flight moments with predominant run-and-gun shooting sequences. I found myself looking forward to each next big character reveal, especially the main playable characters of each chapter, as well as the boss characters at the end. I wont ruin things for anyone, but suffice it to say that old school Transformers fans will find some fun surprises. Each of the protagonist characters has their own unique abilities, and High Moon has gone to great lengths to have each one feel like a new experience. Finally, the strangely named stealth force transformation modes (theres nothing stealthy about them) get around the big problem of having vehicles that can only move forward and back. The mode's vehicle/robot hybrid form (and its different weapons and abilities) goes a long way to making transforming a meaningful choice in the game. Dark of the Moon also packs a competent multiplayer shooter into the package, complete with upgradeable character classes and a number of well designed maps  even if the limited game modes are all too familiar. Sadly, being great compared to some recent abysmal licensed projects does not necessarily make it excellent compared to everything else. Character movement is sluggish, even for a game about giant robots. Aiming and hit detection feel iffy, partially due to a number of weapons with seemingly arbitrary hit zones. Any given level is made up of the same tiles again and again, contributing to a sense that everything looks somewhat the same. If youre excited about the movie or characters, for once this is an easy game to recommend. Theres nothing here that should scare away fans, and any player ought to appreciate the way each game level feels unique from the last. After this game and last years War For Cybertron, High Moon has proven theyve got the chops to handle and understand the Transformers, no matter what continuity theyre playing around in. Heres hoping that Hasbro and Activitision recognizes the talent, and continues to give the team the creative freedom they deserve.", "date": "Jun 15, 2011", "grade": "7.5"}