{"name": "Magic: The Gathering - Duels of the Planeswalkers 2012", "ref": "https://www.gameinformer.com/games/magic_the_gathering_-_duels_of_the_planeswalkers_2012/b/xbox360/archive/2011/06/15/an-excellent-but-limited-adaptation-of-the-tabletop-classic.aspx", "text": "If I had all the money in the world, I'd be entirely happy spending the rest of my days buying cards, building decks, and exploring the dozens of variant rulesets of Magic: The Gathering. Here in real life, a Magic habit is harder on the pocketbook than the most expensive MMO. A well-made $10 product like this, which scratches the Magic itch without getting into the collectible aspects of the game, is great for a guy like me  even if it's about a month's worth of entertainment at max before you've seen all you need to see of its limited card pool.Duels of the Planeswalkers 2012 is a standalone follow-up to the 2009 original, which gave players a handful of decks for genuine Magic duels. It builds on that much-expanded game by cleaning up the already excellent interface, shuffling the deck loadouts, increasing deck customization options, and adding in a cooperative 3v1 mode. For the most part, this is great stuff.Fans of the first game will be ecstatic to know that you can now remove any card from a deck to make room for a newly unlocked card. You're no longer stuck with garbage life-gain artifacts  rejoice! The tool that allows you to quickly see your deck's mana curve is fantastic as well. The overall model is the same, with 60-card decks and a small sideboard tied to each that unlocks as you win matches with that deck, but these little tweaks are much appreciated.Two campaigns (to use the term loosely) put you up against each of the decks in order. The second one, naturally, has you face off against AI using fully unlocked decks  meaning that you'll be losing some matches against the sillier rares in the limited card universe. As in the first game, the highest AI setting is a solid (though uncreative and often predictable) opponent while lower difficulties introduce profoundly stupid mistakes into the computer's strategy.Balance is handled well for the most part, but a few matchups skew heavily toward one deck. The gimmicky green/blue deck that relies on combos to drop improbably large creatures early in the game makes for poor gameplay (as do most gadget decks), since you either end up with an unstoppable beast on the fourth turn or a hand full of non-threatening lands and mana acceleration. Apart from those edge cases, matches are enjoyably tense contests more often than not.Gameplay is identical to the first game, with short countdowns giving each player chances to pause the action to cast spells and activate abilities at appropriate times. Most of the timing tricks advanced players like to use in the tabletop game are possible here. I salute developer Stainless Games for making a digital adaptation of Magic that moves along at a pleasantly brisk place without steamrolling over strategic opportunities.Archenemy mode should be the headliner by all rights. One player, the titular archenemy, gets 40 life and a draw from the Scheme deck each turn to make up for the three-on-one odds. This simple setup avoids needless complexity, but the wild variance of the Scheme draws makes every round a crapshoot. The difference between having no useful Scheme effects by the second turn and having two free 5/5 dragons on the board is just too much. Far too many Scheme draws are either nearly unbeatable or cakewalks to defeat. The highly random nature of Magic draws on top of it means that your strategy accounts for a tiny fraction of the match's outcome.You can't even play Archenemy mode as the nemesis. You can only play as part of the three-player team. I can't think of a design decision in recent memory more baffling than this one.Archenemy mode flopping on its face and a few minor balance issues aren't enough to keep me from appreciating Duels of the Planeswalkers 2012. This is a fantastic way to play Magic without eating your entire bank account in the process. Lapsed players like me will have a grand time messing around with some of the newer cards and mechanics, particularly in online play against other humans. If there were more decks and cards, and/or an online league structure to compete in, this could have been a true gem. As it is, it's fun as a solid, but limited, digital adaptation of one of the definitive tabletop games of our generation.", "date": "Jun 15, 2011", "grade": "8"}