{"name": "Duke Nukem Forever", "ref": "https://www.gameinformer.com/games/duke_nukem_forever/b/xbox360/archive/2011/06/14/12-years-in-the-making.aspx", "text": "In Duke Nukem Forevers introductory sequence, I drained my weasel, grabbed poop out of a toilet and threw it into the face of an EDF soldier, drew a giant p***s on a dry erase board, and engaged in sexual relations with twins. These actions are juvenile and unnecessary but, in the eyes of someone who loves South Park and is easily amused by crude humor, exactly what I was hoping to get from a new Duke Nukem game.With development stretching back over 12 years to a time when PC gamers were first introduced to Half-Life and Unreal and console players were realizing that first-person shooters had a bright future on their favorite machines, Duke Nukem Forever doesnt look dated. Sure, the texture work on Dukes middle finger could look sharper, and the strippers' robotic animations make me wonder if these women have ever danced before, but the game occasionally spits out a lumbering boss worth marveling over or an environmental explosion that dazzles the eyes with large-scale physics-based carnage. The games design also appears to be based exclusively off of modern FPS blueprints. Duke has regenerating health (yet at one point he mocks Master Chief), and surprise surprise, he can only wield two weapons at a time (just like Chief). Moreover, many enemy encounters are scripted events, timely checkpoints are scattered liberally throughout stages, and gameplay variety is offered through vehicle and rail gun sequences.The most dated part of this experience is Duke himself. He still looks exactly like Dolph Lundgren, and although he makes it apparent that he follows todays celebrity news and has seen Team America, his dialogue mostly harks back to classic 80s and 90s films like Robocop and Army of Darkness. Hes equally amused by pop culture references and his private parts, which I learned far too much about in this game.Dukes selection of weapons mostly consists of his bag of tricks from the mid 90s. He can freeze or shrink enemies and crush them with his boot (which is worth a chuckle every time). When he gets into a bind he can eat steroids (complete with crazed Jose Canseco vision) or summon a holographic version of himself to confuse his dim-witted pig cop foes. Most of his other weapons fall into the standard FPS mold (shotguns, rocket launchers, machine guns, etc.). The gunplay feels decent, and the weapons are tailored nicely to most enemy encounters, creating unique, balanced fights that are occasionally transformed into laughably bad circus acts due to AI pathing issues and unintelligent tactics. Duke starts with a bang (Ill never forget my time with the toilets), but quickly ditches its immature antics and descends into a tailspin of questionable puzzle design, uninspired vehicle sections, and mundane level architecture. The three to four hours following the introductory sequence are a rough ride. The games unbearable load times (roughly 30 seconds to a minute every time you die or load a new area) seem so much longer during this stretch.The game picks up again at the The Mighty Foot level, a sprawling wild west setting that Duke navigates in a monster truck. From this stage on, it stays largely entertaining  not solely because of Dukes sophomoric attitude, but respectable level designs that offer variety and a few killer set piece moments. I could have done without the swimming, and some of the puzzles along the way seemed to be inserted just to slow me down. Duke even goes as far to say, I hate valve puzzles during a minute-long valve-turning sequence. Always trust the words of your game character, developers.If youve been following Dukes development all these years, the campaign is worth a look. I found it to be an interesting game to analyze and dissect, questioning what may have been created 12 years ago by 3D Realms and what was created today by Gearbox Software and Triptych Studios. Nothing about it is truly remarkable or to the scale of other genre heavyweights, but it is a fun run when it fires on all cylinders.Dukes multiplayer didnt get much buzz leading up to release, but it isnt a small, tacked on we have multiplayer offering. Experience points earned in battle are tied to a deep leveling system that rewards the player with new cosmetic gear, as well as items that can be displayed in a posh apartment. At level 30, a bronze babe is added. At level 12, pixelated paintings line the walls. At level 42, a working air hockey table can be played. Although a handy Game Finder option is available (complete with ping rates), the long load times found in single player are just as bad when trying to join matches or enter the apartment.With tiny maps, every match offers fast-paced action, even if you are in an objective-based bout (like babe stealing). I got a big kick out of using the shrink ray on other players, but the hit detection for any firearm is incredibly hard to read. I found myself spraying bullets in a panic just to hit a foe. As much as Id like to see Dukes apartment fully furnished, the questionable gunplay is a deal breaker for me. I wont be spending any more time with it.And with that said, I probably wont spend any more time with the game period. Im glad Gearbox stepped up and finished this game, but after hearing about it for 12 years, I have no desire to relive any of it again. Im now satisfied in my knowledge of what Duke Nukem Forever is and ready to never talk about it again. Welcome back, Duke. I hope your next game (which is teased after the credits) goes off without a hitch.", "date": "Jun 14, 2011", "grade": "6.75"}