{"name": "Dead or Alive Dimensions", "ref": "https://www.gameinformer.com/games/dead_or_alive_dimensions/b/3ds/archive/2011/06/04/an-entirely-competent-portable-fighter.aspx", "text": "It speaks highly of the state of portable gaming that we expect more than mere competent translations of home console games. Dead or Alive Dimensions executes its core one-on-one 3D fighting mission admirably. Without a decent online mode or much in the way of single-player content, though, youre left with local wireless matches as the only truly worthwhile way to play the game. So, how many DOA fans with 3DSes do you know?The fighting itself is as DOA as DOA gets. The combos are long and beautifully animated, reversals are ubiquitous and powerful, and the third dimension is barely a factor. I will always prefer Tekkens or Soulcaliburs take on 3D fighting over DOA as a matter of personal taste, but this is a solid adaptation of this franchises style. The 3DS isnt an ideal controller for a fighting game -- even from the perspective of a player who prefers gamepads to joysticks -- but I always felt like I earned my defeats through poor play rather than a bad interface.I would need to spend some quality time with a thesaurus to properly express my contempt for the execrable story mode with its leaden dialogue and pointless plotlines. In the grand scheme of fighting games, though, thats hardly a deal-breaker. The arcade and survival modes are decent enough, but making players slog through the easiest difficulties to get to a reasonable challenge level is lame. DOA Dimensions saving grace is the highly configurable training mode, where you can tweak the bots behaviors to effectively practice a variety of skills.Online is where Namco really dropped the ball. Theres no analog to the lobbies that many modern fighters offer, no way to observe matches, no tournaments, no leagues. All that you can do online is fight in often-laggy standalone matches that contribute to a single persistent ranking. If the game were more popular, latency might be less of an issue. In my time with the game, though, I usually had to resort to worldwide matchmaking -- and its no surprise that playing against Japanese gamers had an unacceptable amount of network lag.Secondary fluff like collecting the dozens of extra costumes and hundreds of figurines for use in the (sigh) 3D camera mode doesnt do much for me. Unlockables alone arent enough to keep me playing if the game modes arent a draw in and of themselves.As competent as DOA Dimensions is, I have a hard time recommending it to anyone outside of DOA superfans. The fighting works quite well, true -- but theres that other fighting game on 3DS that trumps this one in every way except for overly jubbly boob physics. This is a gorgeous game (discounting the adolescent titillation factor) with decent-to-good gameplay. Luckily for us all, thats not enough to drum up widespread excitement any more.", "date": "Jun 04, 2011", "grade": "7"}