{"name": "L.A. Noire", "ref": "https://www.gameinformer.com/games/la_noire/b/xbox360/archive/2011/05/16/review.aspx", "text": "L.A. Noire is ambitious. It throws the player headlong into a complex, emotional detective saga set in 1947 Los Angeles. Team Bondi doesnt conceal the games literary and film influences; allusions to classic noir abound, and the game succeeds in capturing the dark, morally ambiguous atmosphere that is the hallmark of the genre. Its a game unlike anything else Ive played, one that uses Rockstars familiar open-world template as a jumping off point to deliver a deliberately paced adventure game that stresses conversation over gunplay.Much has been made of Team Bondis groundbreaking facial motion capture technology, which allowed the developers to effectively film real actors as 3D models and put their expression and dialogue straight into the game. The results of this experiment are striking; never before have digital characters conveyed so much real emotion in a video game. In comparison to L.A. Noire, the characters in Heavy Rain and the Mass Effect series appear wooden. In addition, the casting of real-life actors like Aaron Staton (Ken Cosgrove from Mad Men) and John Noble (Walter Bishop from Fringe) pays off; this game hasnt conquered the uncanny valley, but at times I began to accept these characters as real, breathing human beings.As in any good film noir, appearances can be deceiving. Players take the role of detective Cole Phelps, a decorated war hero and new LAPD detective who must navigate the tense underworld of Los Angeles, negotiating the often-blurry line between cop and criminal. Cole Phelps is an honest man, but hes often impetuous, selfish, and haunted by the events he experienced in WWII. While feted as a war hero, the truth of what happened to him in the war is tragic and complicated, and the echoes of those deeds reverberate throughout L.A. Noire. Investigating a series of murders that tie into the real-life Black Dahlia killings, Cole begins to understand that the appearance of justice is all thats desired by his superiors. While working vice, he also learns that the difference between gangster and police officer is sometimes little more than a uniform. Eventually, the web of deceit and corruption widens, implicating those at the highest levels of society and government. I dont want to spoil any revelations, but the events of the last third come to an explosive head, culminating in a sad, conflicted final scene that will stick with you long after the credits roll.As masterful as the storytelling is, games are meant to be played. In this regard, Im conflicted. Phelps career is divided into a series of cases that spread across the beat patrol, traffic, homicide, vice, and arson desks (the fact that arson is the last is not a misprint; it ties closely to some surprising story events). The formula for most cases is uniform: You and your partner roll up to the crime scene, gather clues, and interview witnesses and people of interest. Its best to gather as much physical evidence as possible, as each clue you log in your notebook opens up new lines of inquiry. At first, I relished the investigations. Anything in the environment could give you a big break in the case, from a ring to a prop shrunken head in a Hollywood production studio. However, over the course of the games 20 hours the repetitive search mechanic wears thin. Walking around waiting for a controller rumble to alert you to an item of interest feels more like an Easter egg hunt than an actual investigation. In a nod to old-school adventure games, many items you are prompted to pick up are meaningless as well; Im pretty sure I examined every hairbrush in the greater L.A. area. The cases occasionally challenge your deductive skills, but its mostly just a case of walking around until you find all the relevant items.L.A. Noire could have used more action sequences to break up the monotonous investigating, but aside from a couple of frantic moments toward the end of the Black Dahlia plotline, most of the action vignettes are simple foot or car chases. That would be fine if they werent so predictable and repetitive. Honestly, if one more suspect bolted right as I was about to start my questioning, I was going to shoot him or her. The few shootouts the game does have play out well enough, but suffer from occasional problems coming in and out of cover.The interrogations, which showcase the amazing facial animations, are the most compelling aspect of L.A. Noire. As you read your suspects face for signs of subterfuge you can react by either believing their statement, expressing doubt, or accusing them of lying. If you throw out an accusation, be prepared to back it up with some hard evidence. If you dont have something convincing or incriminating youll likely cause them to shut down entirely, which prevents you from extracting further information. Thanks to the animations and superb acting, these scenes are fraught with tension, especially when youre juggling two suspects at once, each accusing the other. In these moments, L.A. Noire shines, providing a real sense of human drama. However, unlike in Heavy Rain or the Mass Effect series, the outcome of the case has no bearing on the larger plot. Sure, you might miss out on some dialogue or facts, but you still proceed from point A to point B. In a game that supposedly tests your decision-making, your determinations ultimately play no role in the story outcome.The open city itself is drop-dead gorgeous  L.A. never looked so beautiful. Rockstars attention to detail is evident everywhere; even shop windows are filled with fully rendered product displays. However, theres not much to do other than some unremarkable street crime side missions. So much effort went into recreating this historical Los Angeles, and I wish the city felt as alive and interactive as GTA IVs Liberty City. Mostly, it just serves as scenery as you drive to the next cutscene.At times, L.A. Noire is one of the most vivid, gripping game experiences Ive had. Other times, it can be plain boring. As in much noir fiction, the truth lies in the gray area between those two extremes. Its an adventure I wont soon forget, filled with characters as fascinating as they are flawed  a bit like the game itself.", "date": "on May 16, 2011", "grade": "8.75"}