{"name": "Brink", "ref": "https://www.gameinformer.com/games/brink/b/xbox360/archive/2011/05/12/brink-review-a-multiplayer-shooter-suffering-an-identity-crisis.aspx", "text": "When Splash Damage first announced Brink, the veteran first-person shooter developer promised a game that would seamlessly blend the single-player, co-op, and multiplayer experiences. Little did we know that this meant your garden variety multiplayer game, now with bot matches. Despite its claims to the contrary, Brink is not a proper single-player game. Dont be fooled by the paper-thin plot that pits the powers-that-be against a rebellious gang on a near-future floating city  this campaign is comprised of multiplayer maps populated with brainless bots. These dolts often run around without purpose, wait to shoot back at oncoming enemies, neglect objectives, and fail to coordinate attacks.Splash Damage makes it nearly impossible to leave the single-player behind when you jump online. Youre still inundated with the overly dramatic voiceovers and cutscenes during each match, and most of the versus modes mix bots with players. Only when you drill into the Freeplay match settings do you unearth the two poorly labeled game varieties that allow you to leave the bots behind (Old Skool and Competition, for those keeping score).Once you ditch the AI and hop online with friends, Brink starts to feel like a proper multiplayer shooter. Like Battlefield, players choose from one of four classes at the beginning of each match  soldier, engineer, medic, and operative  each of which earns experience points for performing specialized actions in a way that naturally forces players to work together. As you rack up experience, you unlock new skins for your avatar and perk-like abilities.Players can switch classes mid-match at a command post to reconfigure the tactics for the objective at hand. This comes in handy when youre transitioning from an assault objective, where you may need several operatives to hack a safe quickly, to an escort mission, where a multitude of medics gives you the best chance of getting the VIP out alive without getting caught in a choke point.Splash Damage is best known for its work on the Enemy Territory series, where the studio built maps that require players to think and act strategically to find success. This philosophy carries over into Brink; these arent wide-open Battlefield zones or cramped Call of Duty maps. Most of Brinks environments mix linear corridors with arena zones where an objective is located and bullets are exchanged. Your objectives are standard fare  plant explosives, escort a VIP, hack doors, repair mission critical machinery, or defend an area. Secondary missions populate the maps as well; some grant team bonuses like supply and health boosts, while others allow you to create a shortcut to the main objective. As you gain familiarity with the maps, you begin to appreciate how many tactical approaches are available for completing your mission. Finding the best places to ambush your enemies with turrets, slow their progress with landmines, or flank the objective and then executing your plan is what this game is all about. This requires timing and coordination, so Brink is best played with a group of micd up friends.The one element where Brink distinguishes itself from the multiplayer pack is the SMART movement, a contextual navigation button that lets you run and climb effortlessly through the environment. Characters move too slowly for my liking (even with the smaller body type that increases your parkour abilities), but I enjoyed the streamlined freedom of movement. It seems like a subtle change, but when I booted up another shooter I found myself wishing my soldier would automatically vault small obstacles as I held down the sprint button.The gunplay isnt as memorable. Brink features your standard arsenal of weapons, most of which are unlocked along with attachments by completing boring challenges in an otherwise forgettable separate game mode. Weapons within the same class dont distinguish themselves in any meaningful way, and shooting them is hardly satisfying. Every gun suffers from an inordinate amount of recoil, headshots are not one-shot kills, and even grenades and mines dont do mortal damage.Most disappointing of all are the myriad rookie mistakes Splash Damage made in the front end. Brink lacks a pre-game party lobby where you can gather all your friends before looking for a match  a major faux pas on consoles these days. You also cant equip new abilities you just unlocked between matches without dropping out to the main menu. Without dedicated servers, the in-game performance is dependent upon the hosts connection quality, and I frequently experienced an unplayable level of lag.Brink is not a bad game. If Splash Damage can stabilize the performance and fix some glaring omissions (like a pre-game lobby) with a patch, Id gladly spend more time with it. But with only eight multiplayer maps, 20 progression levels, no clan support, and average gunplay, its not a good value proposition. Especially considering many Xbox Live games offer a similar amount of content for a fraction of the price.", "date": "May 12, 2011", "grade": "6.75"}