{"name": "Everything", "ref": "https://www.gameinformer.com/games/everything/b/playstation4/archive/2017/03/23/everything-review.aspx", "text": "Everythings sales pitch is hard to swallow at first: Youre an entity capable of hijacking every single thing in the universe. And when I say thing, the vagueness is intentional. Animals. Houses. Microorganisms. Constellations. Everything is a strange hybrid of Journey and Katamari Damacy; it is purely about the joy and terror of exploration, both material and spiritual, which ends up being Everythings greatest asset and biggest annoyance.You begin in a field as a randomized animal. Within moments of starting the game, I was a cow cartwheeling across the planet, gossiping with trees as they gave me tutorial information, and investigating what the world has to offer. At first glance, its not too impressive. Trees. Horses. A few rocks. When the game starts giving you abilities, however, things start to get truly interesting. Everything has two main mechanics. The first is a shifting feature, where you can jump from one body into another. Literally any nearby object is an option, including the grass on the ground beneath your feet. The other feature is an ascension function that determines what level of the universe youre on. If you start on a planet, for example, you can either descend into an organisms molecular level or ascend all the way into space to gaze at galaxies and stars, taking control of everything in sight. These mechanics are simple, but are used in constantly entertaining and occasionally astounding ways, like when I ascended to the highest level in the game and saw a series of constellations swirling before me in silence. Sometimes I was bored out of my mind because I was rolling across a landscape and couldnt find another object, but those lackluster moments are few and far between. Everything does a solid job of peppering areas with noteworthy objects and making transitioning between spaces an easy and fast affair. Everything is a game where you can make arcade cabinets have dance parties to make offspringhttps://t.co/NvHtP702PL pic.twitter.com/xWZ77dM9z4 Javy Gwaltney (@HurdyIV) March 22, 2017The best way to think about Everything is as a giant toybox. After the tutorial, you have no real direction or objective. Youre set free in this giant universe, with the closest thing to a goal being to control as many things as possible and check them off your list one by one. This might sound dull on paper, but I spent hours jumping from body to body to see all of what Everything has to offer. You can control pretty much any object or animal you can imagine, including cells, zebras, ants, trains, UFOs, radio towers, entire continents, garbage dumps, weeds, and even the sun. Your control over these things is limited, but still entertaining. You can gather them in a herd, surge across a landscape at high speeds, or even reproduce by making two similar objects dance. One of my favorite experiences in Everything was coming across a planet inhabited by giant pizza slices that herded beneath radio towers and taking control of some nearby arcade cabinets to make them dance for several minutes to reproduce an entire army of smaller arcade cabinets. The limited interaction of objects doesnt bother me, because the joy of Everything isnt planted in what you can do. The experience is about seeing what new surprise awaits you around the bend. One moment you are relaxing as an ant beneath a tree, watching horses roam the lands before you, and the next you are a plane zooming across the sky of an alien world as a herd of pandas dances below you. I loved teleporting around and seeing what worlds I could explore. Sometimes Id zap into a normal, thriving city that just happened to have gorillas running wild in the streets. Other times, I would roam around a purple planet decorated with skyscrapers and pagodas as well as alien plant life.The constant sense of wonder and surprise kept Everything from feeling like a shoddy tech demo and convinced me to keep exploring for hours on end. I couldnt stop taking pictures and videos of what I encountered as I played, ever amused by my discoveries. Whatever Everything might lack in conventional gameplay, it balances out with systems that create memorable moments of wackiness and beauty, one after another, that make the occasional bouts of boredom worth dealing with. Everything is a goofy paradise for intrepid explorers. It goes all-in on its atmosphere, hijacking hook, and wealth of interactive objects. The gameplay has little in the way of guidance systems or tangible, material rewards to work toward, and features no story outside of collectible audio recordings from talks given by philosopher Alan Watts about the nature of existence and humanitys place in the universe. I found these audio snippets to be an irksome, clumsy attempt to shoehorn in dull philosophy 101 lectures. I dont need to be told that the universe is an astounding place, because Everything conveys this already without any narrative meddling.Even without an overarching carrot-and-stick reward system, Everythings hijacking mechanic is strong enough to make the entire game a worthwhile venture. I was constantly coming across new objects to inhabit and new places to explore. I spent seven hours exploring various planes of existence, and I even turned on autoplay to watch an A.I. guide my entity through the universe. Despite the finite checklist of things to find, I had a surprising amount of fun seeking them out. Everything is a niche game, stubbornly and proudly so. It embraces exploration as its one and only supporting pillar, refusing to bring in any mechanics, like crafting or gunplay, to get in the way of that thematic focus. At the risk of alienating a larger audience, the systems strive to create an experience unlike any other Ive played. Everything is not always firing on all cylinders, but conveys sheer wonder and ingenuity when it is.", "date": "Mar 23, 2017", "grade": "8.5"}