{"name": "Rabbids Travel in Time 3D", "ref": "https://www.gameinformer.com/games/rabbids_travel_in_time_3d/b/3ds/archive/2011/04/21/the-rabbids-make-an-unremarkable-debut-on-3ds.aspx", "text": "When the Rabbids debuted a few years ago, I don't think many expected the Rayman spin-off to turn into such a prolific franchise. They've starred in five stand-alone games in the last five years, and Travel in Time 3D marks their first 3DS appearance. While it shares the ~Travel in Time~ name with its Wii counterpart, this platformer is wildly different than that game's minigame-centric gameplay. This is a traditional side-scrolling platformer, and its tendency to stick too close to that genre's format has resulted in a mediocre gaming experience.You're tasked with traveling through time for seemingly unknown reasons, collecting rubber ducks and coins while visiting prehistoric times, ancient Egypt, ancient Greece, and the Middle Ages. No matter what era you're presently in, most levels devolve into the same basic platforming gameplay. All of the mechanics work just fine - your Rabbid can sprint, jump, ground pound, and ~thwack~ with no trouble at all. The problem lies in the uninspired level design and lack of difficulty.Most stages are basic assortments of coins, blocks, and the occasional enemy. Your primary foes are other Rabbids for (again) seemingly unknown reasons, but they're rarely seen. In fact, most stages seem like some kind of platforming ghost town. You'll jump through oddly quiet areas without a care in the world outside of the occasional spike or instant-death pit. Health is never an issue because you're constantly given add-ons to your overall capacity. Imagine going through the first dungeon in a Zelda game with a dozen hearts instead of the typical three, and you'll have an idea of what this game's difficulty is like. By the time you reach the final world, you can just run straight through enemies because your health bar is so large and pick-ups are so plentiful.Collecting puzzle pieces and 3D figures should be a nice distraction, but they're certainly not enough incentive to replay these tedious levels. Rabbids Travel in Time 3D offers no real sense of what you're doing, who you're fighting, or why you should care. This wouldn't matter if the platforming was interesting, but its low difficulty and lack of variety make this an entirely forgettable experience.", "date": "Apr 21, 2011", "grade": "5.5"}