{"name": "Samurai Warriors: Chronicles", "ref": "https://www.gameinformer.com/games/samurai_warriors_chronicles/b/3ds/archive/2011/03/29/koei-s-tired-formula-fails-to-bring-history-to-life.aspx", "text": "I think its a happy chance of fate that the 3DS is such a futuristic piece of technology and yet one of its launch games is a work of historical fiction centering on real people locked in a feudal Japanese war. Sadly there is very little to be happy about regarding Chronicles gameplay, which also feels like its from another era.Koeis Warriors series has traditionally cast players into the role of historical generals, but with Chronicles players get to name their own fictional character. This doesnt have a large impact on the narrative, since you still spend a portion of the game playing as historical figures from Japans Warring States period, but some of the choices you make in the game will affect the games branching story. I wish I could say more about the narrative, but Chronicles plot bores me like eighth grade history class. All of the games talk about periods, clans, and family names spelled with more special characters than Marvel vs. Capcom made me drowsy, and no amount of historical 3D maps could recapture my attention. Honestly, there were times when the narrator began describing in-game events and I didnt know which side I was fighting on. Aside from a few Japanese history professors, most people probably wont care about anything other than Chronicles combat. Actually, most people probably wont care about that either. If you understand how to work the Y button on your 3DS then youll have no problem playing this game. As usual, your character is a one-man army who travels across the battle map hacking through enemy soldiers, killing important enemy commanders, and protecting vital NPCs. There isnt a lot of variety there. One welcome new mechanic allows you to switch between up to three additional allies who join you on the battlefield. As you battle through enemy encampments youll acquire an assortment of missions. These tasks dont often diverge from kill this specific enemy commander, but fulfilling these conditions will cause the battle to swing in your favor. I actually dug managing my small troupe through the games tactical map  sending my friends across the battlefield while I dealt with more immediate dangers  but your allies rarely accomplish anything significant without your supervision. More often than not youll need to assume control of your allies and finish the job yourself once they reach their destination. Chronicles biggest problem is its repetitive combat. Youll spend most of your time jamming the same attack combos over and over again until you build up a Musou attack that takes out a large group of enemies. Then do it again. Battles feel less spectacular than Warriors titles on console thanks to the small number of onscreen enemies Chronicles throws at you, and its jarring to see a band of warriors pop into view only a few meters ahead. Enemies themselves spend a lot of time circle strafing your character, before taking a few swings at the wind, and then finally moving in to do real damage. There is always plenty of action happening during a Samurai Warriors game, but it feels very tiring these days. History shouldnt be a sedative.", "date": "Mar 29, 2011", "grade": "5"}