{"name": "NASCAR The Game 2011", "ref": "https://www.gameinformer.com/games/nascar_the_game_2011/b/xbox360/archive/2011/03/29/nascar-review.aspx", "text": "Its hard to be a startup team in NASCAR when you have to go up against the Hendricks and RCRs of the stock car world. Eutechnyx might not face NASCAR video game competition on the console side, but it does face an uphill battle as a fresh face. The developers uneven first outing is filled with good and bad laps, and has to resign itself to some morale victories.The basic driving experience gives casual NASCAR fans an enjoyable ride  dial up the difficulty, play with the car settings, hit different track lines, and go back-and-forth with the likes of Jeff Gordon or Clint Bowyer. Eutechnyx smartly includes some HUD additions that some may dismiss as unrealistic (you can turn them off anyway), but I like them. The radar gives you an idea of whos around you so you dont get your rear quarter panel clipped when youre going into a turn, and an optional replay/rewind system means that your afternoon isnt automatically over if you crash.The more I played the game, however, the more issues I uncovered. NASCAR is filled with little details, and this game doesnt get them all correct. The AI cars dont pit safely (too late), dont know when to strategically take pit stops, the yellow flag doesnt always wave, online doesnt have accelerated tire wear, and the AI (even with a rival system) shows no teeth. These things arent the end of the world, but as a NASCAR fan I easily spotted them. Its not about delivering painful realism (I like the radar, after all); its about finding ways to make the game deeper.The career mode isnt a lot of help either. Although it awards you experience points and unlockable pins, paint schemes, coins, and trophies, it doesnt go anywhere in the traditional, multi-year franchise approach that we expect from a licensed sports property. At least the game includes invitational events, where you can compete in challenges like elimination races, and All-Star like multi-round races where the order of the field is inversed.Sometimes you dont have the car to beat, and you end up point racing for whatever you can get. Eutechnyxs effort here is appreciated, but its not championship material.", "date": "Mar 29, 2011", "grade": "7"}