{"name": "Back to the Future Episode 3: Citizen Brown", "ref": "https://www.gameinformer.com/games/back_to_the_future_episode_3_citizen_brown/b/pc/archive/2011/03/28/back-to-the-future-episode-3-citizen-brown-review.aspx", "text": "Alternate reality is one of the mainstays of science fiction. Its not hard to understand why. In real life it can be exciting, even cathartic, to imagine what might have been if wed acted differently during any given situation. Within mirror realities of established fiction, there is often a playful charm to seeing heroes become villains and vice versa. Episode 3 of Telltales Back to the Future adventure series turns Hill Valley on its head, and shows that one mans vision for utopia can be everyone elses nightmare. After Marty and Doc return from their 1930s adventures, Doc vanishes and Marty discovers that his present timeline has been drastically altered. The citizens of Hill Valley are a brainwashed mass who live under the thumb of an alternate version of Doc Brown. A thousand cameras ominously record the towns events as brainwashed citizens like Biff Tannen go about their lives as model citizens. Martys girlfriend, Jennifer, has even become a repulsive punk rocker whose every line of dialogue pressed against my nerves like a cheese grater. In order to obtain a meeting with this realitys version of Doc Brown, Marty will have to stir up enough trouble within Hill Valley for its overseers to take notice.From a tech standpoint, this series remains largely unchanged, so my previous complaints about the inventory management and awkward environmental navigation still stand. However, in terms of story and humor, the series may be hitting its stride. From jokes made at the DeLoreans expense to the innocent antics of Biff Tannen, this entry in Telltales adventure series is the funniest to date.Thankfully, the games puzzles also seem to be a bit more challenging this time around. It took me a couple minutes to figure out how to escape from a crashed DeLorean at the beginning of the game, and discovering the secret stash of booze Martys mother keeps hidden in town will require some inventive environmental manipulation.While it would be nice to see some side quests or branching environments worth exploring, and a few minor glitches result in some awkward scenes, Telltales Back to the Future remains one of the better film adaptations in video games, and I cant wait to see where this series goes as Telltale begins to build towards a conclusion. If episodes 4 and 5 build on the series as much as this entry has, you wont want to miss it either.If you want to know more about Telltales Back to the Future series, check out my reviews of Episode 1 and 2.", "date": "Mar 28, 2011", "grade": "8.25"}