{"name": "The Sims 3", "ref": "https://www.gameinformer.com/games/the_sims_3/b/3ds/archive/2011/03/25/the-sad-life-of-tony-toenail.aspx", "text": "Im fully aware that hearing someone talk about their Sims exploits is only slightly more interesting than getting a recap of someones dreams or having to endure iPhone slideshows of a cats antics. With that in mind, heres a look at the 3DS version of the Sims 3, as I experienced it with my pal Tony Toenail.I started out by attempting to generate Tonys face using the 3DS built-in camera on my own mug. The result was a flat-faced monstrosity. Fully aware of my own shortcomings, I tested out several other editors faces, with the same results. That could come as a disappointment for people who want to make perfect little clones of themselves in a virtual world, but I got over it pretty quickly. I was able to tweak everything through the Sim creators manual tools, which are simplified from the other versions of the game but still relatively deep. Once I made Tonys eyes a shocking green and put them just far apart enough, it was time to dig into his psyche.There are 16 different traits to pick froma fraction of the 63 available on PCand I picked the winning formula of slob, couch potato, and genius. I envisioned Tony as being the kind of person who loiters around coffee shops and creeps out the staff. After outfitting Tony in a sleeveless shirt, cargo shorts, and sandals, it was time to release him on an unsuspecting world. At first, Tony was pretty excited about his living situation. I picked a moderately priced home for him, and it was already furnished with the basic necessities. Moving around the home took a little getting used to, but after a while I was able to navigate through a combination of the d-pad and circle pad with ease. When zoomed in all the way, the game was a little on the homely side, even without taking Tonys mullet or paunchy physique into consideration. At the middle setting, the game was much easier on the eyes. The 3D effect didnt do much for me, and I ended up turning it off after a few minutes.After a brief tutorial, it was time for Tony to meet the neighbors. In true Sims style, people started milling around in Tonys front lawn. The Sims 3 introduced a new wish system, where youre given a series of short-term goals. If you fulfill one before it expires, you get a boost to your mood. Tony really wanted to make a friend, and I really wanted to make this happen for my tiny, ugly buddy. I introduced Tony to his neighbor Logan, a friendly looking guy in an oversized cowboy hat and John Waters mustache. They immediately disliked one another, and before I knew it Logan was jabbing his finger in Tonys chest. Trying to smooth things over, I used the radial menu to invite Logan into Mr. Toenails house. Logan and Tony then went in the living room, where Logan immediately began complaining about having to use the toilet. Sensing an opportunity, I had Tony fight his new acquaintance. After beating up Tony, Logan left in a huff and Tony made his first enemy.Fortunately, Tony had a backup wish: earn one logic point. I set up a chessboard in the living room, and Tony played by himself until about 3 in the morning. A neighbor watched him through the window, and she was so unimpressed with the sight that she got negative relationship points from the experience.Since that chessboard wasnt free, I decided that that Tony should probably join the workforce. I had him look at the newspaper on the lawn by tapping on it with my stylus, and accepted a lucrative opportunity as a criminal. I left him alone for a while to see what kinds of things hed do on his own. Most of his activities involved looking out windows while thinking about butterflies. Once, he woke up at 2 a.m., made a beeline for the stereo and started dancing to the jammin tunes alone in a dark room. Even I couldnt let him go on like this, so I had him practice speeches in the bathroom. After a few minutes, I had him put his blooming conversation skills to the test with neighbor Zane.Zane, a topless clown in a rainbow wig, was all about talking to Tony. The radial wheel made interactions easy, and before too long Zane and Tony were telling jokes (and having conversations about handcuffs) to one another like old friends. Finally, Tony fulfilled that special wish.To celebrate, Tony went to town. The instanced area featured fancy restaurants, pinball machines, and other interesting things to explore. I immediately was alerted that Logan was in the area, and I had Tony confront him. Logan was running on a treadmill, though he got off of it as Tony approached. After another fight, Logan walked off, leaving Tony 0 for 2. I got another wish alert: have Tony win a fight. Maybe after a few more workouts, Tony.As he walked back home, slightly worse for the wear, my adventures with Tony Toenail came to an end. He may have been a horrible, asocial goof, but he certainly provided me with hours of entertainment. Immediately after retiring Tony, I started up an entirely new character. Well see how she fares.Even though the customization has been streamlined and households are restricted to two people, theres still plenty to see and do in the Sims 3. If you havent spent time playing the PC or console versions of the game, youll find a lot of gameplay in the 3DS port. If youve already invested a portion of your life to the game on other platforms, its probably not as essential because you've already done all it has to offer and more. Still, it's a great way to experience the fun of a Hoarders-style train wreck while you're on the road.", "date": "Mar 25, 2011", "grade": "7.5"}