{"name": "The Witcher 3: Blood and Wine", "ref": "https://www.gameinformer.com/games/the_witcher_3_blood_and_wine/b/xboxone/archive/2016/05/25/the-witcher-3-wild-hunt-blood-and-wine-review-game-informer.aspx", "text": "~You reallywant a happy ending, don't you?~ This line is said to Geralt as he tries hisbest to solve Blood and Wine's complex murders. As we know in the world of theWitcher, a happy ending rarely happens. This isn't a fairytale, but the desireto see Geralt rise above the worst circumstances and change things for thebetter was still with me the whole way, especially since CD Projekt has billedBlood and Wine as the last tale with Geralt at the center. The good news is CDProjekt crafted a wonderful expansion for his sendoff that captures the series'trademarks: unexpected twists, tough choices, and intense battles. With itsvast new area and involved plot, Blood and Wine feels like a full game; don'texpect a simple side story with a few set of quests scattered about. It feelson par with the quality and creativity of Wild Hunt, and I loved it. Blood andWine takes place in a new and exciting region: Toussaint. It reminds me ofTuscany with its architecture and vineyards. Wine is ever-present. It's almostalways a talking point, you find bottles scattered about, and your headquartersis on a vineyard. While the citizens of Toussaint are proud of their craft,they're not too joyous about a mysterious beast that's been murdering knights.Geralt goes on the case to track down the monster and discovers that, as usual,things are more complicated than they appear.The mainnarrative is full of twists that I won't dare spoil. Let's just say it capturesbetrayal at its finest, and my head was spinning about who to trust and whatimpact my decisions would have in the long run. As in the past, your choicesaffect the world around you. Sometimes they are as grand as a character livingor dying. Others are small, like whether someone appears at your headquartersor gives you a discount.Blood andWine features an abundance of side quests, and they are extremely clever andfun, rarely feeling like filler. One had me tracking down a culprit whocastrated a statue. Another was a commentary on the ridiculous bureaucracy at abank. You also encounter new places of interest as you explore, such asvineyard infestations and knights errant in distress. These don't feel all thatdifferent from previous points of interest, but do allow you some extra thingsto do in the world for experience. I had one that put me on an interesting sidequest where statues came to life. You can romance someone, but it's poorly doneand feels forced. Geralt only spends a few moments with her, and his previousinteractions with her make it seem like he wasn't fond of her. Still, themajority of the expansion is teeming with creativity, from side quests tofairytale-inspired areas to the monster design.Bosses aremore frequent and exciting than in the previous Hearts of Stone expansion. Notmuch has changed with combat, but you do have a new mutation upgrade systemthat gives you new abilities and bonuses in battle. These are extremelypowerful, and I found them worthwhile to spend the time unlocking. Once I gotthe freeze upgrade for my telekinesis power, bosses went down much faster.These abilities require hefty investment, since you need the right materialsand at least three skill points to unlock them. My only big gripe is toward theend of the game it feels like wave after wave of enemies are hitting youwithout much to break up the chaos. Some late bosses have ridiculously overpoweredattacks that can kill you with two consecutive hits, but these flaws are minorcompared the excitement that comes from knocking out these vicious foes.Blood and Wine is an example of an expansionthat takes advantage of providing top-notch new content. The whole expansion isan adrenaline rush, reminding me of the intense pacing of Wild Hunt's finalact. It also has plenty nods to Geralt and his friends that longtime fans aresure to enjoy. You never know when a past character may make an appearance or bementioned. The world has so much depth and excitement; Blood and Wine is agreat way to spend your last days as Geralt. How Do You Access Blood And Wine?Like the previous expansion, Hearts of Stone, Blood and Wine is a standalone story. You can use your Witcher 3: Wild Hunt save, but its recommended youre at least level 30, or you can choose to play with a new game mode that provides you with a Geralt of that level with unallocated skill points. Once you access the expansion through the main menu, a new quest appears with a marker guiding it to the quest board to select it. From there, you are transported to Toussaint.", "date": "May 25, 2016", "grade": "9.25"}