{"name": "PlayStation Move Heroes", "ref": "https://www.gameinformer.com/games/playstation_move_heroes/b/ps3/archive/2011/03/22/even-sony-s-dream-team-can-t-overcome-heroes-lack-of-substance.aspx", "text": "When Sony first announced that it was combining three iconic franchises  Jak and Daxter, Ratchet and Clank, and Sly Cooper  into a single game, fans got understandably excited. Seeing beloved video game heroes interact with one another in a mash-up is inherently entertaining, and extending characters beyond their traditional settings offers boundless creative options for the storytellers. But instead of capitalizing on these classic characters in a story-based mega-adventure, Heroes gives players a collection of repetitive, motion-based gaming events stitched together with the weakest of plots.PlayStation Move Heroes begins with each of the series duos (Sly Cooper has been paired with his hacker turtle friend, Bentley) being teleported off of their home worlds by a dubious-looking alien to play in the Inter-Universal Hero Games. After a little boasting and one-upmanship, the heroes agree to take part in the extraterrestrial competition, mainly out of apathy. Im not in love with any of the three franchises, but even I couldnt resist the charm of seeing these mascots mingling. Unfortunately, there are only a few brief cutscenes like this during the game. Once the gameplay starts, Heroes is strictly a solitary affair.Before each event youll pick a single character to play as, based on whether the mission is designed for a hero or sidekick. In co-op, the second player is reduced to a floating crosshair that provides support via shooting enemies or dropping power-ups. Each character has a unique special ability, which gives him a little individuality, but I was still left wondering what the point of a team-up is if the characters dont work together.Events are broken down into five basic categories: melee- and whip-based fighting, shooting sequences, and disc and bowling challenges. Each event is more robust than your typical motion controller-based minigame, and features a healthy variety of objectives including third-person segments that use the Navigation controller. The shooting stages are the main attraction, with some of the more chaotic shootouts briefly capturing the excitement of a Ratchet and Clank title, minus the creative arsenal. All of the events controlled well save for the occasional camera glitch, but repetition set in after the first 20 challenges or so and even the gunplay became dull. Heroes will only take an afternoon to complete, but from where I was sitting (or standing, as the game requires), thats not a bad thing. Heroes is better than the typical Move cash-in, and every now and then the action is reminiscent of what makes these three franchises popular. However, with more characters than gameplay events, and no interaction between the protagonists outside of a few cutscenes, its hard to imagine a fan that wouldnt feel disappointed by this (non)mash-up.", "date": "Mar 22, 2011", "grade": "6.5"}