{"name": "Slam Bolt Scrappers", "ref": "https://www.gameinformer.com/games/slam_bolt_scrappers/b/ps3/archive/2011/03/18/slam-bolt-scrappers-review-jack-of-all-trades-master-of-none.aspx", "text": "Slam Bolt Scrappers is a very ambitious game. Not in the traditional sense of scope or presentation  the campaign is brief and visuals are highly stylized  but rather in that it attempts to mesh mechanics from completely foreign genres.The goal is simple  eliminate the opponents tower. To do this, the player must engage in a cyclical process of attacking flying foes that yield colored blocks, which must be reoriented and organized to build up ones tower. Each colored block has a unique offensive or defensive ability, and when augmented to create a larger grid, increase in power. All the while the enemy player can attack you or your tower, steal weapons from under your nose, or repair their structure. To be fair, you can do the same.The above is a very simplistic introduction to a surprisingly deep experience. Special power-ups (gifted by knocking out flying ninjas), a variety of block types, environmental hazards, and the occasional boss battle greatly change the nature of play. I can confidently say that Ive never experienced anything quite like it.While Slam Bolts concept is built on a strong foundation, the execution is less structurally sound. Combat is slow and shallow and one of my biggest qualms with the game. Throwing a punch is easy enough, but the more powerful cartwheel and switcheroo attacks feel unresponsive. There is also an issue with magnetism, when your character will be pulled to an enemy player despite trying to skate by. Evasive maneuvers are hard to come by so this can be particularly frustrating when youve secured a sizable stash of blocks and are cornered with low health. Blocking will only do you good for so long. Combat inherently butts heads with tower construction, too, as a particularly aggressive opponent can stunt your progress by causing you to constantly misalign blocks. A transparent block native to the field can be picked up to rearrange your tower, but its difficult to capitalize on the feature while in the fray. And the fray is constant. If you are able to exploit the mechanic, however, transplanting a single stray square needed to upgrade a weapon is an immense and rewarding victory.The single player campaign is somewhat brief, but offers much in the way of replayability with multiple difficulty settings and co-op compatibility. Battle Mode lets you choose levels and set the parameters of play, and is also fun with another player. As far as depth of content is concerned, my only real desire is for more character customization in order to make keeping tabs on your character easier. Palette swaps and a small assortment of hats seem trivial for such an aesthetic experience.With the issues that surface in single-player, I feared that cooperative play would amplify said concerns. Instead of tripping over each other to place blocks, however, I found it significantly easier to decimate a tower jointly instead of alone. The AI adjusts difficulty accordingly, but with one player focusing on building and the other managing the field, the core concept falls into place. Communication is imperative to success, however, which might explain the questionable choice of local-only multiplayer. Adding additional players turns the tides again, making it even more difficult to maintain focus. Slam Bolt Scrappers admirable ambition is also its greatest pitfall. In mashing genre-specific mechanics together, the game sacrifices expertise for breadth, becoming a generalist rather than a specialist. That being said, the freshness of the experience and solid foundation is entertaining and engaging, despite the occasional frustration.", "date": "Mar 18, 2011", "grade": "7"}