{"name": "Okamiden", "ref": "https://www.gameinformer.com/games/okamiden/b/nintendo_ds/archive/2011/03/15/review.aspx", "text": "When Okami came on to the scene, no one had ever seen anything likeit. The gorgeous art style and music, the innovative Celestial Brushtechnique (where players draw on the screen to attack enemies andinteract with the environment), and the sprawling quest all added up togaming nirvana. Okamiden doesn't have that same shock value, but itcreates its own identity within the framework laid by the original. Veteransof the first game will recognize many environments and characters, andcertain time traveling sequences will get fanboys pumped. However,Okami rookies shouldn't hesitate to jump right into this sequel.It's completely accessible, and the entire backstory is explainedright at the beginning.Okamiden begins nine months after theoriginal when the land is cursed once again by demonic forces. GuardianSapling spirit Sakuya once again summons Amaterasu, but gets her son,Chibiterasu instead. Issun (the sidekick from Okami) is too busy withCelestial Envoy duties, so Chibi has to recruit other partnersthroughout the quest to help battle the demons. The first partner is ayoung boy named Kuni, who is the son of Susano and Kushi from Okami.How they conceived, birthed, and raised a child in the span of ninemonths is one of the early mysteries.This partner system allowsChibi to interact with a variety of personalities instead of runningaround solely with Issun. The rotating cast works well as a freshstorytelling device, too. Chibi serves as a wandering helper to assistthe partners with their issues while still making progress on theoverall quest. For example, you help Kuni live up to the legacy of hishero father, and assist child actor Kagu in clearing her family'stheater of demons. I also liked experimenting with their uniqueabilities to see how they'd affect puzzles and combat. The mermaidNanami, for example, can swim in dungeons where Chibi can't and canshoot blasts of water if you draw a line from her to your target.Thesepowers figure heavily into Okamiden's puzzles, most of which utilizea new brush technique called Guidance that allows you to sketch out aroute for your partner to walk, float, or swim. Some routes are morecomplicated than others and require you to defend your partner alongthe way. I never felt completely stumped by a puzzle, but they're notcakewalks, either.Battles take place in small circular arenaswhere you use a mix of melee and Celestial Brush techniques to finishoff enemies. For those unfamiliar with the series, brushwork pauses theaction and changes the screen to a sepia tone. Here you draw slashes onenemies to cut them, sketch a bomb to blow them up, and much more. Thissystem handles better than ever on the DS, finally allowing players todraw onscreen rather than use analog sticks or Wii remote. The mix offoes forces you to use every power in your repertoire to get throughtheir defenses, and it's never been easier to access them all soquickly.The most intriguing battles are reserved forOkamiden's many bosses. Most of the time you have to send yourpartner off to accomplish a task while Chibi's handling the brunt ofthe attacks and mixing in the proper brush techniques. These large,menacing foes all present unique scenarios that are satisfying tofigure out. That said, combat overall is not particularly difficult.The only time I died throughout the entire quest was during a minigame.WhileOkamiden makes several strides forward, it does run into a fewlimitations on the DS. Some of the larger outdoor areas are segmentedinto separate chunks to make them more manageable for the system.It's strange to sit through a brief load after going through a fakedoor outside. The framerate plummets in a couple areas, and Okamidenalso commits the sin of having only one save slot so you can't shareyour cart with anyone or back up progress from earlier in the game.Also, for all of the drawing in this game, why can't I sketch on themaps to keep track of treasure spots?Okamiden takes around 25hours to complete, so it's much shorter than the original. I feltlike the journey was just about the right length, with the only fillercoming at the very end. Plenty of items to collect and sidequests tocomplete (not to mention a new game plus option) will satiate thoselooking for an even longer experience. Most exciting of all? The endhints heavily at more entries in this excellent series.", "date": "Mar 15, 2011", "grade": "8.75"}