{"name": "Total War: Shogun 2", "ref": "https://www.gameinformer.com/games/total_war_shogun_2/b/pc/archive/2011/03/11/a-focused-approach-to-total-warfare-is-a-winner.aspx", "text": "The Creative Assembly has always reached for the stars with Total War, pushing the boundaries of what we thought technically possible to create ambitious grand strategy titles that mix internal politics, diplomacy, intrigue, economic development, and warfare. This ambition has often come at the price of rough edges, from unit AI during real-time battle sequences failing to navigate terrain to imperfect balancing and problematic rival faction AI on the turn-based campaign map. Shogun 2 is a repudiation of this development philosophy. It brings the scale down from Empire: Total Wars globe-spanning theaters to three of feudal Japans islands. Instead of dozens of countries and ethnicities bringing radically different troops to the battlefield, Japanese clans fight with minor variations of sword, bow, and spear. This cuts away the fluff that got in the way of exploring Total Wars gripping strategy.Stripping away the bloat that has crept into Total War over the franchises many iterations has allowed Creative Assembly to explore the design of the core gameplay itself. Dominance over Japan requires building a strong infrastructure, picking your friends and enemies carefully, and ultimately seizing victory on the battlefield itself. Unlike previous Total War titles, each of these elements is elegantly designed as part of the greater whole. For example, choosing what type of buildings to build in each province is a series of decisions that leaves space for developing strategies (Market or archery dojo? Monastery or stables?) without burying the player in trivialities. Every button you press has an immediate, noticeable effect. Upgrading a castle doesnt just add a percentage modifier to unit replenishment; it opens up another slot for economic or military buildings, adds stronger walls and defensive emplacements, and allows faster troop training. Instead of choosing between boring percentile increases here and there, youre unlocking powerful new abilities like double-speed samurai training or tripling town growth.This streamlining extends to all areas of the game. The agents that do your bidding outside the field of battle have been reworked into rock-paper-scissors triangle that has ninjas, monks, and metsuke (secret police) dancing all over Japan in a shadow war. This simple yet engaging mechanic is a massive improvement over the overly complicated agent designs of Empire, Napoleon, and even Medieval II. Similarly, differences on the battlefield are between samurai and ashigaru (armed peasant), cavalry and infantry, or spear and sword. As much as I enjoyed Napoleons artillery duels, battles in Shogun 2 are more satisfying because they leave more room for tactical creativity. Sieges finally work properly, as units do what theyre told and the AI is an enthusiastic third-grader instead of a brain-damaged poodle.The introduction of honor gives diplomacy a new twist. Interacting with major and minor rivals has always been core to Total War, and having to consider your daimyos honor gives everything a new weight. Renege on an alliance when a friendly clan is attacked, and you havent just pissed them off  your honor takes a hit, which impacts everything from future diplomatic relations to your generals loyalty and your peoples attitude toward your rule. Conversely, forgoing immediate advantage in order to gain respect can pay big dividends down the road. I spend as much time mapping networks of alliances and planning my diplomatic moves as I do building infrastructure or moving armies in Shogun 2, which I cant say of any other game.The Creative Assembly put a huge amount of work into an unusual persistent multiplayer framework, where players can join clans and fight one-off battles in a league structure. Frankly, multiplayer Total War battles have never grabbed me because the control is so clunky and unresponsive that managing combat in real time is unbearably frustrating. This continues in Shogun 2. I like the metagame implementation in theory, and persistent rewards are always great, but the lackluster core gameplay keeps me away.I admire how many legacy issues have been addressed, but some remain. Tactical naval combat is still so terrible that I autoresolve every single one. The land-based tactical AI still has a few holes you can exploit (see sidebar). A few parts of the interface, like not being able to see the wider diplomatic situation when a rival comes to you with a proposal, consistently frustrate. I will never understand why the game doesnt follow the standard turn-based model where units prompt you to give orders before hitting the end turn button  Ive wasted dozens of army, navy, and agent moves by not scouring every corner of my empire.Less truly is more when it comes to Total War. Shogun 2, with a smaller scale and tighter focus, boasts the best gameplay and design of any entry in the franchise. I cant imagine a realistic way that The Creative Assembly could have made a better case to win back fans put off by Empire (of which I wasnt one, though I understand the complaints many Total War fans have of that entry). It has made the game more approachable to new players without sacrificing the franchises soul.Technical Difficulties?The Creative Assembly was raked over the Internets hottest coals thanks to the bugs, instability, and many technical difficulties of Empire: Total War. Napoleon shored up that rickety foundation, and was solid even if the AI was still easily exploitable in combat. Shogun 2 is an incremental improvement over Napoleon. The AI for both enemy generals and your units is much better in sieges, to the point that massive battles over multi-level fortresses are interesting and fun instead of an exercise in figuring out how to exploit a broken AI. On the campaign map, I saw rival clans successfully invade over water, blockade trade ports, and reinforce besieged cities. The AI still recruits masses of crappy units instead of more effective mixes of cannon fodder and elite troops, and the combat AI has a few holes still like picking the wrong ground to fight over and running its troops too hard. Having recently played a fair amount of Empire and Napoleon, though, the improvements make a significant difference. That said, I had more crashes than I am comfortable with on several different machines while reviewing Shogun 2. Id advise downloading the demo to make sure the game runs reliably on your system before committing the money.", "date": "Mar 11, 2011", "grade": "9.5"}