{"name": "MLB 11 The Show", "ref": "https://www.gameinformer.com/games/mlb_11_the_show/b/ps3/archive/2011/03/08/the-closest-you-can-come-to-playing-the-sport-without-sustaining-injury.aspx", "text": "My beloved Chicago Cubs are three outs away from forcing a divisional tie with the Cincinnati Reds. Ive turned to Carlos Marmol and his filthy slider to shut down the Dodgers. Only two runs have crossed the plate all game, both coming off of a mistake Jon Garland served up to Aramis Ramirez. The fans at Wrigley Field are losing their minds. The electric atmosphere screams of playoff baseball. My nerves are fried, the controller in my hands slick with sweat. The Cubs season hangs on my ability to place my pitches.The first batter I face is Casey Blake. His better years are behind him, and hes hitting a career low .235 for the season. My first pitch, a knee-high slider, snaps the corner for a strike. For the next pitch, Geovany Soto, the Cubs reliable catcher, slides to the inside of the plate and calls for the heat. I agree with the call, and put a little extra mustard on it. My follow-through is just a hair off, and the ball catches too much plate. Blake jumps on the mistake and slaps a base hit to left field. Marmol is noticeably rattled. He wipes sweat away from his brow, and takes a few extra steps behind the mound to regain his composure.I wont walk you through every pitch in this at bat, but creating baseball moments like this is what MLB 11: The Show is all about. Most of this drama is driven by the games new analog-based gameplay, and the studios ability to make almost every little detail  whether its the AI reacting logically to a good pitch, or an animation depicting convincing player emotions  true to the sport.The new analog pitching is the most polished and challenging gameplay mechanic a baseball game has ever offered. Its all about finesse and finding a rhythm with different pitch types. To place pitches on the corners, you have to angle the analog stick in the direction of the desired location. The gesture must be fluid and gentle, the video game equivalent of threading a needle. Depending on where you are aiming, the slightest error could result in a ball or worse  a pitch that hangs over the plate. The length of your motions is tied to your pitchers delivery; the amount of time allotted is shorter when working from the stretch, making finesse pitching all that much more difficult. I felt stressed when batters would get on base. I even got so out of sync at times that I would get called for balks.This new system not only offers a great challenge, it accurately simulates pitch counts. If just one pitch isnt working for you, expect to walk batters and reach deep counts. Most of my starters threw between 80 and 105 pitches in five to nine innings of work.The new batting mechanic requires similarly exact motions, pulling the right analog stick back to plant the foot, then pushing it forward to swing. Unlike pitching, however, its easy to grasp and master. Even on the higher difficulty settings, I didnt strike out very often. I didnt find the new contact swing modifier useful, as the power swing gave me the same results or better. My contact ratio was absurdly high, but my hits per nine ranged around 12 to 15, resulting in five to six runs. These totals were usually far lower when facing an ace. Strikeouts remained low, but I found myself hitting more ground balls off of elite hurlers. Even after switching to the Shows classic control scheme, I still put wood on the ball consistently, and more than I did in last year's game. I even alternated at bats between this years and last years game, and though my findings changed subtly from game to game and from pitcher to pitcher, more fastballs find the paint in MLB 11.Fielding uses analog controls as well, but it isnt much different than last season outside of the new option to fake throws and lure players into rundowns. Rather, defense is most noticeably improved in the number of ways the fielders react. A distinct difference exists between outfielder and infielder motions, and players show a better awareness of their location on the field. They position themselves to play caroms and turf bounces, and will hit the dirt if they are in the way of one of their teammates throws across the diamond.Road to the Show remains one of the most addictive and satisfying modes in video game sports. This year, a slider system allows you to build the frame for the type of player you want to be. Developing your ballplayer no longer relies on an arbitrary set of in-game goals; you now earn experience points for every at bat or batter faced. The amount of points you tally is determined by your performance for that situation. If you perform great all game long, youre going to be rolling in points, and your players development takes the appropriate leap forward. New training minigames also give nice bumps to specific skills. I still want more interaction with my manager, not to mention a more comprehensive look at how Im doing both within the organization and league-wide.Acting as a couch manager, I simulated five seasons of Franchise mode. Trade logic is much smarter this year, but may be too persistent. In one season, the Braves proposed a trade for my Cubbies stud shortshop Starlin Castro. Their first offer was a player-for-player deal. I turned it down. They came back two days later with a two-player deal. The day after that they came back with a three-man option. In total, they threw together seven different packages for Castro. I rejected them all. Outside of dealing with bully AI, Franchises multi-roster player management is easy to comprehend, and I'm glad to see that players still have to make difficult (and often questionable) decisions with injured players. At one point during a season I was even asked to make the snap decision on travel arrangements for my team. For a trip from New York to Pittsburgh, should my team spend $1,700 to rent a bus or $25,000 to fly? This option only came up once in my five simulated seasons, and I didnt run into any other choices like it. I opted to fly. Stamina and fatigue didnt seem any different than in any other game, so I have no idea what the purpose of this option was other than to show the world that I can burn money with the best of them.As for this years multiplayer options, online leagues are shallow compared to franchise mode, but Sony did include new tools such as a handy schedule creator and a bevy of commissioner options give your league more flexibility. As for the stability of the online component, both during my review and on launch day lag was a major concern. Even if an opposing player is showing a strong connection, some games suffered from crippling slowdown. It got so bad at times that I wouldnt even see the swing animation before it transitioned to showing the ball in play. I found myself politely requesting to end matches far too often. When the game works the way it should, which I found numerous times on launch day, its a blast. Just know that if online is your desired avenue of play, it can be unreliable.For the first time in the series, cooperative play is offered both online and offline for 1 vs. 2, 2 vs. 2, and 2 vs. CPU, but is not incorporated into Franchise or Road to the Show. Regardless, I had a good time criticizing friends poor pitching performances, and praising them when they came through with a clutch hit or pitch.This years Home Run Derby is also an entertaining time sink if you want to enter a quick competition with friends. If you have the opportunity to play Home Run Derby with the Move controller (the only mode supporting this peripheral) do so. Jacking bombs is a little harder with the motion-based swing, as the angle of swing could lead to balls being hit into the dirt or popped up. As if it needs to be said, its fun to make overly exaggerated swings that lead to 400-foot bombs, and take cuts from both sides of the plate. I dont like the idea of players having to fork out extra cash for online content, even if it is only 25 cents a try, but the Weekly Challenges  which offer one-on-one pitcher and batter duels  are quick, amusing, and a great avenue for competing with friends.The Show won Game Informers Sports Game of the Year honors last year, and the product Sony put on the field this season takes a dramatic step forward in many meaningful areas. Even after 50 to 60 games played, I was still seeing new animations on the field, and the commentators were telling different stories about my team. Although I wanted more challenge from the batting, the new analog pitching controls should be experienced by every baseball enthusiast.", "date": "Mar 08, 2011", "grade": "9.25"}