{"name": "Godfall", "ref": "https://www.gameinformer.com/review/godfall/godfall-review-a-soulless-warrior", "text": "Backed by razor-sharp combat, Godfall is at its best when a boss steps into the arena. These foes put up good fights and push you to use everything in your arsenal. The back-and-forth clashes against these titans are intense and lengthy, demanding speed, skill, and strategy. When you eventually deliver a finishing blow, you're rewardedwith a feast of loot raining down in a dazzling showering of next-gen particle effects. The gear you obtain is almost always beneficial, giving you more powerful weapons and currency needed to make your existing equipment better. What comes next, however, is a daunting amount of repetition leading up to the next exciting boss encounter.The meat on Godfalls bones is little more than warriors with swords, but the visual stylization over that basic setup is beautiful and different. Youll never once see a humanoid face; every character is outfitted in garish armors, usually themed after some kind of beast. These suits of steel have a stunning design, and convey the games unique blend of fantasy and science-fiction. The story, while beginning with a flashy cinematic of thousands of troops clashing on the battlefield, is surprisingly intimate, pitting your character, a fallen king named Orin, against his power-hungry brother Macros, who will destroy the world in his pursuit of becoming a god.To reach Macros, you must first take down all of his lieutenants  each coming out of the woodwork after a certain number of story missions are completed. At this point, the narrative quickly loses its pulse and never recovers, being dominated by bland conversations with an A.I. being, and concluding with one of the most anticlimactic cliffhangers Ive seen.The mission designs and small open-world environments are equally as lifeless, serving up tedious steps required to unlock the next boss encounter. The worlds are highly detailed, but there isnt much variety in the plant life or architecture, and it all starts to blend together into the same snapshot. You spend a lot of time snaking down the same paths for different mission objectives, and eventually realize you can skirt every encounter and just beeline it to the objective. After a few missions in the same area, I didnt think twice about hoofing it; I made a habit of getting to the heart of the matter quickly.The one benefit of grinding out fights against the same groups of enemies in these areas is to gain experience that eventually awards skill points. Again, Godfall does a nice job of high-fiving players with statistical and functional bumps that immediately make a difference and make Orin more of a force on the battlefield. The standard enemy varieties perish quickly, but are still fun to take on, especially if you focus on weakening their guard to open them up to flashy finishers. You can also use Soulshatter, which allows you to bank damage that you can use to decimate an adversary, making them explode in an impressive spray of mist. No matter what your approach is, the game pushes you to alternate between two weapons, as damage dealt with one powers up the other. You have five weapon types in total, and all are fun to wield, feeling distinct with different timing windows and benefits.A little variety is also tied to Valorplates, which are complete armor sets that impart slightly different combat capabilities, but not enough to truly change how you play. The Valorplates all look amazing, but have their own loadouts, which can be a bit of pain, as you need to unequip gear if you want to use it on another suit.Each mission consists of three difficulties, with the highest limiting the number of attempts you get. On the lowest difficulty, if you die, you come right back to life and the damage you dealt to the enemy remains (although sometimes the game bugs out and resets it anyway). The higher difficulty is best played cooperatively with two friends, and is also where Godfalls boss battles truly shine. A good deal of fun comes from coordinating strategies and trying to lure a foe your way to set him up for an uncontested assault from a friend.Whether you are pairing two similarly leveled characters or a high-powered with a newcomer, the battles are balanced nicely for all involved, either upping the damage output for the player or making the fight harder. Loot is also individualized. I was impressed by just how well the cooperative play worked, although you cant matchmake if your friends arent around. You need to group up with people you know. The campaign delivers plenty of missions to dive into, a robust co-op-focused endgame, along with an endless Tower of Trials that pumps out excellent loot (again recycling an environment you've already explored).Like most loot-based games, you spend a lot of time in Godfalls menus, equipping new swords and upgrading items to truly make enemies feel your wrath. Just know its a game that lives in the moment of combat and dies whenever attempting anything else, whether its drawing players into the worlds or trying to make them care about the characters and story.If you want a looter-slasher thats all about the stat bumps and the delight of seeing enemies suffer from the enchantments you worked hard to unlock, Godfall delivers plenty of that and is backed by a hell of a combat system. It hits that one note and holds it from start to finish.", "date": "Nov 13, 2020", "grade": "7"}