{"name": "Tactics Ogre: Let Us Cling Together", "ref": "https://www.gameinformer.com/games/tactics_ogre_let_us_cling_together/b/psp/archive/2011/02/08/a-new-vision-for-an-old-masterpiece.aspx", "text": "If every remake were like this, we would hardly need new games. Every element of Tactics Ogre has been pulled apart, examined, and reassembled with an eye toward all the ways game design has changed in the intervening two decades since its original release. Its not perfect  this is still a complex, hardcore game whose charms require more than a little work to fully enjoy. Though it is less accessible than other games in the genre, Tactics Ogre is a surprisingly adult look at war, rebellion, and loyalty with as much rewarding strategy as any title out there.Tactics Ogre follows the conventions of the strategy/RPG genre that it helped define in the 90s. Players are thrown into a massive variety of challenging battles and given a wildly diverse toolbox to cut their way out of their problems. Youll mix and match dozens of classes with a huge number of passive and active skills to create a battle party suited to any crazy strategy you can dream up.As a rebellious orphan thrust onto the global stage by circumstance, players have significant control over how the story plays out. Far from the banal choices that many lesser RPGs tout, these defining moments ask you to choose honor or loyalty, friends or faceless crowds, and even your country or humanity. Most impressive is how these conflicts are presented in a mature, adult context. Rather than beating you over the head with overbearing morality like a Final Fantasy game, Tactics Ogre gives you real options that have tangible benefits and drawbacks, letting you make your own choice.The majority of the changes from the original are for the best. Much of the tedium of grinding out levels has been removed, and while characters can still permanently die, training replacements is much less painful. The dialogue is written as well as any title I can think of, which is no small task given the sheer volume of it in the expansive story. The new Wheel of Fortune systems, which allow you to instantly jump back to an earlier point in battle or to a previous decision point in the story, have little effect on the gameplay itself outside of reducing reloading after screwing something up.The only knock against the game is that character progression and item upgrading  both integral systems that players spend a lot of time in  are needlessly padded with trivial choices. Keeping your rosters equipment up to date is a time-consuming bore, and each piece of armor is stuffed with (no joke) up to 30 stats that only a savant could ever properly assess. Similarly, the tiny incremental bonuses you choose between while leveling are uninteresting.Tactics Ogre isnt as accessible or inviting as Final Fantasy Tactics or Disgaea, but the rewards for putting up with its flaws far outweigh the cost. If nothing else, it deserves recognition for being a shining beacon of maturity in a sea of adolescent power fantasies.", "date": "Feb 08, 2011", "grade": "9"}