{"name": "Pocket Card Jockey", "ref": "https://www.gameinformer.com/games/pocket_card_jockey/b/3ds/archive/2016/05/16/game-informer-pocket-card-jockey-3ds-review.aspx", "text": "Pocket Card Jockey represents a bizarre overlap of genres and mechanics. Its a horse-racing game where success depends on how well you play Solitaire. It comes from the creators of Pokmon, and though it does have you collecting and training animals, it has a number of experimental and distinctive hooks  even if difficulty spikes frustrate throughout the experience.Pocket Card Jockey combines a simplified Freecell-like version of Solitaire and horse racing into a cohesive and addictive sport. You are a jockey who chooses and trains horses and runs races in search of trophies. You build up energy while racing by playing expedited rounds of Freecell where you stack subsequent cards on a single stack, drawing from the deck when youre out of options. You use that energy to position your horse to find the sweet spot during a race, and maintaining a good reserve of energy is critical during the final stretch.You dont necessarily want to be in first place the whole race. A sweet spot moves round the course and you want to stay near it. The closer you get, however, the harder the Solitaire becomes. If you dont take care of all your cards by the end of a round, you gain less energy (or lose energy), and youre more likely to lose control of your horse. It creates an engaging system of risk/reward as you weigh your place in the race against how close you need to be to the sweet spot in order to gain as much energy as possible for the final stretch.All of this explains the main gameplay, but additional layers of number-crunching related to spending money appropriately, recognizing what aspect of the race each horse is good at, retiring aging horses at the right time, and breeding your best horses to create better horses with improved stats keeps things interesting outside the race. It is a surprisingly complicated game, which leads to a level of depth that can be difficult to parse and leads to surprise spikes of steep difficulty.Periodically, the challenge ramps up dramatically, and it is hard to ascertain what youre doing wrong. The prices for items in the store (used as one-off bonuses to help with races) quintuple, horses suddenly lack the energy needed to keep up, and the horse owners get increasingly agitated by your losses. Reading the games manual, looking back at the tutorial, and doing Solitaire training did little to help me figure out what was holding me back other than the fact that my horse just wasnt as good. At these times of distress, a tutorial message, which appears after each race to give you pointers, would give me messages like, Youre doing really well. The other horses are just better, which simply felt unfair.These spikes of difficulty created especially frustrating walls because the core card-playing and racing continued to be fun, but I was gaining nothing from doing it over and over, other than getting new humorous dialogue from annoyed horse owners. Breeding new horses and retiring the problematic ones balanced out the curve and brought me back to a place of enjoyment. It felt as though these surprise moments of extreme challenge were in place to needlessly complicate the game for the sake of additional (but unnecessary) depth.Playing cards in connection to successfully racing a horse is a bizarre overlap I did not expect to enjoy. Pushing through the periodic walls of surprise difficulty dampened my entertainment dramatically, but putting away a quick succession of matching cards in Solitaire and watching it later translate into a burst of speed for my horse is a strange, but engaging thrill.", "date": "May 16, 2016", "grade": "7"}