{"name": "Two Worlds II", "ref": "https://www.gameinformer.com/games/two_worlds_ii/b/xbox360/archive/2011/01/25/review.aspx", "text": "Ever since Jeff Cork and I fell in love with theendearing-but-broken survival horror game Deadly Premonition last year,we've discussed whether there is a place in our industry for B-games --the interactive equivalent of low budget, badly acted (butstrangely enjoyable) B-movies. Two Worlds II presents the latestargument in favor of this new style of game. Like its 2007predecessor, this sequel has significant problems. Though it features anew and improved game engine, slowdown occurs frequently, especiallywhen you or enemies start slinging spells that put the in-game physicsto work. The core story is generic, and the sloppy writing sometimesfails to explain what's going on or why characters are acting acertain way. Unlike the original, though, Two Worlds II is playable,with an improved user experience that shows how Polish developerReality Pump has grown.After a well-paced series of tutorialmissions that set the stage for the story and introduce the numeroussystems at work, players are dropped onto an island that comprises asmall portion of the total game world but has tons of quests. The goalshave plenty of variety, like go here, kill this jobs,pickpocketing missions for the thieves' guild, and exploration queststhat take place in maze-like ancient tombs packed with hidden treasure.Your quest log quickly becomes overcrowded, but current objectives arehighlighted on the map and are easy to navigate to thanks to ateleportation stone.Two Worlds II's various mechanics weavetogether in a complex but enjoyable pattern. If you want to stick tocutting down enemies with giant blades, you can. Gamers looking formore depth can employ the crafting system, which allows you to breakdown and build up almost every weapon or piece of armor you receive.The spell system is even better; as you level up your various skillsand collect spell cards, you can build your own set of insane,overpowered abilities. Reality Pump made the wise choice of lettingplayers break the game's balance for the sake of fun.As Imentioned, the overall story isn't anything new -- the big baddiefrom the first game is now the emperor, and the main character mustjoin a resistance against him to try to rescue his sister -- but thetone of your interactions with NPCs is surprisingly original. Fromsubtle references to the first game's poor quality to over-the-topscenarios such as encountering a woman who wants to feed you to herundead husband, the game's self-aware, tongue-in-cheek attitude isinfectious.The art design also impresses. Although charactermodels look rough, environments, armor, and weapons feature enoughdetail that I took time to look over my character whenever I equippedsomething new. Where the original Two Worlds was mostly based ingeneric medieval fantasy motifs, the Two Worlds II environments drawfrom Middle Eastern, Egyptian, and Asian influences. Even if the storyand the process of cutting down hundreds upon thousands of beasts isthe same old thing, at least you're doing so in a lively Africansavannah instead of boring grasslands and forests.If the hugesingle-player game isn't enough for you, Two Worlds II also containsa handful of co-op and competitive multiplayer modes. The co-opchapters in particular provide a nice distraction, but it'sfrustrating that equipment and levels don't carry over betweensingle-player and multiplayer. The other multiplayer options areforgettable.Like other games that could fit under the B-game label, not everyone will embrace the elements I enjoyed inTwo Worlds II. If you're looking for a lengthy and humorous (ifsomewhat unpolished) hack-and-slash RPG to tide you over while you waitfor Dragon Age II or The Elder Scrolls V: Skyrim, it's worth givingReality Pump a second chance.", "date": "Jan 25, 2011", "grade": "7.75"}