{"name": "Ghost Trick: Phantom Detective", "ref": "https://www.gameinformer.com/games/ghost_trick_phantom_detective/b/nintendo_ds/archive/2011/01/11/ghost-trick-review-life-after-death-isn-t-all-it-s-cracked-up-to-be.aspx", "text": "Because theyre light on traditional gameplay, interactive adventure games need compelling stories, characters, and puzzles in order to work. Getting this formula right is what made the Ace Attorney series successful, and getting it wrong is what makes Ghost Trick a failure. Considering that Ghost Trick is the latest project from Ace Attorney creator Shu Takumi, the games bizarre premise shouldnt come as a surprise. You play as Sissel, a recently deceased spirit who can manipulate inanimate objects and travel four minutes into the past. Combining these two abilities allows you to participate in Rube Goldberg-style setups where Sissel flips, opens, and rotates various objects in order to save people from their imminent deaths.The concept is cool, but I was disappointed to discover that Ghost Trick doesnt have nearly the same charm as the Ace Attorney series. Sissel falls flat as a hero, the story uses convenient amnesia as a constant crutch, and a series of predictable twists deflate the overall mystery. In a game that depends on a strong narrative to keep players engaged, these shortcomings are difficult to forgive.To make matters worse, Ghost Trick also stumbles in its puzzle design. Instead of allowing for the trial-and-error that leads to ah-ha moments of discovery, many situations have rigid solutions that you must execute with precise timing. If you miss your one chance to possess a man riding by on a bicycle, or hit a tennis ball prematurely, youll have to go back to a checkpoint. The checkpoints arent well placed, either; expect to re-watch scenes (though you can skip through dialogue) and repeat actions just to get another shot at the problem areas.Though the game misses some important marks, it isnt a completely lost cause. The character animations are incredibly fluid and impressive, and several of their conversations are good for a chuckle. Unfortunately, these scattered bits of life arent enough to bring Sissels adventure back from the dead.", "date": "Jan 11, 2011", "grade": "6"}