{"name": "Raskulls", "ref": "https://www.gameinformer.com/games/raskulls/b/xbox360/archive/2011/01/06/no-one-wins-in-these-chaotic-races.aspx", "text": "Raskulls may be a groan-inducing name for a video game, but its the least of this XBLA titles problems. As the games light-hearted humor and goofy characters slowly grew on me, it was the surprisingly high difficulty level and unpredictable action that made me want to bang my own skull against a wall while playing it.The main focus of Raskulls in on racing. Players run through labyrinthine 2D levels on foot, attacking rival characters and muddling through simple platforming segments while racing for the finish line. Your character moves painfully slow when you run out of your boost power, and you dont have enough height to your jumps, making all but the smallest gaps impossible to cross. Instead of jumping, your mobility depends on the ability to disintegrate path-blocking bricks with a zap attack. This element gives the game a Mr. Driller-like quality, but the urgency of the races eliminates almost all strategy, leaving you to frantically zap whatever gets in your way. Power-ups allow you to blast quickly through blocks or electrocute your opponents, but these powers only add to the unpredictability. Despite the cartoony style, the single-player campaign is surprisingly difficult, and Halfbrick has done little to curb frustration. The races are an orgy of confusion, and last-second upsets will lead you to retrying the same race again and again. The worst offenders are levels that require you to continually replenish your boost ability by collecting icons scattered about the environment as you race towards the finish. Even the smallest mistake can cause you to fail, and these levels tend to be unapologetically long.The single-player campaign also has a number of puzzle levels, which trade dwindling timers for challenges like breaking a limited number of blocks to complete the stage, or defusing bombs embedded in the landscape. These challenges are still unnecessarily hard, but having time to contemplate your next move makes them less frustrating and more enjoyable. If you want to play Raskulls, multiplayer is your best option. The chaotic nature of the races works in their favor, and those previously annoying upsets at the finish line offer plenty of bragging rights among competitive friends. Unfortunately, basic races are the only game type available in multiplayer, although you have plenty of levels to compete in.I enjoyed Raskulls goofy characters and puzzle missions, and had fun playing the multiplayer against my co-workers. But the single-player races  which make up the majority of the campaign  felt more like a chore than the main course. If you have a lot of patience, you might find Raskulls single-player challenges rewarding. Otherwise, youre better off dabbling in the campaign and focusing on the multiplayer.", "date": "Jan 06, 2011", "grade": "6.5"}