{"name": "LittleBigPlanet 2", "ref": "https://www.gameinformer.com/games/littlebigplanet_2/b/ps3/archive/2011/01/04/littlebigplanet-2-review-the-power-of-creation-in-your-hands.aspx", "text": "I cant stop thinking about LittleBigPlanet 2. Even after putting down the controller, I continue playing with the creation tools in my head. Everyday objects send me off into daydreams about new vehicles, and ideas for bizarre puzzles spring to mind in mid-conversation. With this sequel, Media Molecule gives players a bottomless toybox, and I cant remember the last time a game had such a relentless grip on my imagination. Calling LBP 2 ambitious is an understatement. Like the original, the experience is split into two parts: playing the story mode, and creating your own levels. This time, however, the creation mode towers over the campaign with an array of options to help make your gaming dreams a reality.Youve probably heard that you can make games in multiple genres now, and that isnt just an empty promise. I dabbled in 2D shooters, demolition derbies, and unclassifiable mayhem. The options can be overwhelming at first, but once you get a handle of a few of the new tools, things start clicking into place. Youll definitely want to figure out the Controllinator as soon as possible, since it allows you to control things remotely. Object modifiers are also incredibly useful; some let you tweak specific traits (like anti-gravity or friction), while others set contraptions rotating or moving without the need for complicated pulleys and levers.Even with so much potential in other areas, playing around within the games native platforming framework was the most fun for me. I loved creating fleets of death-dealing vehicles, twisted puzzles, and leaps of faith. Sackbots (NPCs you can program with different behaviors) add more depth to the levels, like when you have to rescue them or outfit them with lasers. Throwing in other styles of gameplay is still fun, but they work best when used to augment platforming rather than replace it.Figuring out how best to use these new toys isnt quick or easy, but it pays off big. Even so, the chasm between basic understanding and fluency is extremely wide. Despite the inclusion of numerous tutorials, more advanced in-game instruction would ease the learning curve. Placing a few cameras isnt the same as orchestrating an entire cutscene, but the tutorials dont help you synthesize the simple pieces into a more complex whole. Im sure plenty of level-building savants will fall right into step, but a little more guidance for the rest of us could result in even an even wider pool of awesome community-created levels.By focusing so much on the creation tools, I dont mean to sell the story mode short. It features brilliantly designed levels, four-player co-op, and the same sense of style that made the original so charming. The pacing is better, with more unique segments (like 2D shooting or top-down racing) breaking up the action. Platforming mechanics have also been refined since last time, but a continued reliance on physics makes for a handful of sloppy segments. Thankfully, the frustrating parts are infrequent, and the space between them is filled with sights that are guaranteed to inspire you when you try your hand at making your own levels.The original LittleBigPlanet was impressive, but LittleBigPlanet 2 cements Media Molecules position as masters of facilitating user-created content. By providing an abundance of tools and inspiration, along with the platform to share your creations, you could play LittleBigPlanet 2 every day and experience something different and amazing every time.", "date": "Jan 04, 2011", "grade": "9.5"}