{"name": "Echochrome II", "ref": "https://www.gameinformer.com/games/echochrome_ii/b/ps3/archive/2011/01/03/a-deep-finicky-puzzler-both-creative-and-frustrating.aspx", "text": "This sequel challenges players to bend their minds around warping perspectives just as its predecessor does. By using the Move controller like a flashlight, you can change the layout of shadows cast on a wall by immovable blocks. These shadows are the landscape your tiny avatar must traverse, and getting him to the goal requires contorting his environment in seemingly impossible ways. It's a clever gimmick, but the fun is too often buried under layers of frustration created by overly complicated levels that demand a precision of control the game lacks.Echochrome II's strength lies in forcing players to think outside of the box. Creating new shadow landscapes by moving a light source is anything but intuitive. Unlike the best puzzlers, however, it never transcends its mechanics. Most levels have a specific, predetermined set of moves as their only solution. I regularly found myself waving my Move around waiting for the next step to present itself to me, rather than thinking creatively to overcome the obstacles. Playing Echochrome II is often more like fumbling in the dark hoping to find the right switch through blind luck than using your mind to create a novel solution to a problem. A few levels avoid these pitfalls and fulfill the mechanic's potential. The tiny gentleman stops moving when you are shifting the light, but he still interacts with the landscape. You can occasionally find cool shortcuts to the goal by applying shadows to him, like pushing him off a ledge with an incoming wall and catching him with a new platform. If Echochrome II had more of these scenarios and fewer prescribed solutions, I'd be much happier. Unfortunately, only a small fraction of the levels allow this kind of creativity.Players who are not bothered by the flaws in Echochrome II's mechanics will get their money's worth. Beating the main sequence of levels takes hours in the regular escort mode. Triple that time or more to clear it in paint mode (where you have to guide your little guy to touch a certain percentage of blocks on the level) and echo mode (where you have to collect several echoes of yourself, much like in the first game). Connect your PS3 to the Internet, and you can spend even more time with the robust creation and sharing tools. Creating interesting levels with this ruleset is a major challenge, but so is using the often-clumsy LittleBigPlanet tools and that community still delivered tons of fascinating content.Echochrome II provides a fantastic amount of entertainment to those who can overlook its shortcomings. It's creative, unusual, and deep. It's also frustrating and often arbitrary. At least it isn't made actively worse by the inclusion of motion controls like so many other games.", "date": "Jan 03, 2011", "grade": "7.25"}