{"name": "A World of Keflings", "ref": "https://www.gameinformer.com/games/a_world_of_keflings/b/xbox360/archive/2010/12/22/world-of-keflings-review-ninja-bee-s-sequel-builds-on-a-solid-foundation.aspx", "text": "A Kingdom for Keflings surprised me when it released in 2008. What I thought was merely a gimmick to showcase Xbox Lives stupid avatars turned out to be a charming simulation that addicted me instantly with a laid back approach to building a bustling city. A World of Keflings, the sequel to Ninja Bees downloadable sensation, keeps everything I loved about the original, but tweaks to the gameplay make it even better. All of the fun of Kingdom for Keflings is still intact. I love the process of ordering my keflings to collect resources, then streamlining and refining production. When things get rolling, A World of Keflings conveys the same joy of constructing a well-oiled machine, augmented by new blueprints and three separate areas to strip-mine and harvest to depletion.Ninja Bee has addressed practically every complaint from the previous title, and the experience flows much better because of it. You no longer need to backtrack constantly to build structures thanks to a cadre of devoted flunkies carrying components right to you (theyll even erect some buildings themselves). If you dont like where a structure ends up, you can just push it to a new location without having to break down and reassemble it.Towering over the other improvements is the presence of local co-op, which was missing the last time around. Now you and your friend (or your kid) can sit on the same couch and go through the entire game together  a process made even easier with the split-screen and drop-in features. The game supports up to four players over Xbox Live, but playing with more people in either multiplayer mode doesnt really change your approach. Its just more fun than plowing through the linear campaign solo.Though optimizing your supply lines and customizing your buildings is satisfying, the process ends up being too shallow to compete with the giants in the city-building genre. Additional layers of village governance, branching development paths, or a free-play sandbox mode would have been great additions and given the simple formula more depth. However, A World of Keflings still succeeds at being a unique and accessible simulation that serves as an excellent first step into a larger world.", "date": "Dec 22, 2010", "grade": "8.25"}