{"name": "Marvel Pinball", "ref": "https://www.gameinformer.com/games/marvel_pinball/b/xbox360/archive/2010/12/10/review.aspx", "text": "Video pinball has never been my thing; I miss the pop of the flippers and the reality of that little silver ball bouncing haphazardly off the bumpers. That changed with Zens efforts to bring the experience back to its roots. While Zen may not be able to transform my game room into an arcade parlor, theyve finally managed to nail what makes pinball so much fun. The development team has made the most of the Marvel license and crafted a number of awesome new pinball tables that should satisfy even the most skeptical pinball fans.Spider-Man, Iron Man, Blade, and Wolverine each have a dedicated pinball table, and every one of the four could absorb a player for endless hours of discovery and score improvement. Each table bows to the style of the character  Spider-Man, my personal favorite of the four, is filled with soaring ramps and amusing voiceovers. Wolverine has the ability to rage and turn nearly every shot on the board into a high score jackpot. Iron Man transforms from Tony Stark into his armored alter ego for the most dangerous missions. Blade features a day/night cycle that completely changes the feel of play. No matter the table, each hero is matched up against three or four of their greatest nemeses, from the Green Goblin to Whiplash. These unique missions are fun to trigger and easy to understand, though it would have been nice if the tables had their own gimmicks rather than all of them being tied to supervillain fights. I also dont always like when onscreen events occur that wouldnt be possible on a real table, like the Goblins exploding pumpkin multi-ball. The game is at its best when the illusion of true pinball is maintained.Without exception, the four tables are excellently designed, and fantastic ball physics make the game worth repeated play. A metagame ties the tables together; your combined score across all tables shows the definitive leaderboard king among your friends. Pack in some highly detailed options for customizing your game experience, from table tilt alterations to camera view, and theres a lot to love. Given this stellar effort, I cant wait to see how Zens pinball collection continues to expand.", "date": "Dec 10, 2010", "grade": "8.5"}