{"name": "Naild", "ref": "https://www.gameinformer.com/games/naild/b/ps3/archive/2010/11/30/a-world-of-dangerous-speed.aspx", "text": "Recent arcade racing titles like Split/Second, Pure, and Blur have tried to make racing about more than just crossing the finish line first. Because of this, Ive admired those games and how they expanded the lexicon of racing titles. Naild is not one of those games. Naild is not trying to redefine the traditional racing experience, but rather fulfill its original promise: If you go really fast and make it to the finish line first, victory is yours. However, that doesnt mean that Naild is any less exciting than those other games. In fact, Naild attempts to capture what is fundamental about the genre in its own way, leaving the player with a powerfully distilled experience.Imagine youre on a speeder bike from Star Wars and youre bombing through Yosemite Park and Greece. You have had 1,000 heart attacks after the number of near-misses youve survived, but youve gotten used to flying by the seat of your pants. Trade out the speeder bike for an ATV, and you get the picture of what Naild is like. Polish developers Techland (Call of Juarez) have captured lightning in a bottle with this games sense of speed, and have smartly positioned other aspects of the game in service to the glory of higher mph.The games tracks do an excellent job of combining set-piece moments, speed-building straightaways, strategically placed gates that give you turbo boost, and enough twists and turns to keep things very interesting. My favorites are the races that consist of one long course rather than a lap format, simply because everything you experience is new from moment to moment. Although Naild doesnt match the over-the-top craziness of Split/Second, there were enough boulder avalanches, hurtling trains, and giant swinging sawblades to keep things deadly and exciting.Courses are also spiced up by the fact that you can steer your bike up, down, left, and right while youre in midair. This doesnt sound like much, but the way that this functionality is merged with the tracks design and the overall sense of speed amplifies the thrills to gravity defying proportions. Many of the jumps in the game require some sort of mid-air adjustment. Choosing where to go is often a leap into the unknown and part of the fun. Sometimes you have to decide pretty early on whether youre going to pull up for more air or dive down to avoid getting smacked in the face with a tree. Other times there are multiple routes around a level to choose from, and the game gives you the luxury of deciding while youre flying several stories up in the air. Nailds claustrophobic, fish eye-like camera complements the onscreen adrenaline rush, and even though it can leave you blind occasionally, there are enough environmental clues to steer you in the right direction  even when youre turning almost 180 degrees in midair.Techlands single-minded focus on delivering a high-speed, thrilling experience comes at the expense of the games overall breadth. The career mode consists mainly of the same come-in-first race type, punctuated by Stunt Challenges. These are basically the same as a normal race, only the winner is determined by who can perform a limited roster of stunts  which are not like ATV vs. MX-style tricks, but are simple feats like landing on other riders or making huge boost jumps. Of course, Naild is not supposed to be a trick-based title like Pure, but I wish it found a way to augment its speed rush with more gameplay options and variety. At least theres day-one DLC featuring a Detonator mode that requires you to perform a boost move in order to get a bomb off your back. Still, Naild is not a game with great depth.Creating a fast racing experience sounds like a fundamental requirement of any racing title, but Naild isnt just a game that blows by low expectations. Its a focused experience that sticks to a tight racing line and captures the essence of speed in a flash.", "date": "Nov 30, 2010", "grade": "8"}