{"name": "DanceMasters", "ref": "https://www.gameinformer.com/games/dancemasters/b/xbox360/archive/2010/11/11/review.aspx", "text": "Konami helped pioneer the dance game craze with a little series called Dance Dance Revolution. Featuring frenetic foot-stomping to musical and visual cues, DDR created a formula that survived the test of time with each new release in both arcades and homes. With DanceMasters, Konami takes familiar mechanics from the popular franchise and ditches the dance pad, producing a clumsy entry in the dance genre that offers nothing more than a mediocre experience.Despite the title, DanceMasters is less about dancing and more about following a flurry of onscreen prompts. Lines, circles, and silhouettes indicate what arm movements and steps you need to take to score maximum points. Unfortunately, there is no hint as to what moves are coming up next. For the ultimate performance, youll have to go through each song multiple times to familiarize yourself with dull choreography (there is no practice mode), and lack of a no fail mode can quickly get you booted off the stage as you get the hang of the mechanics. The choreography remains unchanged at higher difficulties; harder settings just mean more screen prompts, causing me to lose interest after multiple runthroughs of a song. DanceMasters offers a selection of pop, club, para para, and old school tracks that all feel relatively short, with some being borderline cheesy. If youre a fan of DDRs pop-heavy tracks then youll feel right at home with the selection, but its definitely not for everyone. If you do find someone interested in playing with you, you can each select your own difficulty and play simultaneously. However, if your partner delivers a poor performance, youll both fail out of the song. You also have the option of taking your efforts to Xbox Live, but youll be hard pressed to find any competition since no one is playing DanceMasters online.Kinect was developed with movement in mind, so dance games make a perfect fit, but only if done right. DanceMasters makes an attempt at creating a controller-free version of DDR that unfortunately fails to replicate the addictive quality of that series. From one dance fan to another, Id say pass on this one and get Dance Central instead.", "date": "zalez on Nov 11, 2010", "grade": "6"}