{"name": "The Fight: Lights Out", "ref": "https://www.gameinformer.com/games/the_fight_lights_out/b/ps3/archive/2010/11/09/this-fighter-limps-into-the-ring.aspx", "text": "Wii Sports introduced players to motion-based boxing, but YouTube videos of babies and grandpas alike breezing through the bouts proved how much of a joke the concept was. With The Fight: Lights Out, ColdWood Interactive attempts to use the precision of Move to create a gritty, Fight Club-style boxing game that trades pre-canned animations for an avatar that apes your every action. Ultimately, the experience proves that neither extreme is the right approach.The Fight is a more robust offering than most of the Move games weve seen so far, complete with customizable avatars, an extensive upgrade system, multiplayer tournaments, training modes that provide you with as much of a workout as your character, and even a phoned-in video performance from Danny Trejo as your verbally abusive trainer. The Fight sports some impressive head tracking, allowing you to realistically duck and weave incoming blows. Performance-sensitive damage (the harder you swing, the more damage you inflict) provides a novel and exhausting combat experience. The Fights major shortcoming is the need to keep your feet firmly planted in the same spot while playing. If you want to sidestep or advance on your enemy, you have to hold in the Move button and tilt one of the controllers to the side instead. Not only does this make it hard to judge whether you are within striking distance, but keeping your feet planted while throwing punches feels unnatural and robs you of your power. Even if you can keep your feet still, plenty of goof-ups still abound. Youll have to make liberal use of the recalibration button, which instantly realigns your avatar, but even when youre in position and swinging like Muhammad Ali, youll still be at a loss for why some of your punches come out at an awkward angle or miss your opponent by a mile. Watching replays of your fights highlights the problems: No matter how brutally you ravage your opponent, your avatar always looks like a drunken contestant on Bumfights. Keeping in line with seedy atmosphere, you also have a number of dirty moves at your disposal. These special moves require gestures and button combinations to perform, and while some of them feel more natural than others, recognition problems make them a dangerous proposition; if the game doesnt properly detect your movements, youll be left flailing your limbs while your foe punches you in the face. Thankfully, youll still land more punches than you miss, and connecting a haymaker with your opponents face is always entertaining.The Fight has plenty of content to make your way through, but not much variety. After you beat your first opponent, youll know what to expect from the next hundred encounters. Betting on matches can liven things up, and your objectives will change between matches, but neither aspect requires fresh tactics. On the plus side, gaining skill points in the training modes is rewarding, as is seeing how many calories youve burned in the fitness stats.Accomplishing its goal, The Fight delivers a more robust fighting experience than is currently offered by other motion-controlled titles. My aching muscles are a testament to the workout I received, but the recognition problems and repetitive gameplay made it an ugly fight not worth bragging about.", "date": "Nov 09, 2010", "grade": "6.5"}