{"name": "Sonic Colors", "ref": "https://www.gameinformer.com/games/sonic_colors/b/nintendo_ds/archive/2010/11/09/sonic-colors-ds-review.aspx", "text": "Any self-respecting Sonic fan will tell you that Segas premier franchise has spiraled downward over the years. However, an important distinction must be made here: While the console games have been awful, the handheld titles quietly retain impeccable quality. Developer Dimps has been leading the handheld charge with terrific Sonic platformers from GBA to DS, and it continues its run of entertaining titles with Sonic Colors.Sonic Colors captures the most fluid sense of speed Ive ever experienced in a Sonic game. Players blaze through bright and gonzo levels at the push of a button thanks to a holdover from the Sonic Rush series  the boost gauge. The classic spindash still exists, but boosting retains momentum better and makes tearing through double screen loop de loops and zipping across water fast and easy.The boost ability is joined by a plethora of multicolored powerups called wisps, and each adds an interesting new gameplay mechanic without succumbing to Werehog-itis. Sonic frees captured aliens, gaining abilities like a drill, ricochet laser, and rocket. My favorite transforms Sonic into an all-consuming black-hole, which allows him to vacuum up enemies and rings , becoming huge in the process.Boss fights are handled similarly to the Sonic Rush titles, which infuse a 3D element to create more depth in perspective and strategy. These fights shine brightest when Sonic is dismantling a gigantic spacecraft by destroying turrets or challenging Dr. Eggman to a dramatic, multi-stage final battle. Sonic Colors also features the series most addictive and well-balanced special stages. Players steer Sonic with the stylus through halfpipe collect-a-thons, reminiscent of Sonic 2, which make going back for chaos emeralds more of a treat than a chore.While the core game is a riot, the experience ends just as it approaches blissful levels of fun. Sonic Colors can be completed in a few hours, about the same time as one of the Genesis-era titles. Replay incentives such as time trials, item-collecting missions, by-the-numbers multiplayer, and unlocking wisps in earlier stages are nice additions, but become too repetitive.If youre craving more after Sonic 4, looking for a great DS game, or just want to experience an awesome platformer, dont let Sonic Colors pass you by.", "date": "Nov 09, 2010", "grade": "8.5"}