{"name": "Alienation", "ref": "https://www.gameinformer.com/games/alienation/b/playstation4/archive/2016/05/04/game-informer-review-alienation.aspx", "text": "Housemarque has a special talent for taking simple game concepts that lure you in with familiar appearances, only to layer in depth and replayability where you least expect to find them, as they did in spiritual predecessor Dead Nation and the wildly entertaining Resogun. Thats the case once again with Alienation, a twin-stick shooter that seems at first glance like dozens of other similar titles in which frantic enemies charge your location as you mow them down. And while youre doing plenty of alien massacring here, the interplay of class abilities, complex weapon upgrades, and ever-escalating challenge and rewards are what keep you coming back.Earth has been overrun by hostile xenos, and only your mechanized infantry suit stands between the monstrous creatures and annihilation. Alienations story feels like a means to an end, an excuse to carry your heavily armed soldier from one battlefield to the next. Though you may not care about the narrative as it unfolds, your character provides long-term investment. Three distinct classes have their own signature weapons, movement options, and special abilities. The bio-specialists healing, tanks squad shield, and saboteurs stealth each have a place in the fight, and a well-balanced team goes a long way to ensuring survival, even as additional passive and active actions unlock all the time. Abilities are great fun to deploy, but Im disappointed that the recharge system is based on pick-ups, because it puts too much time between those big and satisfying actions.Three weapon slots enable compelling build choices. Do you bring that flamethrower to counter a charging horde, or a launcher for those pesky shielded foes? Want a plasma shotgun for close-range deterrent, or a long-distance/high-damage revolver for precision play? New weapon drops are constantly appearing, and theres good reason to try all the different varieties. A smart stat reroll and upgrade system lets you customize your favorites, dramatically boosting their combat potential, and leading to hard choices about when to abandon an old favorite for that new higher-level option.Combat is blistering and relentless. Trees collapse in splinters, cars explode, and aliens fall to your minigun by the hundreds. The frantic speed of the action and high destructibility of the environment help sell the fantasy, and enemy placement and attack timing is devious, always leaving you on the edge of your seat. Aiming and shooting feels precise, and rewards a skilled hand. Even on the lowest difficulty, the challenge is potent, and you are expected to use every weapon and ability at your disposal.Even so, I was repeatedly frustrated by Alienations insistence on such a harsh ammo economy. Even when playing conservatively, I often ran out of bullets for all my weapons, and was forced to flee. Tight ammunition constraints can force a creative mix of abilities, but not being able to fight back makes me feel like less of a godlike super-soldier, which seems to miss the point. It also means that I hold on to my already rare ability usages longer than I should, just in case I ran out of options with my gun.Alienation is playable solo, but you face a lot of checkpoint restarts without someone there to revive you. Online co-op for up to four players is the better option, and the game features simple systems for joining up with friends, as well as hosting or joining public games that attract new players as levels unfold. If everyone is at the same level, these co-op sessions are a blast, and feel well-balanced as players come in and out of the action. However, the game does a poor job acknowledging that many friends may have soldiers at disparate levels. Drop into a low-level mission, and your high-level hero devastates everything. If you are the lower-level character, youre next to useless, and your presence boosts the difficulty as if you were contributing as a full partner. I wish Alienation had a better solution, as so many other action-RPGs and shooters have found. My frustration with co-op was exacerbated upon completing my initial run at the story. At that point, my New Game Plus mode was unjoinable by any friends who hadnt also finished out all the missions.Nonetheless, lots of goodies await post-story players, including high-difficulty enemies, bounty-like assignments to bring down foes in particular ways for upgrade rewards, legendary weapons, and procedurally generated levels on the alien ships. These new challenges provide lots of replayability. That desire for replayability also fuels the invasion mechanic (which lets players raid other players games), but I didnt find anything to like about that system. I was often inexplicably invaded by players with higher-level characters and guns, and getting gunned down without any chance of survival doesnt feel competitive. I soon turned off the invasion option in any public games I was playing.Play with a well-balanced cooperative team, stay in parity with your levels, and conserve ammo. Do so, and Alienation offers one of the best twin-stick experiences on the market. Add in a deep progression system and lots of ways to enjoy replaying, and its only balance issues that hold me back from the same fervent recommendation I apply to most Housemarque releases.", "date": "May 04, 2016", "grade": "7.75"}