{"name": "Divinity II: Flames of Vengeance", "ref": "https://www.gameinformer.com/games/divinity_ii_flames_of_vengeance/b/pc/archive/2010/11/05/review.aspx", "text": "This expansion pack builds on the successes of Divinity II while mitigating its failures, but the goalposts haven't been moved terribly far on either end. The writing is better than ever, the plot setup is far more interesting than the base game's vanilla fantasy, and the combat is slightly less annoying and unbalanced. Even so, I only recommend this to gamers who have the patience to deal with rough edges in the gameplay itself.I have nothing but love for the sometimes epic, sometimes tongue-in-cheek stories told through the many quests that permeate this post-apocalyptic setting. The send-up of European good ol' boy gentlemen's clubs you come across early on is a perfect example. The rich playboys in charge of controlling access to dark secrets under the ancient city have been duped by a comely witch, who turned them into talking vegetables and made off with their treasures. Their dialogues evoke the stereotype of a pompous Victorian scion, amusingly more concerned about their social standing than the terrible knowledge they were charged to protect or the fact that they're currently immobile and quite edible. Players can follow their questlines through to discover the mystery behind their now-abandoned club, or taunt them about their current predicament and eat them for permanent stat boosts. These kind of choices are everywhere in this adventure, and exploring the rich tapestry of interwoven storylines is as entertaining here as in the best works in the medium.If only the underlying RPG systems and the combat were of a similar quality. The skill progression suffers from the same problem that plagued Diablo II at release, where doing anything but stacking all of your points in three or four skills gimps your character. There is only a bare selection of skills, many of which are cooldown-limited besides. Consumables are hideously boring, granting such inspired effects as +10 Strength or +18 Ranged Armor. Other than hitting these lame buttons, your options are to attack and dodge, neither of which works well since collision between your weapons, the enemies, and the environment is so unpredictable. The customizable necromantic pet is supposed to add flexibility to the combat, but is nothing better than a distraction at the super-high levels in which the Flames of Vengeance adventure takes place.The equipment progression isn't engaging either, since most of the time you're choosing between a grab bag of minor effects. Its hard to care if your shield has a slightly higher bonus against magic than ranged attacks, reflects a tiny percentage of damage, or poisons nearby enemies for an infinitesimal fraction of their health.Despite all these complaints, the gameplay isn't broken; it's just lame. If you don't mind slogging through the boring and regularly frustrating bits, there is a wonderfully realized world to explore.The way Flames of Vengeance is being sold is confusing. It's available for 20 Euro from the developer's website, and requires the original game to play. Alternatively, you can buy a product called Divinity II: The Dragon Knight Saga from other digital retailers, which contains both Flames of Vengeance and the base game. In either case, you can import an existing Divinity II character or create a brand new high-level one to jump right into Flames of Vengeance.", "date": "Nov 05, 2010", "grade": "7.75"}