{"name": "Babysitting Mama", "ref": "https://www.gameinformer.com/games/babysitting_mama/b/wii/archive/2010/11/05/review.aspx", "text": "Cooking Mama did its best to teach us cooking skills, Gardening Mama showed us some gardening techniques, and Crafting Mama had us toiling away at arts and crafts. Despite teaching parenting skills, Babysitting Mama does not go by the name of Mama Mama. It is also a terrible game. Calling it a game seems almost weird, as the only real interactivity youll get comes in the form of slightly moving a doll around, pushing an analog stick in a particular direction, and manic controller waggling (even by the Wiis standards).Its blatantly obvious that Im not the target audience for this game, and Im not expecting Babysitting Mama to be Mass Effect. However, I cant even imagine its intended audience finding much entertainment value out of this half-hearted collection of minigames. Cooking Mama made sense with the hardware - it had you using the DS stylus (and later, Wii remote) to stir the contents of bowls and chop up food. Babysitting Mama is a bit more of a stretch, as taking care of a human being turns out to be more complicated than a video game controller with a limited recognition of movements can handle.Minigames mostly fall into two categories - youre either moving the doll around in basic motions or using the nunchuks analog stick to keep a meter centered. The latter almost feels like youre performing the worlds longest Tony Hawk grind, constantly pushing back and forth to keep the arrow in the right zone. In terms of sheer functionality, these work far better than the alternative.When youre required to move the doll, the game actually recognizes your intended motion about 50 percent of the time. Almost all of them are simple left-to-right or up-and-down motions, and youd have to be a complete idiot to miss any of these. There really isnt much in the way of precise timing or intense memorization required for most of these, so the only way youd fail a motion is due to hardware failure (or the games failure to recognize what youre doing).In case youre a sociopath, the game constantly reminds you that shaking babies is a bad thing. Shift the controller in your lap, get a DONT SHAKE THE BABY warning. Pat its back just a little too hard during the burping minigame, get a DONT SHAKE THE BABY warning. Dont be surprised if this obvious message shows up five times or more per hour you play.Youll be praying for these minigames to end sooner rather than later, so its nice when it throws in the occasional mid-game surprise. Unfortunately, these usually arent any more engaging than whatever you were doing before. In the middle of playing with the baby, you may have to sprint off to make sure your steak doesnt overcook or your tub doesnt overflow. The former simply requires maniacal shaking of the nunchuk, and the latter has you rotating the analog stick like its the first Mario Party all over again. When the most engaging control mechanic in your game is rotating the analog stick, you have a problem.If you perform well during the minigames, your reward is actually more babies. I sure hope this isnt how things work in real life, and I sure hope Majesco doesnt reward gamers with more of this series. Cooking Mama presented a fun gimmick that smartly utilized the DS and Wii hardware, but Babysitting Mama never gets past the gimmick stage.", "date": "Nov 05, 2010", "grade": "3"}