{"name": "The Biggest Loser Ultimate Workout", "ref": "https://www.gameinformer.com/games/the_biggest_loser_ultimate_workout/b/xbox360/archive/2010/11/04/review.aspx", "text": "When The Biggest Loser made its video game debut on the Wii, it offered a suitable workout experience, but was overshadowed by the likes of best-selling titles Wii Fit and EA Sports Active. Now, with impressive utilization of Kinects full-body motion detection capabilities, The Biggest Loser Ultimate Workout takes fitness a step further with customizable workouts and robust health features that make it a worthy competitor.Creating a custom fitness program in Ultimate Workout is easy, requiring a fitness test and use of the games body analyzer that determines the intensity of your program and areas to focus on. The body analyzer is a helpful tool to keep track of your progress over the course of your regimen, since it uses the Kinect camera to perform a surprisingly accurate scan that calculates measurements for neck, waist, and hips. If youre unsatisfied with the program the game generates for you, you can make modifications, but wading through the menus is an exercise in frustration thanks to the questionable controller-free navigation. Thankfully, spotty movement detection only applies to menu screens.Ultimate Workout offers a wide variety of workout styles ranging from interval training to yoga. Even with more elaborate exercises, such as getting down in a plank position and quickly jumping back up into a standing pose, the Kinect camera never lost sight of me. Your silhouette appears alongside the trainer of your choice (either Bob Harper or Jillian Michaels) and looks like its covered in slime for motion fluidity. The silhouette follows you perfectly as you perform moves, making it easy to compare your form with the trainer. On-screen prompts notify you if you need to correct your form, and the trainer provides some verbal feedback as well. Some of the trainer commentary fails to correlate with your actions; if you leave the room for a water break, Bob or Jillian may commend you on your form. The trainer will occasionally ask to see how you are holding up, providing multiple options on screen that you can repeat aloud. If youre feeling tired or need water, just say so during these segments and the workout will pause accordingly.Other features, such as the ability to record video diaries, a calorie counter and intake log, lean recipes, and more make the entire package a worthwhile fitness program. Even though all Kinect titles offer some degree of exercise, The Biggest Loser Ultimate Workout gets you on the right path to a healthy new start.", "date": "zalez on Nov 04, 2010", "grade": "8"}