{"name": "Dance Central", "ref": "https://www.gameinformer.com/games/dance_central/b/xbox360/archive/2010/11/03/review.aspx", "text": "From dance pads to motion controllers, the dance game genre is undeniably evolving. Last year, Ubisofts Just Dance made a surprising splash on the Wii, boasting incredible sales numbers and proving there is still an audience for dance games. These titles have been mediocre at best  until now. With Kinects Dance Central, Harmonix took a risk on a new piece of technology and succeeded in creating the most authentic and entertaining virtual dance experience to date.Dance Central tracks the movements of each individual limb as you mirror the movements of your onscreen avatar. Kick with the wrong leg or miss an arm wave and the avatars respective limbs will turn red to acknowledge the error. Aside from a few tracking mishaps with moves requiring rapid arm motions, the Kinect camera was surprisingly accurate and didnt miss a beat, even in low light. Menu navigation is equally slick; even if this is your first time using Kinect, the controller-free interface feels natural and the clean menus makes it easy to jump right into your first routine.Unlike Harmonixs other music offerings, Dance Central lacks the genre-standard career mode, and instead provides a track list broken up into sections that increase in difficulty with progression. Dont worry about not being able to make it past a set; you cannot fail any song, making the game accessible to players of all skill levels who want to jump right in. Otherwise, training in Dance Centrals intuitive Break It Down mode is an excellent resource to learn and perfect moves if youre shooting for high scores.In Break It Down mode, flash cards that feature move names and images of dancer silhouettes are presented on the right side of the screen. These images simple-yet-clear designs make them easy to decipher at first glance. I was usually able to guess what each move would entail with one look at a flash card without a demonstration. As the moves make multiple appearances across routines, they become easier to recognize and execute during scored performances. Failing a move in this mode allows you to repeat the motion several times and goes as far as letting you slow down the demonstration to nail your technique. Unfortunately, youre required to go through the entirety of a songs breakdown to practice a specific move. I wish I had access to a move bank where I could just focus on moves I was struggling with as opposed to repeatedly going through an entire track I have otherwise mastered. Dance Centrals track list lends itself well to different dance styles offering something for everyone. Bust out breaking moves with Dont Sweat the Technique, add a little Spanish flavor with I Know You Want Me (Calle Ocho), pop lock with Satisfaction, or kick it old-school with Brick House. As you perform tracks, the game takes funny snapshots during your performance, and the screen eventually clears showing you instead of the avatar, prompting you to freestyle. Other friends in the room can join the fun during these sections, which are instantly played back for amusing results. If a friend wants to dance with you, you can take turns completing sections of a song and compete for the high score, but both dancers cant perform simultaneously. With Dance Central, Harmonix has set the bar for the future of dance games. Investing hours in a game that rewards you for some degree of athleticism and coordination is not only an incredible workout, but ultimately makes you feel like a better dancer in the end. Dance Central shines among Kinects otherwise bleak launch lineup and is undoubtedly a step in the right direction for the hardware.", "date": "zalez on Nov 03, 2010", "grade": "8.75"}