{"name": "GoldenEye 007 (2010)", "ref": "https://www.gameinformer.com/games/goldeneye_007/b/wii/archive/2010/11/02/goldeneye-007-review.aspx", "text": "Activisions re-imagining of Rares GoldenEye is an attempt to scrub the tarnished franchise clean, but what were left with is a lackluster game that fails to hit the same high notes of the original, or keep pace with modern shooters.Playing with the Wii remote and nunchuk feels tighter than The Conduits touchy controls, but youll want to go the dual-analog stick route with the Classic Controller Pro. While using a Wii peripheral that emulates the average controller makes sprinting, meleeing, and ironsight aiming easier, nothing saves you from the ridiculous blur effect that happens with every reload. This gimmick makes the fuzzy graphics looks worse and punishes gamers who like to reload often and line up their next shot while doing so.Playing updated versions of the original Dam and Facility levels in the single-player campaign is a fun experience at first, but the game as a whole suffers from generic level design, awful quick-time events, and a terrible final boss fight. Local four-player splitscreen is a blurry mess that cant even be salvaged by good friends and a high definition TV. Fortunately, the worthwhile eight-player online experience delivers the best FPS multiplayer experience available on the Wii. My favorite is Heroes mode, in which one player from each team can transform into a powered-up Bond character, but at the risk of giving the enemy more points if defeated.Remake Or Not?This is an updated re-telling of 1995 bond film, GoldenEye, following the same story while swapping out Pierce Brosnan for Daniel Craig and making other tweaks. Aesthetically, it borrows familiar level layouts and multiplayer modes from the Rare-developed N64 game. It even includes answers to the original games cheat menu, optional objectives, and tank sequence. Activision labels this a re-imagining, but everyone else will call it a remake.GoldenEye 007 doesnt feel like the retro dream its meant to be. This Bond game is lost in limbo somewhere between last generation and modern day shooters. Only diehard Bond or FPS fans with nothing but a Wii should bother picking this one up. Everyone else with fond memories of the N64 title should retrieve the game from their shelf, blow off the dust, smile fondly at it, and find peace in their fuzzy memories upon putting it back where it belongs.", "date": "Nov 02, 2010", "grade": "6.5"}