{"name": "Dead Space: Ignition", "ref": "https://www.gameinformer.com/games/dead_space_ignition/b/xbox360/archive/2010/10/28/the-prequel-everyone-wanted-but-shouldn-t-play.aspx", "text": "If you strip Dead Space: Ignition of its atrocious gameplay, story, graphics, and sound, you end up with a cool idea. Gamers who have the willpower and patience to play through this Ishimura-sized disaster are rewarded with a Hacker Suit for use in next years Dead Space 2. This is the only reason to play it. Heres hoping this reward is worth the frustration tied to getting it. From the first conversation between Franco Delille, a technician stationed on civilian space station The Sprawl, and his assistant/love interest Sarah Anderson, Ignition separates itself from Dead Spaces excellent fiction. The dialogue contains one of the worst thats what she said jokes Ive ever heard  and this is coming from someone who has watched The Office abuse this line to the point of sitcom embarrassment. The plot never rights itself, with the only point of interest coming at the end of the game during a sequence that hints at how Dead Space 2 will begin.The story is told through comic book-like images that occasionally showcase movement. Notice that I said movement and not animation. A necromorph may lunge across the screen in one of the shots, but none of its limbs are animated. It ends up looking like a cardboard cutout being tugged by a string. The sense of movement is also conveyed poorly by making human characters limbs shake, expand, or contract. The end result for most of these attempts makes the characters look like they are made out of marshmallow. I was freaked out more by the humans than the necromorphs.The story unfolds like a choose your own adventure, allowing players to chart their course through the plot. No matter what path you select, youll run headlong into one of three horrible minigame types. The most maddening (and overly difficult) is a puzzle concept called Hardware Crack, which involves mirrors, lasers, and, for whatever reason, a timer. The goal is to connect colored lasers to the same colored circuit. Mirrors are used to bounce the laser across the board. The first few stages of this puzzle concept are fairly entertaining, and easy enough for anyone to blast through. Roughly halfway through the game, the difficulty spikes. Even Steven Hawking would have problems solving these puzzles, and he knows how to crack the space-time continuum!The second minigame, System Override, is a plainly rendered version of tower defense. Rather than stopping hordes of enemies from penetrating a point, you are the attacker. Players can complete every map by simply spamming squads. Just tap the face buttons to place troops on the grid, and victory is inevitable. The final game type, Trace Route, is reminiscent to the light cycle sequences from Tron, where trails of light battle for position. Forcing opponents into a wall can be fun, and weaving dangerously through tight quarters can get the blood pumping, but if you save a boost or two until the final stretch youll win every time. If youre a huge Dead Space fan, you may want to put two hours aside to play through this game to get the Hacker Suit. If your interest lies solely with how Ignition serves as a prelude to Dead Space 2, youre missing nothing interesting. I doubt the thats what she said joke or Franco Delilles story will be referenced extensively when Isaac returns.", "date": "Oct 28, 2010", "grade": "2.5"}