{"name": "Shaun White Skateboarding", "ref": "https://www.gameinformer.com/games/shaun_white_skateboarding/b/ps3/archive/2010/10/26/no-need-to-bail-on-this-skater.aspx", "text": "Skateboarding is all about taking chances. Considering that most people almost break their necks when they just step on a board, you have to appreciate the risks that skaters take doing the most routine actions. Shaun White had every opportunity to fall on its face; whether you compare it to EAs Skate, the lackluster Shaun White Snowboarding franchise, or even the challenge of starting up a world full of player-crafted rails, but Im glad that Ubisoft took a chance on this game.I had fun with Shaun White, and thats because the trick system works pretty well. I was surprised at the variety of tricks it pulls off with controls that are easier than Skates, but still require skill. Its not as combo intensive or inventive as Skate, but Shaun White does deliver a payoff. Transforming the Ministrys drab world with your tricks is one way to do it, but this change in the environment also occurs on another level. Sometimes I was having a hard time getting gold medals for a challenge, but by terra-forming the environment and creating a better skating line, I was able to post a better score. While it may seem cheap that you have to buy new tricks, I was spurred by the need to earn XP and liked reaping the reward.Although you take down the Ministrys gray world, that doesnt mean that the game is full of life. The lack of an open world is conspicuous, but what struck me more is how easily I tired of the games challenges. While not bad, theyre the standard fare of fetch quests and score challenges. I similarly wasnt inspired by much of the non-story based quests. Even though youre able to shape rails and gain access to new places, I dont feel like the game takes enough advantage of the cool world thats been created. The online options are customary, with the Shaping Battle mode the lone standout. Here you do tricks to fill up your Flow Meter, and whoever does that first gets to shape the world however they want for 30 seconds.In skating terms, this games success is more than just dropping in on a vert ramp for the first time without eating it face-first. Shaun White Skateboarding has some tricks in its back pocket, and I look forward to it expanding its arsenal in the future.", "date": "Oct 26, 2010", "grade": "7.75"}