{"name": "Super Meat Boy", "ref": "https://www.gameinformer.com/games/super_meat_boy/b/xbox360/archive/2010/10/21/team-meat-s-addictive-adventure-offers-plenty-of-content-to-chew-on.aspx", "text": "I probably died more times playing Super Meat Boythan the combined deaths of every other video game I've played in my life. Withthe exception of a few introductory areas, Super Meat Boy's 300-plus levelsrefuse to handle the player with kid gloves. By the time you reach the finalworld, you will die countless deaths if your aim isn't pixel perfect, or ifyour timing is off by a millisecond. With most games this would be a recipe fordisaster, but SMB's flawless controls and lighthearted demeanor make this atitle tailor-made for gamers hungry for a challenge. Super Meat Boy is a downloadable title that breathesnew life into a well-worn genre. Thegameplay will be instantly recognizable to platforming fans, and the bonus Warplevels do such a good job of emulating NES and Gameboy visuals that they couldfool veteran gamers into thinking they're playing a decades-old title. Once youscratch through the surface, you will find a number of innovations that makeSuper Meat Boy wholly unique. The controls offer an unexpected level of depth,allowing you to propel yourself through the game's byzantine levels with astunning proficiency that would be impossible for Nintendo's Italian plumber.Even if you master Meat Boy's moves, the game's collectibles unlock a largesupporting cast of playable characters (taken from other indie titles, such asTim from Braid and Commander Video from the Bit.Trip series), each with theirown mechanics and a special ability to perfect.Even with this robust cast at your disposal, make nomistake: Unless you are some kind of gaming savant, Super Meat Boy will becometoo difficult for you at some point. Whether it's some of the devilishly placedcollectibles, the exponentially harder Dark World levels, or the punishingbonus world, Team Meat has designed SMB to break all but the most devotedplayers. Thankfully, SMB minimizes frustration; each level is forgivingly short(rarely does a level take longer than 30 seconds to complete), respawning afterdeath is instantaneous (you restart a level so fast that the exploding carcassfrom your last attempt will still be on the screen), and you have an infinitenumber of lives on the main levels (some Warp levels have a limit, and are muchmore frustrating). The game also sports a novel replay feature, whichdisplays not only your successful playthrough of a level, but also everyattempt and subsequent death simultaneously. This also makes dying a billiontimes on a level easier to swallow, as watching the ensuing Meat Boy slaughteris always entertaining. I'd be lying if I said I didn't have a few meltdownswhile playing Super Meat Boy, but the entertaining storyline, detailing MeatBoy's continual attempts to save Bandage Girl from the evil Dr. Fetus, cut myfrustration short with plenty of left-field chuckles. With a healthy dose ofpatience, most gamers will be able to see the game through to its charming andhilarious ending. Even after you've hit your difficulty threshold,the system for adding free new level packs based on the PC version's leveleditor should offer plenty of extra entertainment. With Super Meat Boy'scornucopia of offerings and irresistible charm, you'd be hard-pressed not toget your money's worth out of this title.", "date": "Oct 21, 2010", "grade": "9"}