{"name": "Saw 2", "ref": "https://www.gameinformer.com/games/saw_2/b/xbox360/archive/2010/10/20/saw-ii-flesh-amp-blood-review.aspx", "text": "A new Saw film has been released every year since 2004. These seven movies have diluted the unique concept of the first film, turning them into gory squirm fests. Last year the first video game in the series was released. Now, like the films, there is a cash-grabbing sequel that eviscerates what few good ideas the first game possessed.The story revolves around Michael, the son of Detective Tapp, the Jigsaw-obsessed ex-cop featured in the first film and game. Michael is a newspaper reporter with some shady business practices, and its time he atones for his sins. Predictably, Jigsaw places him in life-threatening situations to test his will. Throughout his harrowing yet shallow trek through demented traps, he must free fellow victims, all of which are one-dimensional, terribly voice-acted, and inexplicably hostile upon being freed. If you suffered through the first game because you liked the story, dont expect such rewards for your sado-masochism here.Saw II: Flesh & Blood saws off every limb the franchise was limping on. The first noticeably dismembered gameplay mechanic is the combat. While the original Saw games combat wasnt good, it allowed players to set clever shotgun-door traps and trip wires for enemies. Now every combat situation is a terrible quick time event plagued by awful button prompts and horrendous animations. The only other combat situation involves playing matador with lunatics wearing spiked helmets, which results in countless sloppy deaths and snags in the environment.Speaking of the environment, Saw II skillfully recreates the dreadful atmosphere of the first films claustrophobic dungeon. The problem is that every texture looks like its from the iconic little room, thus every location feels nauseatingly familiar. The game variously insists youre in a hotel, subway, or factory, but it all looks like the same dilapidated hobo house.On the rare occasion that some of the games locations begin to creep you out, youll be shuffled into an enclosed puzzle room. Youll spend half of the game aligning electrical wires, matching TV monitors, playing blackout, or scratching your head looking for a vague clue to an unexplained puzzle. Sometimes the punishment for failing puzzles is interesting and gory, but mostly it results in a generic explosion. Failure results in a loading screen and a trip back to a checkpoint, which more often than not requires you to repeat some mundane task. The only innovation in Saw IIs minigames is a first-person lock-picking sequence I never tired of.Last years title was a messy new entry in the dwindling survival horror genre, but at least it had potential for improvement. Unfortunately, the second game fails to polish any of the concepts. Saw II doesnt just take a step backwards from the first game  it performs a reverse swan dive off a balcony into a swimming pool filled with razorblades.", "date": "Oct 20, 2010", "grade": "4.5"}