{"name": "Wii Party", "ref": "https://www.gameinformer.com/games/wii_party/b/wii/archive/2010/10/02/for-the-love-of-god-don-t-rsvp-to-this-party.aspx", "text": "Last month, I reviewed Guilty Party, one of the best examples of aparty game this generation. It has a light-hearted atmosphere, but italso requires strategy and forward thinking if you want to win. Bycomparison, Wii Party is unmitigated, uninteresting chaos. Believe itor not, Wii Party is worse than the Mario Party series.WiiPartys 80-plus minigames share the same uneven quality Ive come toexpect from Mario Party, which makes sense given that many of them areiterations of games from that series. The metagames are even worse.Whereas Mario Party gave players multiple boards to play through, WiiParty features multiple game types, each less exciting than the last.BoardGame Island and Globe Trot adhere most closely to the Mario Partytradition. If youre going to play any portion of the game, Globe Trotis the best. You choose how many spaces you move by playing cards inyour hand, so you have more control over whats going on.Gametypes such as Spin-Off are full of random crap that keeps determiningthe winner out of your control. In my first few rounds of this Wheel ofFortune rip-off, the bank filled up with 50,000 coins that Isubsequently won in a minigame, making it nearly impossible for me tolose. This wasnt due to any sort of skill on my part; it was dumbluck. My reward? Having to sit through 10 futile rounds of otherplayers spinning the wheel, unlikely to ever catch up.If thatisnt enough to put you to sleep, why not try one of the several gamesbased around the thrilling activity of matching Miis who are wearingthe same color? Theres even Mii Bingo. Yes, Mii Bingo. That shouldgive you a good sense of the brain-dead crowd this game is targeting.Ican already hear complaints rolling in about how Im not part of WiiPartys intended audience, but I dont think thats true. I lovegetting friends together to play goofy games like this, but plenty ofother Wii releases have done what Wii Party is attempting in better andmore interesting ways  even Nintendos own WarioWare: Smooth Moves.The only impressive thing about Wii Party is how Nintendo dumbed downand removed the soul from a franchise that was already as stupid andsoulless as Mario Party.", "date": "Oct 02, 2010", "grade": "4.5"}