{"name": "Plants vs. Zombies", "ref": "https://www.gameinformer.com/games/plants_vs_zombies/b/xbox360/archive/2010/09/28/review.aspx", "text": "In just over a year, Plants vs. Zombies has sprouted across multiple platforms, further establishing PopCap as a household name post-Bejeweled. Whether on PC, handheld, or mobile platforms, each installment oozes with PopCap's signature charm and polish, and the most recent 360 version is no different. To further enhance an already solid and addictive offering, PopCap has included engaging cooperative and multiplayer modes to keep things fresh. In case you've been living under a Wall-Nut, Plants vs. Zombies requires you to defend your home (and your brain) from a zombie invasion using a variety of plant life to keep the hordes at bay. This time around, however, a second player can join in for the main adventure's 50 levels. Each player selects and places plants independently, but having an extra set of eyes becomes helpful during later levels when zombie hordes are seemingly endless. You'll also find separate co-op levels outside of adventure mode that gives each player four slots to choose plants. Sunlight needed to set up your defense isn't shared, however, so what begins as a harmonious team effort can quickly turn into a shouting match for hogging all the energy or misplacing a plant -- and that's all part of the fun.Versus mode puts one player in control of the plants, with the other commanding the advancing zombie horde. The plants are no different than in adventure mode, but as zombies you're tasked with protecting your army from opposing plant projectiles with properly placed tombstones while driving zombies toward the plants' home. The inclusion of multiplayer and cooperative modes to the franchise is a welcome addition, and the seamless execution of familiar gameplay mechanics when exploring new soil with a second player makes these modes feel like they have been part of the beloved game from the start.If the new control layout on the 360 is of concern, don't sweat it. PopCap has continually done a fantastic job translating the control scheme across platforms (from computers to touch screens) and the 360 controller is no exception. While navigating the grid with the left stick is probably the least tight among platforms, it takes no time at all to adjust to the new scheme making it just as easy for veterans and newbies alike to get the gameplay down.If you have yet to pick up Plants vs. Zombies or want to once again engage in zombie stomping (or brain munching) action with a friend, the XBLA version (or the physical 360 copy bundled with Peggle and Zuma) is a worthy addition to your library.", "date": "zalez on Sep 28, 2010", "grade": "9"}