{"name": "F1 2010", "ref": "https://www.gameinformer.com/games/f1_2010/b/ps3/archive/2010/09/17/f1-2010-review.aspx", "text": "F1 may be the pinnacle of racing around the globe, but for most Americans and gamers, its souped-up, high-tech cars and rock star-caliber drivers are more than a little inaccessible. In video games in particular, F1 cars are generally thought to be too finicky for your average player brought up with arcade racers or even sim-style franchises like Gran Turismo. With F1 2010, Codemasters a leader in the racing genre applies its own take on F1 and delivers an enjoyable and drivable experience.Racing games have struggled with making life off the track anything other than just a series of button presses to get you to the next race, and for the most part F1 2010 offers activities that not only break up the seasons monotony, but also make sense. Interviews with the press can help or hurt your relationship with your race team, and the overall happiness of your team is important. If they like you, and youre performing better than your teammate on the track, youll get to control the research and development direction of the program. The R&D aspect of F1 is cool because youll occasionally get objectives during the practice sessions. These arent that involved (such as beating a certain time in a determined number of laps), but theyre important in that they give you something to shoot for in practice a segment of the race weekend schedule that most gamers likely skip, unfortunately.F1 follows a similar racing template that other Codemasters titles have already employed. The cars handle well, there is a light damage component, and you can use flashbacks to rewind the game to before you crashed. Although the car handling can be changed with different assists to suit your liking and damage isnt as disastrous as you might think, the main thing that the game achieves in the gameplay department is the lightness of the cars and the high acceleration thats possible. Combined, these two elements can be dangerous; youve got to learn to baby tight turns, otherwise you are going to easily spin out. The game also layers in factors such as how much gas you have in your tank (which means you lose grip as the race goes on because your car becomes lighter), the heat of your tires, and the performance of your engine. The latter two are important because when the tires and engine are in the zone, youll turn out better lap times.Combining ease of use both on and off the track is the key to why this game stands out. I cant say that either aspect of the game is the most involved you are going to see, but simply having interviews and team objectives is great for a season-based racing game. Couple that with accessible racing and an eye towards realism, and Codemasters finally delivers an F1 game everyone can enjoy.", "date": "Sep 17, 2010", "grade": "8.5"}