{"name": "Professor Layton and the Unwound Future", "ref": "https://www.gameinformer.com/games/professor_layton_and_the_unwound_future/b/nintendo_ds/archive/2010/09/13/professor-layton-and-the-unwound-future-review.aspx", "text": "When Professor Layton and the Curious Village came out in the U.S. a couple of years ago, it was a fresh concept. The French cafe soundtrack, the distinct animation and art style, and Layton and Lukes insatiable desire to solve mysteries made it stand out from your ordinary puzzler. The second game was on a similar bar puzzle-wise, but it had a strange vampire plot and ending with a series of wacky explanations.This time around, the duo may or may not travel to a future version of London, so its not like things are suddenly grounded in reality. However, the cast really sells it. I wont spoil any new or returning characters, but its easy to see why the charming professor gathers a crowd of amateur puzzle enthusiasts on his trek, making the player feel like a team member as well. The biggest departure from previous Layton tales is that it actually ties into the professors past  we learn that hes not just a stoic, manners-obsessed robot. Its also worth mentioning that this is the last entry in a distinct trilogy, so fans have to check out the surprisingly epic finale (the next Layton trilogy is actually a prequel). From a puzzle-solving standpoint, dont expect too many changes from previous titles. Youll still have plenty of block shuffling, route figuring, and how old is this sister? phrasing tricks. However, Level-5 finally revamped the memo system, and it makes a huge difference. Now you can change ink color, line thickness, and most importantly, erase specific notes instead of being forced to clear out everything at once. Theres also a new Super Hint that unlocks after youve spent three coins on all of the previous puzzle hints. This one costs two coins and pretty much spells the answer out. Of course, they should only be used if youre extremely stuck, but it essentially eliminates the need to look up answers online.Bottom line, if Layton didnt float you boat the first time around, nothing is going to change your mind here. But its definitely worth it for fans to jump back into a world where you cant walk five steps without finding a puzzle to solve.", "date": "Sep 13, 2010", "grade": "8.25"}