{"name": "The Legend Of Zelda: Tears Of The Kingdom Is Already The Second Best Selling Game Of 2023", "ref": "https://www.gameinformer.com/games/ruse/b/ps3/archive/2010/09/07/review.aspx", "text": "R.U.S.E. is an unusual real-time strategy title that attempts to portray the fantasy of a general moving figures around a battlefield map as closely as possible. Outside of the fantastical Ruse abilities, the mechanics are simple. Flanking has no effect, logistics effectively don't exist, and each faction has only a few dozen total units. There is plenty of game here regardless  it's just not always fun.The one thing that R.U.S.E. does unquestionably well is present a wide view of a multi-front battlefield. Players must maintain control of the roads between their money-generating supply depots and their headquarters while mounting raids or frontal assaults on their enemies. The smooth strategic zoom and easily accessible build menu make it headache-free. The classic RTS interplay between micromanaging battles, trying to stay on the right side of the unit counter paradigm, and controlling the map works well.The tank-infantry-artillery-aircraft force composition you'd expect out of a WWII game makes up the backbone of battle, but the frequently deployed Ruse powers shake up the predictable combats. These can do everything from sending out fake units to cloaking your units under radio silence. Complementing your army building and movements with the perfect Ruse is a unique thrill. The fact that every player has access to the same Ruses and the same number of activations makes deploying and countering them a large part of any strategy.Unfortunately, the only place this intriguing design has a place to shine is in multiplayer. The campaign is laughably awful, with a tepid story told through awkwardly acted cutscenes surrounding poorly scripted scenarios. The symmetrical skirmishes in online play are a far better fit for the bluff-intensive gameplay, and a wide variety of stat tracking and matchmaking services make it a destination well worth visiting. The AI in offline skirmishes is competent enough, but the psychological aspect of R.U.S.E.'s warfare works infinitely better against a human opponent.A number of hiccups in the control scheme and unit AI keep the gameplay from being as smooth as I'd like, and the console versions suffer from constant texture draw-in and object pop-up when you're quickly flitting about the map  which is most of the time. I hope online play finds an audience, though, because it's a unique flavor that is sure to resonate with a fair number of gamers. I can't recommend R.U.S.E. without reservations, but RTS enthusiasts may find what they're looking for.", "date": "Sep 07, 2010", "grade": "7.75"}