{"name": "Audioshield", "ref": "https://www.gameinformer.com/games/audioshield/b/htcvive/archive/2016/04/22/game-informer-review-audioshield.aspx", "text": "Music games have always helped players feel more deeply immersed in the music they love, and Audioshield has two big advantages in fulfilling that goal. First, a clever behind-the-scenes system creates a playable track out of any music file on your computer, and also allows you to search for and play any music available in the sprawling online streaming library of Soundcloud. Second, it brings those songs to life in a fully virtual playspace, in which your bodys motions meet and block individual beats as they fly toward you. Whether it makes you feel like a dancer, a boxer, or someone in a Tron-like dreamscape, theres no denying the sense of engagement and excitement.Audioshield sports a utilitarian interface. Little fanfare greets the new user other than a collection of recommended Soundcloud songs that can be played right away. Those selected songs are good entry points, but they arent the full setlist. A search bar allows you to search for anything available on Soundcloud  a service filled with remixes, live recordings, mash-ups, and original recordings from a huge number of artists. If thats not enough, you can also tap into music files on your PC, and they work equally well. No matter the musical selection, Audioshield analyzes the most interesting and intense parts, and transforms those into a fun and playable sequence of notes. While other games, including predecessor Audiosurf, have provided this freedom, the dynamic in VR brings new life to the concept.The trappings of Audioshield are spare; the focus is on the action of interacting with the music. No progression system or story governs the gameplay that follows, other than the inherent desire to improve your score as you compete on the global leaderboards. Each song plays out on one of only two arenas, and you cannot customize or alter those play spaces, which is disappointing. Even so, the pointer-based menus and navigation all work adequately, and get the user into a song without fuss, at least most of the time. I encountered a few game crashes as songs loaded or completed, but otherwise had a smooth gameplay experience as I jumped from one song to the next.Once a song is selected, you find yourself standing on a raised dais. A stream of red and blue notes hover like attack planes on the distant horizon. In each hand, you hold a shield, color-coded to match one of the incoming note hues. Set to arrive in time with the beats of your selected song, the notes begin to hit from every forward trajectory. Swinging your arms left, right, up, and down, you block and jab the colored balls of light and tally up a high score.The concept is instantly understandable, and the sense of involvement in the music easily equals other great beat-matching experiences, like Rock Band. The difference here is the sense that youre inside the flow of music, and your own body motions and vision tracking determine success, as if you were really holding a shield and your song had come to life to attack from every direction. After grasping the basics of blocking, the game gains additional complexity as you realize its also tracking the speed of your punches, and the artistic value of your motions, encouraging an almost aerobic quality to the action.The experience only works because the background algorithm creates interesting attack patterns. Red and blue notes fly in at different corners of your peripheral vision, forcing you to swing your arms quickly from one side to the other. Long, held streaming notes feel like youre holding off a mighty barrage, and the vibration in your controller supports the sensation. Occasional purple notes (both shields held close together) indicate a climax. And in most cases, the notes begin to arrive from higher attack paths later in the song, forcing your arms up in a way that replicates the bodys motion for excitement and active movement.While many of Vives launch applications are demos or betas, Audioshield is a solid and complete game, and its ability to read and create playable tracks from any piece of music provides effectively endless replay value. This is an early testament to the power of VR to create novel experiences in established genres, and music-game faithful should seek an opportunity to at least try out this new take on interactive music play.", "date": "Apr 22, 2016", "grade": "8"}