{"name": "Dead Rising 2: Case 0", "ref": "https://www.gameinformer.com/games/dead_rising_2_case_0/b/xbox360/archive/2010/08/31/capcom-delivers-a-deliciously-light-appetizer.aspx", "text": "Dead Rising 2: Case 0 is an odd proposition. It straddles the line between being a standalone experience and a demo of its big brother, Dead Rising 2. The fact that it does both things so effectively is one of the bigger surprises of the year.The original Dead Rising won over fans with its sandbox zombie-slaying gameplay, while taking a fair amount of heat for its myriad faults. The save system was unforgiving, the unrelenting passage of time made it tough to dink around, and gunplay was janky (or par for the Capcom course, depending on your perspective). With the sequel, Capcom and Blue Castle Games have added two more save slots and addressed the combat shortcomings. Chuck Greene, the sequels new hero, can walk around while firing guns. Its standard stuff for most games, but with Dead Rising it feels like a revelation.Players wary of plunking down $60 for Dead Rising 2 can test the game's new mechanics in Case 0 for $5. If you were already planning on buying the sequel, you'll get a few bonuses as well. Case 0's story bridges the narrative gap between Dead Rising 1 and 2. There arent any earth-shattering reveals, but it sets up the dynamic between Greene and his daughter Katey and transfers your character progression into Dead Rising 2. When I fire up the sequel, for example, my version of Chuck will start off at level five. Hell also have a Mohawk and will be dressed as a diner waitress, but thats another story.Case 0 features most of the major elements of the sequel. By the time the end credits roll, you will have created a few new weapons using the games new workbench feature, escorted some survivors (and enjoyed their improved pathing and AI), given your daughter a timed dose of anti-zombie medication, scoured the zombie-filled streets for parts to repair a motorcycle, and battled a psychopath in a junkyard. And, of course, you will have slaughtered hundreds of the undead with improvised weapons as varied as dinner plates, baseball bats, and pushcarts.For better or worse, however, you can burn through the entire experience in a few hours. Case 0 is a relatively short experience, but I found myself going back to it several times afterward to search for more weapon components and to smash my way through a few hundred more undead. Poking crowds of zombies with an electrified rake hasnt gotten old.Aside from its meager scale, theres not much wrong with Case 0. If you loved the first game and are salivating at the sequel, picking this one up is a no-brainer. Skeptics should check it out, too. If nothing else, its a great representative slice of Dead Rising 2  for better or for worse.", "date": "Aug 31, 2010", "grade": "8.75"}