{"name": "Disney Guilty Party", "ref": "https://www.gameinformer.com/games/disney_guilty_party/b/wii/archive/2010/08/25/the-dickens-family-detective-agency-is-open-for-business.aspx", "text": "The sign of a good mystery is that it keeps you guessing until theend. For all of its goofy characters, motion-based minigames, andoccasional frustrations, Guilty Party does just that.The easiestway to understand Guilty Party is to think of the old mystery boardgames Clue and Guess Who. Like Clue, you explore the different roomssurrounding the location of a crime scene, gathering evidence on theculprit. Like Guess Who, the clues help you whittle down the list ofsuspects by hinting at the physical attributes of the criminal -- theirgender, hair length, height, and weight. You only have two options foreach trait, which seems like it could make things too simplistic, butin every case I played through, I was uncertain right up until Iuncovered the final clue.Guilty Party is split into two modes:Story and Party. Story Mode has six main cases, plus a prologue and afinale. These mysteries have set criminals and clues, and each isbookended with a silly cutscene that moves the story along. The plot,about a family detective agency being tormented by the devious criminalmastermind Mr. Valentine, is inconsequential, but the dialogue andvoice acting are funny enough to keep players of all ages entertained.Thefamily runs the gamut of mystery story stereotypes, from the superherowannabe Kid Riddle to the Sam & Max-style comedic noir detectivecoincidentally named Max. A kung-fu-wielding granny named Charlotte isthrown in for good measure. The other female family members play itstraight to the point that theyre boring, but everyone else provides afew chuckles during the teams absurd exploits. My personal favoriteline: Oh, Hugh the manatee! screamed while a zeppelin explodes in thebackground.Party mode exchanges the storyline for randomlygenerated mysteries and more ways to mess up your opponents. ThoughParty mode can be played cooperatively, the real fun is in playingcompetitively, where you get to draw cards to choose what traps Mr.Valentine sets for other players after your turn.The onlydownside is that in the chaos of locking other detectives in rooms,stealing their move tokens, and knocking them out, its pretty easy tomiss out on clues and leave your crew unable to solve the mysterybefore time runs out and the bad guy escapes. Get ready to be annoyedby your character screaming the same two or three lines every time youplay a card or win a minigame as well. ~Kid Riddle strikes again!~ Andagain. And again...While the mystery metagame is enjoyable, GuiltyPartys minigames are passable at best. Many are extremely easy, suchas fanning away the dust in a crime scene to uncover clues or ticklinga suspect to get them to reveal information (both accomplished with thesame frantic waving of the Wii remote). If you solve these withouttrouble (as players of almost any skill level will), the gamerecommends moving to a higher difficulty setting. When this happens,youre inevitably going to bump into one of the rare overly difficultminigames, such as an awkwardly fast-paced rhythm game or athumb-wrestling match thats far too hard.Though theyre hardlycompelling, the minigames are at least numerous and easy to learn. Inever repeated the same tasks often enough to get bored with them, butI also never found myself confused when new mechanics were introduced.They basically operate as a minor and inoffensive distraction forfamilies and friends. If youre a fan of board games or enjoy gatheringpeople around the TV to play together, Guilty Party will have youscouring for evidence and unmasking crooks for weeks.", "date": "Aug 25, 2010", "grade": "8"}