{"name": "Mafia II", "ref": "https://www.gameinformer.com/games/mafia_ii/b/pc/archive/2010/08/20/mafia-ii-review-jump-into-this-thing-of-ours.aspx", "text": "Americas fascination with the Mafia is long documented. For decades, films like The Godfather and television series like The Sopranos have basked in the world of the Italian organized crime syndicate. Its current and former members tout it as a closed community that operates on trust, respect, and glory. Never mind that in reality they backstab, double-cross, and rat each other out at a higher frequency than any of the Real Housewives reality shows. No video game franchise adheres more closely to this fractured dream of a romanticized criminal subculture than Mafia. Set in the 40s and 50s, Mafia II is jam packed with familiar plot devices pulled from classic movies like Goodfellas and A Bronx Tale. In the fictional city of Empire Bay, three Italian crime families hold control over most of the criminal underground. While the old fashioned Dons stick to the time-tested rackets of gambling, running numbers, and boosting goods, more adventurous young upstarts start dabbling in get-rich-quick schemes involving narcotics. This creates a friction that could break the alliance and pit the families against one another. This is the backdrop for Vito Scalettas rise from street thug to wise guy.Like a made guy dressed to the nines in a tailored suit, fedora, and a pair of Stacy Adams, Mafia II dresses the part. The new setting, Empire Bay, is a stunning recreation of a 40s and 50s American metropolis. From the war-time propaganda posters to the era-specific automobiles and radio tunes, Mafia II transports you to a time where American pride was at an all-time high, dames were called broads, and overt racism ran rampant through the segregated communities. The impressive attention to detail is most noticeable in the expertly crafted building interiors, which look like destructible sets pulled straight out of Mad Men.Unlike Grand Theft Autos Liberty City, Empire Bay isnt an open world playground overflowing with side quests and distractions. The world still feels like a living city, but Mafia II is a much more focused experience. You can buy new clothes, get your plates changed at the auto shop, and boost cars for cash, but thats about the extent of your interaction with the city. The game is divided into story chapters, which allows the developers at 2K Czech to alter the weather, time, and city conditions in service of the missions. While explorative gamers may miss the freewheeling structure of games like GTA and Red Dead Redemption, those who never finish lengthy games will appreciate Mafia IIs direct storytelling.The original Mafia stood out for its engaging missions, and the sequel follows suit. You still drive through the city for long stretches (this time without a clutch or constant harassment from traffic cops), but once you reach your destination the action unfolds in smartly scripted missions that feel different every time. These quests feature your standard blend of third-person shooting and driving sequences, with the occasional fistfight thrown in for good measure. The controls dont depart drastically from genre conventions, though the finicky cover mechanic gave me troubles in tight quarters.For Vito to become a made man, he must earn his stripes selling stolen cigarettes on the streets, robbing jewelry stores, burying dead bodies, and taking on dangerous infiltration and assassination missions. His best friend Joe is along for the ride most of the time, and their dialogue serves as a narrative lynchpin. Though Mafia II relies heavily on mobster clichs, the ending takes an interesting turn that gives the game its own identity.If youre a veteran of open world games, you should note that Mafia II is extremely easy on the normal difficulty. Turn it up a notch if you want more challenging gunfights. No matter what difficulty you choose, dont expect at lot of interference from the clueless cops. When you break the law, the men in blue arent overly concerned with apprehending you  some give lazy chase, but shaking them is as easy as stepping on the gas in a fast car, making a u-turn in a busy intersection, or stopping until the cops get out of their cars and then flooring it. Theyre even more ineffective when the guns come out. I hid behind a dumpster of a closed-off alley in front of a pile of several dead officers and lost my wanted rating despite several cops patrolling the area.Mafia II suffers from some other minor annoyances as well. The game relies heavily on cutscenes, and sometimes doesnt know when to draw the line between interacting with the world and triggering a cutscene. I shouldnt take control of Vito as he wakes up only to jump immediately into another cutscene when I pick up the ringing phone. The NPC intelligence during missions is also troublesome. In one mission I had to tail a car to find out where it was headed, but the driver got into an accident and the mission failed.In an era when video games are moving away from relying on cinematics for storytelling, Mafia II draws on the rich mobster film history to weave a gripping drama about family, friendship, loyalty, betrayal, and pragmatism. If youre fond of quoting Don Corleone and Tony Soprano, dont miss this game.", "date": "Aug 20, 2010", "grade": "9"}