{"name": "Torchlight III", "ref": "https://www.gameinformer.com/review/torchlight-iii/torchlight-iii-review-seamless-destruction", "text": "Torchlight III knows what it is, and embraces that identity. Its not the biggest action/RPG on the market. It doesnt have the most grim or mature setting, nor does it have the most complicated fictional backdrop. Instead, Echtra has crafted a buoyant adventure that joyfully hops players from one environment to the next, with barely a hitch of story or quest-tracking needed. The monsters are plentiful, the powers you wield are bombastic, and the unfolding battles fill the screen with colorful blasts and thunderous noise. The seamless nature of the action and leveling is just barely complex enough to demand your attention, making it a welcome fit for laid-back nights of escape, whether by yourself or with up to four friends working together.Even as an enthusiast for gaming narrative, I skipped along the light storytelling of Torchlight III like a rock across water, vaguely capturing the gist of a tale set 100 years after the last game, with some bad guys from another dimension hoping to take over the world. The visual world-building is more robust, capturing a fun aesthetic mixing classic fantasy with clockwork/steampunk aesthetics. The result is a colorful setting filled with flashing elemental blasts and endless gears. The playful tone and art direction are a pleasant departures from the dark and gory norms of the genre, even if some spaces feel too similar. I was also frequently frustrated that large environmental objects occlude the view, which can sometimes just be annoying, but occasionally put your hero in a vulnerable spot.In a mostly frictionless game, the one space Echtra has carved out depth is a rewarding character upgrade system. Four amusing classes each offer something enticing, from the dark and light balancing of the Dusk Mage to the borderline silly Railmaster, who literally builds a railway track and hauls a train behind him throughout the adventure. Each class is further enhanced through the selection of a relic subclass  a special elemental object that adds an additional tree of abilities. As such, your Sharpshooter class plays quite differently, depending on whether youve decided to freeze your enemies with the Coldheart relic or set the world ablaze with the Flaming Destroyer.No matter your selection, it only takes a few levels to transform into a walking engine of destruction, encouraging that pleasant flow that comes from decimating dozens of enemies every minute in increasingly cathartic area-effect blasts and crushing weapon smashes. Multiple adjustable difficulty levels allow for efficient scaling to your experience or attention level; players who want a more dangerous adventure certainly have that option, though the game feels best when it moves at high speed, rather than slogging through a challenge your character isnt ready for. No matter how hard you make it, you settle quickly into a mostly mindless rhythm of power rotation and satisfying loot bursts.Thanks to a pet who happily jets off to sell your gear, inventory management is a breeze, and I liked the variety of both cosmetic and functional features reflected in the many weapon and armor pieces I gathered. Players looking for an especially rich system of attribute optimization are likely to be disappointed. Like most things in the game, the focus is on quickly getting you back into the fray, not endless hand-wringing about which gloves to put on.After you complete the campaign, Echtra has planted a number of wrinkles to maintain your interest, including an enchantment system, increased focus on crafting, and the ability to further customize your fort. I never warmed to fort development, which unfolds in a cramped space, and the changes I made rarely affected gameplay enough to be satisfying.I enjoyed the post-game dungeon system, in which an enterprising djinni sets up shop to create endless Dundjinns (get it?) for you to explore, each with increasingly challenging modifiers, and ever greater rewards. For players who fall in love with continued character development, theres no shortage of additional battles on the horizon, though I was personally ready to try a new hero after a few hours of post-game. That end-game option is especially welcome if youre playing with friends. Torchlight III supports up to four-player online cooperative options, and its borderline ridiculous to watch even more chaos unfold, even if the onscreen visual clutter can get especially hard to track.Clever class design accepted, Torchlight III doesnt offer tremendous innovation or nuance in its systems or gameplay. The gratuitous destruction is often great fun, right up until the hour marker when its not, and it all starts to feel a bit tedious. Thankfully, theres always a new magic sword to collect, a respec to try out, a new character class to discover, or a dungeon to delve. Torchlight III is an approachable action/RPG thats especially welcoming to newcomers, or simply players who dont want to focus too hard on their evenings entertainment. Repeat conquerors of heaven and hell may wish to look elsewhere, but if your desires for fantasy destruction are more about high-octane action, Torchlight III rarely disappoints.", "date": "Oct 13, 2020", "grade": "8"}