{"name": "Shin Megami Tensei: Persona 3 Portable", "ref": "https://www.gameinformer.com/games/shin_megami_tensei_persona_3_portable/b/psp/archive/2010/07/13/an-aging-formula-revived-by-improvements.aspx", "text": "When Game Informer reviewed Persona 3 back in 2007, wepraised its macabre visuals and fun combat as defining aspects that set itapart from other RPGs. While this handheld port suffers from simplifiedvisuals, absent cutscenes, and a dated formula, the additional storyline andimprovements make Persona 3 Portable worth returning to for fans of theoriginal. For newcomers, this is a great entry point into a memorablefranchise.If you want to know more about the original Persona 3, youcan check out our original reviews in our Review Archive. Whatmatters most for P3P are the new additions and time-tested improvements thathave been made to the original title, and what concessions were made to fit thegame on the PSP. Persona 3's gameplay is as entertaining as it ever was. Thecombat is even more engrossing thanks to your ability of being able to controlyour party's actions (the AI chose their attacks before). Scaling Tartarus isalso easier now that you can return to the highest floor you've reachedwhenever you enter the Dark Hour, eliminating needless grinding. Mostimportantly, the enjoyment derived from collecting and forging new personashasn't aged a bit. For the uninitiated, personas are the game's equivalent of Pokmon, however thedepth of their abilities make them as useful as a regular party member. Onceyou've collected multiple personas you can fuse them into new, more powerfulpersonas. Every persona can be leveled up during combat, making them as engagingand addictive as Nintendo's pocket monsters - without the kid gloves. If youalready amassed an army of personas in the original release, the new playablefemale protagonist in P3P adds a different perspective to the action thatshould justify doing it all over again. Persona 3 is also surprisingly conducive to portable gaming.Gameplay is split up naturally thanks to the game's calendar schedule, allowingyou to play one or two in-game days in an hour or so. Traveling around the cityhas been simplified to selecting icons on menus, which reduces downtime to aminimum, allowing you to focus on dungeon crawling and building up yourrelationships.P3P does suffer a few minor setbacks, but most of them areaesthetic. The simplified character models don't diminish the experience, butthe same cannot be said for the cutscenes. The original animated sequences aregone, replaced by still images (the camera pans and zooms over the image, butit's not the same) or the standard portrait-plus-dialogue scheme that JRPG fansare accustomed to. When I was talking to other editors about their favoritestoryline moments from the game, I scarcely knew what they were talking about,because in the PSP version they've been reduced to lifelessconversations. Ultimately I can't recommend P3P to every player, and even some RPG fans may beput off by the title's aging formula. For gamers who don't mind that thisremake might not be the freshest experience to be had in 2010, there's a vastwealth of entertaining gameplay to be had here.", "date": "Jul 13, 2010", "grade": "8.25"}