{"name": "Dragon Quest IX", "ref": "https://www.gameinformer.com/games/dragon_quest_ix/b/nintendo_ds/archive/2010/07/09/an-epic-rpg-franchise-limited-by-the-scope-of-its-changes.aspx", "text": "Taken in the context of the series, Dragon Quest IX is a strange game. Its the first in the franchise to debut on a handheld, and it changes the classic formula in some significant ways. In many cases, these changes push the genre in interesting directions, but they never go far enough. The end result is an enjoyable Japanese RPG with mere hints of greatness.Dragon Quest has always had religious undertones -- you save the game by confessing at a church, after all -- but DQ IX embraces those themes. You play as this fantasy worlds equivalent of an angel, and your sole reason for existing is to do good acts for humans so that theyll praise their maker, a being referred to as the Almighty. Its a perfectly sensible and interesting setup to support the normal DQ structure: wandering from town to town solving other peoples problems. I like having a real explanation for why youre doing everyone elses dirty work, though the game doesnt explore the spiritual side of its premise as much as I wanted. Outside of the plot, Dragon Quest IX is full of unique and potentially groundbreaking features with lackluster implementation. A class system opens up around 10 hours in, allowing you to change jobs at any time; however, youll have to start over at level one with each job, leaving little incentive to switch. Luckily, the battle system is as fast and enjoyable as its ever been. Skill points allow you to specialize within your current class, but the small number of points offered per level limits the amount of customization available.Random encounters have been stripped away -- you now run into monsters on the map to engage them in battle. This wise change helps eliminate the series infamous grinding from most of the short but well-designed dungeons. Save for a few end-game encounters, you wont run into many opponents that require mindlessly gaining levels to succeed. The last few areas are a real challenge, though, so expect to die more often as the game progresses. Also, be prepared to fight some of the tougher battles multiple times as the game recycles certain bosses.Though its still more accessible than the series has ever been, DQ IX clings to a few outdated conventions (Resurrect spells can fail? Really?). Questionable design choices are also apparent after a couple of story moments where you are separated from your party; the game does a poor job of communicating when youre allowed to head back to an inn and re-recruit your allies. The fairly open structure of the game is a plus -- youre often allowed to head off on your own and explore the world as much as you want -- but its disappointing that a few otherwise awesome set pieces become mildly frustrating due to the game being unclear about what it wants you to do.Dragon Quest IXs biggest thrills come from exploring its colorful world. Even when the core plot breaks down into JRPG clichs, I found myself eager to discover the next locale and see what vignette plays out. The high point of the world design comes with Swinedimples Academy, a take-off on Harry Potter that provides a clever change of pace and a self-contained story that had me smiling. Other areas fall a bit more in line with what you might expect from a JRPG, but theyre always basked in a light-hearted presentation that makes them more tongue-in-cheek and less of a chore. Where DQ IX falls particularly short is in the failed promise of its multiplayer offerings. In addition to pulling in up to three other players at any time during the main story, you can wirelessly exchange treasure maps that spawn randomly generated dungeons full of powerful bosses and loot. These features would have extended the games life for me greatly if I could use them online, but theyre only available via local wireless. The 50-plus hour story and tons of sidequests are good; its just too bad about that icing on the cake.", "date": "Jul 09, 2010", "grade": "8"}