{"name": "LEGO Harry Potter: Years 1-4", "ref": "https://www.gameinformer.com/games/lego_harry_potter_years_1-4/b/wii/archive/2010/06/29/traveller-s-tales-casts-another-charming-spell-over-old-mechanics.aspx", "text": "Travellers Tales tried to break out of its LEGO formula withIndiana Jones 2, and the results werent that great. The studio hasreturned to the classic structure for LEGO Harry Potter. For the mostpart, it works.Wizard powers are quite similar to the Force, soyoull float pieces into place without stretching the fiction too far.The game leans on this mechanic frequently, so prepare yourself forplenty of exploration and puzzle solving. The reason for those sassyquotation marks? Outside of a few challenging rooms, most puzzlesconsist of breaking everything, holding down a button, watching astructure build itself, and then using said structure to jump to ahigher platform. I turned my brain on autopilot for most of the game.Harrydoesnt spend a lot of time battling minions in the books. Its moreabout discovering the wonder of Hogwarts and maybe taking on a schoolrival or evil wizard. To stay true to the material, combat is scaledback considerably from previous LEGO titles. The only real battles inthe entirety of the Year 1 section are against the bathroom troll,Professor Quirrell, and some wasps in the forest. Combat picks up lateron, but if your favorite part of LEGO games is cutting down an endlessflow of stormtroopers with a lightsaber, this may not be the one foryou.Despite these setbacks, its hard to not be charmed by LEGOHarry Potter. Travellers Tales maintains its reputation for amusinglysilly interpretations of characters and story points, and I foundmyself constantly looking forward to how the team would handle the nextthing around the corner. The constant flow of unlocks in Gringotts Bankand shopping along Daigon Alley stirred up old feelings of addiction Ihad playing the Star Wars titles. While Harry Potter doesnt offer muchinnovation for the LEGO franchise, it at least puts it back on track.", "date": "Jun 29, 2010", "grade": "7.25"}