{"name": "Blue Dragon: Awakened Shadow", "ref": "https://www.gameinformer.com/games/blue_dragon_awakened_shadow/b/nintendo_ds/archive/2010/06/22/review.aspx", "text": "Three years ago the original Blue Dragon was brought exclusively to the Xbox 360 by the father of Final Fantasy himself, Hironobu Sakaguchi, and his Mistwalker studio. The turn-based JRPG received mixed reactions, but was still embraced by enough fans hungry for a next-gen, role-playing experience to spawn the less-than-stellar Blue Dragon Plus that featured RTS-style gameplay on DS. This time around the latest installment in the Blue Dragon franchise, Awakened Shadow, once again graces Nintendos handheld in a return to more traditional RPG standards that offers some satisfying, and at times frustrating, gameplay elements. Awakened Shadow picks up two years after the original left off. Shu, Jiro, Kluke, and the gang live happily in Neo Jibral Castle Town where all inhabitants are proud owners of shadows, at least until a mysterious flash seizes them all. Your personalized character is tasked to get to the bottom of this mystery and help restore the shadows, and once the game opens up to begin your quest, the story quickly falls apart as the games open-ended mission structure leaves little room for a cohesive plot line. Youll spend many of the early hours of the game recruiting party members through a series of fetch quests and minigames that make for slow pacing up until you receive airship access. Youll haphazardly travel across attractive and well-designed environments as a result of very ambiguous progress clues from NPCs that make exploration feel disjointed. On a positive note, quests are varied and fun, ranging from timed battles to touch screen-based minigames that help alleviate some of the frustration of finding these activities in the first place. Also, a robust alchemy system and character customization adds an element of variety and personality to the overall experience that gives the loads of loot youll discover some purpose.When traveling across Awakened Shadows different worlds, youll spend your time combating and looting varied enemy types in real-time. All enemies appear on screen allowing you to engage in battles at will, however, whether or not you think youre prepared for certain enemy types, the unreliable party AI youre saddled with makes encounters unpredictable in the worst possible way. With the right weapons, armor, and shadows equipped you can certainly mop the floor with some enemies. It can be very satisfying to watch skills earned from equipped shadows fire off in combat and work in your favor, however, sometimes things dont go as smoothly. You only have direct control over your main character and once it has fallen in battle you are rendered useless as the AI will continue without you causing the battles pacing to lose footing. Whats worse, as you remain inactive, theres usually a good chance you will get pummeled since your teammates will most likely stand still in the way of enemy attacks until their health is whittled down to zero. Even more frustrating are unforgiving save points. For a portable game of this scale, not finding a save point until midway through a dungeon can make probable defeat and a restart of an entire area very, very frustrating.Awakened Shadows disconnect in story and progression, plus little AI polish suggests this game was created with an emphasis on the multiplayer element of Awakened Shadow. Two friends and their customized characters can join you on your looting spree either locally or via Nintendos Wi-Fi Connection to make up for the inane party AI in solo mode, however this leaves role-playing fans looking for a solid solo adventure at a loss.While this true sequel to the original Blue Dragon gets off to a sluggish start, and certain gameplay and storytelling elements are not exactly perfect, your patience will be rewarded with a boatload of varied and entertaining quests  just be sure to bring some friends along for the ride.For the full media gallery, click here.", "date": "zalez on Jun 22, 2010", "grade": "7.75"}