{"name": "Disgaea Infinite", "ref": "https://www.gameinformer.com/games/disgaea_infinite/b/psp/archive/2010/06/08/review.aspx", "text": "I just beat Disgaea Infinite, and I have no idea what the hell happened.There I was, an ephemeral soul floating outside my sewn-together penguin body, possessing story characters from the main strategy/RPG entries in the Disgaea series in an effort to change history and not get my already-substandard wages cut. Things were...weird. Dark Overlord Laharl insisted on stealing Etna's pudding, fallen angel Flonne was obsessed with rare DVDs, and everybody (most of all, me) was very confused. By planting my own thoughts into their heads while they made decisions, I changed events as they unfolded. Then the credits rolled.Eschewing the strategy/RPG gameplay of its forebears, Disgaea Infinite progresses like a choose-your-own-adventure through a series of fully voiced vignettes. The handful of characters follow intertwining paths, meeting up with each other and splitting up again over the fifteen-hour timeline the game is set in. A handy visualization tool shows the various chains of events and where they take the cast. Players relive this period over and over, trying to solve the mystery of Laharl's impending assassination by altering discrete decision points along the way.One hour after booting the game up for the first time, just as I was getting into the bizarre but internally consistent story, it was over. By blindly choosing different paths for the plot, I stumbled upon a win condition. Hooray? I still have no clue why I won, or who (if anyone) was behind the explosive pudding. I had been beginning to put together a set of pieces into a cohesive story, and a peculiar joy in unraveling a tangled skein of mixed-up delivery packages and insane character actions was sinking in. I would go back and continue exploring the unusual tale if it weren't for the requirement to start a new game from scratch. The dialogue hits the same sweet spot of anime zaniness and slightly out-of-tune pop culture references that makes Disgaea such a unique and engaging setting. The characters and their interactions are as amusing as ever. The gameplay itself is simple to the point of absurdity, but that's true of all adventure games and does nothing to dim the excellent writing. However, the random nature of progression through the branching plotlines prevents Disgaea Infinite from being engaging as a game. As it is, this is no more than a briefly amusing spectacle for fans of the series.", "date": "Jun 08, 2010", "grade": "6.5"}