{"name": "The Golf Club VR", "ref": "https://www.gameinformer.com/games/the_golf_club_vr/b/htcvive/archive/2017/03/15/the-golf-club-vr-game-informer-review.aspx", "text": "The thought of a VR title replicating my real-life golf swing is simultaneously alarming and marvelous. There are few rules to my swing  and therefore little consistency  and The Golf Club VR is able to capture it and the wide variety of outcomes it produces. This doesn't do my score card any favors, but it does point to a believable, engaging VR experience.No matter what your swing is like, the game accommodates the user in various way to allow them to find that sweet spot between ease of use and frustration, which is crucial. This ranges from general difficulty settings that offer various levels of swing support (to help smooth out some of the more wild results) to the ability to move freely around the ball and vary your club length. The latter two are about letting you get in a comfortable stance in relation to a virtual golf ball that doesn't exist at a fixed point in physical space. This leads to some strokes where you may miss the ball, but on the whole, the game does a good job of translating slice, topped balls, and low power from your swing. The game also has the ability to convey that deep satisfaction that comes from a great shot: A tee shot that flies straight, far, and true, or a delicate chip from a sand trap. Putting is also gratifying. The speed of the greens and the need for a smooth stroke reproduces the joy and frustration of the short game.Most VR games talk about how the medium does or does not make you sick. While The Golf Club VR does not have this concern, taking full-powered swings with a headset on your face that has a cord coming off the back isn't the most comfortable gameplay situation. Several times a round I would step on the headset cord, screwing up my follow through and yanking the headset down. While you can look around the environment and get your bearings, the headset doesn't easily allow you to get into your stance, glance down at your ball, look to the side to see the fairway or pin, and adjust your body accordingly  like you do in real-life. There are ways around this, but the headset itself is an impediment to the experience. Conversely, the game utilizes the controller very well with various commands such as being able to hold it up and see your distance to the hole and the wind, and it acts as a zoomable viewfinder.The Golf Club VR has asynchronous multiplayer, but is very light in the features department. Apart from the laudable gameplay and the sheer volume of the courses available, the game lacks a career mode, structure, or any alternate modes. This does not detract from the gameplay, but leaves the Golf Club VR in between clubs with a par on the horizon.", "date": "Mar 15, 2017", "grade": "7.25"}