{"name": "Super Mario Galaxy 2", "ref": "https://www.gameinformer.com/games/super_mario_galaxy_2/b/wii/archive/2010/05/19/mario-shines-in-epic-sequel.aspx", "text": "Super Mario Galaxy 2 is perhaps the truest sequel in the history of the storied franchise. By that I mean that it is, by and large, just more levels of what we experienced in 2007s Super Mario Galaxy. On the one hand, that means that it is the first Mario title in years that doesnt feel like a dramatic reinvention of the platformer. On the other, Im glad I didnt have to wait for a new generation of consoles just to get another Mario game.The original Mario Galaxy is about as good as it gets. The way it eschewed large, open environments in favor of series of smartly designed orbs and platforms floating in space was just genius. It played the fundamental elements of platformer designs like a classical composer plays with notes, subtly tweaking gravity, movement, and even lighting in ways that constantly challenged your expectations.Mario Galaxy 2 builds on the strengths of its predecessor, adding new power-ups and abilities to the familiar mix. The most anticipated of these is the inclusions of Yoshi. Marios trusted steed is back, and was perhaps my favorite new feature of the game. Yoshis trademark ability being able to swallow and spit out enemies (now aimed with the Wii remote)  works extremely well here, lending a shooter-like aspect to the gameplay. You can also use Yoshi to swing between special flowers in the environment by pointing with the Wii remote. Both of these abilities are noteworthy for using integrating the Wii remote into the mix of platforming in a real, user-friendly way  something that most games of this ilk have struggled to do. Unfortunately, some other sequences that use the motion controller  some flight levels that control with paper plane controls and a Super Monkey Ball-style level that uses the Wii remote like a joystick  are imprecise and frustrating. Thankfully, the slight co-op functionality has been augmented somewhat, as your silent partner can now actually attack enemies onscreen with a spin move.Mario also has a variety of suits, including returning forms like Bee and Boo Mario as well as new ones like Rock Mario and Cloud Mario. While it's fun to be able to roll over goombas as Rock Mario or make your own platforms as Cloud Mario, to me the meat of the experience still lies in the more traditional levels, which require fast and accurate platforming while throwing mind-bending gravity reversals, moving platforms, and even slow-motion sequences at you. For me, the Yoshi abilities and suits really shine in the boss battles. Though most are based classic boss battle templates, each one manages to add at least one unique or compelling new aspect to the mix.Longtime fans will also herald the return of the classic-style level map, which you traverse in spaceship shaped like a giant Mario head. The ship holds a few of its own secrets (I strongly suggest using the gambling minigame in the warp pipe located in one of the ships ears to load up on 1up mushrooms) and the map does a better job of letting you know where the stars youve missed are located. This is one of the many call-outs to Marios past; Super Mario 64 fans will also be pleased with one surprise level that I wont spoil here.Miyamoto had promised that this game was to be more challenging and he wasnt lying. Its definitely harder than the first. In the early stages, this is a plus; Galaxy 2 gets you into some serious platforming much earlier in the game. It was nice to feel like you werent just waiting five or six hours to get to the good stuff. On the other hand, as the game wore on, I often felt more frustrated than challenged. I frequently hit choke points, where I needed one more star to advance, but the only available stars were either annoying Prankster Comet challenges or time-consuming hidden stars. If Ive completed all the main missions available to me, I just want to advance. For a time, I literally spent 4 hours of play without collecting one star. While I like a good challenge, this game has a lot of amazing content and I suspect many wont be able to get through it all.Even so, whatever frustration I may have felt was worth it. Most games today are willing to hang their hat on a small handful of new gameplay or level-design ideas. Super Mario Galaxy 2 throws something new at you nearly every single level and with over 240 stars to collect, thats no small feat. Sure, its not the total reinvention of the genre weve come to expect from a new Mario title, but as a platformer fan Im happy to get more Mario to tide me over. This game is a testament to the enduring appeal of the genre, as well as Nintendos ability to create fresh new gameplay out of a decades-old formula.", "date": "on May 19, 2010", "grade": "9.25"}