{"name": "Split/Second", "ref": "https://www.gameinformer.com/games/splitsecond/b/ps3/archive/2010/05/18/danger-lurks-around-every-corner.aspx", "text": "The fantastic moments in Split Second make you feel like you can move heaven and earth to your will. Sending an avalanche on top of the pack racing ahead of you or causing a train on a suspension bridge to derail and crash on the city below are powers worthy of mighty superheroes. The game puts these spectacular moments at your fingertips, but also produces enough spontaneous moments to blow your hair back and keep you guessing. This is a good thing, because when youve seen Split Seconds big moments several times after revisiting the same tracks, you need reasons to keep you coming back.The perfect lap in Split Second isnt necessarily the one thats the fastest. Its the one where you cause a nuclear reactor to explode at just the right time to take out as many competitors as you can. Its the one where youve drifted, jumped, and drafted enough times throughout the lap to constantly replenish your Power Play meter so you always have a way to trigger the various explosions and traps on the track to take out the other racers.Whether you want to use your meter as soon as you can or save it for the big moments is up to you, but I was usually uneasy with triggering Power Plays and Route Changes in the game, which was unfortunate. When I spent my power to drop a bomb on someone from a helicopter overhead, I always wondered if there was a cool Route Change that Id be missing out, because I couldnt refill my meter up fast enough. But there were also times when I saved it to no avail because that tracks big Route Change had already been triggered. In general, I often found myself going out of my way to drift corners to fill my power meter simply because I wasnt sure which strategy to employ. It might not sound like a big deal, but I often lost track position because of it, and thats not good racing.Theres no right or wrong way to use your power meter, and if you ever get the feeling that youve missed something at a track, dont worry, because youll be racing there again soon. Developer Black Rock doles out the thrills over repeated visits to a handful of locations. While I understand the work that goes into the games large-scale moments, and the tracks do offer different experiences as you re-visit them, going back to these same tracks can get old. Repetition also spoils some of Split Seconds grand moments.Thankfully, the game still has the capacity to surprise because of the various regular Power Plays the competition triggers against you and others. Moreover, the physics in the game produces varied results. When a car ahead of you explodes in a heap because a truck on the side of the road was detonated, theres always that moment before you drive through a wall of smoke, debris, and fire where youre never sure whats on the other side. These kinds of moments kept me coming back to the game more than the giant set pieces.I also love the different racing modes sprinkled within the game. Air Survival is like a boss battle against a missile-shooting helicopter. Survival is an exercise in faith as you try and dodge explosive kegs spilling off trucks running rampant. I even liked Elimination (where whoevers in last place after a certain amount of time is booted), a mode I normally dont like in racing games. It forced me to use my Power Plays differently than in the normal races.Split Second achieves a rarity in racing games, because it can make every lap feel different. This game has plenty of edge-of-your-seat racing and thrilling moments. Some of the repetition, however, slows it down.", "date": "May 18, 2010", "grade": "8.25"}