{"name": "Skate 3", "ref": "https://www.gameinformer.com/games/skate_3/b/ps3/archive/2010/05/10/review.aspx", "text": "I have to hand it to EA and developer Black Box. Theyve once again delivered a game that serves up dish after dish of the thing that makes a good game so addicting: gameplay. Building off the momentum of two previous releases, Skate 3 incrementally adds to the formula with a new career style, park editor, and a few new tricks for good measure. And while this third entry makes no remarkable changes, consistency is a good thing in this case, rewarding dedicated players of the series.Instead of following the tired idea of being a pro thats building up a career and sponsors, players assume the role of a new skateboard company owner. Not only do you start out by customizing your player, but your company, too. My company, Pants Stealers, eventually grew to the point where I had sold over a million boards and recruited a few AI teammates. While a lot of it seems like just another version of previous career modes, there are a few breakout features that make Skate 3 stand out  most notably in the online component. Not only can players join other companies online, there are full stats, player profiles, and even job-specific roles like street skater or filmer. You can also earn board royalties if other people download your custom content like videos, images, and parks.Speaking of parks, my favorite new feature is the custom park creator. If Port Carverton, the new fictional setting for Skate 3, isnt enough, you can go into one of the many dedicated skate parks, tear everything down, and start from scratch. A huge set of tools, extremely deep options, and a large selection of objects mean that creative users will undoubtedly come up with some amazing designs. Of course, these can be shared with the world for download. I was impressed with the real-world physics objects like ramps and rails that once placed, can be moved around by other skaters in-game just like they would in a real city. Because the gameplay in Skate is so solid, this adds a level of replayability that rivals other content creation-focused games like LittleBigPlanet.Online also returns with many of the previous games features like freeskate and proposing challenges. But with the addition of teams, online companies can battle it out in modes like Spot Battle and Hall of Meat. The number of things to do online is staggering. Almost all of the challenges from single player are available online to be played in either group co-op or versus. While its not structured like a proper career, players could effectively run through the whole game online together as a team.I think Skate 3s biggest strength is its ability to deliver smooth, fun gameplay that fits like a glove. New tricks like the underflip and darkslide throw in a little flair. If youre a fan, Skate 3 is a sure thing; if youre just starting out, its even better. New character Coach Frank, played by actor and pro skateboarder Jason Lee, will walk you through the basics. Black Box has also added in difficulty settings, which helps new players avoid frustration by saving more challenge for veteran boarders. The physics have been tweaked to be even more realistic, and better emulate the trials and tribulations of real-world skating.Black Box has once again sucked me back into the world of kickflips and hip tricks. The Skate series focus on whats important means gamers can pick up a copy with a sense of confidence that they will get what they pay for. While this latest title doesnt take any huge risks, I would argue thats a good thing. Skate has always been one of those rare games where you can just aimlessly play with no goals or objectives. With the addition of the park creator, this is only increased with the limitless possibility of player-created content.", "date": "May 10, 2010", "grade": "8.75"}