{"name": "Lost Planet 2", "ref": "https://www.gameinformer.com/games/lost_planet_2/b/xbox360/archive/2010/05/07/review.aspx", "text": "Now this is what a monster hunting game should be like. Lost Planet 2 hides its human characters beneath helmets and lumbering armor  never once letting them develop identifiable personalities  and lets the monsters take center stage. With the thirst for human blood driving these foul beasts, they rampage through sun-soaked jungles, engulf mile-long trains in a single bite, and evoke as much awe as they do terror. They put on a stylish, ferociously outlandish spectacle, thrashing and gnashing everything in their path as explosions and visual effects dance chaotically in their wake. While offering a visual feast, the monster menageries greatest contribution is creating nerve-shattering fights for co-op teams of four players.Although Lost Planet 2 can be played as a single-player game (with three unreliable, wandering AI bots standing in for players), most challenges call for a high level of coordination between the four teammates. In one such battle, one player is tasked with manning a cannon, the second fetches ammo, the third operates a crane, and the fourth calls out the bosss location while keeping an eye on the vessels coolant systems.Standard combat calls upon players in different ways, such as asking your teammates to provide diversionary tactics so that you can repair your mech (known in-game as a Vital Suit). With player-based strategies tied to almost every combat scenario and gameplay mechanic, Capcom has created a co-op experience with a unique resonance that proves to be as engaging as Left 4 Deads survival tactics.The campaign follows a tight linear path, yet I found myself wanting to replay levels not just to relive an amazing boss battle, but to earn credits that I could deposit into a slot machine to unlock new weapons, abilities, emotes, and noms de guerre for my character. On top of this, performing well in a level raises your overall rank, a feat periodically rewarded with new armors. I found the character customization to be incredibly rewarding, almost addictively so. The hand cannon I unlocked became a point of jealously for my party, and my title Undercover Perv always brought a laugh from new players. With hundreds of items to secure, Lost Planet 2 is a game that I foresee being a part of my daily gaming rotation for a long time.The hefty reward system crosses over into the games competitive component. Player skill levels are gauged nicely through the ranking system, and the variety in maps and modes keeps this experience fresh. The games jumbo-sized weapons and mechs dish out highlight reel-worthy kills, and the map designs factor in both weapon types and teammate strategies. The low-gravity map needs to be seen by every multiplayer fanatic out there.With most of Lost Planet 2s weapons being bigger than the characters, the game offers a wallop with its gunplay and stands on its own as a respectable shooter. The gameplay mechanics are tuned nicely, allowing players to feel comfortable with the games wide variety of weapons and vehicles from the moment they are first introduced. The grappling hook makes a return from the first game, and while it is called upon often, it is never used for frustrating do-or-die vertical navigation. When stacked up against the original title, the gameplay is tighter across the board.While offering more monsters and bigger set piece moments, Capcom has also addressed the dullness of the human-against-human battles. Some of the firefights remain uninspired shooting galleries, and I would much rather battle a spastic monster than a motionless space soldier, but some of the human-based battles are among the games overall best.With faceless characters, a story that bounces confusingly from blizzards in the tundra to jet packing in outer space, and an ending that makes no sense whatsoever, the fiction mostly serves as a vehicle to show environment transitions. Playing Lost Planet 2 for the story is like going to a movie to watch the credits. If you go into this game, go into it with the intent of joining up with your friends to slay moon-sized monsters, and enjoy one of gamings top co-op experiences.", "date": "May 07, 2010", "grade": "8.5"}