{"name": "Iron Man 2", "ref": "https://www.gameinformer.com/games/iron_man_2/b/xbox360/archive/2010/05/04/sega-s-iron-man-stumbles-on-the-launch-pad-again.aspx", "text": "In the comics, Tony Stark constantly tweaks his Iron Man armor, making new and improved suits as his technology evolves. Its too bad Sega cant keep tweaking this game after its release, because while the series might be headed in the right direction, there are still loose parts under the hood.The story  a one-shot tale that sees Tony and Rhodey chasing down a stolen copy of the Jarvis AI  has a few cool moments, but most of them get diluted by low production values and terrible camera work. Likewise, much of the witty dialogue is trampled by bad Robert Downey Jr. and Scarlett Johansson impersonators.If you look beyond the awkward cinematics, youll find that the game is actually playable this time. The meat and potatoes is all about Iron Man and War Machine shooting mechs until they explode, and there is a certain mindless appeal to that. The flight controls have been simplified, so flying around is fun instead of making you curse the sky every time you lift off. Its too bad Sega wasnt able to include co-op, because the game dishes out a breed of mindless action that could be fun with a friend.Unfortunately, things fall apart whenever the mechanical duo enters an enclosed area. This incarnation of Iron Man isnt built for hand-to-hand combat, and his limited attack set and frustrating targeting system make it show. The developers must have also expected most players to have PhDs in engineering given the elaborate menu system you have to navigate to upgrade your weapons and armor. I cant even say anything exciting about the boss encounters, as most of them are pretty forgettable. Marvel fans might get a kick out of the appearance of Iron Mans famous foes, so I guess thats something.Superhero games are supposed to be power fantasies. So far, the Iron Man games havent done much to inspire my dreams, but at least theyre not giving me nightmares anymore. If Sega keeps tweaking the formula, next time it might actually convince me that its fun being Iron Man.", "date": "May 04, 2010", "grade": "6"}