{"name": "Nier", "ref": "https://www.gameinformer.com/games/nier/b/ps3/archive/2010/05/03/square-enix-embarks-on-an-adventure-to-nowhere.aspx", "text": "If you like wielding huge swords, exploring dungeons, and fighting monstrous bosses, youll find no shortage of games catering to your interests. The action/RPG genre is an old favorite among gamers, crowded with various heroes and legendary weapons. With such a broad array of peers, a successful action/RPG needs to stand apart from the herd; a cool setting to explore, unique combat mechanics, or the word Zelda in the title all do the trick. Nier lacks any of these distinguishing characteristics, leaving a generic-yet-functional journey from point A to point B with all of the spark and scenery of a trip through western Kansas.  The primary thrill in action/RPGs is gaining enough power to do things you couldnt do before. Whether youre accruing items that open up sealed locations or gaining new combat abilities, you should feel progressively more awesome the more time you spend playing. This is where Nier stumbles the most; it conveys no sense of growth. You hit the same buttons at both the beginning and end of the game, and magic attacks become more useless with each iteration. Technically, numbers on a menu screen prove that your stats are increasing, and that one weapon is better than another, but I couldnt feel any difference.Niers combat mechanics may be dry, but they still function within the games limited ambitions. Attacking, dodging projectiles, and spell casting are easy to accomplish, enabling you to mindlessly mow through most encounters. Given the low level of challenge, its surprising that you eventually gain two party members to assist you in combat. Dont worry about them stealing your kills, though; theyre idiots, only able to follow three basic commands buried in the menu system.While the gameplay landscape is sparse, Nier's post-apocalyptic world has plenty to offer. A thousand years after the human population is effectively wiped out, the remaining people are living a simple medieval existence, with former technological and architectural marvels standing as inert and overgrown monuments in the wild. Developer Cavia has wrapped a good story around this setting, using your main characters quest to keep his disease-stricken daughter alive as a vehicle to deliver a few surprising twists that leave you with a sense of the ruined worlds bleakness and desolation. While it goes off the rails a little towards the end, the tale is ultimately a satisfying one. Unfortunately, you cant just move through the plot quickly to get to the good stuff. Dozens of sidequests and upgradeable weapons are your most likely distractions, but they involve lots of backtracking and hours of grinding for rare materials. Even if you skip these diversions, youll still spend a ridiculous amount of time fighting familiar foes, running through the same handful of vast and boring areas, and revisiting dungeons youve already beaten. This level of repetition effectively kills the narrative momentum, bringing down the one thing Nier does well. With so many genuinely good action/RPGs that arent riddled with archaic missions and gameplay, I have trouble recommending Nier solely on the basis of a decent (but unevenly executed) story.", "date": "May 03, 2010", "grade": "6.5"}