{"name": "Super Street Fighter IV", "ref": "https://www.gameinformer.com/games/super_street_fighter_iv/b/ps3/archive/2010/04/26/review.aspx", "text": "When Capcom announced Super Street Fighter IV, many gamers were instantly reminded of buying multiple versions of Street Fighter II back in the early 90s. These fans complained that this new release was only an excuse to trick gamers into buying the same game twice. No matter how much skepticism its release has generated, Super Street Fighter IV includes far more content than any previous Street Fighter iteration.Whereas the SNES updates added only a handful of new characters each time around, SSF IV comes out swinging with 10 additions to the original SF IV roster. Of the new challengers, Juri is my personal favorite. She features multi-level projectiles, a punishing cartwheel kick, a sneaky air combo, and a brutal Ultra Combo. In terms of sheer weirdness, newcomer Hakan is the standout of the bunch. Hes a hulking, bright-red beast who refers to himself as the Oil King of Turkey. Almost all of his moves revolve around oil, including one attack in which he pours two bottles of olive oil all over himself. Its not just for giggles, however  the oil increases his damage and defense, and extends the reach of certain attacks like his oil slide.Not all of the extra fighters are brand new  several are veterans from Street Fighter III and the Alpha series. Fans of Adon, Makoto, and Ibuki will feel right at home thanks to how these characters are handled in SSF IV, with updated moves that feel faithful to their original incarnations. All of the playable characters, new and old, fit perfectly within Capcoms classic fighting universe and are welcome additions to the series rebirth.For all the praise Street Fighter IV received, one universal complaint revolved around how online play was structured. Modes were scarce, and the ranking system left much to be desired. A free DLC update didnt do much to remedy the situation, so a total overhaul has been introduced in SSF IV. Endless Battle is a new mode that allows several gamers to join a lobby and watch the action, and it operates on a winner stays system. If youre on a tear, you wont stop playing until one member of the lobby finally topples you (leaving you to sit back and watch the action until your turn comes around again). Team Battle allows you to pit two teams of up to four players against each other, and you can even set up lopsided 1 vs. 4 bouts if youre feeling particularly cocky. Standard ranked matches are always an option, and an enhanced Replay mode gives you the opportunity to study other world warriors tactics. Online play on the whole is far more robust in Super Street Fighter IV than it was in the original, and significantly increases the replayability.When it comes down to core gameplay mechanics, theres no denying that Super Street Fighter IV resembles the original in almost every way. However, the numerous new characters and greatly improved online options make the game worth a purchase regardless of whether or not you owned IV. Capcom has said all along that there was simply too much content here for it to be released as DLC, and my time with the game has convinced me of this. I put nearly 100 hours into IV, and I can easily see myself pumping dozens more into this update. If you havent played IV at all, then $40 is an absolute steal for the ultimate version of the best fighting game in recent memory.", "date": "Apr 26, 2010", "grade": "9"}