{"name": "Monster Hunter Tri", "ref": "https://www.gameinformer.com/games/monster_hunter_tri/b/wii/archive/2010/04/22/review.aspx", "text": "Monster Hunter Tri should be a terrible game for a variety of reasons. Most of your time is spent in awkward combat plagued by spotty collision and no way to lock onto your enemies. Managing your massive inventory of weapons, potions, food, bugs, and more is crucial to success, yet the item management system is cumbersome and poorly explained. Load times abound throughout the confusingly laid-out hunting grounds. Despite all of these significant setbacks, Monster Hunter Tri offers numerous moments that lend insight into why its such a sensation overseas. You wont get very far into Monster Hunter Tri without patience, as the first several hours are tedious and uneventful. Once your unnamed protagonist learns the ropes of forging weapons and armor, farming, combining items, and other inventory-centric tasks, its time to head out to the hunting grounds.Charging into battle with abandon may get you through the early missions, but youll hit a brick wall once you encounter the more formidable foes. Repeated failure is almost required for many of these boss-like creatures, as learning their movements, attack patterns, and weaknesses is paramount to success. I often spent over 30 minutes attempting to take down a massive creature, only to fall at its feet for the second, third, or fourth time. Each time you fall, its another chance to more adequately prepare for the battle ahead. Its smart to head back to the drawing board and put away all the items that didnt work, only to grab a handful of new toys that might fare better in taking the beast down.Being bested by the same monster time and time again can be immensely frustrating, especially after youve spent the better chunk of an hour taking him on. However, its genuinely rewarding when you finally prepare for the bout perfectly, striking down the beast with a deadly combination of tactics, weapons, and gear.The thrill of victory is even sweeter when you share it with friends. Thanks to the hassle-free online experience (no Friend Codes!), its easy to assemble a team of four players and teach some monsters a lesson. With a new hub city and the same quest structure as the single-player game, this co-op option adds significant replay value. If you can look past the archaic game mechanics and have the patience to trudge through the early missions, Monster Hunter Tri offers a lengthy and rewarding experience like nothing else on the Wii.", "date": "Apr 22, 2010", "grade": "7"}