{"name": "Deadly Premonition", "ref": "https://www.gameinformer.com/games/deadly_premonition/b/xbox360/archive/2010/04/16/amazing-coffee-questionable-gameplay.aspx", "text": "Back in high school, my friends and I had a tradition. Whenever the local video place got a new survival horror game for the PlayStation, wed rent it and blast through as much as possible in a single weekend. Resident Evil, Silent Hill, Dino Crisis, even the Clock Tower series -- we savored every moment of these campy classics. Deadly Premonition feels like a lost gem from this era, a game that could easily blend in with the list of survival horror mainstays above. But that praise comes with an equal measure of good and bad. Deadly Premonitions quirky story, fascinating cast of characters, and lengthy playtime is hamstrung by sub-par graphics and gameplay design straight out of the late 90s.The Twin Peaks-inspired plot begins with FBI agent Francis York Morgan (call him York; everybody does) arriving in the small Washington town of Greenvale to solve the murder of a young girl. The Lynch-isms dont stop there. Deadly Premonition is full of callbacks to the 90s TV classic, from Yorks obsession with good food and coffee (which also tells his future) to frequent dream visits to a strange red room with characters who make cryptic references. Being familiar with Twin Peaks isnt necessary to enjoy Deadly Premonitions oddity, but it sure helps. When not interacting with the colorful townsfolk or stumbling through an enjoyably baffling dream sequence, York gets transported into a nightmarish alternate version of small-town locales such as a hospital, a lumber mill, and a police station. Heres where the game quickly becomes questionable. York uses a mix of guns and melee weapons to fight through an army of bizarre and disgusting zombie-like creatures. Get too close to one variety, and it will attempt to shove its arm down Yorks throat. Other enemy types fight with more traditional means, wielding shotguns or crowbars. Whatever the opponent, your biggest obstacle is movement, which is only slightly more responsive than the tank controls of old-school Resident Evil. The awkward aiming doesnt fare much better, requiring you to hold down the right trigger to draw your weapon and press A to shoot. Add in bland level design and occasional highly frustrating quick-time events, and you may find yourself struggling to get through the combat sequences. On the brighter side, these areas also have you hunting down clues to the identity of the murderer, allowing York to piece together answers bit by bit.How rare and refreshing, though, to encounter a game where the stuff around the combat is the highlight rather than the combat itself. In-between the linear gunplay segments, Deadly Premonition turns into an open-world game, allowing you to explore the town of Greenvale at your own pace, follow citizens through their daily schedules, and take on side missions for bonus rewards. Want to peek through windows at the local diner and watch the eccentric wheelchair-bound millionaire eating lunch? Do it. Want to run around for days until Agent York has grown a full beard and is followed by a cloud of flies from his unchanged clothes? Totally possible. Just be sure to make time for a few of the sidequests, as they reveal backstory that gives characters an added layer of depth and provide York with a few tools that make the annoying parts of the game exponentially easier -- a radio that allows instant teleportation to previously visited locations and a collection of infinite ammo guns. Let me be as clear as possible: Deadly Premonition is not what most gamers would traditionally call a good game. Its incredibly flawed in areas that some consider core to the gaming experience and requires patience to persevere through the problems and get to the best moments. But for everything it lacks, it transcends the stigma of a budget title. If youre looking for a strange but nonetheless unique experience, Deadly Premonition may satisfy an itch you didnt even realize you had.", "date": "Apr 16, 2010", "grade": "7.75"}