{"name": "Don't Starve: Shipwrecked", "ref": "https://www.gameinformer.com/games/dont_starve_shipwrecked/b/pc/archive/2016/04/05/dont-starve-shipwrecked-game-informer-review.aspx", "text": "Shipwrecked brings a tropical flavor to Dont Starve, Klei Entertainments difficult survival sim. The expansion sends protagonist Wilson (or any of the series unlockable characters) to a tropical area instead of the backwoods. For fans of the core game and its first expansion, this DLC from Capybara Games adds a ton of new items and recipes to uncover, as well a neat seafaring mechanic. However, at the same time, Shipwrecked feels like a wasted opportunity to fix the base games issues.Like Dont Starve, its an unfortunately common experience to spend the first hour or so of a session searching for materials that you need to craft basic items necessary to your long-term survival, like flint or gold. In these instances, players arrive at a point where they know what to do, but arent given the essentials necessary to do it. Shipwrecked has a mutator slider so you can adjust how often resources appear in the world to make it more likely that youll find vital resources. Messing with these options felt like cheating to me, so I let the world randomly generate  and I died around the one-hour mark each time. Once I tipped those sliders slightly in my favor, I started to have a consistently enjoyable experience.To be clear: I still died a lot, and often embarrassingly, like that time I was eaten by hounds. Dont Starve is a brutal game, with you losing all your progress whenever you die. Sometimes that might mean minutes, other times it could be hours. Shipwrecked sessions, like Dont Starve, dont end until you die. While that challenge will appeal to players who love diving into wikis and mastering games through failure and repetition, the lack of any sort of conventional endgame is a bummer. Shortly after youve learned how to craft items and mastered the wilderness, everything starts to feel like busywork rather than an engaging or entertaining game.However, before that point, Shipwreckeds additions are often amusing. The tropical setting is more impressive-looking than the core games forest areas, and I found a Robinson Crusoe-esque joy in building rafts and boats and sailing around. Weapons like poison spears and harpoons also spice up your arsenal in a goofy way, while seasonal additions bring new dangers, including monsoons that can drench you and your equipment. All these additions dont shift the core game into a dramatically different experience. They are the sum of their parts, resulting in more Dont Starve.As someone who had a strong but brief fascination with original game when it was released, Ive always been looking for another reason to get hooked to Dont Starve again. Shipwrecked is not that reason. However, for those who love trying to best Kleis ruthless brand of survival simulation, this expansion brings enough new content to be worth a go, even if it doesnt take Dont Starve into uncharted territory.", "date": "Apr 05, 2016", "grade": "7.25"}