{"name": "Metro 2033", "ref": "https://www.gameinformer.com/games/metro_2033/b/pc/archive/2010/03/16/a-dreary-subway-ride-well-worth-taking.aspx", "text": "Having followed very little pre-release coverage for Metro 2033, my expectations going in were almost wholly based off one piece of info Id heard about Ukrainian developer 4A Games: The team was formed by devs who had previously worked on S.T.A.L.K.E.R.: Shadow of Chernobyl. Knowing that, I steeled myself for an open-ended shooter full of ambition and technical issues. The ambition is there in spades, but Metro 2033 is an impressively polished and extremely linear experience that makes for an excellent debut.Metro 2033 takes place in a post-apocalyptic Moscow, but you wont spend too much time on the citys bombed out, radioactive surface. The citizens of the fallen city have taken to the abandoned subway tunnels, and aside from a few excursions topside, most of your time is spent in these grimy passageways.If that sounds a bit cramped, the level design matches the premise perfectly. From the second you start the campaign, you follow a straight line to the finale with only a handful of opportunities to explore alternate paths or side missions. What a glorious straight line it is.In true Half-Life fashion, the linear level design is balanced by incredible set pieces that break up the regular pacing. Throughout your journey to save your home village of Exhibition, youll take control of turrets in tense defense scenarios, sneak aboard a Communist tram, experience strange hallucinations, and more. In one particularly memorable sequence, you must carry a little boy on your shoulders through a section of the tunnel, an act of bravery that causes your movement and aiming to be compromised for a brief but enjoyably challenging stretch.Half-Life 2 may be the perfect point of comparison to Metro 2033. Like Gordon Freeman, mostly silent protagonist Artyom is often joined by invincible AI partners. And like Valves classic FPS, the gunplay isnt the star so much as the fascinating world built around it. You can look down ironsights like in a Call of Duty game, but the aim snaps to enemies quickly and most of the battles devolve into taking down enemies as quickly as possible instead of taking strategic positions. A handful of levels allow for stealth solutions, but it's so easy to run and gun through bandits and soldiers that only the most obsessive Achievement hunters will want to move through without getting caught.The games eight to ten hours are spotted with stops at some of the communities struggling to survive underground after a vaguely described nuclear apocalypse. These small villages may be near extinction, but their few inhabitants are unique and often partake in fascinating dialogue that fleshes out the world. Friendly humans are matched by an impressive array of opponents, both natural (remnants of Communists and Nazis warring for territory) and supernatural (including the werewolf-esque nosalises and slimy amoebas). One of those supernatural forces, the Dark Ones, has threatened your village, which forces you to head out and search for protection.If you can survive all the obstacles and find what you need to save your home, the game delivers a fantastic climax, lifting you out of the subways and above the city for a surprising final mission. Very little incentive is offered to replay the game, but the core experience is awesome enough to warrant checking out.One downside to the game is a much-touted unique feature that isnt fully developed: the ability to use bullets as currency. The weapon selection is a very standard set of pistols, shotguns, assault rifles, and sniper rifles. Though you can buy gun upgrades (scopes, silencers, etc.) and items (med packs, body armor), I rarely found myself willing to spend ammo instead of hanging onto it for later; vendors simply didnt carry interesting enough stuff to make me conflicted.Despite those nitpicks and a couple frustrating late-game sections, Metro 2033s greatest success is the consistency of its pacing. Youre constantly encountering new factions, discovering interesting new locations, or being tasked to do something you havent done before. With this stellar first effort, 4A Games has handily risen above its teams past efforts in terms of approachability and fun, if not innovation. Metro 2033 is almost certainly destined to be a cult hit. If you enjoy single-player shooters, you owe it to yourself to get in on the (below-) ground floor.", "date": "Mar 16, 2010", "grade": "9"}