{"name": "God of War III", "ref": "https://www.gameinformer.com/games/god_of_war_iii/b/ps3/archive/2010/03/08/kratos-brings-down-the-mountain.aspx", "text": "Words like visceral and brutal are used to describe many violent games these days, but they wield the fullness of their meaning in God of War III. No other terms so completely convey the gut-wrenching sensation of eviscerating a mythical beast, decapitating a deity, or carving up a titan. While moments like these have defined Kratos over the years, God of War III isnt amazing just because its violent; its amazing because it conveys these experiences in ways you have never seen before. Kratos stylishly elaborate combos and vicious context-sensitive kills have been adapted and emulated many times, making the video game landscape a bloodier and more epic place. In the years since God of War II, while others were chasing the shadow of Kratos fighting style, the team at Sony Santa Monica was elevating the scale and intensity to a level that once again proves Kratos is the undisputed king of the genre.Something awesome is constantly happening in God of War III. Monsters slink from the shadows, titans break through walls, and gods launch divine assaults  and its all woven seamlessly into the gameplay. Just when you think you know whats coming next, youll encounter a unique sequence or mechanic  if only to be used once  just to keep the experience fresh. Even the context-sensitive kills take on a new cinematic life, especially during the grisly deaths of the bosses (each of which will leave you picking your jaw up off the floor).God of War III recaptures the one thing that God of War II was missing for me; it forced me to once again reconsider what I thought was possible for a video game to accomplish. Im hesitant to ruin any of the moments here (spoiler: Kratos kills a lot of dudes), but let me put it this way: Remember the fight against the Colossus of Rhodes at the beginning of God of War II? At least three moments are just as astounding in God of War III, with cinematic camera work even more impressive than Naughty Dogs feats with Uncharted 2.God of War III takes the biggest strides forward in its cinematic presentation, but the nuts and bolts of the combat are also more refined. If youve played the previous games in the series, youll find everything you love about Kratos blade-slinging style intact, but even better than before thanks to the seamless integration of items. This new equipment (usually ripped from the dead fingers of a fallen adversary) allows you to dash, stun enemies, and perform ranged attacks  and they all draw from a rapidly recharging power source. This gives you the freedom to use these versatile tools instead of conserving them, opening new combo possibilities. Used in conjunction with the sweet new weapons (I love the Cestus!) and maneuvers (I love the ranged grab!), these additions make Kratos feel like an even more fluid and capable combatant.The only area where God of War III didnt blow away my expectations is the story. Previously, Kratos was driven by a thirst for vengeance against a single target  a concept that kept the narrative focused. In God of War III, that singular purpose is diluted by the number of characters, agendas, and objectives on the playing field at once. The plot isnt bad or difficult to follow, but it also doesnt have any standout revelations or developments; Kratos hunts down the gods, kills them, and steps over the corpse to reach his next target until Olympus is in shambles. It isnt a major problem, however, because the real joy isnt in the events themselves, but rather in the astonishing ways those events unfold.The fury, destruction, and murdered gods  its all been leading up to this. When I first took up Kratos blades back in 2005, I thought I was embarking on a simple quest for vengeance. After leaving a trail of bodies spanning four games and three systems, that quest has finally reached its end. Not even in my wildest dreams could I have imagined such a powerful, cinematic, and breathtaking conclusion to the saga of the Ghost of Sparta.", "date": "Mar 08, 2010", "grade": "10"}