{"name": "Sonic & Sega All-Stars Racing", "ref": "https://www.gameinformer.com/games/sonic_amp_sega_all-stars_racing/b/ps3/archive/2010/02/23/review.aspx", "text": "Some say that landing second place in a race is simply being thefirst loser. When youre Sonic the Hedgehog, however, ranking rightbehind your long-time rival after over a decade of poorly receivedtitles is a big achievement. Sonic & Sega All-Stars Racing is ablatant Mario Kart rip-off, but the hedgehogs emulation actuallyexecutes parts of the kart racing formula better.Ill spare youon the specifics of the gameplay because youve done it all before.Firing power-ups, nailing boosts, and drifting around corners are easyto do with the games simple, tight controls. Where Sonics racingbreaks from the pack is in its creative level design. These tracks arepacked with ludicrous jumps, destructible environments, and hazardssuch as robotic crabs. Cruising around the glitzy casino courses andgorgeous Sonic Adventure areas puts other arcade racers to shame.SonicRacing offers a ton of choices when it comes to characters. Problem is,most of them suck. Sega even called in backup from Rare withcelebrities Banjo and Kazooie (360 exclusive) to pad out the lackingroster, but that wont stop you from groaning at the sight of Shadowthe Hedgehog or Billy Hatcher. However, bowling through the likes ofDr. Eggman, Alex Kidd, and Ryo Hazuki as a powered-up Super Sonic isredeeming.Whether playing online or via four-player splitscreen,Sonic Racing is best enjoyed with friends. Racers tired of hasslingwith friend codes and waiting five minutes to get a race going willlove the games breezy online setup. Once youre in a game, SonicRacings welcome battle modes, such as capture the chao (flag) andchaos emerald collection, offer variety to otherwise by-the-numberscombat.Despite being a solid kart racer, Sonics new ride isntwithout its share of flat tires. While the game contains a ton of funand engaging tracks, more theme varieties outside of the Dreamcast-eratitles would have been nice. Many courses fall victim to their ownextravagance, with some tricky turns being poorly indicated. Having avariety of cars, winged craft, and motorcycles is nice, but giving theplayers the option to choose from multiple carts for a given racerwould lend the game some much needed variety. If you want to ride a hog(no pun intended), for example, youre stuck looking at Shadow.Sonic& Sega All-Stars Racing polishes the fundamentals of kart racingwithout adding any stupid gimmicks. If youre looking for the next bigthing in wacky racing games beyond a capable online framework, dontlook here. If youre looking for straightforward Mario Kart clone witha glossy Sega veneer, then this game is for you.", "date": "Feb 23, 2010", "grade": "7.75"}