{"name": "Risen", "ref": "https://www.gameinformer.com/games/risen/b/xbox360/archive/2010/02/23/review.aspx", "text": "I love the PC version of Risen. In many ways, it's the game that I've been waiting for Gothic creator Piranha Bytes to make for years. It's undeniably European, and may turn some gamers off with its unpredictable difficulty and general disregard for player convenience. It's also relatively polished, toning down the design's ambition to reasonable levels and immersing players in an internally consistent fantasy setting as well as any game to date. This tale of an ancient power waking under the earth, the struggle of two factions, and the little people of society trying to deal with it, is a treat to explore. Charting your shipwrecked castaway's path through the world is as entertaining as it is unlike the genre-standard clichd ragtag group of unlikely heroes saving the world.This port's technical execution is the biggest barrier to enjoying Risen's excellent world. The downgraded graphics I can handle; I'm not going to get up in arms over bad textures on cave walls or flat, plastic-looking skin on character models. The fabulous attention to detail is still here, with handcrafted clutter creating a cohesive illusion that you're exploring spaces that people live and work in. Some of the neat full-screen effects like HDR lighting are lost, which is a bummer since they add to the game's fantastic ambience, but it's still a cool world to explore.Likewise, a decrease in texture depth does nothing to dim the brilliance of the complex web of relationships that defines the inhabitants of Risen's isolated island. The developers did a superlative job making sure that the decisions you make and the conversations you have make a real impact on the world and on the progress of the story. Running into a character whom you interacted with hours ago and seeing how your choices have affected his situation makes this a true role-playing game, rather than a series of pre-rendered movies broken up with dungeon crawls and boss fights.What I cannot condone are the frequent jarring stutters that throw off combat timing and ruin the sense of immersion the game works so hard to import. These half-second screen freezes come up often enough to have a noticeable effect on overall gameplay. Risen's combat consists of little more than timing your strikes well, and this problem brings the whole system crashing down. It's not so broken as to be unplayable, but you'll eat a fair number of cheap deaths and frustrating reloads due to this glitch.Combat isn't the be-all and end-all, though. Risen excels when you're exploring, chatting with the hundreds of NPCs, and adding your own touches to the developing storyline. Struggle through the admittedly bad third-person action, and you'll find a role-playing experience well worth your time. But I won't blame you for not being willing to put up with this shoddy technical execution when there are so many great RPGs out there, either.", "date": "Feb 23, 2010", "grade": "7"}