{"name": "Aliens vs. Predator", "ref": "https://www.gameinformer.com/games/aliens_vs_predator/b/ps3/archive/2010/02/16/review.aspx", "text": "Alien came out in 1979 and almost single-handedly defined sci-fi horror. Predatorreleased in 1987 and re-envisioned monster movies, creating a newterror for twelve-year-olds to obsess over. This year Rebellionreleases Aliens vs. Predator for home consoles, and like an antithesisto Reeses Peanut Butter Cups, it proves that two great flavors dontalways taste great together.Set after the events of Alien 3, a group of scientists onplanet BG-386 begins breeding Xenomorphs for war. A war party ofPredators learns about these experiments and decides the best thingthey can do for the universe is to travel to BG-386 and put a stop tothis bad idea by wiping out the colony. Players play through threedifferent campaigns, each one telling a different side of the samestory. This may sound like a lot, but since all three campaigns reusethe same levels they feel a bit repetitive.Each campaign also contains its own special set of problems. Thehuman marine section is set up like a survival horror FPS. There are afew good scares within these corridors, but after getting locked insidea room and having to fight off a horde of Xenomorphs for the 100thtime, the repetition drowns the experience. It doesnt help that thecontrols feel clumsy; your crosshairs have no auto-aim grip when theypass over an enemy. The levels are far too linear, and after doing onegofer mission after another you begin to forget why youre on thisgod-forsaken planet in the first place. You can use flares toilluminate the games overtly dark corridors, but a decent flashlightwould have worked better in a firefight. Unfortunately, your flashlightis about as useful when lighting up dark corners as a laser pointerwould be when reading a highway road sign.The Predator sequences put you behind the heat-visioned stare of ayoung hunter trying to prove himself to his clan. I had fun using thePredators iconic arsenal. The shoulder mounted Plasma caster turnsXenomorphs into piles of acid in no time, but that overpowered piece ofhardware is justifiably reined in with limited ammunition. Instead, thePredator campaign maintains a heavy stealth focus, which would be greatif it werent for the limited melee combat and linear level design. Itseems like there is often only one right way to approach a situation,and this leads to frustrating, slow progress.The Alien campaign plays like a combination of the other two. Likethe Predator campaign, it has a stealth focus, and like the marinecampaign, it sucks. As an alien bred for war, you fight your way out ofcaptivity, eviscerating marines trained to ignore strange sounds andforget about missing allies. Xenomorphs are supposed to be thedeadliest creatures in the universe, but considering how many times youhave to slash at these wimpy scientists before they fall over, youdthink you were tickling enemies to death. The breeding experiments musthave resulted in a weaker strain of Xenomorph, because these aliensseem highly vulnerable, lacking much of the power and terror theypossessed in the films. Worst of all, the Xenomorphs ability to walkon walls makes navigating the world a disorienting affair. Its fun todrop down on your enemies from above, but its far too easy too losesight of your target and end up turning a corner and walking right intoa gun muzzle. Your biggest battle in this campaign will be fighting offmotion sickness.Multiplayer is the closest thing AVP has to a saving grace. Somegamers might appreciate how all three races can go head-to-head in thegames deathmatch and CTF-like matches. Predators can reach areamarines cant, while aliens can be crafty by hiding in the shadow butare no match for their foes in hallway battles. Unfortunately, many ofthe single-player problems  such as the frustrating alien controls andPredators sloppy fisticuffs  carry over online as well. Not tomention, most of the multiplayer maps are cannibalized from thesingle-player campaigns. The only two multiplayer modes that stand out are Infestation andPredator Hunt. Predator Hunt pits one Predator against a team ofmarines. It offers slower, more strategic hunter/prey scenarios, anddoes a better job at showcasing the Predators unique talents than thesingle-player game ever does. Infestation takes a group of marines andpits them against an alien. As the alien kills the marines they getconverted to more aliens, and the remaining marines have to worktogether to survive. Holding out as the last marine is nearlyimpossible, but its exciting to try. Curiously, Rebellions 1999 PC release, Aliens vs. Predator, waswell received, but this update captures none of that games uniquespark. Instead we have a title trying to live off the fumes of twodormant franchises.", "date": "Feb 16, 2010", "grade": "5.75"}