{"name": "Divinity II: Ego Draconis", "ref": "https://www.gameinformer.com/games/divinity_ii_ego_draconis/b/pc/archive/2010/01/13/review.aspx", "text": "Combat and character development separate role-playing games fromthe adventure genre. Divinity II: Ego Draconis would have been betteroff as an adventure game. Its world and background fiction aretop-notch, expertly fleshed out by dozens of in-game books andextensive voiced dialogue. The third-person action, on the other hand,is designed and implemented so poorly that every encounter is a chore.Thecare poured into the setting is evident in the art as well as the rich,detailed fiction. The extensive world is crammed full of littletouches, from skeletons jutting out of ancient cave-ins to bloodstainsin a torture chamber that horribly detail the order in which thedevices were used. Every house, every mini-dungeon, and every abandonedshrine in the wilderness has its own story. The game does a fantasticjob of not holding your hand and letting you explore on your own terms.This strikes a great balance between the large but often soullessexpanses of Oblivions Cyrodiil and Dragon Ages small but meticulousareas.The price you have to pay to take in these wondrous sightscan be steep. The hack n slash combat is little more than hammering onyour primary attack while interjecting special moves when theyre offcooldown. Youll spend the majority of your combat time locked intoanimations. Balancing is completely off; every boss fight I came acrossrequired several reloads to pass. One boss could consistently two-shotmy character with a bow  and thats with all my stat points spent onranged defense and hit points! Combat isnt tactically interesting,either. Youll most likely use between two and five abilities for theentire game.Turning into a dragon has been touted as a bigselling point, but it results in gimmicky one-off sequences rather thana revolution in the gameplay. Likewise, customizing your own BattleTower to serve as a home base ends up being little more than aconvenient collection of vendors. Building your own undead creaturefrom the body parts of fallen foes is neat, but nowhere near enough tosalvage the combat from mediocrity.Divinity II isnt without itscharms, but weak game design sullies the thrill of digging into themany secrets of its outstanding world.", "date": "Jan 13, 2010", "grade": "7"}