{"name": "Final Fantasy Crystal Chronicles: The Crystal Bearers", "ref": "https://www.gameinformer.com/games/final_fantasy_crystal_chronicles_the_crystal_bearers/b/wii/archive/2009/12/29/spinning-off-in-bad-directions.aspx", "text": "And you thought Dirge of Cerberus was stupid! The Crystal Bearers isthe worst game I have played that bears the once sacred Final Fantasyname. Despite the series reputation, dont believe for a second thereis anything remotely role-playing about Crystal Bearers; it is ageneric action game through and through, with a few Final Fantasymonsters tossed in to lure unsuspecting fans. I had high hopesgoing into this game. I wasnt a big fan of the previous CrystalChronicles entries, but I thought that moving away from the co-opcentered gameplay toward a single-player, story-driven experience wouldput Crystal Bearers in territory where Square Enix has more expertise.Instead, players get a mishmash of awful mechanics delivered alongsidea predictable and obvious story.The worst of it comes in combat,where players are tasked with targeting objects and enemies andflinging them around using telekinetic powers. Thanks to theimprecision in registering motions, you can never count on your actionsbeing interpreted properly. When I managed to grab a rock and throw itat the enemy I intended, it felt more like luck than skill. Rather thanwrestle with this problem, the development team just decided to makeeverything painfully easy, removing the challenge altogether. This alsoholds true during occasional minigame breaks, where you do things likefly airships and surf down tunnels. You cant fail these events, butthe game keeps track of your times so you can (ugh) go back and try tobeat your score.I wish I could say that the story makes thesuffering worthwhile, but that would be a dirty lie. After a coolintroductory sequence, things go downhill immediately. Players willhave the whole plot figured out light years before the moronic maincharacter, and every member of the supporting cast got on my nerves.The dialogue is particularly heinous, with stilted and wooden exchangesthat make you wince every time anyone opens their mouth.To itscredit, Crystal Bearers hits its target graphical style dead on, withcool character designs and a world that fuses fantasy and technology invisually interesting ways. Unfortunately, you would actually have toplay the game to enjoy the art, and that is something I just cantrecommend to anyone.", "date": "Dec 29, 2009", "grade": "5.5"}