{"name": "The Legend of Zelda: Spirit Tracks", "ref": "https://www.gameinformer.com/games/the_legend_of_zelda_spirit_tracks/b/nintendo_ds/archive/2009/12/07/spirit-tracks-review.aspx", "text": "Ill just come out and say it: Spirit Tracks is my least favoriteZelda title yet  and this is coming from someone who fell in love withWind Waker, the Zelda game most commonly cited as the series lowestpoint. If youve made the unfortunate misstep of riding a train acrossthe United States, youll have a good idea where this game goes wrong.On the railway, Links adventure embraces lengthy stretches ofcountryside travel with little in terms of action or variation. Youreprobably saying, this is exactly what I hated about Wind Waker andPhantom Hourglass sailing segments. Thematically they are similar,but the sailing retained the series thrill of exploration  allowingplayers to veer off of the beaten path to explore any nook and cranny whereas the train is railroaded into predetermined paths. Thislinearity removes exploration from the Zelda equation, making the worldand progression feel as sterile as moving from world to world in aMario game.The train does offer a few standout moments,primarily a clever spin on the series trademark Lost Woods. Thetrains touchscreen controls are nicely designed, allowing players toplace precision cannon shots while keeping tabs on speed and trackswitching. You can also lay on its horn as much as you want  somethingI would rightfully abuse on a real train. While showing just a hint ofpromise, the train doesnt fit with the Zelda formula. When its inplay, it saps this journey of its excitement and wonder.When theconductor hat is thrown to the side, Nintendo shows us that it hasntlost a step in dungeon and puzzle design. Once again, Links stapleitems  the boomerang, bombs, etc.  are used in ingenious ways. Iespecially love how the boomerang channels elemental properties.Moreover, many of the stumper puzzles require a fair amount ofon-screen note taking, and are unlike any riddles in any other Zeldatitle.Adding Princess Zelda as a controllable character furtherenhances puzzle and dungeon complexity. Players control the princess bydrawing her movement paths. This can be as simple as weaving in and outof geometry to avoid tripping a trap, or can be as complex as havingher flank an enemy and attack from behind as you distract it with Link.Occasional pathing issues lead to her getting stuck on geometry orstopping in her tracks, but she does comply without error most of thetime.Links obsession with the worst music instruments in theworld continues with the introduction of the pan flute. Thefunctionality of this device couldnt have been better, as you play itlike a real flute by blowing into theDSs mic to activate specific notes. Unlike Wind Waker, this instrument is usedsparingly, mostly when you see visual clues.The stylus-basedcombat is identical to Phantom Hourglass. Sometimes it feels great,allowing you string together a flurry of attacks from enemy to enemy.Other times, the slightest miscalculation in your touch leads to Linkrolling off a cliff or running into fire. It hits more than it misses,but I still dont understand why Nintendo doesnt include a standardcontrol option for people, like myself, who would prefer to play itlike a traditional Zelda title.Narrative-wise, Spirit Tracksderails in a peculiar way. The initial story set-up is good. The newantagonist, a smarmy chancellor that youd think was plucked fromGeorge Lucas trade dispute stories, is only on screen for a fewseconds before you want to whack him with your sword. Mysteries tied toHyrules past and the train tracks keep you engaged, and the breadcrumbtrail of answers is nicely paced from start to finish. The problem istied solely to Princess Zelda. Now that shes at your side for anentire adventure, she essentially becomes your narrator. Her bubblypersonality isnt what I expected. She comes across more like ateenage-angsty Hannah Montana than the calm-yet-troubled princess Iknew in previous series iterations. Place her rambling tantrums next toLinks inability to do anything other than sigh, and the adventure isfurther taken off course. Multiplayer, while fun, doesnt offer enough depthto bring me back.In my tenure as a game critic, I haventcome across a game that fluctuates between highs and lows as frequentlyas Spirit Tracks. I often found myself taken aback by an amazingpuzzle, only to be bored to death on a train moments later. Even thoughthe path is rocky, this is still a good game. Fans shouldnt be afraidof it. The train segments could use a shot of adrenaline, and Zeldaneeds to shut her trap, but the puzzles and dungeons retain the classiccharm that keeps us coming back for more.", "date": "Dec 07, 2009", "grade": "8"}