{"name": "King's Bounty: Armored Princess", "ref": "https://www.gameinformer.com/games/kings_bounty_armored_princess/b/pc/archive/2009/11/24/review-kings-bounty-armored-princess.aspx", "text": "Before playing Kings Bounty: Armored Princess, Id have called you a dirty liar if you told me a second-tier Russian company buying the rights to the classic title would result in a great game for Heroes of Might & Magic fans. Im ecstatic to be proven wrong. This title is a solid followup to last years under-the-radar Kings Bounty: The Legend, tweaking many things for the better and providing a fabulous setting in which to adventure. The turn-based tactical combat is as entertaining as anything HOMM ever did, and exchanging that series empire building for a single-hero RPG-like approach works better than expected.From your humble beginnings as the god-sent princess of a fantastic kingdom, youll slowly become the kind of world-dominating conqueress that sends brutal usurpers running in fear. Adventuring through the games many unique continents reveals enough quests, monsters, treasures, and secrets to make a Baggins blush. As your princess grows in experience, she gains the ability to lead more powerful troops and grant better bonuses to them in combat. Each level also grants a certain number of runes, which can be spent to advance along three parallel skill trees. You can customize your progression along the Might, Magic, and Mind paths to become a mighty warrior, wise leader, skilled mage, or some combination thereof. Every choice you make impacts your battle strategies, as well as how you build your army. Magic-focused characters can make exceptional use of troops with unusual powers or disabling attacks, whereas emphasizing martial prowess allows you to dominate battlefields with beefy melee troops.Combat is a carbon copy of HOMM, with a few additions. Troops take actions according to their initiative, moving along a small hex grid as they bite, shoot, immolate, and otherwise assault the enemy. The princess (and her enemy, if shes facing an army led by an opposing hero) can cast a single spell per round, ranging from simple protective wards to army-incinerating fireballs. The big twist here is the Rage system. As blows are exchanged, the rage meter fills. Your pet dragon (who has been leveling alongside you the whole time) can consume that rage to unleash awesome powers. Depending on how youve customized its abilities, the dragon can build walls, drop eggs that hatch into huge troops of disposable allies, or even raise volcanoes to burninate your enemies. Using your armys special abilities, spellcasting, and rage effectively in concert is necessary to overcome Kings Bountys significant challenges.This surprising title does so many things right that its easy to forgive its minor flaws. A few gems of clever writing peek through in the story, but the plot is often conveyed in dry text boxes and hackneyed prose. Some battles feel similar to one another, leading to unpleasant dj vu as you crush one encounter after another using the exact same tactics. I appreciate the encouragement to fight efficiently and minimize attrition, but no matter how strong your strategy is, youll regularly have to run back to town and replenish your depleted army. Still, in the grand scheme of strategy gaming, the tedium Kings Bounty subjects its players to is well within acceptable limits.This is the latest example of the European development community stepping up its game as American PC studios flock to consoles on a seemingly daily basis. Complain all you want about Rage or Call of Duty relegating their PC versions to second-class status. With outstanding creative titles like this coming from the most unexpected sources, I wouldnt trade my PC for anything.", "date": "Nov 24, 2009", "grade": "8.75"}