{"name": "Tony Hawk: Ride", "ref": "https://www.gameinformer.com/games/tony_hawk_ride/b/ps3/archive/2009/11/18/review.aspx", "text": "Im pretty good at Tony Hawk: Ride. I dont want to brag or anything, but I scored like 53,000 points in the halfpipe on my first try. How did I do this? Not too sure exactly, but it happened. For better or for worse, this seems to be a standard experience in the new skateboarding title from Activision. Just when I thought I was starting to master a certain mechanic, the inconsistent gameplay inevitably turned each session into whirlwind of tears and frustration. While the skateboard-as-game-peripheral idea may have sounded like a hit on paper, the truth of the matter is it doesnt translate into the real world.Starting a game of Ride feels pretty familiar. Players begin their careers creating a new custom skater from a set of templates, which they can then edit at any time. The standard fare of unlockable items is present, so a skater can eventually be decked out from head to toe in custom gear. Like many Tony Hawk games before it, Rides main character is an up-and-coming pro that hangs with the best of the best in skateboarding  P-Rod, Stevie Williams, and even the Bird Man himself. Traveling to six cities along the path to stardom, each destination contains around four areas to ride. These are broken down into speed, trick, and challenge runs, with the occasional special event like a competition or demo. Upon completion, players get points towards clearing out an area to unlock the next. Its a fairly short, linear career that could easily be taken down in a day.Many perceive Tony Hawk: Ride as a skate game on rails, which is true for the easier difficulty settings. The player chooses a path based off of on-screen arrows and a yellow path. At any given time, there are up to three choices when the path branches and different lines are created. Choosing a line without the game changing its mind on you requires an uncomfortable, awkward lean either forwards or backwards. It rarely goes as planned.Id like to point out that the $120 price point for this plastic skateboard is more than twice as much as a real skateboard complete with all of the fancy trimming like trucks and wheels. The controller has a bevy of embedded sensors that try to determine what actions the player is attempting. Steering and ollies use accelerometers, while grabs use visual sensors. Advanced tricks like 360 flips rely on both types of sensors simultaneously. The build quality is surprisingly high, and for the most part these sensors work pretty well. Unfortunately, your intended actions ultimately get lost in translation.Since Ive been skateboarding for well over a decade, I thought I would have a leg-up on this game. Not so much. Flip tricks, one of the most basic skateboarding techniques, require the most advanced movement  popping the nose up and leaning forward or back. Clearly this was done to try and bridge the games control with real life movements, but your pissed-off ankles wont care after a few sessions. The only tricks that truly resemble real skateboarding are reverts and manuals. One of the big reasons most of the tricks in skateboarding work so well is because of forward momentum. With manuals this is especially true. While the stationary-friendly shape of the controller helps, manuals are still muscle-tightening battles with gravity. Play long enough and the cavalcade of confusion that your body goes through eventually turns into a strange, yet familiar awkwardness.Totally rad skaters can use the hardcore mode, which ditches the rails and lets you skate your heart out. Developer Robomodo added the ability to loosen or tighten the steering, but in the end, trying to skate a planned line requires so much focus and concentration youd be hard-pressed to find some fun along the way. Instead, the reward is usually a quick, painful faceplant into a wall.As a skateboarder and as a gamer, Tony Hawk: Ride is a curious idea but a letdown in practice. The huge level of frustration is not worth the time it takes to master the awkward gameplay idiosyncrasies. Instead, its more tempting  even as someone with experience  to just spam the waggle movements for a passable high score. With the huge price tag and uncertain future of software support for the peripheral, Activision has one of the toughest sells in video games in a very long time.", "date": "Nov 18, 2009", "grade": "5.75"}