{"name": "Call of Duty: Modern Warfare: Reflex", "ref": "https://www.gameinformer.com/games/call_of_duty_modern_warfare_reflex/b/wii/archive/2009/11/13/review-modern-warfare-reflex-review.aspx", "text": "After seeing this Wii port of the original Modern Warfare up and running on our giant television in the conference room, several editors independently dubbed it Modern Warfare: Gag Reflex. Many gamers shared a similar sentiment when the project was announced, complaining that the Wiis processing power simply couldnt handle a title as graphically intensive as this legendary FPS. While they arent wrong, they are missing a much bigger and more crippling problem: the Wii Remote. Make no mistake, Reflex is often times a downright ugly game. At its best, the graphics are passable  good even, if you include the caveat for the Wii. At its worst, Reflex would have trouble competing with an even mediocre FPS for the original Xbox. Playing the game side by side with the 360 version of Modern Warfare made me woefully aware of the visual chasm. Almost all lighting and shadows have been stripped from Reflex, as have a lot of graphical flourishes. In one mission, a security monitor your comrade tells you to watch  which is supposed to reveal an enemy fleeing the scene  just displays a static test pattern instead. Telling your allies from your enemies is harder than ever, because everyone looks faded and indistinct, as if they had been partially digested before being regurgitated onto the Wii.Still, Reflex proves a game as amazing as Modern Warfare is still good even without the flashy graphics; I dont question Treyarchs porting skills. Clearly, the developers were faced with a difficult decision; they could either alter the gameplay to fit the Wii by changing the missions and scaling down the original games vision, or they could strive to keep everything intact at the expense of how the game looks. After playing through the two versions together, I dont fault them for their decision; every skirmish is included, every square foot of terrain, every plot twist and line of dialogue. Nothing from the story was compromised, which is certainly a commendable feat.Treyarch didnt skimp on the multiplayer either, which ends up being the most impressive part of Reflex. While the action is limited to 10 players, the matchmaking works well and removes the need for annoying Friend Codes. The ranks, perks, and awards of Modern Warfare are all included, and are as addictive as ever. Youll find yourself saying just one more match again and again as you try to reach the next rank to unlock more guns, game modes, and challenges. Additionally, the subpar graphics matter even less during multiplayer the spirit of competition makes it enjoyable, and although Reflexs multiplayer cant compete with the originals online experience, it fills a massive void for Wii owners.The one Wii shortcoming for which Treyarch couldnt compensate is the controls  an ultimately fatal flaw. The problem is twofold: First, the Wii Remote doesnt have enough buttons. Even with the Nunchuk, the Wii Remote cant accommodate MWs complex control scheme, and when using the irregular controller as a pointer, the majority of its buttons are out of reach. Reflexive actions are ironically no longer reflexive, and trying to press the correct button to perform a melee attack or pick up and throw away an enemy grenade will often leave you staring at the ceiling, the ground  or just plain dead.Second, using the Wii Remote as a pointer for first-person shooters sucks. When playing an FPS with a traditional controller, the majority of the time your aiming stick is at rest  you make minor corrections via minute taps to control where you are looking. Conversely, the Wii Remote requires you to constantly aim at the center of the screen, lest your POV sways around like a drunkard falling off of a barstool. Rotating is performed by moving the cursor towards the edge of the screen, and although Treyarch included a handy button to freeze your view and aim as if you were playing a light gun game, the combination simply isnt an acceptable solution. Its clear that Treyarch did the best it could: the button configuration is completely customizable, as are the scrolling speed, dead zone, and numerous other variables for the camera. But after playing with all of them, controlling my character still felt like a struggle  a shame when the original MW controlled so smoothly. Even a clunky, hard-to-control Modern Warfare is better than no Modern Warfare, and Reflex may be fun for Wii owners who havent played  or seen  another version of the game. Ultimately, however, Reflex is proof that if theres a way to make an FPS work on the Wii, no one has found it yet.", "date": "Nov 13, 2009", "grade": "6.5"}