{"name": "Call of Duty: Modern Warfare 2", "ref": "https://www.gameinformer.com/games/call_of_duty_modern_warfare_2/b/ps3/archive/2009/11/09/review-call-of-duty-modern-warfare-2.aspx", "text": "Call of Duty 4: Modern Warfare was, in a word, superlative. Fawnedover by critics and rabidly defended by its massive fanbase, the gamewas an instant blockbuster that topped sales charts and spawned anonline community the likes of which are rarely seen outside of timelessclassics like Counter-Strike and StarCraft. Developer Infinity Ward isaware of the microscope that Modern Warfare 2 is under. Only a fewflaws show up under even the greatest scrutiny, though. Modern Warfare2 is an unqualified triumph.MW2 takes the concept ofaction-packed first-person combat, plops a live grenade at its feet,and mows down its friends with an incendiary minigun. If you have timeto breathe, its because youre being flanked. Every reload is a tensefew seconds of unwelcome defenselessness. Each enemy dispatched yieldsa surge of adrenaline that soon gives way to fear as his allies eagerlyunload in your direction.To excel, you have to master the use ofvarious tools, starting with smoke grenades, thermal vision, Claymoremines, and Predator drones. Its extremely helpful to familiarizeyourself with each weapon class; assault rifles, LMGs, SMGs, pistols,and explosives all have vital roles. In the co-op Special Ops mode (andthe single-player campaign, to a lesser extent), even more diverseskills come into play. Targeting allied support units like StrykerAPCs, defending hardpoints with sentry guns, and directing theoverwhelming firepower of an AC-130 or helo-mounted minigun are allnecessary.Modern Warfare 2s competitive multiplayer offering isthe soul of iterative design. New ideas arise like third-person playand death streaks, but nothing substantially affects the core gameplay.On the other hand, the tweaks are almost uniformly great.Weapon-specific unlocks, cosmetic titles and callsigns, and upgradedpro perks contribute to a dramatic increase in the depth and breadthof persistent progression. The strategic variance of each map inviteshours of study and experimentation. Included due to the mountain offeedback, the playlists (preset rotations of maps and modes for groupsto play through) offer delightful bouquets of varied-yet-similargametypes for all tastes.To get a sense of how the subtlechanges to Modern Warfares online formula have profound effects,consider Headquarters Pro mode. In the original game, a team simply hadto gain uncontested control of the hot zone to earn a point. Now,youve got to hold it for a short time to score. With this simplealteration, the mode is about positioning and teamwork rather thantwitch skills and a mad rush to the designated spot. Locking down anarea for half of a minute is a much different task than brieflyclearing it. Infinity Ward went for this kind of change rather thanrocking the boat with player-controlled vehicles or some kind ofpersistent world battlefield, and it works. Modern Warfare is arguablythe most beloved online FPS of this generation, and MW2 surpasses it innearly every way.The most significant change in this sequel isthe addition of two-player co-op in the form of Spec Ops missions. Thelack of co-op in the story-based campaign is disappointing, but SpecOps successfully adapts what Call of Duty does best to a cooperativesetting. Most of the missions involve the kind of spectacular setpiecesthat Infinity Ward is known for, while still capturing the tension of abattle against overwhelming odds. These single-shot challenges rangefrom providing aerial overwatch for a buddy on the ground to assaultson fortified enemy positions and stealthy infiltrations. Since thereare no AI companions in Spec Ops, it all comes down to you and yourbuddys skill and rapport. Spec Ops deftly captures the spirit ofteamwork that all the best co-op experiences have, from Left 4 Dead toRainbow Six.Its easy enough to storm a collapsing andRussian-infested Golden Gate bridge with a skilled friend at your sideon Regular difficulty. Cranking it up to Veteran is much harder, butstill very doable. Staying alive on a tight urban street against adozen swarming, aggressive, flanking foes while waiting for yourbuddys helo to circle back around to a decent firing solution is muchharder. Taking down the super-tough Juggernaut enemies (were talkingmultiple assault rifle clips to drop) blitzing your limited cover whilebeing suppressed by snipers and machine gunners is a brutal challenge.Spec Ops offers all this and more. Only elite players will complete allof the Spec Ops scenarios on Veteran. The process is fantasticentertainment regardless of skill level, though.To a greaterextent than the other modes, the campaign suffers from the fact thatModern Warfares spectacle has lost a little of its shine. The pacingleaves something to be desired, with some sections feeling like slogsthrough clearing streets and houses while waiting for the next awesomesetpiece. Lackluster ally AI often results in cheap-feeling deaths whenyour compatriots fail to shoot the guy right in front of them or forgetto clear a room they pass. The high points, however, are as powerfuland impressive as anything. One particular scene, which I cant discusswithout spoiling, will be one of the defining gaming moments of thisyear. I would still lay out the purchase price for the single-playercampaign, but its definitely the least impressive of the three ways toplay Modern Warfare 2.Theres not a lot to complain about here.I still disagree with gaining quantitative advantages via perk upgradesin multiplayer, the AI missteps in the single-player are irritating,and the controversy over the lack of PC dedicated servers is a shame.Theyre not anywhere near enough to make more than superficial dents inthe games overall brilliance, though. Modern Warfare 2 is amasterpiece of careful iteration, with an unmatched presentation and awell of content that will take months to run dry.Opting OutUpon starting a new game, players aregiven the choice to opt out of a morally gray mission with no penaltyto their Achievements or Trophies, and with no effect on the story. Theoption is there for a good reason  the mission in question makes theplayer a part of truly heinous acts. If youre on the fence aboutletting your child play this M-rated game, this will likely push youover the edge. On the other hand, the mission draws the morality of warand espionage into sharp focus in a way that simply shooting the badguys cannot. It is presented and handled in a mature way that avoidsfeeling tasteless. By choosing to skip this controversial scene, youllbe missing the most emotionally affecting moment Ive experienced in agame this year, and possibly ever. The subject matter is mature in afashion that goes far beyond a topless lady or a messily curb-stompedalien; it deals with issues like the relative worth of a human life andthe idea of heart-rendingly difficult sacrifices for the greater good.If this mission felt in any way exploitative or tasteless, Id be thefirst to call for Infinity Wards head. The skill with which it ishandled in the game, however, makes me proud that our medium canaddress such weighty issues without resorting to adolescentblack-and-white absolutes.Whats Up With PC?Infinity Ward says that the PCversion is functionally identical to the PS3 and 360 builds that weplayed for review. However, we were unable to spend hands-on time withthe PC game. When we have that opportunity, we will revisit ModernWarfare 2 and publish a separate review if there are any substantialdifferences. Until then, please consider this our definitive review forall platforms that the game appears on.", "date": "Nov 09, 2009", "grade": "9.75"}