{"name": "Rabbids Go Home", "ref": "https://www.gameinformer.com/games/rabbids_go_home/b/wii/archive/2009/11/03/review.aspx", "text": "In Rabbids Go Home, the titular creatures have ditched the minigameblueprint of previous Rabbid games for an entertaining platformer witha shopping cart. The Rabbids want to go to the moon, and mustcreate a giant pile of random items in order to climb there. TwoRabbids man a shopping cart and traverse the game's levels to collectnearly everything in their path. The action is quirky if nothing else.You can literally scare the pants off of humans by shaking the Wiiremote to gather their clothing, chase down a cow then flush it down atoilet to add it to your stock, grab a sick hospital patient in abubble bed to help you float toward hard-to-reach items, and more. Thefast and frenetic action is fun at first, but cow racing and othersequences become repetitive as they make multiple appearances in thegame.Angry dogs, turrets, and Verminators (men in puffy Hazmatsuits) stand in the way of item collecting, but these encountersaren't challenging. Verminator skirmishes require you to simply knockoff their suit with the shopping cart. Though they have varyingabilities based on the color of their suits (spin attack, pounce, etc.)it would have been great to see more enemy variety overall.Asecond player can join in on the action with one player handling thecart while the other hurls a Rabbid housed inside the Wii Remote atenemies. Players can also customize Rabbids using stamps and itemsunlocked by collecting a certain number of items in the game. Thoughco-op isn't particularly stellar, watching a customized Rabbid in athong and makeup run amok through grocery stores, chemical plants, andcorporate offices is quite the sight to behold.Rabbids Go Home,though at times repetitive, is a fun game with laugh-out-loudanimations. Any game with Rabbids in fisticuffs over a pouch of CapriSun is okay in my book.", "date": "zalez on Nov 03, 2009", "grade": "7.5"}