{"name": "DJ Hero", "ref": "https://www.gameinformer.com/games/dj_hero/b/xbox360/archive/2009/10/27/review.aspx", "text": "Activision has taken a lot of heat in gamer circles for itsperceived shameless exploitation of the Guitar Hero franchise. A lot ofgamers have been more sympathetic to Harmonix (the originators of bothGuitar Hero and Rock Band), a stance reinforced by the companys classyhandling of its DLC catalog and The Beatles: Rock Band, especially incontrast to Acvitisions botched handling of Kurt Cobains likeness inGuitar Hero 5. Against this backdrop, DJ Hero is an even moreimpressive feat of game development. Not only does it succeed in beingmuch more than a cheap cash-in on the Hero brand, its the mostinnovative and inspired new music title since the original Rock Band.Whilethe basic gems and runway onscreen display reflects the tradition ofGuitar Hero, the gameplay and the new turntable controller transformthe template into something radically different. The turntable and itsthree face buttons handle the cuts, scratches, and rewind effects thatcascade down the three-track runway. But the real challenge comes fromusing the crossfader to switch rapidly between different samples when atrack makes an immediate left or right turn on the two outside tracks.At first its like trying to rub your belly and pat your head at thesame time, but the learning curve should be manageable for most musicgame fans. However, some expert Guitar Hero players will have toswallow their pride and start on the medium difficulty. For thisreason, the entire game plays in no fail mode. Some hardcore playersmight balk at this, but I think it was the correct decision. Still,perhaps it would have been wise to at least include a mode that allowsyou to fail for the expert set.The gameplay is exhilarating,providing the illusion that you are in command of the mix as you jugglebeats, lay down scratches, squelch frequencies with the knob, andinterject custom sample sound bites in the freestyle sections of thetrack. The game transforms on higher difficulty levels, as addeddirectional scratches lend the game another layer of complexity. Myonly small complaint is I wish the crossfader control had a strongernotch in the middle, making it easier to find the default positionduring hectic sections.Musically, this is the most adventurousmusic game released to date. Instead of a simple tracklisting ofclassic rock tunes, these fresh mixes offer an entirely new listeningexperience. Familiar tracks are blended with obscure DJ cuts to oftenthrilling results. In DJ Hero, the delicate 60s psych of the Zombiesis melded with Chuck Browns go-go classic Bustin Loose, while jazzproducer David Axelrod gets down with Eric B. and Rakims hip-hop epicEric B. is President. Finally, a music game thats not simplyregurgitating the past, but transforming it. While the mixes sometimesrely too heavily on pop hits or well-known artists, the soundtrackfeels remarkably true to the cut-and-paste aesthetic of DJ culture.Asmight be expected in a game that tries to do so many new things, noteverything works. A few mixes, like DJ Yodas awkward mash-up of TuttiFrutti by Little Richard and Beats by Shlomo, sound like audio carcrashes, leaving you feeling confused by the jumble of edits andhyperkinetic scratches. Other times, its clear that marketing hastaken precedent over artistry. The Jay-Z set is a disappointment,eschewing classic early Jay breaks for inferior latter-day material.The freestyle samples  brief soundbites that can be deployed with themiddle button  are fairly corny, and often do little but disrupt thegroove. Also, the guitar-and-DJ multiplayer duets are more novelty thanfun, though perhaps this can be improved with better DLC in the future.Thepresentation is also a mixed bag. While the graphics and impressivelyrendered environments are state of the art, the horrible characterdesigns that weve come to expect from Guitar Hero continue to annoy inDJ Hero. From stripper-like females to faux rednecks, theres not adumb stereotype these fuggly Muppets dont cover. Thankfully, you canunlock a good number of genuinely respected real-life DJs likeGrandmaster Flash, DJ Shadow, and Jazzy Jeff  although DJ AMs bioweirdly neglects to mention the fact that he recently died.Despitethese complaints, Im hooked on DJ Hero. In many ways, it feels like anew beginning for the music genre. Freestyle Games has pulled off animpressive trick, crafting a game that holds true to its sisterfranchise while at the same time putting a unique spin on both thegameplay and the music. This is a great start, and I hope thatActivision follows through with robust DLC support. With so much of theclassic rock catalog depleted, this genre needs to look to new andcreative ways to keep the experience fresh. DJ Hero is a great firststep.", "date": "on Oct 27, 2009", "grade": "9"}