{"name": "Risen", "ref": "https://www.gameinformer.com/games/risen/b/pc/archive/2009/10/27/review-risen-pc.aspx", "text": "Balancing the kind of freedom that western RPG series (like TheElder Scrolls) are known for with a directed narrative is tough. Risendeveloper Piranha Bytes, best known for its long-running Gothic series,has been doing this for a long time. This latest effort skillfullywalks the tightrope without the crippling bugs that Gothic has oftenlaunched with, and delivers an RPG experience worth exploring.Asa castaway on an island beset by all manner of supernatural threats,players must find their own way through Risens hostile world. Thegameplay itself is very much third-person Oblivion, withblock-and-counter melee combat complemented by a selection of rangedand magical options and a world stuffed full of items to grab. Bydedicating yourself to some mix of martial and magical study, youllcut your own bloody path through the horrible events afoot. Risen doesan outstanding job of allowing players to feel smart by findingalternate solutions around most challenges; do you turn a stolenartifact in to the fascistic authorities, fence it for some much-neededcoin on the black market, or give it to the part-mobster part-patriotresistance movement to earn their trust?Each path has genuineconsequences; picking sides will deny you access to some vendors andtrainers while opening other, unforeseen doors. Avoiding conflict andtrying to find a middle ground is a viable path as well. Not tickinganyone off has a certain value, but with no true friends you may findyourself without valuable allies later on. I felt in charge of my owndestiny to an impressive degree in my time with Risen.Risenboasts dialogue, characters, and voice acting as believable as anythingin any form of media. Judicious use of curse words and adult themeslike prostitution and poverty grounds the story without beingsophomoric or tawdry. Most NPCs you meet act and react according totheir own personal goals  their personalities feel genuine, despitebeing scripted along branching event trees. These well-writteninteractions, along with a world and plotline that has sometimes-brutalconsequences, present a convincing illusion of a self-directed story.Onescenario that youre likely (but not guaranteed) to encounter along themain plotline involves a set of sought-after ceremonial armor platesthat are in the possession of a few dockworkers in a downtrodden harbortown. These guys have done you no wrong. Theyre just trying to make abuck to literally feed their families when they offer to sell you theirloot for a few hundred coins. You probably dont have much cash,though, and the people that want these armor plates can do you favorswell beyond the means of these poor schlubs. You can ambush them atnight and take the goods, making them and their friends justifiablyupset with you. You can come back later after busting your hump to makethe money theyre asking for by means honest or shady. Alternatively,you can move on with your life and leave them to find another buyer.The genius of Risen is that any of these approaches has advantages andconsequences. There is no right way to do things, just the way thatyou choose, which in turn shapes your story moving forward.Forall the artistry on display (and the presentation matches the fantasticstory), Risens lack of polish can be off-putting. Combat is poorlybalanced and executed, leading to a lot of quicksave/quickloads whencatastrophe strikes through no fault of your own. The interface works,but leaves much to be desired when it comes to tracking the games manyintersecting quests. Character progression is nothing to envy;assigning skill points and gaining levels is a bland approach to take.Nobody will be awarding Risen any trophies on its technical merits. Isthat why you play an RPG, though? Or are you in it to explore a storyin which you have genuine input over the outcome? Risen can be awfullyfrustrating on a technical level (though rarely broken, like Gothic 3before it), but its a *** good RPG.", "date": "Oct 27, 2009", "grade": "8.5"}