{"name": "FIFA 10", "ref": "https://www.gameinformer.com/games/fifa_10/b/ps3/archive/2009/10/20/review.aspx", "text": "During my first season as manager of Manchester City, I brought theteam and its fans The Double  winning both the Premier League and theFA Cup. Needless to say, we were ecstatic, and it was no easy feat. Itrequired using the transfer market to collect the right players, a fewlucky bounces, and the emergence of striker Carlos Tvez as a lethalfinisher. I couldnt have done it without FIFA 10.My first actas the new manager of Manchester City was to dive into the transfermarket. Not satisfied with my keeper or depth in the midfield, I pickedup an obscure goalie and Portuguese midfielder Maniche for cheap. Bothproved to be vital to the club. The fact that both of them were nearthe top of the transfer list but werent big names being signed for lowbucks shows that some of last years problems with the transfer markethave been fixed.On the pitch, my team created its own luck,using skill moves for one-on-one situations, controlling the ball withgood trapping, and making good attacking runs with off-the-ballplayers. I also have to credit FIFA 10s loose ball physics, as Iscored a few goals by easily cleaning up sloppy clearances in front ofopponents goals. My keeper showed mettle, avoiding the bonehead movesthat plagued past keepers in the series, although there were stilltimes when my defenders and the manual player selection AI lacked suchsmarts.Despite my excitement for what FIFA has going for it onthe field, I was disappointed that Be a Pro mode is largely the same,and that improvements to the manager mode are only under the hood (suchas more realistic transfers and simulated results). However, the gamehandles dribbling and other ball control mechanics well, and there is adefinite energy on the pitch. Chemistry is an important aspect of anychampionship team  even more so if youre going to win The Double and FIFA 10 brings its pieces together nicely.", "date": "Oct 20, 2009", "grade": "8.5"}