{"name": "WWE SmackDown vs. RAW 2010", "ref": "https://www.gameinformer.com/games/wwe_smackdown_vs_raw_2010/b/xbox360/archive/2009/10/20/svr2010-review.aspx", "text": "World Wrestling Entertainment features a constantly changing landscape from year to year. Good guys turn into bad guys between pay-per-view events, wrestlers switch between the three brands, and their entire gimmick often receives a full overhaul. Because of all this change, keeping Smackdown vs. Raw current is far more than just a roster update. Yuke's has done a great job of giving the hardcore WWE fans what they want, as well as keeping it accessible for casual viewers.One of the most significant new features in Smackdown vs. Raw 2010 is the training facility. Considering the sheer amount of match types, there's a staggering number of commands that players need to know. This training facility appears before the main menu, and allows you to perform moves at your own pace rather than in a preset order. Practicing the most natural way to learn the SvR 2010 controls, and it's something the series could have used for a long time.Despite the improved training method, several issues from the series' past are still apparent. Opponent AI is incredibly inconsistent, and it's not uncommon to see odd behavior such as John Morrison madly attacking each turnbuckle in succession, without a care in the world that he has an opponent in the ring. Wrestlers may interfere in your match and actually go for pinfalls against you despite their lack of involvement in the contest.So much time has been spent adding new features to the game, but changes still need to be made regarding the core gameplay mechanics. Its easy to get frustrated numerous times during any given match. You might accidentally attack the referee and get disqualified, poor collision detection may get in the way of your dropkick connecting, and the camera may decide the best vantage point for your dramatic backbreaker is from directly behind the turnbuckle. New features have been hit-or-miss for the series, but the Community Creations addition to this years installment is definitely a positive step. Gamers can share their created superstars and storylines quickly and easily, which ensures that longtime WWE fans will have access to some classic feuds from wrestling's past. As one would expect, this will probably result in some hilarious and absurd plots as well. Considering how many aspects go into creating a storyline (dialogue, setting, cast, sound, booking matches, etc), the interface for doing so is surprisingly easy. Despite not being able to add actual voices to the wrestlers, you can enter all their lines easily with a USB keyboard.Last years Road to Wrestlemania mode is back, and should satisfy fans looking for fully produced stories complete with the actual wrestlers contributing voice work. New interactive cutscenes pop up from time to time, but most are simple press A to punch this guy, B to punch this guy affairs. One of the stories (Triple H and John Cena) appears to be a cooperative mode, but most of the time youre just taking turns fighting your own one-on-one matches. Youll team up in the occasional tag match or battle royal, but its certainly not a full co-op experience.Many minor improvements have been made, such as the red marks that appear after too many Flair-esque chops to the chest. Hardcore WWE fans can also manage the heel/face status of the superstars, their brand alliance, and their rivals/allies. These fans are the ones that will appreciate the little changes the most, but Smackdown vs. Raw 2010 is a solid title whether you have a closet full of Austin 3:16 shirts or just catch the occasional episode of Raw.", "date": "Oct 20, 2009", "grade": "8.25"}