{"name": "Dirt Rally", "ref": "https://www.gameinformer.com/games/dirt_rally/b/playstation4/archive/2016/03/28/dirt-rally-ps4-review-game-informer.aspx", "text": "It's easy to approach a rally game as if it's another racing title. Speed, fighting for control, and a strong competitive spirit rule both, but rally racing is a different breed. If the focus of regular racing is primarily the finish, then rally racing is a marathon where you die and are reborn a million times before you reach the end. Corners aren't the only place where you gain or lose time. Every second is an attempt to conquer a growing fear. Victory at the finish line  and knowing the dangers you pushed past to get there  is an exhale of relief as much as jubilation.To tap into the moments that make rally racing so exhilarating, you need a game that isn't just about sliding around hairpin turns. Dirt Rally's superior car handling communicates the vibrancy and challenge, creating an unparalleled experience. Dirt Rally isn't alone in translating velocity, physics, weight transfer, traction, and other intangibles into a video game package. However, the way it taxes these elements every second you're on the course in a flurry of ever-changing demands is what elevates the genre.For example, I get a little air coming over the crest of a hill, which is not a fist-pumping moment. Being that the crest itself is at a slight angle, I have to prepare my takeoff angle before I go airborne, and once I land I'm immediately trying to gather the car back up and get ready for the bend ahead. I'm on light gravel so I shouldn't expect too much of a slide or spin of the tires, but I also have to flirt with when and how much brake I apply versus maintaining speed. Throw in a rock on the outside of the already-narrow bend that will likely destroy my car if I'm not careful. This isn't some big setpiece in a ~boss battle~ of a track; it's just a typical sequence you have to deal with that feels wonderful in your hands.The co-driver is good about calling out what lies ahead through a sometimes complicated lexicon (but when he says ~Don't cut~ for a corner, that's a clear directive). You cannot ignore any of it, nor listen to all of it. The sweet spot occurs when you get into that auto-pilot zone, internalizing the next 100 or so yards while also focusing on the danger at hand. This is gaming as tense and demanding as you've ever known it.A Few Console AdditionsThe console version adds a series of tutorial videos and fully loaded cars that can ease progression early on, but these dont fundamentally change the game.Dirt Rally isn't just for the hardcore, although it could do a better job of inviting newcomers. The career mode's championships progress in difficulty and the cars you buy spanning the sport's eras get faster and harder to control, but the title could use a tutorial section or the ability to flashback and rewind if you crash like in previous Codemasters titles. You can only restart back at the beginning or reset the car back on the track for a time penalty, which you'll definitely do. This in a mode that has its share of grinding for requisite championship points and cash to buy cars specifically for the hill climb and rallycross disciplines.You unlock upgrades the more you race with a car (better engine performance, the ability to tweak the handling, etc), and a team consisting of a crew chief and up to four engineers that help repair damage between stages faster. The perks' excitement is limited to speeding up the rate at which your car upgrades and is fractured over different car makes and models. The framework around the racing gameplay could be more inviting, like featuring more unlocks (liveries or cars) or prizes around your achievements  that slightly fatuous fluff that makes us feel like we're getting somewhere.Beating the stage and overall rally times of Codemasters' online challenges are a natural fit for rally racing's solo structure, but more group-orientated play is available if you join a league where you can post your best times among your peers and go up against them simultaneously in rallycross races.Dirty Rally can be unforgiving, unrelenting, and seemingly as high in its demands as the infamous hill climb at Pikes Peak. But the journey is sublime.Note: This review originally ran for the PC version. Although this PS4 version has additions (see sidebar above), the score remains the same.", "date": "Mar 28, 2016", "grade": "8.5"}