{"name": "Brtal Legend", "ref": "https://www.gameinformer.com/games/brutal_legend/b/xbox360/archive/2009/10/13/review.aspx", "text": "What a long, strange ride its been for heavy metal. A movement that started as a critically reviled cacophony of distorted amps, screeching vocals, and gaudy guitar solos has proven exceptionally resilient, with its biggest bands selling out stadiums across the world over three decades. Metal faced many near-death moments that would have killed lesser genres  men in make-up, spandex, and Fred Durst  but it ultimately persevered, crossing over into new media with triumphant success stories like Metalocalypse and Guitar Hero. Famed game developer Tim Schafer grew up during metals rise to popularity, and Brtal Legend serves as his ode to the heavy, brooding music of his adolescence. This is a fantastical metal opus stitched together from album covers, rock videos, band merch, and live concerts. Brtal Legend follows the exploits of Eddie Riggs, a roadie voiced by Jack Black who gets transported to an alternate dimension steeped in metal lore after he spills blood on his belt buckle during a stage mishap. The evil Lord Doviculus and his demons have enslaved humanity, and Riggs joins dreamy resistance frontman Lars Halfords cause to return mankind to righteousness. This tour wont be easy, however, as Riggs encounters tragedy, lost love, and his own shady past as he struggles to harness the power of metal and dethrone Doviculus. Tim Schafers signature sense of humor is pervasive throughout, with subtle metal references and laugh-out-loud one-liners strewn across the narrative.Eddie proves no slouch in the combat arena, bludgeoning enemies with his axe, shredding his guitar for ranged lightning attacks, and turning demons into road kill with his steel chariot, The Deuce. Double Fines combat controls arent difficult to master, but the action is kept fresh with combos, double team attacks that pair Eddie with his comrades, and special powers Eddie calls to his aid via guitar riffs. These creative and highly useful attacks range from melting the faces of the enemies around him to calling in a flaming zeppelin that crashes to the ground, eliminating or severely damaging everyone in its path. Metal indeed.Riggs unlocks these powers by scavenging the land for Tab Slabs, large rock structures that teach the destructive guitar solos. Finding them isnt easy given the open worlds breadth, but fantastic art direction guarantees the drive is filled with awe-inspiring monuments to metal. From the screeching wall of amps to the mountains of skulls, the world of Brtal Legend is living, breathing album cover, and one of the most imaginative game worlds I have visited. Collectibles and side missions with cameo performances from Kyle Gass and Brian Posehn litter the explorable metalscape.To win the land back from his enemies, Eddie must engage in Stage Battles, the centerpiece to the Brtal Legend combat and multiplayer experience. To win these action/real-time strategy hybrid battles, you must gain control of fan geysers by building merch booths on top of them to harness the fan spirits. With the fans on his side, Eddie can call a great array of varied unit types to arms, or turn the tide of battle by joining the fray himself. RTS battles rely on split second decisions, but Brtal Legends cumbersome command system stretches your patience to wits end. If your tactics arent sound from the first note there is rarely a course of recovery. The multiplayer gives you the chance to control the goth/emo and demonic factions you battle in the single-player game, but with the core mechanic so unreliable I cant see this being a destination mode.The unwieldy Stage Battles maim the battle system and multiplayer, but this gaffe doent take away from Brtal Legends charm. If youre a fan of Tim Schafers humor and the type of person who decides between wearing a Metallica and Slayer T-shirt when you wake up, this is a must-play.", "date": "Oct 13, 2009", "grade": "8"}