{"name": "Brtal Legend", "ref": "https://www.gameinformer.com/games/brutal_legend/b/ps3/archive/2009/10/13/review.aspx", "text": "What a long, strange ride its been for heavy metal. A movement thatstarted as a critically reviled cacophony of distorted amps, screechingvocals, and gaudy guitar solos has proven exceptionally resilient, withits biggest bands selling out stadiums across the world over threedecades. Metal faced many near-death moments that would have killedlesser genres  men in make-up, spandex, and Fred Durst  but itultimately persevered, crossing over into new media with triumphantsuccess stories like Metalocalypse and Guitar Hero. Famed gamedeveloper Tim Schafer grew up during metals rise to popularity, andBrtal Legend serves as his ode to the heavy, brooding music of hisadolescence. This is a fantastical metal opus stitched together fromalbum covers, rock videos, band merch, and live concerts. BrtalLegend follows the exploits of Eddie Riggs, a roadie voiced by JackBlack who gets transported to an alternate dimension steeped in metallore after he spills blood on his belt buckle during a stage mishap.The evil Lord Doviculus and his demons have enslaved humanity, andRiggs joins dreamy resistance frontman Lars Halfords cause to returnmankind to righteousness. This tour wont be easy, however, as Riggsencounters tragedy, lost love, and his own shady past as he strugglesto harness the power of metal and dethrone Doviculus. Tim Schaferssignature sense of humor is pervasive throughout, with subtle metalreferences and laugh-out-loud one-liners strewn across the narrative.Eddieproves no slouch in the combat arena, bludgeoning enemies with his axe,shredding his guitar for ranged lightning attacks, and turning demonsinto road kill with his steel chariot, The Deuce. Double Fines combatcontrols arent difficult to master, but the action is kept fresh withcombos, double team attacks that pair Eddie with his comrades, andspecial powers Eddie calls to his aid via guitar riffs. These creativeand highly useful attacks range from melting the faces of the enemiesaround him to calling in a flaming zeppelin that crashes to the ground,eliminating or severely damaging everyone in its path. Metal indeed.Riggsunlocks these powers by scavenging the land for Tab Slabs, large rockstructures that teach the destructive guitar solos. Finding them isnteasy given the open worlds breadth, but fantastic art directionguarantees the drive is filled with awe-inspiring monuments to metal.From the screeching wall of amps to the mountains of skulls, the worldof Brtal Legend is living, breathing album cover, and one of the mostimaginative game worlds I have visited. Collectibles and side missionswith cameo performances from Kyle Gass and Brian Posehn litter theexplorable metalscape.To win the land back from his enemies,Eddie must engage in Stage Battles, the centerpiece to the BrtalLegend combat and multiplayer experience. To win these action/real-timestrategy hybrid battles, you must gain control of fan geysers bybuilding merch booths on top of them to harness the fan spirits. Withthe fans on his side, Eddie can call a great array of varied unit typesto arms, or turn the tide of battle by joining the fray himself. RTSbattles rely on split second decisions, but Brtal Legends cumbersomecommand system stretches your patience to wits end. If your tacticsarent sound from the first note there is rarely a course of recovery.The multiplayer gives you the chance to control the goth/emo anddemonic factions you battle in the single-player game, but with thecore mechanic so unreliable I cant see this being a destination mode.Theunwieldy Stage Battles maim the battle system and multiplayer, but thisgaffe doent take away from Brtal Legends charm. If youre a fan ofTim Schafers humor and the type of person who decides between wearinga Metallica and Slayer tee-shirt when you wake up, this is a must-play.", "date": "Oct 13, 2009", "grade": "8"}