{"name": "Uncharted 2: Among Thieves", "ref": "https://www.gameinformer.com/games/uncharted_2_among_thieves/b/ps3/archive/2009/10/12/review.aspx", "text": "In Uncharted 2s opening sequence, Naughty Dog wastes no timethrowing treasure hunter Nathan Drake into harms way. Only this time,he isnt the bulletproof protagonist we knew from the first adventure.Beaten, bloodied, and left for dead, hes been humanized. The emotionaltimbre is engaging and powerful. Yet this opening sequence isnt amovie to watch with bated breath. Its gameplay, and youre controllingNathan in a nearly unconscious state. The divide separating videogames and motion pictures is expansive, but moments like this one bringthem closer together. Im not saying games should be movies, or viceversa, but exploring characters in different conditions, emotional orphysical, can open the doors for more dynamic storytelling and gameplayin games. Uncharted 2 is testament to this idea.Many of thesegameplay moments bleed directly out of the story breaks. With thenotable elimination of loading screens and no discernable differencebetween the cutscene and gameplay graphics, I often found myselftapping the analog stick during a conversation or action sequence justto make sure I wasnt supposed to be playing. In some cases, I wassupposed to be playing! Ditching load screens may seem like a trivialtechnical merit, but it greatly enhances the games pacing, flow, andoverall cinematic impact.Without skipping a beat, this adventurerolls like a boulder chasing Indiana Jones, picking up momentum andbouncing unpredictably every step of the way. Naughty Dogs scribespenned a fascinating, tightly wound mystery centered on Marco Poloslost fleet. The set pieces accompanying this tale deliver the sense ofmiraculous discovery, and are instrumental in evolving both thecharacters and gameplay. Nathan, who is voiced brilliantly by gamingvet Nolan North, turns in one of the most believable performances Iveseen from a game character. His emotions are fully established, and hiscomic timing is spot on, often bringing about big laughs in stressfulsituations.Not once did I feel that the plot was altered to fitthe gameplay. This was one of my big complaints with the first game; itjust didnt move naturally. In Uncharted 2, every aspect of the game isharmonized. The environments players traverse embody a higher level ofrealism, meaning you wont see man-made barriers positionedstrategically for a gunfight in a lush jungle. Small touches like theseremove predictability from the equation. Rather than followingthe traditional sequel process of adding more components to the action,Naughty Dog instead chose to iterate upon the original mechanics. Thegunplay is most improved, now offering smooth targeting, weapons thatkick, and credible targets that dont fidget like they have fullbladders. On top of this, diversity in the enemy types adds dimensionsto battles. An armored trooper may send you to a vertical space to useheavy machinery, whereas a squadron of light troops may be best tackledthrough stealthy neck snaps. Moreover, the weapon selection is muchmore satisfying, and assigning grenades to a specific button removesany chance of players tussling with the weapon selection wheel morethan the enemies. The battles end up delivering a satisfying blend ofpop-and-shoot and run-and-gun tactics. No longer did I find myselfwishing they would be over so I could reach another cliff to climb.Beyond the AdventureUncharted 2s quest is worth the price of admission alone, but its only one small slice of content provided on the disc. Players can also dive into fully featured competitive and co-op modes. Competitive multiplayer supports up to 10 players, and offers a wide selection of satisfying match types. Like Call of Duty 4, player performances bring an array of rewards, such as perks (of which you can carry two into a match), ranks, and cash to exchange for new skins and gear. The solid gunplay from single-player transitions well into the multiplayer field. Grenade play is particularly impressive, and the maps embrace vertical gunplay. Pre-match loading is a bit extensive, but the action more than makes up for the wait.If you dont enjoy shooting your friends, Uncharted 2 offers a deep and rewarding cooperative experience for up to three players. In addition to three standard co-op modes (which Naughty Dog has fleshed out with unique character banter and animations), teamwork skills are put to the test in the addictive Gold Rush and Survival modes. Cash earned can be used in the store for co-op only weapon upgrades.If you are vain enough to watch how much ass you kick, Naughty Dog rounds out the multiplayer experience with a cinema mode.Platformingis Naughty Dogs unquestioned strength, and Uncharted 2s doesntdisappoint. Nathans moveset remains largely unchanged, but Naughty Dogfound ways to intensify the art of leaping. On one hand, the levels arebetter designed for vertical exploration; its not like Tomb Raiderwhere you have to piece together the path. The platforming is still aslinear as can be, but the challenges are now larger in scope, and oftenaccompanied by some kind of unforeseen dilemma  be it falling ledges,moving gears, or dangerous explosions. The platforming and gunplay areseamlessly united, often overlapping when you least expect.Nathannever jumps upon a jet ski, but several vehicles are used throughoutthe game. Trucks create one of the games most memorable gunfights, anda train becomes the centerpiece to one of the most exciting levels Iveseen in an action game.Naughty Dogs mastery over thePlayStation 3 hardware is evidenced most in Uncharted 2s visuals. Astaggering level of realism is attained in both the characters andworlds. I couldnt find a texture with a blemish or an animation thatlooked goofy. I often found myself marveling at the smallest ofdetails, like the way light bounces off rocks or how flags blow in thewind. With the action moving at a fevered pitch, its hard to soak inall the details, but they are there, even in the far corners mostpeople will likely never venture into.Uncharted 2 is amasterstroke of game creation. This is the killer app PlayStation 3owners have been waiting for, and Id even be saying this without theoutstanding competitive and co-op multiplayer (see sidebar). Given thecomplexity of the character relationships, I urge players to play theoriginal game before venturing into the sequel. Some of the jokes andreferences fall flat if you dont have the knowledge of Nathansprevious exploits.Uncharted 2 is a ringing testament to thepower of both games and storytelling. It pulls you in, keeps youengaged, and concludes with a thunderous bang.", "date": "Oct 12, 2009", "grade": "10"}