{"name": "Order of War", "ref": "https://www.gameinformer.com/games/order_of_war/b/pc/archive/2009/10/06/review.aspx", "text": "Square Enix. Real-time strategy. World War II. Put them together, and these aren't likely to send most gamers into a frenzy. After all, Square Enix is known for JRPGs and anime clichs, and its past strategy of choice has been strictly turn-based. Why would they want to muck around in the RTS genre?Rather than attempting to develop an RTS internally, Square partnered with Wargaming.net, a team that's been building strategy games for over 10 years. As much as I'd like to hit Order of War with my ~just another World War II game~ stamp and move on, the developers actually created a surprisingly exciting game. If Company of Heroes is like an RTS version of Battlefield, more centered on multiplayer and careful, strategic gameplay, then Order of War is the real-time strategy rendition of Call of Duty. Yes, you've heard the WWII story in video game form a million times, and yes, Order of War uses that same History Channel-esque voiceover with stock footage of wartime struggles. But like Call of Duty, the single-player campaign missions draw players in with big set pieces and gameplay-twisting surprises with every new objective.Most of Order of War's 18 missions -- nine as American troops fighting against the Germans and nine as Germans pushing back the Russians -- begin with a limited number of troops at your disposal. You must complete your immediate objectives by smartly using whatever resources you have on hand. After knocking off a few early objectives, you usually have one or two resource points captured, at which point you'll begin accruing resources that can be spent on reinforcements or special abilities, such as massive bombing runs from your aerial allies.Though you can summon planes to help you out and recruit vehicles to help defend against enemy air strikes, you never directly control air or sea units. Controllable troops are limited to the ground, though there's a lot of variation within these. Each of the overall unit types (infantry, tanks, and artillery) can be upgraded with points earned from missions, granting them greater range, faster rate of fire, better armor, and more. Some war fanatics might find the smaller number of unit types disappointing, but it ends up creating an easy-to-understand system of weaknesses and strengths, opening the game up to players who may have been intimidated by other RTS entries.Some of the gameplay -- especially in multiplayer -- falls back on the strategy standard of amassing a large force and then taking enemy bases one by one, but Wargaming.net smartly decided to mix things up constantly in the single-player campaigns, forcing players to stay on their toes. Each mission is split into a series of shorter primary and secondary objectives, and often these objectives toy with your expectations.One memorable American mission suddenly transforms from traditional RTS into a tower defense game where you must place artillery along some hills and prevent German troops from marching to a certain point. In another you direct air attacks while an AI-controlled ground force assaults a German-held settlement. On the German side, missions are a bit more stressful, as the outnumbered German forces attempt to survive against the Russian war machine. Here Wargaming.net provides a side of the war we don't usually get to see -- albeit a sanitized version -- and also throws in some more cool ideas, such as a mission where your secondary objective is to protect the giant Leopold railway gun that you then get to use against enemy forces as a reward for succeeding.Square Enix is certainly taking a risk by branching out into the real-time strategy genre, and it's difficult to say if this experiment will be successful financially. However, I can happily report that it pulled off a stunning game. Whether you're a hardened RTS veteran, an anxious newcomer looking for a fun entry point to the genre, or just someone who loves colossal action in a World War II setting, you owe it to yourself to give Order of War a shot.", "date": "Oct 06, 2009", "grade": "8.25"}