{"name": "Saw", "ref": "https://www.gameinformer.com/games/saw/b/ps3/archive/2009/10/06/review.aspx", "text": "The Saw films are renowned for their ability to induce gut-wrenching reactions with vivid torture scenes and nail-biting suspense. Imagine my dismay when I popped in the game and instead felt boredom tempered with frustration. Developer Zombie has successfully transfused the grim atmosphere and aesthetic of the movies, but gallons of blood were lost during the procedure. Saws ridiculous story is wedged firmly between the first and second films. After detective David Tapp suffers a gunshot wound at the hands of Jigsaws crony, hes transported to the serial killers altered asylum, patched up, and tasked with enduring a gore-filled, puzzle-infested test. From the very start, Saws plot is hog-tied and thrown in a trunk while gameplay takes the wheel.Traversing the dark, booby-trapped rooms of the enormous asylum very unnerving. If you arent careful to disarm shotgun traps and avoid trotting barefoot over broken glass, your time in the loony bin will be brief. Its startling the first few times an expertly placed shotgun blasts your head into a cloud of pink mist, but later in the game your inevitable missteps will test your patience.Being the accommodating host he is, Jigsaw has populated the sanitarium with other victims. Most of these desperate souls are after the key that has been surgically implanted in your chest, rushing you with impromptu weapons like nail-bats in their fight for freedom. I dropped the slow melee weapons mere hours into the game, as the enemy AI is so weak that your foes cannot react properly to the good detectives mean right jabs. Saws combat is a mess. Aiming a gun with the left trigger and firing by pressing a face button? Thats torture.The few asylum captives that arent trying to kill you are your responsibility to rescue. This usually involves powering-down torture machines by arranging cog wheels, rewiring circuit boxes, and aligning gas pipes. Self-contained, the puzzles are simple and rewarding. The game attempts to enhance their difficulty by filling rooms with time bombs or poisonous gas, which only leads to frustrating checkpoint reloads.In the end, Saw fails to deliver the suspenseful crescendos, surprising twists, and apprehensive atmosphere of the films. Instead, its padded with unremarkable gore, poor pacing, and uninspired level design. This game suffers from the same chronic affliction as the milked film franchise  it wears out its welcome quickly and asks too much for the price of admission.", "date": "Oct 06, 2009", "grade": "6"}