{"name": "NBA 2K10", "ref": "https://www.gameinformer.com/games/nba_2k10/b/ps3/archive/2009/10/06/review.aspx", "text": "With four weeks left until the playoffs begin, my T-Wolves are in a dead heat for the final playoff seed. This does not go unnoticed to commentators Kevin Harlan and Clark Kellogg, who mention this fact just after tip-off. Halfway through the first quarter, the duo again turns its attention back to the playoff race, noting the Wolves need to perform well on this four-game road trip to have a fighting chance. Special attention is paid to Johnny Flynn, my slumping rookie point guard. He hasnt stepped up his game as of late, and Harlan keenly observes that when he plays well the rest of the team follows. Whats this, contextual commentary in a sports video game? With NBA 2K10s introduction of NBA Today, meaningful broadcasting that reacts to your every franchise move is finally a reality.  NBA today is the latest amazing improvement to the Association mode, which retains its status as best franchise mode in sports games. It captures the nuances of the sport better than any other mode of its kind, with player chemistry affecting your locker room, deep contract negotiation options, and realistic trade logic. The dedication to realism extends itself even further in free agency this year, as I found it difficult to lure prized free agents interested in championships to my rebuilding franchise. Instead I had to focus my attention on shrewd drafting and gambling on younger free agents with potential upside to construct a championship contender. On the court, NBA 2K10 defends its status as gameplay champion with a retooled post system that makes it easier to pull off fakes, drop steps, fadeaways, and moves to the hoop. Separating IsoMotion from the turbo button also helps you unleash killer dribbling moves without wasting your burst. These changes greatly aid the offensive rhythm of the experience, but defending attacks proves more difficult than in previous years. Late defensive rotations and lazy defensemen who lose their marks often result in easy buckets for the opposition. It wasnt uncommon for both teams to shoot above 50 percent in both pro and all-star difficulties. The new animations also dont jibe together as well as they did in years past; some passes clipped through outstretched arms or ricocheted off the backboard, and lay-up animations occasionally clip through defenders.  My Player, the newest mode introduced to NBA 2K10, requires the patience of a saint to enjoy. Like EAs Be A Pro mode, your players grade fluctuates during the course of a game. But unlike that mode, the majority of your time is spent toiling in obscurity in the NBA Development League. Dont expect to reach the NBA with ease even as my player led his NBADL team in scoring and assists for the season though 20 games, he was still relegated to the bench and his player rating was woefully low, indicating at least a few years of development would be needed before I could hang against the NBA elite. The low climb has a lot to do with the poorly balanced grading system  I only got minor bumps for assists and buckets as a point guard (his primary responsibilities), but for some reason every time I grabbed a rebound it catapulted my grade upward as if I were a power forward. On defense, your grade tumbles every time the player youre guarding scores  even if you hold a star to 10 points, the punishment is fierce. Adding insult to injury is the 2K Insider, your digital mentor who rides you unmercifully for every little mistake. Put up 25 points and 10 assists? Hell deride you for the three missed shots and two turnovers. The over the top criticism is enough to make a baller abandon his dream and consider other career options.  My Player modes uphill struggle may not appeal to everyone, but the outstanding presentation and best-in-class Association mode make NBA 2K10 the best basketball sim.", "date": "Oct 06, 2009", "grade": "8.25"}