{"name": "NBA Live 10", "ref": "https://www.gameinformer.com/games/nba_live_10/b/xbox360/archive/2009/10/06/review.aspx", "text": "After another loss to NBA 2K last year, EA Sports did what many bold franchise owners throughout sports history have done  signed the guy they couldnt beat. With former NBA 2K lead designer Mike Wang now firmly entrenched at the helm of NBA Live, the franchise shows signs of life. But this dynasty wont be rebuilt overnight, and many ghosts from its failed past still haunt the court. While NBA Live may not be on the level with NBA 2K yet, it sure looks the part. EA Canada once again nails the presentation, with smart commentary, stunning player models, and realistic animations. Players now move more dynamically off the ball, setting up screens and making cuts to the basket organically. Under the hoop, rebounding now features more loose balls and tips, while on the perimeter slashing guards move with the fluidity you expect from world-class athletes and pull off highlight reel passes with the new freestyle passing control. Despite these improvements, the simulation experience is marred by recurring problems that shatter the illusion of realistic basketball. Players occasionally lock into animations, so they dont always pass the ball when you want. Sideline negotiation is a mess  players run out of bounds on fast breaks, their momentum carries them out of bounds in the offensive zone, and they sometimes needlessly dive to save a loose ball when they obviously have enough court space to simply grab the ball. The most egregious gameplay issue? The ball constantly ghosts through bodies, arms, and rims. I even saw two players dunking on the rim at the same time, cutting right through one another. Gameplay complaints aside, the true albatross hanging on NBA Lives neck is the broken dynasty mode, which is the videogame equivalent to Jermaine ONeals bloated, franchise-crippling contract. Its brazen inability to yield a worthwhile experience keeps the otherwise growing game from seriously competing with NBA 2K. I started a dynasty with the Timberwolves before the 2009 draft, but halfway through the draft the game forced me to forfeit the rest of my picks because I had reached my roster limit. Rookies are awkward looking chameleons that betray the polish the game touts with the realistic faces on NBA players. My first round draft pick was an albino the first year, and a goateed, longhaired hippy with brown hair the next. The trade mechanic is also worthless; I tried trading for shooting guard depth, but team I approached made a counter offer targeting my untouchable star shooting guard player for whom I was trying to find a backup. Free agency disappoints as well, with unemployed hacks in the midseason free agent pool foolishly demanding $6 million a year. Guess what, dude: Youre unemployed, not Michael Jordan feigning retirement! Players are better off skipping the dynasty altogether for the Dynamic Season, which allows rabid hoops fans to import real game scores into their season to keep the standings in line with the real NBA. Online, the Adidas Live Run allows players to set up five-on-five games with NBA players. Unfortunately the mode fails to support created players, robbing this mode of a sense of progression. The sketchy defensive controls, a problem in most hoops games, means competition results are still determined by who jacks up the worst shots. In the end NBA Live 10 may have the glamorous look of a basketball superstar, but it still needs to round out its game to steal the crown of best hardcore hoops game from its rival.", "date": "Oct 06, 2009", "grade": "7.5"}