{"name": "Gran Turismo", "ref": "https://www.gameinformer.com/games/gran_turismo/b/psp/archive/2009/10/06/review.aspx", "text": "Gran Turismo has never been known for its accessibility, but thatchanges with the franchises move to the PSP  and not just because youcan take it with you wherever you go. A completely open careerstructure  if you can still call it that  is one of the changes thatshakes this series to its foundation. While that may sound inviting tothose who think thats exactly what Gran Turismo needs, this versionsinability to do the franchise justice is exactly where I think it getsinto trouble. Gran Turismo has never had a scintillating careerstructure, and by doing away with it entirely, this PSP edition has itsadvantages. Instead of slowly stringing you along with crap cars andrestricting which events you can enter early on, this GT throws itsgarage doors and track selection wide open from the beginning with aneasy flow of credits that makes cars relatively easy to come by. As forthe events...what events? Gone are the four-wheel-drive-only contestsand other car/model requirements. Now you simply pick a track and car,and then choose whether you want to race in a solo time trial, againstthree other cars (yes, only four cars per race), or in a driftchallenge. Collect your credits after the race, buy a new car, and doit all over again. This is about as sexy as choosing whether you wantyour potatoes in mashed or fry form. Should you tire of this  and youquickly will  you can always earn credits by completing racingchallenges which are akin to the series old license tests. Ive neverbeen a fan of those, so Im not diving into them now, not even for theeasy money.The game makes itself more accessible in other ways,such as letting friends trade or share cars, multiplayer balancingfeatures such as giving lesser players better cars, random creditjackpots, and the ability for the AI to race for you. But no matter howmuch these features open up the game, I miss having a bona fide careermode. While I have my criticisms of how dry Gran Turismos career modeshave been in the past, this GT swings the pendulum too far in the otherdirection. The games lack of focus makes it feel just a step above thedemo-like Gran Turismo Prologue series.This new career mode hasits strengths and weaknesses, but the one unfortunate thing about GranTurismo that seals the deal for me is the driving itself. Youd thinkGT would have its one calling card dialed in, but it doesnt. Becauseof the small degree of movement in the PSPs triggers and face buttons,the games acceleration and braking is very binary  either it feelslike youre not on the pedals at all or youre slamming them to the carfloor. This makes gently braking into corners nearly impossible, andacceleration with high-powered or rear-wheel drive cars can easilydevolve into a fishtail-fest. The best I could do was to move thebutton assignment of the gas and brake to the triggers and then tapthem like crazy. The subtleties of braking and acceleration is one ofthe founding pillars of the entire franchise, and its not executedcorrectly here. The games steering is also a little jerky due to thesensitivity setting and limited range of movement of the analog nub.Itseasy to feel like youre a kid in the candy store with GTs openformat, but this edition of the franchise has none of the sweet,satisfying racing that has been its hallmark.", "date": "Oct 06, 2009", "grade": "7"}