{"name": "Deadly Premonition 2: A Blessing in Disguise", "ref": "https://www.gameinformer.com/review/deadly-premonition-2-a-blessing-in-disguise/chasing-its-own-shadow", "text": "Some people think the appeal of 2010s Deadly Premonition boiled down to so bad its good, but I dont think thats accurate. Back then, a lot of us unironically loved the game. It had an earnest charm, conveyed through a unique small-town setting and memorable characters like FBI special agent Francis York Morgan. Yes, it had technical issues, but fans saw past them and developed a genuine appreciation for the gameplay and story. Unfortunately, that degree of goodwill is practically impossible to extend to this sequel; much like the victim at the center of its story, Deadly Premonition 2: A Blessing in Disguise feels like a lifeless relic frozen in ice.The tale is split between two main sections. The first takes place in present day Boston, where a pair of FBI agents are investigating the recent reappearance of a murder victims missing body. As it turns out, this young lady was the central figure of one of Yorks earlier cases, which took place in Le Carr, Louisiana. The agents are appropriately skeptical of Yorks involvement, and his aversion to the color red and insistence on talking to an invisible fairy dont do much to establish his credibility. These present-day portions play like a visual novel, with a bare minimum of interaction and loads of dialogue. Its not a great way to kick off the adventure, and the pacing and line delivery is agonizingly slow.These present-day sections feel plodding, but they dont take up much playtime. The majority of the game flashes back to Yorks time in Le Carr, where he investigates the gruesome murder of a young girl. Once York realizes its connection to a drug ring and the mysterious appearance of red seeds, hes determined to take over the investigation. The case itself is strange and convoluted, and the investigation goes in directions that even the most ardent fans wont expect.I really liked the tone and setting from the first Deadly Premonition, and much of that appeal  at least on the story front  is back in A Blessing in Disguise. Characters are never what they seem, and the setting gives director HidetakaSwery Suehiro and his team access to a variety of archetypes that arent just rehashes of Twin Peaks episodes. There are a few cringe-inducing moments, particularly focused around voodoo and trans people, but none of it feels mean-spirited.Le Carr is home to a robust cast of weirdos, which is probably why York seems to enjoy being there so much. The Casa Pineapple hotel, where York stays, is staffed by a chef, bellhop, and concierge that appear to be the same person. Melvin, the town Sheriff, enjoys recapping whats going on in the style of a movie-trailer announcer. Patricia, Melvins daughter, tags along with York for much of the investigation, providing some sass and local insight. I always looked forward to meeting one of the town oddballs, since its one of those all-too-rare situations where you genuinely dont know whats coming next. In Swerys world, anything truly is possible, no matter how dumb, silly, or outlandish.Deadly Premonition 2 is a frustrating experience because it nails so many of the things that made the first game great. For instance, theres a character named Emma who runs a skateboard shop in her garage. She also plays upright bass at the Owls Nest bar with her dad and the owner. Emmas dad is the towns pastor, and he also runs the medical clinic. All this is to say that Emma wears a layered shirt with stars on the sleeves and the word baptize printed on the front. I dont know why, but it just about killed me the first time I saw it. Its weird while being technically accurate, which is a tightrope walk Swery and his team nailed in the first game. I dont even mind graphical oddities and glitches such as Emma occasionally being rendered in her garage in the same space as her instrument  arms jutting out of its sides like shes wearing a bass-guitar costume. As a fan of the first game, I wasnt expecting technical perfection, but my forgiving approach to these shortcomings ends when they affect gameplay. And boy, do they.Emmas shop isnt just for show. York had his car stolen when he arrived in town, and hes been getting around on a skateboard. Hes a better skateboarder than he was a driver  or at least the controls are better. The framerate, however, just about kills it and everything else in Le Carr's open world. Its a halting, stuttering slideshow that gets worse when using one of the most efficient means of travel. I had to take frequent breaks from playing because it made me nauseated, which has never once happened to me in the decades Ive been playing games. Its awful. The framerate problem isnt limited to your time on the skateboard, either; regular on-foot exploration also pushed my tolerance to its limits. The issue also makes other tasks a complete guessing game; while bowling, the meters that govern your shots strength and spin are rendered nearly useless thanks to choppy performance.These technical complications are puzzling since Le Carr is one of the most empty and least engaging open worlds Ive seen in years. You may see a pedestrian or two, and cars occasionally drive by, but there isnt much else going on. The town is a vast expanse of identical trees and repeated buildings. Fortunately, I was able to avoid some nausea by taking advantage of the fast-travel system, which is available early on. Taking this shortcut means that you wont hear some of Yorks conversations with his alter-ego Zach  but they repeat themselves so frequently that you probably arent missing out. How many times do you really need to hear a recap of Forest Whitakers career, after all?I loved the play-at-your-own-pace philosophy the first game embraced, which is an important aspect that the sequel is missing. The minigames and sidequests just pad out the length; they dont add insight to any of the characters. In one of the most egregious examples, you can go on a series of photo-based scavenger hunts by standing where a photo was taken in an album. Find all 20, and you get a small prize and a chance to do it four more times. Nope. Prizes for these side activities include components that you can use to craft special tokens and trinkets, which increase your various gun-handling stats, give you more stamina, or tweak any other number of behind-the-scenes meters. The game is so trivially easy and meeting Yorks various food and maintenance requirements is so simple that theres no reason to engage with any of these systems apart from your own sense of completion.In Le Carr proper, you can use Yorks pellet gun to shoot bees, dogs, squirrels, and alligators that attack you. When York taps into his ability to access the Otherworld, combat becomes more of a focus. Here, hes able to go back in time and witness what happened during pivotal moments. These parts are interesting, but you have to slog your way through some incredibly tedious action scenes to get there. You basically walk through an unchanging series of corridors while blasting the same three enemy types over and over again. Any tension is thwarted because the game pauses for a split second before these enemies spawn into the world, so you know when to expect them every time. From there, its a matter of shooting the creep in the face and moving on, whether theyre a scissors-wielding clown or creepy succubus. There are boss fights, but theyre such pushovers that I wondered why they bothered showing up.When the credits rolled, I was completely shocked. Not because I couldnt believe who the culprit behind all of this was, or how messed up the final encounter was, but because it came out of nowhere. Characters are built up and then deflated without fanfare. There is a final confrontation, but its hollow and seems rushed. Its a weird paradox overall  a game that is simultaneously too short and too padded out, but here we are. Its bound to be another polarizing title, which ultimately shouldnt come as a big surprise. I just wish I could have counted myself among its defenders this time.", "date": "Jul 08, 2020", "grade": "5"}