{"name": "Soulcalibur IV", "ref": "https://www.gameinformer.com/games/soulcalibur_iv/b/xbox360/archive/2009/09/28/review.aspx", "text": "I've always loved Soulcalibur's brand of weapon-based one-on-onecombat, from its precursor on PSone to the amazing multiplatform sequeland the mediocre third entry on PS2. This latest iteration fallssomewhere in the middle of the series' legacy. While it doesn'trecreate the finely tuned excellence of Soulcalibur II, it sidestepsmany of the issues found in III and adds a ton of single-player depthand lag-free online play. Plus, on an HD display, you really have tosee this thing in motion.Mechanically, Soulcalibur IV is nearly identical to itspredecessors. Equipment breakage and a simplistic blocking gaugestrongly discourage turtling, but otherwise you could easily be playingthe first game with new characters and tweaked move sets.Unfortunately, sideways dodging in IV is just as bad as it was in III,with vertical attacks magically tracking to negate lateral movement onthe defender's part. The flow of a round still finds that magicalbalance between combos, juggles, defense, and positioning more oftenthan not, which is the most important thing. Venturing outside of the traditional Arcade or Versus modes isfinally worth your time here, and not just for unlocking the fullroster of characters. The plethora of challenges, many of which hearkenback to the totally unfair (in a good way) adventures in Soul Edge,will take even dedicated Soulcalibur nuts months to clear. Nearlyeverything you do works toward leveling up your fighters, unlocking newones, and padding your in-game wallet. In most other titles in thegenre, this would be an afterthought. Here, the introduction of anastoundingly deep character creator/editor allows you to customize thelook and capabilities of created characters and stock fighters to animpressive degree. I normally don't bother with this sort of peripheralfrippery no matter the genre, but I spent almost as much time playingwith the character editor as I did beating the crap out of Miller orthe CPU.Skills like ''Auto Grapple Break'' and ''Invisible'' add a wackyelement to the game, but it's all fun and games in single-player sincesetting up your favorite fighter to handle some of the more unfairchallenges can be an entertaining metagame. Hardcore fans can relax,though  Arcade and Standard Versus modes still require unmodifiedcharacters, so you don't have to deal with the lack of gameplay balancethese new skills present.Online play, a first for the series, is well implemented. Most ofthe matches I played were lag-free, and the matchmaking system workswell. It still doesn't beat having a couple of buddies over and passingoff the controller between bouts of smack talking, but the option isnice.Frame-counters and other savants will probably have issues with someaspects of Soulcalibur IV's gameplay, but the average player orfighting game enthusiast is well served by this title's array of gametypes and tight weapon-based duels. I know I'm more than satisfied.", "date": "Sep 28, 2009", "grade": "8.75"}