{"name": "Transformers: Revenge of the Fallen", "ref": "https://www.gameinformer.com/games/transformers_revenge_of_the_fallen/b/wii/archive/2009/09/22/review.aspx", "text": "I have many childhood memories of playing with Transformers toys. They may not have had motion controls, professional voice work, or onscreen reticles, but in my imagination they fought colossal battles. Somehow this game has reached through time, stole all those memories, and poured a tank full of Bumblebee's bladder oil all over them. If this is what it's like to play with Transformers nowadays, I want no part of it. If I hadn't already seen the film, I might assume that it consists of the Transformers spending two hours running past the same five set pieces while Bumblebee delivers line after line of terrible dialogue. Yeah, Bumblebee talks, and that's not the only inconsistency between the game and the film. But you won't really care, since you're too busy shaking your head at the waves of cookie cutter enemies and the game's tiring action. You might want to wear a wrist guard, because Transformers' motion combat is so unresponsive you end up shaking the remote hard enough to give you tendonitis.For consistency's sake, the rest of the game's mechanics don't work either. Your aiming reticle for long-range attacks is overlaid atop the screen like in an FPS rail shooter. The problem is that this is a third-person action game, so sometimes the Wii can't tell whether or not you want to shoot the enemy in front of you or behind you. However, the Transformers' worst sin is that you can't transform into vehicle form during the action. Isn't that the point of Transformers? They transform! Maybe this game should be called Giant Robot Forms.Marginally entertaining rail sequences help change things up, but they are brief levels, and the game's two-player co-op does the minimal amount of effort meet the definition of the term  the second player is a sprite with limited attack options. In short, Transformers: Revenge of the Fallen is a gameplay disaster filled with one-dimensional characters that lacks many of the impressive ILM effects from the film. Yet somehow its story is still better than the movie's.", "date": "Sep 22, 2009", "grade": "5"}