{"name": "The Bigs 2", "ref": "https://www.gameinformer.com/games/the_bigs_2/b/ps3/archive/2009/09/22/review.aspx", "text": "The Bigs 2's main attraction is a story-driven career. Your player once had the makings of a five-tool Hall of Famer, but an injury knocked him out of the league. For reasons the game leaves to your guesswork, he travels to Mexico to rehab. After just a two-game stint, he makes a miraculous return to the majors. The road ahead is to regain your former skills so that you can make a final run at the Hall of Fame.While this story smells of used needles, I enjoy this game's approach toward Hall of Fame election. A committee of players and sports writers won't review your career numbers. In this game, the only way to make it to Cooperstown is to beat the best at their own game. It's just a game of baseball, mind you, but the way the game delivers it has the tone of a Mortal Kombat match. As amusing as it would be to play them in their current age, you won't be staring down a 42-mile an hour fastball from Nolan Ryan. All of the players have magically reverted back to their prime, and as The Bigs 2 suggests, have been fed nothing but a steady diet of steroid burgers. Outside of the legendary match-ups, your player is asked to complete goals throughout a number of shortened seasons (none lasting over 15 games). Fun side challenges also pop up from time to time, such as a timed games of spitfire contact swings against Chipper Jones. The problem is that every goal must be completed before your player can move on to the next challenge. In one game, you may be asked to beat the opposing team, get a single, and steal a base. If you miss one of these goals (such as swiping a bag with a slow player), you must play the game again. More accurately, it's playing it again, and again, and again.The gameplay also proves to be an untimely culprit, thanks mostly to the new Big Slam power-up. This balance-breaking ability grants the offense with four swings -- the first three are for singles, and the fourth is a mighty home run stroke. This power-up can create a dramatic finish to a game, but moreover, it will drive the player on the receiving end insane because he has no control over the outcome. For whatever reason, the pitcher only gets to place the first pitch. The AI controls the remaining three. Why on earth would you strip away control for the biggest play of the game?Minor aggravations, at least in comparison to the humiliation suffered from the Big Slam, also surface from faulty AI. Pitchers don't always cover first base. Runners on second often retreat to the base on a slow ground ball hit to the right side of the field. The computer also over abuses Legendary and Great catches.If you're willing to play the game of ''try, try again,'' you can have fun with The Bigs 2's career mode. However, if you're looking for a multiplayer game or an experience based on skill, the unbalanced run scoring and Big Slam will drive you crazy.", "date": "Sep 22, 2009", "grade": "7"}