{"name": "Rhythm Heaven", "ref": "https://www.gameinformer.com/games/rhythm_heaven/b/nintendo_ds/archive/2009/09/22/review.aspx", "text": "Rhythm Heaven introduces a refreshing variation on the music game; instead of increasingly difficult combinations of notes, colors, and speed, it's all about simple taps and flicks on the touch screen. Complexity arrives in the form of the constant flow of new situations in which players must find the beat. Poppy tunes and the basic graphics can feel either charming or shoddy, depending on your perspective. However, the simplistic controls allow for some genuinely entertaining challenges.The setup is uncomplicated. A progression of minigames unlocks one-by-one, and each has some absurd situation to confront with your rhythmic acumen. Sing along in time with a choir. Assemble robots in a factory. Dance your way through a lizard mating ritual. Before each task, a tutorial lays out the cues to watch for, and when you should be tapping and flicking. It'd be nice to have more choice in which game to tackle at any one time, but most of these puzzles are straightforward enough that you'll move on to the next within minutes.In many ways, the game shares as much in common with an old game of Simon as it does traditional music releases. While your rhythm is certainly being tested, an equal portion of the action is pattern recognition. Audio and visual cues telegraph the action to take, and fast reflexes and observation are key. The game shines in the moments it drops you into a groove and demands those skills in abundance.Unfortunately, many of the minigames just don't have that level of depth. As a result, the initial playthrough of a given stage will frequently be your last, despite attempts that the game makes at asking you to go back and perfect your performance. Rhythm Heaven ends up being pretty limited in its ambitions and scope, but I can't deny that it had me toe-tapping along for the ride.", "date": "Sep 22, 2009", "grade": "7.5"}