{"name": "Tiger Woods PGA Tour 10", "ref": "https://www.gameinformer.com/games/tiger_woods_pga_tour_10/b/wii/archive/2009/09/22/review.aspx", "text": "Golfers are always searching for more consistency in their game.Last year's Tiger wasn't one of my favorites, but for the sake ofconsistency, developer EA Tiburon sticks with the concepts put in placein 09. I consider Hank Haney and the variable skill system mistakesworth correcting, but EA clearly doesn't, going forward with moremodest additions instead. Tiger 10 is a predictable, yet skillful, parputt instead of a thrilling Tiger-at-Augusta moment. Ironically, Tiger 10's main addition is the incorporation ofreal-life elements, whether it's Tiger talking about big moments in hiscareer, the U.S. Open, six new courses, or the replication of tourmoments (with real pros instead of EA's made-up characters) asintegrated in this year's version of Tiger Challenges. I've alwaysappreciated the series' ability to simultaneously strive for realismwhile at the same time not take itself too seriously. These real-lifeelements are subtle yet effective at putting you in the PGA withoutlosing some of Tiger's more tongue-in-cheek principles, like getting astat bump by wearing a bunny suit. This year the game funneled metoward playing PGA tour events quicker than previous Tiger iterations-- another small move towards emphasizing real life.As effective as these tweaks are, they aren't monumental enough tomake you jump out of your golf cart. In fact, one of the more hypedchanges is conspicuous by its understated nature. The touted precisionputting feature is nothing revolutionary, but merely a new HUD torepresent your swing while putting. Likewise, the inclusion of rain isnot unwelcome, rather it's simply strange that it hasn't happenedbefore on next-gen systems.Tiger 10's place in the franchise's history is such that makingmountains out of molehills is necessary, because this year's gamecovers a lot of bases -- except for the long-asked-for create-a-coursefeature. The online portion is jumpstarted by continuously rollingtournaments that come in daily and weekly flavors. There's even a wayyou can try and match the pros' scores as they are posted from whereverthe tour is that week (no putt preview or spin here). It's no onlinetour, but it's a step in the right direction; the kind of slow progresswe're seeing in the franchise these days.Wii MotionPlus is a great boon to the Wii version of Tiger -- the game is merely a 7 without it. The peripheral allows for fidelity of swing to the point where controlling draw/fade is easy and accurate, and taking something off your shots for a precise approach shot makes Wii MotionPlus a must for this game. The rest of this Wii version of Tiger is the same (including the online tourneys), although what it lacks in the Gamernet feature it makes up for in an older skill system that I personally prefer to the newer Hank Haney one.", "date": "Sep 22, 2009", "grade": "8.5"}