{"name": "Ready 2 Rumble: Revolution", "ref": "https://www.gameinformer.com/games/ready_2_rumble_revolution/b/wii/archive/2009/09/22/review.aspx", "text": "Never in my wildest dreams did I think I'd encounter a game so thoroughly terrible. Where do I even start? The racial stereotypes? The positively broken controls? The revolting art design?Ready 2 Rumble sucks in every conceivable way. The controls rely almost completely on remote and nunchuk swings that are so similar that the Wii cannot keep track of what you want to do with any consistency. Pulling back on both is supposed to initiate a backwards dodge, and maybe once every five times it actually works. The rest of the time your character lets loose a flurry of random punches. Harder hits require you to pull back your arm first and then punch forward, but most of the time the backwards motion triggers a weak punch that cancels the wind-up. This is just a small slice of the complete mess. Of course, the AI has no problem blocking and countering most of what you dish out (on purpose or accidentally). If your opponent's Rumble meter fills up it's basically curtains unless you can run away until the round timer runs out.The career mode is the crowning achievement in this massive train wreck. You start out with a created character who is somehow even less responsive than the default hideous celebrity parodies and offensive racial stereotypes. I chose punch power as my fighter's specialty. Not only was he still a weak piece of crap, he moved like he was wading through a pool of Jell-O and became tired after a single punch. Sure you can try to power this *** up in training minigames, but the motion sensing is flat out broken on all but two of these. Try to match up movements to onscreen arrows in jump roping and jogging and you'll wonder if your remote batteries are dead. Then when you inevitably fail most of these training sessions, your stats get even worse and you're expected to fight progressively tougher opponents. It's like Satan is beta testing Ready 2 Rumble: Revolution on Earth for its prolonged tenure in hell.", "date": "Sep 22, 2009", "grade": "1"}