{"name": "Crucible", "ref": "https://www.gameinformer.com/review/crucible/crucible-review-a-slow-struggle", "text": "Hero shooters are all the rage these days, so games in the middle or bottom of the field struggle to compete against the lead dogs. Crucible is one of those games, where its mediocrity only earns dismissal. Crucible is like a bland and forgettable meal  inoffensive going down, but quickly passed over for something with a little more flavor and spice.Crucibles heroes fail to entertain on the personality and character level, but they often have memorable and interesting moves that cater to perfection and learning. With the exception of the adorable robot Bugg, most of the cast lacks appeal. With color-by-the-numbers characters like Military Man, BerserkerLizard, and Fish Sniper, the heroes feel like they were ripped from the pages of a rejected comic book.On the loadout side, learning a characters nuances is highly entertaining. For example, the militant Sazan has a set of skills that's easy to understand on the surface, but has lots of room for growth and skill. Discovering how to distance myself to juggle my assault rifle, shotgun, and throwing knife cooldowns was a fun exercise. Mastering a moveset, both partial and perfectly, is satisfying and applicable to many of the heroes.The map, with its event spawns that help drive the action, is a suitable environment with plenty of spaces to play in. While there is only one map, it's constantly changing with different spawns to mix things up, and you can learn the locations of various landmarks to duck behind cover or jump off a ledge. Event spawns differ from game to game, but many are simple NPC enemies. Other events like power capsules enhance your whole team, but much of the time you may not see another soul as you complete these tasks in an arena largely devoid of activity.Team clashing is the best part of the game, with skirmishes that pick off players and small-scale engagements taking the spotlight. True 4v4s are interesting, but theres a distinct lack of teamplay elements. The combat is weightless outside of a few big attacks, with little feedback or punch to most weapons and abilities. Everyone simply does the same thing they would normally be doing in a 1v1 scenario and hopes things shake out. Crucible lacks any in-game voice communication, which forces you to connect with people you already know via other services. For example, letting teammates know you're sacrificing an objective to glean an edge elsewhere is an important memo to relay, as they may go and fight otherwise and end up putting the other team even further ahead. A ping system attempts to mitigate this, but its not practical. Depending on the game, you may not even see the other team much, as you both farm dinosaurs and pick off stragglers in 3v1s or trade control of points of interest.One of the larger issues is the PvE component, which tasks you to essentially spend time dunking on dinos and spitter creatures between encounters with the other teams. The battles against these NPCs are fun for a few games, but then they become an absolute bore and a chore. The PvE component does everything it can to tear you away from fighting other players, instead forcing you to slaughter uninteresting one-note blobs of XP wholesale instead of actually playing the game.Of the three game modes, the only one worth mentioning is Heart of the Hives. If youre going to play, this is the mode to check out. Two teams of four battle over PvE objectives, so you have cool decisions to make, like when to engage with the somewhat dangerous PvE entity or if you should cede a flag capture to the other team so you can grab some levels and powerups for an easier win. Like many other aspects of the game, this mode provides fun for a few games, and then fades from memory altogether. Eventually you realize that you could be doing something else or playing something more fun than being slowly dragged across the map on a dino-chain for what might be a slightly satisfying team fight.Crucible isnt a bad game, but its not a good game either. In the context of todays hero-shooter environment, that makes it a lost soul, struggling to find a strong sense of identity. With time, perhaps Crucible can find reasons to stay on the menu, but right now the recipe is diluted and dull.", "date": "May 29, 2020", "grade": "6.75"}