{"name": "Dragon Quest V: Hand of the Heavenly Bride", "ref": "https://www.gameinformer.com/games/dragon_quest_v_hand_of_the_heavenly_bride/b/nintendo_ds/archive/2009/09/22/review.aspx", "text": "Like many North American players, this was my first time diving into the world of Dragon Quest V. The DS remake of the Japanese Super Famicom original (and more recently a Japanese PlayStation 2 remake) does a fantastic job of updating the game, with some gorgeous and amusing character designs and a couple of new additions that make the game feel like new. Its quaint and familiar coming-of-age story doesn't break any ground, but it is well told and it's clear that the localization folks put a lot of love into crafting clever dialogue. The only place the game hasn't seen a suitable adjustment is in its slow and laborious climb through levels. The game demands a devotion that old-time RPG fanatics will be familiar with. Other players may balk at the intense grind necessary to progress.Dragon Quest V was unique at its time for the sprawl of its timeline, and this element still delivers effective drama. The main character is viewed throughout the passage into his adulthood, and that concept alone helps lend weight and drama to the affair. Combat is par for the series, with monsters appearing in a first-person view on the screen, and some basic commands available for taking them down. This installment adds variety through the ability to recruit enemy monsters, a feature that later installments would embrace. Enjoyment is reliant on a willingness to face the game's steep difficulty and unforgiving approach to balancing. Grinding for levels is a basic necessity before moving on to a boss, save points are infrequent, and death is both common and taxing on the bank account. Push through those challenges, and the vibrant game world is filled with well-drawn and well-written characters. Despite a clear desire to update, Square Enix and ArtePiazza have left the flow of gameplay much closer to a classic RPG than any recent Japanese RPG. Old-school fanatics should enjoy the gorgeous audio and visuals, but beware the slow crawl to victory.", "date": "Sep 22, 2009", "grade": "7.5"}