{"name": "Final Fantasy Crystal Chronicles: Echoes of Time", "ref": "https://www.gameinformer.com/games/final_fantasy_crystal_chronicles_echoes_of_time/b/wii/archive/2009/09/22/review.aspx", "text": "Final Fantasy has always taken us into fantastical otherworldly realms. With beauty and craft the series has never been afraid to explore uncharted territory. The brave new world where Echoes of Time takes us is one of complete system interactivity  a magical place where Wiis and DSes play the same game, where handheld owners can adventure together with those sitting at home in the comfort of their home theater. This exciting system-linking multiplayer technology works flawlessly, with no need for Wi-Fi and no frustrating friend codes. Yeah, it has all that if you want it, but the basic power and play co-op is surprisingly easy to use. Play solo and the game lets you form a team of AI allies who are still fairly useful. You start the game on the morning of your coming-of-age ceremony, just as one of your childhood friends is struck down with a mysterious disease called Crystal Sickness. Oddly enough, you're the only person in town who's capable of leaving, so you set off from your hermit village in search of a cure. Along the way you'll start running errands for a librarian with a strange German accent whose motives remain mysterious. The narrative earns a passing grade thanks only to Square's superb localization. Its ability to write amusing dialogue amid mundane situations adds a tinge of invention to the otherwise banal story. This gameplay follows in the footfalls of last year's Ring of Fates, but with a few important enhancements. Spells are now a learned skill, and replenishing your MP is quick and easy, so you no longer have to worry about your magic well drying up. On top of that, you can combine spells, laying one on top of another, creating a double threat for any monster vulnerable to both ice and lightning. The combat is less sloppy this time around, and while the action is still simplistic, there are some entertaining puzzles scattered across the game's varied locales. Crystal Chronicles has a history of imperfection, and Echoes of Time continues that tradition with a few technical annoyances. On both systems, there is only one save slot, and no way to pause the game even when you're playing by yourself. It also would have been nice to adjust the fixed camera, which makes platforming a chore. The game was clearly developed for the lowest common denominator, which is a shame, because, while the graphics look fine on a handheld, they'll make you wince on a big screen. It may be far from perfect, but Echoes of Time's amusing gameplay and ground-breaking multiplayer make this the most noteworthy Crystal Chronicles title to date.", "date": "Sep 22, 2009", "grade": "7.75"}