{"name": "Fuel", "ref": "https://www.gameinformer.com/games/fuel/b/ps3/archive/2009/09/22/review.aspx", "text": "It's a big world out there, and few are larger than Fuel's. As massive as this title's map is, it's natural that you're going to get lost. But aimlessness isn't necessarily what you want to hear when talking about a video game. Fuel delivers on its main points by offering a world full of races and exploration, but it lacks the context that has helped make recent Codemasters racing titles such as Grid great.Fuel's world is split into camps, which are areas carved out of the game's map. Although you can freely drive through all the camps in the free ride mode (which you can switch in and out of at any time), each camp has its own career races and bonus challenges. Both of these are accessed via a menu or by coming across them naturally by driving around. Performing well in races earns you more fuel, which is the in-game currency you use to purchase the horde of vehicles and unlock new camps. I played Fuel methodically  I would dust off most of the career races and some of the challenges within each camp before moving on to the next one. I wasn't satisfied with simply roaming around the map looking for whatever came my way  although you can certainly do that. I just don't find it that interesting to hunt down the liveries, challenges, and fuel hidden in the wilderness, which often feels like a chore. This undercuts the effectiveness of Fuel's open structure.The online portion also works against the sense of freedom the game attempts to convey. Meeting someone and getting into a race isn't as seamless as in Burnout Paradise or Test Drive Unlimited, and you can often miss a friend even if you're in the same location. Similarly, the entire offline game experience feels disjointed due to the loading between free ride and career modes, as well as every time you crash  which the game doesn't even show you.Fuel may not have hit the mark in its structure, but the racing itself is fun. Races are fast, cross-country affairs that show off the game's true strength: its varied terrain. You're free to take any path to hit a checkpoint, but most of the time you'll stick to the main one, with a few detours along the way. In order to win fuel you have to come in first, which unfortunately discourages true exploration and risk-taking during a race, since going off the beaten path can cost you valuable positions. Races often have their moments, however, whether it's a tornado set piece that tears through a level or when you find a clever route that no one has discovered. Some gamers may appreciate the freedom Fuel gives you, but I feel like the lack of payoff and context blunts any adventurous feelings I have.", "date": "Sep 22, 2009", "grade": "7.75"}