{"name": "Plants vs. Zombies Garden Warfare 2", "ref": "https://www.gameinformer.com/games/plants_vs_zombies_garden_warfare_2/b/xboxone/archive/2016/02/23/beginning-to-bloom.aspx", "text": "With a sequel firmly cementing its status as a series and not just a strange one-off, Garden Warfare continues to be an unexpected experience. The humorous tower-defense series that birthed the world and characters of Plants vs. Zombies initially didnt seem suited for the shooter treatment, and with the issues plaguing the first game this may have been the case. Garden Warfare 2 fixes many of the problems that dragged down the first game, leading to a much fuller experience with lots of worthwhile new content.The core Garden Warfare 2 experience is mostly unchanged from the previous game. Every class on each side of the war has distinct abilities that players unleash to take out members of the opposing team, or defend points. The gunplay is simplified compared to the shooters Garden Warfare 2 intentionally references, but its in favor of a more inviting experience and I appreciate it for that reason.Both the plants and zombies have new classes, alongside those returning from the previous game. The new classes have entertaining abilities like turning your opponent into a goat, or calling in a Titanfall-like mech for a temporary boost. Having the familiar classes from the previous game is welcome, and being able to bring most of your unlocks forward is a nice bonus. Kernel Korn and Captain Deadbeard quickly rose to the top of my list of favorite new characters; the former is able to call in an airstrike with a pad of butter and the latter can infiltrate the enemy as an explosive barrel. The newcomers are far from reskinned or slightly adjusted versions of familiar classes.Your main focus is collecting coins to buy randomized packs of cosmetics, inventory items, and new sub-classes. Opening up a blind bag of unlockables and discovering a prize is exciting, but I found myself focusing on a few classes I enjoyed and frequently got unlocks for characters I had little interest in using. The inventory items, which are used like stationary turrets or other helpful items, are also earned from card unlocks and continue to feel unnecessary. They offer a tease of tower-defense mechanics in the online battles, but they do so little to sway the combat that I rarely used them, and strangely felt guilty as though I was wasting them whenever I did.The number of modes has increased, offering new twists on familiar shooter game-types, but the best are the ones that embrace the strange. One mode has you guarding points along a long level, culminating with each team trying to roll giant balls into goals. It surprised me in the best way the first time I experienced it, and I continued to enjoy the weird pop-up sports game every time it appeared.A major complaint of the first game was its lack of single-player content, but this entry has much more to do as a lone player. Examining your progress, jumping into multiplayer, and looking at your unlockables all take place in a large open area you can explore. It goes a long way in making the strange, possibly future post-apocalypse setting feel like a real place. Garden Warfare 2 also adds campaigns for both the zombie and plant sides of the war, each with a worthwhile unlockable mode at the end. You wont find much of a story or flashy cutscenes in either campaign, but they each give you a chance to learn the game on your own terms.Garden Warfare 2 is active and engaging throughout. Finding challenges to take on, even when you dont want to play online, is easy, and everything feeds into your leveling and unlocks regardless of where you are playing. The new classes add worthwhile abilities (and character designs), the new modes keeping things moving (and are often weird), and the combat is interesting, without venturing into the cumbersome or complicated.", "date": "Feb 23, 2016", "grade": "8"}