{"name": "50 Cent: Blood on the Sand", "ref": "https://www.gameinformer.com/games/50_cent_blood_on_the_sand/b/xbox360/archive/2009/09/22/review.aspx", "text": "So 50 Cent and G-Unit just finished a Mideast tour, waxing booties from Dubai to the United Arab Emirates. The only problem? A shady promoter had planned to pay the crew with a diamond-encrusted skull worth $10 million, only to have some armed goons steal the goods. The only solution? 50 and his crew strap up and go on a rampage across a host of war-torn urban environments, blowing up everything in their path. A bit ridiculous? Sure, but I hardly expected a troubling mediation on social control and the writings of Ayn Rand. With this silliness in the background, you can get down to the basics of the game killing the living hell out of every enemy, helicopter, and Hummer that crosses your path. To its credit, the game gets most of the genre basics right. There's a good selection of weapons, some track shooting sequences for the sake of variety, and more carnage than you can shake an M4 at. The basic cover and aiming mechanics will be familiar to anyone who has played Gears of War, as will the easy-to-use melee combat. The level designs aren't much more than shooting galleries, but the gameplay is consistently fun and engaging.Single-player is fun, but the game really shines in the two-player co-op mode. Players can instantly jump in and out of a friend's saved game and join the fracas. Having a partner is a blessing, as the game's enemies frequently assault from all angles, often from protected positions high above or from armored gun turrets. While it's not exactly tactical combat, there's a distinct benefit from taking down foes from multiple attack routes. Even better, you have someone to laugh with when 50 drops a line like ''I'mma destroy your whole m-----------g generation, m----------r!'' The game also puts the Unreal engine to good use, displaying a host of gorgeous onscreen pyrotechnics.50 Cent's first foray into video games (50 Cent: Bulletproof) was a hot mess of action cliches and poor control, so kudos to new developer Swordfish Studios for delivering a vastly improved sequel. It's a thuggish, high production value exercise in excess not unlike the music of the man that inspired it.", "date": "on Sep 22, 2009", "grade": "8"}