{"name": "NCAA Basketball 2009", "ref": "https://www.gameinformer.com/games/ncaa_basketball_2009/b/ps3/archive/2009/09/22/review.aspx", "text": "With 2K Sports' College Hoops bowing out of the competition, NCAA Basketball 09 is the only hoops game dedicated to March Madness. Even without the pressure of a competitor, the publishing juggernaut EA didn't stay stagnant, but the end result is far from a blue chip prospect. The gameplay still suffers from some legacy problems (players stepping out of bounds, excessive backcourt violations, players slowing on fastbreaks, players getting locked into animations), but the general gameplay is adequate. Posting up on the low block, cutting to the rim with a freestyle move, calling for a pick and roll, and jumping passing lanes to create turnovers on defense are all easy to execute. The teams also make better use of their benches this season.The on-court presentation has also improved. *** Vitale's boisterous shtick is an acquired taste, but Brad Nessler does a great job of play-by-play and the game makes better use of stat boxes to update you on fouls and player performances. The crowd also reacts more in tune with the rhythms of the game, standing to applaud a come-from-behind basket or thundering dunk. EA's marketing feature du jour is ''Set the Tempo,'' which is shoved down your throat via a pre-game tempo checklist, coaching tips, a tempo meter, and Vitale's vocal obsession with the imaginary struggle to control the pace of the game. Keeping the game in your team's ideal tempo (half-court, balanced, or fast-break) supposedly earns your team shooting bonuses, but this failed to materialize in any meaningful way. Whether I was running and gunning or setting up offensive plays and slowing the pace, the difference seemed negligible. Dynasty mode features a drastically improved recruiting system more akin to its football brethren, but its clumsy interface doesn't make the job easy. Every time you drill into a player's menu to check out his current standing or scouting report, your list of targeted players resets as you exit, meaning you must once again drill into the specific view you previously procured. Unfortunately, the dynasty mode is offline only. EA once again skimped on the multiplayer options and limits you to player-versus-player matches. At least they let players share rosters.NCAA Basketball 09 may not offer the wealth of options or polished gameplay of its former competition, but it's still a decent baller worthy of a look from hardcore college hoops fans.", "date": "Sep 22, 2009", "grade": "7.25"}