{"name": "Neverwinter Nights 2: Storm of Zehir", "ref": "https://www.gameinformer.com/games/neverwinter_nights_2_storm_of_zehir/b/pc/archive/2009/09/22/review.aspx", "text": "Do you know the mechanical differences between Sorcerer and Wizard spellcasting in 3rd Edition Dungeons & Dragons? How about the exception to the basic rule about stacking bonuses to a single die roll? If you know what I'm talking about, this new expansion for Neverwinter Nights 2 is for you. Gamers who don't know the difference between a fireball and a fireburst may as well turn the page, because there is nothing for you here.Storm of Zehir has players create a four-person party of adventurers (a first for the series) and dumps them in the middle of a hostile landscape, where the heroes forge alliances with dubious powers and rely on spells and blade skills to survive daily life. A spiffy new overland map makes use of the party's secondary skills like survival, spot, and listen, along with giving players a ton of real estate to search for and inevitably find dungeons, treasure, and monsters aplenty. Since resting is no longer trivial, building a party that can handle the challenges without blowing through half its spells every time it comes across a wandering group of kobolds (and believe me, you'll find lots) is critical. It's a fantastic Dungeons & Dragons simulator, and for grognards like me who nerd out over wringing every last ounce of character power out of the rulebook, it's a dream. Mind Flayers? It's cool, I have magical mental defenses just in case. Dragons? No worries, we have resistance gear somewhere on this pack mule. Conquering challenges like this is what drives a certain segment of the D&D populace, and few video games to date serve that demographic as well as this title. Anything ancillary to the pure expression of D&D 3.5 Edition rules is an afterthought. The story is serviceable in a D&D prefab adventure sort of way, but this is more like Icewind Dale than Baldur's Gate. Beyond that, it's like Obsidian made the awesome framework for celebrating the D&D system and then went down a checklist before sending it out the door. Storm of Zehir has dialogue, cutscenes, voice acting, and tutorials, but only in the barest of senses. I can't stress enough that this expansion is for hardcore Dungeons & Dragons nerds. Go into it knowing what it is, though, and this will deliver the kind of no-frills classical Western fantasy RPG experience that made series like Might & Magic and Wizardry great.", "date": "Sep 22, 2009", "grade": "7.5"}