{"name": "Bionic Commando", "ref": "https://www.gameinformer.com/games/bionic_commando/b/xbox360/archive/2009/09/22/review.aspx", "text": "Nathan ''R.A.D.'' Spencer has a bionic arm, and he's been pressed back into service after five long years in prison. His arm is a miracle of science, allowing him to do things no other man could manage. Unfortunately, it has a number of flaws, not the least among them is that its great weight pulls him under if he falls in the water. At times, you wonder whether Spencer would be better off without his bionic enhancement. The game suffers from a similar dilemma -- a lot of great ideas and mechanics are trying to rise to the surface, but fundamental flaws inevitably pull it down.The more you play Bionic Commando, the more you scratch your head. Why is Spencer fighting? What is his ultimate objective? Why do we care? These questions are best left for a different game where the plotline is more than an excuse to swing into the next stage. Tack on the most idiotic twist ending in years, and the game seems more like a parody than straight-faced action fare. The core experience of swinging through environments should be the heart of the game; if done correctly it's more than capable of making up for a lackluster story. At times, careening through the air is fast and thrilling. Then you fall into a pit, your arm can't reach a cross beam, some enemy guns you down, or (my personal favorite) you swing into a radiation zone and die. The game conspires against you freely navigating the environment, instead making you feel fragile and clumsy. It's not the sensation I'm looking for from my machismo-laden killing machine.Despite my obvious frustration at the title, I can't disregard Bionic Commando's strengths. Environments look great, and the voice work and music are top notch. Watching a bunch of commandos swinging around the same stage trying to blast each other in multiplayer is also fun. However, it's hard to forget the unresponsive controls, ludicrous story, and questionable combat encounters. The game is uneven and inconsistent enough to scare away even eager fans who have patiently waited 20 years for another swing.", "date": "Sep 22, 2009", "grade": "6.25"}