{"name": "Resident Evil 5", "ref": "https://www.gameinformer.com/games/resident_evil_5/b/ps3/archive/2009/09/22/review.aspx", "text": "Isolation is a powerful tool for instilling fear. Staring down an overwhelming horde of supernatural foes with only a handgun at your side isn't enough; true terror dawns when you realize you are alone, and no one is coming to save you. Until recently, if you had told me that it was possible for Resident Evil to harness dread and desperation by giving players a competent ally who can bail them out of trouble, I would have rolled my eyes in thinly disguised disbelief. Now I've played Resident Evil 5, and I believe.The latest entry in Capcom's zombie-infested juggernaut pairs special agent Chris Redfield with Sheva Alomar, allowing you to play co-op through the entire game. If you think having a buddy in the field diminishes the stakes, think again; working with your partner explores new avenues of fear and intensifies every encounter. It was terrifying to see a chainsaw-wielding, burlap-wearing freak bearing down on you, but wait until you see it happening to your partner only feet away. You'll watch through a sniper scope as an infected mob surrounds your friend, and frantically lob grenades at hulking abominations to buy time for your partner to line up a clear shot. The presence of another player transforms Resident Evil's signature style of combat into a harrowing mixture of tactics, cooperation, and survival  all while retaining the same carefully crafted atmosphere of looming horror and anything-can-happen thrills. If you aren't playing Resident Evil 5 with another person, you're really missing out  not only on the best this title offers, but also on one of the best multiplayer modes in gaming, period. Even if playing co-op isn't an option for you, the inventive gameplay and heart-stopping action still put Resident Evil 5 ahead of the competition. The pacing is nothing short of brilliant, with pockets of desperate combat and surprise encounters separated by almost enough time to catch your breath. One moment, you're slinking through dark and abandoned mining tunnels, and the next you're in a full-blown firefight with tentacle-head zombies and dynamite flying from all directions. Great set-piece sequences, explosive boss fights, and run-ins with familiar foes are liberally placed from beginning to end. Things sometimes go a bit far afield; zombies wielding machine guns and taking cover behind crates make the later levels feel more like a shooter than survival horror, but the gameplay is so tight that the genre distinction is irrelevant.It doesn't even matter if you aren't a diehard Resident Evil fan. The story bears the heavy burden of the series' extensive lore, and newcomers (or even just RE 4 fans) will be totally perplexed by the convoluted connections between characters and events. Thankfully, the gameplay is much more of a draw than the narrative; once you start playing, you won't want to stop. The game leads you from one jaw-dropping moment to the next with remarkable ease.If you opt for a single-player run-through of these events, the computer-controlled Sheva is surprisingly competent (though she has an inordinate affection for her handgun even when better weapons are available). Unlike many games with AI companions, the action never degenerates into-an escort mission. Sheva can take care of herself, but she is generally unobtrusive and only occasionally helpful. This lends the single-player experience more of a Resident Evil 4 flavor, which delivers a different  but still mesmerizing  brand of white-knuckle gameplay.While retaining much of the spirit of the previous entry, Resident Evil 5 is unquestionably an evolution. A revamped inventory system keeps you in the moment by eliminating the heavy item-management requirements, and the control scheme ditches most of the archaic holdover mechanics from the series' past. However, games like Dead Space have proven that moving while aiming does not kill the mood in a horror game; at this point, rooting Chris and Sheva in place while firing seems more like a cheap and artificial way to increase difficulty than a technique to enhance tension.Resident Evil 4 was among the best games of the last generation, setting unprecedented expectations for the next entry in the series. Resident Evil 5 succeeds in staying close to what gamers loved about the last title, but it also takes risks that pay off in unexpected ways. Co-op changes your approach to survival horror, and the masterful pacing ensures you never take your eye off the action. Like its predecessor, Resident Evil 5 is destined to be remembered as one of the best games of its time.", "date": "Sep 22, 2009", "grade": "9.5"}