{"name": "Deliver Us The Moon", "ref": "https://www.gameinformer.com/review/deliver-us-the-moon/deliver-us-the-moon-review-love-and-loss-in-space", "text": "When we look to the moon, we see nothing but a glowing rock that lights up the night sky. But what if it were humanitys last hope for survival? This is the basic premise in Deliver Us the Moon, a nicely penned story of isolation and loss that puts you in the role of an astronaut who travels to the moon to save the planet. While leaning heavily on walking simulator conventions like story progression coming from talking holograms and written documents, developer KeokeN Interactive doesnt shy away putting you in exciting, do-or-die scenarios when things dont go as planned.Deliver Us the Moons writing is the driving force, but this sci-fi journey is also strong in its pacing and variety, which help build momentum, create tension, and make it seem like every second matters even though you mostly play at your own pace.The game tells the grim tale of Earth running out of natural resources, forcing humanity to the stars to find other solutions. As luck would have it, we dont have to travel far, as the moon is rich in a powerful isotope called Helium-3 that could solve the energy crisis. The nations of the world unite and develop a revolutionary way of transmitting Helium-3 to Earth. Just when it seems we have a new beginning, the moon falls silent and the transmission ends. We have just enough energy to send a one-man rocket to the moon to figure out what went wrong, and hopefully bring the Helium-3 feed online again.Your first steps arent made on the moon, and instead unfold on Earths surface, which looks eerily alien given the yellow sky and dust-filled air. Your mission is to power up the rocket and launch. This is an awesome moment since you manually need to bring the rockets systems online from within the cockpit. You are tasked to quickly throw the switches in the right order, a moment KeokeN cleverly achieves by highlighting your next interaction in a pink hue  making you look like a well versed astronaut. You then get to experience the rocket launch from a first-person perspective, which beautifully illustrates the transition from Earths atmosphere to space.When you reach the lunar establishment, which is in ruin and not occupied by any life, exploration unfolds from both third- and first-person angles, often determined by the type of actions you must complete. Third-person view is used primarily for on-foot sections, which can be as tame as exploring living quarters for clues or as thrilling as darting dangerously past spinning blades in low gravity. These moments are backed by well-designed controls and sometimes stunning set pieces, like a tall tower crumbling with you on it. There isnt any combat, but if you dont move quick enough in certain areas, youre going to fail and have to retry.The first-person camera is used sparingly, but is effective for intense, intimate moments, zero-gravity flight, and controlling a floating droid tied to some of the games best puzzles. I was a little annoyed that almost every door you need to access requires a puzzle or keycode, and some of your actions feel repetitive and lose their electricity after doing the same thing two or three times. For instance, taking a lunar rover onto the surface is enthralling the first time, but feels like a chore the next time out.Most of your effort is spent exploring and following the narrative threads of the people that once occupied this station. You see many of them as featureless holograms and get to know a few of them somewhat intimately. What you learn is that the heart can sometimes cloud ones perspective. You see just how big of a problem that can be, but also how touching it can be. At the end of the journey, I found myself thinking about what I would do if I were in these characters shoes in these moments.Deliver Us the Moon is an excellently made game that succeeds in story and atmosphere. The lunar settlement is a fascinating place to explore, and even though its just filled with holographic ghosts, you get a sense of how it was once thriving and what exactly went wrong. The experience starts out strong and ends strong; some of the middle ground is a bit repetitive, but the narrative is engaging throughout and makes the journey worth taking.", "date": "May 04, 2020", "grade": "8"}