{"name": "Disgaea 3: Absence of Justice", "ref": "https://www.gameinformer.com/games/disgaea_3_absence_of_justice/b/ps3/archive/2009/09/22/review.aspx", "text": "If you're a fan of the series, run out and pick up Disgaea 3 right now. The franchise hallmarks  endearing yet funny characters, varied tactical battles, and crazy challenges to dig into  are better than ever. However, that's all Disgaea 3 has to offer. I can't hate too much since the Disgaea formula scratches deep-seated itches in my psyche, but this feels more like a remake with a new setting and a few minor changes than a true sequel.This edition follows the story of a young demon named Mao. Son of the Overlord of the Netherworld, Mao plans to take out his father and claim the throne for himself. While he's overly enthusiastic about his ruthlessness and lack of morals, it turns out he may have a compassionate heart under all the bluster. Sound familiar? It should, because the plot is basically a rehash of the original Disgaea. The supporting cast is different enough and the dialogue clever enough to be worthwhile, but like Disgaea 2, Disgaea 3 fails to entirely recapture the magic that made Laharl's tale so captivating.Nonetheless, this tactical RPG is a joy to play once you get the hang of how its systems interact. The story levels are endlessly creative, offering a great variety of challenges to overcome. Diving into the randomly generated levels for the unique rewards contained therein provides an excellent contrast. Unlocking new classes, gaining new abilities through the Dark Assembly-like Homeroom, and the nearly infinite leveling give players enough to soak up hundreds of hours.In terms of gameplay, this is the best the franchise has to offer. The balancing is much improved, particularly at super-high levels. Destructible doodads in the environment add another dimension. Learning skills, reincarnating, and everything else about character progression is much more interactive and less of a grind. Using the right stick to flick through different status displays drastically reduces the amount of menu diving. Disgaea's iteration has certainly paid dividends.Even with its extremely dated graphics, rehashed story, and strikingly similar gameplay, Disgaea 3 has plenty to offer fans of the series and the genre. I still recommend newcomers start with the original or its PSP remake for the amazing story, but I'd be lying through my teeth if I said I'm not enjoying the hell out of my time with Disgaea 3.", "date": "Sep 22, 2009", "grade": "8.25"}