{"name": "Viva Pinata: Trouble in Paradise", "ref": "https://www.gameinformer.com/games/viva_pinata_2/b/xbox360/archive/2009/09/22/review.aspx", "text": "Turning a small plot of land into a thriving sanctuary where animals play and procreate may sound like an enterprise better suited for PETA than couch-bound gamers, but you'd be surprised just how addictive this sandbox experience can be. The first Viva Pinata title won me over with its strategy and customization. The challenge of discovering how to lure specific animals to my garden without cluttering my artistic design kept evolving as the game went on. This sequel delivers a deeper and more enjoyable experience, but its biggest draw, surprisingly, is the interaction it allows with fellow gamers.You can now create a garden with three friends over Xbox Live, and depending on how close you are with them, you can limit their interactions or grant them complete control over your garden. If one player treks off to a different zone to catch a new critter, the other players stay in the garden, working on its progress. This is an amazing shared experience that pushes player to coordinate their efforts, and conversely, veer off the beaten path to try a strategy that may have set the garden back in single player.If your Xbox 360 isn't connected online, cooperative play is still available. Just plug in a second controller and your friend can help you on the same screen. This method is enjoyable, but the rubberband effect of keeping players in the same area can lead to some frustration.If you have no interest in sharing your garden or its contents, the single-player experience is far better than the original game. The streamlined menu management means you'll no longer spend needless amounts of time in the store. Control over the garden is remarkably easy as well. All of your tools can be selected from the directional pad, and you now have the ability to direct pinata to desired locations.While the base gaemplay has improved, some elements still underperform. The mating minigame (which bored the life out of me in the first game) is slightly different, but still far too repetitive and easy. The game also doesn't know when to let go of your hand. It's great to ease new players in, but it needs a faster ramp up and less tutorial.Once the game starts moving at a quick pace, the strategies keep expanding. Like the first game, the stars have to align to lure in pinatas. You may need a specific tree, a percentage of a terrain type, or certain pinata collection to make an animal appear. Above and beyond this, certain species must be trapped in new off-site snow and desert maps. Other pinata types are blocked from entering your garden, which means you will have to spend significant funds to remove the object in their path. These new gameplay avenues create a deeper, more tightly balance game.On the downside, Rare has added an awful story. While you are forced to sit through some groan-inducing cutscenes, at least this tale brings a mission structure to the mix. In addition to building the garden of your dreams, you can now find specific pinatas for characters spread across the world. Some are incredibly easy; others require a complete garden redesign. These missions change the way you play and are instrumental in giving the player different gameplay queues to lock down.Keeping your pinatas happy can still be monotonous in task, but the expanded content and finely made multiplayer relieves some of the repetition that plagued the first game. Viva Pinata retains its child-like charm, but the content is layered with deep strategies and entertaining gameplay that can suck anyone's life away.", "date": "Sep 22, 2009", "grade": "8.25"}