{"name": "Shaun White Snowboarding", "ref": "https://www.gameinformer.com/games/shaun_white_snowboarding/b/xbox360/archive/2009/09/22/review.aspx", "text": "Shaun White Snow-boarding is a chairlift full of possibilities. Ride around it and get off when you see something you like. This game is stuffed with things to do, but it doesn't take long to figure out that you're just going around in circles. The gameplay fails to elevate this title, and players are unable to take advantage of the possibilities all around them.Like Amped 3 before it, Shaun White fills its mountains with different runs and events that you can drop in and out of. This format served Amped 3 well, but that game had much larger maps and its challenges weren't as mundane as Shaun White's. Races and trick contests are the main fare, and these quickly wear thin. To make matters worse, you must find medallions within each of the environments before you can advance the storyline  a buzz-killing tedium if there ever was one. Events are activated as you pass them going down the mountain. This organic setup makes sense, but given how often you fly right by and miss the event triggers, it's a mistake that there's not a way to activate them straight from your map.The sketchy gameplay is the main culprit as to why the challenges fall flat. Getting on and off jibs (as well as staying on them) feels skittish and inconsistent. In general, this mirrors the trouble the game has with pulling, combining, and landing tricks. You're not smooth in or out of your moves, and landings are often mangled but made. You can even suddenly lose speed while cruising down a hill minding your own business.Despite these drawbacks, there's plenty here to build off for a sequel. The architecture of the mountains, with their secret areas and plenty of random jibs and jumps to play off leave you with plenty to do, and the multiplayer is well implemented. Friends can join you for free runs or challenges at any time, and both private and public chat radio extend for a wide area around the slopes. Regardless, it's inevitable while you're playing this game that you'll realize you're not really having fun, you're cold, and your butt hurts. That's when it's time to get off the mountain.", "date": "Sep 22, 2009", "grade": "6.75"}