{"name": "Chrono Trigger", "ref": "https://www.gameinformer.com/games/chrono_trigger/b/nintendo_ds/archive/2009/09/22/review.aspx", "text": "I don't think I stopped smiling for a minute as I played Chrono Trigger DS. With its mix of nostalgia and straight-up excellent design, this is one of the best role-playing games ever made. A great cast of characters, cool story, and excellent combat mechanics -- Chrono Trigger is one of those games that has it all.In case you missed it the first time, Chrono Trigger is the adventure of a time-traveling boy and his companions who hail from various historical eras. An extra-terrestrial beast named Lavos destroys the world in the distant future, so Crono and his pals go to different periods in time to find the root of the disaster and stop it before it can happen. The party members are far more than traveling buddies; Chrono Trigger uses an inventive combat system that allows you to perform cooperative attacks with allies for a dizzying variety of potential maneuvers. I don't know why this system hasn't been used in more RPGs since -- it's ingenious. As with many of Square Enix's classic ports, there are a few new features in Chrono Trigger DS, but they don't add much. The two new dungeons are interesting and offer some cool rewards (including a new ending), but they only become available at or near the end of the game. There is also a monster training diversion, but it's flat-out boring. These additions aren't exactly selling points, but I can't fault them too much since they are on the periphery. They don't interfere with the core experience in the slightest.Chrono Trigger hasn't changed much since it was first released for the SNES in 1995. The interface is cleaner since all of the battle stats are on the bottom screen, and there are a couple new bells and whistles, but that's about it. That's not necessarily a bad thing -- the gameplay withstands the test of time, but you shouldn't expect any drastic improvements. Then again, there aren't many ways you could improve on Chrono Trigger. It's a true classic, and playing it should be a government-mandated rite of passage for any role-playing fan.", "date": "Sep 22, 2009", "grade": "9"}