{"name": "Harry Potter and the Half Blood Prince", "ref": "https://www.gameinformer.com/games/harry_potter_and_the_half_blood_prince/b/ps3/archive/2009/09/22/review.aspx", "text": "He may be successful in literature and film, but Harry Potter has needed remedial video game education for years. Failing to grasp the concepts of pacing and entertainment, Harry's previous forays into gaming have more dark blemishes than a Death Eater convention. For Harry Potter and the Half-Blood Prince, Electronic Arts hit the books and did some homework; this entry isn't making the honor roll, but it earns the franchise its first passing grade.Instead of trying to encapsulate every facet of wizardry, Harry Potter and the Half-Blood Prince narrows its focus to dueling, Quidditch, and potion-making. Along with exploring the Hogwarts grounds, these activities comprise the core of the game  with tons of optional collectibles to unearth. Though lacking in variety, these tasks feature some clever mechanics that function well  particularly dueling. The analog controls give spellcasting a tactile element, but the fights are far from fair; once you get the Levicorpus spell, all opponents (including the final boss) can be hilariously defeated by incapacitating them, then blasting them with a fully charged stupefy to the groin. It's an entertaining and unstoppable path to victory. Like the last game in the series, the opportunity for Harry Potter fans to walk the halls of Hogwarts is the major draw. Unfortunately, you aren't given any meaningful interactions with the school or its students  you're just shuffled from one movie plot-point to the next, flying broomsticks and dueling along the way. If Harry Potter took lessons from Rockstar's Bully, Hogwarts could become a great setting with vibrant characters and cool locations. Instead, Harry Potter and the Half-Blood Prince gives you three activities to repeat constantly. Concocting potions and humiliating dark wizards is fun for a while, but once the novelty is gone, Hogwarts loses all of its magic.", "date": "Sep 22, 2009", "grade": "7"}