{"name": "Skate 2", "ref": "https://www.gameinformer.com/games/skate_2/b/xbox360/archive/2009/09/22/review.aspx", "text": "To measure Skate's success, don't look at sales numbers, aggregate review scores, or consumer feedback. Simply turn your gaze toward the downtrodden Tony Hawk franchise. After an impressive nine game run of million-plus sellers, all it took was one game of Skate to make the Tony Hawk franchise raise a white flag and retreat into development to find a new way to compete. Skate's focus on realism won over gamers and skaters alike. Tony Hawk's ''you can grind a rollercoaster for an hour'' approach was dwarfed by Skate's ability to make every kickflip and 5-0 grind feel like a praiseworthy accomplishment. But in harnessing the true essence of skating, has this series backed itself into a corner for sequels? Has Skate tricked itself into a state of repetition?As the Tony Hawk series progressed throughout the years, Neversoft found new ways to extend the length of a run, be it with a revert, manual, or off-board sprint. None of Skate 2's new content alters the core skating experience. You can dazzle judges by throwing in an unexpected handplant or one-foot, but there isn't anything in this game that will make you say, ''after playing this, there's no way I can go back and play the first game again.''Even though the skating feels like a well-worn pair of Vans, Skate 2 still finds ways to be nearly twice the game it once was. The design of city New San Vanelona is the skateboarding equivalent of a million dollar shopping spree in a candy shop. This city may be crowded by businesses and homes, but make no mistake; it's the most impressive skate park to ever be in a video game. As you look across this amazing construct, you can't help but plot your next few hours, which will likely be spent tricking out in free skate until you have a hand-cramp or an astonishing video you want to share with a friend.If you don't spend your entire time free skating (which you could conceivably do), New San Vanelona's architecture is tapped to put a breath stealing ''wow'' into most of the challenges. From the high-flying scoring challenges to the bone-breaking races, I often found myself putting my progress on hold just to repeat an amazing challenge. The structure of how goals are doled out is also more accommodating to the player, allowing you to avoid unfavorable events and stick with the string you like, bouncing from race to race, or tranny competition to tranny competition.Many of the single-player events are available for online competitions, but don't be surprised if your friends favor the new Burnout Paradise-like cooperative challenges instead. In these events, one player sets a goal, and it's up to the team to complete it, whether it's reaching a score or a nailing a specific number of difficult spot tricks. The online gameplay is just as meaty as the single player offering, giving players plenty of reason to keep this game spinning in their consoles.As rewarding as this game is, it hands out a fair share of aggravating moments. Every car doubles as the car from Christine, looking for the chance to splatter you on the asphalt. Pedestrians are aware of you now, and will jump out of your way more often, but they still get in your way, potentially killing a video-worthy moment. While these elements need to be addressed more than they have, the biggest killer in this game is the respawn system. After a huge bail, you could find yourself respawning at the base of a hill, in a wedge, or on the top of an awning that will make you bail when you drop. The logic behind this is that in the fairness of realism you can use the new walk maneuver to get yourself back to where you need to be. Unfortunately, this isn't always the case, and you are forced to restart the event. The new walk maneuver isn't wasted, however. Being able to walk upstairs and hop over ledges removes some of the frustration associated with the lay of the land.Given how enticing the city of New San Vanelona is from the outset, I rarely used the new ability of moving objects to create custom lines. The functionality behind this is fantastic, but I really couldn't find a way to improve upon what was already there. Most of the spots I created were of the ridiculous variety  which makes for great videos, but poor challenges. I guess EA just has to learn how to make crappier levels.Even with much of the gameplay remaining the same, Skate 2 is one of the most impressive sequels I've played in my tenure as a game critic. Most developers follow the line of thought of ''more equals better.'' In Skate 2 better is achieved by just making it better. It does the almost impossible task of making old gameplay feel new again.", "date": "Sep 22, 2009", "grade": "9"}