{"name": "FIFA Soccer 2009", "ref": "https://www.gameinformer.com/games/fifa_soccer_2009/b/ps3/archive/2009/09/22/review.aspx", "text": "Getting called up to the national squad is every soccer player's dream. You've made a name for yourself over in Europe, and now you're ready to use what you've learned from the best and take on the world's finest on the international stage. FIFA 09 wisely expands its exciting Be a Pro mode to a four-year timeframe in which you play club fixtures and don your country's colors. The game also expands to 10-versus10 online competition where you can create a team that moves up and down divisions, which tests whether you've got the mettle to bury the ball in the corner instead of putting it over the crossbar.Every touch counts in soccer, as you'll soon learn while playing Be a Pro mode. This mantra extends to every situation on the pitch, whether you're on the ball moving around the defense or just calling for a pass from a teammate. The reward you feel when executing a perfect run onto the ball that ends in a shot on goal is tempered only by the feeling that the AI players show little imagination in their positioning, ball support, and runs. How your players interact with and support each other can be tweaked with a handful of new strategy options that include player creativity (in both passing and taking runs), frequency and distance of your passing game, and how teammates fall back in defense and push forward on offense. These mostly work, and I recommend configuring these settings to accommodate how you want to play the game. However, some strategies, such as asking your AI players to perform freeform offensive runs, aren't really executed, and I found that they expressed themselves better in the traditional playing mode rather than Be a Pro.FIFA changes the way you experience the game whether you're playing Be a Pro or are online trying to play cohesively as a team with nine friends, but the core remains the same. This series plays even more deliberately than rival Pro Evolution because you have to execute moves earlier than you think to compensate for the pre-scripted animations. Add in the still-odd AI behavior (like dribbling the ball straight out of bounds), the less-than-spot-on passes and shots on goal, and a jostling feature that is inconsistent at best, and it feels like all of FIFA's amazingly fun new moments cannot escape the game's legacy problems.", "date": "Sep 22, 2009", "grade": "8"}