{"name": "New International Track & Field", "ref": "https://www.gameinformer.com/games/new_international_track__field/b/nintendo_ds/archive/2009/09/22/review.aspx", "text": "When the original Track & Field was released in arcades, the intense button mashing and careful timing was perfect for brief, crazed face-offs. When you stretch this experience out to longer hand-cramping sessions it just becomes painful. Sure, you're burning through a multitude of events like cycling, swimming, and weightlifting, but they're almost all controlled with the same screen rubbing/circling techniques that put your touch screen at risk of being scratched. Don't even think of playing this on a bus or other form of transport  the stability of a desk is a necessity if you want to get decent scores. The classic control scheme is available as well, but you can't really go nuts on those tiny DS niblets like you can on fat arcade buttons.As you start up every event, the game offers short instructions. While some events are intuitive and easy to pick up, others require many tries just to complete successfully, let alone hit the qualifying mark. A little more clarity in the tutorials could have gone a long way. I'm sure this will vary for every player, but some events are ridiculously easy while others are crazy hard. This leads to a jagged difficulty curve that spikes and valleys throughout the entire experience.The one thing that keeps you plowing forward is the truckload of unlockables. Achievement trophies, Konami characters like Solid Snake and Frogger, challenge missions, and outfits pour out in a waterfall of rewards. Multiplayer is extremely flexible, allowing for single card, multi-card, and online play (though single takes forever to load between events). You have to register via Konami's pesky proprietary online system, but it's cool to get constant stat and record updates and to participate in regularly scheduled tournaments.If you have an affinity for the classic franchise and an interest in proving you're the best in the world at the steeplechase, this game may do it for you. Otherwise, it's not worth the possible risks to your DS and blood pressure.", "date": "Sep 22, 2009", "grade": "6.25"}