{"name": "Predator: Hunting Grounds", "ref": "https://www.gameinformer.com/review/predator-hunting-grounds/not-quite-at-its-apex", "text": "The alien warriors from the Predator films are irresistibly equipped for video games. These fearsome hunters not only look formidable, but they come complete with a wide array of memorable gadgets, including their optical cloaking camo, shoulder-mounted plasmacasters, and  if worse comes to worst  self-destruct nukes. Gamers have been either fighting off the bug-faced Yautja or playing as them since the NES days, with varying results. IllFonic is the latest developer to step up to challenge of adapting this alien race, in the form of an asymmetrical humans-versus-predator shooter. At its best, Predator: Hunting Grounds is as close as youd want to get to sharing a jungle with these green-blooded killers, though dull missions and limited map selections dont make for a particularly lengthy hunting season.IllFonics previous title was Friday the 13th: The Game, which offered a similar four-versus-one setup. Unlike the relatively helpless campers in that experience, however, players dont have to rely on hiding in closets or calling for help as theyre stalked by a powerful entity. Your four-person fireteam is more than capable of downing this intruder, provided you work together and take advantage of your superior numbers. The predator may pack more firepower than a Cabelas warehouse, but it still bleeds. And if it bleeds, as the saying goes, that means you can kill it. But you have to find it first.Hunting Grounds doesnt just dump everyone into an arena and call it a day. Instead, both sides spawn in different spots in the South American jungle, which is a dead ringer for the lush foliage in the original 1987 film. When the match starts, the fireteam has a series of objectives they need to complete before they can get to the chopper and their successful extraction. Whether youre tracking down stolen artifacts, getting data from servers, or destroying a drug operation, they all generally play out the same: You head to the next waypoint, find the object thats highlighted, and hold down the interact button. Then its off to the next set, and then the eventual exfiltration. These never feel like anything other than the busywork they ultimately are. Theyre not interesting in and of themselves, but they serve their purpose, which is essentially turning your squad into bait.In Predator lore, the creatures are drawn to heat and conflict. When you engage with the braindead human A.I., your fireteam isnt in any real danger. The guerrillas are equipped with glorified Nerf guns, and aside from snipers and heavies, their shots dont require much first aid afterward. The real danger comes with the noise that you generate when you return fire. Every gunshot you make has the potential of sending up a visual flare to the predator player, if they happen to be looking in the right direction. This tension is palpable, especially if you happen to hear the aliens chattering as it watches you, unseen from the trees.If youre on the human side, you engage with the A.I. and predator in a first-person view. The predator gets to experience combat via a third-person camera, which gives you a bit of an edge if youre playing that role. It fits with the creatures enhanced perception, which is further upgraded with its infrared vision. When activated, you can scan the world for blips of heat, which mark potential targets. Learning which is human and which are A.I. is part of the challenge. Once I got the hang of the role, I loved engaging in the predators poke and retreat style of combat. Jump in too early, and you risk giving up your position. The predator is formidable, but its not invulnerable; a focused squad can make short work of you if youre sloppy. Instead, you need to learn when to attack, when to follow silently in the trees, and how best to watch for openings. The trick is to be patient, but persistent. If you wait too long, youre forced to play your hand as the team waits for the chopper  a position that leaves you more vulnerable than if youd picked off your foes earlier when they were distracted with their checklist of tasks.Getting the hang of the predator role takes some learning, and unfortunately you do most of that learning in live matches. A brief tutorial teaches you the basics of moving through the jungle canopy  a breeze, thanks to smart navigation controls and clearly marked paths  but its thin on combat. Thats a shame, because fighting against a poorly acclimated predator isnt fun; it turns whats usually a tense confrontation into unintentional comedy  and it usually ends with a dead predator. And its even less fun when you happen to be that dead predator. On the other hand, I had a blast when I was matched up against players making full use of the predator suite of abilities. Humiliating seems like an understatement when you describe getting snared into a net and then having your spine yanked out, but its fitting. Most of my failures were the result of not paying attention or being overly confident, regardless of which faction I was playing.The predator is a certainly more of a draw than the comparatively generic humans it faces, and the queue times reflect that. I waited about five minutes each time I wanted to play as the alien hunter, compared to a minute or so as the fireteam. The predator also gets a better overall deal in the cosmetics department. The default character looks great, and the customization options let you change up your mask, armor, skin pattern and coloring, dreadlocks, and more. Humans have comparatively scant options, aside from a ton of underwhelming weapon shaders. The cosmetics are purely optional and there isnt a microtransaction in sight, but overall the loot boxes arent exciting.The other unlocks, which include new weapons, perks, and class archetypes, are more interesting. I had a decent time coming up with different builds, experimenting with a pure anti-predator loadout before eventually settling on more of a support role designed to help keep my squad alive and well armed. That flexibility helps to keep the action fresh, but with only a handful of maps and only one real game mode, its hard not to get the sense that youve seen everything there is to see after a few dozen matches.Hunting Grounds treats the character and setting with reverence, which, as a fan of the movies, is easy to appreciate. If youre looking for an authentic predator experience, this is about as good as its gotten. And fittingly, its perhaps best enjoyed the way the predators have interacted with humanity: drop in, enjoy the hunt, and get out while you can.", "date": "Apr 27, 2020", "grade": "7.25"}