{"name": "Tecmo Bowl: Kickoff", "ref": "https://www.gameinformer.com/games/tecmo_bowl_kickoff/b/nintendo_ds/archive/2009/09/22/review.aspx", "text": "As a kid, my dedication to Tecmo Super Bowl bordered on obsession. The game didn't keep year-to-year season data, so I created my own NFL almanac, noting the record performances for passing, rushing, and receiving that I would try to best during my next season with a new team. All these years later I still couldn't wait for the remake, but in losing the NFL license, Tecmo Bowl: Kickoff also lost much of its allure.Sure, the game includes 32 teams that just happen to be from the 32 host cities of NFL franchises. The game also lets you customize every team name, color scheme, and player name. Unfortunately, the customization also limits what you can do to alter player stats and abilities, so recreating Tecmo Bowl legends like Bo Jackson, Christian Okoye, and QB Eagles is not entirely within your power. The lack of roster sharing also means you must manually edit every generic player name if you want to relive Tecmo Bowl's glory days or create an up-to-date pro roster. With the generic preset rosters, you have no idea who is good at what unless you spend hours learning the idiosyncrasies of each team.Between the hashmarks, not much has changed from the glory days - for better and for worse. The plays are the same, the controls are the same, and the same maneuvers result in epic runs and ridiculous sack totals. Tecmo added a few special abilities for star players, which is a nice evolution, but that's about it.The biggest bone I have to pick with Tecmo Bowl: Kickoff is its overall lack of refinement; most of the major problems with the original game are still intact. Players injured during the season mode also cannot play during quick games, injured players step on the field to return kicks even though they can't otherwise play, and the game never tells you the length of a player injury. The stats are also a mess. Statistical juggernauts putting up record-worthy numbers will often fail to appear on the leaderboards. You would think Tecmo would hire at least one (just one!) person familiar enough with football to know it's a rushing ''attempt,'' not ''completion.'' They even call two-point conversions touchdowns! And why can't I pick both teams for the quick play mode?I had high hopes for the return of my favorite childhood football game. But without any meaningful new features or the NFL license to prop up the game on nostalgia value, it fails to turn in a memorable performance.", "date": "Sep 22, 2009", "grade": "6.25"}