{"name": "Pure", "ref": "https://www.gameinformer.com/games/pure/b/xbox360/archive/2009/09/22/review.aspx", "text": "When you're tearing through the sky barely holding onto your ATV, tempting fate and dangling your body in a death-defying superman stunt doesn't make much sense...especially when you've got a race to win. But Pure happily endangers more than your limbs with its well-done blend of tricks and racing. This combination rewards your risks every second of the way.Tricks and ATVs have combined many times before, but Pure pulls away from the pack in both form and function. You want to bust as many tricks as you can to earn boost. Earning your way through the three trick tiers unleashes special tricks, and pulling off one of the four specials automatically earns you a full tank of boost. Boost is valuable for how fast it makes you go, and it's also a scarcity since any trick you pull off drains its supply.The moves themselves aren't out of the ordinary, but how Black Rock presents them is. The camera contorts to the side, accentuating your tweaked body while sound effects and character voice work punctuate the bigger tricks. Since the courses are designed to maximize your boosts and special tricks, the game effortlessly delivers a blast of pedal-to-the-metal adrenaline.Pure's gameplay insulates itself from the boredom that usually creeps into most racing games. Although the tricks eventually become commonplace, I like how my favorite race type -- freestyle -- gets stronger as the game progresses. Here it's all about combing tricks and pulling them off as often as you can. During the later stages of the game, where the competition becomes more difficult, it's fun to see how adept you are at maximizing tricks, boosting, and finding alternate routes or more efficient runs on the tracks.The one wall the game runs into is that the other race types -- race and sprint -- don't evolve as well as freestyle. Moreover, while there's a plethora of bike parts to earn, the game doesn't clarify how the parts impact performance. Amidst the sea of customizable parts, I was never sure I had the best bike possible...and I found out later there were times when I didn't.Pure doesn't present the deepest pool out there. But with a game this fun, you should dive in nonetheless. The game achieves its core focus, taking you along for a thrilling ride.", "date": "Sep 22, 2009", "grade": "8.5"}