{"name": "Mortal Kombat vs. DC Universe", "ref": "https://www.gameinformer.com/games/mortal_kombat_vs_dc_universe/b/xbox360/archive/2009/09/22/review.aspx", "text": "The Mortal Kombat characters have been shooting fireballs out of their hands and teleporting through flashes of light for so long it's only natural that they're finally fighting superheroes. Thankfully, Midway has respectfully integrated DC's most popular icons into the fighting fold, so the overall experience doesn't feel like a cheap licensing cash-in. The violence may be slightly toned down, and a lot of the blood and gore is gone, but the superheroes aren't pulling any punches and the action remains unquestionably MK. The name of the game is dialing combos and quick, rehearsed moves.With 22 combatants, the character list is fairly diverse. Fan favorites like Scorpion and Liu Kang still do their thing, but it's the DC newbies that steal the show. The DC roster feels fresh and a lot of work has been done to making sure their moves reflect their comic identities. Sure, some fancy footwork was needed within the game's fiction to make everyone evenly matched in battle, but every character performs like they should. Superman is a lumbering powerhouse with a lot of devastating three-hit combos, while the Joker is a trickier combatant who relies on change-up moves. Even characters I've never cared much about, like The Flash and Captain Marvel, are a blast to play.The new mid-battle sequences, called Freefall Kombat and Klose Kombat, mix up the action. These segments vary in execution -- you might end up crashing out of the ring and freefalling to the next stage -- but they are all basically minigames. While they look cool, blocking your opponent's attacks is mostly a guessing game, and you feel cheated when the roles are reversed at the last minute and you take the damage you were dishing out. Thankfully, this doesn't ruin the overall combat, which is solidly balanced.The game offers two different story modes that each last a couple hours, but aside from a thin combo challenge there isn't much to do here other than test your might online. Still, fans of both universes are sure to squeeze hours of entertainment out of this package.", "date": "Sep 22, 2009", "grade": "8.5"}