{"name": "The Legend Of Zelda: Tears Of The Kingdom Is Already The Second Best Selling Game Of 2023", "ref": "https://www.gameinformer.com/games/tom_clancys_endwar/b/xbox360/archive/2009/09/22/review.aspx", "text": "Coming out of this year's E3, I was incredibly high on EndWar. The title's focus on small-group battle tactics, robust voice control, and intriguing online component made it a real-time strategy title worth following. After putting the final version through its paces, those qualities still stand out and make EndWar an entertaining way to pass the time. However, the dearth of unit types and simplistic relationships between the handful of units make the strategy too shallow to hold up in today's RTS genre.Everything about EndWar's presentation screams quality. The camera smoothly flies from unit to unit on your command, constant explosions buffet your ears and keep the intensity high, and the information you need to know is never more than a quick glance or flick of a thumbstick away. Certain orders are easier via either voice or gamepad, but once you learn your way around the game it's simple to use a combination of the two to quickly and easily command your forces. Units not under direct orders have awful AI (take cover behind that wall two feet from you, morons!), but as your attention is only split between a half-dozen units it's not a game-breaker. What faults EndWar has have nothing to do with the interface or audiovisual fidelity. With no base building whatsoever, players are tasked with completing their objectives (nearly always a variation on holding control points) with a handful of units at a time. Helicopters beat up on tanks, which take out transports, which in turn wail on helicopters. Infantry are slow and worthless outside of cover, but a total pain to dig out once they're entrenched (and are the only units that can capture control points). Artillery units are great distance attackers with no close-combat capability, and command vehicles enable enhanced interface elements. This bare spread makes up the sum total of EndWar's armies. There are no ''soft counters''  being on the wrong end of any of these relationships invariably results in getting your butt kicked. As you only have access to a few units at a time, what you bring to the fight is very often more important than how you conduct battle. Couple that with the scant number of gameplay verbs  for the most part, ''attack'' and ''retreat'' are as complex of maneuvers that you can execute  and you've got a polished but shallow experience.Off-map support powers like air strikes or EMP bombs break up the plodding action, and can turn the tide of battle in a heartbeat. As a match enters its closing phases, players gain access to WMDs (though the losing side gets them first) that can render huge sections of the board sterile. Like the basic gameplay, these powers are either simple or elegant depending on whom you ask  though I find it all to be a washed-out reflection of the true potential of the RTS genre.Once you break into multiplayer  which dresses up its team-based skirmish gameplay with a moderately amusing persistent world map  things get more interesting. The persistent army customization is a fun hook to maintain interest, the ebb and flow of battle is more dynamic (fighting the AI quickly becomes a tedious slog through its long stream of reinforcements), and the usual RTS pacing metagame becomes something of a remedy for the tepid nuts and bolts of battle. Flanking maneuvers and misdirection can be brutally effective tactics against human opponents, and the thrill of working as a team is the best EndWar has to offer. The simplistic mechanics, however, make it unlikely that EndWar online will have the kind of staying power as the genre's biggest hits. Even with all these caveats and complaints, console players interested in seeing what all the fuss about RTS is about are probably best served here rather than with the other mediocre efforts to date.", "date": "Sep 22, 2009", "grade": "7.75"}