{"name": "Prototype", "ref": "https://www.gameinformer.com/games/prototype/b/ps3/archive/2009/09/22/review.aspx", "text": "Alex Mercer is a shape-shifter. He can assume the identity of anyone he kills, turning their bodies to mush and digesting what's left of them through his pores. By tapping into this ungodly power, he can imitate military personnel -- a move that grants him the opportunity to lay waste to aircraft before they take to the skies. If he's being chased, he can consume an elderly, arthritic man to blend into New York City's sprawling walk of life. If he is searching for answers, he can digest the brains of someone in the know to view their memories. Alex can become anyone he sees fit, but no matter what skin he hides behind, the person he reminds me of the most is Spider-Man.As Alex bounded across rooftops, scampered up walls, and slung enemies with a black tendril of gooey webbing, I couldn't shake the feeling that he was following in the footsteps of Marvel's wall crawler. This isn't a bad thing, but Prototype seems so focused on emulating Spider-Man that it fails to establish an identity of its own.Alex's moveset isn't the only familiar trait. Prototype clings tightly to the open world conventions found in most superhero games. Outside of military bases, all of the combat unfolds on city streets. If you want to veer off of the story missions, you can hunt down hidden orbs, or take on side missions, which (surprise, surprise) include timed ring races, skydiving, and combat challenges. All combined, this package is entertaining on a basic level, but its familiarity prevents it from generating a lot of excitement.This is a shame, as Prototype rewards players well for going out of their way to tackle side content. For almost every action Alex makes, he is rewarded with experience points that can be exchanged for new powers and upgrades. The list of obtainable powers is extensive, and loaded with attacks that I couldn't wait to try out. This ever-expanding arsenal is effective in changing the way you approach combat, and helps keep the repetitive battles somewhat fresh. This deep well of powers doesn't move Prototype away from feeling like a well-worn pair of shoes. Developer Radical Entertainment made no attempt to reinvent the superhero wheel with this game. When new ideas are injected into tried and true formula, the gameplay falls apart. The only time I felt like this game was firing without fault was when Alex wasn't being pursued. The methods with which he can ascend skyscrapers or quickly bolt over a crowded city street are beautifully captured in both control and animation. Sadly, in a game that grants you god-like abilities, exploring the city ends up being the biggest thrill. Problems arise when you attempt anything else. The stealth mechanic lets you sneak behind enemy lines, but for whatever reason, walking nonchalantly sometimes sets off an alarm, whereas dropping off of a skyscraper right in front of a general does nothing. Alex's vast arsenal of moves can be tapped to deliver a pounding on tanks, monsters, and helicopters, but as fluid as the actions are, the success of these attacks is tempered by shoddy targeting and a fussy weapon wheel. Don't get me wrong, I love throwing tanks at helicopters, and slicing a mutant in two is a satisfying conclusion to a fight, but I didn't always feel like I had complete control over my actions. When the action is as frenzied as it is in this game, the slightest of delays can spell disaster.Prototype also makes mistakes that I thought the open world genre had solved a generation ago. Every time you want to jack a tank, you'll first have to complete a button-mashing minigame. While you are jamming on the button, a helicopter or mutant can knock you off of the tank, or your health can be whittled away. Since you are locked into the minigame, you are defenseless. Moreover, as powerful as Alex is, enemy attacks can break any one of his combos. I can't even begin to tell you how frustrating this can be when you have five mutants to deal with.Progressing deep into this game takes an iron will. The story does nothing to pull you along. It begins with Alex questioning what is wrong with him, and stalls on this topic until the end, where a groan-inducing reveal smacks you in the face. The insipid plot doesn't lend itself well to missions, either. Most challenges end up being ''kill these enemies'' affairs.From its old school design to its gameplay struggles, Prototype resembles a superhero who leapt off a building only to realize he doesn't possess the power to fly. I hate to say it, but picture a frustrating Spider-Man game, and you have a good idea of what this experience has to offer.", "date": "Sep 22, 2009", "grade": "7.25"}