{"name": "Gears of War 2", "ref": "https://www.gameinformer.com/games/gears_of_war_2/b/xbox360/archive/2009/09/22/review.aspx", "text": "When you drove your chainsaw through someone's sternum in the original Gears of War, did you think the game just wasn't bloody or visceral enough? How about that time when a dozen eight-foot-tall super-warriors ambushed you in a dimly lit alien cavern; did you wonder if the intensity needed to be ratcheted up a notch? You may not have asked yourself these questions, but Epic Games apparently did. Gears of War 2 is video games' equivalent of Jurassic Park: a title that overwhelms you with its impeccable polish and grand set-pieces. This game is carefully crafted to not give the player a chance to catch his or her breath and wonder how much substance lies behind the facade. Gears of War 2 gives every impression that the designers at Epic sat down with a huge pile of money and a list of everything that could be improved from the first game, and spent all those dollars addressing that list. Technical improvements like foolproof drop-in/drop-out during co-op and faster loading smooth out the experience. Design missteps like an incoherent story and the awful Kryll levels and final boss fight have been avoided for this sequel. From cover mechanics to weaponry, the gameplay is nearly identical (if smoother and better-paced) to the original, but Gears 2 is as polished a title as exists in gaming, and the many improvements and optimizations are great As a single-player game, Gears 2 delivers enough amazing moments over its eight to twelve hour campaign to satisfy most gamers. Taken online where it belongs, however, it has the potential to have a Call of Duty 4-like longevity. Excellent and creative modes like Wingman, where five teams of two vie for killshots (and you can revive your partner indefinitely, barring an execution), get lots of mileage out of Gears' unique mechanics and provide an outstanding contrast to vanilla deathmatch or capture-the-flag scenarios. The Horde mode, which made a big splash at this year's E3, is a fantastic way to take Gears' excellent cooperative play out of the scripted scenarios of the campaign and enhance replayability for gamers who might pass on more competitive modes. The only thing stopping this online offering from taking a clear lead in the genre is a lack of the persistent stats and upgrades that make Call of Duty 4 and Rainbow Six Vegas so endlessly addicting.The title's relentless immaturity can grate after a while, though. Gruesome executions and grunted, testosterone-soaked dialogue sloppily plaster over the campaign's heavy-handed morality play. While the plot makes sense this time around, its clumsy mysteries are old hat to anyone moderately well read in science fiction. Still, finding bad things to say about Gears of War 2 is like trying to hate on the '07 Patriots. The game is impeccably engineered to dominate everything it sets its sights on, and yet ultimately falls short of achieving true immortality. Still, there isn't a game out there that can compete with Gears on its home turf. The bombastic co-op action, impressive presentation, and unique multiplayer will thrill gamers as well if not better than the latest indie thought piece. Popcorn it may be, but Gears of War 2 is delicious nonetheless.", "date": "Sep 22, 2009", "grade": "9"}