{"name": "Rise of the Tomb Raider", "ref": "https://www.gameinformer.com/games/rise_of_the_tomb_raider/b/xboxone/archive/2016/01/28/rise-of-the-tomb-raider-review-game-informer.aspx", "text": "Crystal Dynamics set a solid foundation when it rebooted the revered Tomb Raider series back in 2013. With a bigger world, more varied combat, and more high-octane action, the follow-up, Rise of the Tomb Raider, is better in every way. This new path for Lara is intriguing, making her more complex while capturing the struggle of surviving in the harsh world. Just as Lara remains determined to keep moving forward, so does Crystal Dynamics with the franchise.The most exciting parts of Tomb Raider occur as Lara makes her way through harrowing situations, and the stakes have only been increased since last entry. Expect plenty of close calls, death-defying leaps, and exciting escape sequences  I often felt like I was just escaping by the skin of my teeth. Rise of the Tomb Raider features a quasi-open world that's split between hubs each in which Lara is surrounded by resources for crafting along with hidden caves, hideouts, and tombs to explore. She must platform, solve puzzles, and break through obstacles to navigate them. These areas have so much to do that staying on the critical path is hard, and I was constantly lured away from the main story by worthwhile discoveries. Siberia's brutal, snowy landscapes are great venues to test your survival instincts, offering high points to climb, dangerous wildlife to fend off, and collectibles stashed on high ledges and concealed paths.The excitement of exploring tombs is one of this entry's major improvements over its predecessor; players can raid nine optional ones, along with having a few required for the main story. These are much more expansive than caves, usually featuring one big puzzle, where you use Lara's tools, such as her rope arrow to eliminate obstacles, and platform using her pickaxe to land big jumps. For example, one was flooded and had me using Lara's rope arrow to get a boat around and find ways to drain the water. You can still click a button to see points of interest, lighting up what you can interact with. This comes in handy when you're trying to find new paths or are struggling with a tough puzzle. However, just because you can see the parts involved doesn't mean the puzzle is solved. They go deeper than that, requiring you to pay attention to things like water levels, timing your jumps to reach moving platforms, and finding a way to light something on fire that's blocked by running water.The action excels just as much as the exploration and puzzle-solving; just when you think it can't get any more bombastic, it does. I reveled in reacting on the fly, whether it was taking out a swarm of enemies or racing to flee a collapsing tomb. Combat is much more strategic now, providing multiple ways to tackle every situation. Sometimes you can plot and sneak up on enemies for surprise attacks, and other times they come charging in at you, forcing you to react in the moment. I loved using a stealthy approach; however, throwing a molotov cocktail or firing an arrow to land a perfect headshot were just as entertaining.Lara has plenty of combat prowess, but objects in the environment also provide opportunities for explosions. I liked using melee kills to sneak up on enemies, but sometimes their animations put you into vulnerable spots during battle. The gunplay is solid; using your bow-and-arrow and crafting explosives are more esoteric ways to kill enemies though. Supplies get scarcer later on, so you might have to resort to using your guns more in the final battles. These later sequences often feel like Lara versus the world, and feel repetitive as you're eliminating wave after wave of enemies. This breaks the momentum of the otherwise exceptional action. You upgrade Lara's skills to cater to your playstyle, which made me excited to spend every point I earned. For instance, you can increase your chances at getting more resources when you scavenge, or gain damage resistance for a short period after a stealth kill. The challenge also constantly ramps up in battle, forcing you to use your wits and new strategies. Don't always assume you'll have everything at your disposal. Sometimes using special arrows, such as poison, are the best to get the job done; other times you'd be crazy not to craft bombs to get rid of enemy waves. The complete experience is well-balanced; you're alternating between climbing, fighting, and exploring regularly.When you're not in the adrenaline-inducing moments, you're searching for supplies and secrets. The world is larger this time around and littered with cool collectibles and hidden tombs. I loved stumbling upon a new weapon upgrade and collecting resources to craft new gear. That's where Rise of the Tomb Raider excels; you progress by finding a new item or getting a new tool that suddenly changes how you traverse the world. Similar to the fun of Metroid, returning to previously explored areas will open up new secrets with new goodies to track down.Every hub-based environment also has special challenges and missions you can do for extra bonuses, such as cutting down flags or delivering supplies. The areas also have cool backstories that you can uncover by searching the land and talking to people along the way. I spent a lot of time getting lost in these areas; you never know what you might find by climbing a mountain or entering a cave  it can even be a pack of wolves lunging your way. I didn't want to leave any stone unturned, since everything you find has value. I was haunted by not exploring an additional path or seeing if a dead end revealed a treasure. Finding documents and murals show points of the interest on the map, but the lack of a minimap is unfortunate, since it forces you to pause to check the map.The expansive world and depth of exploration is the real draw of Rise of the Tomb Raider, but the story also provides some interesting revelations. In the previous entry, a young Lara Croft faced harsh realities, confronting death and betrayal. Rise of the Tomb Raider picks up a year later, showing a more experienced and cynical Lara. Despite this shift, one thing remains true: her trust in her late father. This devotion runs through the storyline as Lara studies his research, determined to prove the secret to immortality is out there. The story is predictable, but has memorable moments. The most interesting threads are learning more about Lara's relationship with her father and this evil organization named Trinity. I won't spoil anything, but the last scenes turn everything on its head, making me excited to see where Crystal Dynamics takes the narrative next.Rise of the Tomb Raider captures the thrill of being an adventurer and leaves you thinking about Lara's next move. You have daredevil sequences, heroic moments, fun exploration, and exciting fights that even Indiana Jones would envy. If Crystal Dynamics keeps raising the bar from here, I can't wait to see what's next for Lara.Microtransactions?You can replay certain areas and tombs by choosing the expeditions option on the title screen. By using coins you earn in the game or using real money, you can purchase cosmetic perks that can add funny details and challenges. However, this whole mode is ancillary and the transactions arent intrusive, so they dont impact the fantastic core experience.Editor's Note: This review was originally posted on November 9, 2015.", "date": "Jan 28, 2016", "grade": "9.5"}