{"name": "Valkyria Chronicles", "ref": "https://www.gameinformer.com/games/valkyria_chronicles/b/ps3/archive/2009/09/22/review.aspx", "text": "It doesn't have sprites or grid-based combat, but Valkyria Chronicles is pure strategic bliss. Sometimes it looks like a third-person shooter. At other moments, it appears to be about tank combat. You interact with and control your units in unconventional ways, but these mechanics are all just skins overlaying a classic and familiar strategy framework that puts players in the trenches like no other entry in the genre.Valkyria Chronicles has you making tactical decisions from two points of view instead of a traditional isometric grid. The first is the battle map, which is a top-down abstract representation of the battlefield, your troops, and all visible enemies. The second perspective is right down in the action as you manually control your troops, line up their shots, and keep them behind cover. These two approaches work remarkably well together, giving players the sensation of being a commander while also forging a connection with individual units and their capabilities. The balance of power among the units is a twist on the common rock-paper-scissor mechanic, and I love how combat is about more than jockeying for these advantages. There are multiple types of infantry (like scouts, snipers, and engineers) to work with, terrain advantages and handicaps, soldier personality traits, plus you start with only one tank that you need to protect at all costs. In other words, even though the ''paper beats rock'' elements are there, they are augmented by a much deeper and more compelling array of options. Even your activities off the battlefield, like learning skills and upgrading weapons, are entertaining.One of my pet peeves in strategy titles is when you need to micromanage your units' experience. Valkyria Chronicles has an excellent solution to this annoyance: Individual units don't have experience. Instead, you level up entire classes by assigning XP from a communal pool. In other words, when you advance the soldier class to level 2, all of your soldiers improve. This enhances the sensation that you're commanding a small army, plus it allows you to control the balance of your force without having to resort to exploiting the mechanics.That isn't to say Valkyria Chronicles is beyond reproach. The tactical map doesn't always do its job, and can lead to you wasting a command point (one unit's turn) just to see what the real situation is on the ground. It would also have been nice to get a miss chance percentage before you attack; it's clear that range affects your power and accuracy, but the details are vague. Lastly, there isn't much depth in the character progression  especially when compared to Final Fantasy Tactics A2  but I can't harp on that too much since I like the middle ground where this game landed.There are some things you never knew you wanted in a strategy game. The third-person view does wonders to get you invested in every decision, and it's great to have a worthwhile story. The gorgeous presentation and versatile combat make Valkyria Chronicles one of the best surprises of the year. It may not have been on your radar before, but you definitely shouldn't let it pass you by.", "date": "Sep 22, 2009", "grade": "8.5"}