{"name": "Afterparty", "ref": "https://www.gameinformer.com/review/afterparty/afterparty-review-worth-the-hangover", "text": "Alcohol has a sinister temptation that can lead to excess. Bad and embarrassing things often come with a night of overindulgence, from losing inhibitions to waking up hungover. Night School Studio, best known for its breakout hit Oxenfree, leverages that by making alcohol the centerpiece of Hell. But before you think this is just a game about partying, think again. Afterparty is at its strongest when it subverts your expectations, explores relatable topics about life and death, and is okay with not having all the answers.We all have our own ideas about Hell, but Night School Studio created an intriguing version in which everyone works basic 9-to-5 jobs followed by a night of debauchery at the bar. While this premise could easily become silly fast (it has plenty of well-done humor), Night School Studio isnt afraid to touch deeper themes, like what it means to have a good life and the impact of being locked away with alcohol for eternity. Afterparty is at its best when it takes a break from nightlife antics to discuss the afterlife and what it means for longtime friends Milo and Lola, our main characters. They mysteriously end up in the inferno, and part of the journey is piecing together their lives and what caused their untimely demise. The other part is doing a bunch of tasks to ensure you can face off against Satan in a drinking contest, the only loophole to get back to Earth.Afterparty is a story-driven experience (much like Oxenfree was), and that is certainly its strong point. Colorful characters and witty dialogue drive the narrative, and the natural flow keeps things moving despite having a lot of spoken lines. You can alternate between Milo and Lola, getting their different perspectives on how to approach problems or how they feel about the current situation and their friendship. For instance, as you learn more about Hell, small puzzles pop up, like how to get past a bouncer, and Milo and Lola both push for different solutions. I especially enjoyed switching characters, as you get to view the friendship from their different lens and understand where theyre coming from when they get into arguments or bigger discussions about life. This also evolves later, as the game recognizes who youve been siding with more, which is a nice touch.While the heroes changing friendship is a core focus, cast standouts Sister Mary Wormhorn and taxi driver Sam offer a welcome reprieve from the Milo and Lola dynamic. The former is Milo and Lolas personal inner demon and shes constantly trying to rattle them, and by extension, you. She frequentlycomments on the choices you picked, putting doubts in your mind. Sam has a mysterious aura about her, but her down-to-earth nature and subtle quips make her fun to have around.While most of your time is spent exploring and engaging in conversations, you also make decisions and engage in some drinking-related activities. The minigames are really simplistic, such as a Simon Says dancing contest, aiming precisely in beer pong, and a cup-stacking game. You dont really get a chance to practice any of these before you play them, but you arent punished for failing. However, they also dont add anything entertaining to the gameplay. Thats Afterpartys biggest problem: It tells an engaging story, but its not always fun to play. The backtracking doesnt do it any favors, as youre often required to go from the end of an area back to its beginning to take a taxi to your next locale. Considering you revisit a lot of places, this makes the whole structure feel repetitive and drawn out. To spice up situations, you can choose different drinks that provide extra conversation options as a way to roleplay. For instance, I spent a whole conversation talking like a pirate and another where I was a rich jerk, but these exchanges feel empty when they dont affect anything larger.Branching paths are important to any choice-driven game, and Afterparty certainly has them, but after playing through the game twice, they dont alter the experience much. A lot of moments that seem important dont matter, and the only big variations I saw were in the two different endings I experienced. I like that relationships you invest in have some payoff, but my second playthrough ultimately felt like a waste of time, especially since you need to replay the entire game to see any of the differences. I wont spoil anything, but the ending is not what I expected, which made me appreciate it all the more. I didnt feel judged, or like I had made a definitive right or wrong choice, and the various endings reflect this ambiguity wonderfully.Afterparty poses questions you dont expect it to ask, and thats what ultimately made me satisfied with it  just dont expect a non-stop rager. As with most parties, there are high points combined with lulls. At the very least, the conversations, locale, and attendees make it a good party to attend, even if sometimes you get a little bored.", "date": "Oct 27, 2019", "grade": "7.75"}