{"name": "Planet of Lana", "ref": "https://www.gameinformer.com/review/planet-of-lana/chasing-potential", "text": "Since the release of Limbo in 2010, cinematic puzzle platformers have relied on capturing players attention and imagination with beautiful art directions and compelling, often enigmatic storytelling. As typically brief experiences, the moment-to-moment puzzles must hit hard with clever, memorable obstacles and not meander by rehashing familiar mechanics too often. Planet of Lana almost hits this sweet spot by boasting a gorgeous presentation, but trekking through this strange world doesnt always inspire the same awe.Planet of Lana wastes little time throwing players into the fire. As the young Lana, your small village, including someone close to you, has been abducted by alien machines. Its up to you to find and free everyone, and youre joined by an adorable (and pettable) cat-like companion named Mui. Watching tender and somber moments between the pair is a treat because everything looks so wonderful. From painterly grassy plains to postcard-worthy beachside vistas, several snapshots are worthy of being framed as art pieces. The majestic soundtrack sits high on my list of the years best, with the main theme, in particular, becoming a welcomed earworm that also has intriguing narrative significance.The game delivers an adequately entertaining tale, and its tough not to smile at Lana and Muis cute, though limited, interactions. The more exciting world-building happens along the edges, primarily through collectible, easy-to-miss fragments of an illuminating wall carving. Is this Earth or another planet? What are the machines, and where did they come from? Planet of Lana leaves some answers vague, but the intrigue helped propel me forward even if Im still drawing my own conclusions.Lanas deliberate, momentum-based movement feels fine but occasionally causes headaches, such as watching her slip over an edge after landing a big jump. Problem-solving involves the sometimes tedious task of moving objects into their correct positions and doing things in the proper order so that both characters can bypass obstacles. Muis superior agility means youll be commanding them to drop climbing ropes for Lana, activate distant switches, or lure away enemies. I just wish Mui didnt halt after performing actions so I wouldnt have to call them to my side constantly. Eventually, Mui and Lana can hijack animals minds or hack machines, respectively, to make them serve as platforms or weights for pressure-sensitive switches. These are cool abilities I wish the game utilized more often.These traversal puzzles have some clever ideas, but they dont evolve much or hit that next gear. You push objects, climb ropes, and crouch in tall grass to avoid patrolling machines for the bulk of the journey, albeit in moderately more elaborate ways. Some less recurring exercises break up this routine, such as manipulating the water level in lakes, but nothing I tackled truly wowed me, and I sometimes groaned when puzzles returned to the status quo. I solved a few obstacles on the first glace, and others can be disappointingly simple even deep into the game. Puzzle-solving may be middling, but Planet of Lana has a sprinkling of adrenaline-pumping moments. I got a kick out of a quick-time-event-driven race across the desert as your mount sprints through an armada of colossal marching machines.While I would have liked gameplay to have more bite and variety, Planet of Lana is still an enjoyable and beautiful romp. The art direction and main jingle are likely the only things that will stick with me in the long run, but Lana and Muis journey is a competent rescue mission that doesnt always soar as high as the machines pursuing them.", "date": "May 22, 2023", "grade": "7.75"}