{"name": "The Dark Pictures Anthology: Man Of Medan", "ref": "https://www.gameinformer.com/review/the-dark-pictures-man-of-medan/the-dark-pictures-man-of-medan-review-big-scares-little", "text": "I let out a startled shriek as a two-headed demon leaps into the room. Rather than running away, I stand my ground and jab a knife into the ghoul. Over my Xbox Live headset, my friend screams, Stop! Its me! Youre attacking me! His words come too late, however; my knife descends into his characters side one last time, stealing his life. My friend and I sit in silence for a few seconds, and then we both burst into nervous laughter over the craziness of what just transpired.The Dark Pictures: Man of Medan is at its best when you are playing it with friends, either two-player co-op online (which gives you control of different characters at the same time) or with five people in the same room (with each controlling a specific character and passing the gamepad). The reactions from your friends enhance any scenario, whether you pull off a narrow success or miss a button prompt that results in a characters death. In online co-op, even if your characters are together, you may see things your friend doesnt, which fosters a pervasive sense of uncertainty, paranoia, andfear. This is one of those games that is enhanced by players talking as the horror unfolds.Man of Medan is the spiritual successor to Supermassive Games brilliant PlayStation 4 title Until Dawn. The studios fingerprint is immediately recognizable in Man of Medan. The game is brimming with jump scares, life-or-death decisions, chapters ending with a creepy curator discussing what happened, and known actors (like Shawn Ashmore, Ayisha Issa, and Pip Torrens) delivering great performances. Being able to play this type of horror game with friends brings a fun new wrinkle to Supermassives formula, but a bland story and poor pacing leads to far too much downtime, and boredom sets in.Before the experience hits a lull, Supermassive does a nice job of setting the stage for players through a flashback sequence that shows an old war ship transform into a ghost-infested nightmare filled with dead soldiers. In the five or six hours of gameplay that follow this reveal, not much else happens in terms of narrative build up. I wont spoil too much, but the answers the game provides to your burning questions are notsatisfying.When the five playable characters are introduced, Supermassive spends far too much time developing them, and the experience drags for a good 30 to 40 minutes until they step foot on the ghost ship. Even here, however, the game plods along with little to do or see outside of rusted rooms that may occasionally hold a corpse. Only when a character starts hallucinating does the action pick up, and this doesnt happenenough.The atmosphere is consistently creepy, and even though not much is happening, Supermassive tries to keep players on their toes with jump scares, such as a steam pipe bursting loudly or a rat jumping out of a box. The scares are done well, and the visuals that accompany them are excellent, both in terms of detail and the cinematography that frames them. The only visual hiccup comes when your online friend makes a dialogue choice. The game zooms in on his or her character's face for a few awkward seconds as the choice is made.Trying to keep all five of the playable characters alive is the primary goal, and its a stressful one, as one failed button press can lead to one of their deaths. They all died horribly in my first playthrough, and then I saved two in the next. If that sounds fun to you, to get the most out of it, play the game online with a friend. Those moments where you are separated bring about an intense unease, and hearing what your friend is going through can be quite hilarious for all of the wrong reasons.Even though you have complete control of your character for exploration purposes, Man of Medans action feels like its on rails. If you are shooting a gun or are swinging a wrench, you are asked to move a cursor to a specific location before time expires. When a character runs or jumps, you simply watch it happen and are asked to hit a button at the right time. To stand still in a corner and hold your breath, you perform rhythmic button presses not unlike those in a music game. You never see anything like Until Dawns environmental interaction, which allowed you to pick if you wanted to run into another room, hide under a bed, or slide into thecloset. Again, there isn't much to do in the environments other than walk until the game triggers a quick-time sequence.Man of Medan isnt the success that Until Dawn was, and it represents a big step back in terms of player interaction and storytelling, but its still a thrilling horror experience that made me scream, laugh, and want to jump right back in for a second or third playthrough to see if I could keep everyone alive.", "date": "Aug 28, 2019", "grade": "7"}