{"name": "Age of Wonders: Planetfall", "ref": "https://www.gameinformer.com/review/age-of-wonders-planetfall/an-empire-forged-in-war", "text": "Age of Wonders is a long-running strategy franchise, but new entries only release every other blue moon. Age of Wonders III released in 2014. Before that, Age of Wonders: Shadow Magic dropped in 2003. Fortunately, these long gestations give Triumph Studios plenty of time to refine the strategy and pack a lot of tiny features into its robust combat system, and that is evident in Planetfall. This new Age of Wonders isnt perfect, but its unique strategy-driven battles were worth the wait. Previously, the Age of Wonders series dropped players into epic wars set within fantasy worlds full of elven courts and warring dragons. Planetfall warps you into the future; you awaken from cryogenic sleep to build a new empire on a variety of alien landscapes. The setting might be different, but the future remains full of colorful characters. I was impressed by the creativity expressed in every alien faction. The Syndicate is a purple-skinned race of intergalactic traders and merchants who possess powerful psionic attacks. The Assembly is an army of nearly undead cyborgs who see every planet as an organ bank ready for harvesting. And, the genetically engineered Amazons are stealthy warriors who ride dinosaurs into battle. Planetfalls factions are so interesting that I almost had trouble settling on one at the start of the game.No matter which faction you choose, you must plant your nations flag in the dirt and slowly push your boundary markers across the planet. As with other 4X games (like Civilization), this involves researching advanced technologies, constructing new buildings, and managing your populations happiness. Sadly, this top-level strategy is a bit stale in Planetfall, and I was rarely faced with interesting choices for what to build or research.As you explore your world, you meet other races who send you on missions, which keeps you busy while your citizens churn through your production queue. However, your diplomatic options are limited, and I found it hard to keep the peace. No matter how many favors I ran for other nations or how often I traded with my neighbors, my relations always deteriorated, and I was forced to call in my army. This makes these interactions feel more like youre only delaying the inevitable conflict, rather than engaging in political negotiations.Combat is where Planetfall shines. The early turn-based battles are slow, but you can always auto-resolve a combat, which is a great way to skip low-risk encounters that dont deserve your attention. Once I had built up a sizeable army, I had the most fun getting my hands dirty, issuing orders on the battlefield. Each faction has their own unique set of units and offers their own twist on the action. For example, the dwarf-like Dvar are fond of explosives and heavy tanks, while the Assembly rush at their enemies in hordes and can even resurrect their fallen comrades. And, since you can have multiple armies join a single battle, some of my biggest encounters felt truly legendary with over 40 units ducking in and out of cover.Your armies develop complicated team synergies. The insectoid Kir'Ko have a hive mind that gives them defensive buffs when they are positioned near each other. Other hero units are collected by completing various missions, and these specialized commanders are some of your most stalwart soldiers. As they fight, they level up, allowing you to pick from a range of upgrades that boost their ranged attacks and give them special immunities.Basic units dont have hero upgrades, but they can be equipped with mods that do everything from apply status effects to their attacks, let them to heal other units, or even allow them to phase through obstacles. I love the freedom this provides and how two identical unit types can be spec'd for different specialties. This flexibility gave me an endless number of choices on the battlefield so I never felt short of tactical options to work my way out of a jam.Age of Wonders: Planetfall takes several turns to get moving, and newcomers might feel overwhelmed until they gain their bearings, but Triumph Studios newest strategy offering is full of fun, creative ideas and each faction is worth taking for a spin at least once. Building a sustainable empire and managing a happy populous takes some grunt work, but they are really just stepping stones to Age of Wonders: Planetfalls epic firefights.", "date": "Aug 09, 2019", "grade": "8"}