{"name": "They Are Billions", "ref": "https://www.gameinformer.com/review/they-are-billions/a-diminished-dance-with-the-dead", "text": "Many days into your survival campaign, the restless undead await outside your fortifications. Its okay  youve prepared with a slew of stalwart defenses, snipers at the ready, and battlements ready to stave off any attack. The intruders come, banging on the gates, and you repel them all neatly. More are sure to arrive, but you have time to rebuild your resistanceor so you thought. With your gaze and efforts focused on the front line, a single zombie slipped through the cracks on your south wall and gained access to your hapless colonists. Because of that small oversight, an outbreak ripples through your entire settlement, spreading from within and turning your own forces against you. In moments, your once-great city lies in ashes. What do you do? Start again, of course! This time, youll be ready.They Are Billions has a challenging, randomized loop that places you as master and commander of a fledgling city in a variety of environments. In this captivating cycle, you continually refine your old strategies and develop new ones to handle the threat of invasion. The survival mode is the core avenue of play  building up a thriving colony from scratch, teching up, and expanding to take on greater looming threats.You have a variety of dials to tune before each game, allowing you to select the right difficulty for you, including how many days of preparation you have and how many undead (there arent actually billions, but there are enough) you must stave off. The game can be challenging even with a modest amount of difficulty selected, and with permadeath in play it can leave a bitter taste in your mouth after spending hours working on an impenetrable bastion. But if youre like me, They Are Billions will make you hungry for even more punishment and perfection.A wide variety of units and buildings are available as you expand, and every outing is a different-yet-delightful deluge of the dead. Raise an army of rangers and clockwork titans to complement defensive ballistas and shock towers as you move through the tech tree. Once you master fending off the standard shuffling and slow zombies, variable types get thrown into the mix, forcing you to prepare for speedy threats and colossal terrors. Most games become a delicate balancing act of expansion, economy, and military might; you must be careful not to overextend and put your expansive holdings at risk for a zombie incursion. Building up your fort is fun, even if your attempts end in failure most of the time.At the time of this writing, the PS4 and Xbox One versions lack the campaign mode you can find in the PC iteration. While this isnt a huge detriment (the campaign is not the main draw), the control schemes are unwieldy on a console controller. You can alleviate this by using a mouse and keyboard on your console setup, but your goal should be to experience the title on PC.They Are Billions is an interesting mashup of classic RTS, tower defense, and survival that successfully conjures up that one more game feel, assuming you can persevere through countless defeats.Check out our review of the PC edition of the game here.", "date": "Jul 23, 2019", "grade": "7"}