{"name": "Dragon Quest Builders 2", "ref": "https://www.gameinformer.com/review/dragon-quest-builders-2/rebuilding-hope-one-block-at-a-time", "text": "The original Dragon Quest Builders took Minecraft to the workbench and bolted on some much-appreciated structure to the building experience. Despite a repetitive formula, it was an enjoyable playground for those of us who enjoy freeform Lego construction but keep the instructions off to the side just in case. Now Omega Force and Square Enix are back with a hefty sequel that improves virtually every aspect of that original blueprint.Youre a helpful hero with a rare capacity to build. You and your new A.I. companion, Malroth, travel the world and leave things better off than when you first arrived. Unlike the last game, youre traveling on a ship instead of resurrecting in new places. Consequently, you have a port to call home. This island begins as a barren, desolate place that you wont be able to leave quickly enough. Over time, you can make it flourish however you see fit, but you need some extra hands to make that happen, and for that you have to go for a quick sail.The three main islands showcase different biomes and gameplay systems. For instance, one of the first places you visit, Furrowfield, is where you learn about farming. Thanks to an engaging story about an anti-builder cult and poisoned land, it doesnt feel like youre running through a tutorial sequence. I had a great time rebuilding the land and the raising the spirits of the various NPCs. Its silly, but its hard not to smile when a group of villagers rushes over and applauds when you build them a swingset  and they absolutely lose their minds when you complete one of their larger requests. As you improve villages, your efforts attract more recruits who move in and help with some of the less demanding tasks like cooking and tending the fields. That gives you more time to explore and solve puzzles out in the world or engage in the simple combat against wandering monsters.Other places teach you about mining and building defenses, and give you access to new blocks and items that you can take back to your home island. Online co-op allows you to enlist your friends to help you during free-play on your home island, but they cant contribute to your story progress. Theres a fairly significant catch, though: Co-op doesnt unlock until you complete the first story island and a few missions back at home base  a process that can easily take more than a dozen hours. Building with a friend is fine, but the single-player campaign is clearly the thrust of the experience; if youre looking for a quick co-op game, this isnt it.If youre looking for a quick game overall, this isnt it, either. I adore Dragon Quest Builders 2, but be prepared to settle in for a long journey. Even after spending about 50 hours with it, I was still unlocking new items and equipment, some of which are significant, like a pencil that allows you to create your own blueprints. The rollout of new building options is generous, but players who are looking to dive right into freeform building will find theyre working with a fairly limited palette unless they make more progress into the story.Fortunately, the campaign is peppy and fun, and filled with characters that have their own little personalities. The overall cheer and goodwill make the darker moments, such as a characters slide toward evil, feel all the more unsettling. Similarly, its kind of weird to see these fallen cutie-pies muttering Damn after theyve been vanquished in battle. Im not a Dragon Quest fan by any stretch, but that didnt dampen my enjoyment. Longtime fans might get excited to see familiar enemies, but you dont need any experience with previous games to have a great time.Dragon Quest Builders 2 has remarkable improvements, both large and small. Boss battle are now actually kind of fun. NPCs help you build some of the more ambitious projects, which lets you focus on doing your own thing. Malroth helps fight and gather resources, so you arent on your own. Other players creations are highlighted in loading screens and in-game bulletin boards, and you can easily visit (but not destroy) their worlds. This is one of those rare sequels that delivers on just about every front, so long as youre able to put in the time it asks of you. This definitely isnt a weekend project, but its one thats absolutely worth the effort.", "date": "Jul 12, 2019", "grade": "9"}