{"name": "SolSeraph", "ref": "https://www.gameinformer.com/review/solseraph/a-false-idol", "text": "In SolSeraph, you are a god. You build cities from nothing, command the elements, and fight off invaders. When the time comes to strike at an evil lair directly, you inhabit a corporeal champion who jumps and slashes through monsters until the threat is eliminated. Then you move on to the next area, taking a new nascent civilization under your divine wing.If that premise sounds familiar, then you were probably playing SNES back in 1991. Thats when publisher Enix released ActRaiser, a pioneering action/strategy hybrid with 2D side-scrolling levels mixed with top-down city-building. Though it bears no official connection to ActRaiser, SolSeraph uses similar gameplay in an attempt to continue its legacy. However, this modern take on a decades-old formula is so boring and repetitive that it crumbles under the weight of the torch its trying to carry.Despite its obvious influence, you dont need any familiarity with ActRaiser to understand SolSeraph. It alternates between traditional arcade action and simple tower defense, and both are easy to pick up. When you start a new zone, you need to clear a side-scrolling stage full of enemies like goblins, dragons, and bugs. These stages arent much to look at. Apart from a couple bosses, the enemies look like generic fantasy beasts, and the dull environments span an unsurprising collection of swamps, ice worlds, and deserts.The action is painfully simple. Even though you acquire a few different magical abilities (like healing and lightning), your main repertoire is jumping, slashing, and dodging. That isnt necessarily bad, but your limited options means the complexity doesnt evolve, so most of SolSeraphs difficulty comes in frustrating forms that feel artificial. For example, most levels have no checkpoints, so failure means starting from scratch every run. Another problem is how enemies can approach from the background and foreground. While this adds some visual dimension, it also blurs your perception of when these foes are vulnerable versus when they are on an inactive plane. Getting hit and restarting a level because you swung at an ambiguously nearby goblin is not fun.The civilization phase doesnt fare any better. You increase populations by building farms and houses, then put those people to work in defensive buildings like barracks and archery towers. That way, they can intercept the waves of monsters pouring out of their lairs and following the roads to your village center. The more of these waves you finish, the more temples you can build, which open the lairs to attack via the 2D action levels. This routine gets old fast. Its a bare-bones tower defense experience, and you only unlock a few other buildings to expand your defense options. Without a sense of growth and progression, each of the fives zones follows an identical development pattern with only minor variations. In the desert area, you need to a build a well before you can build farms, but that one wrinkle doesnt change your strategy in any interesting or significant way.Living up to a legend is practically impossible, but instead of providing an entertaining experience on its own terms, SolSeraph adheres to an ancient blueprint. It seems content to imitate rather than innovate, but its tedious gameplay cant even accomplish that. I love ActRaiser, and I cant blame SolSeraph for failing to recapture the magic of a 16-bit classic. At the same time, SolSeraph doesnt have much value apart from how it reminds you of a better game you may have played about 30 years ago.", "date": "Jul 09, 2019", "grade": "5.5"}