{"name": "Harry Potter: Wizards Unite", "ref": "https://www.gameinformer.com/review/harry-potter-wizards-unite/gotta-zap-em-all", "text": "Harry Potter: Wizards Unite is a more interesting and polished game than Pokmon Go, yet is too much of a spiritual successor for its own good. Many of the gameplay mechanics and ideas that carry over are shoehorned in, and ultimately hurt an experience that delivers some magic in the elements that truly speak to the licenses appeal.Like Niantics last AR phenomenon, Wizards Unite has you visiting real-world locations and interacting with fictional objects in order to build up a collection. Wandering the Muggle world and using various spells to round up misplaced confoundables, which can be characters, beasts, or wizarding items, doesnt have the same appeal as collecting cute Pokmon, yet is the backbone of Wizards Unite. When a confoundable is captured, it ends up as nothing more than an image in a sticker book.While some fun comes from trying to place every sticker on the books pages, catching the same thing over and over again is an exercise in monotony. Once a page has all of its items, you can wipe it clean and start again. The reward for this accomplishment? The page gets a new border design, and youre asked to claim even more of the same types of things. Since these items dont have any gameplay value (unlike Pokmon, which can battle for you in Pokmon Go), the only reason to catch them is to grind experience points. That grind becomes more pronounced the more you play. Catching the Weasleys Clock dozens of times just isnt fun, yet is the definition of what this game is.To catch something like the clock (or even Luna Lovegood), a spell must be cast like. To do this, you simply trace a squiggle that appears on screen as quickly as you can. This may sound easy, but its a surprisingly challenging and amusing test. Any kind of deviation from the line leads to a less powerful spell, which increases the chance of the confoundable running away. You can use potions to make the encounters easier, but these resources are not bountiful, and must be concocted using ingredients found in the world. Inventory space is ridiculously tight, and the bag fills up in no time, especially given you have to keep track of 23 different items. As a result, you are frequently asked to expand the bag's size using in-game gold or real money. Wizards Unites microtransaction baiting is intrusive, and decisions like repeatedly telling the player to expand the bag size make the game worse. The push to spend real money is far more pronounced than it is in Pokmon Go.This is frustrating since players are encouraged to collect everything they see, but the time it takes to brew potions with those ingredients doesn't line up with the time spent exploring. The player is better off exiting the game for extended periods to brew potions and free up some inventory space...or spend money.Wizards Unite also delivers a respectable kind of frustrationwith the confoundables. Even if you happen to stumble upon a Tom Riddle or Harry Potter encounterand perform a perfect spell, they may run away. The player needs to gain more power to have a better shot against them, and this is where Wizards Unite fascinates and sinks its addictive hooks into you. It delivers a legitimate pursuit of power with relatively deep RPG systems.When a player selects their profession, deciding to be an auror, magizoologist, or professor, they open up a skill tree offering over 130 upgrades that can enhance stamina, defense, and percentages to various things like wand damage and critical hit chances. The more the game is played, the more powerful the wizard. The grind is beneficial to gaining power, yet isn't that entertaining given just how often confoundables are repeated.Strong RPG elements also bubble to the surface in the fortresses, which push a team to battle against a set number of beasts and wizards on each of the 20 floors. The higher the floor, the higher the difficulty, and the need increases for players to team up to provide healing, buffs, and other kinds of support. I had a blast journeying throughfortresses with friends, but wish they werent timed. All too often our progress would come to an end because we spent too much time discussing tactics.Up to five wizards can journey together, but each battle is a one-on-one affair. These encounters are good fun, pushing you to hover a reticle over a moving target until a meter fills and a spell can be cast. When an enemy strikes, you simply need to swipe in a specific direction to deflect some of the attack. Damage is sustained no matter how perfect the swipe is, but you can at least limit how much is dealt.Now to the worst part of Wizards Unite: Progress for any activity can come to an abrupt end when a wand runs out of spell energy. Even if you are in the middle of a battle, the action pauses to ask you if want to spend gold to replenish the wand's energy. The only way to get it back is to visit inns, complete tasks, or cash in that rare gold. Again, Wizards Unite frustrates in its design, which often pushes for real money to be spent.Pokmon Go was (and still is) criticized for not having enough content, and Niantic and WB Games clearly took that to heart with Wizards Unite. Although everything revolves around the casting mechanic, this game is swimming with challenges, events, and mysteries to solve. A lot of this stuff comes down to dumb luck with what spawns around you, but at least theres some depth here to take a bit of the bite out of catching that damn clock repeatedly.No corners were cut with Wizards Unites visuals. Each encounter plays out like an animated skit, with detailed character models doing different things for catches and misses. I was quick to turn off augmented reality for catching, but it is used in a clever way for Portkeys. If a player enters a Portkey, they are transported from their reality to the Wizarding World for a fun 360-degree scavenger hunt in a known location like Hagrids hut.When Wizards Unite is trying to do something new, it can be good fun. Most of the content sadly ends up feeling like a strange version of Pokmon Go, giving players flimsy reasons to catch or zap em all.", "date": "Jul 02, 2019", "grade": "7"}