{"name": "Judgment", "ref": "https://www.gameinformer.com/review/judgment/cracking-cases-and-skulls", "text": "Kamurocho is no stranger to violence, but a recent series of murders is unsettling even for the crime-riddled Tokyo neighborhood. In a particularly gruesome calling card, the killer gouges out the eyes of his victims. Thankfully, Takayuki Yagami is on the case. An attorney-turned-detective, he has the credentials and tenacity to bring justice where its needed  no matter how far the investigation may take him. His methods might get results, but theyre ultimately overshadowed by the strong story and engaging world-building.Developer Ryu Ga Gotoku Studio is known for its Yakuza series, and Judgment is effectively a new Yakuza game in all but name. It takes place in the same place Kazuma Kiryu and company have called home for more than a decade, but the similarities dont end there. Animations, side activities, and other elements have been directly transferred over to this new title. The Yakuza franchise is great, but trying to keep track of its characters and plot (which span seven massive games) is a like trying to sip from a fire hose. Judgment is a completely fresh narrative start that doesnt require  or even reward  previous Yakuza experience. All you need to really need to know is that gangsters run this town, and the officials may be even bigger crooks.Judgments big bullet-point addition is how it leans into the detective fantasy. Yagamis agency is small, so he takes on a variety of mundane cases (such as tracking down missing items or an underpants-stealing creep) in addition to the larger, overarching murder investigation. That element is split into several main components, and some are stronger than others. The worst are the tailing missions, where you follow people without letting their suspicion meters fill. Theyre tedious and overlong, and theyre also an unfortunately common part of investigations. Conceptually, I liked the parts where you examine crime scenes for hidden details, which you use to put together a hypothesis on what happened. The actual stakes are disappointingly low, however; youre free to blunder your way through the dialogue options with no penalties, aside from some embarrassed text responses a slight ding to your experience bonus. The real consequences happen in battle, oddly enough.Yagami might not be a member of a crime family, but that doesnt mean hes safe as a civilian. Even before getting involved in the deeper mystery, hes constantly getting hassled and attacked. Thankfully, hes a solid brawler, and beating down thugs is dependably fun. He has a couple of fighting styles at his disposal, so you can take out crowds with swooping crane attacks or lash out at individual opponents with his tiger form. Judgment adds a wrinkle to the familiar framework with the introduction of mortal wounds. Tougher enemies can wreak additional havoc on the player by targeting Yagamis lifebar. If these attacks are successful, your maximum health is sapped until you see a doctor or use a rare item. Both are expensive solutions, and its quite possible to have neither one available during the frequent (and lengthy) set-piece encounters. Its an oddly punitive touch for a game thats so generous to players otherwise.Kamurocho has plenty to offer when youre not busy tracking down criminals. The biggest side activity is drone racing, which gives Yagami something else to do with his toy beyond spying on people. I went all-in on the mode, completing optional missions to get the best possible parts, though you dont have to engage with racing if its not your thing. I wasnt as excited about a lame virtual virtual-reality minigame, where you roll dice to maneuver on a weird life-sized playfield and get items for cash. Thats in addition to the array of casino games, arcade games, and other diversions at your fingertips when youre ready to take a break.Even though I wasnt in love with all of Yagamis investigatory tools, I had a great time seeing the Yakuza formula from a fresh perspective. Judgment tells a sprawling, action-packed story that veers dangerously close to melodrama without falling apart. It has some genuinely shocking moments, and proves that you dont need Kiryu or Majima as tour guides to have a great time in Kamurocho.", "date": "Jun 26, 2019", "grade": "8"}