{"name": "Cadence of Hyrule  Crypt of the Necrodancer Featuring the Legend of Zelda", "ref": "https://www.gameinformer.com/review/cadence-of-hyrule-crypt-of-the-necrodancer-featuring-the-legend-of-zelda/a-pleasant-but", "text": "As you might guess from its name, Cadence of Hyrule  Crypt of the Necrodancer Featuring the Legend of Zelda is a strange mix. It takes elements from the Zelda series (most notably its revered suite of music) and combines them with the dungeon-crawling roguelike action of Crypt of the Necrodancer. The two series dont always mesh harmoniously, but as a whole, they get along well enough to make for a gratifying musical adventure.Cadence of Hyrule is ostensibly a Zelda game, but the twists from Necrodancer put it squarely in spinoff territory. The most drastic change is the need to move along a grid to the rhythm of remixes from the Zelda series; failing to do so prevents you from moving for a beat, leaving you vulnerable. It also has more combat encounters than your average Zelda game, leaning into Necrodancers dungeon-crawling ethos.Combat is fairly simple. It takes time to internalize the variety of enemy patterns and how different weapon types work best against armored or ranged opponents, but once you have the hang of it, hearing your attacks line up with the beat of the music as you mow down enemies is a fun little thrill. You can also play as Link, Zelda, and Cadence (the heroine of Crypt of the Necrodancer), and each of these characters have different abilities that give combat a little more nuance.The rhythm-based gameplay puts a heavy emphasis on the music itself, and the new renditions of Zelda songs are a highlight. Each area features two remixes  one for combat encounters, and one for when all the enemies are gone (plus a short 8-bit loop when you pause). Most of these songs are great on their own, but the way the music swaps between tracks (especially in dungeons and boss fights) makes exploring and taking on dungeons the best way to experience the music.The other major twist Cadence of Hyrule introduces is the addition of roguelike elements, but mixing them with the Zelda formula doesnt always work smoothly. Your adventure will likely start out littered with deaths; a couple of hits from enemies is all it takes to kill you  which empties out all of your rupees, keys, and consumable items. This can feel punishing early on as youre learning the mechanics and how to move along with the rhythm.The scales eventually tip too far the other way as you build up more hearts, weapons, and items. After a few hours, I was brute-forcing most encounters without paying much attention to enemy patterns, since the odds were so heavily in my favor. Some temporary power-ups, like glass flails and iron boots, lose their appeal as you become a killing machine. Other items, like shovels, become a nuisance to re-acquire after they break. This uneven difficulty curve leads to only a short window in which combat is truly satisfying.Dungeons arent centered on using a particular item or trick, and have no real puzzle-solving. Instead, you work your way through a couple of tougher-than-normal enemy encounters until you find the boss key. Bosses introduce some interesting twists to combat, but the uneven progression hampers these as well, and I didnt have much issue plowing right through them. Considering dungeons and bosses are often the centerpiece of many Zelda games, thats disappointing.Still, the Zelda-fueled side of progression, like finding heart pieces, new tools to play around with (like the Deku Leaf and Power Glove), and getting permanent weapon upgrades is enticing. I scoured the map for every collectible, even after I was breezing through the encounters. The randomized nature of each run means some items arent put to great use while others (like the hover boots) trivialize certain puzzles, but I like how most of the major rewards require some critical thinking to nab.The mashup of rhythm and adventure works in Cadence of Hyrule, even if not all of the elements from Zelda and Necrodancer intermingle well. The spirit of the Zelda series, including its wonderful sense of exploration, iconic music, and fun combat are alive and well here, enhanced by a killer set of songs that both celebrate and elevate one of gamings most enduring soundtracks.", "date": "Jun 19, 2019", "grade": "7.75"}