{"name": "Trover Saves The Universe", "ref": "https://www.gameinformer.com/review/trover-saves-the-universe/hilarious-bizarre-and-familiar", "text": "Trover Saves the Universe comes from the undeniably strange mind of Justin Roiland, known as the co-creator of Rick and Morty. You wont find those two animated characters anywhere in Trover Saves the Universe, but the sensibility and humor of that show (including the moments when it goes too far and gets gross) are on full display. The dialogue, story, and jokes are all well done, but the by-the-numbers gameplay delivers a familiar action/platforming experience, even in VR.In this universe, you are an alien confined to a chair called a Chairorpian. Your two dogs are stolen by an all-powerful Abstainer, which he uses to give himself godlike powers. With your dogs in jeopardy, Trover is sent to help you recover them, which will also save the universe. The premise starts insane and maintains a high level of compelling ridiculousness.You are the Chairorpian, but you control Trover from the comfort of your chair as you work together to track down upgrades like double jumps and better attacks. You make your way through the universe by solving puzzles and beating up bad guys. The combat is straightforward and rarely requires more than simply mashing the attack button, and the puzzles and platforming rarely challenge, but controlling Trover feels good. Those elements feel like theyre only in place to move you through the bizarre story, and as a facilitator of that goal, the combat, platforming, and puzzle solving get the job done.Trover Saves the Universe never takes itself seriously while telling its story, but maintains a cohesive narrative. Trover grows as a person, the antagonist has surprisingly sympathetic motivations, and it all ends in a satisfying way that is well-punctuated by Trover running around and yelling about the best ending ever. But while all that is happening, Trover and others constantly break the fourth wall, referring to the adventure as the game or complaining about the budget. Some line readings even feature the actors erupting into fits of legitimate laughter as they clearly struggle to not break. It gives everything about the experience a casual, improvisational feel and I laughed alongside the cast during many moments. Im impressed with how the game incorporates absurdity while still telling a compelling story.Sometimes the humor goes too far and delves into gross subject matter, but it always made me laugh by catching me off-guard. Its best jokes are the ones that play into the relationship between the player and video games. It pokes fun at how players do what theyre told regardless of consequence and openly complains about puzzles until Trover just bypasses them with brute force, as a few examples. Interacting with the assorted characters is also well done as they react realistically to you hitting them with your sword or walking away in the middle of a conversation. I particularly like choosing the obviously wrong answers when given the chance to respond yes or no to questions, as it always leads to interesting and funny dialogue.Much like the rest of Roilands work, Trover Saves the Universe probably wont be for everyone. The narrative and cast of characters are weird, but this is a game made by a team of people who clearly love the medium of video games, embracing its shortcomings for well-executed jokes and delivering satisfying and often hilarious moments throughout.With Or Without VR?Playing in VR is optional and I didnt find one mode necessarily better than the other. I liked controlling the camera and aiming a special ability unlocked later in the story with my head in VR, but using the right control stick for those actions is a perfectly viable alternative if you dont own PSVR or dont like wearing the headset. The important elements, like the humor and story, come across with or without the aid of VR.", "date": "May 28, 2019", "grade": "7.75"}