{"name": "Dreams", "ref": "https://www.gameinformer.com/review/dreams/bringing-your-imagination-to-life", "text": "More than any developer, Media Molecule has been driven by a singular goal: to empower players to make and share their own games. LittleBigPlanet focused this concept on the 2D platformer, but clever players spent years devising ways to stretch and twist their creations beyond the genres confines. With the release of Dreams, Media Molecule obliterates those confines completely, giving players a broad and flexible suite of development tools to create whatever their hearts desire. Dreams may not strictly be a game, but the tools are easy and intuitive enough to make the creation process fun for everyone, which delivers a wealth of entertaining experiences noncreators can enjoy.As someone who spent hours tinkering with LittleBigPlanets editors but never published a single level, I didnt hold a lot of hope for what I could create in Dreams. At best, I figured Id muddle my way through the myriad tutorials, then spend most of my time surfing the creations of other more talented players. Instead, the reality has been the reverse, my skepticism replaced by continual astonishment at the possibilities Dreams offers.Foundational controls make sculpting and moving objects in 3D space a breeze, a visual programming language eases novices into computer logic, and a streamlined interface lets you hop between editing and playing prototypes instantaneously. You still need to devote several sessions to learning the ropes from Media Molecules video tutorials, but I cant overstate how smartly designed everything is, and it makes the creation process feel less like work and more like experimental play.Not only can anyone piece together a prototype out of primitive shapes, they can also make it beautiful with Dreams ground-breaking art tools. Much of the magic lies in Flecks, small artistic brush strokes applied to the surface of every object that result in the games evocative, dream-like aesthetic. These Flecks can be colored, unraveled, and animated as you see fit, and can turn a simple hemisphere into a lush, grassy knoll in seconds. If youve ever felt the frustrating sting of having a drawing fail to live up to your imagination, Dreams delivers the opposite sensation  Ive routinelybeen surprised by how much better my creations turn out than I expected. Every facet of Dreams, from sculpting to painting to the application of animations and effects, features this same ease of use.No matter how easy Media Molecule makes it, more people will want to just play games than create them. Again I was skeptical of what Dreams would have to offer, and again I was pleasantly proven wrong.Part of the entertainment of playing other peoples games stems from the novelty of knowing they used the same tools as you (How did they make that?!), but Ive also played plenty that are fun in their own right, from simple puzzle games to clever platformers to throwback arcade games. One users riff on Geometry Wars is so polished you could easily mistake it for the real thing. A 3D Bomberman prototype already looks better than any official title Konami released in years. At this point, most offerings are bite-sized experiences or works-in-progress, but Dreams has only been in early access a few weeks, and the amount of content is expanding exponentially.All Dreams creations are uploaded to the Dreamiverse, which is essentially Media Molecules take on what the Internet should be: a communal space full of positivity, sharing, and collaboration. Media Molecule tries to surface the best content for surfers via tags and filters, but more important is the ability to make and share collections. Once you find a creation you like, you can see what collections users have added it to, then jump directly into their other picks. Ive spent hours falling down rabbit holes within rabbits holes this way, and other players creations are more than just entertaining; they are inspiring.Even with a healthy selection of tutorials, Dreams pushes you out of the nest a little too early, leaving you to figure out some of the more advanced gadgets and variables on your own. Media Molecule also offers little guidance in the way of actual game design lessons, a role the studio is uniquely qualified to provide. Its no wonder many players have focused on creating clones of other games instead of tackling their own ideas. Dreams ongoing development may very well fix this, as Media Molecule says it intends to add more tutorials and masterclasses, but I hope it also fleshes out the number of gameplay templates, genre examples, and design exercises.Dreams is an idealistic vision of game development, where people create, collaborate, and share games purely for the love of gaming. No Dreams game may ever reach the polish of a triple-A title, but they also lack the cynical business side of game development, where test groups and microtransactions take precedence over unbridled creativity. The prospect that well someday see future developers who got their start in Dreams seems inevitable, but also moot  in a very real sense, Dreams players already are game developers. We may have longer to wait for the official release and Media Molecules single-player story levels, but Dreams is already a magnificent wellspring for those who love playing, creating, and thinking about games in all their many forms.", "date": "May 21, 2019", "grade": "9.5"}