{"name": "Observation", "ref": "https://www.gameinformer.com/review/observation/the-thrill-of-taking-back-control", "text": "Horror games are often loud and immediate when it comes to the shocks they deliver. Even the more restrained of the genres offerings, like Soma and Amnesia, often have indestructible hunters that consistently instill smaller jolts of fright pursuing you. Observation is different, trading pulse-pounding scares for a sense of creeping fear. You play a space stations artificial intelligence in the aftermath of a disaster, and this angle on puzzles and exploration produces a unique kind of horror  one that takes the time it needs to tell an ambitious story without interruption, letting players marinate in its lake of dread before unveiling the terrors at its core.You awaken on the station (itself called Observation) to find a scientist, Emma Fisher, begging you for help as the structure groans and burns all around you. S.A.M. (an acronym for Systems, Administration, and Maintenance) is the A.I. in charge of taking care of the crew of Observation. S.A.M.s memory cores and most of its functionalities have been wiped in the wake of whatever catastrophe has struck the station, meaning that as S.A.M., you have no idea what has happened and are at the mercy of Emma as she works to help you get all your functions back online.Uncovering what happened to Observation is the heart of the game, and its a hell of a plot, packed with constant twists that leave a trail intriguing and unsettling questions. What is the role of Observations crew? Are any of them still alive? Is S.A.M. a victim in all of this, or is it responsible for the disaster? And what else is lurking on the station beside you two? While these plot points all have satisfying resolutions, my favorite part of the narrative was watching Emma and S.A.M.s relationship develop as the story creeps along. Emma fluctuates between trusting and suspicious, and who can blame her when S.A.M. cant even verify that its not responsible for damaging the station?The pairs symbiotic relationship is reinforced neatly in the gameplay as well, with Emma needing S.A.M. to restore functions to the station and open doors for her to reach new places. In turn, Emma gives you power-ups that grant you more maneuverability and access to the stations various functions. Initially you can only manually operate various cameras in different wings of the station (think Five Nights at Freddys), zooming in on laptops and documents to obtain useful, story-progressing data. Eventually, you gain the ability to move throughout the station as a drone in order to conduct repairs and help Emma get where she needs to go. While these tasks sound mundane, theyre fun puzzles that help set Observation apart from horror-based walking simulators. For example, to bring back the power in one wing of the station, you need to restart various generators around the room. Jumping from camera to camera to access laptops and folders around the room gives you access to the schematics that you can use to dive in to the generators themselves and reboot them via a quick memorization puzzle. Other obstacles you have to overcome include time trials, math problems, and line puzzles. Observation is satisfying because its constant and well-designed puzzles make you an activate participant in the action as opposed to just an avatar wandering around. I needed a notepad to get me through a number of the harder puzzles, so you can expect to be challenged  but not to an unfair degree.While there are no game-over states, failing to solve certain puzzles alters segments of the story in subtle and neat ways I wont spoil here. Besides progressing through the plot, solving puzzles also helps S.A.M. The further you get, the more access to different wings of the (giant) space station you gain, eventually letting you jump from place to place like the eye of an all-seeing god. Outside of some fantastic plot-specific moments, this function is useful for exploring the station in search of optional collectibles like audio logs, photos, and journals that help flesh out the crew and take in some of the impressive architecture both in and outside the station.Observation (the space station) is a strong setting. Instead of a techno-haunted-house aesthetic, it uses realistic NASA-style construction with blue panels, sterile white walls, and constrained tunnels adorned with posters and family photos that serve as a cramped home for the crew. These trappings make the station feel eerily familiar; watching such a realistic space shift into something more horrific over time is an unnerving experience, with the literal structure of the station changing depending on what happens to it throughout the story. Even the act of moving through that space in either camera mode or as the drone is disturbing, as you never know what gruesome scene might be around the bend.I ripped through Observation in one six-hour sitting, propelled forward by the novel blend of challenging puzzles and gripping storytelling. Though at first glance, Observation may appear to be your traditional first-person horror game, Ive never played anything quite like it. Challenging and unnerving in equal measure, Observation shouldnt be missed by anyone in search of a mind-bending and unsettling thrill.", "date": "May 21, 2019", "grade": "9"}