{"name": "Supraland", "ref": "https://www.gameinformer.com/review/supraland/little-guy-big-world-great-puzzles", "text": "In Supraland, you are the prince of the red people tasked with figuring out why the blue people are tampering with your water supply. Your whole world exists in the sandbox of a child who, according to the lore, built the elaborate environment over the course of six hours. Zooming out even further (by watching the end credits) you learn that much of the game was created by a single developer, David Mnnich. As a result of the small team, the seams show occasionally and the production values are underwhelming, but Supraland overcomes those shortcomings by offering fantastic puzzle design and a big world that rewards exploration at a steady clip.You explore a series of interconnected areas in first-person, solving puzzles and acquiring new items that help you get past previously impassable doors and blockades. In this way, it feels similar to the Metroid Prime series. Upgrades range from boosting your sword strength to getting a special magnet that lets you climb metal objects with ease. Even the smaller stat-boosting upgrades feel significant, and theyre tucked away in just about every nook and cranny, which makes exploration worthwhile and consistently rewarding.Supraland shines brightest with its puzzle design. You can generate a block out of thin air to help you platform or activate switches, but thats just the beginning. Puzzle mechanics rarely repeat, and have you jettisoning yourself and bullets from jump pads to hit switches, using paint to re-color certain objects, and directing electricity currents through water. Up to the final boss, I was always stretching my arsenal of puzzle-solving tools in interesting and unexpected directions.Combat falls short compared to the exploration and puzzle solving, but it only occupies a small portion of the total experience. You have a sword and a gun, but it wasnt until I was about halfway through and had acquired a healthy collection of upgrades that I started feeling powerful enough to look forward to conflict.In the context of the story, the narrative is being directed by a young boy overlooking the sandbox. With that understanding, I suppose the bad dialogue and constant references to pop culture could be considered a purposeful choice, but I mostly found it distracting. At one point, a character dressed like Marty McFly from Back to the Future appeared to give me some help, but his outfit had no bearing on his character or the story. Even if the juvenile story is supposed to be coming from the mind of a child, the boy isnt enough of a presence in the narrative (or physically in the environment) to reinforce that concept.The dialogue and combat shortcomings ultimately make up a small portion of Supralands total experience. Exploring, tracking down upgrades, and solving the puzzles are where the game flexes its creativity and fun, and it leans on those strong elements with most of its weight to create a consistently compelling experience.", "date": "May 02, 2019", "grade": "8"}