{"name": "SteamWorld Quest: Hand of Gilgamech", "ref": "https://www.gameinformer.com/review/steamworld-quest-hand-of-gilgamech/streamlined-strategic-deck-building", "text": "The fantasy/steampunk SteamWorld Quest: Hand of Gilgamech offers a streamlined and highly accessible foray into a genre known for complexity and strategy. While this classic, turn-based affair hinges on cards and decks, anyone whos ever leveled up and explored a dungeon has everything they need to dive right in to this adventure. SteamWorld Quest is a colorful and fun (if woefully linear) dive into the new age of deck-building, role-playing fare.You assemble of a team of three characters from a larger pool to take on chapter after chapter of straightforward dungeons and puzzles. With little room for exploration and deviation, the dungeon-crawling does little to impress  but the characters, combat, and cards carry the experience. Deciding who to place in your lineup and what abilities to use forms the core of the decision making, and you have enough options there to keep things fresh. Rather than just simply playing an attack or a heal, your cards form ability chains that trigger special moves, employ special combos that work with your other characters, and keep a healthy balance of buffs, debuffs, swings and skills in order to craft the best possible turns. Destroying a chapter boss after selecting the perfect selection of skills is satisfying, even if the trappings surrounding the encounter leave something to be desired.The story is forgettable if you can even be bothered to follow it, but youre free to go back and replay earlier chapters to make sure you dont miss any rare cards. You can also head to an arena with unique challenges and rewards, but most of the game is a straight line with simple puzzles. You may have to grind depending on your difficulty selection to increase your base stats and collect resources for new cards, but it never feels overbearing. Coming up with new ways to use various moves together is refreshing, like creating a sustaining regeneration team, or using powerful abilities that may take a crew member out of commission in exchange for dealing insane damage.While the environments may lack punch, your crew is a smorgasbord of charm and engaging skill baskets. One your party members is a blast, bringing a synergy of axes and arcane damage that completely steals the show with powerful debuffs and devastating attacks. Other characters, like the buff-based robo-frog and mask-swapping samurai, add enough flavor to keep the card-swapping and switching compelling to the end.Seasoned deck-builders will lament a lack of options for more advanced strategy like distilling decks down to a few potent cards via card removal, but the game deftly dips into more advanced territory via a few abilities that let you stick cards in your opponent's deck or add special ones to yours. On the flip side, players who enjoy pure RPGs shouldnt feel any trepidation at the card-fueled gears, as its highly accessible for anyone that enjoys a light-hearted adventure.SteamWorld Quest plays it too safe to satisfy hardcore card-crawlers, but the campy characters, gratifying combat, and splashy synergies make it an enticing option for those looking for a traditional turn-based RPG thats easy to wade into.", "date": "Apr 23, 2019", "grade": "8"}