{"name": "Heaven's Vault", "ref": "https://www.gameinformer.com/review/heavens-vault/unearthing-ancient-mysteries", "text": "Building a fictional language from scratch is an ambitious feat. While a handful of games (like Far Cry Primal and Skyrim) twist made-up tongues into their narratives, you dont have to learn them yourself. Heavens Vault, a new adventure game from the makers of the mobile title 80 Days, centers entirely on teaching you a hieroglyphic language and successfully packages it into a fascinating world.Heavens Vault tells the story of young archeologist Aliya and her companion robot Six. After a roboticist goes missing somewhere in the Nebula, you must travel to distant moons searching for him. Each clue you unearth on these moons, whether its an artifact or an inscription, leads you closer to answers not just about the roboticist, but also about Aliya, the world she lives in, and its rich lore. With every new piece of history I found, I was eager to see where it would lead me next.The most significant discoveries during an excavation are inscriptions marked onto monuments, statues, weapons, and more. When you find one, Aliya opens her notebook and attempts to translate it. At first, the only way to decipher these hieroglyphs is with the help of context clues around you or with blind guesses. Aliya suggests a handful of meanings, and you can select some to ascribe to specific glyphs in the phrase. For example, you may choose fire if you notice the inscription is written atop a fireplace.As you progress, you start learning the language yourself. I was able to identify parts of phrases as recognizable glyphs for words like goddess and death that I had translated before, which was a satisfying feeling. The language puzzle recurs often, but it never feels all that repetitive since each new glyph is a learning experience.Even wrong translations arent a lost cause, since you can always change your mind later and modify it. Errors can even help narrow down your options. For example, inserting several wrong guesses into a long phrase leads Aliya to cross them out and switch them for new guesses instead. You dont always know if youre right or wrong immediately, bringing ambiguity to your research. I thought this was a neat touch that adds realism to the experience.The moons you frequent are beautiful, with varying biomes like deserts and forests. Some are civilized, like Aliyas old home filled with bustling marketplaces. Others are long-abandoned, with many secrets hidden inside crumbling infrastructures and temples. Despite no one living there now, it gives the incredible feeling that youre treading over the land of ancient civilizations. The constant chatter between Aliya and Six also brings entertainment to exploration, since their strained relationship involves a lot of snide comments and sarcasm.Visiting these moons is enjoyable, but small technical issues surface to break the immersion. During certain cutscenes, the camera fixed on a wall instead of someones face. Another time, Sixs body disappeared when he spoke. Moving around can also be tiresome, since Aliya moves so slowly. Heavens Vault is meditative in tone and pace, but even with that in mind, my patience wore thin. These issues are unfortunate, but they never got severe enough to kill my curiosity for Aliyas adventure.You use your ship to travel between moons, but poor controls make it cumbersome to maneuver, especially over long journeys. First, you plot a course on a map, and then you steer it through rivers in the skies (which are literally paths made of water) to head to your next destination  a long process that grows tiresome. You can fast-travel to some civilized moons, but since most of your time is spent on abandoned ones, this shortcut feature is limited.Between exploring ruins, you meet a cast of vibrant characters who help guide you towards your next destination, like a sleazy artifacts trader and a friendly scholar. However, watch what you say around others; some may cut off business with you if youre rude. While this made them feel like real people, it irked me when it would happen with no warning.Heavens Vault is both ambitious and beautiful. It conjures a world rich with life; I enjoyed learning about the different cultures and religions of those dead and alive. Despite the long travel segments and a handful of bugs, I dont hesitate to recommend Heavens Vault. The impressive language-learning mechanic largely succeeds, and with a world brimming with detail, it makes this adventure an exciting one.", "date": "Apr 18, 2019", "grade": "8"}