{"name": "The World Next Door", "ref": "https://www.gameinformer.com/review/the-world-next-door/all-style-no-substance", "text": "Games often take you on a journey that becomes greater than it first appears. An evolution usually occurs within the mechanics or narrative the more you play. Characters get more powerful, or their personalities develop in intriguing ways, and one way or another, we get a payoff. Unfortunately, The World Next Door never achieves more than whats on the surface. A great art style only goes so far, especially in a narrative-driven game where the story should be the strongest feature. Sadly, the narrative is The World Next Doors most disappointing aspect. The one-note characters and the predictable storynever go anywhere interesting, which left me disappointed.You experience the journey through Jun, a girl who has won a trip to visit a parallel world full of magical beings. Just like Jun, youre discovering this unique place and learning about it from the students attending a school for harnessing their magical abilities. When Jun is suddenly trapped in this parallel land, she must rely on the help of others to teach her the ways of magic and get her home. This is about as exciting as the experience gets. The world doesnt hold many surprises, and the characters never develop beyond their initial personality traits. Horace plays his part as the rebel who likes to make mischief, while Rainy remains the meek and cautious one, but I couldnt tell you anything else about them beyond those traits. You never feel your friendship growing, despite having dialogue choices and opportunities to text them after big events occur. These exchanges never hold anything of substance beyond what you already know about situations and the characters and feel more like filler than conversations worth having. Speaking of dialogue options, your selections simply allow you to pick Juns personality and reactions to whats going on. The World Next Door has a big focus on building your friendships, so I was disappointed to discover that deciding who to spend time with doesnt reward you or influence your relationship in any way. Even the side quests focusing on different characters dont bring anything new to the table. These boring fetch missions dont change your relationship or offer any touching moments or ways of seeing your bond grow. At the very least, you can choose which characters you want to bring into dungeons, which lets you borrow their special powers during combat, whether its a giant shield to block damage or a powerful, multi-hit attack.The unique combat is my favorite part of The World Next Door. It borrows elements from popular match-three games, such as Candy Crush and Puzzles and Dragons. As an avatar on the grid, you must dodge enemy attacks in real-time while matching three or more tiles of any element to unleash magic. You can move one magical block at a time to create your ideal match. Activating different spells adjacent to one another also increases their power, so launching a fire spell and then hitting a water spell near it in succession bolsters your damage. I had fun finding ways to maximize my damage, whether that was moving blocks around to match more than three for increased power or stunning enemies with an electric spell to ensure my fireball wouldnt miss.Bosses all hold their own unique challenges, such as one that can change the elements of a square youre on as you line up a magic attack. I liked how it challenged me to figure out the optimal way to attack, but theres also some urgency to it, as not dodging at the right time can cause you to take damage. Some spaces are more cramped than others, adding more importance on placement and timing. While I enjoyed the combat and bosses, the dungeons leave much to be desired, with blandempty spaces with hardly any detail to differentiate one room from the next. Without much interesting going on within the story or exploration, the whole experience suffers, especially as the standard battles and dungeons get repetitive.Outside of the art style, The World Next Door feels generic and doesnt do enough to make the adventure feel exciting. I expected something to pay off in the long run, whether it was the story, my choices, or time I spent with characters, but I instead ended the game saying, Thats it? It made me feel like I wasted my time getting to know this world and the people who inhabit it.", "date": "Apr 08, 2019", "grade": "6"}