{"name": "SpongeBob SquarePants: The Cosmic Shake", "ref": "https://www.gameinformer.com/review/spongebob-squarepants-the-cosmic-shake/not-quite-a-sweet-victory", "text": "SpongeBob SquarePants: The Cosmic Shake feels like a game of yesteryear, in both good and bad ways. Its a nostalgic romp through themed levels that feel more inspired than just another platforming tour through Bikini Bottom. It does a great job highlighting why people that grew up with SpongeBob SquarePants loved the show, and why people still love it today. At its best, the gameplay is decently fun, but at its worst, its mindlessly dull. This, coupled with a few bugs, like one that caused music to disappear completely, or the three hard crashes I experienced, keep this sponges latest adventure from going beyond anything more than average.Mermaid fortune teller Kassandra is in Bikini Bottom, and she gives SpongeBob and Patrick a vial of magical bubble soap that cracks open the underwater multiverse, bringing chaos to Bikini Bottom. Its up to SpongeBob to rescue his friends by visiting various worlds in an effort to restore the city to its former glory. These themed locations take SpongeBob on pirate adventures, to the wild west, medieval times, and more. These levels were among the highlights of my roughly 10 hours with The Cosmic Shake. Purple Lamp does a great job recreating the world of SpongeBob in these themed biomes, and it was neat seeing how different classic characters got on in them.Mr. Krabs is a money-hungry corsair in the pirate-themed world, while Mrs. Puff runs the seahorse riding school in the wild west level. That the shows actors voice these characters adds a premium touch to every interaction. And perhaps ironically, the best writing in the game is the original work by Purple Lamp, with multiple instances that made me laugh out loud (Patricks trademark dead-pan naivete being the standout). When Purple Lamp forced specific references to the SpongeBob SquarePants show, though, I grew either bored or outright annoyed at the writing. Hearing SpongeBob sing the Krusty Krab Pizza song, an unironic banger, the first few times was cute, but hearing him sing it randomly while I platform around a Hollywood-esque movie set for the tenth time is anything but.The platforming in The Cosmic Shake starts and ends rudimentary, but I dont mind it  aimed at children, this level of difficulty feels appropriate. I jump, glide, body slam, and karate kick my way through simple platforming sequences, defeating enemies with an equally rudimentary combat system. I do this using a standard jellyfish-catching net swing, SpongeBobs body slam, or a karate kick. Combat is unremarkable throughout the game. Unless forced into it, I only defeat who I need to and move on.When Im not fighting against jelly creatures from the multiverse, Im collecting jelly scattered around each level and within tiki crates, which I use to purchase one of a couple of dozen costumes, or Im tracking down gold coins, golden spatulas, or some other item. Getting through each levels main objectives is a breeze  go here, do this, and fight a boss at the end. But side objectives from various Bikini Bottom residents give reason to jump back into each level to collect more, and its here I found the most challenge. I do wish more of this challenge was present in the main objectives, though.Purple Lamp showcases a clear adoration for SpongeBob SquarePants, with jokes, deep cuts, and characters that brought me back to my childhood. And when they werent forced or overused, they worked well in the narrative. I especially loved hearing that one fish scream about his love of chocolate, and hearing My leg! brought me great joy. When The Cosmic Shake is at its best, it sounds, looks, and plays like the kind of game I would have begged my parents to buy me growing up. But when it falters, its boring. Its a game I recommend to fans of SpongeBob SquarePants with ease; for those looking for a great platformer, though, better options lie elsewhere in the sea.", "date": "Jan 30, 2023", "grade": "7"}