{"name": "The Walking Dead: The Final Season", "ref": "https://www.gameinformer.com/review/the-walking-dead-the-final-season/a-goodbye-full-of-highs-and-lows", "text": "Goodbyes are never easy, especially when youve spent the last seven years invested in a character. The feeling is compounded when youre experiencing the last product by the studio that created her; The Walking Dead put Telltale Games on the map with its focus on emotional storytelling and player choice, but it all came all crashing down in 2018 when the developer shuttered before completing the fourth season. Skybound Games came to the rescue, hiring on previous Telltale employees to finish the story as it was originally planned. This finale is a fitting tribute to Clementine and her journey, but it also is inconsistent in quality and suffers from some narrative missteps that are impossible to ignore. Weve watched Clementine grow from a naive girl into a resourceful and hardened warrior. Part of this was thanks to her preparation from Lee, the main character of the first season, who did everything in his power to protect her. This final season puts Clementine in a similar position, as she looks after a child named A.J., who we first met in season two. The biggest difference is that A.J. hasnt known a world other than a zombie apocalypse. In a harsh kill-or-be-killed landscape, instilling a sense of right and wrong in a child is difficult. However, your lessons shape the person A.J. becomes and the choices he makes.The overall narrative keeps you on your toes, and its exploration of Clementine and A.J.s relationship is well done. It has the betrayals, zombie hordes, and difficult choices weve come to expect, but A.J. is a wild card. Hes still learning whats acceptable in the world around him. This means he struggles navigating social situations and knowing how far to go in high-pressure moments. When do you determine if someone is no longer a threat? When is it better to spare or kill a person? Do zombies still retain any pieces of their former selves? The answers to these questions are less clear for A.J. than Clementine.Things get particularly intense when you meet another group of survivors who have converted a secluded school into a safehouse. Nothing has felt closer to a home for Clementine and A.J., but the individuals in their new alliance are still getting to know the pair while harboring their own dark secrets. The season has twists and surprise appearances, and is an intriguing exploration of Clementines growth as a person because we finally watch her step into a more adult role and see the impact her post-apocalyptic upbringing has had. Shes not the same little girl from seven years ago. Shes had to relearn to trust, fight to keep her humanity, and take on a parental role. I enjoyed seeing her become to A.J. what Lee was to her, and not many games actually let you grow up with a character the way we have with Clementine.Since this is the finale and our goodbye to this special character, the season hinges on the conclusion to Clementines story. Unfortunately, that aspect is disappointing. I wont spoil anything about her ultimate fate, but the narrative approach to it feels forced and not true to the series. Certain facts seem to have been deliberately overlooked to give Clementine the ending the writers wanted, regardless of whether it makes sense within the rules of the world. This is not the kind of thing players should have to overlook in a moment this important for a character theyve been invested in for years.The choices you make influence the dialogue, certain actions A.J. takes, and your relationships. In many cases, you are forced to pick between two characters, whether its something as simple as who to spend time with or as dire as who to rescue from death. My favorite choices came down to the example I wanted to set; this is all about teaching A.J. how to survive, and at one point, you need to decide whether to take off the training wheels and trust him to make his own decisions. Its a scary moment that captures the plight of a parent. I felt the anxiety and uncertainty of whether or not I had properly taught him how to be as a person. In many ways, you ask yourself as Clementine if you really know best inside a world where being empathetic and kind can cost you your life.Some new and creative ways to implement QTEs help keep the action varied. Whether youre activating traps, stunning zombies, or using new weapons such as a bow and arrow to line up headshots, the action sequences give you more options. You also explore a decent number of different locations, including a school and a massive boat. The only frustrations I had dealt with the poor visual cues for knowing where to look or target an enemy, sometimes resulting unfair fail states just to figure out your cursor needed to be pointed slightly down to attack an enemys foot instead of their midsection.Characters also take a frustrating all-or-nothing approach to your actions. For instance, one guy asked me not to kill any zombies. I respected his wishes, stunning a multitude of zombies instead of stabbing them to death, but at the very end I got caught off guard, accidentally pressing the kill button to down one zombie. The sequence ended with the character yelling at me that I didnt even try, which obviously wasnt the case as I avoided all zombies up until that point.After following Clementine all these years, I look back at some seasons and wonder if they were really necessary. But Id be lying if I said her ending was completely unfulfilling, even if I had to suspend my disbelief. Seeing Clementines story end is bittersweet. For anyone who has cared about her fate, its worth seeing if she can survive the terrible odds or if shes doomed to travel the same path as Lee, but just know that you are likely to come away with mixed feelings.", "date": "Mar 27, 2019", "grade": "7"}