{"name": "One Piece: World Seeker", "ref": "https://www.gameinformer.com/review/one-piece-world-seeker/king-of-the-one-piece-games", "text": "Over the past 18 years, the anime/manga One Piece has received myriad video games across numerous genres. Among all those adaptations, World Seeker represents what is easily its most ambitious attempt to emulate what it might be like to be Luffy and be part of his Straw Hat crew. World Seeker may lack the detail and technical prowess of its open-world peers, but it delivers fun combat and exploration in an open environment with an enjoyable story to pull you along through the whole journey.It all starts when Luffy and his crew, in their ongoing mission to acquire treasure, end up on an island that is home to multiple large pirate prisons. When it turns out the rumored treasure was just a ploy to get the Straw Hat crew to come to the island, Luffy escapes capture and decides to help the citizens get their homes back. This means getting in the middle of a decade-long conflict between those who appreciate the overbearing presence of the Marines on the island, and those who detest it. The prison island setting also serves as an excuse for some of Luffys familiar opponents to appear as bosses or fun cameos. The story feels like One Piece all the way, which is a compliment. Luffy and his crew are familiar with standing up for those in need regardless of the conflicted histories that plague the islands they visit. Whether or not World Seeker is canon to the larger One Piece story (which is never explicitly made clear), this tale feels like it could be.The thrill of moving through the world is World Seekers biggest highlight. Whether Luffys grabbing the sides of buildings or the tops of trees, his rubber arms propel you through the environments at high speed. It feels great, and after acquiring some upgrades, zipping from point to point lets you cover tons of ground quickly. Plus, it looks awesome. I enjoyed it so much, I often chose moving around that way instead of using the fast-travel system.The open world looks nice and features diverse settings like a full city, forests, and a crystal mine embedded in a mountain, but it doesnt feel particularly alive. Despite the size of the city, the population is small, and most citizens stand still to offer up bits of dialogue. It gives you a chance to get to know everyone at least a little bit, which pays off well in the finale, but its at the expense of the world not feeling particularly lived in.Outside of talking to citizens and delivering requested materials found in the world or just generally exploring, the main way Luffy completes missions is by beating up bad guys. The combat is simple without any complicated combos, but you can switch between a powerful one-on-one focused stance or one with a wider range for big groups of weak enemies and use super attacks pulled directly from the source material. You can also mark enemies from a distance and stealth your way through encounters, which is especially satisfying on higher difficulties. The combat animations are great, which is good because you do see the same attacks often, but the speed of fighting is brisk enough that I didnt get bored.A skill tree offers a collection of worthwhile upgrades, like being able to fly further when you launch yourself or spin your feet around like a helicopter to float, but a handful of duds mar the selection, like one that lets you open chests faster. Overall, the good upgrades and additional special attacks feel substantial, but not every skill is worth your experience points.You can also focus on material collection to create items and new costumes, or send your crew off on missions to collect additional materials while you attend to the main quests. Your interactions with the main cast of characters is tracked with the Karma system, which doesnt offer a ton of in-game rewards, but I liked having a visual chart detailing my relationship with many of the characters I had come across in the adventure.In terms of open-world game design, World Seeker isnt an innovator, but it borrows and re-imagines familiar mechanics well (from the Batman: Arkham games, in particular) and proves why they are perfect for the One Piece universe. I had a good time flinging myself around the open environment while using stretch abilities to beat up bad guys and enjoyed the story. I was eager to upgrade Luffys best abilities, grow my Karma, and learn more about the island by completing as much of the side content as possible.", "date": "Mar 13, 2019", "grade": "8"}