{"name": "R.B.I. Baseball 19", "ref": "https://www.gameinformer.com/review/rbi-baseball-19/strike-six", "text": "R.B.I. Baseball 19 is yet another swing and miss for a series that hasnt hit a home run (or even found a way to get on base) in the six years since it was revived by Major League Baseball. The fundamentals of the sport are apparently as difficult to nail down as proving a Roger Clemens drug test, and continue to haunt this series to the point that the outcomes of games are frequently dictated by glitches and bizarre A.I. decisions.In a situation with runners on first and second, I threw a slider that resulted in a weakly hit grounder to short, but the game gave me control of the third baseman for whatever reason, and the ball ended up rolling into the outfield untouched. In another nail-biting situation, the game messed up and applied the flyball indicator to pitches and removed it from actual flyballs. On the next pitch, the batter lofted the ball into short right field, but I couldnt figure out exactly where it was going since the indicator was gone. The ball touched down in the grass and a run scored. Major League Baseball also didnt create fielding outcomes for some situations, like a shortstop inducing a double-play by stepping on second and then tossing the ball to first. The shortstop stops dead in his tracks on the bag and then the ball magically erupts from his body and flies to first. I also witnessed errant throws sailing past the first baseman, but an out was recorded and the ball just disappeared. All too often, if a fielder gets the ball, but takes an awkward angle to it, he will perform an odd sidearm throw that rockets across the diamond at 100 mph. This is a matter of trying to deliver realistic outcomes, but not having animations that fit those scenarios.On the bright side, the faulty A.I. sometimes works in your favor, as baserunners can be fooled into easy outs. When stealing, the A.I. may pull up short of the base, freeze in its tracks, and then foolishly try to go back to the previous base. The same strange faulty logic is at play for balls hit into the outfield. Odds are you may net a few outs a game this way, but the computer still has the upper-hand with glitches.As spotty as the performance on the field is, R.B.I Baseball is making a little progress in its presentation. Over 350 player likenesses and animations have been added to this years game, and they arent trivial little additions. When a new waggle or stance is added for a batter, care was taken to make them look just right. I also liked just how deep MLB went with the legends in this game, bringing back over 165 players of yesteryear, which you can add to your franchise teams roster.The 10-year franchise mode hasnt evolved much, and the A.I. logic still lets trades along the lines of the Cubs landing Mike Trout for Alec Mills and Victor Caratini go through. Sorting through free agents and the extended roster is still a bit of a pain as well.The best part of the R.B.I. ends up being the new soundtrack that you listen to while scrolling through menus. OneRepublic, Greta Van Fleet, and Chvrches deliver catchy tunes that will make you rock in your chair in the moments leading up to eventual disaster unfolding on the field. I know that's a sad thing to highlight, but there's little else to rave about. I also enjoyed the home-run derby, but the swinging timing seemed rather unpredictable, and I found most of my tower shots were on swings that were intentionally made early.As much as we want a fun baseball game on Xbox One and Switch, R.B.I. Baseball 19 is once again not the answer. The problems with the series have reached legacy status, and although its clear Major League Baseball tried to make a better game, the efforts were not enough. The focus should be shoring up the gameplay first and foremost, not making sure some of the star players shake the bat the right way. For six years weve been saying maybe this is the year, and the result is once again maybe next year.", "date": "Mar 07, 2019", "grade": "4"}