{"name": "Tetris 99", "ref": "https://www.gameinformer.com/review/tetris-99/winner-winner-tetris-dinner", "text": "When the battle royale genre began its rapid climb of popularity and it was clear others would be adopting the format into their own games, the idea of Tetris battle royale became an absurd joke meant to undercut the industrys eagerness to embrace popular trends. Tweets and Photoshops imagining what a Tetris battle royale would look or play like appeared and we all laughed at the ridiculous idea. Now that it exists, we should all feel collectively dumb, because its a lot of fun and it can get surprisingly intense.In the aptly named Tetris 99, you play classic competitive Tetris against 98 other players simultaneously. The typical Tetris gameplay is fully integrated here, and it looks nice and plays well. You can employ familiar tricks like saving blocks and hard-dropping pieces by pressing up on the d-pad. You see miniature versions of all the other games happening around you, and watching the other players live makes the whole experience exciting and intense, especially if you make your way to last handful of players.Just as you have in the past when playing Tetris against others, you send your deleted lines to opponents, and you receive the deleted lines of other players. You can play Tetris and have a good time by just letting it default who you are competing against randomly, but some additional depth is mapped to the right control stick allowing you to choose who gets your deleted blocks. You can send your blocks to those attacking you, those who have the most badges, or to those who are in danger of being defeated soon. You can also manually select from the individual 98 other players with the left control stick, though this is an admittedly difficult tactic.As you defeat opponents, you get badges, which let you send exponentially more deleted lines to the competition. Getting to choose who gets your blocks expands Tetris baked-in thoughtful puzzle gameplay and it adds a fun layer of strategy to the endgame. Figuring out how those new mechanics work on the fly can be intimidating, though. A tutorial would have been helpful, since I spent my early rounds not really understanding what I was doing, even if I was playing Tetris well. Thankfully, if youre a skilled Tetris player uninterested in those new mechanics, you can succeed without fully engaging with that element.The random nature of who you are competing against leads to frustrating rounds where you get unfairly decimated within the first few minutes. An overwhelming number of lines can get dropped on you at once, and even if you were playing well, it can knock you out. Thankfully, jumping into a new round is relatively quick, so you wont feel the sting of defeat too long.You level up as you play, but outside of the number next to your name going higher, and the icon representing you changing at certain tiers, the progression isnt particularly rewarding. The overall scope of the game is limited, but its engaging enough to keep you coming back for more.Tetris 99 is a pleasant surprise, and is my favorite content offered by the Nintendo Switch Online service to date. The idea of playing Tetris against 98 other players at once seems ludicrous but is fun in practice and delivers intense moments just like when youre among the final few in a battle royale game.", "date": "Feb 18, 2019", "grade": "8.5"}