{"name": "Jump Force", "ref": "https://www.gameinformer.com/review/jump-force/super-smash-blunders", "text": "Jump Force is not the first time characters from disparate Shonen Jump manga and anime franchises have faced off against one another in a fighting game, but this release represents the biggest and flashiest mashup brawl they have ever engaged in. The 40 characters have multiple bombastic animations for their noteworthy attacks, and its all wrapped up in a goofy story where universes collide. Unfortunately, the combat never becomes totally engaging, and the sloppy presentation drags down the other elements that had potential.The combat is Jump Forces strongest element. It is a fighting game, but not in the traditional sense. You dont need to learn every fighters best combos and counters; every character plays similarly, and pulling off their big special attacks is more about keeping an eye on the meters that build up as you take and receive damage. I like how combat is more about finding the best windows to execute your big attacks, and I enjoyed experimenting with finding the best three-character combos to take into the fray, which highlights the fun mashup nature of the game. Playing as Midoriya from My Hero Academia and hitting Goku from Dragon Ball as he charges up a Kamehameha with a Detroit Smash is an exciting thing  which is admittedly difficult to explain to non-fans.When you find the rhythm of combat, the experience becomes a spectator sport, for better or worse. The big, flashy combat animations are impressive, but they are also time-consuming and emphasize the back-and-forth nature of each fight in a bland way. It boils down to: You do your big attack, and I will wait until the animation completes. Then I do mine, and you do yours again until someones health reaches zero. Even with the myriad special attacks you can see by choosing different characters, it all becomes repetitive.The story conceit for why everyone gets together is silly  maybe even dumb  but thats fine. Its an excuse to get characters like Goku and Luffy in a room together to talk about how hungry they are, or to see Trunks and Kenshiro connecting because they are both from apocalyptic settings. But those character moments have no emotion to them. Nearly every cutscene amounts to an assortment of characters standing still and, at most, turning their heads towards one another to speak. On the rare occasion that a cutscene has movement, it is the least amount of movement possible. At one point, when a character was meant to leave the frame, they just slid out of view without taking an actual step. These low standards for presentation make every potentially interesting moment feel cheap and boring.Getting to those story moments is also needlessly obtuse. When there arent story missions available at the mission counter, I just had to walk around the large hub area until I found the next character who had an exclamation point over their head. The hub area is boring, and if youre playing online, it is overloaded with online players crowding the mission areas and clipping through one another, sometimes even making it difficult to talk to the NPC to accept a mission. It makes it feel like youre trying to order a drink at a busy bar instead of rushing to save the world from devastation. To make all of it worse, the loading is insufferable. The load times leading into a cutscene or fight can take 30-45 seconds  sometimes longer than the thing youre waiting to see. The loading also makes the already-obnoxious elements that much worse. Even accessing upgrade menus or stores requires a load. The store to buy fun, referential clothing items and accessories for your customizable character is especially long, and it doesnt let you preview the clothing you want to buy on your character. One of the biggest incentives for continued play in Jump Force is the opportunity to dress up your avatar in Shonen Jump paraphernalia, so its disappointing that the process is so difficult.For all the harm the middling presentation does to Jump Force, the fighting does have satisfying explosive moments and the online versus mode does work well. There is depth to uncover in the combat, but it never truly sang to me or made me excited to tackle the next fight. Mostly I was just happy to not have to repeat a fight when I won, even if I was performing iconic attacks from some of my favorite anime.", "date": "Feb 15, 2019", "grade": "6"}