{"name": "Crackdown 3", "ref": "https://www.gameinformer.com/review/crackdown-3/with-great-powers-come-great-predictability", "text": "Crackdown was a surprise hit back in 2007, giving Xbox 360 players who may have only been in it for the Halo 3 demo a chance to be a superhero. Dismantling Pacific Citys criminal network  or even puttering around town  was a blast, with an arsenal that included high-flying acrobatics, super strength, and a kit of exotic weapons that let you turn traffic jams into smoldering lines of debris. A disappointing sequel followed, which added little and ultimately failed to innovate or capture the spark of the original. Now, a dozen years later, the series is back in an all-new entry that, well, fails to innovate or capture the spark of the original. Its not bad, but Crackdown 3 is a bland and uninspired time capsule of a game.The unrelenting drabness is especially frustrating because maneuvering your agent around New Providences neon-lined streets is an absolute joy. The character is quick and responsive, and after collecting several hundred agility orbs, you can move with surgical precision. In the rare times that I found myself flailing in midair, I could lean into a variety of thrusts and additional leaps to get back on course. I cant overstate how great it feels. The problem is that once you get to wherever youre going  whether its the top of a massive tower or a crime lords inner sanctum  the action is a predictable last-gen letdown.Twelve years ago, leaping onto the scene with a rocket launcher and sending bad guys ragdolling into the sky was still a novelty. Games have evolved since then, and simply rehashing the same action all these years later isnt satisfying. The underlying systems in Crackdown 3 arent deep or flexible enough to generate sandbox moments that you want to tell your friends about, either. Part of the reason why the first game was so successful was that it was so surprising. This entry is like hearing the same joke again; when you can anticipate the punchline, its boring.New Providence is a bland network of themed zones and an abundance of ramps connected by maze-like freeway systems. Its run by a sinister organization called TerraNova, which you take out piece by piece. You can try to head straight for the final boss if you want, but good luck. Shes heavily defended, so youre better served whittling away her defenses by going after her heads of security, science, and technology. First, you have to bait them out by blowing up their stuff. Sometimes that stuff is shrouded behind force fields, which you turn off by unplugging refrigerator sized-power cores, but thats really about it. These individual tasks are technically different, but ultimately it comes down to destroying nodes or killing officers. Once you get ahold of a rocket launcher or other explosive weapon its trivially easy, and the only incentive to try new tactics is because youre bored of using the same successful strategies.Multiplayer is another throwback experience, reminiscent of the era where every shooter had a competitive mode crammed in. When it was first unveiled, multiplayer seemed to be trying something new: Up to 10 players battle in destructible worlds, showing off the kind of mayhem thats only possible with current-gen tech. That was the pitch, but the reality is far more mundane. The aggressive lock-on targeting that makes the campaign so easy doesnt do multiplayer any favors, and most fights immediately devolve into two Agents jumping around in a circle, facing each other and trying to unload their weapons faster. Falling debris doesnt cause any damage, so when the building youre on starts to crumble (or when one crumbles on your head), at the worst youre temporarily inconvenienced. Without any kind of party support, you cant even goof off in the mode with your buddies. It seems like a cheap afterthought, from the paucity of maps and modes to the way youre kicked out to the menu when a match concludes.Destruction was clearly on the developers mind, which makes it frustrating that its isolated to the lame competitive multiplayer. No matter how much I pummeled the city with rockets and missiles, I barely left a scuffmark. It feels like playing in a sandbox made of concrete. Blowing up cars and lawn furniture is good for a laugh or two, especially with a co-op friend, but that excitement is fleeting. Driving remains an afterthought; your character is so fleet of foot and collecting orbs is so vital that hoofing it is just a better option than wasting time behind the wheel of the poorly controlling rides.Sumo and Elbow Rockets insistence on treating a game from 2007 like a sacred text is strange. The original Crackdown was fresh and exhilarating, and bounding across the city as a superhuman agent was a thrilling sensation. Since then, a lot has happened in the genre. Developers have found ways to incorporate destruction into the action as they weave interesting choices and competent world-building into their narratives. Crackdown 3 aims far lower, and manages to hit that disappointing target.", "date": "Feb 15, 2019", "grade": "6"}