{"name": "Apex Legends", "ref": "https://www.gameinformer.com/review/apex-legends/embracing-the-new-frontier", "text": "Leaving the past behind can be tricky. With Titanfall, the team at Respawn Entertainment built its legacy on the concept of titans, massive robots that beat the gears out of one another on a raging battlefield. Titanfall 2 also endeared itself to a huge number of players because of its single-player campaign, which devotees adored just as much as genre staples Half-life, Halo, and Modern Warfare. With the newly released (and free-to-play) Apex Legends, the developer is throwing most of its legacy to the wayside to put its own spin on gamings biggest trend.Though Apex Legends is set in Titanfalls universe, it has no titans or single-player modes. Instead, its a fusion of battle royale and hero-driven shooters where 20 squads of three battle for glory, using their brains, brawn, and super-charged abilities to carve a path to victory. This design probably sounds like a recipe for chaotic disaster given how many elements it juggles. However, Respawns gambit has resulted in a fresh take on battle royale thanks to elegant features that make the experience accessible to genre newcomers and consistently entertaining.On the surface, Apex Legends is no different than the squad modes in other battle royales. Your squad drops onto the map and, upon landing, you move quickly to gather up supplies and duke it out with other squads as a massive circle of death herds everyone to a single spot on the map. A lot of the time you are hiding in houses or military bases, waiting to engage in tense firefights. However, the powers the game gives its players makes these quiet moments and planning periods engaging.Apex Legends has eight likeable characters to select (you have to unlock two of them with in-game currency, but it doesnt take long) and each one is essentially a class. The sassy Lifeline, for example, is a medic who can summon a drone to heal nearby players and even drop massive caches of supplies from time to time. Another character, the optimistic robot Pathfinder, can build ziplines anywhere on the map to allow squadmates to travel quickly. These distinct abilities make planning before the drop more important, with skilled players taking the time to compose their squad. Conjuring up fields of smoke as Bangalore to help squads escape tricky situations is useful, but is the spot shes taking worth giving up a squad medic for? You have to play your cards right, especially since you cant have duplicate characters on a single squad. The choices you make on the character select screen have just as much impact as the twitch-based ones you make in the middle of a gunfight, which is great because it adds a new layer of tactics to battle royale that have been largely absent.Combat in Apex Legends is satisfying. Yes, parkour and titans are gone, but I dont miss them. Movement is fantastic, from running to sliding to cover, and all the guns feel powerful. The addition of powers can also ratchet the action in an already-intense battle to ridiculous heights. One time my squad and I were having a shootout with another team camped out in a hovel near us. That team got the upper hand and was beginning to approach our building to finish us off when our Gibraltar, a defense-based character, dropped a shield over all of us and threw out a grenade that called an artillery strike down on our foes, killing them all and saving the day. Apex Legends produces this sort of memorable scenario more frequently than any other battle royale, because the characters powers embolden players to engage in combat rather than carefully take potshots from shacks.In addition to the uniqueness of the character-driven playstyle, the game boasts a number of elegant features that make going back to other battle royales difficult. Among them is the handy ping system. Playing with random squads in battle royale has always been tricky, especially if youre not fond of talking to strangers over the microphone. However, Legends presents an effective solution that lets players ping objects, enemies, and areas with a marker other teammates can see. That sounds like a simple thing, but the ping is diverse when it comes to what youre marking. You can tag enemies, which lets your squadmates see them for a few seconds. When you ping a weapon on the ground, your team sees exactly what kind of weapon it is. They can also ping that weapon back to claim dibs. Whenever youre given an item from a teammate, the game also flashes a quick thank you prompt if you want to pay them a compliment. This system is truly impressive, making non-verbal communication not only viable, but breezy and effective. The jumpmaster system is also an effective way of streamlining one of battle royales more frustrating early stages, because it gives a single player control over where the squad lands on the map  but also gives the other players the ability to break away.Apex Legends foundation is a strong one, filled with tons of potential thanks to its satisfying combat and savvy implantation of team-based features. However, it also has a few cracks that need filling. The map is an aesthetic bummer. Functionally, its great because it has hiding spots and rolling hills that prevent snipers from dominating the game. But the entire battlefield is a mix of apartments, military bases, and the occasional swamp or shantytown. The place is just not great to look at. Players who enjoy trying their skills and luck in a massive free-for-all might find themselves disappointed at the lack of a solo mode. As someone who played solo battle royale almost exclusively before this game, I enjoy how Apex Legends team-based features encourage everyone to work together, and even make it possible to play effectively with random users.Apex Legends status as a free-to-play live service might give players pause. My experience with the progression system has been absolutely positive. You dont have to spend a dime on anything if you dont want to. Everything, outside of two unlockable characters is cosmetics-driven, with a lot of skins to earn for players, weapons, and the banner cards that introduce your character at the start of each map. You earn lootboxes every time you level up, gaining experience from a variety of factors (including time spent alive in a match, kills, damage dealt). Every lootbox you get that doesnt contain a legendary means that the next one is more likely to, tilting the odds inthe players favor for the good stuffthe more they play.Apex Legends is not Titanfall, but that doesnt mean its not a special game packed with potential for greatness. Ive put a lot of hours into Respawns latest, and havent had the desire to stop yet. The combination of character-driven powers, streamlined team features, and fantastic gunplay have elevated this unexpected spin-off into my go-to battle royale, and I dont see that changing anytime soon.", "date": "Feb 08, 2019", "grade": "9.25"}