{"name": "Resident Evil 2", "ref": "https://www.gameinformer.com/review/resident-evil-2/the-greater-of-two-evils", "text": "For more than a decade, Resident Evil has felt like a franchise struggling to find its identity. The seminal Resident Evil 4 put a greater focus on action, but subsequent entries lost their luster. Resident Evil 7 was a major course correction but still felt like a radical reinvention that was finding its footing. Fortunately, Capcom might have finally found the magic once again. This brilliant homage to Resident Evil 2 not only revitalizes many of the survival horror elements that put Resident Evil on the map, it paves a brilliant path for the future of the franchise.In its era, Resident Evil 2 was the pinnacle of survival horror. While the original Resident Evil established a formula, its sequel raised the stakes in nearly every way with tense exploration and nail-biting action. In 1998, Resident Evil 2s action was as intense as its atmosphere was horrifying, so it became a benchmark for PS One horror. Unfortunately, Capcoms classic has aged about as poorly as a zombie-eaten corpse.Capcoms remake gives Racoon City a much-needed facelift, but a new third-person perspective does even more to update Resident Evils action. This remake returns to the series slower-paced roots. Thankfully, slowing down the shootouts doesnt diminish Resident Evils intensity. On the contrary, Resident Evils action feels better than it has in years, and its smooth shooter controls are incredibly intuitive. Zombies shamble forward like herky-jerky wind-up toys. These animations are unnerving, but they also create an exciting metagame in which you must time your shots perfectly to hit these brain eaters in the brainpan. If you miss your shot, they keep stumbling forward, meaning that even two flanking zombies can pose a challenge if youre off your A-game.Resident Evil 2s new visuals also create a darker, more haunting vibe. For those who think Resident Evil has lost its teeth, Resident Evil 2 might be the most intense game in the series. The original Resident Evil 2s bold colors look cartoonish today, but the remakes atmosphere is foreboding. Zombie heads pop in a sickening shower of brain bits. Grotesque body horrors skitter across the walls and ceilings. The stations halls echo with steady footfalls. I normally have an incredibly steady hand, but Resident Evil 2 had me jumping at shadows, and I couldnt escape the feeling of being stalked.Resident Evil 2 is also much more than a remake. In a lot of important ways, this feels like a brand-new experience. Fans will recognize locations within Racoon Citys police department and its sprawling sewer system, but Capcom cleverly reworked the entire layout so they feel fresh. Many of the environmental puzzles are more realistic, and moments like rewiring an electrical grid or looking for environmental clues to a combination lock offer a refreshing break from the action.Another big change from the original game is the removal of the zapping system. In the PlayStation original, players actions with one character could affect events in a second playthrough with the other character. While the zapping system is gone, this modern update has a mode called 2nd Run, which allows you to play through the campaign a second time with the other character. These two campaigns dont talk to each other as in the PlayStation game, but 2nd Run challenges you to take a different path through the station and gives you a few new tools to use in the process, such as a rapid-fire revolver that burns through high-grade ammo. Leon and Claires stories are also very different, so this feature adds extra incentive to play through the game a second time. Fortunately, both playthroughs felt significantly different, and I was excited to see what happened to both protagonists.Over the years, Capcom has experimented with several different approaches to Resident Evil, but this is one approach I hope gets revisited. Resident Evil 2 not only looks great, it plays well, and it forces you into a series of dark encounters that are a total rush. Resident Evil is finally running on all cylinders.", "date": "Jan 22, 2019", "grade": "9.5"}