{"name": "Life Is Strange 2: Episode 2  Rules", "ref": "https://www.gameinformer.com/review/life-is-strange-2-episode-2-rules/an-unnecessary-pitstop", "text": "Can you imagine harnessing a power you barely understand and can't always control? That, despite your efforts, leaves destruction in your wake? This is the reality of the Diaz brothers, Sean and Daniel, who fled from home after a deathly shooting with a police officer that was complicated by a magical force.While the first episode focused on secrets and trust between the brothers, this chapter's themes are more about control and freedom. Sean and Daniel continue to be engaging, evolving characters with dire circumstances, but Rules' lackluster supporting cast and unexciting scenarios bring disappointing consequences. With these flaws, episode two is a needless pitstop to an otherwise promising journey.The episode starts off strong, with Sean and Daniel becoming accustomed to survival in an abandoned cabin hidden in Oregon's wintry woods, where you teach Daniel to control his telekinesis.This first section is littered with small choices, with some that add thematic importance and others that lay the groundwork for how Daniel uses his power. For example, I enjoyed how cooking dinner involved choosing one of many ravioli cans from the kitchen shelf, appropriately reflectingthe brothers' lack of choice. As for interactions with Daniel, they can significantly impact the future. If you react sternly after he uses his power for a prank or to cheat during a game of dice, he becomes less likely to use it carelessly. Encouraging him to embrace it, on the other hand, will make him prone to using telekinesis freely, bringing its own slew of consequences. These moments add depth to your choices and consequences, letting you choose what kind of a role model you are to your brother, and whether rules should be followed to the letter for safety's sake.The themes of control and freedom become particularly evident as the boys arrive at their grandparents' home, but many moments aren't engrossing. Under their grandparents' roof, Sean and Daniel have more rules to follow, such as finishing chores and keeping a low profile when outdoors. While this is a contrast to their life in the woods, the grandparents themselves have little to offer in terms of personality, keeping me from being immersed. Although the grandparents are uninteresting, the return of Chris from The Awesome Adventures of Captain Spirit adds some value to the narrative.The continuation of Chris' story is this episode's highlight, especially for those who played Dontnod's free episode since your choices from it are taken into account. Daniel and Chris hit it off well but Daniel finds himself in a morally gray situation regarding their friendship, making for an intriguing subplot. You can suggest that Daniel acts in certain ways, but depending on your trust and past choices, he may not always heed your advice. This complex layer to decision-making is seen in other instances, too, such as Chris or his father opening up about their struggles if you manage to earn their trust. Unfortunately, gaining Chris' trust is dependent on succeeding at a puzzle that can only be solved by luck if you haven't played The Awesome Adventures of Captain Spirit. This barrier feels unfair as it favors one audience over another.Rules is a solid episode when it comes to building the relationship of the Diaz brothers, but the town of Beaver Creek doesn't bring enough interesting occurrences. Buying a Christmas tree with Chris and his father brings some tension as you worry about being recognized, but without captivating choices, it's a largely unfocused and forgettable scene. One memorable part is the introduction of Cassidy, a young woman playing guitar whose sarcastic humor and free spirit captivates Daniel, but it's a brief moment in an otherwise boring section.While this episode brings interesting themes of its own, I was disappointed at how racial tensions and politics weren't built upon further, and that many consequences didn't tie over in meaningful ways from the previous episode. Instead, Rules feels like a turn in the wrong direction, with choices that never quite hit their mark. Hopefully the Diaz brothers carve a new and more interesting path as their journey continues.", "date": "Jan 22, 2019", "grade": "7"}