{"name": "Ashen", "ref": "https://www.gameinformer.com/review/ashen/ashen-review-turning-strangers-into-friends", "text": "Ashen has a distinct look and its landscapes are imaginative, but no level of creativity can hide the fact that it is a shameless Dark Souls clone. New Zealand-based developer A44 fully embraces this inspiration to deliver almost identical combat, exploration, and a risk-based currency of souls. While feeling overly similar to From Softwares body of work, Ashen pumps out excitement and fun, and manages to carve out a hint of something new with how it handles cooperative play.I died five times in a lengthy dungeon and began thinking I would never get through it. On my next life, I was joined by a player who complemented my style of play. We marched through this challenging gauntlet and made short work of its boss; I lucked out in finding a partner that could help me. This type of passive cooperative play is where Ashen establishes a somewhat unique and powerful pulse. If another player is at the same point in the story, you may be joined up together. As I illustrated, this can be a boon. Having someone draw the attention of enemies away from you completely changes the difficulty pendulum from an enemys advantage to yours.The cooperative play is designed similarly to Journeys, in that you cant communicate with the other player or try to become friends with them. They are with you for your current objective, and will vanish as soon as die or attempt fast travel. While there were players I wish I could have played the entire game with, the feeling of losing a helping hand is a part of what makes this experience tick. Its a crushing loss, but at the same time, that person likely helped you reach a new milestone. You created that one awesome memory with them. Sure, there are players I played with that, well, sucked, and ended up wasting my time, but thats all part of the luck of the draw. If another player isnt around, youll be paired with an A.I.-driven teammate that can be reliable, but won't go out of its way to truly up your chances.If you dont trust random players or the computer, 4AA implemented an oddly complicated system that allows friends to journey together. I know this sounds like the preferred way to play, but it ends up being a pain given how many hoops you have to jump through to connect with a buddy. You are forced to change a couple of options, enter in a code that you must share with a friend, and stand in the same spot in the world. You then need to press up on the directional pad to summon your friend. In my play sessions, this technique sometimes would work without a hitch; other times we had to redo everything a few times before my friend would show up. We also ran into attempts where he wouldn't show up at all. If you fast travel or die, you must repeat all of the steps. I had great fun playing with friends, but every session ended with us questioning why it was designed this way. We found we were better off playing with randoms for the sake of time than trying to enter each others worlds.No matter who you are paired with, you enter the world of Ashen at a point of unrest. For thousands of years these lands have been blanketed in darkness. The awakening of the Ashen god has brought a glimmer of light and the hope of peace. You are tasked to help the light expand, and must protect it from forces that want the world to remain blanketed in darkness. Yes, this story boils down to the overdone light-versus-dark motif, but has a nice mythological undercurrent to it, and introduces several interesting characters along the way. They end up having decent stories to tell. As you complete missions for each character, they offer you a wider assortment of items and remedies, and you watch their home grow. It feels good to help them out, even if most of their missions are of the fetch-quest variety.The journey embraces exploration and venturing off the beaten path to uncover secrets  even if it means risking all to leap across bottomless pits. The jumping mechanics are solid, and the environmental puzzles are designed nicely  offering a clear path to the loot once you discover it. The journey you are on is challenging, but fair. It pushes you to complete all the side content to stand a better chance as the difficulty escalates.While players have a variety of weapon, armor, and talisman types to choose from, combat is sadly the most derivative part of the experience. Alternating between light and heavy attacks, dodge-rolling, and keeping an eye on your stamina meter at all times are just some of the ways it feels familiar. You even heal up in the same way.Your journey will bring you to the chambers of five bosses, each is clever in design and can down you in seconds. None of the techniques you use to fell them rise above the standard hack-and-slash mix. The combat is functionally sound and reliable, but doesnt stand out in any way.Ashen is at its best when you and a stranger are standing victorious over the corpse of a giant creature. You want to say thank you, or exchange a high five, but the only thing you can do is spin around in a circle or jump frantically to simulate a sense of glee. Even with so much of the experience feeling similar to something else youve played, Ashen delivers a great sense of wonder in its world, and ends up being a fun journey to undertake.", "date": "Dec 15, 2018", "grade": "8"}