{"name": "SteamWorld Heist", "ref": "https://www.gameinformer.com/games/steamworld_heist/b/3ds/archive/2015/12/21/steamworld-heist-game-informer-review.aspx", "text": "Two years ago, Image & Form released SteamWorld Dig, a platforming mining simulation with light Metroid elements. The game was fun, but many bypassed this downloadable 3DS title altogether. Thankfully, Image & Form has figured out how to expand on its SteamWorld universe with another SteamWorld project that can stand on its own completely. This time around, the team was clearly inspired by turn-based strategy games like XCOM. However, SteamWorld Heists unique twist is that all of the action takes place from a 2D side-scrolling view. Surprisingly, this system works fairly well. The game follows a space-faring smuggler named Piper Faraday and her crew of steam-powered robots as they journey through space, board enemy pirate ships, and make off with armfuls of mechanical loot. Missions play out in a series of turn-based shootouts where you manage your crews specialized set of skills to disassemble rival robotic crews. During your characters turns, you must fine-tune the trajectory of their projectiles so they hit the enemy on the other side of the room and not the wall behind them. SteamWorld Heists strategy mechanics are easy enough to grasp, and they are initially fun, but I was worried about Image & Forms ability to expand on this simple system over the long term. Thankfully, your characters level up after combat and slowly unlock a series of new skills that turn them into a fiercer fighting team. Some abilities simply give your heroes more heath or a stronger melee punch, but other skills  such as the ability to move twice before shooting or to create an aura that buffs your teammates  add some much-needed depth to each encounter. SteamWorld Heists procedurally generated levels also add some extra wrinkles to the action. Some missions had me frantically clearing out an enemy ship before a countdown timer hit zero and the engine detonated. In another mission, my crew started hunkered down in the center of a ship while waves of enemies beared down on us from all sides. Another memorable mission had me clearing out an entire space station full of alien robots with only a single character. This mission variety, coupled with the unpredictable level layouts, gave me plenty of reasons to go back to older missions and farm loot and experience. Most of this loot comes in the form of new weapons, and each character has their own weapon specialization. Sniper pistols have attached laser sights, which make it easy to perform billiards-like trick shots off walls, however some sighted weapons wont let you move and shoot at the same time. Meanwhile, heavy weapons, like grenade launchers, can turn groups of enemies into junk in a single explosion, but stray grenades can also bounce erratically and cause friendly fire. Guns arent the only spoils of war, either, and I enjoyed how the ample array of secondary tools, which increased my squaddies sprint distance, allowed for much-needed repairs or improved their critical hit damage.Unfortunately, all of this loot feeds into the games biggest flaw. At the beginning, your ships cargo hold is rather small, which limits the amount of gear you can carry between missions. You can buy more space from vendors scattered across the universe, but you always have a finite amount of carrying capacity to work with, so you generally have to sell some gear each time a mission ends. This limited cargo system didnt seem to serve a purpose other than to diminish my enthusiasm for raiding pirate ships, and often prevented me from experimenting with new weapons or tools because I didnt have the room for them. In spite of SteamWorld Heists limited inventory system, I recommend making space on your 3DS for this charming title. Its unique 2D strategy isnt as deep as something like XCOM, but I never grew tired of ricocheting a pistol shot off a wall and into the red eyes of a villainous space thug. I cant wait to see what SteamWorld project Image & Form surprises us with next.", "date": "Dec 21, 2015", "grade": "8.5"}