{"name": "The Jackbox Party Pack 5", "ref": "https://www.gameinformer.com/review/the-jackbox-party-pack-5/four-out-of-five-aint-bad", "text": "Jackbox Games may have accidentally created a fall tradition. Around pumpkin-spice season, the minds behind You Dont Know Jack release a new bundle of party games. Most of those individual games are great. A few kind of stink. But one constant remains: If you want to have a great time with friends, firing up one of the Jackbox Party Packs is an easy way to do so. Jackbox Party Pack 5 keeps the fun rolling, with a mix of five eclectic group-oriented games. And only one of them kind of stinks!The marquee game is You Dont Know Jack: Full Stream, a new installment in that well-known series. Its basically the same trivia contest as before, but with new questions and a fun wrapper that pokes fun of streaming video services. As players answer questions on their handheld devices, phony shows from Binjpipe like Too Much Dust and Oh Samantha pop up in a list of recommendations. The tone is as snarky as ever, and new ways to sabotage your opponents (by obscuring their text, requiring a password input, and more) keep the gameplay fresh.My favorite game has to be Mad Verse City, which has you writing battle raps for giant robots. Its a silly conceit, even for a Jackbox game, and I suspect it was largely driven by how fun it can be to hear text to speech saying weird stuff. Whatever its origins, I loved the combination of coming up with a word Mad-Libs style, seeing it fit into a stanza, and then completing the verse. As with most of these games, the content is as filthy as you want it to be. If youre playing with old people or other boring folks, your boasts dont have to be as scatological to be entertaining. When youre among friends, all bets are off  resulting in some of the best tears-down-your-face laughs Ive had in a while.Patently Stupid is unusual, since it includes a performance element. Players generate problems by filling in a blank (I cant sleep because of _____, for example), and those problems are distributed to the group. From there, each player takes their new problem, comes up with a new product that solves it, and then adds a name and tagline. Afterward, everyone takes turns presenting their product, distributing tokens to the best ones. The presentations add a lot to the experience, and the simple PowerPoint-like slides allow for comedic moments, such as timing exactly when your killer tagline enters the frame.Split the Room is the most thoughtful game in the pack, even though its themed with a cartoon cat doing his best Rod Serling impersonation. Here, the goal is to create scenarios that best divide the group. While you can certainly go for cheap laughs, players who devise the trickiest Would you rather conundrums are likely to come out on top. Like most of the other games in the pack, this is a great fit for streaming; up to 10,000 viewers can enter your room code and participate by voting themselves, making for an even bigger room to split.I have to give Jackbox credit for trying something new with Zeeple Dome, but its co-op take on an Angry Birds experience is the weak spot in the collection. The pull-back controls work well, but theres nothing particularly engaging about the action. If youre looking for a way to clear the house party but dont want to flick the lights on and off repeatedly, Zeeple Dome will get people yawning and looking for their coats in no time.Even with that clunker, Jackbox Party Pack 5 is another great bundle. Solo partiers wont find much to do here (playing You Dont Know Jack against A.I. is a heartbreaking thought experiment), but scrounge up a group and youre good to go.", "date": "Oct 16, 2018", "grade": "8"}