{"name": "Lego DC Super-Villains", "ref": "https://www.gameinformer.com/review/lego-dc-super-villains/its-quite-good-to-be-bad", "text": "Momentum is a powerful force  just ask anyone whos been on the receiving end of one of Supermans flying kicks. On a more grounded level, the impulse to continue with whats worked in the past can make a creative endeavor feel stale, whether were talking about superhero movies, comic books, or video games. Lego DC Super-Villains isnt reimagining the core of the Lego games, but TT Games has clearly learned from recent missteps. The result is one of the best (and baddest) games that the studio has released.The name should clue you in to its setup; forget about Batman and his super friends, this ones all about the villains. In true Lego fashion, the roster includes big names like Joker and Lex Luthor, and a dizzying array of fun second-tier heels like Mirror Master and Granny Goodness. The original story is a hoot. The Justice League suddenly disappears, replaced with a group of shady individuals from Earth 3 calling themselves the Justice Syndicate. These also-rans seem like close-enough versions of their contemporaries, with Ultraman filling in Supermans boots and Owlman donning Batmans cowl. Ultimately, theyre up to no good, which is something that only Earths villains seem to notice. They cant let these interlopers take advantage of Earths plunder; thats their job! Its a fun setup for the familiar sight gags, snappy (and well voiced) dialogue, and humorous tone we all know from TT Games.Youre part of it all, too. In one of the boldest departures from past games, your created character is no longer relegated to free play. Instead, your creation is part of the narrative, right from the start. I enjoyed watching my minifig doppelganger gain new abilities throughout the tale, becoming one of the more powerful faces around (and an excellent utility player that helped minimize the need for swapping characters). Ive never gotten into custom characters as much as my kids have, but this time around I was fine-tuning my hero as I unlocked new visual options.DC Super-Villains backs up its charm with a host of gameplay improvements. First and foremost, its not prone to crashing or bugging out relentlessly. It also has little quality-of-life improvements sprinkled throughout. In the past, when you encounter a task that your current character cant perform, such as blowing up silver bricks as Harley-Quinn, your character will look at the camera and shrug. Ordinarily, youd then have to manually cycle through the roster to find the correct person for the job. Now, when you swap, it immediately jumps to an appropriate one  a particular time-saver in free-play mode, which offers more than a 100 different characters to pore over. Platforming is more precise than in past games, and level designs dont lean on extended jumping sections as much as they have in the past. That aspect has always been weak, and its about time that TT Games gave it some attention. Puzzles can still occasionally be a little out there, but loads of built-in hints keep younger players and their impatient parents moving if needed.When youre done with the story, you explore a huge open world divided into well-known locations like Metropolis, Gotham City, and Smallville. Youll probably spend most of your time exploring those spaces, solving one-off environmental puzzles and helping your fellow villains with silly side missions. Youre still a villain at heart, however, which means your actions can draw the attention of law enforcement if youre not careful. Its a low-key riff on Grand Theft Autos wanted levels, which answers the question: Why doesnt anyone care that Im breaking everything? Answer: They do, but it doesnt get in the way too much.I was disappointed with last years Lego Marvel Super-Heroes 2, but Lego DC Super-Villains addresses virtually everything I saw wrong with that release. If you hate Lego games, this isnt going to change your mind. For everyone else, this is a delightful return to form which hopefully serves as a reference for TT Games future projects.", "date": "Oct 16, 2018", "grade": "8.5"}