{"name": "Shadow Of The Tomb Raider", "ref": "https://www.gameinformer.com/review/shadow-of-the-tomb-raider/in-the-shadow-of-something-greater", "text": "Over five years ago, we were introduced to a revamped Lara Croft, different than the one wed known for decades. Crystal Dynamics took on the task of rebooting the character by creating an origin story that would give us deeper insight into her personality and show her at her most vulnerable. It was an exciting change of pace, as we were watching her grow frominexperienced adventurer to full-fledged tomb raider. Shadow of the Tomb Raider provides the final piece of this transformation, showing us her defining moment of becoming the wall climbing relic hunter she was meant to be. This chapter should be an exciting climax that encapsulates the series at its best, but instead, its a step back. I had my share of fun with the adrenaline-pumping set pieces, but I also felt a bit disappointed by both the overall narrative and Lara herself.The plot involves Lara accidentally setting an apocalypse in motion and later finding out her long adversary Trinitys connection to it. The interesting parts of the narrative arent so much about how it unfolds, but about how Lara handles the things that have long haunted her, whether its her unresolved feelings over losing her parents or determining what measures shell take for the greater good of the world. Bringing back Jonah, who has helped Lara since her first expedition, provides some of the best interactions in the game. Not only does his relationship with Lara add tension over her reckless tendencies, but it also shows how much Lara values this friendship, learns from it, and how far shell go to protect it.While the story and her characterization have some great moments, they also have some not-so-great ones. What bothered me most was Laras actions not matching the character were presented. One minute, shes showing a softer side by giving children some hidden treasure or trying to reunite a man falsely accused of murder with his distraught daughter, but the next shes going on killing sprees and hanging corpses. Motivation for some of her violent outbursts is provided, but I always felt like I was playing as two different Laras.Shadow of the Tomb Raider still has all the things I love about the series: tense escape sequences, secrets to uncover during exploration, and a sense of accomplishment from solving a difficult challenge tomb. However, as with the story, the gameplay has its highs and lows. As this entry takes us to places such as Mexico and Peru, you can expect a different feel from the icy regions and isolation of the last game. Here, you explore jungles, crowded cities, and much more interesting ancient structures, but soon you realize just how unexciting these locales are.The action remains over the top and intense; you do everything from fighting jaguars to trying to survive tsunamis, all the while locating crypts and tombs containing death-defying leaps. Overhang climbing adds some verticality to the experience, while the addition of rappelling and wall-running makes this element of the game more fun. The series definitely takes some pages out of the Uncharted playbook, though thats not a bad thing as these improvements add more complexity to climbing. I enjoyed the variety they introduced, especially in how to incorporate their use into challenge tombs, which are a step up from Rise of the Tomb Raiders in difficulty and variety.Exploration is still a central and exciting fixture, especially with more underwater places to search. How much you want to spend tracking everything down is up to you, and youre not punished from a lack of total completion. While some are interesting, the bulk of the side content is humdrum fetch quests and lackluster fights, though they do often reward your efforts handsomely with better weaponry or gear. What I like about the overall progression loop is that you gain experience points for going out of your way to search every nook and cranny. This helps you earn skill points, which you can then use to upgrade Laras abilities.The skill tree is split up into three areas: seeker (exploration), warrior (combat), and scavenger (crafting and stealth). To unlock these additional perks, you need to activate adjacent squares, which can sometimes mean unlocking a skill you dont really need to open up a better one. The upgrade system is shallow, and outside of a few abilities, you never feel like youre dipping your points into anything all that impactful. While I liked using points to reveal more things on the map and getting lure arrows for more battle options, the progression in Laras powers just isnt satisfying  theres not enough there. I did, however, enjoy the addition of craftable costumes, which gave me a way to build Lara more toward my playstyle by adding perks, such as more XP for stealth kills, lowering detections from animals and humans, and gaining additional resources.As for the combat, the gunplay is competent, and Laras bow and arrow is great for headshots, but the game certainly favors a stealth approach, with various places to climb or hide to get a jump on the enemy. Lara can also now use mud to help conceal her and blend into walls. Thankfully if you break stealth, you can get out of the enemys line of sight and reset. Going in guns blazing is riskier and means mowing down a lot more enemies, but I had fun crafting explosives and using my fire arrows to blow up flammable objects to take out groups. Stealth was my preference and I felt it had more entertaining and strategic options, but this system also has some rough edges. Dont expect a challenging or sophisticated stealth system like youd find in a series such as Dishonored or Metal Gear Solid. I had some laughable moments where I should have been detected and was rewarded stealth kills when an enemy clearly saw me and alerted others.The whole adventure culminates in an ending that also isnt quite up to snuff. While Lara certainly shows growth through this journey and some closure is provided, its all a bit of a letdown. I immediately thought, This is her defining moment? Her evolution into the Tomb Raider? After following this origin story for three games, I hoped for a more rewarding finale.Lara Croft often throws herself headfirst into the action without seeing the bigger picture. In a way, thats a good a parallel for Shadow of the Tomb Raider. Parts feel rushed with odd scene jumps and some of the gameplay systems feel half-baked. The game has its standout moments, but its also full of unrealized potential. Whether it was a more engaging skill system or a bigger map, I was often left wanting something a bit more  yet, I could play it for hours. As the final game in Lara Crofts origin story, it just didnt hit the high note it needed to. Still, that doesnt mean its not a crazy, high-stakes adventure worth taking.", "date": "Sep 10, 2018", "grade": "7.5"}