{"name": "Little Dragons Caf", "ref": "https://www.gameinformer.com/review/little-dragons-cafe/shut-it-down", "text": "Kid-run businesses are better in concept than in practice. When you see a lemonade stand, you might stop because its cute and you want to be supportive. If you want a top-notch drink, however, its best to keep walking. That same approach applies to Little Dragons Caf, a game about an enthusiastic tot running a restaurant. Like those lemonade stands, good intentions cant change this lukewarm sugar-water into something satisfying.The failure is especially frustrating, because Little Dragons Caf has all the right ingredients. Designer Yasuhiro Wada created the Harvest Moon series, which charmingly conveyed the quiet life of a farmer in a small community. Instead of inheriting a plot of land in Little Dragons Caf, you play as a child who takes over the family caf once your mother falls ill. You and your twin have to keep the business afloat while managing employees, refreshing the menu, and raising a dragon. Its an interesting setup with a lot of potential, but it falls flatter than a pancake.The first few days were a little overwhelming as I tried to figure out what was and wasnt a priority. Theres a small world to explore outside, but I also had to keep my cafs doors open. Customers trickled into the restaurant during lunch and dinner hours, which gave me some time between lulls to run around the world and forage for ingredients because of my paltry pantry. You have a little garden, but you dont choose what to grow. Instead, you forage for ingredients by shaking bushes, jostling rocks, and fishing. Once you find ingredients in the wild, theyre added to your garden plot, which can be harvested every few days  for things like sugar, bacon, and ketchup. Its weird stuff, even for a game that has a dragon.You also find recipe fragments while exploring, which can be assembled when you find all four in a set. Then you can play a little rhythm-based minigame (think more WarioWare than Guitar Hero) to cook your new dish. If youre satisfied with the results, you can add it to your menu, where your chef takes over the cooking duties. The idea is that if you hit all your marks and use top-quality ingredients, your customers might be more appreciative of the results. From there, your cafs reputation can grow, increasing foot traffic and attracting special customers who have miniature story arcs.At least, thats supposed to be how it works. The reality is far more tedious. The choices that you make are superficial and uninteresting. You can stick with sensible-sounding food, but youre free to make a dish with steak, eel, and ketchup, and the customer reviews arent appreciably different than if follow recipes humans would actually want to eat. Your employees help take orders, deliver food, and clean up tables if you let them, though they can slack off to the point where customers get up and leave. Handling these tasks yourself is easier and more efficient, though its frustrating to maneuver around your dumb co-workers as you try to walk in a straight line to the sink. If I could have fired them all, I would have done so immediately.The dragon seems like it would add a fun element to the game, but its also disappointingly superficial. You can use it to move rocks to aid in exploration or destroy obstacles, but aside from getting hungry and producing manure, it doesnt have much to offer in gameplay. The overall structure is rigid and dull, and the world only gives you a handful of things to do. It really does feel like doing chores. No amount of forced whimsy, from the unsightly colored-pencil-sketch designs of the characters to the quirky character skits made any of it tolerable.Every morning when I woke up, I hoped my characters mother was magically cured. Not because I missed her and wanted to make sure that she was OK, but because I wanted to throw my apron at her and sprint away from this nightmare caf, never to look back again.", "date": "Aug 22, 2018", "grade": "5"}