{"name": "Phantom Doctrine", "ref": "https://www.gameinformer.com/review/phantom-doctrine/a-slow-but-satisfying-burn", "text": "Despite the inherent focus on exotic locales, high-stakes plot twists, and stealth-driven action, spy video games are mysteriously few and far between. Phantom Doctrine tackles the underappreciated genre from a cerebral perspective, distilling its core concepts through the XCOM filter of turn-based tactical encounters and menu-driven base management. The abundance of systems takes a lot of time and experimenting to unpack, but if youve got the patience, the investment pays off.Phantom Doctrine has you uncovering and dismantling a globe-spanning shadow organization known as the Beholder Initiative, which is behind every 80s-era conspiracy theory up to and including the need for tinfoil hats. You combat Beholders plans for world domination by meticulously managing your own international spy agency, from the day-to-day facility operations in your secret base to directing agents around enemy-laden maps during field missions. Phantom Doctrine is loaded with complex and interlocking gameplay systems, none of which are explained well. Aside from a brief tutorial mission and some intermittent tool tips that pop up when you unlock new functionality, you are on your own figuring out how things work.This fuzziness made my first few hours with Phantom Doctrine frustrating; devising tactical responses to encroaching enemies  much less long-term base management strategies  is difficult when you dont understand the core systems at play. Like any good conspiracy theory, however, the puzzle pieces slowly fell into place the longer I played.The biggest revelation is that Phantom Doctrines tactical missions are all about stealth, not combat. If youve got enemies taking potshots at you (often from halfway across the map), something has gone terribly wrong. Phantom Doctrine actively discourages you from getting into full-fledged shootouts; once combat is triggered, waves of enemy soldiers (and the occasional air raid) bear down on your location until you evacuate. Basically, your first mistake lights a fuse, and you better be out before the bomb explodes. This race mechanic is highly effective, but the timing is crucial. Rushing all of your agents into the evac zone and narrowly escaping certain doom at the end of a mission is exhilarating. Triggering enemies early on in a level and having to turn tail and run, not so much.You can stealth your way through almost any mission, tiptoeing around restricted areas, disabling security cameras, and silently taking out guards as other NPCs shuffle along unaware. While the rotating list of mission objectives are largely uninspired (defuse bombs, kill every guard, etc,), the ability to snag valuable loot and documents, abduct enemy agents, and occasionally rescue an informer (who then becomes a freebie agent for your team) made me scour each location.As much as I enjoy the cat-and-mouse puzzle of figuring out how to maneuver around pesky civilians and quietly subdue overpowered enemy agents, missions get repetitive during your 40+ hour playthrough. This is due in part to one failsafe strategy: If you scout a location prior to starting a mission, a few of your agents can don disguises during the op. When paired with the actor perk (which prevents enemy agents from seeing through said disguises), you are more or less free to stroll around levels with immunity, knocking out and disposing of enemies one-by-one at your leisure.While this approach is certainly effective, it can also be tedious, and youre better off experimenting with riskier and more creative options. Abducting enemy agents and converting them to your cause (after a little harmless brainwashing) or using the in-depth breach mechanic and a handful of silencers to stealthily shoot down a roomful of enemies is supremely satisfying. My favorite missions were the ones where I voluntarily pushed the envelope of what my ragtag crew could pull off, even if the game didnt require or even encourage me to do so.Even if you do get tired of the literally endless series of missions, you can always assign agents to interrupt the enemy operation without your direct intervention, or remotely blow up an enemy cell by implanting a bomb inside a brainwashed enemy agent and releasing them into the wild. Sometimes being the good guy is relative. While I appreciated having these options at my disposal, the quest for more valuable loot and involuntary agent recruits had me taking the hands-on approach almost every time.Phantom Doctrines dedicated story missions also push you out of your comfort zone, usually by forcing you into combat situations. While I was initially frustrated by this approach, I grew to appreciate the occasional brush with open combat, even if I sometimes had to reload a save file to properly gear up for a surprise ambush. Although you spend most of the game avoiding it, Phantom Doctrines combat is no slouch, forgoing random dice rolls for a dodge system that virtually guarantees every shot does at least some damage. Phantom Doctrines overwatch ability is more important and granular than in other turn-based strategy games, requiring you to essentially paint the area or even pinpoint specific enemies that you want to lock down. Combat is still too chaotic and punishing to go in guns-blazing, but it became a welcome diversion every now and then, even if I had no say in when it occurred.Base management makes up the other half of Phantom Doctrine and offers a staggering wealth of satisfying unlocks and upgrades. You craft your own mods at the workshop (silencers are a game changer), forge new identities for exposed agents (and print your own money, which is handy), tinker with your agents DNA to raise and lower their stats, and reprogram your enemies in a variety of insidious ways. The core mechanics of moving your agents around the world map to respond to suspicious events is also surprisingly gratifying, as is solving conspiracies on the analysis board, where you manually scan redacted documents for code words and connect them with red strings like a certified crazy person.I enjoyed virtually every aspect of micromanaging my base and spreading my overworked staff as thinly as possible to keep Beholder agents at bay. Unfortunately, the underwhelming selection of voice and customization options dont bestow your agents with a lot of personality, and neither do the missions. In XCOM, your soldiers personalities are forged on the battlefield through hard-fought victories and heroic sacrifices. Most missions in Phantom Doctrine involve slipping in and out of enemy facilities undetected, which doesnt leave a lot of room for emergent storytelling and character growth.Phantom Doctrine tries to address this issue with choice-driven character prompts that pop up periodically, and they are the biggest misstep in the game. Who these prompts affect is completely random, and often carry detrimental penalties that can outright ruin an agent. Take Catfish, a former Beholder agent I converted to my cause. Catfishs near-perfect combination of perks made her my prized agent, sporting more hit points, movement range, and action points than any of her colleagues. As such, I equipped her with all of my best gear  only to have her go AWOL while being treated for depression, the result of a two-sentence story prompt I had answered an hour earlier. By the time I finished the game a few hours after her disappearance, Catfish was still missing. Thats not character building; its character erasing.Speaking of endings, Phantom Doctrines finale is a letdown as well, somberly suggesting theres more to the story than the result of your well-earned accomplishments. Normally this type of ending would feel like a cheap tease for a sequel, but in Phantom Doctrines case, it actually unlocks an extended story option that includes alternate missions. I always appreciate it when developers give players a reason to replay their game, but this approach feels more like it cuts content from the first playthrough than it adds to the second. I actually had planned on attempting a second playthrough anyway, but after devoting so much time to my first game, the abrupt ending didnt leave me eager to start again from scratch.Phantom Doctrines multiplayer also holds little appeal. While it competently serves up one-versus-one battles across a half dozen maps with preconfigured characters, the long waiting times you face while your opponent carries out their turn are unavoidable. If you play on PS4, you probably need to supply your own friend as well; no one was playing two days after launch while I was looking for a match.In some ways, Phantom Doctrine is what you make of it. The sheer depth and lack of guidance allow you to focus on the systems you enjoy while ignoring other systems completely, sometimes to your own detriment. Despite feeling burned by the ploy for an extended replay, I thoroughly enjoyed CreativeForges stealthy and methodical take on espionage.", "date": "Aug 17, 2018", "grade": "8"}