{"name": "The Walking Dead: The Final Season  Episode 1", "ref": "https://www.gameinformer.com/review/the-walking-dead-the-final-season-episode-1/a-disappointing-start-to-clementines-finale", "text": "After six years, were finally reaching the conclusion of Telltales The Walking Dead  which also means the end of our time with fan-favorite character Clementine. Video games rarely give us the opportunity to watch a character grow up over the years, but weve seen Clementine go from a nave and inexperienced little girl to a hardened and resourceful survivor. That transformation came with ups and downs that never recaptured the magic of the debut season, and the first episode of this final season is a reminder of that, with another group of survivors scavenging for food and safety amid the overflow of deadly zombies.Were back in Clementines shoes after spending last season controlling Javier and seeing the apocalypse through the lens of his family. The opener doesnt really acknowledge much about that time in Clementines life, but gets straight into the action with Clementine finally being reunited with A.J., a child shes tried to take care of since he lost his parents just after birth. Clementine is coming full circle, doing for A.J. what Lee did for her by teaching him the art of survival. While the parallels are overt (alongside shoehorned-in references to Lee), A.J. is the first character weve met who hasnt known a life before the apocalypse. This is intriguing, as most survivors fight because they know things can be better, while A.J. merely accepts his world. The story quickly taps into certain tendencies that have developed in A.J. from living this way; he doesnt like loud noises, he lacks empathy, and he enters every situation on high alert. Thats about the only new, intriguing thread that surfaces here.The premiere episode has all the staples weve come to know from the series: zombie fights, a new group of survivors, and heat-of-the-moment decisions for survival. While these threads are part of the appeal of zombie-apocalypse stories, I often felt like I was just going through the motions with predictable patterns. I could see the betrayals and dangers from a mile away. At times I felt like I was walking into a trap, like when you watch a horror movie and want to yell, Get out of there! at oblivious characters. The dialogue options dont even let you express reservations about these moments, causing a disconnect between the authored story and how players think Clementine should react.Clementine has been an interesting character, but this episode is inconsistent with her growth throughout the seasons. Zombie attacks, ally betrayals, and death are commonplace for her, so she should have her guard up. Instead, this episode ignores her years of experience in this world. Shes too trusting, and it feels dishonest to the character. So many times I thought, Clementine would know better than this. For instance, a big part of this installment is her forming an alliance with a new group of young survivors that have turned a large, secluded school into their safehouse. While she knows nothing about this group, she instantly joins up with them. I was disappointed that I had to get to know a new set of survivors so quickly; I wanted to get some quality time with just Clementine and AJ. At least the group is diverse, representing different races and sexualities alongside having their own having their own personality quirks and pasts to uncover. A laid-back, kindhearted musician provides a softer, more calming persona, while a closed-off, headstrong woman exemplifies the struggle that comes with living in this depressing landscape after a romantic partner dies.The new season is an upgrade in visuals, looking more akin to The Walking Dead comic. Telltale has also made the interactive sequences more creative, whether its killing zombies or harpooning fish. You now have the option to stun, stab, or activate traps to kill zombies, while catching fish becomes a minigame about aiming and timing throwing your harpoon just right. The relationship-building still takes center stage, with you choosing between characters and having your actions affect your favorability with them. I liked that Telltale brought back decisions that let you decide between two places to visit with different characters to bond with at each, allowing you to feel like you need to sacrifice to get the payoffs you want. Ive enjoyed Telltales The Walking Dead for its shocking reveals and difficult choices, but not much of that was present in the opener. This premiere does little to excite me for the rest of the season; the set-up feels too predictable and familiar. Im interested in seeing where Clementines story ends and if my choices really shape the type of person A.J. becomes, but this is a weak start. Hopefully, the next episodes can provide something more unique for fans. Right now, the emotional impact is missing, the decisions arent hard-hitting, and the twists are easy to see coming.", "date": "Aug 13, 2018", "grade": "7"}