{"name": "Xenoblade Chronicles X", "ref": "https://www.gameinformer.com/games/xenoblade_chronicles_x/b/wii_u/archive/2015/12/04/game-informer-review-xenoblade-chronicles-x.aspx", "text": "Getting lost in games with massive worlds and hundreds of sidequests is a joy, but experiences of this size come with an inherent challenge. They need strong hooks in the early hours to draw the player in, but they also require surprises and depth in the later hours to keep the excitement high. Xenoblade Chronicles X excels at the first step, presenting a vibrant world and an intriguing combat system. While a few story and gameplay surprises wait for the persistent player in the crucial late game, the insistence on a painfully slow grind results in too much tedium for too little payoff.The Earth has been destroyed by warring alien species, and a lone colony ship crashes on the distant planet Mira with the chance to reignite humanity. Pulled from the wreckage, your created hero or heroine joins a crew of explorers and soldiers as they pull themselves back from the brink of extinction. Early adventures feel momentous and interesting, as you get to know the scope and variety of the action and setting, whether youre discovering a forgotten valley or unearthing ancient alien wreckage.While your party expands over the many hours that follow, only a few characters ever stand in the spotlight long enough to be considered main characters. However, your strangely mute protagonist sadly isnt one of them. It feels odd in a story like this to have the player character sidelined; you feel more like an empty shell along for the ride, rather than a custom hero at the center of the action. Awkward attempts at humor stunt the storytelling potential, including an endlessly repeated joke about eating one of the alien party members that isnt funny the first time, and is far less so on the 50th.Mira is breathtaking and massive. Monolith Soft has done a remarkable job crafting a fantastic alien landscape and filling it with towering behemoths and strange flora. Exploration is a big part of the experience; climbing mountains, leaping through foliage, and swimming beneath waterfalls reveals dozens of survey points around the world. Discovery of these points expands your economic potential for mining and money acquisition, which in turn fuels the exhaustive economy of weapons, armor, and mecha parts. Unfortunately, the game often demands that you exhaustively analyze swaths of the planet before progressing to the next story mission, leading to the first of many barriers to a natural narrative flow. It doesnt matter if you want to progress the plot; you could be spending hours grinding to meet the arbitrary requirements to keep the narrative rolling. On the bright side, the helpful fast-travel system at least allows for quick traversal to data points youve already visited.As youre learning it, combat is complex and interesting, inspired in part by hotbar-based MMO design. Your special abilities do damage, buff teammates, debuff enemies, and stack effects. Timing melee and ranged attacks while actively pursuing abilities that combo together leads to far greater efficiency. A freeform class system offers several distinct combat playstyles, and you can freely explore any of the classes, switching up whenever you want. However, after dozens of hours, you inevitably settle into an optimum combat rhythm with a maxed-out class, and for the many more dozens of hours that follow, youre triggering that same queue of actions again and again. Social Engagement Xenoblade Chronicles X is a single-player epic, but it nods to a more social experience for those looking to engage with a community. You can scout NPC versions of other players heroes, and bring them into your squad for a limited time. The randomly assigned 32-player squads cant all play together, but they share messages and contribute to squad missions to bring down a certain number of enemies. The only true four-player multiplayer comes from special time attack missions, and after beating a squad mission, you can join up to tackle a tough boss out in the world. These systems offer a chance for social engagement, but theyre positioned more as a fun add-on, and mostly for players who have already confronted everything else the game has to offer.About halfway through the game, Xenoblade Chronicles X offers its biggest gameplay twist through the introduction of skells. These awesome transforming mecha dramatically expand your combat power and exploration capability, which is further expanded a few chapters later with the addition of flight capabilities. The skell designs are gorgeous, and the piloting experience is intense and empowering, but it makes the on-foot gear and abilities youve worked for obsolete (with the exception of a few missions that demand you dismount). Im also not a fan of skell replacement after its destruction. Rather than respawn beside you at a nearby checkpoint, youre forced to take a trip back to HQ to pick up your replacement, presuming you still have stacks of insurance on your machine.An enormous wealth of content beckons in Xenoblade Chronicles X, including a hefty selection of gear and monsters meant to be tackled after the story concludes. A wealth of character-focused missions flesh out the otherwise threadbare cast, and hundreds of smaller basic missions encourage you to hunt, gather, and converse. However, this content rarely grabbed my attention, and frequently wasted my time. Gathering missions often provide little to no guidance about where to find required materials. Creature hunts feel practically identical. Social missions often demand you hop back and forth and back again between two characters on opposite sides of the main city, just to kick off conversation threads. Whichever mission you tackle, the star-based difficulty designations do little to communicate whether youre ready for the task. And like with exploration, many of these missions are required in order to move forward through the main story thread.I began Xenoblade Chronicles X filled with enthusiasm for its intriguing world and gorgeous visuals. But like the hackneyed songs that play ad nauseum throughout, the gameplay doesnt have enough depth or entertainment to sustain such a prolonged experience. Players with great patience for grinding are rewarded with intriguing places to discover and creatures to fight, but for me, only a handful of the 100 hours I spent wandering Mira felt like a true adventure.", "date": "Dec 04, 2015", "grade": "7.25"}