{"name": "Earthfall", "ref": "https://www.gameinformer.com/review/earthfall/the-dullest-invasion", "text": "You cut through the maze of white picket fences, with a shotgun and only a couple of shells in hand. In the distance, you can hear them chittering. The three friends with you are growing nervous. Need some health, one of them says. Suddenly that dreaded alarm bellows and out of the bushes jumps a massive beast, capable of slaughtering you all in a few swipesonly for half of it to suddenly disappear into a wall and become stuck. Its giant hands are swinging but failing to reach you. You all shrug your shoulders, put a hundred rounds into the monster, and then move on.Earthfall, a co-op shooter in the vein of Left 4 Dead and Warhammer: Vermintide 2, is filled with moments like this where theres an amorphous sort of potential, a promise of fun or a challenging situation to discover around the corner, only for the game to stumble over its own feet even when it comes to the most basic qualities of a first-person shooter. Earthfall hedges more into the territory of clone than homage, with Left 4 Dead But With Aliens being an apt description without caveat or modification.Set in a world thats been invaded by aliens after a massive meteor strike, you play as one of four characters (with the other three characters filled by players or bots) trying to survive long enough to gather up enough people to lead a resistance against these extraterrestrial jerks. You progress through linear levels, fending off swarms of aliens to reach the end, occasionally setting up shop with auto turrets and deployable barricades to survive swarms of foes. There are two campaigns, each with five levels, and none of them are particularly memorable. The threadbare story is also backed by lore entries that you can collect by shooting enough enemies with weapons. Unless you like reading about random resistance fighters fond memories of their assault rifles or clichd lab reports on enemy foes, these arent worth the effort.Earthfalls biggest failing is that it apes the conventions and structure of fantastic co-op games without managing to engender the moments that make its influences so interesting. Earthfalls weapons run the gamut from a machete to shotguns, but the many weapons all look generic and lack a satisfying punch. Enemy designs are also stale, with the countless drones that swarm you, all looking like gray crabs. More powerful, special enemies are capable of pulling players away from your group and doing damage to them until another player intervenes, but theyre also lacking in imagination when it comes to how they look. Like Left 4 Dead, Earthfall randomly sends out these special aliens to give you an extra dose of challenge but the lack of proper optimization, coupled with glitches leads to frustration more than it does excitement.In a certain session, three, high-damage dealing brute monsters would spawn one after another in rapid succession, with no way to grab enough ammo between the encounters to fend them off. During one game, my group and I entered a small tunnel only to have one of those giant monsters spawn a few feet in front of us. You can only kill the beast by shooting it in the back so there was no way to escape or fight the monster off. We were trapped in an unwinnable situation; I closed out the session feeling cheated rather than spurred to head back in so that Earthfall could rob me of another 20 minutes of my time due to technical issues or lackluster randomization.You can play Earthfall as a single-player experience but I cant recommend it. Even with bots skill set up to the highest competency, theyre still aggressively stupid, often letting themselves be beaten to death by monsters or getting stuck in hilly environments. The whole enterprise becomes more about managing the needs of your idiot partners when youre playing with A.I. allies instead of actual players, making an experience that already feels like a chore even more of one.Earthfall just isnt fun. The game has a solid foundation but that structure doesnt hold anything thats entertaining or interesting enough to merit the effort of playing it, especially when there are already several superior games that inhabit the same subgenre.", "date": "Jul 13, 2018", "grade": "5"}