{"name": "Mario Tennis Aces", "ref": "https://www.gameinformer.com/review/mario-tennis-aces/a-successful-return-serve", "text": "Nintendo and Camelot released Mario Tennis Ultra Smash for Wii U in 2015, and it was a shallow impersonation of the other games in the franchise. It did not have a campaign or interesting modes, and the one thing that set it apart, the Mega Mushroom power-up, was lame. Mario Tennis Aces rights the ship in a big way by adding a full story mode with RPG elements and the new Zone Shot mechanic, which is satisfying to pull off and integral to play.The star of Aces is adventure mode, in which the people of Mushroom Kingdom inexplicably get obsessed with tennis, and Mario deals with a mystical racket that turns Luigi evil and Wario and Waluigi slightly more evil than usual. As you make your way to the final villain, you partake in mini-games, level up, collect new rackets, solve puzzles, and fight bosses that all revolve around tennis.Leveling up increases stats like your movement speed and power, and I enjoyed seeing them climb even if the upgrades didnt result in huge boosts. More so than standard leveling, acquiring new rackets is the main draw. Every racket you collect has a strange design, is more powerful than the previous one, and you get to take every racket into every match. If you dont counter powerful shots correctly, your racket takes damage and eventually shatters, and you can perform the opposite trick on opponents to shatter their rackets. The more rackets you have, the more you can afford to break, which lets you play longer against the stronger opponents.The bosses are a highlight, requiring Mario to aim for specific weak spots on large enemies, avoid Petey Piranhas fireballs, or dodge a giant tentacle in a fight against a giant squid. I enjoyed all the non-traditional tennis minigames, too, like taking out a certain number of Koopa Troopers by whacking them with tennis balls, or figuring out which mirror to hit in a haunted mansion. The standard tennis matches against A.I. spike in difficulty frequently. Beyond the A.I. getting increasingly better, other frustrations make matches feel unfair, like explosive mechanical Bowsers appearing only on your side of the court.The core tennis hasnt changed much compared to previous entries. Aces adds a new power meter for pulling off trick shots with the right control stick, slowing down time, and executing the new Zone Shot mechanic. When youve powered up enough, you can jump in the air to hit the ball and the camera moves to first-person to give you hyper-accurate aim. Pulling off a high-speed Zone Shot is satisfying, and enough counters are in place to prevent it from being overpowered when used against you. The Zone Shot is integrated well and I was excited to use it during every match.The smart move with the Zone Shot is to fire the ball just out of reach of your opponent, but you can also use it to break your opponents rackets to make them lose automatically. This strategy was my favorite way to win a match, and it also became my best option when the difficulty spiked during the campaign.Multiplayer options are plentiful with online play, local multiplayer, and even offline Switch-to-Switch play. The option to play four-player doubles on two Switches is welcome. I had the most fun going one-on-one, as it keeps the court clutter-free and dials down the chaos. The Zone Shot mechanic is also simple enough that quickly getting a newcomer opponent up to speed on how it works isnt too time-consuming.A separate Swing Mode lets you swing the Joy-Con like a tennis racket to play. Pantomiming a true swing drove the ball out of bounds more often than not, but I also found that simply tossing the Joy-Con up in the air when the ball was near would usually execute a successful volley. I am glad Swing Mode is an optional mode. It may allow you to relive your favorite Wii Sports tennis memories, but the inconsistency of swinging is more annoying than novel or fun.Aces delivers as a competent arcade tennis game, and the new mechanics are fun and important enough that I would be surprised to see them removed in a future Mario Tennis. The difficulty spikes in the campaign are frustrating, but not impossible to overcome. Leveling Mario even as you fail makes the losses sting less (though I would have killed for a quick retry option) and I was always eager to see what I would be doing next.", "date": "Jun 22, 2018", "grade": "8"}