{"name": "Tennis World Tour", "ref": "https://www.gameinformer.com/games/tennis_world_tour/b/playstation4/archive/2018/06/04/game-informer-tennis-world-tour-review.aspx", "text": "I wasn't a good tennis player in high school because Ididn't have the mental strength necessary to succeed. Tennis demandsconsistency in every stroke and the ability to move on from a bad point. Thatbecomes almost impossible in Tennis World Tour because the movement assistanceoften works against you, and even well-timed strokes frequently go awry. If Iwas on the court in real-life, I would have nobody to blame but myself  but inthis case it's not my fault.Tennis games have the complicated task of balancing themovement of your player with the timing of your racket swing. It has to lookharmonious as you transition from a run animation into a swing, and it has tofeel responsive as it reacts to quick volleys and changes of direction. TennisWorld Tour bucks these conventions in the worst ways, automatically moving youat times away from the ball (particularly during service returns or netapproaches) or sometimes not even responding to a ball well within reach.Amusingly enough, the reverse is often also true. Ballsrealistically out of reach are returned due to the poor collision between theball and your racket, making it look like the ball is being hit by an invisibleforce.Phantom surprises are also in store due to the game'sinability to read your shot selection and placement. Rearing back to unleash atopspin winner can inexplicably produce a weak, defensive slice. Cross-court ordown-the-line shots regularly go anywhere but where you plan. Without theability to execute a stroke strategy against your opponent, the chance for aclear-cut winner into an open court puts you on edge, filled with doubt. EvenPong had a reliability about it that this game lacks, and that was over 45years ago.One of the big draws of this title was its career mode,but its positives aren't enough to keep you on the tour. You have a wide arrayof skills to choose from, and I like that some of them only kick in at breakpoints, and that you can change your loadout between tournament matches. I alsolike choosing off-the-court activities like a workout that bestows temporarymonthly bonuses, but overall managing your time and fitness through thecalendar system isn't deep. Training exercises take you back onto the court,which is the one place you don't want to be. Thanks to a bug, you can't evenselect a different coach or agent; the game just reverts back to your originalstaff.As if the unfulfilling career mode wasn't enough, atlaunch Tennis World Tour does not have online multiplayer. Online doubles is alsocoming this summer as a free update.Youcould reductively describe tennis as a sport where you hit the ball back andforth. That would be unfair, since it strips away the strategy and physicalfeats  which is exactly what Tennis World Tour does to the sport. In real-lifetennis, when you're so frustrated that you yell and throw your racket like abrat, it's decorous for your opponent to ignore you and tighten the strings ontheir racket. At least the A.I. in this game mutely shares a sense ofembarrassment, hoping that the moment passes.", "date": "Jun 04, 2018", "grade": "4"}