{"name": "Detroit: Become Human", "ref": "https://www.gameinformer.com/games/detroit_become_human/b/playstation4/archive/2018/05/24/detroit-become-human-review-game-informer.aspx", "text": "As a society, we're constantly turning to technology to relieve our burdens, and we become increasingly dependent on it. With the creation of self-driving cars and robots to attend to our needs, we have to wonder how these advancements will shape our society going forward  for better and worse. Detroit: Become Human explores this interesting question, presenting a world where androids seem more like human than machine, but they're prisoners to our demands. The premise is engrossing, and the variety of choices is fascinating. They're both compact and far-reaching; it could be how you develop a relationship, or which questions you ask, but what you decide always an impact and it is often unpredictable. The result is an experience you can't look away from and leaves you thinking. Sometimes this narrow focus is also its downfall, as you begin to spot inconsistencies or unexplained information.Detroit shows humanity at its worst how we're prone to greed, violence, and hate. Quantic Dream paints a horrifying look at the future, showing humans using and abusing machines at every turn. You experience this firsthand as you take control of three different android protagonists, all with different things at stake and relationships to consider. Kara must protect a child named Alice from her abusive father, deciding how far she'll go to give her a better life. Connor must hunt his own kind androids with errors making them display emotion  seeing firsthand the treatment that sparks these feelings. The weakest of the three arcs is Markus', the leader of an android uprising. A look at Markus' previous life as the caretaker of an elderly man is well done, but when he takes on his leadership role, it falls flat with predictable speeches and black-and-white decisions.The writing is at its best in the little moments that develop relationships. Connor works with Hank, a police detective who hates androids, and their interactions are fun to watch. Connor's objective to complete missions at all costs annoys Hank to no end, and Hank often busts his chops, trying to get Connor to see beyond the mission. In addition, watching an android like Kara having to decide what example she sets for Alice works well. Do you teach her about this harsh world where you sometimes have to do bad things to survive, or do you always do the right thing, even if it puts you in a dire situation? How you develop your relationships plays into what happens in the overall narrative, opening different paths and scenes based on your decisions, whether they're hostile or warm. Even small things like picking up a single, innocuous-looking item, such as a gun or photo, will open up unforeseen dialogue in future chapters.Watching these bonds form is the highlight of the game, but the overall narrative has issues impossible to ignore. Its self-stated parallels to history, such as slavery and civil war, are too heavy-handed, making it come across as disingenuous. Quantic Dream beats you over the head with these comparisons instead of allowing you to make connections for yourself  whether through direct dialogue or in the world around you. I felt uncomfortable with how much it draws comparisons to the Civil Rights Movement; this fictional battle obviously doesn't have the same stakes as the real-life oppression it mirrors, and the way it is used as a crutch further cheapens the struggle. One character even has a speech stating he has a dream to be equal, straight from Martin Luther King's famous declaration. The world is strong enough on its own, and doesn't need to rely on these ham-handed connections. The core message does a good job displaying how humans often fear change and the unknown, as our violent (and sometimes catastrophic) history shows. In many ways, it's on you to change humanity's trajectory, making choices that support how androids should be treated and if we should see them as new intelligent life or simply machines to help us get by.The extremism also extends to the supporting characters, making them feel clich, with plenty of over-the-top situations and one-note agendas. Much of the cast seems to always have the worst intentions, including Alice's abusive and drug-addicted father, and another character who treat robots as his toys to experiment on. Detroit tackles complex themes and doesn't shy away from violence. Scenes of abuse and brutal circumstances are omnipresent, and they made me uncomfortable as they should. The scenes make sense in the context of the story, but they feel exploitive due to the over-the-top antics. These stories can certainly be told in video games, but the frequency they're used here is high, especially in Connor and Kara's arcs, which can go to dark places.When I played Detroit, I was captivated by it. But my disappointment grew as I hit some plot twists and realized how poorly certain information is explained  like how Markus has the power to convert machines and give them free will. You find plot holes regardless of the path you take, but especially in Kara's arc. I had to suspend my disbelief to enjoy Detroit for what it is  similar to previous Quantic Dream titles like Heavy Rain and Indigo Prophecy. Some important details can be uncovered by making different decisions, but hiding basic plot information behind dialogue choices players may never see is frustrating. I felt strung along by some mysteries, only to see them amount to little in the end. Additional playthroughs provided some of the answers I wanted, but the reveals aren't satisfying enough for how important these threads appear to be.Even so, replaying the game and certain scenes gave me an appreciation for how far-reaching and different a playthrough can be. After you complete a segment, you are shown a grid of each variation, with the paths not taken left as blank boxes. Some chapters are more linear than others, and some choices only offer minor variations but still put you in the same place. The branching paths really shine in the latter parts of the game. Choice-driven games typically struggle with giving players enough satisfying variations, but Detroit acknowledges what you've done, like how you've built your relationships, and the split-second decisions you've made, like taking a risk during a chase scene.This is a great achievement by Quantic Dream. To write a scene so many different ways and still have it work is not an easy feat, and the scope of choices and consequences in this narrative is one of its biggest strengths. It's unlike anything I've played in that regard, and it makes me excited to see what Quantic Dream can do in the future and if other developers will follow. That being said, Detroit wants you to own your decisions, and sometimes that means grave consequences. The story ends in many ways, some more satisfying than others, but it is about learning the repercussions of what you did in this intense situation and accepting it. My only big knock on the choice front is that your interactions have few shades of gray; it really boils down to whether you want to be peaceful or fight fire with fire, and whether you want to treat androids like people or machines. The plot presents complex dilemmas, but usually only gives you these simple options to deal with them; I was left wishing for more nuanced ways to handle many situations.The variance in choice is downright impressive, but the overall gameplay could use more variety. Detroit relies on quick-time events for every occasion, and sometimes this feels redundant. I can only experience so many fights, investigations, and chase scenes before they all start to bleed together. In addition, the touchpad and motion controls are unintuitive, and I hated each time they appeared, because I knew it could mean failing a sequence and having to deal with consequences for something that didn't feel like my fault. Quantic Dream explores a new element unseen in their previous choice-based games, where you can use Markus's special power to calculate movement ahead of time, seeing what success or failure would look like. I like this idea, as it lets the player determine the route and not have to face a fail condition based on arbitrary decisions like which way to jump.Detroit made me think about topics I've avoided about humanity and our future, and that's a good thing. These are hard issues to explore, and I'm glad Quantic Dream took on the challenge knowing it could result in failure. Detroit both succeeds and stumbles in that area. Its biggest assets are the relationship building and expansive branching paths. I keep coming back to explore its variations. Not only are they fascinating, but I cared about where I left these characters. The overall message about technology and our future lingers long after the credits roll, making me wonder how I'll handle my relationship with technology as it takes us to new places.", "date": "May 24, 2018", "grade": "8"}