{"name": "The Forest", "ref": "https://www.gameinformer.com/games/the_forest/b/pc/archive/2018/05/14/a-gruesome-champion.aspx", "text": "The figure in the distance has spotted my camp. I know because I can hear him chittering. I move slowly to the side, hiding myself within the bushes as the humanoid approaches the bonfire near my log cabin. I consider waiting the whole thing out but realize hell just bring a war party to my doorstep if I let him leave. I creep up behind him. He turns just in time to get an axe to the face. My camp and I are now both safe. And, moreover, I also finally have a grisly meal for dinner. The Forest is a perverse, often grotesque game, delving into themes of abuse, cannibalism, and what it means to survive in a meaningless world. Its also never boring. The game puts you in the shoes of a father whos crash-landed on a mysterious island. Your job is to survive long enough to find your son, as well as the other passengers of the plane, which is easier said than done. Not only do you have to contend with your hunger, thirst, and stamina, but bloodthirsty tribes of cannibals are roaming these woods as well. Many entries in the survival genre often feel like grinding acts of repetition to satisfy various meters. While The Forest does have those survival staples, the game avoids frustration by smartly presenting them in consistently interesting ways. For example, instead of a generic crafting menu, youre presented with a giant blanket that reveals all of your inventory items. In the center of the blanket is your crafting area, where you drag various items to combine them into something better (like a bow with a flashlight or severed human head stuffed with a bomb) making the crafting process feel more intimate. The survival meters are optimized in a way that they dont feel like an overbearing master you have to constantly please. Yes, you need to feed yourself and drink from streams, but theres more than enough resources around in the environment wherever you go to keep those things in check as long as you look around. Crafting gear, like more bags to carry sticks and berries, also makes this exponentially easier as the game goes on.Despite my initial weariness at the idea of playing yet another survival game filled with hunting resources and building structures, I soon fell in love with the core loop of The Forest. The structures you can build are predominantly wooden and thus draw from the same currency, meaning you dont have to chase 20 different kinds of rocks. This makes building your first base a quick, satisfying quest. Every structure has a useful and defined purpose. Your cabin gives you shelter but you need other structures too, like the rack, which lets you dry out the meat you harvest so it never spoils and you can carry it with you anywhere. You can also use a turtle shell to build a water collector that holds rain droplets and sticks to make rabbit traps and cages. All of the survival elements of The Forest are satisfying, especially in how well-tuned they are, but they become special when they coalesce with the horror elements. The Forest is about more than just survival, as theres a fantastic story for you to progress through. You do this by discovering various caverns littered throughout the hand-crafted island. Spelunking into them, you find narrative clues like keycards for hidden doors, the bodies of your fellow passengers, and the helpful resources theyve left behind. Every underground jaunt is terrifying as you start out with only a finicky lighter to show the way forward and help you spot cannibals, as well as other nasty surprises that lay waiting for you in the dark. Not only are the creatures and scenes that lurk the caverns below terrifying and gruesome, but the rewards are rich, too. Beyond the treasure trove of booze bottles and circuit boards (used to make molotovs and bombs), you can also find secret weapons that make cutting down enemies an easier task, both underground and on the surface. Once I was belaying down a dark cavern. I used my lighter to get a look around, and suddenly saw the decimated face of a corpse swinging gently in the space next to me, a rope around his waist. This was not an on-the-rails moment, but instead one I found through playing with the games systems. Its the sort of experience that pops up over and over again during the course of the campaign. The whole game feels like the pitch-perfect video game adaptation of The Descent that I never knew I wanted. Perhaps the highest praise I can give The Forest is just how natural the game ties together. A lot of emergent storytelling games often end up having a novelty that overstays its welcome by the end. The Forest often succeeds in instilling terror because its A.I. is legitimately unpredictable. The cannibals dont just surge at you. After a feint attack, theyll laugh and run past you, like some sick juvenile joke. Often theyll peek at you from afar and then turn back after sizing you up, returning with an entire group 10 minutes after youve already forgotten about them. For those who want co-op delights, a multiplayer mode exists. The mode more or less breaks the game, putting the odds overwhelmingly in your favor when it comes to squaring off against adversaries. But that doesnt mean its not fun, as you and your pal can get up to a number of dark-yet-wacky shenanigans as you romp around. Just dont expect to be scared nearly as much. The Forest is a triumph, both for the survival genre as well as gruesome horror. It gives players just the right amount of freedom to enjoy the challenge of this hellish nightmare", "date": "May 14, 2018", "grade": "9"}