{"name": "The Swords of Ditto", "ref": "https://www.gameinformer.com/games/the_swords_of_ditto/b/playstation4/archive/2018/05/10/the-swords-of-ditto-game-informer-review.aspx", "text": "Generation after generation, a chosen hero rises to claim a legendary sword that can seal away the ultimate evil. Some of these heroes triumph while others fall, but the cycle has been in motion for as long as anyone can remember. Elements of this premise may sound familiar to Zelda fans, but The Swords of Ditto boils this multi-generational legend into one game. This approach allows players to see the consequences of their success or failure, and work to defeat an evil sorcerer once and for all.This cute, top-down action game tasks you with taking down Mormo, a powerful apparition fighting to control the region of Ditto. You can scale Mormo's tower to face her with little preparation, but that's inadvisable. Instead, the best route is to explore the four dungeons placed throughout the procedurally generated world to collect more powerful weapons and weaken Mormo's power in the final battle by destroying magical anchors housed in the dungeons. Destroying these anchors gives Mormo fewer minions and less health in the climactic face off, but I was most excited to collect my favorite weapons to use on the hordes of creatures.While the vinyl frisbee and exploding drone are powerful and versatile, I often made a beeline for the final dungeon the moment I found the powerful laser ring that burns through enemies with its focused beam. You can also further customize your hero with stickers that grant stat buffs, resistances, and abilities. My favorite combination of stickers made enemies drop healing items more often, while protecting me from bombs and boosting the power of my sword. The stickers in the shop rotate, but I never had any problem readying my character to delve into the dungeons.Slashing through the dungeons with the legendary blade is fun and familiar, and simple puzzles break up the pacing and often deliver worthwhile rewards. I like that I can decide how much I want to prepare for the battle with Mormo, but the repetition of the dungeons grated on me after a few playthroughs; I was sick of the dimension-shifting theme by my fifth incarnation. While the world and dungeons are procedurally generated to help each play feel fresh, I dreaded the repeated themes, rooms, and bosses that appeared in the dungeons. However, thanks to the rewards, I preferred completing them to bolster my arsenal and weaken Mormo in the final battle.Each hero has one life and a set number of days to defeat the villain. If that hero succeeds, Mormo disappears for 100 years until the next hero rises. Statues are erected in that hero's honor, and the world becomes a little greener in the evil ghost's absence. However, if your hero falls, Mormo assumes control of Ditto for 100 years until the next hero is chosen. In this case, the world takes on a darker color palette, statues of the hero are torn down in favor of monuments to Mormo, and NPCs are less optimistic. I love seeing Ditto's state continually improve or worsen based on my success or failure, but after repeated victories or defeats, the changes become less noticeable.The roguelike elements help alleviate some of the repetition, but dying and losing progress on a character is demoralizing. Thankfully, your money and shards you looted from enemies carries over. You can also buy extra lives using your shards, but they're expensive and don't get passed down to the next hero. However, several secret upgrades are passed on to your next character, making for rewarding exploration. From an orb hunt that adds extra days to each timeline, to a quest that has you searching for baby penguins to upgrade your bomb capacity, these meaningful diversions proved most helpful in my multi-generational journey.Despite its repetitive nature, The Swords of Ditto delivers enjoyable combat and enticing rewards to discover. I love seeing how the world changes based on how I did as the prior hero, but much like The Swords of Ditto's name implies, the playthrough are too similar to feel like unique, standalone legends.", "date": "May 10, 2018", "grade": "7.25"}