{"name": "City of Brass", "ref": "https://www.gameinformer.com/games/city_of_brass/b/pc/archive/2018/05/07/get-rich-or-die-trying.aspx", "text": "You turn left at the storehouse, frantically running through alleyways as a group of skeletons shamble after you. With a crack of your whip, you grapple on to a hook and soar over a trapdoor. Your pursuers are not so lucky, their cries reaching your ears as they fall onto a pit of spikes. You cant help but smile as you land on the other side scot-free and prepare to proceed to the mysticals citys marketplace  right before an angry genies fireball propels you right into the trap you just evaded, making you pay the price for your hubris. Like most procedural roguelites, City of Brass is a game about learning from your self-education, pride, and death  all in that order. As a young explorer in a city filled with ghouls and gold in equal measure, youre here to grab as much treasure as you can and make it out alive. This classic adventure concept is bolstered by thoughtful environmental challenges and a unique setting. Though One Thousand and One Nights has served as an inspiration for the likes of Aladdin, Sinbad, and Prince of Persia, we dont often get to see games that take a page from that book. In that regard, City of Brass makes the most of its artistic inspirations, pitting you against greedy merchants who have turned undead as well as feisty genies and scowling sorceresses as you jump from rooftops and use your whip to manipulate this trap-filled paradise and even the odds. Much of the games charm stems from your whip, which is not only a traversal tool but useful for snatching distant gold as well as stunning foes and pushing or pulling them into traps. Pulling your foes into explosive barrels and in the line of fire of turrets is not only immensely entertaining but also practical. You do have an upgradeable scimitar, but spotty hit detection makes combat pretty frustrating, and its also unsatisfying to boot since every landed hit feels like youre slapping a tree trunk. Instead, City of Brass is at its best when it puts you in situations where you have to use your head to bypass enemies, punishing you fairly but severely when you fall victim to your own impatience and greed. If you die during any of City of Brass 12 levels, its game over. All your items and gold are gone as well as your progress, though there are caveats that make it less frustrating than its genre siblings. You get access to portals that let you jump to later areas from the get-go once you hit those checkpoints your first time through, though jumping ahead is a dicey tradeoff since youll be fighting harder foes without any of the equipment youd earn from a fresh run. Genies are also littered throughout every level. Some of them are nasty and send homing fireballs or goons after you, but the majority of them are impartial shopkeepers willing to disable traps, sell you health recovery, or even upgrade your weapons (like making your whip cause fire damage) for some of your coin. One of the genies even offers insurance, letting you keep a certain percentage of your gold for your next run. Outside of in-game stress relievers, theres also a host of difficulty modifiers, like turning off enemy respawns or making them weaker. The only cost to using these modifiers is lowering your score, so theres no progression halting or secrets you miss out on by using some or even all of them, making City of Brasss difficulty highly customizable and inviting to players of all skill levels. The only disappointing difficulty reliever is a level-based progression system that temporarily grants you an item or upgrade you can use for your next run whenever you gain a level. The boon is nice but you lose it as soon as the next run is done, making that feature feel like a waste of time. My favorite experience was discovering mysterious item after item, like a whacking stick that sent my foes flying, and experimenting with them to find out what they do and how I could use them to my advantage. This sense of discovery doesnt last, and eventually fades to grinding repetition. Whipping yet another skeleton into a spike pit or sending a fireball back into a sorceress face becomes dull. Still, it takes a while to get to that point, and I imagine those who enjoy building an intimate understanding of a games mechanics and learning to master them will find a lot to enjoy with City of Brass, especially when it comes to speedrunning. Uppercut Games first roguelite is a strong entry in the crowded rogue-lite genre thanks to its amusing, thievery-based brand of creativity. Though Ive had my fill for now, I imagine in a few weeks Ill find myself running through the haunted halls and squares of some haunted desert setting gleefully filling my pockets with every shiny piece in sight.", "date": "May 07, 2018", "grade": "7.75"}