{"name": "Mario Tennis Ultra Smash", "ref": "https://www.gameinformer.com/games/mario_tennis_ultra_smash/b/wii_u/archive/2015/11/18/mario-tennis-ultra-smash-game-informer-wii-u-review.aspx", "text": "The Mario sports titles have always offered an interesting and joyful take on what is typically a serious genre. Mario Tennis Ultra Smash offers that same fun, silly take on tennis, but it doesnt provide much outside of the well-executed core game.The standard tennis works great, with each face button corresponding to a different type of shot. The accessible controls feel excellent; you can charge shots, assign top spin, slice the ball, and more. Pulling off a powerful jump shot is particularly empowering. The straightforward tennis is a highlight, but moving beyond that is where things get disappointing.The inclusion of the Mega Mushroom is the literal big addition for Ultra Smash and the focus of its main Mega Battle mode. In Mega Battle, Mega Mushrooms randomly appear on the court. Grabbing them makes you grow and increases your power. The power-up is disappointing, since grabbing a mushroom plays a quick cutscene that consistently disrupts the flow of volleys. It also doesnt change the game dramatically, as your power increase isnt hugely noticeable. Hitting a Mega Mushroomed player with the ball causes them to shrink down to their original size, which is a nice touch, but overall I never got excited about grabbing the power-up when it appeared.Thankfully, ignoring the Mega Mushroom is easy by playing Classic Tennis mode, but you wont find other interesting distractions, which is often a highlight in Mario Tennis. Mega Ball Rally has players volleying a steadily shrinking ball, and Knockout Challenge tasks you with taking out as many opponents as you can back to back. Neither is novel or exciting, but the latter lets you bring alongside an Amiibo into doubles matches, which is somewhat interesting. Your Amiibo partner will become a better tennis player as you train them, much in the same way players train Amiibos in Super Smash Bros. The dearth of modes is Ultra Smashs most glaring disappointment. Previous Mario Tennis releases have had strange mini-games toying around with the idea of hitting a tennis ball and character-specific super-powers, but not here. You just have the four modes, plus functional-yet-predictable online play. You wont even find a career or campaign to encourage you to master your favorite player outside of a list of achievements with exciting requirements like, Play 10 standard matches in Classic Tennis mode, for new courts and characters rewards.The extracurricular activities are severely lacking, but the core tennis is good. Hitting a ball back and forth has been a fun video game pastime time since the mediums inception, and responding to your opponents volley with the appropriate attack and pulling off powerful Ultra Smashes and jumpshots is fun. I just wanted more reasons to keep playing.", "date": "Nov 18, 2015", "grade": "6.75"}