{"name": "The Station", "ref": "https://www.gameinformer.com/games/the_station/b/xboxone/archive/2018/03/02/the-station-review.aspx", "text": "The Station tells a science-fiction story weve all heard before. Earth has lost contact with a crew aboard a space station, and you are sent in to investigate what happened to them. This premise usually reveals flesh-eating aliens, rogue A.I., or astronauts suffering from space madness. However, none of your discoveries made aboard space station Espial are substantial  just cryptic audio recordings and notes that hint at a larger story that never truly unfurls.Following in the footsteps of similar narrative experiences like Gone Home and Tacoma, The Station gives the player little direction, and instead allows for freedom of discovery. The allure here is to take your time, study every inch of The Espial, and get to know the crew by the trail they left behind. Playing the role of an investigator is a satisfying experience, as The Espial feels like a real place, mixing state-of-the-art technologies with ordinary human things. The personalities of the crew emerge from their workplaces and living quarters, such as reading their personal emails, or viewing the photographs hidden in their lockers. You end up feeling more of a connection to each of them than the story you are supposed to be unearthing.While discoveries are made in a nonlinear fashion, some of The Stations best moments are tied to locked doors used to gate progress. These doors often bring puzzles, each challenging you in a different way, whether its learning a crewmembers security code or figuring out how to awaken a robot. A couple of the solutions are a bit obtuse, but most of these moments either strengthen The Espial as a believable place, or give you a taste of how advanced human technologies are in this vision of the future.Even after being stumped on a few puzzles, I completed The Station in just under two hours. The Espial isnt a sprawling place, and most rooms contain just one or two points of interest, so youre rarely left scratching your head for too long before stumbling upon an interactive item.As much as I enjoyed learning about the crew, the game teases something greater. At the outset of play, you learn The Espial is orbiting an alien world, and is using a stealth technology to stay undetected. Its here to determine if first contact should be made, but under the utmost caution, as the aliens are in the midst of civil war. As fascinating as this premise is, you dont learn much about the aliens or the conflict, outside of seeing a purple trail of blood or a crewmembers note stating these aliens cant be trusted. The research done by the crew is mostly hidden away, with the focus falling more on their ethical approach to interacting with the aliens. As interesting as the question of What would mankind do? is, The Station rarely has an answer. Perhaps thinking deeply about the dilemma is part of its charm, but it ended up being a hollow experience that didnt deliver enough resolve on its alien ambitions.", "date": "Mar 02, 2018", "grade": "6.5"}