{"name": "A Case Of Distrust", "ref": "https://www.gameinformer.com/games/a_case_of_distrust/b/pc/archive/2018/02/15/game-informer-review-a-case-of-distrust.aspx", "text": "A Case of Distrust makes players feel at home in its noir world as they try and solve an intriguing case as private detective Phyllis Malone. The visual style and well-written dialogue easily draw in players, but the point-and-click gameplay  while natural for an investigative adventure title  does not do any favors to the noir vibe the game tries to establish.Malone is following in the footsteps of her uncle, a legend on the San Francisco police force. As a woman in a man's world, Malone has to navigate the environment as an outsider, both in standing apart from people's expectations and in trying to penetrate the fog of clues and misdirection surrounding the inevitable murder. The setup adds flavor to the otherwise common trappings of the genre and time, adding a layer to Malone's personality. However, the way that her identity is relied upon to unpack the case's resolution is an inelegant fit.A Case of Distrust's strength is its world  its visual style and presentation, script, and reaction to player's dialogue choices. The noir genre has its share of blaring symbols, like the femme fatale and wise-cracking detective, but this game doesn't tread clumsily. Choosing what you want to say to other characters reveals well-written lines of dialogue that sometimes expand on Malone herself or the world, but the game is not over-written in terms of style or volume. Sometimes small details jump out while inspecting a bottle or choosing to talk to a cabby (or not). For an adventure game where you're clicking on the screen for anything that gives you a response, the fact that the dialogue doesn't overstay its welcome says a lot.That being said, this same gameplay conceit of clicking on anything and everything also stresses the game's relationship with the noir genre. The inherent trial-and-error introduces slack in otherwise possibly tense interactions, as you shuttle between menus (easily, I should add) looking for and presenting evidence. Also, in a larger sense, your total control over events as the protagonist belies the doomed inevitability and powerlessness to larger forces that is an arresting hallmark of the noir genre. ~Forget it, Jake. It's Chinatown,~ isn't a sentiment that is conveyed in the game. Contrast this with L.A. Noire, for example, which successfully executes investigative gameplay within the noir genre by letting players operate as a detective without sacrificing its noir undercurrent.The visual style of hard lines is appealing  and reminiscent of noir's classic juxtapositions of light and shadow  but I miss cinematic elements such as subtle acting, frame composition, and lighting which aren't present here.Finally, the story's ending does not land. While it's logically sound, it doesn't register with its intended gravity. I'm not sure how you'd figure out its finer points on your own; as a detective, it feels like you've been taken off the case, and are instead reading how some other detective figured it out via the case file after the fact. It also works from without rather than from within because it relies on sentiments for a character that I didn't feel.", "date": "Feb 15, 2018", "grade": "6.75"}