{"name": "Game of Thrones: Episode 6 - The Ice Dragon", "ref": "https://www.gameinformer.com/games/game_of_thrones_episode_6_-_the_ice_dragon/b/playstation4/archive/2015/11/17/game-of-thrones-episode-6-review.aspx", "text": "No matter where Jon Snow is, or what Bran Stark may be doing, Game of Thrones fans are conditioned to expect tragedy  especially in the final chapters of the books or television seasons. Creator and author George R. R. Martin can almost be heard sharpening his knives as his words unfurl. The question Martins writing begs isnt Is someone going to die? but rather When is it going to happen, and how bloody will it be?Telltale embraces Martins dagger of a pen in this season finale. Blood is spilled all across Westeros. Numerous lives are lost amid several wars. Depending on how you play your cards, your headcount at House Forrester may look much different than your friends. Choice is fully embraced in this episode, often pushing the player to pick between the lesser of two evils  and which evil is worse is often difficult to determine. This episode has no peaceful through line; Telltale wants the player to feel pain and remorse.Despite its emphasis on choice, Telltale struggles to tie different decisions together believably, a common complaint that has occurred throughout numerous episodes this season. A meeting between Mira Forrester, Margaery Tyrell, and Sera Flowers appears to conclude definitively (and in a way that supports the players difficult decisions), but its tone shifts unexpectedly at one point, making Margaery look like she has no idea what shes doing with her power. Even with occasional jumps in logic, the narrative pacing is relentless, and ends up being a whirlwind of bloodshed more than a proper conclusion. Many story threads are left dangling when the credits roll, implying Telltale will be returning for a second season. Telltales other episodic titles usually give the player some kind of closure, but Game of Thrones doesnt even toy with that idea. The ending to this story isnt anywhere in sight. With most of the characters arcs left on cliffhanger moments, we wont know exactly how big our decisions are until Telltale shows us what happens next. Since this tale is set between two seasons of HBOs show, I was expecting a more definitive ending, but the lack of resolution doesnt hurt the experience. Not every big moment is left unresolved, however. Conflicts that have been brewing since the opening moments come to a close. You are given ample opportunities to exact revenge (or screw yourself over in the process) through many of the characters stories. The stakes are huge in this episode; one slip of the tongue or poorly considered choice can lead to much different outcomes and permutations.Gared Tuttles journey beyond the Wall, the best plot line in the series, reaches a satisfying conclusion, as we finally get to see what is so special about the North Grove. The reveal gels well with the universe Martin has created, and brings a nice wrinkle of intrigue tied to the dark magic that is slowly seeping into the world. Unfortunately, Telltale doesnt fully pull the curtain back for this reveal, but does deliver enough to justify Gareds long journey across all six episodes.Other dramatic scenarios feel overly rushed and lose the emotional impact they were trying to deliver. The episode jumps from conflict to conflict with reckless abandon, and only slows to a crawl for one defining moment in Miras life. This is one of those situations that everyone who plays the game will be talking about. It just keeps getting worse and worse, and it all comes from the choices made by the player. Again, you often dont have great options in front of you, yet Telltale forces your hand.Given the rapid pacing, it wasnt until the episode ended that I stepped back and realized just how much I lost, sacrificed, or potentially gained through my actions  but those sensations are not fully conveyed in the moment.For the sake of spoilers pertaining to the previous chapter, I wont go into who the other playable character is in this episode, but the heart of that conflict unfolds here, and most of it is spent in war sequences. This characters story successfully carries the weight of Forresters turmoil through gruesome war sequences and intermittent choices that are difficult to make. These battle sequences are better choreographed than in previous episodes, and at last deliver the true sense of two gigantic armies clashing.Despite a couple of missteps in the narrative, I enjoyed Telltales addition to Game of Thrones lore. As this episode clearly illustrates, Telltale is quick to swing its sword when it when it comes to character-defining moments. I would have liked to see a little bit more relationship building in this series  such as Asher and Beskhas banter early on  but Telltales scribes did a bang-up job painting a kingdom at war. My parting thought as the credits rolled was simply, I cant wait to see what comes next.", "date": "Nov 17, 2015", "grade": "7.5"}