{"name": "Celeste", "ref": "https://www.gameinformer.com/games/celeste/b/playstation4/archive/2018/02/06/celeste-game-informer-review.aspx", "text": "Mountain climbers dont climb mountains because its easy. Difficult challenges are often intrinsically rewarding, and Celeste is that kind of experience. This adorable platformer about a troubled young woman named Madeline who pushes herself to climb a mountain is full of platforming sequences that mirror the heroines own struggles. The journey isnt always easy, but the view from the top is spectacular. Celestes early levels feature a series of precise platforming challenges in the vein of indie hits like Super Meat Boy. However, Madeline can also climb up most vertical surfaces until her stamina runs out. Instead of a traditional double jump, Madeline performs a mid-air dash, which gives her a wider range of movement once shes airborne. I never grew tired of even the basic platforming sections thanks to the tight controls and the wide variety of aerial maneuvers. Jumping across a bottomless pit and then dashing up to find purchase on the side of a narrow pillar is incredibly harrowing, and Celeste is filled to the brim with exciting moments. The basic mechanics arent complex, but each stage puts a unique spin on the action. In one area, I used the momentum of several moving platforms to launch across wide chasms. In another section, I strung together a series of shimmering diamonds that refreshed the mid-air dash to perform extended aerial stunts without touching the ground. Every time I started to grow tired of one environment, the game threw out a curveball and added some new element that made it feel fresh again. Many of the platforming sequences offer a fair challenge, as well as occasional frustration. However, the reward of overcoming these trials always overshadows the bumps along the way. Those who want to mitigate their pain can turn on several assist mode options like more air dashes and immunity to environmental damage. Players can even skip troublesome levels altogether. If you want a heartier challenge, you can collect floating strawberries in hard-to-reach places. I enjoyed collecting these berries, but my efforts ultimately felt futile since you dont get anything for collecting them apart from a relatively insignificant change to the ending. Throughout your journey, you encounter a grouchy old woman, a fellow climber, and an awkward ghost, but the story ultimately centers on Madelines struggle up the mountain while overcoming her own anxieties. I wont spoil the specifics, but the adventure is surprisingly heartfelt, and the clever dialogue and bizarre encounters are as compelling as the platforming.Developer Matt Makes Games previous release was TowerFall, the archery-themed four-player battle royale. With its single-player focus and touching narrative, Celeste might seem like an odd follow-up. However, like TowerFall, Celeste features polished and intense action that makes it easy to love and hard to put down.", "date": "Feb 06, 2018", "grade": "9"}