{"name": "Tiny Metal", "ref": "https://www.gameinformer.com/games/tiny_metal/b/pc/archive/2018/01/11/tiny-metal-game-informer-review.aspx", "text": "Tiny Metals simplified strategy and delightful tone scratch an itch that has been festering since Nintendos Advance Wars series reached a ceasefire in 2008. Battalions of adorable tanks and warplanes engage in a series of turn-based encounters that seem like the opening salvos of an epic tactical war. Unfortunately, Tiny Metals action fails to evolve past the basics; its shallow strategy offers some cheap thrills, but its lack of depth is boring for battle-hardened tacticians.Tiny Metals action starts off slow as you are introduced to your various units and the classic rock-paper-scissors gameplay that gives some classes an advantage over others. For example, tanks are strong against basic infantry while rocket launcher-wielding lancers will rip through those armored vehicles. Each units strength is tied to its health, which creates a nice balance to the flow of battle. It also means if you cant destroy an enemy in a single turn, you might, at least, be able to neuter its next attack. Fortunately, even weak units can still be useful in combat, because you can have them team up with other troops to attack a single foe. I found this especially helpful when taking down many of the heartier tanks and warplanes.Tiny Metals tactics are easy to learn, and I never felt forced to adopt a specific strategy to progress. At the same time, I never felt like my back was up against a wall. Tiny Metals campaign is a breeze, largely because the enemy A.I. has all the tactical prowess of a puppy chasing down its dinner bowl. The enemys army rolls towards your base in evenly paced waves. However, you generate resources at a steady clip, so building a larger army and overwhelming your opponent is easy. Tiny Metals lack of depth compounds this problem. Since all your units only have one basic attack, you dont make complex strategic plays  you simply match the units on your team that are strong against the units on your opponents team.Wheres The Multiplayer Mayhem?Tiny Metals simplified strategy might take on an added depth if you were playing against a real opponent. Developer Area 35 plans to add a multiplayer feature at some point in the future, but as of this writing, the studio hasnt announced a release date for the update.Despite Tiny Metal's adorable exterior, it tells a serious story about an army Lieutenant named Nathan Gries who is embroiled in a war between two fictional nations. When a famous war hero goes missing, Nathans battalion goes in search of him only to discover a larger threat headed for the borders of their nation. This boilerplate war story adds very little to the experience, and the main villains ambitions remain vague, even at the end. Area 35 expends a great deal of energy on this lackluster narrative, and each campaign mission is bookended by several minutes of characters explaining their backstory, which ultimately bogs down the flow of the action and killed some of my enthusiasm rolling off a successful mission.Tiny Metals visual style pays homage to Intelligent Systems dormant Advance Wars series, but its under-baked action isnt as cute. The battles never feel like a chore and I enjoyed basking in my easy victories, but Tiny Metal needs a few more tools in its arsenal if it wants to take on the legacy of Advance Wars.", "date": "Jan 11, 2018", "grade": "7.25"}