{"name": "Broforce", "ref": "https://www.gameinformer.com/games/broforce/b/pc/archive/2015/11/12/broforce-game-informer-review.aspx", "text": "The 2010 film The Expendables posed the question, What if some of the biggest action-film stars came together and made one over-the-top blockbuster movie? Free Lives uses a similar premise with Broforce. However, instead of bringing those same stars together, Broforce delivers representations of the characters theyve portrayed in an outrageous homage to those movies that delivers all of the big, fun moments you expect from a retro action/platformer. Over the course of a typical Broforce level, you blast through tons of enemies, inflict substantial property damage, and set off massive chain reactions before grabbing the dangling ladder of a helicopter while a face-melting guitar solo shreds into your speakers. The ridiculous tone and humor deliver laughs frequently, but that doesnt prevent Broforce from delivering a stone-faced challenge.Each character has a primary weapon, special ability, and melee attack. Each of those attacks is mapped to its own button, making them simple to use. The primary weapon is my go-to approach, but the unique special abilities add a little extra punch within the theme of the character. For example, Brommando, Broforces take on Arnold Schwarzeneggers character in Commando, shoots a flurry of rockets, while Mr. Anderbro, the games version of Neo from The Matrix, pops a red pill and slows down time, allowing him to inflict rapid damage to enemies.Broforce allows you to head into each situation with your own strategy. You can face the enemies head-on, drill through the earth below those enemies, or take one of the branching paths. The precise and simple controls enable you to pick up and feel like a competent player immediately.Even if you enter a level as Brobocop or Rambro (my personal favorite thanks to his versatile machine gun and powerful grenades), you can expect to change characters multiple times since the cast rotates each time you save one of the captured Bros. When this happens, you gain a life and the character you rescued takes your place. Unfortunately, you have no control over the character you become when saving someone, so its a gamble  especially if youre currently controlling one of your favorites. You could easily be at a disadvantage because you get stuck with an explosives specialist in a sequence that demands precision. Since you cant manually change your character during the campaign, you need to grit your teeth in these situations and hope for better luck next time.The characters die in one hit  whether thats an enemy bullet, an explosion, or falling debris. While this isnt an insurmountable problem most of the time, the later stages have so much going on that it can seem unfair given the frailty of your characters. The destructible environments add to this, as explosions can sometimes start off chain reactions where you need to dodge the resulting mess as it falls toward your location. With so much happening on-screen at any given moment, its easy to get lost in the chaos  sometimes to hilarious effect.In one level, I was avoiding a creature similar to the worms from Tremors while making my way through waves of Xenomorphs from Aliens. After many failed attempts, I finally made it to the home stretch, only to have a large rock fall from the ceiling and splatter me, sending me back to my last checkpoint  an infuriating moment that still made me chuckle amidst all of my swearing. Make no mistake; Broforce becomes punishingly difficult as the campaign progresses. Thankfully, Free Lives is generous with its checkpoint system, which is good, seeing as how you need all the help you can get in the later levels.The bosses in Broforce call back to the designs and high level of difficulty that classics of the genre like Contra and Metal Slug are known for. Massive in size and overpowered in nature, some of the battles saw me ramming my head against what felt like an insurmountable adversary for hours on end. Sometimes the solutions to the battles were as easy as getting in rhythm with the pattern of deadly attacks being hurled your way, while other battles came down to nothing more than staying alive through the powerful attacks and waves of minions for long enough to whittle down the boss large health bar. These challenging sequences are satisfying to complete, but the level of frustration I felt during my playthrough sometimes made me question if that satisfaction was worth it.If you think those frustrations could be alleviated by adding a few friends into the mix, think again. Broforces lengthy campaign can be played with friends and strangers using local and online co-op. Unfortunately, while having extra bodies around for the bosses is helpful, getting through the levels is much more difficult thanks to how easy it is to accidentally kill each other in the heat of battle. If youre hoping to make progress, go in solo.When I reminisce on my time with Broforce, I remember the great gameplay and funny moments  both scripted and unscripted. Unfortunately, Ill also remember a game that can be unnecessarily frustrating. Luckily, in between those roadblocks, Broforce is a great retro action game that delivers nonstop excitement. Playing through Broforces campaign may have given me heartburn, but its an adventure Id make all over again without hesitation.", "date": "Nov 12, 2015", "grade": "8.25"}