{"name": "Life Is Strange: Before the Storm - Hell Is Empty", "ref": "https://www.gameinformer.com/games/life_is_strange_before_the_storm__hell_is_empty/b/playstation4/archive/2017/12/20/life-is-strange-before-the-storm-episode-3-hell-is-empty-review-game-informer.aspx", "text": "From grief to mental illness, Life is Strange has always made hardship the core of its experience. The finale of this prequel stays true to that notion, but it also brings a sense of satisfaction and a somber reminder of the original's impact. Deck Nine has done a wonderful job at calling back to the first game while also making you feel like you have agency over how Chloe evolves as her relationship with Rachel grows. The result is a roller coaster of a finale that's both touching and tragic, raising questions about what it means to be a good friend. The answers will be different for everyone, which is what makes this story matternot only for what it adds to the Life is Strange canon, but also for what it reveals about its players.Hell is Empty picks up where the last episode left off, showing the aftermath of the drama-filled Amber family dinner. Rachel gets some long-awaited answers about her father's past, while Chloe tries to be supportive. This episode is full of intensity, but the best parts are the tender moments between Chloe and Rachel, where you see how much this fast friendship has changed both of their lives. This finale makes you believe in their bond and root for their success as individuals and as a pair. In the original, we didn't know much about Rachel except for the few instances where Chloe spoke of her. Now I feel like I know and care about Rachel in a way that makes the first game hit even harder. I also feel like I understand Chloe and her motivations better. The writing is authentic and genuine, showing new sides to even minor characters like Nathan Prescott and Frank Bowers. Nothing is black and white, making these multi-dimensional personalities even more intriguing and sympathetic.My favorite part of Before the Storm is the impact of my choices. I had a lot of agency over where I wanted to take Chloe and Rachel's relationship. Should they become romantically involved? How do they show their appreciation for each other? As you make these decisions, Deck Nine tells a well-authored story that acknowledges the role you played in shaping it. Little things like asking Rachel for her bracelet ended up having a nice payoff later on, but the moment still stands on its own. Even things you did in the first episode have impact here, making the time it took to develop relationships worth it. As with the previous game, the finale offers one very big decision in how the end plays out, and this decision really makes you ponder what matters to you. I appreciated how it said something about me as much as it said something about Chloe and Rachel's relationship.While the episode has plenty of high points, its repeated environments are disappointing; the junkyard wears out its welcome the most, and even new areas are mostly a part of places we've already been. The gameplay is sparse, mainly relying on dialogue options, with a few easy-to-solve puzzles. These mostly entail finding the right item or tool for the occasion. While they aren't anything remarkable, they also don't get in the way of the story that's unfolding either. Backtalk continues to be a way for Chloe to solve her problems, but at least it's toned down a bit from how over-the-top it was in previous episodes. Still, plenty of scenes play out where Chloe disrespects people in a way that feels campy. We know Chloe is rebellious, but these scenes come across as unnatural.Even with some foibles, Hell is Empty does a fantastic job filling in the blanks of what happened before Chloe was reunited with Max. As a fan, its references to the original shed light on how many things came to be, such as Chloe's transformation. Yes, I knew the conclusion, but it still has enough interesting developments to keep me invested. Before the Storm accomplishes what so many prequels fail to do; it tells its own story that leaves you content, while also connecting to the original game in a meaningful way.", "date": "Dec 20, 2017", "grade": "8.5"}