{"name": "PUBG: Battlegrounds", "ref": "https://www.gameinformer.com/games/playerunknowns_battlegrounds/b/pc/archive/2017/12/20/looting-shooting-and-staying-alive.aspx", "text": "This is it, the final circle. Five players are left alive.Swinging around a corner into a tiny abandoned house, I stumble upon a proneassailant. He tags me a few times, putting my health in the red zone, but I am readyfor a close-range skirmish and make short work of him, grabbing a wealth ofhealing items and ammo from his corpse. Outside, the sound of a sniper riflecracking leaves another dead. The play area is miniscule now, forcing theremaining players into a confined space  the house Im in and the areadirectly outside on the walls. Is the final player tucked away in the closed bathroom?I shoot the door down but theres no one inside. No movement from the windows.Where could the last mark be? While I scan intently for any signs of movement,I hear the all-too-familiar metallic tink of a grenade landing at my feet.Boom. A number two placement for me, and Winner Winner, Chicken Dinner for thefinal foe that peeked around the door to fling in the fatal finisher. PlayerUnknowns Battlegrounds is full of magical moments andstories like this, ranging from teeth-clenching suspense to hilarious mishaps.Creating those tales from game to game keeps you coming back for more. Whilethere are only two maps, this isnt like other shooters where you may findyourself getting tired of the scenery. These maps are huge and full of thingsto discover hundreds of hours in. Since games play out in a dynamic fashioneach time, map variety isnt an issue. Gameplay is spurred on by a field-of-play that continuallygets smaller and smaller, forcing remaining players into the same area andcreating conflict, so you dont need to worry about facing 99 campers. Otherneat gameplay aspects, like drop crates that contain powerful weapons and armor,create skirmish points along the way. This elegant design keeps the game fastand fun, from the moment you select a drop point to the final kill.Weapons range from crowbars to machine guns, and you mustlearn to make the most of whatever you can find. When a game starts, you may bestruggling with many other players to slaughter each other over a pistol. Later,as the field is trimmed, a shotgun looks pedestrian against scoped and moddedassault weapons. Vehicles provide a fast transportation option perfect forcruising around the map to loot-rich areas, running over players, or screechingthrough a dangerous position. But you need to weigh the noise aspect  otherplayers can see and hear you coming. The dynamic elements of both weapon andvehicle availability from game to game ensure that every match experience is uniqueand interesting. Still, theres nothing quite like rolling up with three ofyour friends and clearing out another team as they try to secure a crate drop.Solo survival is fun, but teamplay (you can duo with onefriend, or group up to four players in a squad) makes PlayerUnknownsBattlegrounds shine. Instead of instantly being killed after receiving lethaldamage, if youre teamed up you go into a downed state, allowing your friendsto pick you back up. This leaves them vulnerable to being gunned down by thesame people that presumably shot you, so theres a lot of harrowing strategyinvolved in limping your way to a safe position where you friends can get toyou safely, or experiencing that movie moment where your team struggles to locatethe sniper that picked you off (and rather than kill you, leaves you alive asbait).For all the freedom involved in every session, there arestill some glitchy quirks and unoptimized aspects of the game that can appearfrom time to time, like cars spinning into infinity, crashes, or drops. Whilethese incidents can be hilarious, they can also hit at the worst possible timeand cost you a win.PlayerUnknowns Battlegrounds brings the battle royale genreto a smashing mainstream success, packed with memorable moments andaction-packed adventures. Solo or with friends, youre in for an intense ridethats different every single time.This review pertainsto the PC version of PlayerUnknowns Battlegrounds. The game is also availableon Xbox One as part of the Xbox Preview Program.", "date": "Dec 20, 2017", "grade": "9.5"}