{"name": "Destiny 2: Curse Of Osiris", "ref": "https://www.gameinformer.com/games/destiny_2_curse_of_osiris/b/playstation4/archive/2017/12/14/game-informer-review-destiny-2-curse-of-osiris.aspx", "text": "Bungie faces the unenviable task of balancing established plans for content roll-out and simultaneously responding on the fly to an anxious and vocal community, many of whom have valid and frustrated feelings about this sequels problems in the endgame. Curse of Osiris is colored by that debate. This first expansion is a flawed and in-progress attempt to serve the games multiple masters  both casual and hardcore enthusiasts. Viewed on its own merits, I found a lot to enjoy, even if the core story, missions, and new setting elements dont live up to their potential. At the same time, the release coincides with a few important updates that encourage deeper commitment.Long hinted at in the series fiction, the curtain is finally pulled back on the mighty warlock Osiris. Framed as the fantasy fable of the grand wizard lost in the mystical woods, the narrative framework has a lot of potential, especially with the addition of the reality and time-experimenting Vex enemies at center stage. Unfortunately, despite a few attractive cinematic moments, the story fails to reach full stride. I never got invested in the conflict or its MacGuffin villain.Mercury is a breathtaking new artistic backdrop, dominated by imposing architecture and the dazzling bloom of sunlight. The gates that lead into simulations of different timelines make for the sort of rich sci-fi concepting Destiny 2 should embrace. Yet again, the idea doesnt live up to what it could be. The patrol space is too compact to compel a sense of exploration, and the connected network of gateways doesnt capitalize on the breadth of locales and situations suggested by the conceit. The semi-random and interlinked puzzle-piece nodes of the simulated Vex Infinite Forest fail to differentiate the individual missions from one another. Likewise, the story missions that flow through both Mercury and other destinations offer few surprises or memorable action sequences.Crucible play maintains the focus on teamwork and deliberate pacing that was present at launch months ago. I was disappointed to not see any new playlists or game modes, as PvP needs to be refreshed, notwithstanding some important and welcome balance tweaks that help even the playing field between weapons and classes. The limited playlist options harm replayability, and something needs to happen to inject increased variety into moment-to-moment play. Thankfully, several excellent PvP maps lend freshness. From the dimly lit halls of Titans arcology to the shimmering cliffs of Mercurys distant past, these are thoughtfully constructed battlefields with Bungies usual practiced eye for chokepoints and lines of scrimmage.The new Eater of Worlds raid lair reuses some environment features from Destiny 2s first raid, but dont be fooled. This six-person cooperative expedition may be shorter than previous raids, but it boasts a few great encounters and an awesome boss fight. The puzzles are intriguing and logical without being obtuse, and the action scenes are intense and gratifying. Raid loot continues to need work, lacking the breadth of rewards and exciting drops that characterized the first Destiny raids.Several new additions offer an olive branch to players struggling to find meaningful long-term investment. New masterwork weapons provide a fun chase for randomized perks and the ability to speed up the super recharge rate through more orb creation, but without breaking the games balance. A separate weapon forging mechanic demands an enjoyable grind for resources, and increased reason to engage with excellent activities like strikes and adventures. The new heroic adventures, with their challenging modifiers and fierce enemy combatants, make for great cooperative fun, and I hope they soon expand into other locales beyond Mercury. The frustrations of randomness in the token economy are also partially addressed, with a smart system to afford players who have already invested in a lengthy grind the option to purchase missing set pieces from some vendors. As a collector, its one of my personal favorite new features.Im dismayed that the crunch of vault, mod, and shader inventory remains unresolved. At times I simply turn the game off because I cant stomach the task of managing more item juggling. In a loot-focused game about progression and collection, its a significant problem. Im also increasingly troubled by the prevalence and number of rewards looped in with the microtransaction system. When Destiny 2 is struggling to find meaningful rewards to engage players in day-to-day play, it seems tone deaf to hide ships, ghosts, sparrows, ornaments, and armor sets behind a loot box system with only the stingiest paths to acquisition through natural cycles of play.This release doesnt occur in a vacuum. Curse of Osiris launches amid public backlash against certain Destiny 2 systems, including XP throttling and select content being locked behind the expansion purchase. Beyond that criticism, the expansion doesnt hit the high notes it could have reached. Even if some features, characters, and new locations deserve more depth, this first DLC pack hides some thoughtful renovations and new opportunities for adventure behind an underwhelming first few hours. The robust community has a lot to say about the game, and I share some of the concerns being voiced. Simultaneously, my frustrations are tempered by several fun activities and loot chases that continue to keep me engaged.", "date": "Dec 14, 2017", "grade": "7.25"}