{"name": "Steep: Road to the Olympics", "ref": "https://www.gameinformer.com/games/steep_road_to_the_olympics/b/playstation4/archive/2017/12/13/game-informer-review-steep-road-to-the-olympics.aspx", "text": "The Winter Olympics and Steep don't have a lot in commonother than they take place on snowy mountains, which is the crux of thisexpansion's problems. Steep's base game and its DLC up to this point areopen-ended experiences predicated on letting players explore different extremesports forms in free spaces. The addition of nine Olympic events and a Become aLegend mode in Road to theOlympics restrictwhat is best about Steep with little to show for it in return. Even if you'resolely interested in the Olympic content, this expansion provides littlesubstance.The Become a Legend mode is accessible in the maingame's Aravis location (showing up as an optional event alongside the others),taking you on a training regimen that culminates in qualifying for and competingin three freestyle events in South Korea  Big Air, Halfpipe, and Slopestyle.This isn't a story mode or a deep career mode with a progression system forupgrading your rider. Instead, it's a series of tutorials and the occasionalevent. These competitions are routine for those who've already played Steep,and laborious for the uninitiated.The mode half-heartedly attempts the staging of its ownOlympic drama. This includes a narrator chronicling your journey leading up tothe Winter Games and video clips of real-life Olympic athletes such as LindseyVonn, Sage Kotsenburg, and Kevin Rolland talking about their professionalexperiences, but it fails to convey much of the Olympic experience itself. Itlacks TV-style presentation, an Olympic Village, a sense of occasion throughthe opening ceremonies, and even medal presentations on a podium.My favorite events of the Winter Games  the skiing  aren't even included in the Become a Legend mode. These are instead onlyavailable by themselves on an isolated mountain representing South Korea. Youcan't even free ride it like all the other mountains in the game. It existsonly to host the nine Olympic events, and therefore is a waste of a mountainand is unrelated to the rest of the game's philosophy, events, and even onlinefeatures. You can see the online times of others, but there is no meeting andcompeting with real-life players in South Korea. Some Olympic spirit.The gameplay doesn't stray far from what Steep alreadyhas demonstrated it can do. Thankfully, none of the usual half-baked Olympicgameplay crutches are present, such as minigames, quick-time events, or buttonmashing  just snowboarding and skiing. The Super-G and Giant Slalomskiing events feel nice, with the fast downhill races offering a new experiencefor Steep players as skis chatter over the icy slopes with a palpable sense ofdanger. The Parallel Giant Slalom event on a snowboard was also fun, demandinga quick rhythmic swaying with the right analog for the fastest time through thegates. Despite these highlights, the Olympic content's focus on the actual Slopestylefreestyle course in South Korea emphasizes an existing weakness in Steep'sgameplay  rail grinding and sliding. These were added as DLC, and gettingon rails still feels unpredictable and too floaty to feel satisfying.The Road to the Olympics expansion also contains alps inJapan. Thankfully, this new mountain region includes all the drop zones,mountain stories, challenges, and freeride opportunities Steep players haveenjoyed in the base game. This region naturally includes the updates to Steepthus far, including the ability to change the world's ambiance and time of dayat will, and other extreme sports like the rocket wingsuit. These true-to-form additionsare redeeming because they are a more natural fit with the base game than thenew Olympic content.There'smore going on in these winter sports than what happens when the world paysattention every four years, and Steep shouldn't be held hostage by the Olympicswhen what it does is working so well already. This content neither plays to Steep'sexisting strengths nor gives gamers looking for Olympic competition anythingsatisfying.", "date": "Dec 13, 2017", "grade": "6"}