{"name": "Planet Of The Apes: Last Frontier", "ref": "https://www.gameinformer.com/games/planet_of_the_apes_last_frontier/b/playstation4/archive/2017/12/12/a-damn-dirty-disappointment.aspx", "text": "This year marked the end of the rebooted Planet of the Apes film trilogy, but fans dont have to say goodbye quite yet. Planet of the Apes: Last Frontier offers an all-new story set between the second and third films, which shows another example of the personal toll that the Simian Flu has taken on both its human and ape survivors. Rather than take direct control over the characters, viewers cast their votes on how to proceed in A or B reactions. Its an appealing proposition, but repeated viewings hammer home just how little impact your choices have on this out-of-control world and its unlucky inhabitants.Planet of the Apes: Last Frontier splits its focus between the human and ape perspectives of an impending crisis. A community of Simian Flu survivors is huddled in the Rocky Mountains in a small community called Millerton. Unbeknownst to them, the approaching winter is agitating a nearby colony of apes. Both factions are running low on food, and are embroiled in their own internal power struggles. After the apes raid a human outpost, a pair of drifters appears in Millerton, and their presence threatens to bring the simmering hostilities to an all-out war. Its a dramatic setup, which has the potential of offering up a variety of satisfying twists and turns. Does it deliver? Mostly, or it does at least once.I was dubious of the games stripped-to-the-metal approach to gameplay, but I enjoyed it once I settled into its particular rhythm. I dont ultimately know that being able to manually spur a horse along during a conversation between Millertons leader, Jess, and her underlings would have added anything to the story, which is clearly the focus here. The simplicity also makes it more approachable for people who may not play a lot of games, but want to participate in a group viewing with their friends. Up to four players can vote on decisions using either a game controller or their mobile device (after installing a companion app).Playing with a group adds an interesting dynamic to the experience, particularly as the story starts to pick up and people gravitate toward either the human or ape sides of the conflict. In the event of a tie vote, another vote is held until either a consensus is formed or a player uses a tiebreaker to push their agenda forward. I got a kick out of playing with my family and having brief, impassioned conversations during what seemed like particularly momentous events. Those choices come at a steady pace, requiring viewers pay close attention to conversations. If you do drift off for a second, choices are presented with a snippet of representative dialog or action, as well as a word that describes the intended action  like joking or aggressive.Fortunately for Last Frontier (and viewers who do have a tendency to drift off), what it lacks in traditional interaction it makes up for in presentation. The game was developed with help from Andy Serkis Imaginarium Productions, the mocap studio that helped bring the apes to life so believably in the films. While theyve taken a visual hit in the game, I was still impressed at how great the characters look in close up, and how subtle their physical performances are. Little tics like eyelids fluttering during a deceptive response are present, which helps sell what could otherwise be plain silliness. One side effect of not having much to do beyond making binary decisions is I found myself looking at the game with a particularly critical eye. Its true that the character models are impressive up close, but the apes have a tendency to look shaggy and weird at middle distance, and everything from the characters to the environments are plagued with constant texture-loading issues on my standard PlayStation 4. A post-launch patch has fixed an issue I had with the game hard crashing at the same place, but technical goofs like tutorial text staying onscreen remain.About halfway through my first viewing, I started wondering just how much these discussions and votes ultimately mattered. Both Jess, the human leader, and Bryn, her ape counterpart, are characters stuck in the middle, between opposing forces. Its a dynamic thats necessary to keep the action dramatic, but it also creates a sensation that regardless of when and how you choose to blast the horn, the train is going to keep rolling where the train is going to keep rolling. When the game wrapped up, it concluded with a bummer of an ending that, while in line with the film franchise, didnt quite line up with my expectations based on how Id been playing and the decisions Id made. The games movie-length runtime and promise of different outcomes seems to encourage repeat playthroughs; would another run at it lead to substantial differences in the narrative?When I played through a second time, my suspicions were confirmed. Your choices may help contribute to an unseen tally that selects which of the games three main endings youll get, but the overall flow of the story is the same regardless of your input. That raid will happen, no matter how passionately you argue against it, and one rancher will be wounded and escape; if you choose not to pull the trigger, another ape will rise up and handle it for you. I wasnt able to extract any meaningful changes in dialog, locations, or reactions during my time with Last Frontier, aside from seeing several different ending cutscenes. Its asking a lot of viewers to sit through whats largely the same thing for just under three hours in the hopes that their choices will trigger something new in the final seconds.I looked forward to each installment of the Planet of the Apes movies, and I enjoyed the strange, brutal future they outlined. Last Frontier is an interesting take on that world that trades in the same themes of the struggle between compassion and forgiveness versus the appeal of tyranny and vengeance. Its a shame that the interactive elements and choices have about as much effect on that world as the close-door button in an elevator. Its a ride that might be worth taking once, but dont bother going back in when youre done.", "date": "Dec 12, 2017", "grade": "5"}