{"name": "Gorogoa", "ref": "https://www.gameinformer.com/games/gorogoa/b/pc/archive/2017/12/12/gorogoa-review-game-informer.aspx", "text": "I appreciate short games built to execute specific, modest concepts. The world of indie games is filled with these kinds of focused experiences, and Gorogoa can certainly be described in this way. However, I simply did not connect with its vision; the narrative is too ambiguous to be engaging, and the simple puzzle mechanics stirred up no emotional response within me.Gorogoas puzzles are based on a series of hand-drawn images placed on a four-by-four grid. In these images, you see a young boy as he rounds up a collection of different colored fruits in a bowl. You can take the pictures apart, rearrange them, and even connect them to make larger images. You can connect two alike pictures to make the boy travel between them, for example, or place an image of a train track above another picture to make it act as a ladder.These hand-drawn images from artist Jason Roberts are beautiful, and stand out as the highlight. They remind me of my favorite childrens books, and do so without singling out a specific style or artist. Unfortunately, moving the images around never amounts to a satisfying puzzle solution. All of my careful puzzle arranging rarely led to eureka moments. Instead, when I got stuck, I would just zoom in and out of an image until I found an interactive element of the picture I had simply missed before. It made it feel like I was just clicking and rearranging things until the next cutscene occurred, instead of solving legitimate puzzles.Part of why the puzzles are so unsatisfying is because the narrative is too ambiguous. I enjoy a story that lets me arrive at my own conclusions, but from Gorogoas beginning to end, I never quite understood what the boy was doing, who the other characters were, why it seemed to be moving through time, and how it was all connected. I was just moving images around until things stopped happening, and then I was suddenly watching the credits.Gorogoas artist and designer, Jason Roberts, clearly had a vision with this game and I applaud him and everyone else at developer Buried Signal for making it a reality. But I struggle to recommend this experience, because whatever emotions Gorogoa was hoping to convey, I simply did not feel them.", "date": "Dec 12, 2017", "grade": "6"}