{"name": "Xenoblade Chronicles 2", "ref": "https://www.gameinformer.com/games/xenoblade_chronicles_2/b/switch/archive/2017/11/30/xenoblade-chronicles-2-review-game-informer.aspx", "text": "Role-playing games can be intimidating, with complicated systems and massive worlds that unfold over dozens of hours. Some developers attempt to overcome that entry barrier by simplifying the genres core components to create a more accessible game. Xenoblade Chronicles 2 is not one of those games. It embraces its complexity, providing dizzying and impressive depth few modern RPGs can match. I love that unapologetic approach, but developer Monolith Soft has trouble keeping the excitement high in areas like combat and story. Xenoblade Chronicles 2 is like a Rube Goldberg contraption designed to make toast or flip a light switch; though entertaining, its elaborate machinery ultimately achieves something mundane.It has familiar elements fans of the series will recognize (including some explicit connections I wont spoil), but the expansive world of Alrest is welcoming to uninitiated players. The setting and story are propelled by a fascinating central concept: the relationship between blades and drivers. Blades are magical beings  human, animal, and otherwise  born from special crystals, and they are bound to the driver who awakens them. The whole world revolves around this dynamic in various ways, and the story uses it to raise unexpected questions about identity and legacy. Those pockets are interesting, but the overall narrative is a stock quest full of cookie-cutter characters. You control Rex, an idealistic young driver paired with a blade named Pyra. All you need to know about Rex is that he says stuff like, Well beat them with the power of friendship. Rex and his companions are trying to reach the World Tree at the center of Alrest, but the journey contains few surprises. The answers to most of the big mysteries are foreshadowed in advance, and events shake out pretty much how you expect. That isnt necessarily terrible; even with only a handful of standout moments, the tale gets the job done and the ending is satisfying.Alrest itself is more of a draw than the events happening within it. Each of the continents is an enormous beast floating in a sea of clouds, a concept Xenoblade fans know well. Towering monsters and gorgeous views make exploring new locations fun, and the main zones have distinct otherworldly vibes. The visual style has changed for this entry, but the fantasy world still feels vibrant and unique. With open-world environments full of possibilities, I enjoyed searching for hidden areas and making note of high-level monsters to take down later. For all the time I spent exploring, I poured just as much (or more) effort into managing my progression. As strange as it sounds, this is where Xenoblade Chronicles 2 shines brightest. A staggering array of systems, points, and unlocks are artfully connected, letting players dig deep into how their characters develop. You can spend points in skill trees, improve weapon techniques, and manage an entire mercenary squad  all of which feels rewarding. However, the biggest draw is awakening special new blades, which come with their own unique designs, abilities, and quests. Though Im not a fan of the loot-box-style method (minus the real-world currency) of getting good blades, I cant deny the thrill of a legendary crystal yielding a bizarre new ally for me to power up. All these systems may sound convoluted, but once all of the layers have been introduced, the end result is an expansive and engaging progression model that always gives you a goal to aim for.Xenoblade Chronicles 2 is brilliant behind the curtain, but its myriad mechanics dont always translate to fun gameplay. The battle system is the biggest offender, emphasizing long encounters rather than tactically interesting ones. Even as you earn additional allies and abilities, the game rarely challenges you to develop new strategies, allowing the rhythm of combat to grow stagnant. That isnt to say you dont have tactical options; combat revolves around timing your special attacks and chaining together elemental combos, so you have plenty to consider. The big payoff assaults are cool, but you need to build your strength in increments to make them happen, like small gears making large gears turn. To facilitate that build-up, even trivial encounters drag on too long, making your characters seem less powerful.The lack of imagination in your missions is another issue. Whether they are formal sidequests or incidental tasks on skill tree, objectives like collect 20 pieces of wood or kill five crabs in this region are constant, and often have multiple similar steps before you can claim your reward. Some of them are even nested fetch-quests, like collect these three things, but each one requires you to collect other things first. You cant ignore them, either, since you need to engage in some side content in order to keep pace with enemies in the main story. The big exceptions to this problem are the special blades unique quests. The objectives are similarly dull, but they are often framed by entertaining story scenes, making them some of my favorite missions to pursue. Beyond the major points, a few minor problems got in my way that wouldnt be worth mentioning individually, except the aggregated effect of them all occasionally makes the overall experience feel rushed and unpolished. This includes technical problems like sound glitches and crashes, but also an absence of basic amenities like button mapping, a useful map, and multiple save slots. Plus, you need to use your gold to buy simple tutorial refreshers (like Basics of Battle), since they are not archived for your reference  a move that seems especially ridiculous given the depth and scope of the game. Xenoblade Chronicles 2 is a sprawling RPG with numerous interconnected pieces, so no part of the experience is isolated. It takes about 100 hours to finish, and not all of that time feels well spent, with bloated quests and repetitive combat. On the other hand, the vast world and intricate upgrades are a joy to dive into. Everything evens out in the end, but the wild swings between its highs and lows make it impossible for Xenoblade Chronicles 2 to maintain altitude above its peers.", "date": "Nov 30, 2017", "grade": "7.5"}