{"name": "Batman: The Enemy Within  Episode 3: Fractured Mask", "ref": "https://www.gameinformer.com/games/batman_the_enemy_within__episode_3_fractured_mask/b/playstation4/archive/2017/11/29/a-flawed-intriguing-chapter.aspx", "text": "At its best, Telltales take on the Caped Crusader is at its best when its twisting what we know of fan-favorite characters like The Joker and Bane and taking them to unexpected places. With Fractured Mask, this quality still turns out to be the strong point while the issues that so often plague all Telltale gamesbad animations, poor pacingare present.Fractured Mask finds Bruce Wayne digging deeper in the criminal group The Pact, trying to gain the trust of ringleader Harley Quinn, while balancing the needs of his allies and foes. No other episode in the Batman series has focused as hard on making difficult choices about whos friend and whos foe as much as Fractured Mask does, requiring you to often balance one characters needs against another, sometimes with possibly deadly results. In these moments, Fractured Mask really shines, as there were two characters I genuinely wanted the best for but ultimately had to choose between. In the end, I feel like I made the best choice I could but still felt guilty, which, frankly, isnt something a Telltale game has accomplished for me in a long time.While its refreshing to care about my choices and the characters who benefit/suffer under them, Fractured Mask still drags in quite a few places, filling sections with moments that wink at fans of the comic with cameos or tedious puzzles. Any moment that I had to walk around and investigate an environment or solve some deathtrap that guided me toward the solution anyway, I resented. These sections just arent entertaining or fun, and I often found myself wishing that the entire episode was something I could just watch and occasionally make choices, as opposed to having pacing come to a standstill so I could jump through some hoops to progress.Still, Fractured Masks story moments are ultimately worth the price of admission, even those outside of the ones that required me to make difficult choices. A number of sequences between Wayne and a certain other character are a nice surprise because they take on the tone of a romantic comedy and are refreshing for a franchise so often basking in the grime of humanity. The storyline concerning Bruce and Jokers relationship is also fascinating, as this episode feels like the first time we really get to influence who The Joker is in a way that will probably make us ultimately accountable for whomever he becomes by the series close. While its hard to judge how effective this arc is without the ending pieces there, its shaping up to be one of the most interesting Joker origin stories in yearsif Telltale can pull off the landing.When all is said and done, Fractured Mask emerges as one of the stronger episodes in both Batman seasons as well as one of the strongest outings of Telltales catalog in recent memory. While the old problems are still ever present, watching the Jokers gradual, earned transformation into villain as well as having to make genuinely difficult choices have me curious about whats going to be left of Telltales Gotham (not to mention Bruce Wayne) by the series end.", "date": "Nov 29, 2017", "grade": "7.5"}