{"name": "Battle Chef Brigade", "ref": "https://www.gameinformer.com/games/battle_chef_brigade/b/switch/archive/2017/11/20/battle-chef-brigade-review.aspx", "text": "Battle Chef Brigade is a weird, delightful, and intense match-three cooking game that also pushes players to hunt for ingredients through fervent hack-and-slash combat. This strange hybrid of genres works surprisingly well, as both push for speed and precision. One botched combat encounter or poorly placed ingredient could spell disaster. Obvious inspiration is drawn from the Iron Chef cooking show, complete with an animated host who reveals the competitions primary ingredient, and an array of snooty judges who demand different things from your cooking. The game is also wildly imaginative; its set in a kingdom called Victusia where monsters are kept at bay by a legion of magic-wielding cooks. Again, this strange union of ideas works, and is used to create an engaging backdrop forplayers.Our guide through Victusia is a young, aspiring cook named Mina, who is upbeat and joyous, and doesnt seem like shes done anything bad in her life. When we first meet Mina, shes trapped as a cook at her familys restaurant, forced to make the same dishes day-in and day-out. She knows she has talent, and is destined for something far greater, so she runs away to Brigade Town to enter a cooking competition to become the next Brigadier and protector of the world. This story is narrow in scope and you know exactly how its going to conclude, but is fun to follow thanks a wild ensemble of supporting characters, including a two-headed Cyclops and a rival cook who uses the undead to help him gather ingredients.Brigade Town has all of the makings of a hub in an RPG, allowing Mina to purchase new cooking wares from shops, take on side jobs to make more money, and interact with the locals to learn more about the world. While the side activities give the game a bit of character, they dont last long, and all funnel into the big cooking competitions, in which Mina squares off against anopponent.When the secret ingredient is revealed, the two contestants run in different directions, past their kitchens, and into the wilderness where they must hunt. The combat mechanics have depth such as punching combos, aerial maneuvers, ground bounces, projectiles, and magic but dont offer much in terms of challenge or strategy. A dragon may have more hit points than a bird, but can be exploited just as easily. While I felt the stress of the clock pushing me to perform as flawlessly as possible, I felt like I was going through the same motions for all encounters. The only moments of intrigue come from a creature grabbing a slab of meat before Mina can, which leads to a chase, or waiting for a bird to lay an egg which is a nice ingredient to add, but takes time toproduce. With a satchel full of supplies, Mina races back to the kitchen to prepare them. At first, you are just working with one dish, but she eventually needs to cook for three judges at once. The pans she uses are like weapons in traditional RPGs, and embrace player choice. For a certain judge that likes watery dishes, she may want to use a pan in which she only has to match two water gems instead of three. She may also want to use a slow cooker that increases the taste of a gem over time. Plenty of variety is offered in the utensils and sauces to enhance taste and add even more variety to thecooking.The matching gameplay takes place on a small 4x4 grid, yet offers plenty of variety, strategy, and chaos. Matching three in such a confined area can be tricky, especially since some gems are too fragile to be moved, or may pollute others. Mina may also need to bring out specific flavors, as each ingredient contains different elements (water, earth, fire, bones, poisons, and delicate materials). If a dish is missing something, a frantic race back into the wilderness is likely in the cards. As a dish is prepared, it takes shape and is shown a rating, giving the player an idea of whether its good or not. Even if you are happy with a meal, the judge may have other things to say and lower the score if it doesnt hit the rightnotes.Battle Chef Bridge is breezy and fun, offering roughly 8 to 10 hours of stressful cooking with a decent narrative and beautiful pastel visuals to pull it along. It may seem lighthearted and innocent, but it succeeds more in being overly chaotic in its match-three gameplay.", "date": "Nov 20, 2017", "grade": "8.25"}