{"name": "Steven Universe: Save the Light", "ref": "https://www.gameinformer.com/games/steven_universe_save_the_light/b/playstation4/archive/2017/11/20/steven-universe-save-the-light-game-informer-review.aspx", "text": "Steven Universe is a show that has cultivated a strong following thanks to its Venn-diagram overlap of immortal aliens and frequent lessons on the importance of empathy. Its a strange combination that works surprisingly well, and though it has seen a few video game adaptions, Save the Light has been particularly exciting because its Stevens first full-scale console RPG.Save the Light is a sequel to the 2015 mobile game, Attack the Light, but its worth noting that playing that game is not a requirement for this follow-up. Being familiar with the show is helpful, but Save the Light stands on its own as an RPG inspired by games like Paper Mario. Unfortunately, it is held back by myriad technical issues that bring down the experience.Save the Light is written by Rebecca Sugar, the shows creator, and it is apparent throughout. The characters, lore, and world are consistent, and the narrative arc feels like it could be a lost episode. It also introduces a new villain, Hessonite. She doesnt get as much screen time as I would have liked, but she has a backstory that is as interesting as the villains that appear in the show.Hessonite comes to Earth in order to recover her thought-lost evil sentient weapon, the Light Prism, that Steven and pals were able to turn good in the first game. She makes her presence known by landing her ship on top of Stevens dads car wash, effectively destroying it, which sends Steven off on his adventure. Steven and three other party members of your choice make their way through an assortment of locations in search of Hessonite. Stevens home town, Beach City, serves as a sort of central hub and is particularly thrilling to explore as a fan since it is home to many familiar characters and locations. Overall, the story is light and satisfying in its finale, but the commentary from your party is really the highlight. I would especially recommend placing Peridot in your party when she becomes available as she offers up some of the best lines in the game.While the writing captures the essence of the show, the visuals do not  but thats okay. Save the Light has its own visual identity, but its elements are all instantly recognizable as belonging to the same franchise and it looks great. Moving the 2D character sprites through the assorted 3D environments looks especially cool.Combat is turn-based, with the option to augment your moves with timed-button presses. Your party performs attacks based on a shared pool of recharging points, which opens up interesting combat options, like saving all your points for a single powerful attack versus using the points to execute a weaker attack multiple times in the same turn. You can also team up characters to make their attacks more powerful. It leaves a lot of room for experimentation in the combat, and it helps that each of the optional party members are distinct. The system is functional, but unremarkable, doing little to separate itself from its Paper Mario inspiration.The bosses do stand out, however, as each requires a different approach. Theyre not stronger versions of familiar enemy types, and they have unique tactics like relying on underlings to power them up, or using a powerful wind ability to push you out of the combat space.As fun as Save the Light can be, enjoying it is difficult due to numerous technical performance issues. Even after a post-release patch, I constantly ran into problems. They ranged from minor hiccups (like getting temporarily stuck on environmental geometry) to major infractions (like fully restarting the game after attack options disappeared in the middle of battle). Perhaps the most damning bug was after I beat the game and watched the final cutscene, the game hard crashed to the PlayStation 4s home screen as the end credits scrolled, robbing me of a fully satisfying conclusion.A number of quality-of-life issues also hinder the experience. Your inventory is difficult to navigate, and you have a lot of different items to collect. I instinctively moved the right control stick to adjust the poor camera angles, but the game does not give you a way to adjust your view. The circular menus used to select attacks and even selecting characters mid-fight is also inconsistent. The cursor is erratic, forcing far more accuracy than should be necessary to simply select something. These are smaller qualms that dont hold the game back significantly, but those frustrations placed alongside the frequent bugs lead to the game feeling like a chore.Without its many technical issues, Save the Light could have been a good video game adaptation of an excellent show. The involvement of its creator is apparent and the voice cast gave the game the same consideration they do the source material. I even liked the combat and storytelling, but it wasnt enough to overcome the frustrations of having to frequently restart the game or watch helplessly as Stevens run animation looped while he stood next to a rock.", "date": "Nov 20, 2017", "grade": "6.25"}