{"name": "Raid: World War II", "ref": "https://www.gameinformer.com/games/raid_world_war_ii/b/xboxone/archive/2017/10/12/game-informer-raid-world-war-ii-review-from-payday-to-mayday.aspx", "text": "As games like Destiny, Borderlands and Left 4 Dead have proven, gamers gravitate to well-designed cooperative shooters in droves. Starbreeze Studios tapped into that success with the popular Payday franchise, allowing four players to team up and attempt daring heists while gunning down a precincts worth of police officers and SWAT teams. Raid: World War II attempts to build off the success of Payday, using much of the same infrastructure for an Inglorious Basterds-inspired experience. But unlike the game and film developer Lion Game Lion tries so hard to emulate, Raid fails more than it succeeds thanks to its dated foundation and sloppy execution.Raid: World War II welcomes players into the Ministry of Ungentlemanly Warfare. Facing insurmountable odds in the face of Hitlers Wehrmacht, Winston Churchill commissions one of his underlings (played by Monthy Python legend John Cleese) to explore unconventional warfare. His solution? Enlist a deadly group of thieves, renegades, and deserters and tell them throw out the rules of engagement, smoking out the Germans in any way these dastardly agents see fit. If some of Hitlers gold happens to go missing in the process, so be it. Each mission concludes with a goofy full-motion-video Hitler skit showing the Fhrer boiling over with rage, angsty defeat, or resignation as you pluck away at his army. These attempts at levity fall flat more often than they hit the mark.Choosing from one of four characters and classes, you set up base in a shelled church behind enemy lines. From these modest digs, you can choose from a dozen or so missions that range from derailing trains filled with gold to infiltrating well-fortified Nazi strongholds to take out SS scientists. Players can use any currency they confiscate on these raids to upgrade their digs from a decrepit hovel to an impressive headquarters filled with luxury furniture and expensive paintings. Missions also earn XP that funnels into a basic progression system similar to Paydays skill trees. These upgrades impart modest stat boosts and quality-of-life boosts like being able to move more quickly when carry heavy items, but dont give you any game-changing new abilities to look forward to. Each class has a special ability, called a war cry, that gives the squad boosts of various styles at critical junctures, but these dont change significantly as you level up, either.The Payday influence carries into the combat as well. As each mission starts, you have the option of going stealth to get a jump on the Nazi enemies. This rudimentary system is still crude, with no stealth-killing animations or ways to manipulate the environment to stay undercover. Inevitably, the soldiers spot you and begin the lengthy lead volleys that comprise the vast majority of the Raid experience.During WWII, the German military developed the renowned Blitzkrieg strategy, which called for attacking with heavy concentration of tanks, planes, and artillery to overwhelm opposing forces quickly and cause disorder among its ranks. The A.I. employed by Raid also delivers a heavy concentration of troops, but brings its own disorganization to the battlefield. These untrained dolts swarm like insects on your location, pouring over walls and through any opening in the vicinity. What they do once they get there would cause any general to resign in shame. They frequently charge right at you in single file, as if auditioning for an extra role as Decapitated Headshot Enemy #1. The lack of enemy variety outside of snipers and flamethrowers also hurts the combat. Occasionally, the enemy marks your position with a flare for an artillery attack or a tank rolls into the scene, but you just need to fire blindly into the poorly spaced bullet fodder coming your way. Their poor marksmanship makes it easy to run straight across the hot zone toward objectives in the open on lower difficulties as well, so I recommend moving straight to the harder settings once you have your bearings.Offline players dont get much support from the squad A.I., either. These wingmen handle themselves admirably during firefights, and will even resurrect downed teammates. But requesting any help beyond that is a bridge too far for these divas. That means you have to carry out the heavy gold crates and AA shells one at a time all by yourself, as well as escort POWs one by one to the extraction zone. These frustrating and repetitive experiences killed any desire to play solo.Those who want a longer, more diverse experiences can tackle one of the two Operations. These six-part missions take you out of the normal rotation of raids and into the streets surrounding your church base, and are a welcome addition to the Payday formula the game otherwise follows so closely. These segments introduce driving to the mix, but given the horrible controls, I wonder why the developer even bothered.Instead of investing resources in introducing driving controls, the studio could have used it to address Raids myriad technical glitches. With underpopulated server lists that dont reflect the full player pool, objective markers failing to appear or failing to disappear once you complete them, and abrupt slowdowns when new players join, Raid feels more like an early access game than a retail release. The situation gets even worse on console. I experienced multiple game crashes, random red geometry appearing in the game, and even once spawned at the beginning of a mission in a train car I couldnt escape. I have no idea how Sony or Microsoft approved the game for release. Building off the success of Payday is a decent premise for Starbreeze to explore. Raid: World War II does not successfully lead a winning campaign, however. The poor A.I., repetitive design, and technical problems had me waving a white flag long before the war should have been over. If Starbreeze plans to turn this into a long-running service game, it has a lot of work to do.", "date": "Oct 12, 2017", "grade": "4"}