{"name": "FIFA 18", "ref": "https://www.gameinformer.com/games/fifa_18/b/switch/archive/2017/10/11/game-informer-fifa-18-switch-review.aspx", "text": "EA Sports' recenthistory with Nintendo consoles isn't good. The company and its games werealmost entirely absent from the Wii U library, and its handful of Wii titlesweren't fun to play. Therefore, when EA Sports announced a Switch version of FIFA18, it immediately raised questions about what features would be cut from thePS4 and Xbox One versions due to hardware limitations. While FIFA 18 on Switchis indeed slimmer on features, I got past the fact that it doesn't have TheJourney story mode, Pro Clubs, and some aspects of Ultimate Team (like the newSquad Battles) thanks to the gameplay and modes that are present.The FIFA basics ofcareer mode and Ultimate Team contain plenty of mileage to keep any playerbusy, even without new transfer cutscenes and contract options, FUT Champions,and friendly seasons. The inclusion of other play options such as the women'sinternational tournament and seasons online play (including local Wi-Fi play)means this isn't a bare-bones offering.The modes are backed upby strong gameplay. The Switch version isn't on par with FIFA 18 on the othersystems, but it contains the jostling and off-the-ball support from A.I.teammates that helps you engineer an attack or marshal a defense. The ballbounces more awkwardly at times, and some of the player movements (like adefensive lunge or burst of speed) can be slightly exaggerated. Both seem tolack a layer of refinement, like one extra animation or calculation is missingthat would smooth out the transition from action A to action B.The fact that you canplay FIFA 18 on the go isn't a huge draw for me, both because the title doesn'tuse a system to allow you to play friends online (only strangers) due toNintendo's lack of infrastructure support. Also, some of the controllerconfigurations aren't conducive to comfort. Playing with the Joy-Cons attachedto an undocked screen isn't as good as having the screen docked and attachingthe Joy-Cons to the plastic controller housing (or using the Pro Controller).When attached to the screen, accessing the bumpers and triggers is harder.Similarly, multiplayer with local friends on a single screen is even moreuncomfortable when you each take a Joy-Con and tilt them on their sides.The Switch version of FIFA18 is a better portable experience than you've been able to get on Nintendoconsoles up to this point, but it's hampered by Nintendo's insufficient onlinestrategy. Unlike some previous EA Sports titles on Nintendo platforms, FIFA 18isn't an ill-formed castoff, but it's an uneven performance and not a clear-cutvictory.", "date": "Oct 11, 2017", "grade": "7"}