{"name": "Hob", "ref": "https://www.gameinformer.com/games/hob/b/playstation4/archive/2017/10/02/hob-game-informer-review.aspx", "text": "Desolation and solitude permeate Hob, the beautiful new top-down, exploration-heavy action title from Torchlight developer Runic Games. In this sprawling adventure, you guide a small, isolated character across a dangerous world to reactivate ancient technology and restore the world to its former glory. Uncovering the world's secrets requires you to explore a big map, delve deep into mechanical dungeons, and battle hostile inhabitants in an experience rich in mystery.You spend most of your time exploring Hob's world, unlocking new areas as you reactivate the ancient machines housed in the dungeons. Drawing heavy inspiration from The Legend of Zelda series, the typical loop consists of finding the entrance to the next dungeon and solving puzzles to power the door to gain access and complete the subterranean puzzles before moving on to the next area. While you have a map to get your character in the correct general area, you need to rely on environmental clues to reach your objective.Hob masterfully scatters visual cues that entice you to search areas that feel off the beaten path. I didn't mind letting distractions pull me away from my main objectives; I not only relished the opportunity to further envelop myself in the beautiful environment, but these areas often turned out to be essential. Any time a path didn't further my progress, it often gave me items like ability orbs, health upgrades, or sword upgrades.This element makes exploration even more exciting, as I never knew what sought-after components would be waiting in the next cavern. Each time I gathered enough ability orbs, I enjoyed scurrying back to the workshop to bolster my abilities, like a more powerful punch attack or a better dodge-roll. I also unlocked special cloaks that sacrifice energy for added health or vice-versa, as well as important new abilities like teleportation and a grappling hook.You're commonly given a waypoint on the map, but you can't simply follow it to your destination. I initially struggled with the exploration of Hob, since the most obvious routes are often obstructed, so you need to perform seemingly unrelated tasks to gain access to your objective. The payoff of finally figuring out where you need to go is always great, but I spent hours early on wandering aimlessly and making little progress. In these moments, I felt hopeless and frustrated as path after path wound up a dead-end.Once I better understood how to traverse the map, progress was much easier. I learned to look for weak spots in walls to punch through, or more complex situations like using a grapple point to reach a cube that can be plugged into a switch to open an area. Figuring out Hob's tricks allowed me to build up some momentum and clear out portions of the map.Though Hob leans more heavily on exploration than the Zelda series, you encounter enemies regularly. Combat typically consists of goading your enemy into attacking so you can dodge and counter using quick sword slashes or a powerhouse robot arm. While I like having both attacks at my disposal, I wish Hob allowed more worthwhile options for stringing together the two attack types in satisfying combinations. The most effective combos typically come from using the same attack repeatedly, making for less engaging fights.With its watercolor aesthetic and rich contrasts, Hob is undeniably gorgeous. I love how you can find viewpoints that allow you to look out and appreciate how visually appealing every piece of this world is. However, Hob's beauty is diminished by camera issues stemming from the fixed isometric view. Problematic angles make occasional platforming challenges difficult, and trees and cliffs often obstructed the action, forcing me to fruitlessly fidget with the camera to get a better view. The framerate is also distractingly inconsistent when a lot is happening, which combines with the bad angles to rob Hob's world of its beauty.The technical issues don't stop with the visuals. On multiple occasions, I walked through walls or fell through the ground. In addition, I also encountered egregious glitches like invisible enemies or turning my character a blinding white color because of a disrupted teleportation.Despite its technical hiccups and frustrating early hours, Hob is a worthwhile experience that rewards ardent explorers and delivers an exciting mystery to unravel. Each conquered dungeon feels like a mini triumph as you watch the desolate and dying world come back to life, and I loved the sense of wonder and each ~a-ha~ moment of discovery. Even after I finished the main story of Hob, I was excited to jump back in and search for more secrets hidden within the world.", "date": "Oct 02, 2017", "grade": "8"}