{"name": "Battle Chasers: Nightwar", "ref": "https://www.gameinformer.com/games/battle_chasers_nightwar/b/playstation4/archive/2017/10/02/battle-chasers-nightwar-game-informer-review.aspx", "text": "The minds behind Battle Chasers: Nightwar are homage artists. As core members of the Darksiders team at Vigil Games, they paid tribute to Nintendo's beloved The Legend of Zelda series. Now, with a new studio (and help from a well-funded Kickstarter), the team at Airship Syndicate is displaying their adoration for another legendary gaming franchise: Final Fantasy. Nightwar is a gorgeous turn-based RPG with clever battle mechanics, but if you want to survive this adventure, you have to work for it.Nightwar is technically a spinoff of the WildStorm/Image Comics series Battle Chasers from the late '90s, but you wouldn't know that by playing the game. It quickly introduces the characters and lays out their backstories in an opening text crawl, then it's off to the races to tell an uninspired story about a necromancer's perverted mission to raise an undead army. As a fan of the comics, I got a kick out of seeing these characters back in action and hearing them voiced for the first time. Even so, the core characters are not well-developed over the course of the story, which left me feeling unattached to my party and their interactions.The story didn't grab me, but the battle system did. Similar to games like Final Fantasy X, Nightwar features a designated turn order, so you can plan out each battle in advance. Regular attacks might be relatively weak, but they happen immediately. On the other hand, abilities burn mana and require a casting time so your selected ability might not trigger until after an enemy's attack. This system requires a little extra planning, but the tension of trying to knock out an enemy or heal a party member before your foes' turns is thrilling. On top of all this, each party member has unique skills and abilities, and many of them deliver bonus damage depending on the buffs applied by other heroes' abilities. I loved experimenting with this team synergy and chaining together different sets of abilities as I calculated the optimal damage output.Managing the mana pool for each hero adds an additional layer of sophistication to combat. Heroes earn overcharge each time they perform a normal attack, and this overcharge acts as disposable mana that disappears at the end of each battle. The longer a battle drags on, the more resources you tend to have for more powerful attacks, which encouraged me to experiment with my teams' full suite of attacks.Nightwar's combat system is incredibly rich, but these turn-based encounters begin to feel rote thanks to the massive grinding required to overcome each dungeon's boss. A massive difficultly spike accompanies each transition from one story dungeon to the next, and my characters often had to level up several times before that challenge evened back out. Nightwar's limited handful of side missions only exacerbates this problem, because you quickly run out of fresh content and are forced to grind through the same battles repeatedly for extra experience.Loot drops could have mitigated the frustration of replaying old content, but Nightwar's reward system is also unbalanced. The biggest problem with Nighwar's loot is how sparse it is; dungeon treasure chests and monster drops are few and far between. You can replay old dungeons on harder difficulties for the chance to receive legendary gear, but unless you replay a dungeon you just completed, these drops are often worthless because they are so far below your level. Even when I tackled harder dungeons, I was still rewarded with equipment I didn't want. After spending more than an hour replaying one of the hardest dungeons, I only walked away with one sword for a hero I hadn't touched since the beginning of the game.The balancing problems create an uneven play experience, which is disappointing considering the good things this stylish RPG has to offer. Airship Syndicate's gorgeous art design and fluid animations are a wonder to watch, and Nightwar's overcharge ability system offers a layer of strategy that is often missing from turn-based RPGs. Overcoming Nightwar's most challenging battles is a thrill, but only if you're willing to put your nose to the grindstone.", "date": "Oct 02, 2017", "grade": "7.75"}