{"name": "Project Cars 2", "ref": "https://www.gameinformer.com/games/project_cars_2/b/playstation4/archive/2017/09/29/game-informer-review-project-cars-2.aspx", "text": "Somesim-racing developers are in love with cars, but whether they love video gamesand the people who play them is unclear. I don't get that feeling from ProjectCars 2 developer Slightly Mad Studios. The series is designed around thepremise of making things fun, flexible, and easy for the player, and that focuscomes out in the product.Likethe first Project Cars, the sequel's main focus is giving players a slew ofcustomization options to affect and set up races as they see fit. It adds aweather slot (bringing the total to four), which means you can have a singlerace include various types of snow, rain, and visibility, as well as the optionto speed up the time of day. Running this kind of meteorological gamut isfantastical, and the game looks great no matter the weather or time of day.These and the seasonal temperatures can have a big effect on the track, yourtire temps, and thus your grip. HUD information can be customized, includingwhere you want it on the screen, and cars' assists can be modeledautomatically after those of the real-life car. You can even tweak the viewingangle of the different cameras from narrow to wide and points between. All thisadds considerable flavor to your race schedule  very welcome since racing carsin and of itself is nothing new under the sun.Onesmall-but-interesting custom aspect is how different racing series adhere todifferent rules. Some race durations are by lap and others by time (which canbe shortened or lengthened, of course). This exemplifies the minor-but-necessarystep forward for its career mode in the name of adding flavor to each seriesabove and beyond them being another date on the calendar. Project Cars 2 alsoadds manufacturer and invitational events to break things up. The former unlockthe more you race cars of the same manufacturer, and the latter unlock viamilestones. Overall, the career mode pales in comparison to the more fleshed-outones from recent Codemasters' titles (which admittedly embrace a different philosophy),but Project Cars 2's career mode is better than the series' first entry. Alsodifferent is the fact that higher-end series are locked, which gives yousomething to strive for while still giving you lots of lower- and mid-leveldisciplines to choose from.Theoverall race weekend schedule (optional, of course) and its importance is thesame as the last entry. Use the practice session to feel how different coldtires are from warm ones before you qualify, as well as get used to the track.Even though the game includes many familiar, well-known tracks, putting in thework to improve yourself as a driver through concentrated seat time is whatthis franchise is about. It can be a grind, for sure, but it also makes apodium finish or even a good time on a particular section of the track feellike an earned accomplishment.Gettingused to how a car performs is made easier through the race engineer, who tweaksyour car by running you through a series of questions  though you can also usethe regular setup editor. I like (but don't love) the cars' handling when usinga controller. The controller's rumble lacks nuance for those situations whenyou're right on the edge of losing control, and I tended to pussyfoot aroundcorners because I often wasn't sure where the edge of my cars' capabilitieswhere. I was more fearful than daring, when I'd rather it be the reverse.ProjectCars 2's incremental progress in most areas stands in contrast to the seriescontinuing technical problems. The A.I. cars (which are optional inmultiplayer) tend to comically bunch and crash on busy corners, and yet playersare penalized and told to give positions back for ticky-tack or sometimesphantom infractions. You can lay down a good qualifying time only to bemysteriously beat by several seconds by the end of the round by the rest of theA.I. field.Multiplayerraces also give you myriad options, but at launch on PS4 it was hard to getinto a race. I was either being disconnected while in the online lobbies,waiting forever for a race to start, or both. Your online rating is a form ofincentive, but apart from this and being able to post times on a variety of timeattack leaderboards, at launch there isn't a larger structure to yourmultiplayer achievements.Withall its customization options, racing demands, and copious track configurations(140-plus at over 60 locations), Project Cars 2 has a lot to dive into. However, it's more thanjust a scattershot of content  it's a title that rewards players for exploringall of its nooks and crannies. It could still use a good coat of polish, but ithas a charm and daring that is often missing in the sub-genre.This review pertains to the PS4 version. The game isalso available on PC and Xbox One.", "date": "Sep 29, 2017", "grade": "7.75"}