{"name": "Total War: Warhammer II", "ref": "https://www.gameinformer.com/games/total_war_warhammer_ii/b/pc/archive/2017/09/28/rapacious-rats-and-disorderly-dinosaurs.aspx", "text": "The original Total War: Warhammer proved high fantasy was anexplosive ingredient to add to Creative Assemblys longstanding strategyfranchise. The Warhammer property has been used in all manner of games, withplenty of misses to go along with the hits, but it finds a perfect pairinghere, adding flying units and magic without sacrificing the tactical coregameplay. With Total War: Warhammer II, the series proves itself yet again witha more coherent campaign and exotic races that shake up gameplay on and off thebattlefield.The campaign is more focused than the original title, witheverything revolving around the Great Vortex. The faction claims it hasultimate power within its grasp, but getting there is another story. As is thestandard for Total War, half the game is played on an overworld map where youcapture territory in turn-based strategy, develop strongholds, bolster youreconomy, and put together armies. The other half takes place on the battlefieldin real time, where you smash hordes of units against enemy forces, cast epicspells to turn the tide of combat, and command your massive units to lumberinto the thick of the melee. These giant campaigns can get bogged down in thelate game when so many forces are in play, but Creative Assembly seems to havedone a decent job alleviating some  but not all  of that endgame monotony.How you choose to rise to power hinges on the four newplayable races: High Elves, Dark Elves, Skaven, and Lizardmen. These are thebiggest new additions, and the strongest reasons to pick up and play Total War:Warhammer II over its predecessor. Each race feels notably different; Iinstantly gravitated toward the sneaky Skaven, who hide their holdingsunderground. Their overworld settlement presence is masked by what appear to beruins, so your foes never know what theyre walking into. The Skaven spreadtheir disgusting corruption all over the land and must keep careful watch ontheir food stores. Corruption is a twisted double-edged sword, a weaponizedform of unrest. While corruption may result in uprisings in your lands, itspreads across the world and can cause serious problems for other players youre more prepared for it as a squabbling Skaven. Mechanics and features likethis that play into the Warhammer fantasy are executed well in fun, functionalflavor.While the other races are also enjoyable with their ownspecial features, like High Elves ability to exert influence on relationsbetween factions (turn your enemies against each other!), and the Lizardmensdinosaurs that fly into an uncontrollable rage. Nothing quite matches thespectacle of watching a Stegadon go completely insane in the middle of anopposing army  just make sure your own troops are far away when it happens. Eachrace almost feels like its own separate game, as the experiences are sodisparate, and that alone justifies this sequel in lieu of a traditionalexpansion.If youre not in the mood for the campaign, preloaded questbattles are also available, complete with full rosters of ready-to-go units.These are a great way to get a taste for the feel of battle before setting offinto the investment of campaign, and they let you play around with each raceskey units.Warhammers long legacy in gaming has found a perfectpartner in Total War. If youre a fan of strategy games, chaotic rat-men, orrampaging dinosaurs, this isnt one to miss.", "date": "Sep 28, 2017", "grade": "8.75"}