{"name": "NBA Live 18", "ref": "https://www.gameinformer.com/games/nba_live_18/b/playstation4/archive/2017/09/25/game-informer-nba-live-18-review.aspx", "text": "No manual exists for the art of rebuilding a franchise. Some teams, like the Boston Celtics, turn around their fortunes in a matter of years with smart drafting, swindling trades, and savvy free agency signings. Others, like the Minnesota Timberwolves, bumble for more than a decade before hitting pay dirt with blue chip prospects. The NBA Live series has more in common with the Wolves than the Celtics. Over the last seven years its suffered multiple cancellation and switched developers in hopes of regaining its footing. But after taking two years to hone its fundamentals and build a new RPG-driven game mode called The One, NBA Live 18 shows signs of a turnaround.Think of The One as Lives version of NBA 2Ks MyCareer  the career mode serves as a hub for a story-driven NBA experience known as The League, a single-player streetball mode called Pro-Am Tour, 5v5 online games, and daily online cooperative events that give you the chance to acquire rare cosmetics for your player. No matter which mode you play, all your actions earn experience that can be allocated to the primary and secondary skills of your choosing. The flexibility of this upgrade system is its strongest asset; it allows users to create the kinds of hoopers they want. Leveling is also markedly faster than rival NBA 2K18. You start in the 70s and can ramp up to a respectable rating quickly to use players in online competitions. This encourages the creation of alts for play online.The League and Street experiences push a light narrative forward via text conversations with friends, reporters, agents, coaches, and the like. The tale of your players rise to stardom gives the mode some flavor but isnt a big draw; EA uses this mechanism mostly as a way to create new performance goals that reward you with hype or currency.Users spend currency on reward crates that increase in diversity as your hype builds in the league and on the streets. Each crate has some mixture of apparel, shoes, accessories, or tattoos that you earn randomly. You can see the 10 items in each crate before buying, but getting the item you want is a crapshoot. To get that pair of Jordan Future Lows, you may end up spending thousands on thumb and finger wraps you have no intention of using. You cant simply buy the pair of shoes or tattoo you want until you rank way up, and then you pay a premium for the available items. Id prefer to see the crate system abolished in favor of a straightforward store that lets you buy what you want when you want. That flexibility would result in much more interesting outfits on the competitive courts as well. Right now, most players look like YMCA pick-up game players with hodge-podge outfits lacking any vision or flare.The outfits may lack creativity, but NBA Live 18s gameplay gives you all the tools you need to break ankles with sick dribbling moves. The right analog stick dribbling system is simple to use and effective; even though one of my character builds was a point scorer who specialized in three-pointers and passing, I easily broke down defenders and slashed to the hoop. If anything, the one-on-one game is too easy against the A.I. During most games I shot well over 50 percent with several trips to the line helping me pad my scoring stats thanks to the hack-happy defenders.Playing on-ball defense is another strength of NBA Live 18. Staying with a slasher is much easier thanks to a directional indicator underneath your player that tips you to which direction you should move to shut down drives to the lane.The one-on-one experience gives NBA Live 18 a great gameplay foundation to build from, and playing off the ball is strengthened with on-floor tutorials that show you where to move when another player has the ball. However, the game still needs work in other areas. Passing in close proximity could use a revamp; many of these simple dishes end up as turnovers. A.I. offenses dont always move through the stars as they should, either. I frequently saw offensive engines like Kemba Walker and Kawhi Leonard end games with minimal shot attempts. Games that go down to the wire arent as dramatic as they should be thanks to clueless situational awareness from the A.I. When a real NBA team is down by one with 19 seconds left, they dont jack up a three only four seconds into the possession.No matter which online mode I played, the servers and framerates proved stable, a refreshing change of pace from 2Ks on-again-off-again online experience. Shooting percentages are extremely high online, which I wish would be toned down to discourage ball hogging. Until EA balances the competitive experience, Live doesnt need the team creation and divisional ladders it currently lacks.Outside of The One, NBA Live 18 doesnt give hoop heads a lot to be excited about. The franchise mode smartly borrows the RPG-leveling concept from Madden, but several infrastructure problems like simming games by the week, no prospect scouting, and no draft day trade options keep this mode from being a serious destination for sim heads. I love that EA included WNBA teams, but with no mode support beyond exhibition games, it doesnt give fans a lot to do with the teams. EA also included a barebones version of Ultimate Team.NBA Live 18 still doesnt match or best NBA 2K18s deep feature set, but this year does show progress. The stable online matches, interesting career mode concept, and adequate if arcadey gameplay all point to a more promising future for EAs most struggling sports franchise.", "date": "Sep 25, 2017", "grade": "7"}