{"name": "Minecraft: Story Mode  Season Two: Jailhouse Block", "ref": "https://www.gameinformer.com/games/minecraft_story_mode__season_two_jailhouse_block/b/xboxone/archive/2017/09/21/minecraft-story-mode-season-two-jailhouse-block-game-informer-review.aspx", "text": "Minecraft:Story Mode's sophomore season tells the story of Jesse and friends as theystruggle against the seemingly all-powerful Admin. Last episode featured abreakneck pace that relied heavily on action sequences, which masked the factthat Telltale's formula is aging. This episode brings an interesting premise oflocking the crew in a zombie-infested prison tucked behind a labyrinth, butaside from a couple of standout moments, the result is a mostly forgettableentry.If lastepisode was a detour from Telltale's aging approach to adventure, this episodeaccentuates it. The repetition of being dumped into a room until you talk tothe right person or look at the correct piece of a wall has been tiresome for along time, and this episode doubles down on that concept. While Jesse's friendsare locked away as well, many of the characters you interact with in the prisonare fellow prisoners that feel like insignificant one-shots in the grand schemeof the series. The episode does a good job presenting entertaining characters,but it doesn't give me any reason why I should care about them beyond the scopeof our conversation.Most ofthe episode is spent in conversation trees, but some fun action sequencespresent themselves, as well as more free-building. However, unlike thefree-build segments from the first two episodes, I'm less confident thestructure I made will reappear in future episodes. Though JailhouseBlock is largely forgettable, I enjoyed seeing how antagonistic Jesse could getwhen dealing with the authority figures in the prison, and the back half of theepisode picks up considerably as the escape efforts mount. One moment stickswith me for giving me the most gut-wrenching choice I can remember in theseries. I don't want to spoil it, but deciding between two characters I'vegrown attached to in a situation that feels like it could have real consequencesfor the characters had me sitting on the screen for a long time, thenimmediately regretting the decision. Though that particular situation upset meas the results played out, thinking back to how Telltale usually finds a way towork around your decisions to arrive at the same destination comforted me.Regardlessof any choice (or illusion of choice), my favorite sequence in Jailhouse Blockcame at the end as Jesse squares off against a massive, three-headed ghast. Youcontrol Jesse as he autoruns across the top of the labyrinth. Though you don'thave to jump or avoid obstacles like a typical autorunner, you dodge fireballsflying your way and deflect them back using Jesse's sword. The music, the pace,and the gameplay combine to make this an entertaining moment.Unfortunately,the rest of the episode is a slog. With so much conversation with charactersthat feel like they'll be left in the past after this episode, a dreary prisonsetting, and gameplay that generally fails to engage, Jailhouse Block is theweakest entry of the season. The fleeting high moments like the difficultdecision or the climactic battle don't save the episode. However, like mostepisodes Telltale releases in any of its myriad licensed series, it ends on asolid cliffhanger that has me intrigued about what happens next.", "date": "Sep 21, 2017", "grade": "6.5"}