{"name": "NASCAR Heat 2", "ref": "https://www.gameinformer.com/games/nascar_heat_2/b/playstation4/archive/2017/09/12/game-informer-review-nascar-heat-2.aspx", "text": "NASCAR Heat 2 is more than just a sequel to last year's title. It represents developer Monster Games' return to multi-series racing  one of the things the studio was known for with 2002's Dirt to Daytona. Heat 2 includes the Camping World trucks and Xfinity cars, as well as the new multi-stage racing rules. These aspects, alongside a new rivalry system, alter the career mode but aren't a clear step forward, which is a problem for this sequel.Career modes can ask a lot of gamers. Managing players' development and juggling the financials can mean a lot of irons in the fire. Heat 2 simplifies things by stripping away the R&D aspect of your team's operation, and presenting objective-based contracts on a rolling five-race basis. Hit some objectives and you can feel your operation and race results get better. This is an easy way to let you progress without making you agonize over smaller aspects of your organization.Unfortunately, it also takes out any potential meat from the mode and makes it feel like you're on a tour of the racing series rather than orchestrating and being a part of a satisfying rise up the ranks. You earn money from race to race, but it doesn't go towards anything and is just a number to help gauge your progress. Rivalries are notched according to whom you run into on the track, but despite the many, many bump-and-runs I performed (and even outright wrecking), I didn't worry about reprisals on race day because nobody really came after me.The racing itself has its positives, but is also undercut by oddities such as cars randomly checking up for no apparent reason, inconsistent yellow flags, tire wear not being as important as it should be (even on the max setting), and being able to cut through parts of the field like butter even on the higher difficulty. The A.I. ability of cars has been a problem in many racing games through the years, from not executing smart pit strategy to allowing players to exploit certain racing lines, and that continues here.All of this is a shame, because like NASCAR Heat Evolution before it, this sequel has some good racing moments in it. There are cars throughout the field that give you a good fight, making you try different lines to work for the pass. Some even stand their ground and refuse to be intimidated by a shove or a bump. Slipping up in many situations means the other cars are going to exploit you and seize the opportunity to roar by. While there is room for improvement in this game, I celebrate moments like these.Racing online with the game is a different beast, as players can tweak cars' setups more for good lap times, which is a reason I wish Heat 2 provided some guidelines as to the effects of tweaking aspects like brake bias, springs, weights, etc. At least, this year offers more multiplayer lobby options such as flags, stages, and stability options, as well as more structure via continuous five-race mini-seasons. Along with these additions, I wish the title also included a no-collision option in multiplayer to cut down on the caution-filled chaos which inevitably happens on many tracks. The game also includes offline, splitscreen races, which is a nice feature that delivers a good sense of speed even with a full field.All of this represents good progress for the franchise, but while NASCAR Heat 2 adds racing series, rivalries, and other features, it misses an opportunity to make them meaningful and expand the actual scope and excitement of the game.", "date": "Sep 12, 2017", "grade": "7"}