{"name": "Sparc", "ref": "https://www.gameinformer.com/games/sparc/b/playstationvr/archive/2017/09/01/game-informer-playstation-vr-playstation-4-sparc-review.aspx", "text": "Multiplayer in virtual reality is one of the more attractive concepts of the still-young gaming technology. Standing in a virtual space with another person is a strange experience, more personal than talking on a headset to another player. CCP Games recognizes this and has crafted a sports game that pits two players against one another in a surprisingly intimate and fun competition that feels like it belongs in VR, but little has been put in place to keep you coming back.The disc game played in Tron, where two opponents try to hit each with digital Frisbees, is the quickest and easiest comparison to make for the rules of Sparc. Two players facing one another in a slender hallway try to hit their opponent with a ball. This ball can be bounced against the walls and ceilings, or you can hold on to your ball for a single-use shield. If you are hit by your opponents ball they gain a point. If you are able to dodge the ball (by physically moving), but it still passes through your hit zone, your opponent doesnt get a point, but their ball grows and moves faster next time its thrown.Executing a good toss right to your opponents face is satisfying, but even more satisfying is activating your shield right before youre about to get hit with a ball. Everything works well, and once I got some practice with throwing, games started to have a fun back-and-forth flow I was eager to recreate in the next match.As a virtual reality experience, Sparc is thoughtful in its execution. You dont walk or move, so you have to worry less about motion sickness, and trying to dodge and counter bright bouncing balls with your shield as they speed towards your head is an exciting experience. Even watching the game as you figuratively wait in line for your turn is interesting. You, and whoever else is on deck to play next, loom over the match in progress. From your perspective, you see a tiny version of Sparc being played in front of you. From the players perspective, giants are watching you play. The spectator aspect is weird and initially unsettling, but it does a good job incentivizing you to leave your headset on while you wait.Sparc only has a few modes, placing a lot of value on its base game. Thats a risky bet, but not an entirely unfounded one. Of its three online modes, I could only regularly find matches in the novice mode. For the advanced play, and the experimental mode that changes gameplay elements like the shape of the arena, it took much longer. To get into these, I would take off the VR headset and angle it in such a way that it was still recognized by the camera, sit to the side, and wait until someone else entered the room. This could the product of few VR players out in the world, but with little incentive to play the other modes, like more experience or money, Im sure many felt the same way I did: Why leave the crowded room to try the different rooms without a compelling reason? The admittedly small, early online community is very cordial. Something about being in a physical space together meant every round ended with a genuine, Good game! which goes a long way to making Sparc an inviting online space.Every clothing option is unlocked from the beginning, meaning I never saw the same custom character. You dont have a level you watch grow as you play, which is both good and bad; none of the customization options feel arbitrarily withheld, but the reasons to keep playing outside of simply enjoying the base game are few, which can only take you so far.The act of bouncing a ball back and forth against an opponent in a virtual space, the main hook of Sparc,is fun and it works well. After overcoming my initial shortcomings of accurately being able to throw a digital ball, I quickly began to enjoy Sparc and even work up a small sweat. Beyond the basic fun of the main game, however, there just isnt much here.", "date": "Sep 01, 2017", "grade": "7"}