{"name": "Madden NFL 18", "ref": "https://www.gameinformer.com/games/madden_nfl_18/b/playstation4/archive/2017/08/17/game-informer-madden-nfl-18-review.aspx", "text": "Fans are sometimes confused by the players NFL teams draft. Players are taken at positions the team is already strong at, while weaknesses are seemingly ignored. Fans deem some players a reach, and don't understand why their favorites weren't drafted. A coherent philosophy is not always apparent from the outside looking in. Madden NFL 18 produces a similar reaction. It plays to its competitive/hardcore side seemingly at the expense of its career-focused Connected Franchise mode (CFM), and its Longshot story mode is an entirely different kind of experience. But Madden 18 can't easily be characterized by what's on the back of the box. Underneath what seems like a collection of thrown-together or even uninteresting features is a good game whose rewards are less readily apparent.The Longshot story exemplifies this situation. This four-hour mode follows college dropout Devin Wade's attempt to get into the NFL. The story is more about provoking feelings about Devin, the Texas football environment he grew up in, and the friends that helped him along the way than it is about player freedom, skill-based gameplay, and making sure all your choices are precisely reflected in a particular ending. Gameplay consists of quick-time events (including dialog options), Devin playing QB in the normal Madden style, and some minigames. However, the excitement comes not from the gameplay, but from understanding Devin's mindset and making decisions that feel true in tense situations. By that measure, it's a success.While Longshot is an experience everyone can relate to, Madden 18's overall bent toward competitive players and Ultimate Team mode lurches the game in an entirely different direction. The grind for cards that is Ultimate Team gets even more onion layers through a leveling system, player upgrades, and team tokens. Earning more stuff to apply may sound appealing, but these additions are just more gates that contribute to the mode's already brutal grind. These don't interfere with the beginning stages of the mode, but they create card inflation. For diehard MUT players this extends the experience, but for me it's more bloat.Ultimate Team gets even more competitive through 3v3 co-op MUT Squads. Its team-based play requires the coordination of seasoned players who can run a pass route and stay focused on their roles. Get two user-controlled receivers in a bunch formation, however, and things can get sloppy. The mode has its moments when everyone contributes, but even on a good play, you're often isolated on the field or arriving late to the action (although the player switching is good), limiting its appeal.MUT Squads may not always be engrossing, but you can still reap the benefits of one of its features: the new wide receiver vs. defensive back chess match mechanics where WRs and DBs use the right analog stick to get better positioning on each other. Similarly, competitive players will love playing with the target-passing QB mechanic to place the ball where only the receiver can catch it.These are features that most people won't use, but they have value. I didn't use target passing much because keeping track of the extra cursor isn't easy, but I was elated when I threw a pinpoint bomb to the sideline. When I disrupted a WR's route long enough to cause a coverage sack while playing defensive back, I felt like I was standing on my own Revis Island. The value of these features isn't measured in the total time you use them, but in the enjoyment you get and their usefulness, so give them a try.Another thing that both hardcore and casual players can savor is the feel of the running game. It controls smoothly with just the left analog stick, and from there you can add jukes and spins, which have extra importance. Overall the game has more big runs and crushing hits than last year, particularly in the optional competitive play style.Madden 18 exhibits a split nature in other ways. The Frostbite engine adds great detail and a color warmth, but the framerate stutters. The offensive line does a great job getting to the second level and opening up more visible running lanes, but magnet tackles still rule behind the line of scrimmage. More QB incompletions occur, but some beggar belief, such as when your QB plants his feet and misses a wide-open receiver by a mile just because a defender was closing your pocket. The commentary includes added lines tying in the situational context of the game, but some of the info mentioned is wrong.As for CFM, it has its own contradiction. The mode is largely the same, but its stasis feels different because with more short and mid-length injuries, team depth is paramount. This puts a renewed importance on your scouting, drafting (which now lets you create a custom draft board), and free agency even though these areas need overhauls to import more NFL drama, user options like more complex contracts, and an expanded coaching staff to reflect the importance of a good team structure. The tweak to injuries is not the complete rejuvenation I wanted, but it provides a spark nevertheless.Madden 18 is missing a host of fixes, wishlist staples, and improvements, but it doesn't have to appease to have worth. It captures the joy that I find in playing video game football even after all these years. That's not just a love of the sport with a license slapped on it; it's the continuing refinement of gameplay and modes that still has the ability to surprise and excite.For more on the Longshot story mode, check out my primer and take a look at it in action. Also read my guide on Madden 18's Target Passing.", "date": "Aug 17, 2017", "grade": "8.25"}