{"name": "Nidhogg 2", "ref": "https://www.gameinformer.com/games/nidhogg_2/b/pc/archive/2017/08/14/nidhogg-2-review.aspx", "text": "The original Nidhogg found a creative, fun take on the fighting genre. Its acrobatic combat and aesthetic simplicity were part of its charm, which makes adding complexity without souring the experience a difficult task. Nidhogg 2 handles it well, adding substantive new ways to engage your opponent without losing what made the original a fantastic fighter. It fails to expand the scope of the series the way youd expect a sequel to, but the array of new combat options make it hard to go back to the original.Nidhogg 2 retains the back-and-forth, nimble action of the original. Two opponents fight to death for the honor of being sacrificed to the Nhggr, a godlike serpent of Norse mythology. Whoever strikes first makes a mad dash to their end of one of several, multi-screen arenas as their opponent tries to stop them. Momentum is fierce  a single kill can lead to successive victories as the loser scrambles to build a proper defense, but a single swipe of a sword can reverse the flow of a match in an instant. This makes for tense matches as evenly-matched players trade kills near a doorway, conveyer belt, or lava pit until one player finally manages to break through and advance to the next screen.Along with the tried-and-true fencing foil, jumping dive kicks, and rolls, Nidhogg 2 adds a few new tools to shake things up. Claymores dont have the forward range of the fencing foil, but their swipes are perfect for countering jump-happy opponents. Knives strike faster than any other weapon, making them perfect for close encounters. Bows are oppressive at long range, but hard to manage up close, and their arrows can be reflected. Finally, new melee attacks and slides lead to hectic exchanges as both players discard their weapons and try to kick each other to death at close range. Though knives are a bit weak, every other new weapon and trick feels strong enough that I never felt like I couldnt land a blow on my opponent somehow, even if I didnt have a weapon handy.You can also fight on several new stages, and those with names veterans might remember (like Clouds or Castle) are substantially different. The more cartoony, expressive art style is a far cry from the originals eclectic skies and minimalist tones, but the more matches I played, the more I embraced how colorfully dense and diverse each stage was. One stage has you fighting through a series of cramped jail cells, while another has several bobbing icebergs to contend with.The new options make combat much more interesting; after mercilessly skewering an opponent, you need to think about not only how youll approach them during your next bout, but also how you plan to counter whatever weapon theyll randomly be given. This adds a degree of chance, but because its in service of defense, it serves as a way to quell the momentum the winning player maintains with every won encounter. And since each match takes place over the course of several short bouts, one lucky weapon spawn wont win you the match.If you or group of friends find any weapon or tactic particularly annoying, you can opt to remove it entirely. You can also tweak other settings, such as making weapon throws your only option (or removing them entirely), disabling slides, or having each round be a single sudden-death bout. These options are a smart way to extend the life of a game; if you get bored of regular matches (or if someone abuses a particular tactic), you can play with low gravity, or with both players constantly crouching. Playing with friends or in groups is a blast, as every group develops, counters, and builds on their own specific strategies over longer sessions.You wont find much to do outside that group setting, however. The arcade mode doesnt even serve as good practice; computer-controlled opponents dont capitalize on kills, stand still for seconds at a time, and often wait for you to kill them. You cant modify the difficulty, either, which means if you can beat the arcade mode once (and you should have no problem doing so), theres little reason to tackle it again. You can also test your mettle online, though your mileage will vary. While we had matches that went smoothly, we also experienced severe slowdown on occasion.Though it doesnt add much for players looking to play around with its improvements solo, Nidhogg 2 adds layers of depth to a simple formula without breaking what made it so appealing in the first place. The new weapons and maneuvers blend seamlessly into fights, making them more dynamic and tense. Its single-player offerings may be paper-thin, but for anyone looking to test themselves against their friends, Nidhogg 2 is hard to beat.", "date": "Aug 14, 2017", "grade": "8"}