{"name": "Get Even", "ref": "https://www.gameinformer.com/games/get_even/b/pc/archive/2017/06/27/a-thrilling-sci-fi-adventure.aspx", "text": "Get Even wastes little time throwing you headfirst into the deep end. You awake in an asylum with only a cellphone on you. Your name is Cole Black but you remember nothing else. Red, a shadowy figure on a nearby television, informs you youre here for some sort of treatment that will help you regain your lost memories. However, events arent quite as simple as they seem.Get Even looks like a first-person shooter, but this is deceptive  appropriate for a story with constant plot twists and winding paths. Yes, you spend a fair amount of time shooting bad guys with silenced pistols, assault rifles, and shotguns. However, you spend just as much time solving mysteries and puzzles with your handy touchscreen phone, like tracking a targets heat signature with an Infrared monitor. You also walk around observing notes and objects in the environment, tagging them as clues. This aids you in solving not just the mystery of your missing memory, but also a larger mystery at the heart of Blacks journey that becomes apparent as events unfold. All of these elements should feel like disparate pieces from different games, but Get Evens strongest quality is how well it melds them in context. Early on in the story, in an Assassins Creed-like twist, Black starts using virtual reality headset simulations to relive memories that take place outside of the asylum  usually covert ops involving stealing technology or meeting with key targets for intel. During these segments, you can sneak past enemies or gun them down; both paths are viable and have interesting narrative consequences. Red tells Black that causing violence in memories could lead to an inaccurate recreation of the memory, ultimately affecting the accuracy of Blacks investigation of his past. During my playthrough, I was intrigued by the clues I came across, wondering what effect they would have on Blacks fate, which made the experience a gripping one.Get Evens story is a wild, entertaining, nine-hour ride through a plot featuring kidnapping, betrayal, and sci-fi gizmos. But it also features a number of heavy-hitting emotional moments I wasnt expecting, exploring concepts of human identity, love, and your responsibility to your fellow human beings. The cast of characters is well-rounded and everyone is given time to shine so that their respective motives for what they do, both good and ill, make sense. And the choices that Get Even forces you to make feel important in how they ultimately shape your character. Is Black the man he was before he lost his memories or is he a new man? Your actions determine the answer to this question but also prod at the fragile and uncertain elements that make a person who they are. All of your critical choices come into play by the games climax in a way thats satisfactory. The variety at the heart of Get Even and how well the different modes of gameplay mix is also enticing. Both shooting and stealth are fun on their own, with meaty gunplay and a variety of stealth kill animations making them stand out. My entertainment was compounded thanks to Get Evens introduction of a cornergun, which allows you to peek around any corner with your weapon and take potshots at enemies. This is a useful and amusing weapon in firefights and infiltration, and later levels use it as a great device for solving puzzles.During the investigative sequences, youre using your phones various apps to discover clues and progress. In one early segment, you come across a door locked with a key code. To retrieve the code for the pad, you have to examine nearby patient rooms, shining your phones UV light on the walls in search of scrawled math problems with solutions that give you the correct combination. These sequences are well-placed and consistently inventive, making Get Even a fantastic time where I was looking forward to whatever the game was going to throw at me next.The biggest strike against Get Even is that it trades refinement for ambition. The visuals are noticeably dated, with stiff character animations and repetitive environments (though every level is fun to explore thanks to all the narrative tidbits and plot clues littered about). While all the various gameplay segments  the shooting and stealth mechanics, the puzzle-solving detective bits, and the first-person exploration sequences  all work competently, the odd quirks are hard to ignore. There are several levels where your way forward is blocked by something that any able-bodied person could simply jump over, like a log or some crates. However, no jump functionality exists. Instead, you have to search around Blacks memory in order to find a missing clue which allows you to alter the memory, essentially zapping that obstacle from existence. I also encountered a few bugs during my playthrough, including one where Black would stop moving entirely and Id have to reload a checkpoint. This happened twice but luckily the checkpoints are generous so I only lost a few seconds of progress. These were ultimately minor issues that didnt hinder my enjoyment of Get Evens mind-bending tricks. When credits rolled on Get Even after a powerful ending, I found myself wanting to revisit the world and collect all the clues I missed to see how it would affect Blacks story. Farm 51s latest is a well-paced action-adventure title that juggles a lot of elements to create an experience that is both thrilling and unexpectedly moving.", "date": "Jun 27, 2017", "grade": "8.25"}