{"name": "Embers of Mirrim", "ref": "https://www.gameinformer.com/games/embers_of_mirrim/b/playstation4/archive/2017/06/01/embers-of-mirrim-game-informer-review-mind-bending-fun.aspx", "text": "Embers of Mirrim is a challenging platformer that will mess with your head and make you curse your inability to accurately guide two glowing orbs along a path, but satisfies in the end through its creative designs and forgiving checkpoint system. Developer Creative Bytes Studios spends too much time tutorializing new powers  leading to stretches of the game drowning in repetition  but the experience becomes a fervent delight when the training wheels are removed.Although no words are spoken and animations are used to convey emotions and intent, Embers of Mirrim tells an interesting story about two divergent clans of cat-like creatures called the Light and the Dark. The clans are summoned to a spire by a god-like entity called The Elder, who warns them of the end of days  a meteor shower that will destroy both of their colonies. As the Light and Dark retreat to their territories, fire rains to the ground, leading to an exciting escape sequence in which the player dawns the identity of Mir of the Light, a character that can sprint and glide, and a second sequence as Rim of the Dark, a more aggressive beast that can slam through obstacles. Just when it appears play time may be divided equally between these two contrasting characters  perhaps showing one overcoming the other to save its tribe  an unexpected event occurs. A magic emitted by The Spire sucks the life force out of Mir and Rim and combines it to create a singular entity named Mirrim. This new being possesses the power of both clans. Mirrim is also gifted with the ability to split apart at any time into light and dark energy orbs called Embers that can pass through obstacles and float to higher areas.Embers of Mirrim is a game with two identities: a nicely balanced platformer that revels in fast-paced precision jumping, and a challenging test of the mind that forces you to control two Embers at once using the right and left analog sticks. The game succeeds in both areas, but is at its best in the ambidextrous sequences which ramp up in difficulty, moving from the simple navigation of straight or wavy lines to dastardly areas where you easily lose track of which orb is tied to what stick. I would psych myself up and say, Dont press up on the right analog stick or youll hit the thorns. Seconds later, I pressed up. The complex design of the sequence messed with my brain that much and that quickly. I died repeatedly before I could finally free myself of a reflexive move. That may sound frustrating, but the game never punishes you much for failure. Checkpoints are liberally spread throughout this linear game, and you don't have to repeat bothersome sections if you already completed them.This platformer rarely slows in pace, and always seems to be racing toward a big moment. Light puzzles are interjected occasionally, but this game is meant to be played fast, and thats where a lot of the fun (and swearing) comes in. Almost every second and every little movement in that time is required for success. The quickness of play doesnt slow, but tedium does rear its ugly head when new powers are introduced. Most of the wildlife in the world reacts differently when an Ember passes through it, such as a frog-like creature turning into a bounce pad when the Dark hits it, or sticking out its tongue to create a path when graced by the Light. These powers succeed in changing up the flow of play, but are overly repetitive in design during the learning phase. Each of the zones, which range from forests to The Spires interior, conclude with a sizable boss fight. As menacing as these foes appear to be, they suffer the same fate as the power tutorials, and simply require repeated tactics to drop, such as evading attacks and assaulting a weakened spot when it is exposed. These encounters are fun for a few attempts, but end up being far too mechanical in design once you figure out the patterns. Embers of Mirrim is a nice surprise that seemingly came out of nowhere. It doesnt feel like a me-too platformer, establishing a unique identity with its crazy dual-movement sequences and zen-like platforming. It just needs to hold your hand less when introducing new things, which sadly affects the experience from start to finish.", "date": "Jun 01, 2017", "grade": "8"}