{"name": "Old Man's Journey", "ref": "https://www.gameinformer.com/games/old_mans_journey/b/ios/archive/2017/05/31/a-poignant-adventure-through-memory.aspx", "text": "Old Mans Journey is about an elderly man who decides to go backpacking through the countryside  an idea that might sound uninspired and dull. However, Broken Rules breathes life into its premise with a fantastic art style, emotional storytelling, and well designed puzzles that make for a great bite-sized adventure. Its compelling, and a treat for those who like well-told stories and intriguing puzzles.The titular old mans journey is presented as a series of colorful and animated landscape paintings that feature a diverse array of environments. You navigate places like a town, a harbor, and a waterfall with a point and click (or touch, if youre playing on mobile) interface. Each environment has a number of gags that you can discover by touching objects  like a cat that darts from rooftop to rooftop, or bells you can ring. These little details make every place feel even more alive, which is impressive given how each location is lovingly rendered in a beautiful art style. The stellar soundtrack also changes from scene to scene, giving each place its unique melodic delights.The puzzles are simple but intriguing. Each level begins with the old man entering the scene, usually from the left side, and having to navigate a series of hills and obstacles to get to the other. You clear the way for him by manipulating objects in the environment  usually hills and other landmasses. So you often have to pinch and drag two pieces of land until each of them is touching so the lines of each are running parallel and the old man can walk across it. Later puzzles get more complicated, with you manipulating turnwheels to create bridges or dragging down uneven tracks and bridges so that a train can get across. None of these puzzles are particularly taxing, but theyre fun to solve and even made me feel a bit powerful, as I shifted around hills and buildings like some unseen god.The core of Old Mans Journey is its mundane but emotional storytelling. The old man is not saving the world or rescuing lovers. Hes grappling with nostalgia and the future in a way thats realistic, but the presentation makes this an uplifting tale instead of a bleak one. The story is delivered wordlessly, with the old man resting at certain points on benches and ships and then delving into his memory. These memories are presented as still paintings of him as a younger man journeying back through the countryside. To say too much here would spoil the story, but these moments hit at the right time, offering a nice breather between puzzles while also building a satisfying emotional arc for our nameless character.Old Mans Journey takes around two hours to complete and makes the most of that time, showering players in an array of lovely images and sounds while also giving them some fun manipulation puzzles to solve. I left this beautifully animated countryside having felt that the journey was indeed one worth taking.", "date": "May 31, 2017", "grade": "8"}