{"name": "Tekken 7", "ref": "https://www.gameinformer.com/games/tekken_7/b/playstation4/archive/2017/05/31/tekken-7-review.aspx", "text": "Tekken 7 has been a long time coming. After releasing the game inarcades two years ago, Bandai Namco has been building up to the home versionsince, adding new characters and improving polish and balance. The finalproduct is a strong contender, offering a mostly smooth online experience, gorgeousvisuals, and clever twists on a combat system that flips between methodical andfrantic in a heartbeat. But in other ways, Tekken 7 feels like a missed opportunityand (ironically) a rush job.Tekkens core fighting system is as lively asever, emphasizing ducking or dodging your opponents attacks instead of waitingfor the right move to block. This puts a high emphasis on proper spacing,especially since moving in three dimensions can often get your opponent to whiffa move. Moving quickly around the arena requires some getting used to (be readyto dash often), and with the number of attacks any one character can perform,pinpoint button accuracy is key. This makes Tekken 7 a tough game to learn, butevery victory feels immensely rewarding as a result. Combos are important, but the jugglesystem is loose enough that if you recognize your chance to deal more damage,you can usually add a few moves to your combo, even if theyre not the mostoptimal ones.Tekken 7s changes to this formula make fights more fun. Thecamera occasionally zooms in and slows down the action when two moves are about to collide, making for suspenseful moments as you wait to seeif you won the exchange. Power Crush moves absorb multiple high or mid attacks,but are weak to throws or lows, which makes them as situational as they arepowerful. The Rage system, which previously only enhanced the amount of damagecharacters deal when they were low on health, now has two additional uses: TheRage Art acts as a super move, while the Rage Drive is more of a combo starterwith some invincibility. Both deplete your Rage, so using either presents a funrisk/reward that adds a fun layer to combat when its at its most tense.Despite this array of new tricks, Tekken 7 does a poor jobof introducing them. The story mode tells you which buttons are punches andwhich are kicks, but only provides combos that dont work elsewhere and doesntdelve into wall combos, how different attacks interact, or what Rage or RageDrives do beyond mentioning you can use them. This means new players should expectto spend their first few hours poring over move lists in training mode oronline just to see what characters are capable of. This wouldnt be such aproblem if characters didnt have an enormous amount of moves (some start to close in on 200) to sift through. You wont find a fun, comprehensive learningcourse like Tekken Tag Tournament 2s Fight Lab here.Curious fighting game players making the jumpfrom 2D to 3D may find a comfortable pick in Akuma, who crosses over from StreetFighter. Akuma retains most of his moves from his home series, including a few staple combos. His Gohadokens arent as effective against fighters whocan move in three dimensions, but if youre familiar with other fighting gamesand want to learn Tekken, he should be your go-to early on, though it willstill take a bit to learn the ins and outs of fighting regular Tekkencharacters.Stick with the steep learning curve and Tekken 7 gives you reasonsto keep playing. A new Treasure Battle mode lets you unlock dozens of fun itemsto dress characters up in, including pieces of new outfits, knives, andinflatable heads. Customizing my King to wear a pizza on his back and have afish floating around his head was a fun incentive to keep playing, even ifTreasure Battle is little more than a series of fights against easily exploitedcomputer opponents.Tekken is also known for its zany storyline and absurdcharacters, but Tekken 7s is hit-or-miss. Heihachi and Kazuya Mishima havethrown each other off cliffs for years, and Tekken 7s three-hour story modehighlights their long-running feud. The focus on their rivalry leads to someinteresting revelations about all the cliff-throwing, but the plot moves tooquickly to let any moment linger, making the entire story feel rushed. Acharacter is nearly beaten to death in one scene, only to immediately recoverand plan a new strategy in the next. The plot also foreshadows a few developmentswithout following through on them, which left me unsatisfied once the story wasover. Akuma, who makes an imposing mark onthe Tekken universe without feeling too out of place, steals the show.Tekken is as well known for its outlandishone-off stories as it is its overarching plot, but these stories, too, feeltruncated. Rather than place them at the end of the arcade mode, theyreslapped onto the story mode as character stories, which consist of a textintro, a single two-round fight, and a short cutscene. Some of theconfrontations between new characters like Lucky Chloe and veterans like EddyGordo lead to some fun moments, but they arent as fun or interesting as inprevious entries.Tekken In VRTekken 7 includes two PlayStation VR-compatible modes, but neither is worthwhile. The VR model viewer lets you view your custom characters in VR, but it all takes place on a virtual screen rather than in a full 360-degree environment, which takes away from the novelty. You can also battle a computer opponent on an empty, moonlight lake surface and move the camera angle around with the left analog stick. These modes dont add much to the experience and you can safely ignore them.Online, you can expect the standard ranked, player, andlobby modes, as well as a tournament system that works fairly well providedyou have the patience to wait for four to eight players to join a lobby. The onlinehas worked fine in my experience, though fights with international players havebeen spotty. You can tinker around in training mode with a pre-selectedcharacter between matches, which prevents counterpicking before the fight. Theranking system emphasizes progression over points (you can get promoted to thenext rank even if you lose a match), which eases some of the pressure of playingfor keeps. The big omission is replays, which means you cant improve bywatching your own matches, or learn from higher-level players.Tekken 7 does a good job of bringing the franchise up tostandard on the current round of consoles. Though it falters in its story modeand getting new players in on the satisfying thrill of dodging your opponentsattack and hitting them with a round-ending combo, it offers enough incentivefor experienced players (or those willing to stick out the initial rough patch)to keep playing. The online works well enough that regular players should have enough of a reason to learn the deep combat system and get ready for the nextbattle.", "date": "May 31, 2017", "grade": "8"}