{"name": "Pokmon: Magikarp Jump", "ref": "https://www.gameinformer.com/games/pokmon_magikarp_jump/b/ios/archive/2017/05/26/pokemon-magikarp-jump-game-informer-review.aspx", "text": "Pokmon Go proved that mobile platforms are a viable (and probably even preferred) home for the pocket monster collecting franchise. Magikarp Jump is the newest Pokmon game to release on mobile devices following Go and Duel, and shows The Pokmon Company is keenly aware of the experiences mobile players gravitate towards, for better or worse. Mostly worse.In Pokmon: Magikarp Jump, you play as a trainer in some hidden corner of the Pokmon world where people are obsessed with training Magikarps exclusively to jump as high as possible. Trainers compete to see whose Magikarps can jump the highest and if their orange fish cant compete, they force them into early retirement and go get a new, hopefully better, Magikarp.The games loop exposes itself quickly. You keep your Magikarp in a tank and tap on food as it appears. This adds to its Jump Power (JP), which dictates how high it can jump. You can also grow its JP with randomized, unlockable training regimens that involve watching your Magikarp hit its head against assorted objects like trees, punching bags, or a Dwebble (the hermit crab Pokmon). Save for tapping food, none of these games involve any engaging interaction. The training games are just boring, passive moments of watching stilted Magikarp animations and hoping you get a decent amount of JP for the act.Once youre satisfied with your JP, you can head to the League to pit your Magikarp against other characters, earning trainer badges as you make your way through the campaign. Much like the training, there is no substantial gameplay here. You simply press the jump button, and hope for the best, which is dull and not particularly rewarding when you win. Losing one of these competitions means you must wait over an hour to try again. Thankfully, losing is rare, and youre free to continue training during that time. Alternatively, if you lose with a max level Magikarp or it acquires a badge, it retires and its time to start fresh with a new Magikarp. Having to start over has the potential to be frustrating, but I didnt mind when it was time to move on.New Magikarps level faster than the previous, and each subsequent fish is able to achieve a higher level. This part of the game, I liked. Your old Magikarps hang out in the background of the tank serving as a reminder of your past achievements and watching the new fish level higher and faster than the previous is rewarding.Magikarp Jump doles experience out at a steady pace, so it took a long time before I considered looking at the available microtransactions. This bodes well for the game, but even if there is nearly always activity to do without having to wait too long, it doesnt mean I enjoyed doing them. Training is boring; the jumping competitions are boring; and having to click through the dialogue of the guy who cant tell if I am a boy or a girl who gives me a handful of coins is incredibly boring. The lack of interactivity sometimes makes it feel like a visual novel, but without any real story. The bits of enjoyment I did draw from the game were based mostly on the goofiness of the silly premise, but repeating jokes only makes them less funny.", "date": "May 26, 2017", "grade": "6"}