{"name": "Tales From The Borderlands: Episode 5  The Vault Of The Traveler", "ref": "https://www.gameinformer.com/games/tales_from_the_borderlands_episode_5__the_vault_of_the_traveler/b/pc/archive/2015/10/30/tales-from-the-borderlands-episode-5-review-game-informer-vault-of-the-traveler.aspx", "text": "The final episode of Tales From The Borderlands is here, andalong with it Telltale's last chance to transform the series' meandering andirrelevant narrative into a meaningful journey. The first three installmentsfelt like an uninspired slog, but Episode 4 slowly won me over and laid a solidfoundation for a satisfying conclusion. The Vault Of The Traveler delivers onits predecessor's promise with a steady pace and deft execution that hasn'talways been present in the rest of the series.The Vault Of The Traveler shrugs off the previousinstallment's cliffhanger ending in its opening minutes. I've gotten used to theselife-or-death scenarios being effortlessly diffused; the lack of meaningfulchoices has made Tales From The Borderlands' emotional trickery even moreobvious than Telltale's other adventure series, diminishing the overall impactof supposedly important moments in early episodes.However, the finality of this episode imbues the tale withsome much-needed narrative freedom. No more stringing along players toward thenext installment or worrying about long-lasting choices  not that there were manyto begin with. Even though much of the adventure has been lackluster, Telltale managedto introduce a host of interesting characters, and has slowly built theirpersonalities up enough to care about them by the end. Your final interactionswith Handsome Jack are particularly moving, even if your hands are tied formost of it and your last choice is merely symbolic.Telltale also saved its most novel and interesting choicefor the closing episode: In addition to the core characters of the series, youpick from several secondary characters to join the crew for the final mission. Whetherthose characters are available depends on past choices, though myrun-of-the-mill decisions were enough to unlock most of them. Regardless, thisMass Effect 2-style showdown allows you to catch up with some familiar facesand pick your favorites, getting the gang back together for one last adventure.After having much of the party scattered in the previous episode, this unity ismuch appreciated and bolstered my enthusiasm for the last hoorah. The action culminates in a creative and appropriately epicboss fight that rights a lot of the wrongs of the series: The crew's multi-stepplan makes sense (in an insane way), the stakes feel genuine, and even thequick-time event sequences come together. Your choice of characters isn'thugely important, but it makes the fight feel customized and delivers a satisfyingclimax.In the aftermath, Telltale treats players to a prolonged andpoignant ending. Characters say their goodbyes and discuss what's next,allowing their personalities to shine one more time. The ending  and the fifthepisode in general  reminded me why fans still like Telltale's adventures somuch. Tales From The Borderlands got off to more than a slow start, and while TheVault Of The Traveler doesn't redeem the entire experience, it justified mydecision to stick with it. The embarrassing (and yet somehow repeated) firewallminigame reaffirmed Telltale's uninspired stumbles with the series, as does theultimately meaningless reason you've been collecting loot all this time (whichis also promptly negated by the story). I never cared about the vault, but theend proved that the treasure was never the point. Tales From The Borderlandshas all been about the journey, and while far from perfect, the final twoepisodes made me glad to have undertaken it.", "date": "Oct 30, 2015", "grade": "8"}