{"name": "Armikrog", "ref": "https://www.gameinformer.com/games/armikrog/b/pc/archive/2015/10/05/armikrog-review-game-informer.aspx", "text": "When some of the creators behind the 1996 point-and-clickadventure game The Neverhood regrouped on Kickstarter to make a spiritualsuccessor, fans of the cult hit happily ponied up almost one million dollars tofund the project. What they got for their money is a sterling example of anage-old adage: Don't judge a book by its cover. Armikrog's unique art style ischarming enough to draw players in, but once you crack it open, you find pageafter page of problems and disappointment.Armikrog tells the paper-thin story of a spacefaringexplorer named Tommynaut and his angular doglike creature Beak-Beak, who takerefuge in the titular alien fortress after crashing on a mysterious planet. Theopening minutes aptly highlight Armikrog's chief appeal; the zany characterdesigns and clay dioramas that you explore are unique, beautiful, and drippingwith creativity. The visuals aren't all that's readily apparent, however. Armikrog'smany flaws immediately start to sour the adventure.Even by '90s point-and-click adventure standards, Armikrogis archaic. It provides zero explanation of your objectives, the controls, oreven that you can switch between the main characters  a fact I only realizedafter inadvertently clicking on Beak-Beak. The objects that you can interactwith in the environment aren't highlighted or indicated in any way, which isespecially problematic when everything is made out of clay and objects blendinto the surreal and alien scenery. If you do click on the right object buthaven't met the unexplained requirements to interact with it, there's noanimation or dialogue to indicate what's wrong. Try to click on a button thatisn't powered, for instance, and your character won't even attempt to press it.These problems are further compounded by the fact that there is no inventoryscreen  Tommynaut just sticks any object that you pick up into his stomach,with no way for you to view what it is or what it might be used for. All you cando is click on every object you come by, and if Tommynaut has the right item(and it's the right time), he uses it. Throw in some strangely inconsistent detection,and you have the perfect recipe for getting stuck.And get stuck I did, usually for stupid reasons. At onepoint, my progress was stymied because I had to speak to a strange mushroomcreature. Nothing indicated that I had to speak to said mushroom creature  orthat said mushroom creature was something you could even interact with. In fact,I had actually already clicked on the fungal beast before  but to trigger theconversation (which would miraculously award me with the MacGuffin I needed toprogress), I had to be controlling Beak-Beak, not Tommynaut. These issues comeup repeatedly  especially buttons that arbitrarily need to be pressed by a specificcharacter. In addition to suffering from some of adventure games' worstaspects, Armikrog is also missing what the genre does best. With fewexceptions, the puzzles are dull, repetitive, and rely heavily ontrial-and-error. Three main puzzles  a tile-sliding puzzle, a musical mobilepuzzle, and a rotating path puzzle  are all repeated multiple times, andbecome progressively more tedious with each iteration. Even the firstencounters with these challenges aren't interesting or clever in the slightest.They only serve as time-consuming filler (along with extensive back-tracking) topad out the roughly five-hour adventure.Armikrog's puzzles are disappointing, and the story wastesno time in dropping the other shoe. Despite the unique character designs, themain characters lack personality, aside from Beak-Beak's annoyingly hammyvoice. Not that the rest of the story has much depth, either  most of it istold in the opening cutscene, and the conclusion to Tommynaut's quest left meshrugging my shoulders. The most interesting story info is relegated to amassive text dump in a single room, where you can read a novella's worth ofbackstory on who built the Armikrog. It just feels lazy.That's not the only part of the experience that feelsunfinished. The game uses the standard Windows mouse cursor, which sticks outfrom the lush, colorful environments you click around. Numerous bugs plagued myplaythrough. The sound effects cut out on several occasions, requiring me toquit and re-open the game each time. At one point, a character randomlyreappeared in a room he wasn't supposed to be in, and later spoke in anotherroom when he wasn't there. The subtitles often differed from the spokendialogue  at least until they inexplicably disappeared for about a quarter ofthe game.The piece de resistance, however, came in the second-to-lastchallenge. The cypher I needed to solve an uninspired hieroglyph puzzle was ina room I no longer had access to. Even if I had been clairvoyant enough towrite the ambiguous clue down beforehand (in a notebook, of course, because thegame lacks any kind of system for saving or remembering clues), solving thepuzzle would still have involved backtracking through the entire game to retrieve the corresponding answers from differentlocations. If it hadn't been for some good Samaritans in Steam's forums, myprogress would have been permanently halted. Once I solved the last puzzle, Iwas treated to the final, anticlimactic cutscene. The audio was out of sync.Pencil Test Studios clearly needed time to fix the litany ofembarrassing bugs that plague Armikrog at launch. Even then, it wouldn't have helpedthe overly simplistic story and bland puzzles. If the developer ever plans ondoing a sequel, I hope it's an animated film  the visuals are the only thingArmikrog has going for it.", "date": "Oct 05, 2015", "grade": "4"}