{"name": "Tony Hawk's Pro Skater 5", "ref": "https://www.gameinformer.com/games/tony_hawks_pro_skater_5/b/playstation4/archive/2015/10/02/game-informer-tony-hawks-pro-skater-5-review.aspx", "text": "The premise of bringing back the Tony Hawk series' old-school gameplay has been tougher than it may have seemed to Robomodo, Activision, or even fans. I loved the early titles back in the day, but even such a seemingly airtight premise as an update to what has already been successful is not enough. So much has happened in the intervening years in gaming in general that I want more than this title delivers, which at best is an approximation of the series' gameplay couched in an unimaginative framework.At times Tony Hawk 5 easily reminds me why I played so much of the series when it debuted. Tricks effortlessly fly off my fingertips as I build crazy combos on the back of whatever surface I can find. I don't know how much skating tricks have evolved in the real-life scene since the series' heyday, but you won't find yourself at a loss for self-expression even though skaters' trick sets are locked to that particular person.The levels accommodate your imagination, containing long lists of gaps to find and conquer, new twists to familiar levels like the Warehouse and School, and runs that need to be deciphered and mastered. While larger than many of the original levels, the ones in this title are well constructed, offering options from moment to moment whether you love to grind, flip into manual, or get air. Many of the levels have power ups you can use  my favorite being the double-jump wings that let you access and grind varying levels of the rooftop map. Players can also make their own levels with a variety of objects. These can be plenty large and fans have already re-created the first game's classic Warehouse as well as their own original spaces.The game's reality, however, constantly reminds you that this isn't the Tony Hawk you remember. Inconsistent framerate, textures that pop in, and physics quirks that launch you into the sky mar the experience regularly. I honestly find the latter hilarious if it occurs when I eat it after failing a trick, but they can also occasionally happen when simply trying to execute a move at the top of a ramp. As annoying as these bugs are, the game has fundamental design problems on its plate.I disagree with the decision to let players glom on to practically any nearby rail, even if your momentum is carrying you in a different direction or you're in mid-trick. I don't expect real-world physics, but it takes some of the skill out of the game when you can save yourself from failing a trick by hitting triangle/Y button and hope you catch the nearest edge. Robomodo's Tony Hawk's Pro Skater HD had this same too-forgiving rail detection, and I'm disappointed it hasn't improved.While THPS 5 doesn't feature perfect gameplay, what's just as unfortunate is that the progression system wrapped around it doesn't inspire. The freeskate objectives of finding the SKATE letters or the hidden tape give you points to upgrade your skills and encourage you to explore the levels, but the broader missions (which you have to do well in to unlock the next level) grow old quickly. Their basic template is repeated and adapted in each level, which means you're going to always be racing through hoops, finding items and returning them to a specified location, grinding/manualing for as long as possible, etc., no matter where you are. I actually liked a few of them, such as doing tricks on a timer to avoid having your head explode, but it all wore thin quick.The online modes also fail to build to anything meaningful. It's easy to party up and play games like King of the Hill against friends or invite whoever is near to a quick session, but there is really only one leaderboard  despite the fact that the game keeps track of numerous individual stats. Even among friends, the online functions don't spur that feeling of, ~Hey, let's skate in this world and see what crazy stuff happens!~ For instance, competitor Skate used to encourage players to spontaneously create challenges in the world or dubiously rack up Hall of Meat biffs for points. This allowed a normal session to become something else through skaters' own ingenuity. From a technical standpoint, online players will blink out or warp across the level, which makes it difficult to follow another person to see what they're doing, further breaking that feeling of togetherness.After playing THPS 5, I have renewed respect for the struggles of Tony Hawk's previous developer, Neversoft, as it tried to evolve the series away from its beginnings. Apart from tightening up its gameplay, Tony Hawk 5 begs for a direction. It's clear that making a game that simply tries to capture the good times in a new setting isn't enough, even if it did nail the gameplay. The gaming landscape has changed a lot since the series heyday, but this title is stuck in a no-man's-land between not being good enough to replicate the past nor ambitious enough to move the franchise forward.Limited CustomizationTony Hawks Pro Skater 5 doesnt let you create your own skater from scratch, but you can customize the existing skaters. As you progress, youll unlock heads, bodies, and boards for your skater, and mixing and matching these is how you make your skater look how you want  even if it means playing as Tony Hawk, although youve put another persons head on him. Regardless of how your skater looks, they will always share the original pros trick set. This cannot be changed.This review pertains to the PlayStation 4 and Xbox One versions of the game. It also appears on PlayStation 3 and Xbox 360, but without online capabilities.Check out Brian and Ben playing the game in our new episode of Test Chamber.", "date": "Oct 02, 2015", "grade": "6.5"}