{"name": "The Beginner's Guide", "ref": "https://www.gameinformer.com/games/the_beginners_guide/b/pc/archive/2015/10/01/searching-for-answers.aspx", "text": "What can you know about people by looking solely at their work? That's the question designer Davey Wreden poses in the opening minutes of The Beginner's Guide, his first game since 2013's clever and thought-provoking The Stanley Parable. Whereas the previous title focused on challenging player agency with humor and irreverence, Wreden's newest creation extends well beyond the purview of video games, tackling serious human issues and emotions in a wholly unique way.The Beginner's Guide starts on a stark white screen with Wreden's voice introducing himself to the player and explaining his intent for the game: to walk through a series of short experimental games made by his friend Coda, in hopes of understanding who he is and why he mysteriously stopped creating projects a few years ago. Wreden is your disembodied steward throughout the experience, loading up new games at a steady pace, skipping you through broken or boring elements, and providing background information on his relationship with Coda.Wreden continually goads you with a series of observations and questions. Why did Coda add a gun to a sci-fi game that doesn't contain any enemies to shoot? Why did he hide an endless maze of corridors that you'll never see or explore? Wreden serves as a catalyst to get you thinking less about the games and more about the designer. The presumed psyche of a developer is an enticing rabbit hole to dive into. Unlike reading an author's book or watching a director's movie, you can actually walk around in these brief-yet-potent creations, fully immersing yourself in the sights, sounds, and (admittedly minimal) interactions.Wreden's narration also establishes a casual and strikingly honest tone, going so far as to provide his contact info. But Wreden isn't breaking the fourth wall  the barrier between designer and player never exists, and the line between fiction and reality is never clearly drawn. You're encouraged to make a lot of assumptions about Coda's thoughts and motivations as you play, but Wreden slowly ensnares himself in the speculation, raising more questions. What's his real motivation for walking you through these abstract creations  or for creating The Beginner's Guide at all?Don't expect to be given any concrete answers to these questions. The Beginner's Guide is a guessing game of contextual analysis, and Wreden's attempt to figure out his friend's work is a messy process. Making sense of the larger picture is even harder, and lies squarely on your shoulders. If you're looking for someone to eventually provide an explanation of what's ~really~ going on, you'll be sorely disappointed. I came to my own conclusions by the time the credits rolled, but am I sure about them? Absolutely not.The Beginner's Guide addresses a lot of heavy issues in its 90-minute journey: Depression, loneliness, self-doubt, and the need for validation are but a few of the topics touched upon. Despite the inherent veil of fiction, Wreden's narration is well-written and feels honest. At the end, you're still left with the initial question: What can you know about a person by looking solely at their work? I'm not sure there is an answer, but trying to find it is a thought-provoking experience.", "date": "Oct 01, 2015", "grade": "8"}