{"name": "Animal Crossing Happy Home Designer", "ref": "https://www.gameinformer.com/games/animal_crossing_happy_home_designer/b/3ds/archive/2015/09/24/animal-crossing-happy-home-designer-review.aspx", "text": "Animal Crossings carefree brand of life simulation has attracted a loyal following, as well as people who look at it from the sidelines and wonder what the fuss is. Ive enjoyed the series since its GameCube days, and I like its loop of slowly improving your characters life through patience, dedication, and long-term play. I find something irresistible about an alternate world that I can check out, day or night, with a cast of friendly NPCs that go about their own little routines  simple as they are.Happy Home Designer goes all-in on one of the main series activities: the ability to personalize houses with furniture, wallpaper, flooring, and assorted knick-knacks. To be clear, this is a spinoff from the main franchise. You dont send or receive letters, run errands, or even walk around freely in your town. Instead, everything you do funnels into the home-design element. That focus comes at a tremendous cost, in terms of a sense of progression and overall attachment to the world.In the past, players earned items to outfit their own homes by purchasing pieces, finding them out in the world, or getting gifts from neighbors. Now youre taking those skills and going pro. Tom Nooks latest enterprise is a home-design outfit, and as luck would have it, hes hiring. Players who felt constrained by this steady drip-feed of content in other titles should know that since its the client whos footing the bill here, you are not restricted by money, so the skys the limit. But, be careful of what you wish for.The main loop revolves around talking with clients about what they want, finding a location for their project, and then decorating the space with items instantly pulled from a large, ever-expanding catalog. Clients provide a few of their favorite decorative elements to spur your creativity, but for the most part youre entirely on your own. As you gain experience, youre able to provide basic landscaping services, and build schools and businesses for your burgeoning community. You can only decorate one house per day, but advancing time is as simple as sitting at your desk and saving your game.A client may tell you that she wants a fruit-themed house or a caf-like environment for lunching, but their actual needs are far less stringent. Someone who demands blue from floor to ceiling is just as happy when you use pink, instead. I did everything I could think of to trip up my clients, and nothing worked. Indoor mazes made from trash bags, rooms filled with globes and skeletons, a caf with toilets for chairs  nothing elicited anything less than complete glee from the customer. Im not expecting an incredible challenge in an Animal Crossing game, but the complete lack of critter criticism saps the fun out of the game. You get the same results for spending 20 minutes poring over the games catalog of items and finding the perfect complementary pieces as you do simply walking in, tapping on the boxes containing any mandatory household items, and immediately saying, Jobs done.Everything comes too easily, which ruins one of the things I most enjoy about Animal Crossing. I loved collecting the old NES games on GameCube, because they were tricky to acquire. If you wanted to decorate your house with a Mario theme in New Leaf, you had to build up your collection piece by piece. Here, you have unfettered access to everything. You dont have to make any trade-offs or compromises, since everything appears to be free. Perhaps this is another one of Tom Nooks company towns, and everyone who lives here is an indentured servant with tens of thousands of bells in debt. Regardless, filling a home with the finest matching decorations doesnt offer any kind of reward or incentive to bother trying. The Happy Home Academy, which rated your houses decor in past games, is curiously absent this go-round. Instead, Nintendo has farmed it out to the community via a day-one patch that allows you to upload your creations online. There, your fellow decorators can rate your work. They cant visit your town, since there isnt really a town to visit. Instead, they can look at what you specifically choose to upload.At least the act of decorating is mechanically easier than its ever been. Since you arent worrying about your characters inventory, the touchscreen is devoted to a floorplan of the house, and you move, rotate, and stack things around a grid with a touch interface. Its much more intuitive than pulling bookcases from your pocket and manually moving them around your room. You can also tweak elements like rugs, windows and doors, and ambient sounds. Id love to see a similar setup in the next inevitable entry in the main Animal Crossing series.You can import characters into the game using Amiibo cards, but these characters dont offer anything special. They have the same boring requests, and are just as pleased with whatever it is that you end up doing for them. With the exception of a few special cases such as Tom Nook and Mr. Resetti, the cards offer a shortcut to unlocking characters that would eventually wander into your town otherwise.Oddly enough, you arent able to decorate a home of your own. You have to live vicariously through your clients as you apparently live out of a car. Happy Home Designer may be fun for people who are ravenous over home design, but without the additional Animal Crossing elements, I never felt like I was putting down any serious roots or working toward a larger purpose. Instead, it was like living in a community of overeager pre-school instructors, who think everything you do  no matter how mediocre or half-baked  is absolutely wonderful. You can visit your clients after, and touch up their homes with new items that youve unlocked, but you teleport there in a menu; theres no free roam in the village.One of the more memorable Twilight Zone episodes focuses on a young boy who is able to do unspeakably horrible things using only his imagination. Everyone in his community lavishes praise on him, knowing that anyone who upsets Anthony is taking a dangerous risk. After spending time with Animal Crossing: Happy Home Designer, I felt like my villager had a similar hold on his town. I couldnt turn anyone into a jack-in-the-box or give them a cornfield vacation, but no matter what decorative monstrosities I unleashed on the townsfolk, everything was just fine.", "date": "Sep 24, 2015", "grade": "5"}