{"name": "NHL 16", "ref": "https://www.gameinformer.com/games/nhl_16/b/xboxone/archive/2015/09/15/nhl-16-review.aspx", "text": "After a brutal new-gen console debut last year that suffered from underwhelming gameplay, missing modes, and a general lack of creative vision, developer EA Canada needed to come out strong this year to prove it still has what it takes to make a relevant hockey game. With improvements in nearly every area, NHL 16 is a positive stride in the right direction for the franchise, but like a defensive-oriented team adopting trap tactics, the series plays it safe and lacks any game-breaking quality. The uptick in performance is primarily notable on the ice. The opposition A.I. went to coaching camp this offseason, tightening up its game with decisive puck cycles, better positioning, opportunistic offensive strikes, and quicker sticks that disrupt shooting and passing lanes. Expect to get hemmed in your own end more frequently when playing on All-Star/Hardcore difficulty settings. The same tactics that worked last year generate the most scoring chances, but greater diversity of deflections and more realistic rebounds creates more put-back opportunities at the goal mouth. Authentic touches for local arenas and a more natural performance from play-by-play man Doc Emrick provide the ornamentation for the improved puck play.  This may be the best-playing NHL title in years, but the franchise still has some flaws in need of fixing. Despite EA touting an improved puck pickup system, I repeatedly saw baffling reactions to passes. Players looking directly at the puck sometimes turn away when the pass starts coming their way, and other times fail to notice that the puck is at their feet, making no move to gain possession. Loose puck awareness from A.I. teammates is also frustrating in the offensive zone. The nearest player can fail to realize hes got a great chance to play the puck, resulting in a lost scoring opportunity. Checking could use more fine-tuning as well. Players lose their balance and fall to the ice too often when getting hit from behind, and those who get checked to the ice can sometimes get up and retrieve the puck faster than the defender can make a play. Board play in general is lacking, and the game also needs work with jostling in front of the net. This is especially noticeable when you are guarding the crease with a defensemen in the revamped EASHL.Back from a one-year hiatus, the popular six-on-six online mode returns much improved thanks to a new player class system that ditches the upgrades and boosts from last year. Instead, before starting a game you choose a player type from a balanced pool of common hockey archetypes like sniper, power forward, and grinder. This eliminates the seven-foot-tall danglers who you could never knock off the puck you constantly saw online and instead places the emphasis on team play. The simplistic progression and badge awards offer some incentive to keep playing, but the mode would benefit greatly from a deeper system that promoted achieving a greater array of career and game accomplishments, the ability to track your teams in-progress game from the waiting lobby, and greater team customization.The other modes all got better with a year of conditioning, but do nothing to rise above serviceable status. Be A GM boasts a new player morale system that gives you more to think about while managing your team, but it currently lacks the depth and influence of other sports games. In the NBA 2K series, you outline a players role and anticipated minutes during free agency and at the start of each season. Should you fail to give them this type of role, then players get upset. If matters dont change, they will walk in free agency no matter how much money you throw at them. In NHL 16, the complaints are much more random and inconsequential. A third-line center or aging player may complain about ice time even though there are clearly better players in the team pecking order. Disgruntled players may request a trade, but inexplicably still are willing to sign a new contract with you.Morale aside, Be A GM checks all the boxes of a typical franchise mode  trades, free agency, scouting, and the entry draft  but it still feels hollow. The ugly activity feed doesnt make you feel more invested in the league, and with no GM tasks to complete you dont have much to manage outside of the basics. You still cannot re-sign players to new contracts during the season, which may be why there is hardly any major shakeups at the trading deadline. The inflated ratings that place every NHLer in the 80-90 range kills player differentiation, and a scouting pool that gets too shallow after the first year are some of the other problems that keep this mode from rising above its average status.Be A Pro suffers a similar fate. EA Canada revamped this single-player mode that puts you in the role of an up-and-coming NHLer with a new progression system that rewards you more directly for your on-ice accomplishments. If you score a lot of goals, for instance, your shooting accuracy will improve. However, the mode is still hampered by questionable coaching logic that punishes runaway success early in your career. I tallied five goals and an assist in my first game as a pro, which earned me a demotion to the second line. In the second game I got three more points and a great overall grade, but yet again the coach kicked me down a line. No coach would do the same to a real player with that hot of a debut. Off the ice, the mode lacks the artifice that would make it feel more like you are a true NHL player. With no player interaction, coach meetings, general manager relationships, or fan interaction, all you are left with is the game-to-game experience.Online versus, Hockey Ultimate Team, online shootouts, a season mode, a playoff mode, and NHL Moments Live rounds out the standard EA Sports suite, though none of these are destination experiences.Like a third-line grinder, NHL 16 does most of the little things right. The improved on-ice play make this a hockey game a viable option for puckheads, but the lack of mode depth and standout features ultimately keeps this years installment from earning more ice time.", "date": "Sep 15, 2015", "grade": "7.5"}