{"name": "Mad Max", "ref": "https://www.gameinformer.com/games/mad_max/b/xboxone/archive/2015/08/31/desert-sessions-in-repetition.aspx", "text": "Hot on the heels of a strong cinematic comeback with the blockbuster hit Fury Road, Mad Max is hitting the asphalt for his first video game since the long-forgotten 1990 NES title. After years of rumored stops and starts, Warner Bros. tapped Just Cause veterans Avalanche Studios to meld its signature brand of open-world chaos to the beloved sci-fi series. Like the Spartan source material, the video game adaptation of Mad Max is heavy on caricature and light on plot development; don't expect to find a compelling narrative in this barren wasteland. Instead of mimicking one of the film plots, Avalanche charts a new direction, forgoing the Mel Gibson and Tom Hardy interpretations of Max for its own version that still stays faithful to George Miller's dystopian vision. This Max is again a man of few words and basic motivations. Cruising toward the Plains of Silence, his trek is interrupted by Scabrous Scrotus, the son of Fury Road villain Immortan Joe and ruler of the oil-rich city-state Gastown. Scrotus steals Max's beloved Interceptor, for which Max buries a chainsaw in the hulking warlord's skull before being stripped of all his possessions and left for dead on the side of the road. Soon after, he meets a Gollum-esque hunchback named Chumbucket. This car-worshipping sidekick believes Max to be a saint, and lends his mechanical talents in hopes of Max leading him to salvation. Max has other designs: finishing what he started with Scrotus and getting his car back. The open-world Max navigates is inhospitable and predictably singular in nature. Avalanche Studios has done an admirable job of trying to give each wasteland region a signature quality, from wind-swept sand dunes and rocky vertical spaces to hilly junkyards and crumbling remnants of highways. But even with the gorgeous skybox injecting color into the world and violent sandstorms breaking up the monotony of the environment, you ultimately can't escape the fact that a desert is a desert. Don't expect to do much on-foot navigation of the mountainous regions given the lack of an adequate climbing system. Most open-world games of this generation and last solved the problems of terrain traversal, but Max still can't clear knee-high obstacles or vault up climbable objects unless he finds the predetermined point of interaction.This monochromatic landscape is sparsely populated by caricature villains, self-serving stronghold leaders, and random wastelanders who rarely develop defining characteristics beyond the flimsy veneer of mohawks and bondage gear. Max only interacts with these personalities when he has something to gain  whether that be access to weaponry, car upgrades, or information he needs to find Scrotus.Despite its post-apocalyptic setting, Mad Max's open world is more Far Cry than Fallout. Each region of the map features a hot-air balloon station that, once visited, reveals points of interest in the area (read: Far Cry's radio tower). These include enemy bases waiting to be infiltrated, convoys available for ransacking, desert races, and scavenging locations hiding the various collectibles. As you complete these side missions you weaken Scrotus' power over the region, earning you the praise of the local stronghold leaders and unlocking various upgrades.Metal scraps are the predominant form of currency in the wasteland, which Max can find in enemy bases or earn by taking out the vehicles of roving marauders. Scraps funnel into the robust upgrade systems for Max and his car. Spending the currency on Max transforms him into a brutal killing machine with improved attack strength, a better shotgun, and new combat moves. Car upgrades also vie for the same pool of scraps, allowing Max to improve its speed, handling, defense, and attack options. Early in the game both systems provide adequate motivation for tackling the various side missions, but as Max becomes more formidable and the side quests begin to feel repetitious, they ultimately lose their allure.Upgrading strongholds is useful for cutting out the tedium of performing basic tasks. Max never takes ownership over these bases, but by finding project parts hidden in various looting locations, you can improve facilities to impart bonuses like filling your car with gas, replenishing your health, and restocking your ammo each time you visit the stronghold. The best upgrade (which you should get immediately for each stronghold) removes the need to get out of your car to collect the valuable scraps after road battles, which saves precious time.Given the antagonistic nature of wasteland inhabitants, vehicular combat is a constant. Scrotus' legion of War Boys cruise the land spoiling for a fight, and though the sluggish controls can be problematic (especially when it comes to racing or navigating tight passages), these high-speed encounters are fun given the weapons at your disposal. Max can ram into cars to take them out, unleash a ~thunderpoon~ projectile to remove a threat with one shot, target gas tanks with a shotgun blast, or use the playful harpoon to slowly dismantle an enemy vehicle or even rip a driver from the cockpit. The best of these battles involve the large convoys, but when you reach the top-end of the vehicle upgrades, you can tear through these caravans with little resistance.Max is equally adept at throwing on the knuckledusters for hand-to-hand combat. Given the lack of large ammo stockpiles, most of your on-foot encounters involve throwing punches. This satisfying, free-flow combat system is reminiscent of the Arkham games, but Max doesn't have the professional restraint of the Caped Crusader. Chaining together attacks enables Max to go into Fury mode, where he unleashes devastating slow-motion finishing moves with shivs, walls, or old-school wrestling moves.Don't expect much challenge from the enemies even when you are severely outnumbered; the lack of awareness on display from the various wasteland foes is astounding. If you back out of an enemy base, don't be surprised when they charge directly into the bear traps they set up to protect their territory. You can remove the challenge of clearing out larger enemy encampments by luring them to the gates, which leaves them susceptible to thunderpoon and harpoon attacks from your vehicle that thin their ranks in a hurry. I saw one group of six enemies stand still waiting their turn to get harpooned and flung out of the base. Should you bite off more than you can chew, the forgiving checkpoint system keeps you moving forward both within missions and while roaming.Max's adventure inevitably leads to a showdown with Scrotus, but as the story concludes you are left wondering what, if anything, was gained in this pursuit. At the end of the day, Max overtook some bases, ran a couple hundred cars off the road, met some forgettable characters, and buried his fist into the sunburnt skin of the villainous locals. Was it worth the effort? That ultimately depends on how much fun you had in performing these basic, repetitious open-world activities.", "date": "Aug 31, 2015", "grade": "7.5"}