{"name": "Disney Infinity 3.0", "ref": "https://www.gameinformer.com/games/disney_infinity_30/b/playstation4/archive/2015/08/27/a-return-to-form.aspx", "text": "The might of Iron Man and Captain America werent enough to save Disney Infinity from a substandard showing in the Marvel universe last year. The play sets based on The Avengers, Spider-Man, and Guardians of the Galaxy were case studies in repetition and what not to do with open worlds. Disney Infinity 3.0 arrives just a year after that superhero-sized blunder, and once again expands in size and scope, this time adding the Star Wars universe to a growing roster of characters from Disney, Pixar, and Marvel.After watching Disney Infinity get off to a roaring start with its inaugural release, seeing it struggle mightily with a great cast of super heroes was unexpected and a little shocking. Remember, this is the same video game series and developer that successfully adapted the atrocious Lone Ranger movie into a fun interactive play set. From the sudden shift in quality between series entries, I didn't know what to expect from Disney Infinity 3.0. Would it continue trending downward and fail to capitalize on one of the most beloved entertainment properties in the world? Or could developer Avalanche Software turn this ship around and rediscover the complexity and joy of that first game? I was eager to find out. Within roughly an hour of play, it became clear that Star Wars and Disney Infinity fans alike have little to worry about.The opening moments of Disney Infinity 3.0s gameplay are filled with excitement and polish, teasing players with brief gameplay snippets stripped from Inside Out, Star Wars: The Empire Strikes Back, and a race between Mickey Mouse and a hilariously out-of-control Donald Duck. This tour of Disney Infinity 3.0s new experiences gives way to a rejuvenated and wonderfully upbeat game that brings back the creative spark that made the series first release such a wonder to play.The Toy Box is once again the main attraction, offering a wide selection of fun new props and mechanics. You use them in worlds designed for adventuring, platforming, racing, combat, and whatever else your imagination allows. I built a Rube Goldberg-like machine designed solely to fling Jar Jar Binks into deep space. The Star Wars selection in the Toy Box is a little light  especially given the wealth of toys in the real world  but includes the hallmark vehicles and monsters from the films and cartoons. I constructed a fairly detailed Tatooine, complete with Jabbas Palace, the Sarlaac Pit, and a sprawling Mos Eisley spaceport using all of the available Tatooine-themed buildings and props. My finishing touches were three Star Destroyers hanging ominously in the sky, and a valley filled with as many banthas as I could place without going over the data limit.The Toy Box is streamlined for creatively challenged people like myself to generate a wealth of content quickly, including new pathing options that keep NPCs moving where you want them to. I dont have the requisite skills to properly analyze the advanced building options, but I did learn a lot of things exploring other peoples Toy Boxes last year, and the new theater and matchmaking options should help players make these types of connections quicker. With most of the building items transferring from the first two Infinity games, there's plenty of fun stuff to interact with and use to build worlds and interior environments.Many of the best Star Wars Toy Box pieces are not included in the basic version of the game, and are instead unlocked in the Rise Against the Empire play set (available now in the Saga Edition of the game, and sold individually starting September 29). This set is good fun, excelling in lightsaber combat and offering plenty of challenges and enemy types. Fetch quests are used a little too often, and some locations (like the Death Stars interior) are uneventful pit stops in place to wrap up the story as quickly as possible. The play set offers about two to three hours of gameplay, and is nowhere near as fleshed out of a retelling as weve seen in the Lego games, but delivers big Star Wars thrills, plenty of fan service, and some amusing missions like reassembling the cantina band, and exploring the frozen wastes of Hoth. Most of the big Star Wars moments are a part of this experience, including the Death Star run. This mission offers impressive visuals, but little in terms of challenge, and the flight controls don't deliver a great deal of precision.Twilight of the Republic is the play set you get right out of the box. Its a new Clone Wars-era tale that parallels Rises strengths and weaknesses, but just doesnt have the charm or humor of the classic trilogy content. Ahsoka and Anakin are great additions to Infinitys lineup, and are just a few of the standouts in 3.0s amazing selection of new characters. I highly recommend picking up both Tron characters for combat purposes and the Inside Out emotions for Toy Box navigation. The Inside Out set is all about platforming, but is the weakest of the launch play sets, clinging too tightly to balloon collecting across the nicely designed platforming sections.The surprising star of Disney Infinity 3.0 is Toy Box Takeover, a separately sold adventure that unites the Disney, Star Wars, and Marvel universes in a crazy adventure in which the strangest conflicts can arise  such as Minnie Mouse throwing explosive purses at stormtroopers. This set is nicely paced and loaded with exciting combat challenges. It also puts one of Disney Infinity 3.0s coolest enhancements, sidekicks, into the spotlight. As you play, these computer-controlled helpers fight at your side, and level up as they go. You even get to hunt down a nice selection of loot for them.Moving forward, Id love to see more sets like this released.Disney Infinity 3.0 is a return to form for this series and developer Avalanche Software. With the assistance of Sumo Digital and Ninja Theory, the racing and combat are vastly improved. A strong emphasis is placed on variety; hopefully signaling an end to scenarios like seemingly endless waves of frost giants. With Star Wars, Marvel, Disney, and Pixar already integrated into the Infinity experience, one has to wonder where Avalanche goes from here. No matter what the future may bring, this series is once again in tip-top shape, and is a place where adults and kids alike should be able to indulge in a wealth of fun.", "date": "Aug 27, 2015", "grade": "8.5"}