{"name": "Danganronpa Another Episode: Ultra Despair Girls", "ref": "https://www.gameinformer.com/games/danganronpa_another_episode_ultra_despair_girls/b/playstation_vita/archive/2015/08/27/ultra-despair-girls-danganronpa-review-game-informer.aspx", "text": "Until now, the Danganronpa name has been associated with visual novels. Captivating players with school-themed tales of murder, the first two games in the series require little input from the player beyond basic navigation and pressing a button to advance text. That changes with this spin-off episode, and the result is bad for everyone involved.Ultra Despair Girls revolves around third-person gunplay that is functional at best and mind-numbingly boring at worst. This decision alone is baffling; fans love this series for its cast of entertaining characters and its surprisingly twisted narrative. This entry disregards Danganronpas established strengths, instead putting you in large, sparse, and uninteresting environments. These areas serve as dull shooting galleries once the robotic Monokumas show up  an army of maniacal bears that attack on sight.Controlling Komaru Naegi (the younger sister of the first games hero), you fight back against this threat with a gun that shoots bullets with various interesting effects. For instance, firing a knockback blast on a bomb-toting Monokuma sends it reeling backward to trigger an explosion, which means you can take out a large group of foes with one well-timed shot. Another ammo type makes your targets dance in place while you take the time to line up a shot at their weak point. You can also briefly switch to your partner Toko (another character from the first game) as a kind of super-attack. Unfortunately, the enemies are generally too stupid and predictable to make this kind of coordination rewarding. They usually just swarm you haphazardly, so encounters feel more like shooting fish in a barrel than fighting for survival.The only time the gameplay feels fun is when you get a break from the clunky shooting mechanics and use your abilities to solve puzzle-like arcade rooms. Youre still blasting Monokumas, but you need to do it with a methodical, step-by-step approach that lets you combine your ammo effects in interesting ways. Not all of these scenarios are great, but theyre more fun than the standard action.I wish I could say that the story makes up for the dull sections, but it also falls short. The plot has important revelations, but the delivery is just aggravating. Instead of a broad cast of likeable characters, youre stuck with Komaru and Toko, whose character arcs are slow and predictable. You dont get the rewarding mini-climaxes of the class trials in the main game, so its a long and slow journey that never really satisfies. For those who played the other Danganronpa titles, this story teases and plays coy for too long, frequently using ambiguous references like could it bethat person? to delay and talk around any real answers.Adding insult to injury, anyone who likes Danganronpa should still play this uninspired deviation from the core titles. The story isnt told well, but it fills some holes in the series lore, and bridges the gap between the first and second installment. Ultra Despair Girls would be easier to bear if it were just an incidental side story that fans could ignore. Unfortunately, it is important to understanding the world of Danganronpa, but the gameplay and dialogue make you suffer every step of the way.", "date": "Aug 27, 2015", "grade": "5.5"}