{"name": "Gears of War Ultimate Edition", "ref": "https://www.gameinformer.com/games/gears_of_war_ultimate_edition/b/xboxone/archive/2015/08/26/restored-beauty.aspx", "text": "Upon its initial release in 2006, few games could match the pure visual grandeur of Gears of War, and the cover-based shooting mechanics were similarly novel. Cut to 2015, and the remake may not have the graphical chops to compete with the very best in the business, but The Coalitions loving recraft is certainly pretty enough to feel at home on Xbox One. A head-to-toe visual and audio overhaul is as comprehensive as anyone could hope for. Gameplay sees a more minor adjustment, but franchise fans on console should also be attracted to the presence of PC and DLC content that never before made its way to Xbox.The campaign adventures of a ragtag squad of soldiers remains entertaining and excellently paced, particularly with the addition of the previously PC-exclusive sequences near the end of the game, which include a throwdown against one of the massive Brumak monstrosities. Each act of the narrative offers some fun variations and tonal shifts. Intense, non-stop fights give way to slower moments, like the navigation from light to light through streets where darkness leads to instant death. Moments of horror at an old mining facility transition to a tense and claustrophobic mine-cart shooting sequence. The constant change-up keeps the action fresh and exciting.The drama and devastation of the Gears universe has always felt odd when juxtaposed with the bro-dude attitudes of its lead characters, and that disparity was never so true as in this first installment. Cries of sup bitches! and hell yeah accompany the action, and your patience for the soldiers banter will determine a lot about how much you can enjoy the story. For my part, a few conversations are so incongruous that they made me laugh along with the repartee, while simultaneously reminding me that game storytelling has come a long way in the last decade. A stellar musical score accompanies your battles, now remastered into Dolby 7.1 Surround. Meanwhile, every inch of textured characters, environments, and cinematics has seen a visual overhaul, as well a resolution update into 1080p. The result further sells the originals heady art design, which explores a cultured and architecturally sophisticated society brought to ruin through decades of war and violence. Excellent lighting, weapon, and explosion effects accentuate the wartorn tone of the world, and transform Sera into a believable sci-fi setting. The cover-based shooting is solid, offering tense and bloody exchanges punctuated by gory chainsaw kills and clever encircling maneuvers. The active-reload system remains the best way anyone in gaming has figured out to make refilling your gun an engaging diversion. Level layout and enemy placement is strong, but both ally and enemy A.I. is abysmal, often making the worst of all possible choices when navigating the battlefield. The ally dilemma is resolved at least in part by playing the game in its best incarnation  as a two-player cooperative enterprise. Both online and split-screen options play smoothly, and combat seems optimized for this style of play, especially with the new option for different difficulty settings during split-screen play. Other little changes, like ally revives while in cover, and weapon toggles during the roadie run, are most welcome.Multiplayer is chock full of maps and offers lots of great mode options, but your enjoyment will be tempered by how much you liked the original. The constant high-speed rolling and snap-to cover movements of enemy players is likely to feel like an exploit to newcomers, even while veterans recognize it as valid strategy; any way you cut it, the sudden shifts in speed and direction by your targets feels outdated by more recent PvP games. Shotguns dominate the field, suggesting either that further weapon balancing should have been attempted, or perhaps simply that the Gears multiplayer community is set in its ways. Game modes offer a more strategic vibe than many online shooters, with well-designed maps that offer plenty of flanking opportunities, and level layouts that encourage cooperation and tactical control of the environment. With 19 maps that include all the previous DLC and PC exclusives, and 17 unlockable character skins from Gears of War 3, no one can fault the multiplayer for lack of replay and discovery potential.The Coalition has done this remake right, with attention to detail and an eye toward fan desires. Gameplay feels dated in both campaign and versus, but in many ways thats a testament to the excellence of the original and that its held up as well as it has. New and old players alike should feel no hesitation about seeing this as the definitive way to play the opening story of the Gears epic. The new edition doesnt remake the cog, but it certainly makes it shiny again.", "date": "Aug 26, 2015", "grade": "8"}