{"name": "Everybody's Gone To The Rapture", "ref": "https://www.gameinformer.com/games/everybodys_gone_to_the_rapture/b/playstation4/archive/2015/08/10/follow-the-leader-through-a-placid-apocalypse.aspx", "text": "With titles like Dear Esther and Amnesia: A Machine for Pigs, developer The Chinese Room has been a pioneer in the field of interactive storytelling. Restrictive linearity has been a weakness of the studio's titles, but Everybody's Gone to the Rapture allows players to meander off and explore the aftermath of a gorgeous post-apocalyptic English countryside set in 1984. Rapture is an ambitious attempt at abstract storytelling, but ultimately the only reliable way to experience it flies in the face of untethered exploration.Where Dear Esther and Amnesia: A Machine for Pigs both baited players along a narrow path, Everybody's Gone to the Rapture invites them to wander through vibrant green fields and finely detailed homes that tell story of the people who once inhabited this world. In one spot, medical pamphlets with fine printing on them are spilled across the ground, next to a few discarded tissues blotted with a distressing amount of blood. Nearby tire tracks suggest a hasty exit from the town. Uncovering these small details can provide clues to a larger mystery. I'm intentionally avoiding over-explaining the premise, because enjoying Rapture is all about piecing together what has happened. The Chinese Room's signature environmental storytelling is on point here, and organically discovering and analyzing crafted memories of the past feels rewarding.However, you aren't as free to explore as you might think. An enigmatic, glowing ball of light serves as your constant guide, bobbing and weaving among the fields and homes and undermining the subtle storytelling. I initially assumed this energetic spectral entity was merely set dressing, as illuminated apparitions are scattered all around Rapture, frequently taking on the forms of the settlement's former residents and reenacting dramatic moments from the past. I enjoyed naturally discovering echoes of departed souls, like two friends consoling each other's fears of a strange illness, or a couple arguing about an assumed love affair. I soon discovered the glowing light ball is just the game saying, ~go here next.~ Sometimes it idles in the distance, and other times it insistently suggests your next destination. Like a friend sitting next to you with an online walkthrough at the ready, it's difficult not to take the clearest path. Rapture further discourages freestyle exploration by only triggering certain phantasmal story sequences when the floating chaperone gives a signal. Around the time I discovered the ghost ball's purpose, I had combed through dozens of buildings on my own, only to slowly retrace my footsteps following the guide as it revealed the correct discovery sequence.The spritely light ball - in all its impressively rendered glory - quickly cruises around the pristine environments. The player, however, is forced to plod around at the pace of a car that's low on fuel and stuck in first gear. A ~light jog~ button would've been appreciated in moments where veering off the main path results in an uneventful dead end. Also, being able to hop waist-high fences would remove some of the tedium from the slow-paced exploration.I enjoyed the interactions between the identical glowing ghosts, but trying to remember characters by the names they call one another or faint differences in their English accents is confusing. Playing with subtitles on and diligently reading them is practically required to understand the abstract storytelling.I enjoyed the general vibe of Rapture's striking apocalyptic tale and the well-performed character interactions therein, but the story left a sour taste in my mouth in the final stretch. A pretentious, musing monologue attempts to tie the mysterious happenings together with all the subtlety of a high school poetry jam.The Chinese Room has crafted another unique experiment that proudly stands out from the gaming norm, now with the improved graphical horsepower of the PS4. Despite the prettier locales and solid attempt to break out of the linear mold, Rapture simply doesn't feel rewarding when straying from the glowing golden path.", "date": "Aug 10, 2015", "grade": "7"}