{"name": "The Legend Of Zelda: Tears Of The Kingdom Is Already The Second Best Selling Game Of 2023", "ref": "https://www.gameinformer.com/games/kings_quest/b/xbox360/archive/2015/07/28/review-kings-quest-chapter-i-a-night-to-revemember.aspx", "text": "Inrecent years, a wellspring of modern adventure games have bubbled up attemptingto recapture the magic of yesteryear's point-and-click titles. Modernizing agenre built upon abstract puzzle logic, trial and error, and frequentbacktracking is a tall order, but The Odd Gentlemen have found a solid balancein the first chapter of its episodic return to the classic Sierra fantasy series. Save for a couple nuisances,this first chapter is a heartfelt and entertaining return for King Graham.Part ofKing's Quest's charm lies in the narrative framework of an elderly King Grahamrecounting the stories of his youth to his granddaughter, Gwendolyn. Hereffervescent attitude meshes well with the tired-yet-playful Graham (voiced by Back to the Future's Christopher Lloyd), giving off a fun, unmistakable The Princess Bride vibe. Speaking of The Princess Bride, much of the voiceacting is spot-on, like the diminutive yet cunning knight-in-training Manny,voiced by the aforementioned film's Wallace Shawn (~inconceivable!~). Lloyd'sperformance as old Graham mostly works, though the 76-year-old actoroccasionally sounds like he's either phoning it in or too tired. Regardless, Ifound Graham's storytelling with Gwendolyn sweet and refreshing.Thisfirst chapter features Graham's bumbling attempts to fulfill his lifelong goalof becoming a knight. Players directly control Graham using an analog stick,which feels perfectly natural. During some brief early sections, King's Questappears to be disappointingly linear, with Graham crawling through astraightforward dragon's lair section, throwing switches to reveal obviouspaths through the monster's sprawling cave network.Thankfully,the world opens up in a delightfully nostalgic way, embracing the design tenetsof the genre's roots. A large portion of Daventry is open to explore, like thetown square's shops, a dubiously advertised floating island, and spooky woodscrawling with wolves. Players are left to ponder solutions for variousconundrums. How could dipping all my objects into purple dye help me? Should Ipilfer a big shield, wooden tabletop, or a huge circular loaf of bread to useas a wagon wheel? King's Quest nails that delightful adventure game sweet spotfor me, where a sudden eureka moment triggers a domino effect of puzzlesolutions. King's Quest does a great job of rewarding players for exploring everynook and cranny, no matter how deadly it seems.Like theSierra games of old, Graham can venture into certain death. I watched theprospective knight get crushed by a dragon and turned into squirrel food.Thankfully, Gwendolyn calls out her obviously alive grandfather on themistelling, allowing players to select a safer path. This clever mechanic, alongwith generous autosaving, prevents players from becoming too frustrated orfalling into the infamous fail states of the old games.Beingfree from severe punishment takes the edge off in a nice way, but King's Questoccasionally frustrates. The open design of Daventry is the biggest asset andmost frequent hang up. Without any type of map, you can easily lose track ofwhere the winding paths lead, even if you've traveled them several times. Adventuregame purists might appreciate it, but even as someone who grew up playing manyLucasArts and King's Quest I found it tedious. Another snag lies in theunskippable cutscenes and dialogue, which become even more annoying when you'retrying to investigate an object and accidentally activate a scene you've seentoo many times.Visually,King's Quest is comparable to other modern episodic adventure games. Theheavily stylized character design reminds me of Telltale's suite of games.However, The Odd Gentlemen's wonderful animation brings these characters tolife. Little touches like young Graham's flowing scarf and flailing arms as heflees add a lot of personality to the cast. I noticed a couple woodlandcritters scampering along with jarringly minimal animations, but these flawsare infrequent. The expressive character movements and colorful art style goesa long way to cover up the fact that this game isn't a graphical powerhouse.So far,King's Quest is remarkable in its ability to call back to the classic design of'90s point-and-click adventures without succumbing to as many pitfalls. Thecombination of wacky character interactions, goofy logic puzzles, and heartfeltstory beats has me eager to see what's in store in Chapter II. The team at TheOdd Gentlemen has created one of the most endearing, true-to-form adventuregames I've played in recent years.For more on King's Quest read our in-depth feature about The Odd Gentlemen taking on the challenge of making a new entry in the storied series.", "date": "Jul 28, 2015", "grade": "8"}