{"name": "PlanetSide 2", "ref": "https://www.gameinformer.com/games/planetside_2/b/playstation4/archive/2015/07/21/live-die-repeat.aspx", "text": "First-person shooter fans have played the role of the sole,galaxy-saving hero countless times before. PlanetSide 2 is not that experience.On these chaotic battlefields, you are not a master chief or legendary guardianwho can expect to have an unlosable war served up to you on a silver platter.Instead, you are a grunt among hundreds, and your job is to serve the wareffort until you die (usually a matter of minutes), hopefully taking down a fewmembers of the opposition with you.PlanetSide 2 drops players into an endless war. Three uniquefactions vie for territorial control of four continents, any one of which puts thebattle zones of other competitive shooters to shame with its sheer size. Alsounlike other shooters, this war is truly endless. Combat is not parceled out indiscrete matches; war rages constantly, with no definitive winner and no MVPaccolades to aspire to.Players fight on a single server (chosen when you createyour character), with no purpose other than to wrest control from the otherfactions, one interconnected zone at a time. Should one team overrun acontinent, it becomes locked for a short period, providing a modest (but temporary)bonus to the winning team before the area is put back into play. Teamwork is essentialto gaining control, which leaves you as a small cog in the relentless, bloodymachine. While that may not sound appealing to those accustomed to being the starof their own personal hero story, it gives PlanetSide 2 its own unique feel that of true large-scale warfare, whose strategy and complexities are slowlyrevealed over time.Unfortunately, Daybreak Game Company does little to help you figureout those complexities. You start by picking one of three factions, which youare told nothing about beyond their names. You have to head online if you wantto know how the New Conglomerate differs from the Terran Republic, or why theVanu Sovereignty look like rejected Tronextras. After the slimmest of character customization options, you are throwninto the fray.A few computer terminals in your faction's warp gate spitout some minor explanations, but it's up to you to figure out the controlscheme, complex upgrade mechanics, and how the hell taking over territoryactually works. The new ~tutorial~ continent Daybreak created for PS4 userssucceeds in downsizing the scope of the conflict to a comprehensible scale, butyou can still expect to spend a few hours in abject confusion as you get a feelfor the game. The harsh learning curve is especially unfortunate for PlanetSide2's player base; even though its free-to-play status is likely to draw in a lotof players, those who give the game a shot will soon realize that while it maynot demand any money to try, it does require a lot of time. PlanetSide 2 isn'ta game you can just pick up and play.However, the investment is worth it. Despite being afree-to-play game, PlanetSide 2 is not only fun, it's also fair. Players earnaccess to every class, vehicle, and upgrade as they level up, and all weaponsand items can be purchased with certification points earned alongside your XP.Only cosmetic items and XP boosts are locked exclusively behind the pay wall. Inever felt like I was being penalized for not shelling out money  in fact, giventhe poor exchange rate ~battle cash~ offers for real money, I was never temptedto buy anything.While the base rate of gaining certs is slow, PlanetSide 2plies you with constant bonuses that boost your acquisition to satisfyinglevels. The only downside is that Daybreak has inexplicably omitted the PCversion's VR training facility, which lets you try out new equipment before youbuy it. This exclusion is a huge detriment; new weapons and attachments areconsidered sidegrades, not upgrades, so your weapons of choice come down topreferences that can't be surmised from the stats screen. Dropping a day'sworth of certs on a gun only to instantly realize you don't like how it handlesis a huge buzzkill and can kill your urge to participate in the grind.Daybreak's technical implementation is also far fromperfect. Load times can be long when switching locations, and I ran into anumber of glitches and crashes, particularly when respawning. These hiccups aren'tenough to ruin the experience, but the lack of polish does stand out in what isalready a dated-looking game.Eventually, the grind is all there is. Fighting a war no onecan win has a certain futility, especially when territory control boils down tothe singular task of capturing or defending control points. That said, thewell-conceived classes and vehicles offer plenty of strategic variety andcomplexity; PlanetSide 2 accommodates all styles of competitive warfare, includingslow and methodical snipers, run-and-gun assault commandos, full-scalevehicular combat, and everything in between.Player count often plays a large role in the tide of battle;while a good squad can steamroll through a series of zones, your faction won'tbe able to hold them without ample back up. No matter how good you are, somestandoffs will be futile, but the scale of PlanetSide 2 means you can alwaysfind a more engaging showdown somewhere on the map. I'm not the sharpestshooter, but I found the balance more than fair. Even if I didn't kill an opponentevery life, various team-assisting tasks allowed me to rack up satisfyingamounts of XP, and respawn times are mercifully brief, so you can jump rightback into action again and again. The more I play PlanetSide 2, the more I enjoy it. Daybreaksays it is committed to improving and expanding the MMO, which should giveplayers plenty of reasons to continue returning to the battlefield. As itstands, there's more than enough incentive to give PlanetSide 2 a try; thegunplay is solid, player progression moves along at a rewarding clip, and theintercontinental war is like no other in gaming  even if it lacks a point.", "date": "Jul 21, 2015", "grade": "7.75"}