{"name": "Mr Shifty", "ref": "https://www.gameinformer.com/games/mr_shifty/b/switch/archive/2017/04/12/tiresome-mayhem.aspx", "text": "Mr. Shifty starts off on a promising note. You play the eponymous hero, infiltrating a skyscraper to steal a valuable piece of technology. Shifty has the impressive ability to teleport short distances, passing through walls and enemies to reach his target. The entire game hinges on this mechanic, and it is fun for a short period. However, Mr. Shifty soon devolves into a repetitious experience that ends up being nearly unplayable thanks to a bevy of technical issues. Drawing inspiration from Hotline Miami, Mr.Shifty is composed of overhead view levels patrolled by enemies carrying various weapons. Usually you have to kill all of them with your fists or melee weapons you find scattered about the environment (like steel beams or broom handles). If anyone hits you once, youre dead and have to start the level over. The phasing ability is fun initially; you dance around enemies, trapping or causing them to shoot each other. Later levels add more objects for you to play with, likes mines you can stick to enemies and then teleport away, giggling as they explode and take out an entire squad of foes. However, Mr.Shifty has over a hundred of these levels that eventually become nothing more than horde rooms, where the goal is to teleport around and survive the onslaught of enemies. Mutators change the gameplay a little, like enemies suddenly being able to appear out of thin air, or introducing laser beams you have to teleport to avoid, but Shifty never gets far away enough from its teleportation hook to make it keep the action interesting over the long haul.To make matters worse, performance issues render the back half of the game nearly unplayable. Many of my deaths were not because of my own bad moves, but because the game stuttered or slowed down to a crawl once enemies started pouring onto the screen. When a single hit can make you you lose up to 10 minutes of progress, thats unacceptable. I also encountered two game-ending crashes that robbed me of nearly an hours worth of progress altogether since the game only saves when you beat a chapter, not at each individual level. Technical problems aside, the latter half is disappointing in other ways. Except for some lightly sprinkled puzzles, Mr. Shifty is content just to throw more and more enemies at you for the last few hours, trading the creativity in the first half for a dull endurance test that lasts far too long and ends with a whimper. I was finished with Mr. Shifty long before the credits rolled. It didnt make me feel like a skilled thief or a rad, teleporting vigilante. It just made me tired and disappointed to see such a neat premise amount to nothing more than a chore. This review pertains to the Switch version of Mr. Shifty. The game is also available on PC.", "date": "Apr 12, 2017", "grade": "5"}