{"name": "Sunset", "ref": "https://www.gameinformer.com/games/sunset/b/pc/archive/2015/06/08/sunset-review-game-informer.aspx", "text": "Pacing can make or break any narrative. This is a commonstruggle in all writing authors have keep their audiences interested. Withlimited gameplay and little interaction, everything in Sunset hinges on thestory and its next move. For such a fresh and intriguing concept, the unexcitinggameplay and snail pace of this first-person exploration title don't do the subject matterany favors, bringing down the entire experience. Everything about Sunset's concept seems novel and engrossing.The year is 1972, and you play as a housekeeper named Angela  a smart womanfrom New York. She's paid to clean a swanky penthouse apartment owned byGabriel Ortega. She's never met Ortega, but discovers things about him throughtidying his place and conversing with him through notes. Your entire experienceis exploring Ortega's luxurious penthouse; you never see Angela outside of it,and only learn about the world through the lens of this two-story structure.The game takes place in the fictional Anchuria, located inLatin America. This tropical paradise is becoming a brutal warzone due to amilitary coup, and both Angela and Ortega are affected in different ways. Youslowly learn more about the events by the objects in Ortega's pad, such asnewspapers, art, and business documents. The world outside the windows gets grimmeras time passes, with unexpected explosions and smoke seen from the penthouse'sstellar view.The main narrative tackles a slew of complex issues: race,war, politics, socioeconomic status, and gender. It makes you see these fromdifferent perspectives, especially through Angela, an African-American woman. Ienjoyed the intelligent and thought-provoking subject matter, and it got methinking about war, freedom, and life in general. Angela's monologues and herjournal writings are a highlight, as they all bring these topics to theforefront. Even Angela's relationship with Ortega becomes intriguing; the waris affecting them both, allowing them to form an unlikely bond. While all these threads are extremely interesting, they'rebrought down by the slow pacing and dull gameplay. I had to force myself totrudge forward, especially in the first few hours; you're just getting to knowthe characters, so the more engaging and reflective subject matter isn'tpresent in this phase. I spent more time bored than excited about the nextreveal. You're essentially visiting the same place, doing a few chores, andsearching for one or two new things every time you clean Ortega's apartment. Youcan only click on a few items to interact with, such as those required for thechores Ortega requests like mopping and doing laundry. The few clickable itemschange every visit.The repetition gets tiresome, especially with suchinsignificant changes and very minor reveals each time you visit the penthouse.The game took me around seven hours to complete, but it was spread too thin anddidn't have enough story content to fill those hours. Some of my days feltthrowaway, with very little information. Multiple trips in a row leave youwithout much plot development at all. You have freedom over how you spend your time, choosing howmuch you're going to snoop and making some other decisions. For instance, youcan pick what you want to cook, what color to paint walls, or if you want toget flirty in your notes to Ortega. However, the game never makes it very clearhow (or if) any of this is impacting anything, making them feel like empty choices.My enjoyment was also brought down by the number oftechnical hiccups I encountered. I didn't have one play session where I didn'thave a glitch or the game crash. Sometimes, my character couldn't walk. Othertimes, I couldn't click on anything. Restarting the game fixed it every time,but I grew frustrated having to do this numerous times. I even tried adifferent computer and still ran into the same issues. It breaks the immersionevery time you have to stop to reload the game for something that shouldn't bean issue in the first place. If it was only a few times, it wouldn't bother meas much, but this happened regularly. Sunset has some great elements, especially interms of diverse characters and intriguing subject matter, but that doesn'texcuse its shortcomings. As beautiful and contemplative as the writing is, Ispent too much of the game frustrated by glitches and bored by exploring thesame surroundings. Sunset is at its best when it's surprising you with itsbigger reveals and focusing on the things that make us all human. I felt like Iunderstood Angela and she got me thinking. If only it didn't take such adrawn-out process to get there.", "date": "Jun 08, 2015", "grade": "5.75"}