{"name": "Splatoon", "ref": "https://www.gameinformer.com/games/splatoon/b/wii_u/archive/2015/05/29/splatoon-review-game-informer.aspx", "text": "Nintendos 2002 platformer, Super Mario Sunshine, gave players a singular mission: Clean up the world with a water pack. Splatoon, on the other hand, is all about coating the world with ink. While this messy disposition may seem like Sunshines antithesis, the inspiration of Marios GameCube adventure abounds in Splatoon. The controls, the physics, and even the level design deliver a familiar level of Nintendo polish. Splatoon looks, sounds, and plays great, but with some design elements and a lack of content weighing it down, I was left wanting more.Splatoon puts you in the shoes of Inklings, human-like characters with the ability to transform into squids. With a focus on multiplayer action, you square off against another team, blasting paint everywhere and coating the map with your teams color. The key to victory is switching between your two forms: shooting ink as a humanoid, and swimming through that ink as a squid. This back-and-forth structure involves more strategy than a straightforward deathmatch, and makes rounds unpredictable and fun. One moment, youre running around as an Inkling coating the map and splattering opponents. The next, youre a squid submerged in ink and cruising to the next area.Moving your character around and firing your weapon in Inkling form plays fine, but controls are most satisfying when youre in squid form; steering the squid as it speeds along the ink-covered pathways and walls is a blast. Splatoon defaults to the motion controls, but theyre unreliable and awkward, so I recommend switching to the more precise standard option. With the developers hitting the mark so squarely with the traditional controls, the online matches are fun from the first round.Players can take their Inklings online to battle it out in two modes: turf war and splat zones. Turf war puts Inklings in two teams as they engage in an ongoing struggle to coat the map with as much of their ink as possible during three-minute rounds  the team with the most when the timer runs out wins. The action is so speedy within this mode that the absence of any type of voice chat capabilities isnt a major issue. Three minutes may not sound like enough time to get going, but the frantic formula of turf war means that these shorter matches feel appropriate.The other online mode, splat zones, brings a slightly different twist on the formula presented by turf war. Rather than painting the entire battlefield with your ink, these matches focus on controlling one small area of the map. Every other aspect of the mode is the same as turf war (exception the longer time limit), but the battles are more intense with all players converging on the same location.Unfortunately, splat zones is currently relegated to the ranked battles section, which doesnt unlock until you reach level 10  a feat that can take many hours to achieve. With your success and leveling within ranked battles being based entirely on your teams performance, this is where Splatoons lack of voice chat is most damaging. On multiple occasions, opponents would hide by the splat zone to ambush anyone who passed by. With no way to warn my teammates of the danger, I rushed to try and flank the opponent and take matters into my own hands.You are thrown back into the action quickly after a match, delivering a rapid-fire experience (and making the short rounds more palatable). However, you need to back out of the matchmaking lobby in order to change your equipment or weapon. If youre playing with a good group, but want to switch your short-range ink roller weapon for a long-range charged shot, it means backing out and almost certainly losing the group in the process.This issue is further accentuated by the fact that you cannot create an online match with your friends. You can currently join a single friend who is already in matchmaking, but Nintendo isnt planning to add party-based functionality until August, making basic online multiplayer features like private matches and the ability to form teams conspicuously absent. Those who really want to play with friends can do so using the local one-on-one multiplayer mode, which presents you with a single underwhelming challenge: Pop more balloons than the other player.By performing well in multiplayer, you earn money to unlock more equipment. Each item has a unique set of abilities, ranging from increased damage from your primary armament to an ink-saving attribute that makes your ammo deplete at a slower rate. As you level up, you gain access to more weapons with a wide range of capabilities and super powers. Ink guns excel at different ranges and come equipped with various super powers (like a Kraken transformation, a bubble shield, and a tornado of ink). With all of these options, I excitedly backed out of the matchmaking lobby to check out what was new in the store whenever I gained a level.Multiplayer is important to the overall Splatoon package, but its oddly barebones; coming with just two previously mentioned modes and only five maps. Rather than delivering the five maps all at once, a rotational system feeds players two maps at a time for each mode before rotating them out for another two after several hours. With so few maps to begin with, its detrimental to restrict the ones that can be used, especially when players are expected to spend the bulk of their time in these modes.You are also bound by the rules of the existing modes; you cant create custom matches with adjustable times or special conditions. Nintendo says it will offer free post-release content, including new maps, weapons, modes, and public events. While we can only speculate as to what these will add to the experience, Nintendos plan doesnt change the fact that Splatoons offerings at launch are slim.While the multiplayer falls short on content, the single-player campaign is surprisingly engaging, featuring 27 stages with creative design. These levels feature a strong mix of platforming, puzzle-solving, and shooting. In one memorable sequence, I navigated invisible walkways that were only detectable when covered in ink. Another had me expanding sponges to travel across by drenching them in ink while enemies try to shrink them using their own. The levels feel influenced by the Super Mario Galaxy series, with that same inspiration clearly being carried into the creative boss fights. Whether you need avoid being eaten by a submerged boss and then smash in its teeth to loft a bomb in its mouth, or avoid a rolling beast while coating areas of your own ink to get it stuck like a Jeep in too much mud, the boss battles require you to think about your plan of attack.Splatoon has all the trappings of something fans have wanted from Nintendo for a long time: a unique IP that shows Nintendo can still dream up new experiences. As entertaining as it is fast-paced, Splatoon is a strong addition to the Wii U lineup. My enjoyment of what Splatoon has to offer is only offset by Nintendos scant offering out of the gate.Amiibo FunctionalityUsing the three compatible Amiibo figures, you can access challenges that put special twists on levels from the single-player mode in order to unlock exclusive gear for multiplayer. If you use the Inkling Boy Amiibo, you complete these stages and boss fights using a melee-based ink roller as your primary weapon. Use an Inkling Girl Amiibo, and you face the same challenges with the long-range charger ink gun as your primary weapon. The most enjoyable challenge maps come when you use the Squid Amiibo, which lets you play through the same maps yet again, except your character can morph into the powerful Kraken.", "date": "May 29, 2015", "grade": "7.75"}