{"name": "Game of Thrones Episode 4: Sons of Winter", "ref": "https://www.gameinformer.com/games/game_of_thrones_episode_4_sons_of_winter/b/xboxone/archive/2015/05/28/game-of-thrones-episode-4-review.aspx", "text": "Sons of Winter, the fourth installment in Telltales canonical Game of Thrones series, marks a turning point for House Forrester, a family of woodsmen that has been threatened, tortured, killed, and driven to the brink of extinction by the factious houses across Westeros. Within this new chapter, we see the beleaguered Forresters fight back, stand proud, and add uncertainty to a narrative that, until now, seemed designed solely to kill them off. The tides of war arent necessarily turning  each Forrester still has an axe resting heavily on their neck  but the waters are turbulent and running red with the blood of numerous families. The Forresters switch from wallowing in despair to standing tall in the face of danger is a bit unsettling in how quickly it happens, but is a welcome change for most of the lead characters. Rodrik has always had a sharp tongue, but he shows us he can formidably back up his words, and that Ironrath will not go down so easily to the Whitehills. This is George R. R. Martins universe, so deadly snakes always slither in the grass, and Rodriks most trusted allies may not be so faithful after all. The involvement of Elaena Glenmore in this episode is finely penned; the conversations with her are equally as reassuring as they are stressful, questioning the bonds of love and family.Over at Kings Landing, Mira remains under the watchful eye of Cersei Lannister, but is suddenly confident and on the attack  a personality change as unexpected as it is contrived. The majority of her screen time is spent eavesdropping on chatty partygoers at Tommens coronation to get dirt on the people that are wronging her family. She doesnt spend any time analyzing the information she receives, and instead spreads it around the party like a deadly airborne plague. When this intel is presented to the people who least want to hear it, they turn into fist-shaking cartoon characters. Due to the sudden shifts in Mira's tone and to the flow of her story arc, her role in the fate of her family is muddied, veering dangerously close to being aimless. Her involvement with Tyrion, which doesnt come up here, is the only real point of intrigue that remains for her tale at this point.Although Mira appears to be caught in a cycle of bouncing from one bad party to the next, her screen time is minimal and doesnt derail the excitement brewing at the Wall and across the Narrow Sea.Gared Tuttle, squire to Lord Forrester, is thrust into the aftermath of the unfortunate events that befell him in the previous episode. The men of the Wall have no sympathy for him  which is awesome  and go about their business. For fear of spoiling any big plot points, I can only say that Gareds story is the odd wild card; the events in his world could upend everything, no matter where the other arcs go. This new chapter reaffirms this, and is one of the episodes best plot threads.Elsewhere, the inseparable Asher and Beskha continue to bicker, much to our amusement, but end up the victims of this chapters talk to a real Game of Thrones character moment. They spend a few minutes defending themselves to Daenerys Targaryen, the mother of dragons. Daenerys is uncharacteristically brash and weird, even going as far to ask Asher if he wants to touch one of her dragons. Daenerys spits venom, makes puzzling demands, and is thankfully gone as quickly as she appears, leaving Asher and Beskha to do what they do best: mess up bad guys.Yes, the action input is still sadly lacking, but the cinematography capturing Asher and Beskha's motions is quite the spectacle, showing plenty of fancy neck slices and back stabs. Ashers endgame is still hard to read, but he makes progress toward his goal, and remains a fun character to follow, largely thanks to Beskha (my favorite character in this series).Unlike previous episodes, Sons of Winter shows the good guys making progress. This feat will likely be short-lived in the end, but we have a little while to enjoy the feeling of maybe theres a chance. Odds are episode five will rain fire and blood over the Forresters yet again.", "date": "May 28, 2015", "grade": "8"}