{"name": "Broken Age: Act II", "ref": "https://www.gameinformer.com/games/broken_age_act_ii/b/pc/archive/2015/04/26/broken-age-act-ii-review-happily-ever-after.aspx", "text": "Broken Ages first act ended on one heck of a cliffhanger, and left me wondering what Vella and Shay would be doing next. Thank goodness I wasnt holding my breath; a year after the first half was released, Broken Ages story has come to a conclusion that is absolutely worth the wait.I spent hours playing the first half of Broken Ages concurrent stories, wondering how they were connected. They couldnt have been more different  Vella was a tough young woman who bucked tradition because, well, it was stupid. Shay lived an isolated and coddled existence on a spaceship, and he desperately wanted to see what was behind its toddler-toy facade. Thanks to the cliffhanger at the end of Act I, we know a lot more about them  but just as Id grown fond of each character and figured out how their lives intersected, they were yanked apart. Without revealing too much about the previous installment, this half depicts what happens after Shay and Vella switch places; Vella is in the lonely spacecraft, and Shay is ejected onto Shellmound Beach.People often get carried away and say that a sequel or chapter changes everything you think you knew about a world. Broken Ages second act doesnt do that. There are surprises and big revelations, to be sure, but the world remains largely familiar  and thats one of its many strengths. When I started guiding Vella through Shays ship, I had a nagging suspicion that this part of the game was going to be shorter and less ambitious than what came before. Doors that I could walk right through in Act I were now broken, and paths Id walked on were blocked off. Its not until I switched to Shay that I fully appreciated whats going on.The first half of Broken Age was about setting up the pieces and then knocking them over with a well-intentioned swipe of the arm. Now, players  and our heroes  have to sort through the consequences of those actions. You dont knock a sacrifice-craving deity out of the sky without causing a few ripples after all. Some of the effects are obvious; I approached Marshall Dune to say hello, but he still has the pitch pipe stuck in his throat and its impossible to decipher what hes trying to say. Carl has left her husband behind in Meriloft to try her hand at fishing. That pile of fish guts continues to reek. Others reveal themselves over time.On the ship, Vella learns more about her greater role in the world, while sorting through and repairing the damage she caused. Shay, too, feels the consequences of Vellas actions  fortunately she left a positive effect on the people she met. The talking (and puking) tree, however, is one notable exception. Vella continues to develop as a determined and strong character in her portion of the story. Meanwhile, Shays experience with being duped makes him particularly well-suited to deal with Broken Ages cast of supporting characters.Game designer Tim Schafer recommends that players start from the very beginning of the game before playing through the new content  even those who have already completed Act I. I took his advice, and I recommend you do the same. It made moments like revisiting the snake in the forest that much better, since I still had the agony of wondering what was behind him fresh in my mind. Note: The payoff is supremely stupid and great.Vellas time on the ship becomes more interesting as time goes on, too, but its her turn to feel isolated. One of the reasons Shay was eager to get off the ship was because he was so lonely, and Vella doesnt have much of a chance to socialize, but the few characters she encounters are funny and unexpected. I know humor is subjective, but I think Broken Age represents the apex of Double Fines writing. The laughs dont come from desperate pop-culture references and forced slapstick. Instead, its reminiscent of hanging out with a funny friend; the lighthearted tone and surface whimsy are present throughout, but theres also the same sinister undertone beneath the whipped-cream coating. Its a delicate balance that never wobbles too far in one direction.The first act had its share of tricky puzzles, but I worked through most of them and lucked out through the rest. Act II isnt nearly as forgiving, but it is just as fair. Two of the standouts involve unraveling a tricky knot by proxy, and a deeply involved puzzle built around robotics. By the time I finished playing, I had piles of scrap paper around me, which I consider the sign of a game well done. Solutions are logical, and dont rely on obtuse adventure-game logic; I was almost always left thinking, Oh, of course, after finally punching in the final step of a tricky puzzle.Act II does something thats a bit jarring, however. While you can swap between characters at will in Act I, its purely optional. I completed Vellas Act I adventure in its entirety before moving over to Shays, for example. In the second part of the game, a couple of puzzles require swapping characters to find clues. One of the instances is so clever that I feel bad for calling it out, but it feels unfair to rely on the swapping mechanic after conditioning players to see it as optional.I was happy to rejoin Shay and Vella and help guide them through this adventures conclusion. Who doesnt want to root for a pair of underdogs, especially when theyre up against forces that seem to relish in ignorance? In spite of the bizarre human-sacrifice mythology and space-simulation hijinks, Broken Age is a wonderful tale grounded in relationships and how two people  no matter how insignificant they might seem  can make a difference.", "date": "Apr 26, 2015", "grade": "9.25"}