{"name": "Crypt of the Necrodancer", "ref": "https://www.gameinformer.com/games/crypt_of_the_necrodancer/b/pc/archive/2015/04/21/get-rhythm-or-you-39-ll-get-the-blues.aspx", "text": "Good music can make or break a game. A catchy stage themecan burrow into your head longer than a radioactive earwig, while the mostabrasive offenders suffer music's worst fate: the mute button. Crypt of theNecrodancer pulls off the improbable, delivering three awesome soundtracks and allowingyou to weave your own music library into the core of its punishing roguelikegameplay.Necrodancer demands players step in time with the beat,timing movement and attacks with a tap of the arrow keys (which I preferred overthe controller) as they explore randomized dungeons. The brave and coordinatedcan also hook up DDR dance pads to their PC, but I didn't have one handy. Tappingoff-beat not only erases your coin multiplier (important for buying items fromshops), but temporarily stops you from moving at all, opening you up to attack.This restriction makes evading boogying skeletons and harp-headed minotaursfeel clumsy at first - like dancing with a stranger at a wedding. But unlikereal life, I found myself gracefully falling in line with composer DannyBaranowsky's (Super Meat Boy) infectious default soundtrack. Finding your flowamong the excellent electronic and metal arrangements feels amazing. Importingyour own tunes is also easy and the results can be surreal; stabbing bouncingslimes to the Warcraft II soundtrack is more fun than it has any right to be.Beyond the musical integration, the structure is similar toother roguelikes. Exploring the procedurally generated mazes, hoping a treasurechest doesn't bite you, and digging through walls is all part of the appeal. Iloved stumbling upon my favorite weapon (a powerful flintlock rifle) andstocking up on useful items from the gleefully singing shopkeeper. However, Iwas disappointed by the number of floors that kicked off with a huge middle finger,like bosses that bum rush you just as you're finding the beat. A few permanentupgrades help take the sting out of your repeated deaths, but they run dry fartoo early, making progression feel imbalanced for a modern roguelike. Still,purchasing interesting new items to populate your dungeon is an effectivecarrot on a stick.Unfortunately, the core formula of the game can betroublesome when trying to understand or use items. Constantly moving to thebeat makes reading the item descriptions tough, like learning how a vampiricwhip might work, for example. Additionally, pausing to take stock and reflecton your current inventory or situation is a hindrance since it's almostimpossible to exit the pause screen without missing a beat. A Rock Band-stylecount off would've been great. The act of using the items themselves can beclunky, too, thanks to the clever but inconsistent default arrow key combos. Irecommend customizing the item commands to help avoid frustrating mistakes.In addition to unlocking a few permanent upgrades likeincreased max health or coin multipliers, players can also earn alternativecharacters to play. These variants challenge you to approach fun, completelydifferent new ways. For example, the Monk is damaged by gold, but gets freestuff from shops. Dove is a pacifist who can daze enemies on her non-lethalpath to the exit. My favorite, Bard, allows you to ditch the whole rhythmthing. As with a traditional roguelike, enemies move only when Bard does, turningnormally chaotic situations into a more strategic chess-like experience. Bardis an awesome choice for players with musically deaf butterfingers, or anyonewho wants to practice without the constant pressure of keeping in time.Crypt of the Necrodancer is an uneven experience thanks toits built-in unpredictability, but the unique concept is charming andcaptivating enough to justify your time. If you want to test your digits' dancemoves and love great game music, it's worth checking out.Get a better look at the game by watching us play on Test Chamber.", "date": "Apr 21, 2015", "grade": "8"}