{"name": "Titan Souls", "ref": "https://www.gameinformer.com/games/titan_souls/b/pc/archive/2015/04/13/standing-tall-on-the-shoulders-of-colossi.aspx", "text": "Boss battles provide some of the most potent memories wetake away from our favorite games. I'll never forget the first time I battedAgahnim's magic blasts back at him in The Legend of Zelda: A Link to the Past,or took down the first lumbering stone giant in Shadow of the Colossus.Developer Acid Nerve recognizes the appeal of a good boss fight, and they'vecombined the essence of the incredible games I mentioned into a unique packagethat trims the fat and focuses on big confrontations. More than just a tributeto either game, the studio infuses the core concept of hunting down giantancient beasts from Shadow of the Colossus with enticing elements like extremelethality, top-down Zelda-inspired battles, and a captivating sense of mystery.Titan Souls sets players off running with a deliciouslysparse tutorial. You can run, roll dodge, and shoot an arrow that can also bemagically recalled (think of Yondu from Guardiansof the Galaxy). Aiming the arrow in the top-down perspective is as easy asholding the fire button and using an analog stick to aim in the rightdirection. No aiming aid extends beyond the top of your arrowhead, so learningto dial in clutch shots takes time and patience.Speaking of patience, you're going to need lots of it if youwant to enjoy taking on Titan Souls' cast of tough boss battles. Players trackdown and confront a varied collection of the titular titans (I conquered 16during my playthrough), and they're going to crush you - over and over. Themysterious, titan-slaying protagonist dies in one hit, but titans also can onlywithstand one arrow to their vulnerable spot (usually pink). The result is atense, challenging, and ultimately rewarding collection of one-on-ones. I died179 times during my first playthrough, but the only penalty after each death istrekking back to the boss. Downtime between attempts is mercifully short, whilestill allowing you time to reflect on how you blew it. Still, by my 20th deathat the hands of a particularly nasty boss, I was wishing it took less time toget back into the fray.Titan Souls has some of the best boss variety I've seen,which is good when the action is composed of 100-percent big bad guys; no otherenemies get in your way between fights. One titan is a speedy, snowball-chuckingyeti with a penchant for rolling and miserably vulnerable hind quarters. The fieryblob that alternates between spewing and inhaling lava is one of my favorites,and requires players to make clever use of their unique arrow. The battle thatgave me the biggest trouble involves turning a titan's own attack against it,opening up a narrow opportunity to deliver a killing blow. While this battlewas exciting and a joy to eventually overcome, it highlights one of my maincomplaints with Titan Souls. Too many times I could've sworn I saw my arrowcleanly connect with the target, only to pass straight through or bounce offimpotently. This might not matter in a game with more forgiving combat (or healthbars), but they stick out like throbbing pink thumbs in the context of TitanSouls' ultra-lethal combat. Taking on all the titans isn't as simple as a boss rush atthe end of a Mega Man game. Traveling through the large, mysterious worldoffers much-needed downtime between repeated, sometimes-stressful throwdowns. AcidNerve again wears its love of Shadow Colossus on its rune-etched sleeve, as thecurious wandering between bosses evokes memories of Team Ico's classic. Theserene, contemplative music meshes beautifully with swaying pixelated trees,calm ponds, and other ambient elements. I sank into the experience thanks tothese stretches of quiet solitude; the downtime always succeeded in making thenext battle even more intense. A few basic environmental puzzles, like lightingtorches and a Lost Woods-style maze, offer a little variety in the exploration,but discovering your next foe is mostly about poking around everywhere.The simple, distilled formula is a refreshing change of pacefrom the increasingly complex systems many modern games present to players. Thethematic ground of an enigmatic little warrior battling ambiguously alignedbeasts is worn territory, but Acid Nerve injects enough of its own style andrewarding moments to justify this tribute. The extra challenges you unlockafter beating the game, like a harder difficulty and one-life mode, offer nicereplayability to the five-hour adventure. If you're looking for a stiffchallenge and a captivating atmosphere to lose yourself in, look no further.This review is based off the PC version, but it's also available on PS4 and Vita. See Titan Souls in action in this episode of Test Chamber.", "date": "Apr 13, 2015", "grade": "8.5"}