{"name": "White Night", "ref": "https://www.gameinformer.com/games/white_night/b/macintosh/archive/2015/03/10/white-night-game-informer-review.aspx", "text": "White Night embraces many of the conventions of noir tales (from the mysterious blonde and use of narration to the sense of foreboding) in conjunction with the survival horror genre. The severe black and white visuals are paired with a light/dark gameplay mechanic, combining form and function for this adventure game. As in noir, powerful forces work against the protagonist, extracting a heavy price, and in the end there's no such thing as a complete victory.White Night sticks to the standard adventure game backbone of searching for items and solving puzzles. It drapes on survival horror not only in the chilling, gothic ghosts that inhabit the mansion you investigate, but in another gameplay aspect. The contrasting black and white art style creates areas of shadow and light. To stay alive you have to stay in the light, otherwise you die of fear. Matches illuminate the darkness and thus keep you alive, and are one of the few resources in a game with no weapons with which to ward off ghosts.The malevolent ghosts highlight both negative and positive aspects of the game. You're dead once they get their claws on you (they only vanish in bright light), and since they are often semi-randomly placed in areas, you occasionally have to replay sections simply to be able to run by them. The sometimes-inconvenient save system is also frustrating, as is the fact that the camera angles  while providing appealing framing  can disorient and lead to deaths.Still, this repetition does not completely dampen White Night's tension and scary nature. It's not just a collection of ghost jump scares, but rather a title that successfully layers ambient sounds, timing, music, and other peripheral elements to retain its atmosphere throughout. The constant tension gets to you. I also liked how the script for the narration and the item descriptions added to the overall atmosphere, following the slightly over-written style of classic noir.White Night adeptly merges survival horror with noir to create an alluring visual style and atmosphere. However, neither the story nor the puzzles are exceptional, and the game comes up just short. It has substance to its style, but it also doesn't satisfactorily build off its base components  as well done as they are. In the end, like many noir stories, this game exists in the grey.This review is based on the PlayStation 4 version of White Night. The game is also available for Xbox One, PC, Mac, and Linux.For more on the game, be sure to check out our Test Chamber with it.", "date": "Mar 10, 2015", "grade": "7.5"}