{"name": "Ori and the Blind Forest", "ref": "https://www.gameinformer.com/games/ori_and_the_blind_forest/b/xboxone/archive/2015/03/09/beauty-in-death.aspx", "text": "Within the opening minutes of Ori and the Blind Forest, developer Moon Studios teases a playful and uplifting experience that focuses on two unlikely companions  Ori and Naru  coming together to form the bond of friendship. These moments unfold through a heartfelt warmth we rarely see in games  the kind where you just want to sit back, observe, and not interact for fear of interrupting the delicate fabric of happiness shared between these two characters. Their friendship frames a beautiful introduction to a game, a triumph of both visuals and storytelling.Moon wants you to fall in love with these characters, quickly and unconditionally. This makes the next series of events hit with as much force as possible  leading to moments of shock and despair, and questioning if theres reason to continue playing. In these sequences, we witness the accelerated death of Nibel Forest, Ori and Narus home. The world falls to darkness. Deadly briar patches and predators fill the spaces that once held fruit-bearing trees. The only hope of this world surviving lies with Ori, an outcast forest spirit who, in a moment of great sadness, learns hes gifted with the power to bring life back to the world.What unfolds next is a fascinating exploration of a dying world; a journey filled with breathtaking environments and a surprising amount of death  not of characters met along the way, but Oris. Ori and the Blind Forest is every bit as challenging as it is beautiful. From the outset, it delivers the impression that its easy to pick up and play, with focus falling more to the visuals than meaningful gameplay trials. It looks like a colorful platformer for everyone. As you progress, you learn that couldnt be further from the truth.The early moments of Ori joyfully spinning and twirling across harmless platforms dont last for long. Once the gameplay kicks into high gear, Moon pushes players to perform flawlessly. Skill is paramount. Slight miscalculations in timing result in Ori crushed beneath boulders, and burned to ash by lava. There were times where I found myself doubting my abilities, wondering if I would ever make it to the end. I died often  repeatedly in the same spots  but never once did I feel my deaths were the fault of the controls or bad gameplay design. Most death came from me panicking and messing up my execution. Ori controls admirably, allowing for such demands. His ever-expanding moveset (which offers slick wall-running, ground-pounding, and an inventive ability that slingshots him higher) is expertly designed, allowing players to rapidly fire off a wide variety of moves to tackle crazily designed vertical spaces. None of these abilities feel tacked on. Theyre all fun to use, and make Ori look like an acrobatic badass. The challenges are wonderfully scripted, often pushing for as much skill as they do creative thinking. Like all sidescrolling Metroid games, there are plenty of secrets hidden in this world, many demanding thorough exploration and leaps of faith. This is one of those games where you'll want to take the time to veer off of the critical path to fill in the map.Combat is also a central focus, but it almost contradicts the platforming design, relying more on rapid button pressing than precision. Oris primary attack is a white flame that automatically homes in on targets (though its functionality sometimes leads to frustrating instances where the shots arent hitting the desired target). Ori is as nimble as Samus Aran, but even with a fully upgraded arsenal (which is unlocked by earning experience and finding skill points), he isn't a killing machine. His combat prowess is impressive, but it takes a backseat to movement. The focus of this experience is almost always on the platforming, even for boss encounters.There isnt a bad moment in Ori and the Blind Forest. Every design has a purpose. Every challenge feels lovingly made. The story, which I expected to die off after the introduction, stays strong and makes a few crazy twists along the way. Even backtracking (of which theres a fair amount) is quick if you want it to be, or loaded with opportunities to explore previously unreachable areas.Interestingly, the game rarely auto-checkpoints progress. Players must manually save whenever they want a checkpoint in an area. This process isnt handled through menus, but is instead a central part of the control. Just hold down the B button and you create a new saveif Ori has energy to spare. Energy is a little hard to come by early on  leading to moments of weighing risk and reward  but quickly becomes abundant, allowing players to create as many saves as they need. Yes, there is some concern of losing progress from forgetting to save, but trust me, the game conditions you to save often. Once you complete a ridiculously hard sequence, the immediate thought afterward is I dont want to do that again. Save!Ori and the Blind Forest is one of the best games of the year, and should be a no-brainer for anyone looking for an exciting new adventure to dive into. That said, it comes with a warning: Expect to be humbled by its difficulty. Death comes quickly. Over and over, youre going to watch an adorable little creature perish because you had a moment of indecision or your skills failed you. Again, nothing about this experience feels unfair. Some of the long scripted sequences are enormously challenging  to the point that youll likely repeat every swear word that you know. My wife periodically poked her head into my game room to ask if I was having a nervous meltdown, but I instead told her that I havent had this much fun with a game in a long time.", "date": "Mar 09, 2015", "grade": "9.5"}