{"name": "Homeworld Remastered Collection", "ref": "https://www.gameinformer.com/games/homeworld_remastered/b/pc/archive/2015/03/03/reliving-the-sci-fi-past.aspx", "text": "Homeworld is fondly remembered as one of the frontrunners of the real-time strategy genre, and allowed players to engage with the RTS in fascinating 3D space for the first time. While we may still be hungry for a new title in the series, this remaster does plenty to whet the appetite as it serves up a comforting nostalgic meal with some new garnish.The Homeworld Remastered Collection gives players access to remastered versions of Homeworld and Homeworld 2 along with classic editions of each game. Returning to titles that harken back to another era of PC gaming is a bit surreal, but I enjoyed revisited a time when real-time strategy was one of the most popular and exciting genres.In the fully 3D setting of Homeworld, you participate in traditional resource gathering and collecting, building up formations and forces, and skirmishing and colliding with enemy forces in a variety of situations. From strategic combat to inventive units, everything that made the originals fun to play is here in full force. Of particular note thats uncommon in the genre is that you retain a persistent fleet through the campaign, keeping resources from mission to mission; expect to get attached to your ships, which makes dangerous encounters even more intense.The campaigns of both Homeworld and Homeworld 2 hold up today, though some remnants of older design are still intact  things like long, repetitive, slow, and boring missions. But for the most part, the story is interesting, especially in the first game, as you command the Kushan against the Taiidan in a quest to find your homeworld. For new players to the titles, there are some trial-and-error missions that might be frustrating, but if youre at the table to play a remastered real-time-strategy game, you can weather the asteroid storms.The original Homeworld is more focused on story, while Homeworld 2 adds more bells and whistles in terms of gameplay and technical improvements (these boosts somewhat downplayed now that both games have been significantly upgraded), but both games produce worthwhile experiences today thanks to the overhaul. They are loyal to the source material and look more enticing thanks to the substantial visual upgrade, though I cant help but wish that Gearbox had brought some new things to the table beyond adding polish to existing content.Though it looks great, this remastering is far from free of bugs and other quirks, ranging from random minor gameplay instances (like formation issues and bizarre targeting logic) to hard crashes. While these did not detract significantly from my playthroughs of either game, you shouldnt plan on an entirely smooth journey through the stars.Homeworld Remastered technically has a multiplayer component that melds together elements of the online modes of Homeworld 1 and 2, but it is currently in beta. Games are difficult to come by online and feature an assortment of bugs (crashing) and other issues that could use some looking into (rejoining dropped/crashed games). If online play is a major draw for you, wait until this mode has been polished, stabilized, and officially released. As it stands, pick this collection up only if you are content with the two remastered core titles.If you never experienced the Homeworld titles during their initial run, this collection is a great way to take a look at an incredible RTS experience in a world that sees the genre waning. The package does a dutiful job providing classic versions of both titles as well, so if youre a purist or you just want to compare and contrast versions, theyre great to take a peek at and a welcome bonus.", "date": "Mar 03, 2015", "grade": "8"}