{"name": "Aarus Awakening", "ref": "https://www.gameinformer.com/games/aarus_awakening/b/pc/archive/2015/02/27/aarus-awakening-game-informer-review.aspx", "text": "Traditional hand-drawn animation feels like a lost art, but Aaru's Awakening is an incredible reminder of the magic inherent to this antique craft. Modeled after 70s comics and animated films, every vista and enemy in Aarus Awakening was painstakingly drawn with pencils on paper before it was scanned into a computer  in many cases the original pencil lines are still visible. The game is awash with vibrant visuals that lend an art-house vibe, but the unconventional platforming mechanics need a little more time on the drawing board. Aaru's Awakening is an old-school platformer that immediately drops you into a series of brutal jumping challenges. Sadly, the world isnt nearly as exciting to navigate as it is to look at. Checkpoints are too sparse considering the series of surprise death traps you rarely see coming. I like thinking on my feet, but Aaru constantly throws you for a loop with unexpected crumbling floors and other surprise dangers that send you back to a checkpoint and force you to replay several platforming sequences youve already mastered. This trial-and-error experience is more frustrating than rewarding.The one notable twist on all this jumping is a unique teleporting mechanic; you fire off a series of energy balls that act as destination markers for teleportation. I enjoyed zipping around the screen using Aarus teleport, rebounding balls off walls to reach otherwise inaccessible platforms, and even using this teleport to slip through cracks in the walls. Unfortunately, this tricky puzzle-like mechanic adds one more wrinkle to a platforming system full of creases, and during the hectic platforming sections its too easy to send yourself teleporting into a bottomless pit or row of spikes. This challenge is all the more frustrating thanks to an unusual control scheme that makes you feel like a brand new gamer. Aaru can dash forward and shatter walls, but he doesnt always dash in the same direction that hes moving. Buried in the menus is the option to change that, but since there are a several instances where you need to dash in the opposite direction than youre moving, this isnt very practical. This one gameplay choice bucks 30 years of platforming know-how and common sense, and I had trouble rewiring my brain to adjust to this offbeat control system. Ultimately, Aarus Awakening is a beauty marred by convoluted controls, an insignificant story, and trial-and-error gameplay. Lumenox Games has given us a great reminder that some of the old arts shouldnt be abandoned, but the rest of the games design doesnt seem to have received the same level of attention. As it stands, Aarus Awakening is more entertaining to watch than it is to play.", "date": "Feb 27, 2015", "grade": "6.5"}