{"name": "Grim Fandango", "ref": "https://www.gameinformer.com/games/grim_fandango/b/playstation_vita/archive/2015/01/26/grim-fandango-remastered-review.aspx", "text": "Grim Fandango is widely heralded as one of the greatest adventure games of all time. Unfortunately, travel agent Manny Calaveras reaper-like appearance was appropriate in more ways than one; the game was a sales flop, and it marked the end of days for LucasArts involvement in the genre. Some things just refuse to die, however, and the release of a new remastered version of Grim Fandango gives a new generation of players the chance to see what all of the fuss was about. Even 17 years after release, this bizarre vision of the Land of the Dead is captivating, mashing together film noir, Aztec religion, and slapstick comedy.When the adventure begins, Manny is a low-level employee at a travel agency for the newly departed. His job is to reap souls and then sell them travel packages to get them to the next stage of the afterlife in comfort. A rival is doing a suspiciously good job of upselling customers, so Manny decides to steal one of the creeps clients. That sets a chain reaction into motion, which leads Manny into uncovering a conspiracy, falling in love, and chasing his paramour across the Land of the Dead.The world-building and characterization are excellent, even if they dont necessarily fit together in a satisfying story. Its really about the journey, anyway. Mannys interaction with a car-obsessed demon named Glottis is one of the high points. Glottis is a great comic foil whos always getting into trouble, and their relationship seems more believable than the love story that Manny has with the client, a departed soul named Mercedes. Glottis gluttonous behavior also inspires several of the best puzzles.Grim Fandango is challenging, especially if you arent familiar with the bizarre logic that governs adventure games. Hand-holding wasnt popular in this era, and designers seemed to relish adding at least a couple of completely nonsensical puzzles. Grim Fandango is no different. You need to pay close attention to every snippet of conversation and background object, while constantly cross-checking possible relationships between them. If you thought you were clever when you put batteries in a broken radio in Telltales The Walking Dead, you dont know the meaning of puzzles.To further complicate things, several puzzles are based around objects that can be broken, consumed, or otherwise used up. As someone who often resorts to a trial-and-error approach when all else fails, that additional wrinkle in the puzzle design forced me to backtrack. The payoffs to failure were rarely interesting or fun (unlike Kings Quest death scenes). Instead, it was mostly infuriating.You cant look at a game like Grim Fandango without considering the context in which it was released. In 1998, adventure games were typically 2D affairs, with point-and-click interfaces. Tim Schafer and his team decided to take advantage of increasing PC horsepower, putting 3D characters against pre-rendered 2D environments. Players took direct control of Manny instead of mouse-clicking him to his destination, and theyd see him pull inventory items from his jacket instead of looking at a genre-standard grid. It was innovative, if not optimal.The remastered version gives players a few control options. On PlayStation 4, you can choose between the original scheme and a camera-relative version. Since Manny is exploring static backdrops, it can be tricky to get a handle on where you are as you shift from scene to scene. Originally, LucasArts did its best to keep things visually interesting by incorporating wild camera angles, and transitioning from one to another takes some getting used to. PC and Vita owners have an additional option, interacting with the world via mouse or touch controls, respectively.Its nice to have some flexibility with the controls, but none of the schemes address one of my fundamental beefs with the inputs. On several occasions I worked out what I thought was the solution to a puzzle, but nothing would happen. Manny would refuse to fire a weapon into a pipe, or dropping an object wouldnt do anything. Frustrated, Id turn to an online guide and discover that I was indeed doing the correct thing. After repositioning Manny, hed finally cooperate, and I could continue on my merry way. At least I didnt have to pay for a call to a 1-900-number tip line.The remastered edition includes more than just new controls. The big visual enhancement comes in the form of redesigned characters. Manny and the crew have all been cleaned up and retextured, though the end results are disappointing. The stylization of the original designs help them hold up, even though theyre aliased to the gills. The enhanced versions are certainly clean looking, but they highlight how technically crude those original models were. Glottis hands are distractingly bad, with sharp triangular fingers jutting from glossy orange orb hands. You can swap between the visual effects at the press of a button, which I did often. Ultimately, I prefer the originals, one big reason being that the backgrounds havent been touched. Its jarring to see shiny, smooth characters walking through comparatively dark and grainy settings. The new lighting effects are impressive, though they have a tendency to obscure important details in dark scenes. You can swap between the original 4:3 ratio or a 16:9 format, though the latter merely stretches the screen horizontally. If youre coming to this with the idea that all of the visuals have been lovingly retouched and optimized, temper your expectations.The audio makes up for many of the visual shortcomings, however. The rerecorded score is fantastic, full of bleating trumpets and cool jazzy tunes. Superfans will gush over the commentary track, which features members of the original team reminiscing about the development and pointing out fun trivia. Its handled in a nice, unobtrusive way: When commentary is available, an icon pops up in the corner. Pressing the corresponding button on your controller plays the selected commentary. That element alone will probably be enough to warrant a replay for people who have already run through the game several times over the years.Grim Fandango is a tough game to evaluate, because it comes with so much baggage. If youre already a fan of the game, the few new additions are nice  but aside from the commentary, theyre far from indispensable. Im curious to see what players who have cut their teeth on the new breed of adventure games think of this decidedly old-school design. I liked Grim Fandango, but its definitely a relic of its day.", "date": "Jan 26, 2015", "grade": "7"}