{"name": "Never Alone", "ref": "https://www.gameinformer.com/games/never_alone/b/pc/archive/2014/12/16/never-alone-review-game-informer.aspx", "text": "I used to love trips to the computer lab when I was in elementary school, because it meant that I got to play games like The Oregon Trail and Number Munchers. I didn't even realize that I was learning; I thought my teachers were suckers for letting me spend school time on the computer. Games can be powerful teaching tools, but they don't need to hide the fact that they have a goal other than pure entertainment. Never Alone is one of these titles; it immerses players in the culture of Alaska's native Iupiat people through art, storytelling, and documentary-style clips. In those areas, the experience is educational and interesting. When it comes to being a fun puzzle/platformer, Never Alone can't make the grade. You guide the girl Nuna and her artic fox companion through a story filled with traditional Iupiat influences. Sinister villains, helpful spirits, and other legendary figures are woven into the tale. Brief documentary segments full of interviews and historical insight tie the action and the legends together. This is the best and most rewarding part of Never Alone; you see a short film explaining the myths surrounding the aurora borealis, and that information better equips you to appreciate the next level, where you see those myths brought to life.Heres the problem: When you arent watching movies, youre playing an unremarkable platformer. Nuna and the fox both need to get through the levels, which can be done through co-op or single-player (by manually switching between the two characters). Depending on which mode you choose, different issues are highlighted. In single-player, you often struggle with the A.I. of your companion, leading to several missed jumps and other pathfinding annoyances. At best, assuming control of the other character just to overcome what should be a straightforward, all-clear scenario gets tiresome. At worst, watching your companion die in a baffling and easily avoidable way is infuriating, though these occasions are mercifully rare.Playing in co-op alleviates these issues, putting more focus on the dull puzzles. If you see ice, you throw your bolo at it. If you see a ledge thats too high, you jump on a spirits back. These pieces remain largely separate, and dont interact with each other in any cool ways. That means the puzzles dont expand in scope, and you arent forced to test your boundaries for the thrill of an A-ha! moment. Nuna and the fox interact with the world in different ways, but its all just mechanical. You immediately see what needs to be done, do it, and move on.The whole experience reminds me of Ubisofts World War I puzzle/adventure game Valiant Hearts; the material that inspires the story is compelling, but the minimal gameplay connecting that content leaves much to be desired. The care with which the Iupiat culture is represented is wonderful, and I loved learning about its customs and history. As an educational tool, Never Alone is a great success, but the gameplay does more to burden than bolster that achievement.This review pertains to the PC version of Never Alone. The game is also available on PS4 and Xbox One.", "date": "Dec 16, 2014", "grade": "6.5"}