{"name": "Far: Changing Tides", "ref": "https://www.gameinformer.com/review/far-changing-tides/call-of-the-sea", "text": "Every adventure is a journey of some sort, but we are often so consumed with the destination we sometimes forget to enjoy the ride. Far: Changing Tides pushes you to soak in the small moments that can be overlooked in our rush to reach the peak. Okomotive newest side-scrolling platformer is a meditative odyssey full of trials and triumphs. But this pilgrimage is so powerful I was often content to forget about my end goal.Okomotives freshman release, Far: Lone Sails, followed in the footsteps of atmospheric puzzle platformers like Inside and Little Nightmares. While Lone Sails wasnt nearly as dark or brooding as those other titles, it set a striking tone as the players navigated a giant land sled across a desolate post-apocalyptic landscape, all the while looking for a new home. Far: Changing Tides is  in many ways  more of the same, but that isnt necessarily a bad thing.Instead of piloting a vehicle over land, Changing Tides puts you at the helm of an oversized boat. The mechanics of this ship are complex enough to be engaging without feeling overbearing. I enjoyed hoisting the sails and moving the mast to catch the wind or shoveling fuel into my engine to give my vehicle a nice push across the water. Along the way, you find ship upgrades, such as a chain to hoist up sunken treasure or an overcharger that grants short-lived but thrilling speed boosts. I couldnt wait to uncover my next upgrade and see how it changed the way I navigated these freezing waters.You encounter various roadblocks during this journey and are often forced to abandon your ship to solve environmental puzzles. These moments are rarely taxing, but I enjoyed stretching my legs to power up a rusted windmill, study the inner workings of a rotted locomotive, or dive for secrets on the ocean floor. Much like Lone Sails, Changing Tides doesnt bother you with tooltips or gameplay explainers; instead, you learn about this world and how everything works through trial and error. Occasionally, I scratched my head at what looked like a dead-end, but after tinkering with the environment for a few minutes, I was always able to find what felt like a well-earned solution.Between puzzle breaks, you experience long stretches where you watch the scenery zip by. These sequences reminded me of the best moments of a long car ride, where you soak in natures beauty. It helps that Far: Changing Tides is full of striking vistas and backed by a moody, often-wistful score.Far: Changing Tides isnt an action-packed roller coaster ride  its a contemplative journey that isnt afraid to slow down and ask you to reflect on your expedition. Of course, this adventure is full of challenges to overcome. But whether I was watching the clouds glide over a flooded city with the wind at my back or white-knuckling through a storm as ten-foot waves bombarded my ship, I was always completely enrapt by the moment. Its a journey I hope to take again someday.", "date": "Mar 01, 2022", "grade": "8.25"}