{"name": "Caller's Bane", "ref": "https://www.gameinformer.com/games/scrolls/b/pc/archive/2014/12/12/digital-tabletop-tactics.aspx", "text": "Mojangs Scrolls is finally here after over a year of alpha/beta testing, and while a significant amount of polish and content has been added, the core gameplay hasnt changed much through the months. Utilizing a deck of spells, creatures, and structures, players do battle on a tactical hex grid, with the goal of destroying three of an opponents five totems. Its a mash-up of collectible card games and tactical tapletop games. Bringing the miniature characters to life out of their cards and positioning them in the perfect spot for battle is a satisfying science, and the progression loop has been tuned to make each game rewarding, win or lose.Players pay a one-time fee to acquire a copy of the game, and then acquire in-game currency. That currency can be spent at the shop to acquire new packs, cards, or used to play the Judgement game mode, Scrolls take on the classic collectible card game limited/draft environment. With four asymmetric factions to choose from (Growth, Decay, Order, and Energy), players can quickly find a playstyle that syncs up with their personal taste and work on acquiring a robust set of appropriate cards. Players with everything can fuse copies of cards together to create spiffier cards that look cooler but have the same functionality, providing a way to show off in matches.You get plenty of gold as you move through the single-player content and from a smattering of achievements during your first few matches. The base rate of currency acquisition is quite generous  you never feel obligated to pay-to-play, nor can you even do so easily; grinding gold is simple, and paying real money doesnt lend you a considerable advantage.Gameplay is fun and cerebral, with each turn presenting players with a host of options regarding what to play, where to move, and to either sacrifice a card for more resources or more cards. A lot of thinking and choice factors into every turn, and you need to be sure of your decisions, because you cant play cards during your opponents turn. I delighted in creating perfect situations where everything happens just so, countering an opponents board with carefully crafted multi-turn setups. Tactics enthusiasts will chortle with glee as the seeds laid many turns ago bear fruit and lead to a decisive win, whereas playing cards and creatures blindly is a surefire way to lose.Surprisingly, Scrolls slavish dedication to the essence of tactical strategy is also its most egregious fault. Turns can go on for what seems like eons, and matches usually last between 20 and 50 minutes, with some going even longer. Long games arent necessarily a bad thing, but in Scrolls the games feel long even when theyre short, and they do so at a major detriment to the title. Waiting for an opponent to laboriously plot out their moves is agony, a gift you return to them as you plan out yours.Ive been playing Scrolls on and off for about a year now, and the launch version is a solid title for strategy enthusiasts and collectible card game fans to take a peek at. That said, know what youre getting into: Despite having many aspects working in the titles favor, the games themselves can still feel like a chore. A pretty, well-crafted, and well-intentioned chore, but a chore nonetheless.", "date": "Dec 12, 2014", "grade": "7.75"}