{"name": "Let It Die", "ref": "https://www.gameinformer.com/games/let_it_die/b/playstation4/archive/2016/12/12/bizarre-brutal-fun.aspx", "text": "Unplugging your first character from the Matrix-style tubing and setting off into the sky-high Tower of Barbs is a daunting, strange task. Scooping up mouthfuls of exotic mushrooms, battling an endless stream of foes with scavenged red-hot irons, and attempting to stave off death until the next elevator checkpoint is just the beginning of a layered adventure that pits you against deadly traps, bosses, and other players in asynchronous high-stakes combat.At the core of Let It Die is combat, brutal and bloody. Fighting feels like Dark Souls lite, with essential dodging and parrying as you attempt to land that goretastic finishing move on an enemy for extra rewards. Its not as robust as a Souls title; many enemy attack patterns can be gamed with simple draw-out and parry, the lock on combat targeting is dangerous to use in melee, and the gunplay isnt fantastic. While its far from perfect, the combat (and the different playstyles it supports) is a satisfying element weaved in with the rest of the progression and reward loop.Standard enemies in many areas can be trivialized with upgraded weapons and armor, but the tension never goes away. You must always contend with other players that have died in the area, creating haters  ghosts that patrol the area looking to kill you. Players can also hunt you directly with characters from their storage, tasking them to find and kill you. Assembling and outfitting your roster of slayers, explorers, and dungeon-climbers is fun.This aspect keeps you on your toes at all times, and even makes farming recipes, gold, and crafting materials an adrenaline rush. You never know who you might run into, and also provides you with an option to get plenty of resources even when youre not playing the game by sending your troops out on missions to slaughter other players. The loot loop is tantalizing, and because some elements of each floor are random, it rarely gets boring.Death is never far away, as you continue to climb the tower to face stronger opponents. Youre also getting stronger by collecting and upgrading many recipes found in the tower that provide much better options than the salvaged pipes and hammers laying about. Unlike a traditional roguelike, death doesnt need to be the end, as you can pay a price in gold to bring your character back with all their levels and loot. Alternatively  and most insidiously  when you can use real money to bring them back to life right on the spot, allowing you to continue. This also means you can just brute-force your way through with your wallet, if you can afford it. While this isnt a big deal for a single life now and then, taking on something much stronger than you costs a pretty penny. I became frustrated with the system when dying to a high-level Hunter, ranged weapon salvo, or other situations with almost no chance to survive, only to be offered this cash solution to save myself a significant amount of progress and time.Let It Die offers a steady trickle of cash currency for daily logins and quests, but the ease of coming back instantly over and over for a price feels like poor implementation bordering on predatory, especially as an exploitable crutch to take on bosses to make progress and gain new unlocks, take on a Jackal hunter (incredibly powerful characters with insane gear), or just prevent the pain of grinding out hundreds of thousands of gold to bring a beloved character back to play.The gameplay systems are explained over the course of a lengthy tutorial that mostly works. The higher you progress, the more options you unlock, including higher-tier fighters, vending machine boosts, and customizable decals to augment your roster of punishers. Of particular note is the Tokyo Death Metro, which allows you to invade other players headquarters and rob them of resources. You have to fight through any defenders they may have set up in their base, but you have a chance to capture downed fighters and bring them back to your own base to drain their life essence for even more resources. This incurs the ire of the players you rob, who will likely come back and try to rescue their fallen fighter. This player-vs-player system is fun, and feels quite similar to base-bashing mobile games like Clash of Clans, with players selecting and representing a faction (states, countries, etc.) to create larger wars.Let It Die features a compelling loot loop with plenty of customization for your roster of combatants, over-the-top and odd characters and settings, a killer soundtrack, and fun, intense exploration punctuated by frenzied combat with unusual weapons. Long load times, especially when quickly moving up and down floors in succession or engaging in Tokyo Death Metro, take a serious toll on the fun, and the fact that the seemingly fair free-to-play model allows anyone with a big bank account to smash bosses, eliminate research times, and basically just breeze through situations where non-paying players may falter is a serious hindrance to being the amazing game it could be.", "date": "Dec 12, 2016", "grade": "7.75"}