{"name": "WWE 2K15", "ref": "https://www.gameinformer.com/games/wwe_2k15/b/playstation4/archive/2014/11/17/wwe-2k15-review-game-informer.aspx", "text": "WWE K15s first shot on PlayStation 4 and Xbox One makes some long-needed tweaks to the formula, but some new elements could use more polish and several content cuts hurt the overall package.The improved visuals are the first thing to hit you. Thanks to added hardware horsepower and new scanning technology, WWE wrestlers have never looked better (though ugly non-scanned character models stand out). Faces register everything from pain to a cocky smirk. Movement overall looks far more realistic, with added rope interaction and the toning down of cartoonishly fast strikes.A universal health bar keeps track of all damage (instead of just specific body parts), providing a handy way to track which character is currently ahead. A new stamina meter assigns every move a cost, and can require recharging if youve blown it all and want to perform a big move. This also means wrestlers movements become slower and groggier toward the end of the match just like in real life. If you dont want to worry about stamina as much, its impact can be minimized in the options.A new chain wrestling minigame starts off most matches, requiring you to win a rock-paper-scissors hold selection and then find a sweet spot with the right stick before your opponent. Its disrupting at first, but once you get used to it, its a useful way to score some early damage, and it ensures things dont turn into a suplex-fest right out of the gate. If you dont dig it, you can scale it back or turn it off.The 2K Showcase mode replaces last years focus on the legacy of Wrestlemania. The two storylines on display cover the rivalries between John Cena and CM Punk from 2011 to 2013 and Triple H and Shawn Michaels from 2002 to 2004. In an entertainment medium that always juggles a multitude of storylines at once, its a nice change of pace to focus on two guys at a time and follow the ups and downs of their rivalries. Not every match feels as important to the story, however, with a few filler Raw entries added to round things out. While I appreciated the break from controlling and battling the same four guys over and over, the epic vibe is lacking in certain matches. This mode is essentially identical to the last-gen version, as is the comparatively meager roster (the most notable new-gen addition is William Regal).The new MyCareer mode allows you to take a created wrestler from the NXT developmental league through earning the top spot on the WWE roster. The story starts promisingly with voiced cutscenes from real NXT trainer Bill DeMott, but quickly devolves into bland text from former WWE authority figure Vickie Guerrero. Your stats are non-existent to start, so your wrestler controls terribly for quite some time. You mindlessly drudge from one match to the next with a rare, thin, text-based challenge popping up from time to time. I relinquished the NXT title with the promise that Id get a shot at better belts, but I ground through Superstars, Main Event, and much of the Smackdown sections of the career before getting any mention of a title shot. You start to at least get more rivalries going in Smackdown, but its still mostly text combined with brief clips starring your silent mannequin. MyCareer needs more of a produced story to pull players through, and deeper gameplay and challenges to keep things interesting.Custom creation takes a huge leap forward with the new logo manager, which allows players to upload and share any appropriate image via the 2K site and place it on their wrestler (rather than relying on a clunky in-game image editor). This makes it easier than ever to create and gather better-looking custom characters and stay up to date on the latest shirts and gear the real wrestlers are wearing on TV. The latter is also helped by the new ability to fully edit real wrestler outfits rather than simply alter the color. Created wrestlers may look better on new-gen, but youll have fewer to work with as the characters slots have dropped from 100 on last-gen to 25.Customization also takes a few steps back with the removal of the story designer and the ability to create special moves, arenas, custom divas, and championships. Based on what you prioritize, youll have to weigh whether the improved imaging tools are worth the sacrifice.Speaking of cuts, several exhibition match types didnt make the leap to PS4 and Xbox One. Obscure matches like Inferno and I Quit have dropped from one on one while any form of table and ladder matches are missing from 4-person action. Every category is hit by cuts so its smart to research if your favorite modes have but axed this year, especially if youre a big fan of local and online multiplayer.This first new-gen edition of WWE 2K15 lays a solid foundation in the presentation and mechanics, but its hurt by cuts and 2K Showcase and MyCareer in particular need plenty of work before theyre ready for the main event spot.", "date": "Nov 17, 2014", "grade": "7"}