{"name": "Escape Dead Island", "ref": "https://www.gameinformer.com/games/escape_dead_island/b/xbox360/archive/2014/11/17/game-informer-review-escape-dead-island-xbox-360.aspx", "text": "The Dead Island series has shambled along an unpredictable path in recent years. It has seen the departure of the original developer Techland, a MOBA spin-off, and now a third-person action game. Like a zombie examining its own decaying face in a shattered mirror, the series just doesn't seem to understand what it is. Escape Dead Island 's single-player adventure is plagued with enough technical and design horrors that every copy of the game should be sealed shut and stamped with enough biohazard symbols to keep innocent fans of the series away.Escape Dead Island stars one of the least likeable protagonists in all of video games, and not in the cool anti-hero way. Cliff kicks off his quest by proudly stealing his friend's school notes, listening to her private audio journal, and uttering the phrase ~the *** abides.~ Cliff sucks, and you're stuck with him as he tries to work through his daddy issues by getting the scoop on the zombie-infested island of Narapela.Escape Dead Island's plot packs all the fun of a so-bad-it's-bad '80s horror flick, complete with a vapid cast of characters. The story unfolds in motion comic-style cutsenes that are so sparse it's difficult to understand what's even happening. Where story takes a backseat to bashing zombies and leveling up in the rest of the series, the clumsy narrative is front and center here.Part of the action in Escape Dead Island consists of sneaking past groups of zombies. The stealth mechanics involve staying out of the zombies' sight while trying to move past, or closing in for a screwdriver takedown. Getting the ~Stealth Kill~ takedown prompt to pop up requires positioning Cliff perfectly behind an enemy - any slight deviation here and you are reloading a checkpoint. You can also be slashed by enemies while engaging in these cinematic kills, making what should be an empowering achievement into a liability.Sometimes stealth isn't an option, and hacking or shooting your way through zombies is the only choice. Cliff can swing melee weapons like axes and swords with heavy or light attacks. Unfortunately, Cliff has all the durability of a child's sand castle - crumpling after just two or three measly hits. The sloppy blood-splatter regenerating health UI also does a poor job of indicating his current status.Heavy attack animations take way too long to perform, meaning that combat is all about slashing quickly then dodging or running away. Unfortunately, Cliff's stamina meter drains faster than a pack-a-day smoker running an ultra-marathon. Even worse, enemies are about twice as fast, with long-reaching attacks that seem to magically magnetize toward you. I was consistently downed by enemies that swiped at me from several arm lengths away. Gun combat is safer but still awkward, with agonizingly sluggish aiming and enemies that react inconsistently to being shot. Sometimes they stumble, and sometimes they act like you shot them with a rubber band gun.Mission structure is equally frustrating. Cliff embarks on a lengthy sequence of fetch quests that have him hunting down keycards. You may venture to meet someone, only to find out they're not where they're supposed to be, forcing you to backtrack in the direction you just came from. Making matters worse, Cliff suffers from psychosis during the whole ordeal, which is developer Fatshark's attempt to screw with players' interpretation of reality. Characters come back to life, cargo containers rain from the sky, and sometimes the color palette suddenly changes. The only worthwhile event I experienced involved lightning striking the battlefield and then time freezing. I enjoyed luring zombies into the frozen lightning and watching them fry. This glimmer of style is surrounded by dozens of heavy-handed moments that feel like they're trying to poorly recapture the hallucinogenic elements of Dead Space 2 or Batman: Arkham Asylum's Scarecrow sequence.Escape Dead Island might not be so terrible if it maintained a steady pace of frustrating combat and banal objectives, but developer Fatshark insists on ramping up the difficulty level as you near the finish. The final hours include some of the most infuriating encounters I've ever experienced, and I've played a lot of awful games. At one point I had to crank up the brightness all the way up (on my TV and in-game) just to see the reflective, labyrinthine pathway leading through the final area, all while being pursued by shadowy zombies that kill Cliff in two hits. The final gauntlet of zombie arena battles had me doubting that I could actually beat the game. When you're hoping that enemies will glitch out and accidentally fall through the world (which they did more than a few times) so things get easier, you know something is very wrong. Dozens of deaths and repeated dialogue lines are now burned into my brain, and I want to make sure nobody else has to endure this.While playing through Escape Dead Island, I was continually offended that anyone would be asked to pay for this experience. Any number of developmental issues could have caused this train wreck, from budgetary problems or creative crises, and we'll likely never know the whole truth. But as it stands, Escape Dead Island is worth nobody's time.Note: This review is based on our playthrough of the Xbox 360 version.", "date": "Nov 17, 2014", "grade": "2"}