{"name": "Sonic Boom: Rise of Lyric", "ref": "https://www.gameinformer.com/games/sonic_boom/b/wii_u/archive/2014/11/13/game-informer-review-sonic-boom-rise-of-lyric-wii-u.aspx", "text": "No matter how fast he sprints, Sonic just can't seem to outrun the curse that follows him from game to game. Big Red Button's Sonic Boom: Rise of Lyric game ties-in with the new Cartoon Network show, but this new entry still suffers from problems that have plagued the series for years. Even worse, it layers on a new level of sloppy combat for Sonic and his friends.As part of Sonic's Cartoon Network debut, he and his whole crew have been redesigned. Sonic, Tails, Knuckles, and Amy all look vaguely different than their previous incarnations and are sparsely wrapped in white tape, like the laziest mummy costumes you could imagine. The slimmed-down Dr. Eggman is still a thorn in their side, though he's sidelined when a new nemesis, the cyborg snake Lyric, comes to power. Sonic and the gang collect a bunch of crystals to once again save the day while battling legions of generic robots. The story is a vapid parade of tropes, with jittery cutscenes and eye-rolling humor. Big Red Button insists on forcing the gang's annoying, quirky new attitudes onto players, with tons of repeated one-liners like ~That's got a nice ring to it~ and ~Stop, drop, and roll!~ These guys won't shut up about how much they love rings. Dr. Eggman even spouts out groan-inducing, poorly aged meme references, like ~Nailed it!~ or ~That. Just. Happened.~In addition to Sonic and his crew's new 'tudes, they also have a new misplaced tendency for melee brawling. Landing punches is heavily dependent on the auto-magnetism that guides characters towards their targets. Some enemies can also easily chain multiple attacks on characters, sending your rings flying (which disappear too quickly to recover a meaningful amount). Dodging is also a mixed bag; sometimes you're granted a generous invulnerability window and other times just being too near an enemy will send your rings flying. Sonic and pals also have energy beams which are used to traverse the environment and lasso enemies. Snagging your desired target is an inconsistent ordeal. The game often automatically locks onto the wrong target, opening you up for an attack. When it does work, tethering enemies and tossing them over ledges makes many encounters trivial.One or two players can swap between all four characters when exploring the larger hub areas, complete with a useless map that you don't even receive until the second act. This map doesn't perform basic map functions - like showing which direction you're facing - and sometimes fast-travel is inexplicably broken. Sonic can spin dash towards enemies, which is also useful for accessing areas specific to him. Similarly, Knuckles is now a beefy brawler that can climb walls and ceilings, Amy packs a big mallet and triple jump, and Tails can hover and blast enemies with rockets. Switching between characters in combat is a cool concept initially, but once you realize Knuckles is the strongest, you have no incentive to mix it up. Similarly, Amy's triple jump makes her best for general exploration, especially considering Sonic is as slow as the rest of the cast (Strange move, Big Red Button).When you're not exploring and punching things, you'll spend time completing platforming-heavy challenges and running real fast. Jumping between platforms and avoiding various hazards actually feels slightly improved over recent entries, but that's offset by shoddy level design. Enemies might pop out of the ground faster than anyone would be able to react, and other times the best solution is soldiering through a minefield of hazards while hemorrhaging rings. The series' infamous, linear speedy sections return, complete with touchy controls that make dodging the fast oncoming obstacles frustrating. Tying these sequences together are brief, banal sequences where Sonic and pals are bounced around the environment like pinballs, leaving the player with little to do.The game is a little more fun with a co-op buddy. One player uses the GamePad screen and the other wields a Wii Remote and Nunchuck while watching the TV. You can swap between the characters at will, unless you're working through a section specifically designed for a duo. Having an ally to bash in Lyric's robots army helps trim down the time spent in the lackluster combat sequences. Players can simultaneously travel down routes unique to their abilities, which is cool - even if the platforming sections are mostly forgettable. Playing two-player co-op comes with a hefty price, though. The already rough framerate becomes laughably low, and the textures and lighting take a huge hit. There are also some four-player competitive and cooperative minigames, but a few wave-based arena maps and platforming sequences aren't enough to justify gathering up willing friends.I was initially excited when Sega first announced that Big Red Button would be developing Sonic Boom. I thought Sega handing the iconic license over to a new developer might shake Sonic loose of the slump he's endured via a string of rough Sonic Team titles. Unfortunately for fans and the Hedgehog himself, Sonic Boom is a blemished bore.", "date": "Nov 13, 2014", "grade": "4"}