{"name": "The Legend of Korra", "ref": "https://www.gameinformer.com/games/the_legend_of_korra/b/xbox360/archive/2014/10/29/game-informer-review-the-legend-of-korra.aspx", "text": "They dont make em like that anymore isnt always a compliment. The Legend of Korra is part of a breed of licensed games that we see less of on major consoles and PC these days. Not so long ago, it was common to see budget-minded projects like these duping franchise fans, but many of those efforts in recent years have transitioned to the mobile space. The Legend of Korra harkens back to that dubious tradition, with a game that feels unbalanced, light on content, and tedious. Nods to the excellent source material abound, and the beginnings of a compelling combat system are present, but this Avatars journey ultimately fails to find enlightenment. Sandwiched between the second and third season of the cartoon, Korras game puts her up against a number of familiar minor minions to beat down, along with a new antagonist concocted for this occasion. The plot feels every bit the side story, and fails to capitalize on the rich characters and relationships of the franchise. However, charming voice work from the original actors lends authenticity to the experience, and brief moments make you feel like youre in an episode of Korras adventure.Unfortunately, the levels yank away the authenticity. Backdrops of Republic City, Air Temple Island, or the South Pole all nod to the fiction, but with no variety or effort put into the presentation, each location grows tiresome. Finish a fight in any given locale, and its easy to be completely lost about which way to go  every direction looks the same.The bulk of gameplay is combat-focused, in which Korra holds her own against a cavalcade of chi blockers, benders, and unruly spirits. Much of the game is spent unlocking access to your four elemental attack styles, which means that early fights feel limited and underpowered, with a paltry number of attacks to choose between. By the time youve unlocked most of your abilities, the game has ended, with a tacit implication that you should play again on a higher difficulty with some new enemy configurations. Battles do indeed feel more compelling on a second playthrough, but the boring level design and nearly non-existent storytelling make it hard to stomach another run.No matter how far into unlocking powers you are, the battle controls feel clumsy. Inconsistent dodge and counter techniques are hard to rely on, while your offensive moves often have a strange delay before triggering. New attack combos unlock as you level individual elements like fire or water, but on the standard difficulty, button mashing often nets the same result as carefully planned attacks. Progression through a stage often demands you complete a certain sequence of moves in repetition, like an unbroken chain of attacks without damage, or a certain number of counters. These prescribed ways to confront a fight take freedom away from the player. Camera controls are functional, but enemies frequently block the view of the action  I fought one set of gigantic robotic mini-bosses almost entirely blind because one of the big lugs wouldnt get out of the foreground.Combat is tuned to be surprisingly difficult, but in a way that often feels unfair and haphazard. Enemies hit too hard, or land blows in quick succession without offering the chance to recover. Boss monsters have painfully long health bars, up to and including the final boss, a fight that seems to stretch on forever.In between fights, occasional side paths offer a few hidden collectibles, but several spots are blocked with gates that require an element you wont have until a second playthrough. Unlike these optional pick-ups, the game also includes an endless runner-style minigame, in which Korra rides her trusty polar bear jog along increasingly crowded alleys at ever-increasing speeds. This little palette cleanser activity would do its job better if it didnt lead to so many cheap deaths as you hit a wall or fall in a pit. Complete the game, and you can access one other option  pro-bending. Its hard to imagine investing too much time in the shallow action minigame, which sees players replicating the shows popular arena sport. This single-player experience feels like it should be multiplayer, and the competition feels shallow, since you and your teams skill is largely based on how much youve leveled Korra in the story.The Legend of Korra is a great TV series that is ripe for a strong video game adaptation, and Platinum has laid the groundwork for an interesting combat experience. However, missteps in balancing, combat timing, and level design add up quickly, and even Korras sassy quips cant pull the game back from the brink. Id love to be able to recommend Korra to fellow fans, but Platinum Games has missed the mark this time.", "date": "Oct 29, 2014", "grade": "5.5"}