{"name": "Super Mario Maker For Nintendo 3DS", "ref": "https://www.gameinformer.com/games/super_mario_maker/b/3ds/archive/2016/11/30/super-mario-maker-for-nintendo-3ds-game-informer-review.aspx", "text": "Super Mario Maker on Wii U quickly became a phenomenon after its release in 2015. More so than playing and building levels, seeing the creations of others became a popular spectator sport as makers came up with the most creative and difficult ways to challenge Mario players. Much of the charm of the console game (like its easy-to-use creation tools and perfect platforming) make it over to the 3DS. However, one of its most important features did not make the transition: sharing levels online. It holds the game back, but I still found plenty to appreciate about the portable Mario Maker.Mario Maker on Wii U carefully doled out its tutorials over the course of a few days. You had to wait to learn new lessons and get new tools. This was done to not overwhelm players, but many like me advanced their Wii Us internal clock in order to get access to all the tools faster. The tutorials of the 3DS version can be ignored, but are available all at once if you want them and the game is better for it. The optional tutorial serves as a nice refresher and features some funny dialogue between your previous trainer, Mary, and the edamame-obsessed pidgeon, Yamamura. It also puts a stronger emphasis not on just how to use the tools, but what makes a good Mario level.Not all the creation options are available from the beginning. To unlock the advanced ones, you need to play through the new-for-3DS mode Super Mario Challenge  a collection of more than 70 new levels created by Nintendo. Each level also features a pair of medals awarded for completing specific tasks, like only defeating a certain type of enemy or getting a certain amount of coins. Going after these medals is fun, especially the stranger qualifiers that make you rethink how you play Mario. These levels are high-quality and offer incidental tutorial on what makes a good Mario level. Super Mario Challenge is a fun platformer campaign, and getting new mechanics is a worthwhile unlock. I prefer this way of expanding the tools over having to wait, or hack my Wii U.The condensed 3DS screen makes each version of Mario, from 8-bit to modern, look great. The visual disparity between the Wii U and 3DS versions is minor, and it runs smoothly on the handheld, which makes the platforming as good as it has ever been. The switch between editing a level and playing it involves a brief load, but it does not slow things down enough to impede the process of instantly testing your creations. The touch-screen works well, too, making the act of dragging the bricks and enemies onto the screen simple and easy.Online functionality, which is all found in the Course World mode, is present, but severely limited. You can play 100 Mario Challenge, which throws 100 random user-created levels from the Wii U version at you, or play Recommended Courses, which lets you choose from a collection of Wii U courses with positive feedback. On 3DS, seeking out specific levels or uploading your creations online is not possible. Those options made Mario Maker on Wii U the phenomenon it became, and to see them gone on 3DS is confusing and makes Course World a far less attractive destination. There simply isnt much incentive to explore Course World outside of hoping you run into an interesting course someone made with the Wii U version of the game.The only way to share levels with friends is to do it locally or through Street Pass. Exchanging levels with the person standing next to you is easy and quick. Sharing this way does not require you to beat the levels, which means you can send your friend an impossible undertaking. Challenging your friends with difficult levels was a highlight on the Wii U version; knowing a level could be completed was an important factor in sharing levels, and to see that requirement axed is another head-scratching limitation. The lack of online sharing theoretically encourages local collaboration, but I dont enjoy trading levels back and forth to make changes. This new system makes it feel like I am passing along an unfinished painting, rather than a masterpiece meant to be appreciated.Not being able to share levels online to get global feedback (or show off your creation to a friend across the country) holds the 3DS version of Super Mario Maker back significantly. The fun community aspect is almost entirely gone, which is disheartening. The ability to create, however, still feels great, and playing all of Nintendos new levels is worthwhile. Mario Maker encourages creativity and continues to be one of the best level creation tools ever made, but the limitations on sharing make the 3DS version an inferior experience compared to the Wii U original.", "date": "Nov 30, 2016", "grade": "7.75"}