{"name": "Gauntlet: Darkness Calls", "ref": "https://www.gameinformer.com/games/gauntlet/b/pc/archive/2014/09/29/fleeting-fun.aspx", "text": "Gauntlet is back, complete with coffers full of gold, delicious food, and Death chases. Weve come a long way from the arcade quarter eater, but the latest version stays true to the classic core while providing a bit more depth. One of the more interesting factors in this iteration is that all the characters are asymmetric and play differently; the warrior is focused on simple bashing and swinging, while the Wizard has a complex set of moves perfect for any situation. After spending time adventuring both solo and with full party, I can say that Gauntlet absolutely begs to be played with a group of friends.The core of Gauntlet with a group is fun. Youre running around grabbing gold and food, fighting your friends for the crown bonus, and maybe even shooting food to get them killed. I had a blast smashing monster spawners, grabbing keys, and completing levels, but the feeling of euphoria ends at around the end of the second collection of levels. At this point, you realize that things arent going to change; while the initial foray is a good time, things get dull as you complete basic puzzles and take on never-ending and monotonous waves of foes.This may have been able to be avoided if the game had a meaningful progression system, but the leveling  known as mastery  is completely automated. If you die a lot, you get bonuses to death situations. Take enough damage and you get a little boost when you get low on health. Use a move many times and it improves. You basically just get stronger as you play, but you never make any decisions about that advancement. The bonuses add, but its pretty easy to just ignore them completely and just keep slogging through the monster waves.You are also able to purchase and upgrade relics with your hard-earned gold to take advantage of the magic potions you find, but these special abilities all essentially amount to a quick button press during the more hectic portions of any given level. Again, its all fun for a few maps, but then things just start to blend together into a sleepy, automated button mash. Even with all the competition and interaction between your group members, Gauntlets axe dulls considerably as you progress.A few boss fights change things up a bit, and they are quite enjoyable, but there arent enough of them. While Gauntlet offers higher difficulty modes and some cool looking gear unlocks after you finish the three area hubs, my group wasnt inspired to continue further. Theres definitely a charming old-school spark to this reboot, but without anything beyond the constant monster mashing and levels that seem to blend together, you may find yourself needing excitement badly.", "date": "Sep 29, 2014", "grade": "7"}