{"name": "Hearthstone: Curse of Naxxramas", "ref": "https://www.gameinformer.com/games/hearthstone_curse_of_naxxramas/b/pc/archive/2014/08/25/single-player-adventure-awaits.aspx", "text": "Hearthstones multiplayer matches and arenas are augmented with its first downloadable adventure, a dungeon dive into one of World of Warcrafts most revered raids, Naxxramas. Players explore a variety of custom encounters that draw inspiration from the actual dungeon itself, from hiding minions behind ice-blocked allies during the frostwyrm Sapphiron battle to the multi-stage final showdown with KelThuzad himself.The content of Naxxramas released gradually over the course of five weeks, but the complete package includes 30 new cards to unlock that can be used in both the campaign or multiplayer matches. This adds some much-needed variety in the way of deck design and archetypes from this deathrattle-centric offering. Each encounter is designed to be doable with the right hero/deck and basic cards, with an additional heroic mode available for players who want to take on brutally unfair encounters that require not only the perfect deck, but oftentimes a lucky draw.None of the new cards are gated behind the heroic encounters, but completion of every battle on heroic will unlock a special set of bragging-right card backs that are only obtainable in Naxxramas. KelThuzad is particularly jovial during Heroic mode encounters (where certain cards are off limits), and he simply shuts you down trying to cheese your way through some of the difficult fights; dont try to Alexstraza your way through those high hit point bosses!Each wing of the campaign is available for 700 gold (the in-game currency) or $7 of real money. Players can buy the whole package outright for $25. Each wing features two to four bosses, and at least one class encounter in which Blizzard has you square off with one of the raid bosses with a special deck designed to have you think about the game in new or hilarious ways. The Hunter challenge, for instance, has the player battle with nothing but a deck full of Webspinners, a new card in Naxxramas that places a completely random beast in the players hand when it dies.Naxxramas is an excellent addition to the core game, and an exploration of sorts to examine the potential for additional single-player Hearthstone content. While there is little replay value to the encounters themselves, the adventure provides a substantial amount of new content that spills over into ranked, casual, and arena mode and changes how you approach the game.", "date": "Aug 25, 2014", "grade": "9"}