{"name": "Kero Blaster", "ref": "https://www.gameinformer.com/games/kero_blaster/b/ios/archive/2014/06/24/a-pleasant-side-scroller-with-solid-touchscreen-controls.aspx", "text": "Studio Pixel made a name for itself a decade ago with Cave Story, a side-scrolling retro adventure inspired by Metroid. The developer is back again with a compact-yet-potent iOS game with a focus on breezy shooting fun. While many developers stumble when designing virtual buttons for mobile games, Studio Pixel delivers an elegant solution that makes Kero Blaster a joy to play.The colorful titles simple premise features a cute little frog that embarks on a variety of extermination missions to take out a growing pest problem. Kero Blaster is a linear, level-based game  a nice change of pace from the piles of disposable time-killers in the App Store. The green gunner packs a deadly, versatile weapon that swaps between a laser beam, bubble shot, and wide blast. Shooting enemies with touchscreen controls is easy since players can gracefully toggle the direction of fire. Setting your aim in a fixed direction lets you focus on moving back and forth and jumping, which feels slick on the iPhone. I never fumbled in combat and blamed the controls, which says a lot for a game with both platforming and shooting.Killing bad guys gives you cash for upgrading your health and weapons. I was always excited to bring a load of money into a shop and see what cool new enhancements were in store for my weapons. My guns eventually included a rapid laser beam that obliterated single targets, ricocheting spikes that cleared rooms, and a powerful flamethrower with a helpful shield. Kero Blaster does a great job of presenting situations that highlight each weapons strength, so I never leaned on one for long.Kero Blaster plays like an ode to the simple 2D Game Boy games of yesteryear, and while it doesnt do anything glaringly wrong, its not some remarkable reimagining. Weve gunned down the baddies, upgraded our weapons, and saved the day thousands of times, and Kero Blaster doesnt break new ground.That said, Studio Pixels latest is one of the best-playing action-platformers the iOS has to offer. The toggled firing directions make it fun to play compared to other clumsy virtual gamepads, and the charming visuals make it a slam dunk for mobile gamers of all ages.This review only pertains to the iOS version. Kero Blaster is also available on PC.", "date": "Jun 24, 2014", "grade": "8"}