{"name": "The Legend Of Zelda: Tears Of The Kingdom Is Already The Second Best Selling Game Of 2023", "ref": "https://www.gameinformer.com/games/super_ultra_dead_rising_3_arcade_remix_hyper_edition_ex__/b/xboxone/archive/2014/06/23/dead-rising-3%3A-super-ultra-arcade-remix-hyper-edition-ex-%2B-%CE%B1-review.aspx", "text": "Since its inception, the Dead Rising series has been about setting players loose in familiar environments and letting them use nearly everything within reach to defeat swarms of the undead. With the latest Dead Rising 3 DLC, the action is viewed through the CRT filter of an old arcade machine. Dead Rising 3: Super Ultra Arcade Remix Hyper Edition EX +  is a winking romp through Capcom's back catalog that has charm to spare, but relies too much on the grind.The download, which appears as a separate gameplay option on the Dead Rising 3 title screen, pits one to four players against arcade-style challenges. The sprawling Los Perdidos is transformed from an open world into four distinct districts, and players run through five stages in each of those zones. In one, you have to scour a location for vehicles and bring them to the collection zone. In another, you kill 500 zombies. Enemies arent as lethal in this remix  they cant grab you or knock you down, for instance  and your most relentless opponent is the clock. You cant build your own weapons, but you can pick up temporary superweapons like rocket launchers that give you a brief offensive edge over the undead.Timed objectives arent anything new to Dead Rising. After all, its heroes have always had to save the day with one eye on their watches. The constraints here are suffocating, however. Killing zombies is usually a fun experience in the series, but now theyre just an annoying impediment to the next mission marker. Ditching the improvised weapons speeds up the tempo, but it also gave me less of an incentive to engage the crowds of undead.Frank West has endured his share of humiliations over the years, but at times Dead Rising 3's latest DLC makes getting framed for an undead outbreak seem dignified. The former war photographer  along with Nick Ramos, Annie Greene, and Chuck Greene  has turned his interest in dress up to full-on cosplay, raiding Capcom's back catalog for inspiration. West skips into the scene in complete B.B. Hood regalia (think Little Red Riding Hood via Darkstalkers), packing a falsetto ~La la la,~ and a basket of zombie-slaying goodies. You start with only the standard version of each character, but you unlock additional costumes throughout the game.The unlocks are great, and theyre more than cosmetic. Each one comes with a different series of attacks. Costumes also change character stats, from how much damage they can endure to their offensive strength. As players defeat zombies, they build up a super meter, which unleashes unique attacks. Franks B.B. Hood costume allows him to summon a pair of weapon-packing Freedom Bears, while Nicks Tuxedo Nick attire puts the character in full-on James Bond mode, with a series of showy pistol attacks. Unlocking the costumes is the high point of the game, and seeing each one in action is rewarding. If you can wrangle up three friends to play with you online, its some of the most chaotic fun around.Unfortunately, earning those costumes turns into a grind. Each unlock has its own requirements, including a few that force you to play through zones repeatedly. I love Dead Rising, but this stripped-down version takes out many of the elements that have kept me hooked over the years. Without the character progression to draw you forward, youre stuck with a bunch of missions that ultimately end up feeling too similar. Beating up a giant bomb might be cosmetically different from smashing a weapons crate apart, but its functionally identical.I grew up playing Capcoms games, and I adored the constant stream of references that this DLC throws at players. You hear the SNES Capcom startup chimes, see a nod to the Winners Dont Use Drugs arcade message, along with loads of shout-outs to the companys older games. Los Perdidos is now filled with billboards for games like Power Stone, and players can use items inspired by Strider. Playing spot the callbacks is almost as enjoyable as the game itself.Dead Rising 3: Super Ultra Arcade Remix Hyper Edition EX +  is an ambitious game thats fun in short bursts. Unfortunately, it lasts a little too long, especially if youre dying to see what Annie looks like dressed up as a Breath of Fire character.", "date": "Jun 23, 2014", "grade": "7.5"}