{"name": "Watch Dogs", "ref": "https://www.gameinformer.com/games/watch_dogs/b/ps3/archive/2014/06/02/watch-dogs-review-ps3.aspx", "text": "Ubisoftintroduced players to Watch Dogs with an exciting gameplay demo that stole theshow at E3 in 2012. Since then, a six-month delay and rumors of a visualdowngrade have caused fans' faith in the promising new IP to waver. The finalgame lies somewhere between the early next-gen hysteria and subsequentskepticism; like most antiheroes, Watch Dogs gives players what they need, butnot necessarily everything they want.WatchDogs follows the exploits of Aiden Pearce, a tech-savvy hacker hell-bent ondiscovering who was responsible for the death of his niece and making them pay.The story offers up a number of conspiratorial twists as Pearce discovers thefar-reaching powers of the Blume Corporation. The company's CtOS is theinterconnected operating system that Chicago runs on, and through his ownhacking prowess, allows Pearce to run Chicago.While the new-gen versions of Watch Dogs are visually impressive (albeit less stunning than early demos suggested), the Xbox 360 and PS3 incarnations have taken a major graphical hit. Ubisofts attempts to get the game running decently on older hardware have transformed Chicago into an ugly ghost town, with far fewer people inhabiting the city. Not only do the last-gen versions fail to live up to Grand Theft Auto V, they look worse than many other games released over the past few years, and the blurry faces, low-res textures, and frequent pop-in and screen tearing have a significant impact on immersion, even if the gameplay is the same.Likemany open-world games, the activities in Watch Dogs split your time evenlybetween being on foot and in a car (or motorcycle or boat). The drivingcontrols are looser than I'd like, and are more reminiscent of the early 3D GTAgames than the turn-on-a-dime handling many modern games offer. Most objectshave a distinct feeling of weightlessness in the world; fences crumple liketissue paper, light posts snap off and shatter on the ground, and cars spin outof your way with minimal contact. Smashing through bus shelters and sidewalkcafes without losing speed creates some Hollywood-worthy action moments, butthey come at a cost; ramming a pursuing enemy vehicle into oncoming trafficonly to have them blow through cars and be back on your tail a second later isfrustrating especially considering you can't use weapons when driving.Instead,technology is your weapon (spoiler!), and you unlock a variety of hacks toeliminate your foes. Activating guard posts, overloading steam pipes, andtripping traffic lights can take down vehicles with a single hit, and the gamesignals when it's best to activate them. They work well, but are fundamentallylimited you have to find them in the environment in order to use them.This leads to a lot of circling around blocks and alleyways hoping to comeacross a type of hackable item you've already unlocked to use on foes. Rather thaneliminating all of your pursuers via environmental takedowns, driving in WatchDogs is really about evasion losing your tails just long enough to pullinto a secluded side street or parking lot and hide in your car (via an actualhiding mechanic) until the heat dies down. Once I realized that, thecat-and-mouse driving segments became more fun.Onthe other hand, the on-foot action is entertaining from the get-go and onlybecomes more engaging as you unlock new abilities. Hacking items adds ameaningful dimension to combat, allowing you to effortlessly hop between camerafeeds to get the layout of the environment, tag foes, and activate traps. Thesolid shooting mechanics make full-scale firefights enjoyable, but Watch Dogs'combat really shines with a stealth-minded approach. A focus power lets youtemporarily slow down time to line up headshots and take down enemies beforethey alert their buddies; using the environment to my advantage and picking offenemies one by one while remaining undetected never got old for me.Thatsaid, Watch Dogs' gameplay still has its problems. All too often, UbisoftMontreal forces you into the scenario it wants you experience; most missionsare bound to end with a protracted car chase, and sometimes backup guards spawnno matter how careful you are. Additionally, the developer still hasn't learnedthat tailing missions are boring and over-armored enemies that require multiplemagazines worth of ammo to take down are cheap and frustrating.Onthe whole, however, the campaign missions are entertaining, and provide theright mix of interesting environments and gameplay variety. Guiding anon-player character through a gang-controlled apartment building via securitycameras and crashing the secret auction of a human trafficking ring are justtwo of the memorable scenarios that complement Watch Dogs' more conventionalaction missions which still feel fresh thanks to Pearce's hackingpowers. A wealth of unlockables and some interesting side content should keepcompletionists happy for a long time. The Dark Souls-style multiplayer elementsare also engaging; having random players invade your game to hack your data orobserve you from the shadows adds a sense of urgency that going up againstnon-player characters can't match. As boring as tailing an A.I. character is,chasing after and observing another unsuspecting human player while trying toremain unnoticed is exciting and amusing in a voyeuristic kind of way.Unfortunately,Watch Dogs' story doesn't live up to the gameplay, in large part due to UbisoftMontreal's inability to pick a tone and stick with it. Some characters, likeLucky Quinn and Jordi Chin, are (relatively) understated and interesting.Others, like Anthony ~Iraq~ Wade and Clara, are so overdesigned that it's hardto take them seriously. Aiden Pearce is a mix of the two approaches; alone-wolf vigilante with a comically gruff Batman voice who can't let go of hisguilt for the death of a family member. Ultimately, Pearce is Max Payne withoutan affinity for cheesy poetry, and while he offers up a few compelling momentsduring the story, he's usually just a mope who can't stop staring at hiscellphone. Thefew thought-provoking and poignant moments of Watch Dog's story are underminedat every turn by the general idiocy of the rest of the writing. Random civilianchatter, enemy conversations, and the video feeds you frequently hack arefilled with crass, immature, and oftentimes offensive content, such as onerandom NPC's diatribe about why he was justified for beating his girlfriend.The GTA series manages to skewer American culture with a sardonic wit and atone that matches the style and stories of the series. In contrast, Watch Dogs'more sensationalistic writing simply panders to every annoying stereotype of apubescent, mouth-breathing gamer; vulgar sex jokes, lazy insults, andobscenity-laden outbursts are repeatedly served up without context or class.Ubisoft's attempts to make you think about the random people you're hacking areso heavy-handed that they come off as patronizing, and are undermined by thesame sophomoric humor. This NPC has brain cancer. That NPC was recentlyprescribed diarrhea medication. Atthe end of the day, Watch Dog's story works as a basic revenge tale, and thefinal few missions provide some gravity to the characters. Ultimately, however,the main draw of any open-world game is the gameplay, and while not perfect,Watch Dog's hacking abilities add an engaging and unique twist to thethird-person action. Ubisoft Montreals new series could go in a lot of exciting directions in the future, but given the visual problems caused by the underpowered last-gen systems, I hope the next Watch Dogs adventure is a new-gen exclusive.Thisreview pertains to the Xbox 360 and PlayStation 3 versions of Watch Dogs. A superior version of the game is available on PlayStation 4, Xbox One, and PC. The screens contained in this review are from the new-gen version of the game.", "date": "Jun 02, 2014", "grade": "7.5"}