{"name": "The Gunk", "ref": "https://www.gameinformer.com/review/the-gunk/the-gunk-review-colorless-but-comfortable", "text": "I began The Gunk with eager anticipation, blasting across the swirling clouds of the cosmos. The opening cinematic is beautiful and full of promise. Unfortunately, it is also the apex of the short games trajectory. In a game filled with alien worlds splashed with color and populated with extraterrestrial mysteries, The Gunk falls surprisingly flat. Fortunately, this spacecraft manages to stay afloatwith likable characters, solid gameplay, and a serviceable story. The Gunks heroes, Rani and Becks, are a pair of plucky and impoverished space haulers. They touch down on an unknown planet hoping to discover valuable resources to pay off their debts and set themselves up for life. As Rani, you fearlessly explore the unknown world, scanning life forms for data, jumping from craggy cliffs to oversized leaves, and eventually, clearing away obstructive, plant-destroying Gunk. Becks stays with the ship, but the comms allow an easy back and forth between the ships co-captains, which reminds me of Cowboy Bebop and Firefly, shows that star intrepid space travelers in constant need of cash. While not bad company to keep, this highlights a problematic pattern: nothing in The Gunk feels unique.Everything in this adventure is reminiscent of something else, and, for the most part, its been done better somewhere else. After encountering the planets titular gooey substance for the first time and vacuuming it up with my robotic arm, I flashed back to Luigis Mansion. Other features, from opening shortcuts by dropping climbable vines to shooting glowing buttons that open locked doors to harvesting the planets plant lifefor crafting materials, feel incredibly well-trod and uninspired. On the one hand, The Gunk feels familiar and slightly comfortable. On the other hand, nothing really sticks out, making this experience almost forgettable.Despite evoking other great shows and games, The Gunk never reaches the heights ofits inspirations. Despite the range of colors in these alien landscapes, the hues never pop, and the terrain always seems a little unsaturated. Instead of triggering an awe-inspiring moment where the grey, Gunk-infested landscape transforms into a vibrant oasis of exotic plant life, the dulled aesthetic means cleaning the Gunk from a location only has a moderate visual impact, which diminishes the thrill of cleansing each area.During dialogue-heavy sections, the character models lips flap like lifeless puppets, resulting in cutscenes that are fine to listen to but awkward to watch. Running, jumping, and shooting feels smooth, but I occasionally got stuck on the surrounding geometry. Hovering helplessly in the air thanks to a glitch is annoying, as is noticing that plants and rocks often have the same texture, but they didnt stop me from having a good time running around the world and accomplishing my mission.That mission is, at first, straightforward. Collect resources from the world to make much-needed repairs to my robotic, vacuum-ready prosthetic arm and look for anything that might sell for big bucks. However, the adventurous Rani cant stop herself from trying to rid the world of the sticky mass threatening its flora and fauna. Unraveling the mystery of the Gunks origin puts Rani at odds with the pragmatic Becks, who doesnt want to waste their precious and diminishing supplies fixing someone elses problem. As a result, the conflict at the heart of this story was strong enough to push me on from one linear section to the next.The Gunk deserves a fair bit of criticism and only a little unreserved praise. The connection between the characters holds up the story, sucking up goo is strangely satisfying, and the mechanics work as intended. However, I wish the world felt more distinctive and better realized. The environment has the potential to be a vibrant kaleidoscope with brilliant hues and unearthly forms. Unfortunately, it doesnt quite hit that mark. All said, The Gunk is a competent romp through space, but not a stellar one.", "date": "Dec 20, 2021", "grade": "7"}