{"name": "Kirby: Triple Deluxe", "ref": "https://www.gameinformer.com/games/kirby_triple_deluxe/b/3ds/archive/2014/05/02/kirby-triple-deluxe-3ds-game-informer-review.aspx", "text": "Kirby has always moved at a slower pace compared to the platforming members of his extended Nintendo family like Donkey Kong and Mario. The difficulty level in Kirbys outings remains consistently low, creating a relaxed breed of enjoyable (but predictable) action. Triple Deluxe doesnt change the Kirby formula drastically, but it improves the difficulty curve and adds several fun mechanics.The big draw of Triple Deluxe is the way it plays with action in the foreground and background of each level. Kirby moves between the two planes, but the most interesting use of this mechanic is the way elements from one plane affect the other. Trees fall from the background into the foreground, threatening to crush Kirby. Walls tip forward, forcing Kirby to position himself in front of an opening  like Buster Keaton narrowly avoiding death from a collapsing house. Triple Deluxe is a 2D platformer, but these elements force you to observe the level from all directions, as opposed to only the obstacles directly in front of you. This adds to the challenge, and results in some fun spectacles.Triple Deluxe gives Kirby a handful of new powers, each changing the way you approach traversal and enemies, The most memorable of the bunch is the Hypernova plant. Gaining this power allows Kirby to leverage an incredible amount of sucking power to dismantle and consume trains, weapons, and groups of enemies all at once. Some levels are designed around the use of the Hypernova ability, and I was always excited to come across one. The Hypernova plant is used especially well during the final ramp-up, when Kirby must re-defeat the bosses he had to tackle earlier in the game.Along with the single-player campaign comes two extra modes (hence the name Triple Deluxe) offering decent, but limited, distractions. One casts players as King Dedede in a rhythm platforming game. Only three levels are available, but perfecting them is a challenge. Kirby Fighters lets local 3DS players duke it out against one another, each playing as Kirby with their choice of power. After playing a handful of rounds on each of the available stages, I didnt feel compelled to revisit it, but the familiar feel got me excited for the 3DS version of Super Smash Bros. Additional modes are also unlocked after beating the campaign, one of which lets you speed-run through the single-player campaign as King Dedede, whos alternate abilities make for a distinct and equally fun experience worth exploring.Triple Deluxe does a better job than most Kirby games at retaining a consistent upward slope of challenge throughout. During the last few worlds and final boss, I was surprised to see my lives dwindle, and began to play much more carefully  something Ive never done in previous Kirby titles. I was excited to embrace this challenge. The game isnt hard, but I needed to improve my abilities as I made my way to the end boss. This made for a Kirby experience that remained engaging up to the final boss and beyond.", "date": "May 02, 2014", "grade": "8.5"}