{"name": "Sherlock Holmes: The Devil's Daughter", "ref": "https://www.gameinformer.com/games/sherlock_holmes_the_devils_daughter/b/xboxone/archive/2016/11/02/far-from-elementary.aspx", "text": "Sherlock Holmes: The Devils Daughter is a showpiece of detective work and player choice  elements that speak strongly to Sir Arthur Conan Doyles character and empower you with the belief you are puffing away at the meerschaum calabash. Each of the five cases delivers numerous outcomes, along with the satisfying feeling you are uncovering clues only Sherlock Holmes could. Developer Frogwares is well in tune with Holmes, as it should be after spending 15 years with him over eight games. Frogwares hit on something special with the 2014 entry, Crimes and Punishments, and attempts to build a bigger experience in The Devils Daughter, but most of the new gameplay activities negatively impact the experience, and are made worse by maddening technical issues.Life at 221B Baker Street is changing. The routine of cases coming in, the Great Detective diving into them, and guilty people ending up in jail continues like clockwork, but at a price. In The Devils Daughter we learn Sherlock Holmes excels at all professions except one: being a father. He has a teenage daughter named Katelyn  a cheery and educated girl who just wants to spend time with dear old dad. Her attempts to free her father of his work end in tears. Holmes is closed off, stern, and almost seems to be intimidated by fatherhood. We learn Kate is receiving parental guidance and love from a mysterious woman named Alice, who has recently moved in next door and has become a thorn in Holmes side. Seeing a flawed version of Holmes is a hell of a storytelling vehicle that youll want to see through to the end (and it concludes in a satisfying way), but getting there takes a considerable amount of effort.The moments Holmes shares with his daughter are fleeting, and mostly occur in interstitial sequences between cases. This relationship is a central plot hook, so I found it strange to see it visited so infrequently. On the other hand, it strengthens the sense of separation from the daughter and amplifies concerns of Holmes addiction to his job. Its a subtle storytelling touch that pays off huge in developing Holmes as a conflicted character.While I wanted to see more of Holmes family life, the five cases he embarks on are welcome distractions. Each offers distinct challenges and crime scenes to scour, from a ghastly traffic accident littered with the remains of humans and horses to a bowls club murder purportedly conducted by a living statue. The locations Holmes visits are as varied as the murder scenarios, taking players deep into showy forests to darkened piers and into expansive underground crypts that Indiana Jones would have a field day in. All the locations are lavishly detailed, and are fun to explore just from a history perspective. You can roam the streets of Victorian London in small hubs areas, but this feature is rarely tapped, forcing you to fast travel between locations instead.Fast may not be the appropriate word given just how long the fast travel load times can be. In some cases, I would travel to Holmes home to complete a menial task like changing clothes or checking a dictionary  acts that can be completed in seconds  but had to sit through a couple of minutes of load time to get there, then another couple of minutes to fast travel to the next destination. The load times are not optimized to support the scenario design; the flow and connection players have to the cases is sapped by the unnecessary (and frequent) loading lulls.Once a crime scene is reached, gathering evidence is where The Devils Daughter shines the brightest and truly feels like a detective game. Although Holmes can tap into superhero-like abilities to scan his surroundings for clues (think Batmans Detective Vision), most of the guesswork is up to the player. When people are interrogated, the player must create a portrait of them by scanning their body  an act that can be totally botched and cant be changed, leading you to potentially finger the wrong suspect. Clues gathered can also be linked in numerous ways, leading to different murder suspects, and potentially the wrong people being thrown behind bars or worse. Holmes morality also comes into play at the end of cases in moments where players shape him as a cold-blooded detective or caring humanitarian. The writing in the cases is quite good, but the conclusions to them are sadly too abrupt, giving little resolution other than a text blurb that says what will likely happen next. All of that difficult work in the cases (each lasting about an hour or two) concludes with a fizzle rather than a bang.In trying to make The Devils Daughter a bigger game, Frogwares upped the amount of action, a costly move that, while making for more dynamic story moments, forces the player to endure half-baked minigames and overly long action sequences. In one moment, Holmes must outrun a hunter for what seems like an eternity, ducking behind boulders, trees, and even using his detective vision to uncover a safe rock path through a swamp. This sequence is silly, void of fun, and derails an otherwise awesome case. The same frustrations rise in a stealth sequence that is cool in concept, but couldnt be much more frustrating in execution. Frogwares tries to add action wherever it could, and it just doesnt pay off. The worst example is an intense moment where Watson is trying to revive a man through CPR that doubles as a rhythm minigame similar to Dance Dance Revolution. My connection to the world was lost in that instant, and I just sat back and laughed until the goofy sequence concluded.For every gameplay misstep made, Frogwares dazzles with its puzzles, which are rarely repeated twice. Yes, some are overly complicated (like the act of lock picking), but others are brilliantly devised and are true tests of the power of Holmes perception. The great traffic accident sequence I mentioned earlier is the top moment, pushing the player to reconstruct the crime by lining up 13 pieces in the correct order. This puzzle requires a careful study of the crime scene; the player cannot breeze through it, and solving it feels fantastic, something again that enforces that feeling of wearing Holmes deerstalker.The abrupt endings, forced action sequences, and extensive load times mar an otherwise fun adventure game. The topnotch writing, and fascinating hook of Holmes struggling with a real issue are buried beneath these problems. I enjoyed being a super sleuth, and adored just how intimate the deductive process is, but found myself getting pulled out of the thrill of the hunt by the gameplay diversions. I just wish I could avoid that element of the game as much as Holmes turns his back on his daughter.", "date": "Nov 02, 2016", "grade": "6.75"}