{"name": "Kinect Sports Rivals", "ref": "https://www.gameinformer.com/games/kinect_sports_rivals/b/xboxone/archive/2014/04/16/a-500-season.aspx", "text": "Kinect SportsRivals is the follow-up to Xbox 360's two Kinect Sports titles, which tried and failed todo for Microsoft's motion control camera what Wii Sports did for Wii. Thegames reportedly sold well, but didn't do much to establish Kinect as a must-buyperipheral. Now, developer Rare is back with Kinect Sports Rivals, a game thatrelies on the new model camera that ships with every Xbox One.Kinect SportsRival is a showcase for the technology first and foremost, letting userscompete in six sporting events (wake racing, rock climbing, target shooting,soccer, bowling, and tennis) played entirely with motion controls. Each worksto a varying degree of success, but the package is much better in terms of finecontrol than its predecessor.Overall, it's adecent testimony to the accuracy of the Kinect 2.0. Sadly, I don't work for A Decent Testimony To The Accuracy Of TheKinect 2.0 Informer Magazine. As a game, it's never more than mediocre.Wake racing is well done, and reminded me how much I used to love Wave Race andSplashdown, but as my arms grew tired throughout a series of races, I wishedthat I could play the game with a controller. The tedious target shootingcontrols well, but is of little interest. Tennis, which should be a gimme for agame like this, is the one that seems to have the worst controls. Climbingwon't be for everyone, but I was impressed by how the Kinect tracked my arm andhand motions while I reached for purchase on a series of handholds. Soccer isan oddly designed, foosball-like experience that requires awkward legcontortions to score goals. At least there's bowling -good old, reliablebowling.Rare went theextra mile in creating the game's structure. There's a (somewhat cheesy) story,tons of items and clothing to buy with in-game cash, and an online hub forcomparing yourself against others and uploading game footage. That's fine andgood, but it feels like a lot of a sizzle for such a small piece of steak. Ifthis had been packed in with the Xbox One to demonstrate the new Kinect, itwould seem like a nice extra. As a standalone game, it's just not compelling.", "date": "on Apr 16, 2014", "grade": "6.5"}