{"name": "Mercenary Kings", "ref": "https://www.gameinformer.com/games/mercenary_kings/b/playstation4/archive/2014/04/02/nostalgic-look-modern-sensibilities.aspx", "text": "When certain games release, you find yourself wondering why more developers havent done the same thing before. Mercenary Kings is one of those games. While few inherently new ideas are at play in Tributes latest project, the combined whole is an impressive effort that mixes classic shooting (inspired by games like Metal Slug or Mega Man) and injects some of the customization, storytelling, and ancillary mechanics more prevalent in modern games. Whether playing alone or with friends, this massive adventure should keep most players busy for hours. You are one of the Kings, a mercenary force brought back to life through a secret scientific formula to rid a tropical island of the terrorist threat named CLAW. Before each mission, you wander through camp purchasing first aid kits, equipping new bionic mods, and customizing equipment. Once your soldier is up to snuff, you tackle missions that have you rescuing hostages, taking down giant robotic bosses, gathering supplies, or infiltrating ancient temples. More than 100 missions are available, but many of these outings see you returning to the same maps again and again. While all of Mercenary Kings maps are suitably large, its a grind coming back to the same location the seventh or eighth time.The level designs and enemy placements are top notch, exhibiting a strong eye for a gradual challenge curve that always keeps players on their toes, whether through tough platforming, challenging baddies, or a severe time limit. More than 100 distinct enemy types await your attack, constantly demanding new tactics. The shooting mechanic feels purposefully stiff, only allowing you to shoot in straight lines up and down or left and right  a direct homage to the games that inspired Mercenary Kings. Little touches like an active reload system ( la Gears of War) add a modern touch, forcing you to time your shots and movement to coincide with when bullets remain in your magazine.While a number of boss models are repeated or show up in only minor variations, they are usually excellent fights. With time and patience, each telegraphs its movements, helping you to gain a sense of mastery. However, Im not a fan of the odd approach to tracking down a boss. In any given stage, you might need to track your targets to one of several possible locations on the map. If they arent there, you must run across the stage again to the next location. If they are there, theyre usually on a timer, and they flee to the next location before you can finish them off. Its a frustrating mechanic that I could have done without, even though the game provides a couple of ways to work around the issue.One of the biggest features that sets Mercenary Kings apart is its rewarding customization. After acquiring money and materials on missions, you can upgrade your characters armor for more hit points, install new bionic mods that offer effects like faster speed or higher damage, or change your outfit colors. However, the weapon system far outstrips everything else, offering around 300 distinct weapon pieces that can all be mixed and matched to create an arsenal for any occasion. By the end, you might have a handgun that shoots electric bullets, or a shotgun with a sniper-rifle scope that looks like a trombone.As I explored Mandragora Island, my admiration for the gorgeous art, animation, and music grew. Mercenary Kings is a masterpiece of old school 2D presentation, filled with clever nods to older games, but with a distinct style to the characters and backgrounds all its own. The evocative chiptune soundtrack matches that look perfectly, and I looked forward to each new area and the character models, environments, and music I might find there.Tributes shooter holds up well as a solo experience, but the flexibility to play two- to four-player local or online play (but not both at the same time) makes this a great fit for group get-togethers. Since many missions include multiple objectives, it can be fun to work together and decide how best to split up the tasks in order to speed up full completion. After having tried multiple variations of play, the two-player online team-up is my recommendation.Mercenary Kings is a testament to the idea that you can get too much of a good thing. The slick art, old-school shooting, and deep customization options are immensely fun, as are the stages that you play through  the first few times. As it is, this style of shooting action feels like its stretched thin over such a lengthy campaign, and some of the missions might have been more fun if I hadnt already explored the maps so thoroughly. That tedium certainly isnt enough for me to warn people away from such a richly illustrated tribute to the roots of the shooter.", "date": "Apr 02, 2014", "grade": "8"}