{"name": "Goat Simulator", "ref": "https://www.gameinformer.com/games/goat_simulator/b/pc/archive/2014/04/01/goat-simulator-review-game-informer.aspx", "text": "Coffee Stain Studios main page for Goat Simulator describes it as a small, broken, and stupid game. These arent the words Id typically use to begin a review, but I found them appropriate. The developers humorously dismissive statement accurately sums up the wacky, physics-based sandbox, but it doesn't encompass the entirety of the titles shortcomings and goat-related chaos.Players are dropped into a small sandbox world as a goat. This single stage is the only offering in the whole game, which doesn't provide much variety. You can jump, ram, bleat, lick things, ragdoll, and slow time to relish the more dramatic moments. Smashing through fences and launching innocent bystanders is amusing at first, especially if the unpredictable physics sends them hurtling further than expected.Even with some simple challenges (more on that later), meandering destruction is the core of the gameplay. Accomplishing your malicious or self-abusive goals is easy enough, but overall platforming and object collision is buggy beyond belief. Within the first hour of the game I was trapped behind buildings, stuck in fences, and falling through the game world. Developer Coffee Stain Studios understands its game is an unpolished practice in absurdity, and has included an achievement for making the game crash. The loose controls and numerous bugs arent enough to cause intense frustration, but they also aren't crazy enough to be entertaining, either.The main draw lies in the emergent gameplay that occurs when a rambunctious, player-controlled goat wreaks havoc on an unsuspecting town. I enjoyed licking a car doing donuts in a field with the goats adhesive tongue and being dragged along for a zany ride. I found a jetpack in a construction site, climbed a tall crane, and blasted off into the sky before spiraling into a tree. A low-gravity half-pipe lets players ragdoll-slide through hoops and catch air like only a limp goat can. These moments are amusing the first time around, but the chuckles die down upon repetition.Once youre done frolicking in the freeform nonsense, a paper-thin string of challenges are available. Most involve catching a certain amount of airtime, finding collectibles, or scoring points. The confusing, seemingly random combo and multiplier system for ramming, licking, and exploding stuff in the environment doesnt offer a sense of true accomplishment. I racked up the most points storming into Coffee Stain Studios in-game office and single-hoofedly obliterating the computers, developers, and furniture within. Repeatedly ramming random shelves and chairs into a closet made my multiplier go through the roof; it wasnt the most entertaining solution, but I managed to complete the highest score challenge in no time.I dont completely regret playing Goat Simulator, but I also dont recommend it to anyone looking for more than disposable entertainment involving goats making people fall down and blowing up gas stations. I appreciate that Coffee Stain Studios is in on the joke, but acknowledging a game is bad doesn't suddenly make it good.", "date": "Apr 01, 2014", "grade": "5"}