{"name": "Pokmon Brilliant Diamond                                                             & Pokmon Shining Pearl", "ref": "https://www.gameinformer.com/review/pokemon-brilliant-diamond-pokemon-shining-pearl/pokemon-brilliant-diamond-and-shining-pearl", "text": "Originally released in 2006, Pokmon Diamond and Pearl ushered in a new generation of Pokmon games onto the Nintendo DS. With the themes of evolution and creation woven throughout the story, the upgraded designs of the new Pokmon found throughout the Sinnoh region, as well as newly discovered evolutionary lines of fan-favorite monsters, these games felt like a notable step forward for the franchise. In remaking these classics new Pokmon developer ILCA proves it can handle recreating the crucial tenants of the franchise.For the most part, Brilliant Diamond and Shining Pearl are faithful remakes  as The Pokmon Company likes to call them  of their namesake DS games. The skeleton is there, with the same towns, routes, trainers, and Pokdex of monsters found throughout the adventure. You still start from humble beginnings in Twinleaf Town, where starry-eyed trainers receive a Pokdex from Professor Rowan and their choice of starter Pokmon. From there, you meet your friends and rivals, Dawn and Barry, and set off along your journey to conquer eight Gyms and become champion of the region. Youll also uncover Team Galactics plans to harness the energy of evolution and the legendary creation duo of Dialga or Palkia. Nothing in the story is new or surprising, but I found that acceptable  and preferable  after being away from Sinnoh for over a decade.ILCA opted to recreate the DS games chibi characters in 3D and keep the worlds top-down perspective, which accentuates the feeling of these remakes remaining faithful to the source material. This is a deviation from how previous remakes have modernized their graphical styles and feature sets. Thats not to say the visuals look dated. New graphical enhancements to lighting, shadows, and water look great. The abundance of reflections on surfaces throughout the world and especially during Pokmon battles is also impressive. Unlike characters in the overworld, fights utilize full-size Pokmon and trainer models with unique environments determined by your location in the world. These scenes look great and are mostly free of framerate drops or the slowdown that plagues other 3D entries in the series.Brilliant Diamond and Shining Pearl deviate from the mechanical blueprint, with varying degrees of success. Newer innovations like autosave or the ability to view the strength and weaknesses of moves in battle are great additions, which I always like to see. Pokmon also no longer need to be taught HMs to utilize moves like Rock Smash or Cut to navigate puzzles or obstacles in the world, something that would have taken up a move slots in the original titles. EXP Share is, on its face, a great way to cut down on unnecessary grinding to ensure your lesser-used Pokmon are battle-ready. However, the developers havent taken any measures to balance this feature, and there isnt a way to turn EXP Share off. As a result, my teams felt over-leveled as the game progressed, making big matches against Team Galactic or any of the Gym leaders feel easy and insignificant. I steamrolled through challengers on the surface of Sinnoh and had to find more formidable foes elsewhere.My favorite place to explore has been the Grand Underground, a massive subterranean cave system lying beneath the surface of Sinnoh. I mean it, this place is enormous and spans just about the size of the main map. Here you dig for countless gems, fossils, and statues in the walls and Hideaways. These Hideaways are larger areas found within the Grand Underground, complete with biomes and higher-leveled Pokmon you wouldnt normally find above ground, many of which arent a part of the standard Sinnoh Pokdex. I found the challenge I craved above ground in these Hideaways as I captured new, exotic creatures to diversify my team. Players can create Secret Bases by digging customizable rooms in the cavern wall. Placing special Pokmon statues inside these rooms altered which monsters I found within the Hideaways. Those looking to catch em all should spend a lot of time in the Grand Underground, excavating precious items and tweaking statue combinations to fill out the Pokdex.Other activities include the Pokmon pageants called Super Contest Shows, which I liked more than I thought I would. Youll wow judges with a simple rhythm game and unleash a pre-chosen attack at the perfect moment to score points. I also loved customizing my Pokballs with the Ball Capsule system. With an expanded system from Diamond and Pearl, you can slap various stickers on the capsules to create unique animations and earn extra points when tossing a Pokmon into these Super Contest Shows. Stickers add cool flames, bubbles, sparks, or musical notes to give an extra bit of flash and flourish, granting a level of personalization absent in the DS games. Even better, your Ball Capsule animations show up in battle but wont affect how fights play out in any way.While Brilliant Diamond and Shining Pearl dont move the needle in terms of what Pokmon games will look and play like moving forward, they mostly hit the mark in being faithful to the originals. Ive really enjoyed my time re-exploring Sinnoh, despite my qualms with the lack of critical path difficulty. Theyre a welcome throwback to a simpler time when I felt completing a Pokdex was a somewhat realistic task to undertake. Veteran trainers will find plenty here to scratch a nostalgic itch, and new trainers who missed out the first time around have a solid adventure to embark on.Pokmon Brilliant Diamond and Shining Pearl have online features which were notaccessibleduring our time playing the game for review. These features allow players to trade, battle, compete in Super Contest Shows andgather in the Grand Underground with other trainers over the internet. Our review currentlydoes not reflect any online functionality and may be updated if the multiplayer modes significantly add or detract from the experience.", "date": "on Nov 19, 2021", "grade": "8.5"}