{"name": "Yaiba: Ninja Gaiden Z", "ref": "https://www.gameinformer.com/games/yaiba_ninja_gaiden_z/b/ps3/archive/2014/03/18/yaiba-ninja-gaiden-z-review-game-informer.aspx", "text": "The concept for Yaiba: Ninja Gaiden Z could have come from a 12-year-olds sketchbook during a particularly boring algebra class. Still, I kind of respect Tecmo Koei and Keiji Inafunes Comcept for having the guts to release a retail game about a cyborg ninja fighting zombies. Its equal parts silly, gory, and stupid  exactly what youd expect from the concept.Anti-hero Yaiba Kamikaze gets sliced and diced by the noble Ryu Hayabusa in the opening cutscene and is put back together with machine parts by wealthy weirdo Rico Del Gonzo and overly sexualized scientist, Miss Monday (This is Team Ninja  dont pretend to be surprised). For the most part, Yaiba is a jerk with constant eye-roll-inducing one-liners like, Hes the head of a corporation and a d---. That makes him a d---head. The tone only works in a very B-movie kind of way.The game structure is essentially a series of arena-wave battles connected by lame puzzles and quick-time platforming. Strangely, you can only jump in special circumstances  its not an option in battle. Yaibas attacks include a fast blade, heavy cyborg punch, and a Kratos-like chain flail. Mixing up these three buttons unleashes a wide variety of combos, but the fact that theyre buried in menus makes them a pain to learn.Once you get up and running, Yaiba can string together impressive moves tailored to large groups or single minibosses. My favorite technique involved knocking several foes back with a combo, tapping the execution button, and chaining a series of gory finishers together. You receive a health drop from lower tier zombies and rip special temporary elemental weapons from stronger enemies, like an electric spine whip or a bile-blasting stomach. The most satisfying attacks involve combining various elements for explosive results. Hit a fire-based enemy with an electrical attack and its engulfed in a burning, electric cyclone, for example.Battles get increasingly frustrating the deeper in you go. Enemies take and dish out a lot of damage and your starting health bar is quite small. This paired with an unreliable counter system and mid- to high-tier enemies that rarely get stunned by your attacks means youre forced to dart around constantly, chipping off a little damage or risking heavy retaliation.The arenas keep getting larger and crammed with more enemies, so its difficult to spot your character in the wide camera view. If you try the closer camera option, then youre screwed by attacks that fly in from off screen. When youre close to death, the screen goes black and white and its even harder to see Yaiba. Then when you die, you have to stare at a lengthy load screen and start all the way back at the first wave no matter how far you progressed in that arena.Fortunately, its a simple process to change the difficulty, so I cranked it down to easy on the later levels and immediately began having a better time. Some of the problems in combat are less obvious, but things like picking up important items in the middle of hectic battles is still painfully clunky. Id recommend anyone interested in this game start at easy, level everything up, quickly beat the games seven levels, and then knock out missions in normal and beyond if youre still interested. Upgrades and collectibles are persistent so theres no reason not to. For a slight change of pace you could try out the unlockable side-scrolling arcade mode as well.Like its second-fiddle protagonist, Yaiba: Ninja Gaiden Z resides in the shadow of many other better third-person action games, but its not terrible if youre specifically looking for a schlocky Saturday.The EdgeIf you have the option, definitely play Yaiba on PC. The textures, resolution, and framerate are noticeably better and worth the extra few days wait.", "date": "Mar 18, 2014", "grade": "6.5"}