{"name": "World of Final Fantasy", "ref": "https://www.gameinformer.com/games/world_of_final_fantasy/b/playstation4/archive/2016/10/24/world-of-final-fantasy-review-game-informer.aspx", "text": "The last few mainline Final Fantasy titles made major modifications to the series long-standing formula, experimenting with new structures and battle systems. World of Final Fantasy casts that aside, deliberately returning to its roots and celebrating the series past, both in terms of cast and mechanics. You control twin siblings (Lann and Reynn) with the power to capture monsters, which is a thinly veiled excuse for players to embark on a greatest-hits tour of Final Fantasys extensive bestiary. The range of beasts is impressive, from fan-favorites like Behemoths and Moogles to deeper cuts like Skull Eaters and Nightmares. You collect these iconic creatures, improve their stats, and teach them signature attacks, then use them in a battle system that surprised me with its depth especially considering the games cute aesthetic. The concept clearly borrows from Pokmon, but World of Final Fantasy goes beyond this inspiration by adding satisfying layers of complexity. Instead of relying on the monsters individually, the real goal is combining their skills (and the protagonists) into effective ability sets. You do this by stacking them on top of each other according to their size categories, and though it looks ridiculous to see your characters with monsters precariously teetering on their heads, it opens the door for lots of cool experimentation. For instance, a stack with Ifrit on the bottom, Lann in the middle (the twins can be large or medium-sized), and a Sylph on top gives you powerful fire powers and helpful support options. However, replacing the Slyph with a Flammantoise lets you absorb fire attacks, since its resistance compounds with Ifrits. Once you get a lot of monsters and unlock their skills, the freedom to diversify or specialize is incrediblyfun. You only manage a two-member party in combat, since Lann and Reynn have just one active stack at a time and cant swap mid-battle. This sometimes makes battles overly simple, but the added challenge of toppling enemy stacks and capturing new creatures keeps the action interesting. Winning battles isnt hard; the challenge comes from meeting conditions necessary to recruit particular monsters. Killing a Tonberry King is easy, but getting its health low enough to make it vulnerable to capture without killing it is the real trick. The encounters drag on after you obtain everything cool in an area, but expanding your army with familiar beasts is a real treat for longtime Final Fantasyplayers. The monsters arent the only recognizable elements you encounter. The what-if world you explore is a tenuously connected mishmash of Final Fantasy hallmarks, including towns, characters, and musical themes. I cant list them all, but my time with previous Final Fantasy games was rewarded with constant nods, references, and cameos that made mesmile. If you like old-school Final Fantasy, this probably sounds like your prayers have been answered. However, a critical aspect of the formula is missing: the story. While seeing all of the established elements of the series is great, the newly created content is miserable. The premise is thin, but the pacing is especially bad. After youre introduced to the world and characters, the plot plateaus for the entire game. People say vague and cryptic things about a larger threat, but those statements never coalesce or escalate. I was at the 40-hour mark before anything made sense (the story is way longer than it needs to be), but the clarity comes all at once, so I was long past caring by then. Not only is the exposition weak, but almost every cutscene has painfully unfunny banter between the main characters including an irritating magic fox who randomly inserts the- before the-multiple words in everythe-sentence. Similar to my experience playing Final Fantasy XIII-2, I eventually just had to tune out the plot to enjoy the gameplay. Thats a shame, but it doesnt erase the entertaining battle system, the satisfaction of building an unstoppable monster collection, or the thrill of seeing your favorite characters back in action. The barrage of references might be lost on casual followers who dont have the nostalgia to draw from, but thats okay. World of Final Fantasy is aimed directly at fans with fond memories of the series first 15 years.", "date": "Oct 24, 2016", "grade": "8.25"}