{"name": "The Walking Dead Season Two - Episode 2: A House Divided", "ref": "https://www.gameinformer.com/games/the_walking_dead_season_two_-_episode_2_a_house_divided/b/xbox360/archive/2014/03/04/the-walking-dead-season-two-episode-2-a-house-divided-review.aspx", "text": "Desperation. Degenerating mental states. Knee-jerk reactions. Growing up as Clementine gets even more challenging in A House Divided. Expect this episode to throw curveballs and cause you to continually second-guess your quick decisions. It has everything that made season one so gripping, like important relationship development, tragedy, and stunning revelations. This episode puts you in a no-win situation and makes you wonder what you could have done differently. Telltale spent the first episode of season two re-acquainting us with Clementine, showing what shes been up to, and proving she could headline her own game. Now that shes shown she has the chops to survive without Lee, Episode 2 puts her in the middle of everything from confronting group arguments to life-or-death situations.Episode 2 picks up where Episode 1 left off, right after Clementines choice between two imperiled characters. Trust within the group is deteriorating, and characters are cracking under the pressure. This sets the tone for episode 2; tension is on the rise, and it impacts Clementines new group, especially as a dangerous personality emerges, forcing them to find a new safe haven. Clementine gets closer to characters introduced in Episode 1, like Rebecca and Luke, as the group is on the run from the new foe in the Virginia mountains. While Telltale could have just focused on Clementine adjusting to the new people around her, the storyline takes some engrossing turns. New faces and old friends turn up, creating riveting conflict. The new antagonist is so well-written that he makes my skin crawl every time hes on screen. I always felt on edge, wondering whom I could trust, and examining possible motives.The writing is some of Telltales strongest and most balanced. It never relies on just one circumstance or event to make its mark, using a variety of developments to keep your mind racing. For instance, Clems new group has its own skeletons in its closet, but this episode also introduces other new survivor groups to keep the journey unpredictable. Additionally, plenty of nods to the past work enhance the episode. Lees influence over Clementine never fades, and is alluded to just enough that it doesnt feel like overkill or forced. For instance, Clementine showing another child how to fire a gun is a callback to a similar moment she and Lee shared last season. I enjoyed the references scattered throughout the episode, because it reminded me of the first seasons powerful impact.The dialgoue and pacing are spot-on, making conversations feel realistic and natural. However, the degree to which adults trust and depend on Clementine is hard to ignore. Yes, Clementine is special and smart, but shes also only 11 years old. Grown characters constantly coming to her for advice during dangerous situations  especially over other adults  feels forced and unbelievable.The story still makes more of an impact than the gameplay, but heat-of-the-moment choices are a step in the right direction. Telltale has always framed choice as a big draw and, unlike previous decisions, this is one of the episodes where I started to see the ripple effects. As Clementine, you dodge, shoot, and sneak around zombies, but these action sequences also contain interesting choices that must be made quickly. For instance, do you give people the benefit of the doubt, or shoot them before they shoot you? The fast decisions line up well with the gameplay, keeping you in the moment. They also highlight the cost of your actions, making you doubt them, and leaving you to question if a right choice even exists. Smaller choices not directly tied to the action sequences are also just as enthralling, especially in terms of relationship building. One has you picking who to sit next at dinner  an old buddy or new friend. It was a moment that said, You cant have the best of both worlds. Choosing an alliance is one of the most difficult parts because no characters are perfect and everybody is hiding something.The consequences of various decisions are on a graver level this time around  sometimes even life or death. Some are seen almost immediately, while others have the potential to linger into later episodes. Depending on how you react, certain characters may not survive. You have control over the outcomes, so the events arent predetermined (unlike the road trip from hell in season one). And thats not just with choices from this season, but also ones from the past; this episode incorporates 400 Days into Clementines journey. The transition is smooth and adds value with its surprising connections.During Episode 2, I was struck by a line about how connecting with people is important. In The Walking Dead, Ive been doing just that, building alliances and becoming emotionally attached to characters. Telltale is continuing to build on this, and making choices in the name of giving Clementine the best odds is agonizing. Time will tell how much these choices will reflect in future episodes, but so far Telltale continues to make this world and Clementines journey even more engrossing.", "date": "Mar 04, 2014", "grade": "8.75"}