{"name": "Pac-Man Museum", "ref": "https://www.gameinformer.com/games/pac-man_museum/b/ps3/archive/2014/02/28/pac-man-museum-review.aspx", "text": "Pac-Man hit arcades back in 1980, which means theres a good chance that hes older than you. Hes starred in numerous games, and those games have been bundled together in a variety of collections. Rather than toss his titles in a larger library, Namco Bandai is giving the little yellow fellow the chance to host his own downloadable collection, Pac-Man Museum. The biggest draw to the collection is Pac-Man Battle Royale, an arcade game thats hitting living rooms for the first time. Created for Pac-Mans 30th anniversary back in 2011, the game allows up to four players to face off as rival Pac-Men in matches that are structured closely to Pac-Man Championship Editions. Its fun for a few rounds, but theres not a lot to it once you get over the novelty of seeing a gigantic Pac-Man greedily bearing down on one of his smaller counterparts. The lack of online play or the ability to use multiple bots in single-player keeps it from being much more than a quick diversion when you have three friends over.Beyond that, youve got the arcade original and a parade of others, including oddities like Super Pac-Man and Pac & Pal, the side-scrolling Pac-Land, and a port of the console puzzle game Pac-Attack. All told, there are nine games in the collection  not a particularly bad deal, but it really depends on your enthusiasm for all things Pac-Man. I never thought much of the bland, isometric Pac-Mania, and playing it again here didnt change my opinion. I did get a kick out of Pac-Man Arrangement, which retains enough of the classic game to remain familiar while steadily adding features like warp pads, elevators, and boss battles.The overall presentation is cute, with a virtual Pac Room that you can deck out with unlockable items, and a sticker album that you fill up by completing challenges. Namco missed a critical opportunity, however, in putting all the games into a greater context. Why do any of these games still matter? What did each one add to the characters legacy? What year did they come out? Wheres Baby Pac-Man? If youre hoping to get any sense of history from the collection, youre out of luck. This is less of a museum than a self-guided tour. Thats fine, but after seeing so many of these titles packaged together in various collections over the years, I was expecting more.", "date": "Feb 28, 2014", "grade": "7"}