{"name": "Weapon Shop De Omasse", "ref": "https://www.gameinformer.com/games/weapon_shop_de_omasse/b/3ds/archive/2014/02/24/weapon-shop-de-omasse-review.aspx", "text": "Weapons can make or break anyadventure. When playing an RPG, we always make sure we have the rightequipment, whether it's buying a higher-powered sword at a new shop or makingour own tweaks and upgrades with customization. Weapons get us through themajority of our quests, but they're rarely what the journey is about. WeaponShop De Omasse shifts the focus onto making these invaluable implements,leaving the adventures as an afterthought. Even when heroes win, it's theweapons that get the praise. Weapon Shop De Omasse tasks youwith running your own weapon rental shop. The premise is simple: study thequests the heroes are embarking on and rent them weapons to improve theirchances for success. When a hero has a quest, it lists what level of weapon canbe wielded and what types of weapons and elements the enemies are weak against,like fire or pierce attacks. Your goal is to improve your heroes' chances tocome back victorious. If a hero doesn't succeed, the weapon is lost and youcan't rent it out again. This sounds like an interesting dynamic, but Weapon ShopDe Omasse doesn't keep you on your toes. I only lost a single weapon, and itwas because it was staged for the tutorial. Sometimes I didn't even improve mychances as much as possible, but still succeeded. The challenge of running ashop never shines through, and each mission is too forgiving. Without chaos ordifficult choices, my wits went untested. Since there's only one difficultymode, it doesn't give you any way to rev up the challenge, either. What little challenge Weapon ShopDe Omasse contains is in the actual weapon creation. You select the weapontype, add any materials for boosts like poison or extra pierce power, and thencreate it via a rhythm minigame. Your success depends on tapping the metal insync with the beats to shape the weapon. It has some depth to it, as yoursuccess at certain stages in the melody determines the weapon's slash, pierce,and blunt power. You also can't just tap the same part of the materialrepeatedly, or you miss. For the best results, you work your way from the outside,tapping as many different points as possible. The problem with creating weaponsvia rhythm minigames is that it gets boring, especially since each weapon typecarries the same tunes. Everything becomes too predictable, and it'sunfulfilling. In a game where your main job is to create weapons, making theexperience so monotonous and unexciting takes its toll. The actual creation isshallow; weapons aren't complex to make, you can't customize them beyond colorchoice, and even the option to add materials doesn't provide enough depth. Inforging, you merely select materials to add that you either pick up fromadventurers or buy yourself for bonuses. If they were harder to obtain, alteredweapons drastically, or had a hook - like allowing you to create better bonusesby mixing materials together - it would be a different story.As you create weapons and polishthem, scrolling text documents the different heroes' adventures. This givesinsight into how your weapon is faring, but the real draw is the humorouscommentary. Weapon Shop De Omasse doesn't take itself seriously, and that'swhere it earns its charm. The whole time, it makes fun of itself and othervideo games. NPCs rent weapons and say stuff like, ~Are you sure you don't wantto save this weapon for a real character?~ Or they announce that they're the~stereotypical adventurer that are a dime a dozen now.~ Main adventurers also come intothe shop, and these characters have story arcs that play out through variousquests, and they are even more entertaining than the NPCs. They're all prettyeccentric, like an innocent-looking granny who can pack a punch andoverconfident acrobatic sisters who are just picking up a weapon for the firsttime. Still, these diversions aren't enough to overcome the boredom, especiallysince they're treated as background noise. Their journeys play out as you'redoing shop work, so you're more zoned in on that, especially during the rhythmminigame. As more people rent out the sameweapon, the weapon levels up. You also acquire stronger materials as the gamegoes on. That is, until the very end when you're creating the weapon to takedown the Evil Lord. This was one of my biggest annoyances, as it goes againstwhat the game has told you from the start: Always make sure your weapon matchesthe quest level. You never receive materials to create a level eight weapon tomatch the Evil Lord quest. This creates confusion, since the game keeps goingon until you decide to provide a weapon. I actually waited a bit wondering if thematerials were coming and I just had to fulfill some NPC quests or create allthe weapons possible. Essentially, you're supposed to send a character in witha level seven weapon. I liked the quirkiness of WeaponShop De Omasse, but I was never truly captivated by it. The best simulationgames get you in a groove and provide a great sense of progression, making themhard to put down. That just isn't what Weapon Shop De Omasse offers, being toosimplistic for its own good. Level-5 is known for putting a great deal ofcustomization and depth into its games, but here it's missing and I was wishingfor more control over the weapon creation process. Weapon Shop De Omasse offersa diversion and loses its momentum quickly; if only it had something moresubstantial to save it from being another humdrum shop simulation.", "date": "Feb 24, 2014", "grade": "6.25"}