{"name": "The Legend Of Zelda: Tears Of The Kingdom Is Already The Second Best Selling Game Of 2023", "ref": "https://www.gameinformer.com/games/nascar_14/b/ps3/archive/2014/02/19/game-informer-nascar-14-review.aspx", "text": "This is the third game in the NASCAR series from Eutechnyx (now going by ETX Racing), and while it's arguably a better experience than the last two, it doesn't single-handedly elevate the franchise. This mildly iterative title evokes the dreaded specter of the yearly sequel. The good news is that Eutechnyx has created a foundation ripe to capitalize on, but I'm still waiting for it all to come together.NASCAR '14 is not just a carbon copy of Inside Line, but most of its improvements are either minor enough or exposed by other flaws that the sum total of the experience doesn't equate to a lot of positive momentum.For example, A.I. drivers are more aggressive in exploiting the openings you give them, and a pack of cars will freight train you if you can't hold your line  especially until you get your car up to snuff if you're in career mode. This is a good thing, but the A.I. lacks refinement; ramming its bumper down your backside like it was the do-or-die last lap even when it's the first. It's like the A.I. is following a set line, unaware of what's happening on the track. In real-life NASCAR, that would quickly create a pit brawl. Furthermore, the A.I. cars still don't know how to enter the pits safely nor how to execute good fuel/tire strategies on shortened race lengths.Thankfully, 16-player online leagues are available if you instead prefer the headaches real-life people bring. Here you can create a custom slate of races and keep standings for the season. Restarts are clean and overall the experience has matured. It lacks some bells and whistles, but it provides a baseline experience that's better than previous installments.I hoped that this game would reveal a broader vision for the series, taking it beyond a few turns of the wrench. I wanted it to take some chances and make a declaration for why stock car racing is different from regular racing  which it is, and excitingly so. NASCAR '14 doesn't do this. Ironically, the overall lack of ambition and plan to update via DLC (which includes paint schemes and challenges based on real-life situations from the upcoming season) is its own self-defeating argument against yearly iterations like this.At best, this game is a stopgap to hopefully something better in the future, because it's signaling its stagnation.", "date": "Feb 19, 2014", "grade": "7"}