{"name": "Teenage Mutant Ninja Turtles: Mutants in Manhattan", "ref": "https://hardcoregamer.com/?post_type=post&p=208963", "text": "I dont know if any of us here at Hardcore Gamer have properly voiced our views on the recent animated Ratchet and Clank film yet (then again, given its dismal performance at the box office, its rare any of us saw it), but I felt that while it wasnt outright bad, it also wasnt particularly good. Part of that is because it seemed to suffer from a case of lull destruction, because while the film clips in the game posed no problem with long stretches of gameplay in between them, without them you just have a ninety-minute cutscene that never stops with constant quips and the false belief that if its quiet even for a few seconds, audiences will grow tired of it.I bring this up because I was reminded of this while playing Teenage Mutant Ninja Turtles: Mutants in Manhattan and comparing it to Transformers: Devastation. You know, the other cel-shaded brawler based on a beloved 80s franchise and toy line that was developed by Platinum Games and published by Activision. That was a game focused on fast-paced, chaotic action sequences, sure, but it knew when to stop and breathe between skirmishes in order to let you catch your breath, move around and hunt for collectibles, and it wound up as one of last years surprise hits. Mutants in Manhattan, sadly, does not offer the same experience, constantly trying to create chaos, and it suffers greatly for it. Of course, it also suffers for a lot of other reasons as wellBased on the franchise in general, although leaning more in tone towards the current IDW comics, the story here is that The Foot Clan and The Krang have teamed up to cause chaos across New York. And thats pretty much literally it. After you defeat the initial stage with Bebop as the boss, you get to select your next area Mega Man-style from a group of levels that get unlocked, where you eventually face off against the likes of Rocksteady, Karai, and others. But since each of these levels can be tackled in any order, they end up having little to no significant impact on the narrative, and may as well be their own self-contained stories. Such an arrangement even seems to create small errors and similar minor issues. I decided to try out one of the later levels first, and afterwards got a cinematic where out heroes learn that the Foot and the Krang have formed an Alliance. Then, after defeating an earlier level, they genuinely seemed shocked that the Foot were smuggling the exact type of alien weaponry the Krang use. Of course, one could easily overlook a weak narrative if everything else was a-okay, but that was not the case here.Lets begin with one of the positives of Mutants in Manhattan for a moment, as the graphics do indeed look fantastic. The cel-shaded look perfectly captures the feel of both the cartoons and the comics perfectly, as does the pulse-pounding music. The classic personalities of the half-shelled heroes are also here, so at the very least, the game captures the initial feel of the franchise perfectly. Sadly, absolutely none of this effort was put into making the games level design as fun to experience. Despite the title promising mutants in Manhattan, the most youll be seeing here are generic cities, construction sites, and sewers. Mind you, the latter is semi-justified in sewers being an iconic location for this series, but what isnt as justified is blatantly re-using and re-coloring maps and trying to pass them off as different levels.Said levels are made of absolute tedium, by the way. In each one, April ONeil radios you up to direct you to the next objective she picked up, which consists of a bunch of random challenges pulled out of a hat. Go there and defeat a bunch of bad guys. Go there and defuse some bombs while being attacked by bad guys. Go there and take the weapon away from the bad guys (while being attacked by them). There is very little variety here, and it gets annoying quickly, not helped by the fact that April rarely ever mentions any level-specific variants in them, always throwing out the same generic descriptions (with the Turtle re-suing line a-plenty as well). You just head from challenge to challenge until youve completed enough to trigger the boss battle, and to the games credit, the bosses are a nice meaty challenge, and are mostly well-designed.But even traveling between tasks is a chore. The developers clearly wanted the levels to be more open, with areas to explore and collectibles to find (in the form of comic book covers), but even standing still eventually just causes more enemies to spawn, making you wonder why youre even bothering with specific goals instead of just having a more linear, beat-em-up style design where you take out the enemies and advance.The absolute nadir of this was during Wingnuts level, where after defeating a particular group of bad guys on the top of one building, April then told us that there was another group of enemies in the vicinity we needed to take out. But not the ones spawning on the current rooftop, oh no. The ones on the building next to us. So I went there, took out the nasties I was ordered to, and then April said she spotted a new batch on the exact same roof where I already was. The whole damn level was just hopping between three buildings, beating up rock people and floating brains. I think I would have preferred the game to have a Boss Rush mode instead of just wasting my time between the boss battles.And we havent even gotten to the core gameplay yet. Aside from a couple of questionable choices (L1 instead of R1 to aim?), its the classic type of spectacle fighter combat Platinum games does well, but unfortunately it gets saddled down by having to try and control three additional teammates all at once. You can attempt to issue commands to your brothers via a small set of orders, but for the most part theyll do their own thing, taking out any enemy they see in sight, sometimes to ludicrous degrees. At one point we had to guard a pizza stand from being destroyed by the Foot, and the three turtles I wasnt controlling immediately stormed ahead to take out ones that havent even appeared in our vision yet. By the end, I was simply able to just stand there at the store while they did all of the work, waiting forty or so seconds for the clock to run out.You can switch between your turtle of choice at any time, each with their own set of upgrade-able special attacks and stat-boosting charms that you can set up. When you get knocked out, though, you automatically switch to another one, while the turtle you replaced takes time to regain health before rejoining combat. Of course, you also have a few seconds you revive fallen allies as well, which you AI partners will do to each other as well as soon as possible. So between the bots youre playing with that easily seek and destroy, and the fact that fallen comrades are easily brought back without a real penalty, the challenge here is quite slim, not helped by the games length of only a few hours at best.Closing Comments:Its clear that Teenage Mutant Ninja Turtles: Mutants in Manhattan was aiming to be Left 4 Dead with Ninja Turtles, which does sound awesome, but its too focused with cramming in elements from other games as well, including the classic TMNT arcade brawlers and Arkham Asylum (down to the Detective Vision and stealth takedowns). The end result is a cluttered mess that constantly tries to keep you active with something, anything at random, in order to distract you from the poor design. If I didnt know any better, Id say that Mutants in Manhattan was rushed to market in order to coincide with the new film coming out next week. After all, thats the best explanation I can think of for why a team clearly capable of so much created something so shoddy and lacking. The impressive art style may do the turtles justice, but everything else does not. About the only real way one can recommend Mutants in Manhattan is if youre a really die-hard Ninja Turtles fan and have have access to online multiplayer, and even then, the tedious level and mission design is sure to get grating after a while. In the end, sadly, not even an old-fashioned Ninja Rap could save this mess.", "date": "May 27, 2016", "grade": 2.0}