{"name": "Alienation", "ref": "https://hardcoregamer.com/?post_type=post&p=206137", "text": "Housemarque is a studio that is criminally underrated and not as well known as they should be. Gamers who decided to invest in a PlayStation 4 early in its life cycle will know Resogun to be one of the first games they played on the system, as it was one of the first free games on PlayStation Plus. People loved that game, but no one knows that it was Housemarques work. Resogun, Dead Nation and Super Stardust are all stellar games and Housemarque has done it again with Alienation. With any game, there are frustrations and little things that occasionally get in the way of the fun, but overall, Alienation is a game to lose tons of hours to, especially if youre the kind of player that is always reaching for the high score.Alienation is an isometric, top-down, twin-stick shooter that has you playing as a soldier in the UNX, a military force created to defend the world from alien threats. In this story, the governments of the world covered up the first signs of invasion and it was too late once the UNX became involved. Earth was overrun with what we call Xenos. The term alienation is used to describe places overrun by the Xeno invaders. The story of Alienation is told through two characters: a military advisor who guides you on your missions and a scientist who describes to the both of you what is going on. Neither of the characters have much depth and their dialogue just leads to the next mission, so in that sense the story is bland, but its hard to notice when having as much fun as you do when playing.What makes a Housemarque game stand above the rest is the quality of gameplay. The fast, twin stick style that feels great is their bread and butter, and Alienation is no different. The action rarely dies down, and when it does, tension rises as you wait for the next surprise attack. Running around each new environment feels great and each of the three character classs different boosts and abilities give a new way to maneuver the battlefield. Similarly to Resogun, Alienation has three different character options who all feel different, which can be an important decision depending on how you play. For instance, someone like me who likes to jump into the action, do some damage and jump back out is most well paired with the Saboteur, who can do just that with his speed and quick boost. Theres also the tank character, aptly named Tank, and an extremely nimble character called the Bio-Specialist, due to the biological weaponry they use. Each one feels completely separate from one another, but the core mechanics that they share make learning a new class an easy task. When comparing Alienation to the other Housemarque games, it most resembles Dead Nation, as they are both twin-stick, isometric shooters. One of the biggest additions to Alienation, though, is its loot system. Much like in Destiny, random loot drops from enemies, chests and bosses can give you new weapons with varying degrees or rarity, and with that rarity, the ability to further upgrade and customize your arsenal. The different abilities of each class can be upgraded over time as well, earning points towards both active and passive abilities that can be upgraded in different ways, depending on how the player wants to use their character. These systems can get somewhat confusing, but if youre invested and figure it out, the game will reward you with guns and abilities that make you all the more powerful.If thats not enough, though, you can always call in some friends. Alienation is the first Housemarque to incorporate this kind of squad-based multiplayer, and it really changes the whole dynamic of the game. Players can randomly pop into your game (if you allow it) and help you out. A total of four people can be in a game together and anyone can progress the mission. Whats cool about multiplayer is that your mindset has to change. Players who are using the Bio-Specialist can heal their teammates, Tanks can crowd control better than anyone else and Saboteurs can revive downed teammates while camouflaged. It really becomes more of a team effort and you have to think as a support character rather than the rogue attacker that youre used to. The problem with random matchmaking, though, is that the people youre playing with might not understand this and will get you killed. I recommend playing with people you know, so that blame can be placed firmly on those responsible for failures. Another crucial aspect of a Housemarque game is the art style, which varies between their games, but which is always amazing. The amount of color in Super Stardust is especially crazy and even Dead Nation seems colorful for a game about zombies. Alienation too is filled with color. The aliens use color to differentiate themselves from other versions of the same enemy, like how one type which is purple will detonate itself on a delay, while the red version will detonate immediately once it dies. The multiple locations that youll travel to throughout the campaign all feel interesting and new, and all have a distinct color palate. Even the weapons and explosions give the world color, as lasers and shockwaves fly around the screen as you take on waves of enemies. Alienation is beautiful, and surely lives up to the Housemarque aesthetic standard.While all Housemarque games have had fun soundtracks, Alienation stands out as the one with the best sounding guns and enemies, and definitely the most memorable score. The music is thematic and certain tunes will get stuck in your head after a long play session. Each gun sounds enormously different, which makes playing as a new class an even fresher experience. Its amazing how much sound can enhance or detract from an experience and luckily Alienation hits just the right notes to make it all the better. So far Ive been talking Alienation up pretty good, but there are some flaws with the game that can take away from the overall fun factor from time to time. The first thing is the Horde Approaching event. This is a random event in the game where seemingly hundreds of easily defeated enemies spawn in all at once from all different directions and try to overwhelm you. While these events are easily overcome on their own, they tend to happen at the worst times, and it seems to be on purpose. Right when I would trigger a battle with one of the mini bosses strewn about the map, it would alert me that a horde was approaching. The combined strength of the horde and the mini boss would easily consume me and the opportunity for loot was stripped from me, because if you die while trying to beat a mini boss, they disappear and cannot be found again. This was aggravating and unnecessarily so. When fought separately, hordes and mini bosses were both fun little challenges, but when stacked on top of each other, not so much.If theres ever an Alienation sequel, or maybe a spiritual successor, I would also recommend that Housemarque take some more time to flesh out the upgrade, reroll and loot systems. Although these were nice additions to the game, they seem half-baked, and I think they had the potential to be really interesting. A lot of Alienation takes influence from Destiny and if they doubled down on that and made these systems reflect even more of that games complex upgrades, reroll systems and even RNG, the next Housemarque game could really benefit. Maybe Housemarques next game, MatterFall could be just that. Housemarque always seems to innovate and grow with each game, so the chances are good. Closing Comments:Although it has some minor drawbacks and can be frustrating at times, Alienation sucks you back in quickly with its beauty and incessantly fun gameplay. Players who love the grind and the challenge of a hard game will lose many hours to Alienations repetitive but rewarding missions, and players who just want to shoot aliens will still have a good time running through with friends. If you know and love Housmarque games, Alienation is arguably one of their best; it feels great, sounds great and looks great, and that makes the twenty dollar price point extremely reasonable. In a world of game that take themselves too seriously, Alienation is simply fun, and its a game that I can see myself coming back to when I need just that.", "date": "on May 12, 2016", "grade": 4.0}