{"name": "Conan Exiles", "ref": "https://hardcoregamer.com/?post_type=post&p=299086", "text": "In order to achieve ones goals the focus needs to remain on the process and not the prize, otherwise that lofty trophy will forever remain out of reach. This mindset needs to be maintained during Conan Exiles, especially in the early stages of the game. Everyone wants to crush their enemies, see them driven before them and hear the lamentations of the women, but before this happens theres some sand that needs to be removed from some rather uncomfortable bodily crevices. Also, putting on a pair of pants wouldnt be the worst idea in the world.Conan Exiles is about surviving in the harshest of environments. The game begins with the player naked on a cross (or wearing a modest wrap depending on the prudity settings) and Conan happens to wander by to free them. He quickly leaves, offering almost no valuable advice and the player is left to fend for themselves in the desert. Clothing, weapons, food and shelter are all things the player will need to acquire in order to survive this harsh desert. Fortunately the Exiled Lands are oddly plentiful in their resources, and soon after being cut down from the cross the player can amass enough materials to put together some crude clothing and stone age weaponry just by button mashing the action key while running around.Theres a lot of freedom in character design. The player will have the ability to choose gender, race, hairstyle and religion along with modifying the shape of the characters physique. The player can customize their characters body to their hearts content, and for the more immature player this includes female breast size and male genitalia. This particular design feature does have potential to overshadow some of the other traits of the game, as people who knew I was covering Conan Exiles were asking about this feature. The breast augmentation slider can range anywhere from the most modest of endowments to flesh colored beach balls, though the male augmentation does not quite go to such ridiculous lengths (Editors note: I see what you did there) but male characters can be steppin large and laughing easy. Once Conan has cut the newly-designed character down from the cross, its time to explore the unforgiving Exiled lands. There is a good chance the player will be killed rather often early on. On the PvP servers there are clans of other players that are a bit of a concern, though this could be more of an asset if the player happens to be on a private server with a lot of their friends. The PvE servers make for a lonelier adventure, as NPC characters are uncommon and the animals are so ridiculously aggressive youd think this was a Ubisoft game. Groups of multiple crocodiles will abandon their fights in progress with NPC humans to chase after my character and trying to fight four crocodiles at once with just a stone hatchet is not going to end well for whoever isnt on the same team as the crocodiles.The act of being stripped naked, nailed to a cross and left to die in the desert is a perfect metaphor for how much guidance the player receives when they begin playing Conan Exiles. With no direction or instruction, its easy to wander aimlessly under the hot sun while slowly dying of thirst of hunger, longing for a pair of shoes. At the first sight of water or fire, a feeling of relief will wash over the player until a giant turtle turns the player into a mangled naked corpse or another exiled warrior decides to use their bow and arrow to turn you into a human porcupine while their companion hacks you to death with their sword. Its easy to get discouraged early on, but sticking with the exiled lands for a bit can pay off.This may change later on, but there are no real traditional quests in Conan Exiles. There are chapter milestones listed in the menu screen, like build a weapon or find shelter but these are basically left up to the player to figure out how to do them or how they wish to go about doing them. Once we get into this, the system of Conan Exiles is actually deep and intuitive. As the player levels up they can spend knowledge points to learn more intricate crafting recipes that they can use to build equipment to forget weapons and armor and their shelters. A tannery is needed to convert animal hides into leather and the leather can then be fashioned into armor provided theres an armorers bench. Some resources are so abundant they seem virtually limitless while others are much more scarce. Patience is a key part of Conan Exiles. The player will be able to fashion some crude clothing and weapons very soon after beginning the game but it will be several hours before they are able to build even the most modest excuse for a hut, which once all the components are built the shelter can be assembled in a fairly simple Minecraftesque placement menu, which is kind of how life would be if Ikea opened up a real estate section. This patience can pay off, as on Steam it can be seen there are many players who have logged (at least when the game was still in Early Access) several hundred hours into the game, and that is where the player character has gone from an exile left to die to someone who has amassed an army of thralls and constructed a sprawling, nearly impenetrable fortress.Taking place in the world of Conan, the inhabitants of this world need to be as harsh as the environment in order to survive. Building a massive fortress is a daunting task for one individual, so its best to devise torture devices to break the spirits of those the player has conquered, much like that massive wheel Arnold was stuck pushing in 1982. After their spirits are broken, these thralls will defend your domicile and possessions to their death. Combat in Conan Exiles is exceptionally brutal, as every encounter with a human opponent resulted in a corpse with limbs and/or heads laying separated from the rest of the body on the ground. As part of the survival tactics, carcass can be hacked up even more and the innards consumed. Just make sure to cook them first, youre a barbarian, not a savage, and eating raw intestines will bring about food poisoning, something this writer learned the hard way. As brutal as combat might be, this is one of the weaker aspects of the game. Hit detection feels inconsistent and combat movements dont feel fluid at all. Targeting and hit detection are areas that dont seem like they were finished, and while the fighting mechanics are serviceable, one would hope for something of a higher caliber in a Conan game. Hopefully this aspect becomes more streamlined down the road in a patch.Despite spending close to a year and a half in Early Access, one of the biggest complaints about Conan Exiles is that it still feels rough around the edges. Animations dont always looks right, such as climbing up the side of the tree where the player looks as though they are grasping at rungs on an invisible net placed adjacent to the tree. NPCs occasionally break down and will stop attacking the player or animals or speaking and just kind of walk in place, unresponsive to any external stimuli. Graphic quality in general is inconsistent with some animations and textures looking like entry level last-gen titles while other sequences beg to be displayed on a 4K TV. There is no mini map or compass in the HUD so the map in the menu screen has to be constantly referred to for navigation. The player can set markers on the map, but those seem rather pointless since they are only visible when the map screen is open.Closing CommentsDespite its issues, Conan Exiles is actually an enjoyable survival game that can easily suck hours away from your life before you even realize it. It can be treated as a solo single player adventure, a co-op outing or a ruthless PvP experience depending on which approach is most suitable. The survival aspect is unforgiving, but thats kind of what the survival genre is known for and incorporating a Minecraft-like element in such a brutal manner adds a layer of depth to the title. Those looking for a strong narrative wont find one here, but instead this is an open-world sandbox where the players actions will write the pages of their own story. The combat is mediocre and in some ways this still feels like it needs more time in the oven, but those who forgive these shortcomings can have a lot of fun in Conan Exiles.", "date": "May 19, 2018", "grade": 3.5}