{"name": "Hitman  Episode 2: Sapienza", "ref": "https://hardcoregamer.com/?post_type=post&p=204623", "text": "Continuing with their plans to release a new episode each month, Square Enix has been able to somehow keep to their word, at least for now, with the reboot of Hitman. While the first episode of the newly episodic format left a sour taste in our mouths thanks to the slow load times (at least on consoles) and terrible connection issues that would boot players back to the main menu, theres still hope that IO Interactive will learn from their mistakes and fix the formula. The results of the second episode are a mixture of highly improved to still downright disappointing. Theres nothing like simply pressing the Options button with the desire to save, only for it to load for a minute before informing the player that the connection has been lost and will now send them back to the main menu without a checkpoint. We move away from Paris and travel to the exotic Italian town of Sapienza, Italy where new events await Agent 47 and his signature assassinations.While the first episode took place in a massive mansion with a multi-floor architectural design, the second episode is located in the coastal town of Sapienza. Theres still a mansion to climb and explore, but it pales in comparison to the structure in The Showstopper, although thats only because each floor was a whole new location all together. Fortunately, its the rest of the map in Sapienza that really shows the breath of life IO Interactive can bring to the Hitman franchise. Instead of being confined within this enclosed structure, Agent 47 starts off in the middle of a busy town which has elevation to its design and an overabundance of interior locations that can be entered and used to his advantage  at least in certain situations. It feels far more like an open environment than ever before, featuring hidden secrets and unknown opportunities that sometimes can be located on the other side of the map from where the overall objectives are located. The town itself is beautiful, bustling with life and variety, never feeling like the areas were simply slapped together, but instead are natural for their surroundings. The hit is simple: kill a scientist and a wealthy man as they are constructing a weapon that can target specific strains of DNA. Its a frightening concept, so obviously someone in the world would want for this scientific breakthrough to up and disappear. Its not just about killing those two, but destroying the research in the process. While both of the targets in The Showstopper felt like they were going around in a pre-determined pattern with little story to them, its the complete opposite here. The female scientist, Francesca De Santis, has more complexities as shes not entirely on the side of Silvio Caruso, the second target. You can impersonate a lover, a private investigator and others to interact with her, strengthening her background alongside the company she works for, Ether. Silvio Caruso, on the other hand, is less of an interesting character because hes just a self-indulged rich jerk, but has a soft spot for his deceased mother, so it does open up plenty of possibilities to mess with his head. There are even smaller stories going on in the background, such as a scientist who made a mistake that cost the life of a colleague, causing her to feel regret and depression.With such an open environment to poke and prod your way through, theres a plethora of ways to get the jump on the two targets. As per usual, theyre always escorted by someone and it becomes difficult to get them alone unless you pull on the right strings. Its about blending in, hiding, and impersonating the right individuals that may lead to the perfect kill. Unfortunately, one of the downsides to the second episode is just how easy it is to get into disguise. There are what seems like uniforms scattered about everywhere, making it an incredibly easy game to sneak around in with very few who will catch on. The way IO Interactive counterbalances this is with the hidden, evil-lair below the mansion where its surprisingly difficult to move about as most of the scientists and special security know each other. On that note, the underground lair could have been slightly larger as it feels far too confined and could have been the highlight of the entire episode. But alas, the number of opportunities feel far fresher than they did in the first episode, lending more creativity and thought to the execution.Unfortunately, while this sounds like a significant improvement over the first episode, all the technical issues regarding the online functionality and load times remain. The number of times we were kicked back to the main menu or left waiting for the level to load for an excess amount of time is a huge disappointment, at least on consoles. Fortunately, we experienced far fewer connection issues than we did with the first release, at least in-game, but where the experience seems to drag is in the menus. Overlooking the lengthy load times by just pressing the Options button, trying to save we were removed from the mission far too many times for our liking. Its definitely an improvement over the release last month, but the problem still runs amuck. Even with a stable interest connection, theres no stopping Hitman from removing players from the highly enjoyable experience. Closing Comments:The second episode of Hitman is a satisfying adventure thats once again dragged down by technical issues. Looking past the extensive load times and online connectivity issues, theres a fantastic episode here, with even more options than ever before. We do wish the lab section was a bit better structured and grander as it felt far too confined in comparison to the rest of level, but fortunately, Sapienza as a whole is not only a beautiful location to traverse, but there are an incredible number of creative and well-designed opportunities scattered about. If IO Interactive can work out the technical kinks and continues forth with this level of creative quality, theyll have something special on their hands.", "date": "April 29, 2016", "grade": 4.0}