{"name": "Severed", "ref": "https://hardcoregamer.com/?post_type=post&p=203940", "text": "It seems a bit too cliche to start this review with a quip on the state of the Vita in 2016. After all, most reviews will probably touch on how Severed, the latest title from heralded indie studio Drinkbox, is the last great exclusive on the Sonys oft-overlooked hardware. Instead of discussing how Vita Island is a sad lonely place, it seems far more appropriate to talk about how Severed is in the discussion for a prestigious subjective crown that will likely never be officially bestowed. After spending time with the first-person dungeon-crawler, it doesnt feel at all hyperbolic to suggest that the talented team at Drinkbox Studios may have created the single best touch-based game ever.Sure, there are excellent games out there that make use of a touch-based interface, but none of them feel quite as dynamic and intuitive as Severed does. Granted, theres not enough time in the world for one man to play through all of the awesome touch-focused titles floating around on iOS, Android, Vita and Wii U (okay, maybe there is enough time to play everything on the latter), so this bold claim cant actually be proven. However, after beating Severeds six-hour campaign and spending a few days pondering the weight of this beautiful title, its safe to say that Vita owners who pass up the opportunity to play Drinkboxs newest game will be doing themselves a great disservice. Simply put, outside of Persona 4: Golden, Severed just might be the best exclusive title on Sonys flagship handheld. When you consider that Persona 4: Golden is an enhanced edition of a PlayStation 2 release, this means that there is a strong argument to be made for Severed being the best original Vita title out there, period.Severed places players in the role of Sasha, a young warrior who lost her arm under mysterious circumstances. Despite the fact that Sasha is missing one of her four limbs and is wandering around what appears to be a colorful, monster-infested version of Hell, she is at a distinct advantage thanks to the training of her mother, who was also a great warrior. After losing her family to the perils of the underworld she finds herself in, Sashas only goals are to find her brother, mother and father before escaping the disturbing environment she finds herself in. Without giving too much away, theres a tangible emotional nature to the proceedings that has the potential to inspire genuine sadness and despair up until the very end. Despite the fact that Severed has a far darker tone than Guacamelee!, there are quite a few similarities between the two in terms of art design. Its impossible to look at Severed and not realize that the fine folks over at DrinkBox made this title, as it boasts the same quirky, colorful palette that made this Toronto-based studio so well known in the independent game space. Aside from the fact that the sheer beauty of Severed seems to pop off of your screen, especially if youre one of the lucky ones who owns an original OLED Vita, the sheer creativity of this world shows through during every battle against a wide variety of grotesque (yet somehow adorable) enemies.Releasing a first-person touch-based dungeon-crawler on a handheld whose sales have largely stagnated was certainly a risk for DrinkBox, but the end result is a six-hour romp of pure gameplay bliss. In order to find each of the members of Sashas family, players have to navigate through a series of environments made up of rooms with four potential paths, all in first-person. Players are going to spend a great deal of time looking at the mini-map in the top right-hand corner of the screen, as its nearly impossible to progress without exploring all of their surroundings. Each section is incredibly intricate, but brilliantly designed thanks to a combination of light puzzle solving and secrets hidden behind Metroidvania-style ability unlocks. Take for example, a sequence that occurs roughly halfway through the campaign. In order to unlock a door that will allow you to progress towards a stone that will unlock the gate to a boss (yes, it gets pretty intricate), youll have to spin a red wheel, which gives you a limited amount of time to get through a red door, do the same with the blue door before the original red door closes and open up a separate gate in order to avoid losing your key to a glowing doorway. Despite how complicated this truncated explanation is, the The neat part about these puzzles is that they are more about execution than actual mental gymnastics. The solution to every area can be discovered by looking closely at the map or wandering around until the answer presents itself. Severed is a master class in dungeon design, with every area striking a fine balance between complexity and accessibility.Despite the fact that its dungeons are designed quite well, Severeds combat system is what takes it from being great to being outstanding. Swipes of your finger on the Vitas screen function as sword slashes, with larger swipes dealing more damage than smaller ones. Every single enemy that appears throughout the proceedings has both a weakness and a standard set of attacks, the later of which can be countered either by swiping against them (the enemy in the screenshot below requires a swipe up and to the right, for example) or by simple attacking them until they are back at rest. By attacking a foe, players will have the opportunity to attack its weak spot for a set amount of time, thus reducing its health and getting you closer to success. Because of the ever-evolving nature of Severed, and its consistently increasing difficulty, these enemies increase in both number, defense and ability (thanks to magic buffs), resulting in every battle having some sort of dynamic order that only becomes apparent after a bit of thought.For instance, a battle might present you with two melee enemies with buffs that increase defense and two foes with increased attack speed that will unleash devastating hits unless you damage them, thus resetting their attack progress. Simply defending against oncoming attacks will get you caught in a never-ending loop of defense. However, Sasha eventually gains the ability to steal one or more magic buffs away from an enemy, so stealing the attack speed buffs gives you enough time to chip away at the melee enemies before the time-based foes unleash doom. Its admittedly tough to explain such an intuitive process, as one simply has to play to understand. However, theres a genuine fluidity and brilliant method of educating the player that becomes apparent from the moment that multiple enemies appear on screen. Make no mistake, even if youre not traditionally a fan of touch-based gaming, the rhythm and focus on intuition baked into Severed allow you to gain skill without even realizing it. Combine this with the addictive loop of upgrading Sashas weapons and powers thanks to an easy-to-use set of RPG elements, and Severed becomes the type of game that dangles a carrot in front of you just enough to keep you awake until the wee hours of the morning.On top of its flawless battle system and intricately designed dungeons, Severeds progression system allows players to unlock abilities constantly. In addition to having a health bar and a mana bar for magical abilities, Sashas Focus Meter increases and decreased based off successful and failed attacks, respectively. Once shes connected on enough slashes, shell get the chance to sever the limbs of any enemies that she kills while the meter is active, giving her currency to spend in Severeds upgrade menu. Before diving into exactly what you can unlock, its important to note that there is absolutely nothing more satisfying in Severed than beating an enemy and cutting off its limbs. This sequence pauses the entire battle, giving you the opportunity to react as quickly as possible in order to make your character better. On top of the fact that this mechanic is flat-out badass, its also incredibly addictive about unlocking rewards in the middle of an encounter.The potential upgrades at Sashas disposal are divided into combat, her buff-stealing ability and her stun ability, with every possible upgrade on each tree requiring a combination of two specific monster parts. In addition to all of the items that youll obtain during the frequent severing sequences, youll also find Giblets in various porcelain containers found throughout each of Severeds various environments. Aside from having a downright adorable name, Giblets can be transmuted into the monster parts of your choosing (after unlocking the Transmutation perk, of course). As you gain more and more skills, the required cost for more powers becomes higher and higher, so transmutation becomes essential for anyone attempting to unlock every available power. Creating two paths for obtaining upgrade currency was a smart move on DrinkBoxs part, as the brutal difficulty of some of Severeds later battles might prevent low-level players from getting the opportunity to do as much severing as they would like to in battle. Closing Comments:Despite the fact that the PlayStation Vitas low install base could potentially hinder Severeds success, DrinkBoxs gamble on Sonys struggling handheld will likely pay off. First and foremost, the Vitas current user base has established that it will purchase everything that it can from the Vitas digital storefront, so the idea that a hefty portion of the audience will dive in on day one is certainly not outrageous. Second, when you consider that arguably the best exclusive to date is arriving at a time where the handheld is desperately seeking quality hardware, it makes sense that anyone looking to play something on their Vita will flock to Severed. After all, its a marvelous dungeon-crawler whose touch-based combat never shies away from being responsive and intuitive, which allows players to gain more and more confidence in their abilities as the campaign progresses. Of course, a brilliant combat system is just one of the factors that makes Severed a cant-miss game for Vita owners, as DrinkBoxs patented art-style and focus on smart level-design are nothing to shake ones head at. If Severed does turn out to be the Vitas swan song, Sony can hang its hat knowing that the Vitas last hurrah was a grade-A banger from a premier independent developer.", "date": "April 26, 2016", "grade": 4.5}