{"name": "Final Fantasy IX (PC)", "ref": "https://hardcoregamer.com/?post_type=post&p=203408", "text": "Final Fantasy IX is one of the very few Final Fantasy games that has remained untouched from its initial exclusive release on the original PlayStation. We did see a peculiar mobile port earlier in 2016, but for close to sixteen years now, the only true way to play Final Fantasy IX was on a PlayStation. Well no longer as Square Enix surprised fans that theyre not only porting the old school RPG to PC, but they pulled a Sega and announced it was available right now. This is no slapped together port, either, as the Japanese publisher has learned greatly ever since they brought Final Fantasy XIII to Steam. Final Fantasy IX comes with a bevy of unanticipated additions, along with enhanced graphical fidelity in certain aspects. Nostalgia is running deep with the PC port of Final Fantasy IX as Square Enix seems to have done the sixteen year old game justice.We could go on talking about how much Final Fantasy IX is one of the best games in the series due to its focus on traditional Final Fantasy values, but most of us already know that. Instead, were focusing on the quality of the port and the various new inclusions that have been integrated into the release. One of the most useful new additions is the Continue feature. The original game simply had new game and load functionality on the main menu, but what has been implemented in the PC port is essentially an auto-save system. Anytime you enter a room or area, the game will save, allowing you to restart a portion of a location with ease. This is especially convenient if you need to leave your computer and cant find a save point anywhere, something that isnt uncommon with these lengthy, older RPGs. It may not be the same as save states where you can load at any spot in the entire game, but it certainly helps in tight situations. It ensures that players wont be losing hours of gameplay due to power outages, unforeseen game overs, crashes  which we never ran into any, or any other unfortunate setbacks. Outside of the auto-save feature, there are roughly 150 save slots available, emulating essentially ten different memory cards. Its hard to imagine anyone using every single one of these slots, especially with Cloud saves being integrated, but the option is there nonetheless. Finally, outside of the normal achievements for Steam, Final Fantasy IX comes with a number of boosters that are applied during the pause screen and in the configuration menu. This includes a fast forward button, which runs the game way faster than anyone should play it at, auto-attacking which can be quite useful when grinding, no random encounters for getting through areas with ease, and just a bevy of cheats that range from damage modifiers to obtaining maximum Gil. As you can see this isnt your traditional port as Square Enix has created a number of new features that help streamline the occasional grindy experience, not to mention help if you get stuck.While we didnt run into any technical issues such as crashes or glitches, there was a problem with controller functionality. While the keyboard controls are more than usable, the game does still feel more responsive on a controller, especially considering it was originally designed for one. Numerous occasions when loading up the game, we found that the Xbox One controller would freak out right at the main menu and would progress into the game itself. It would emulate as if we were continually hold left on the left thumbstick, making it very difficult to do anything. The only way we were able to fix this issue is shut the game down, disconnect the controller, reconnect it and reopen. This happens almost every time we start running the game, things quite annoying. Thankfully, once everything is settled, we didnt run into any other issues regarding the controls. The big question a lot of fans are wondering is if the game has received a graphical upgrade. The answer is a faint yes. Because the majority of the environments are pre-rendered, they still retain their low resolution imagery. Fortunately, character models and even some pre-rendered cutscenes have been touched up to give more clarity. Doing this, though, really brings out the outdated and low resolution backgrounds, and while the CG cutscenes seem to have been touched up slightly, they seem to run at a lower frame rate. Outside of that, the menus have been completely reworked, although the nostalgia is diminished in the new, wider battle user interface as its far bulkier than it should be. If the PC port supported widescreen, which it doesnt, maybe the wider battle interface would have been beneficial, but now it feels like it takes up too much space.As for performance, we played Final Fantasy IX on a decent GPU (AMD 7950) and an up-to-date CPU (Intel i5-6600k) and it ran as smooth as butter. Its difficult to determine how the game will scale on older machines, but considering it only really needs to render a couple of low polygon models on screen at once, chances are players wont have any trouble running this on an older rig. Square Enix even recommends an Intel i5 2520 CPU, requiring only a nine year old model in the Intel Core 2 Duo to function on a baseline. Suffice to say, so long as your computer can play, say, Portal 2, chances are youll be able to run Final Fantasy IX comfortably. Closing Comments:Final Fantasy IX for PC is surprisingly well done for a sixteen year old port. Square Enix could have simply just thrown together something with little effort, but instead what weve received is a far better experience. With that said, its still not a perfect port as we ran into at least one controller related issue, and the pre-rendered background art can be hard to look at at times. The story of Final Fantasy IX still holds up today, feeling more like a traditional Final Fantasy than anything in the last twenty years, and the gameplay, while a bit slow at times even for turn-based standards, brings back memories of when the series was revolutionary. Even though the original release has been out for so long, Final Fantasy IX for PC still finds a way to feel fresh.", "date": "April 22, 2016", "grade": 4.0}