{"name": "Rogue Stormers", "ref": "https://hardcoregamer.com/?post_type=post&p=203313", "text": "(Update 04/27/16: Black Forest Games patched Rogue Stormers the day after this review was published. It is highly encouraged that parties interested in this title check out the post-patch addendum here. It got really good.)Were someone to ask me to put together a wish list of features for a 2D action/platformer, Rogue Stormers would be the end result. An action platformer with randomly generated levels, persistent perk unlocks, Rogue-like structure and an aesthetic that mashes up fantasy and sci-fi in an interesting fashion nails the checklist of my dream game. It is with regret that it must be reported that the execution of said dream game isnt quite perfect.This is not to argue that the title does not do what it set out to accomplish. Developer Black Forest Games created Giana Sisters: Twisted Dreams. This pedigree alone shows that there is some serious talent at work behind this title. They understand how to create something with style. Veterans of that game can attest that the developer knows how to challenge their players.One of the biggest draws, the endless replay value packed in, works extremely well. The random level generation is executed flawlessly. Utilizing a mixture of a large number of well crafted elements to plug in randomly means no play through will be the same. These elements fit together seamlessly, creating stages that feel like they were perfectly balanced and meticulously designed. It wasnt until I started a second attempt after dying stupidly on my first that I even remembered that randomness was a feature of this title. The action feel of the run and gun controls is very well executed, too. Using either mouse aim or a twin stick controller works without issue. There is no acclimation time needed to begin causing 360 degrees of mayhem, executing a rocket assisted jump, and then dashing to a well placed platform out of harms way. Executing one of the five characters cool down based specials is a breeze, as is attacking with a secondary weapon that was picked up in the environment. The design around player movement is such that enemy shots can always be dodged by the attentive gamer, and returning fire is even easier. There are quite a few cracks in the overall feel of the gameplay, though. For a game that bills itself as being designed around fast paced run and gun, most of the trash minions require too many shots to take down. Many encounters revolve around staying put, keeping the area clear of the small goblins, and jumping over enemy bullets while pumping round after round into them. This slows the pace and can quickly become annoying. Leaving the same enemy behind can result in having to deal with them again if backtracking is needed. That, and they might drop loot or experience.This dropping of experience is another frustrating factor. Instead of leveling up mid game, as is common, each of the five characters share an experience pool. Over multiple run attempts, the player slowly accrues the stuff until the bar is full. Once it is finally full, the player will be able to choose between one of two randomly selected perks upon the next failure. The perk is permanent and will apply across all characters. (Update: This is incorrect. The levels are earned per character.)This idea is fantastic in theory. In practice, it takes way too long to gain enough XP for this system to even make a difference in play. The points arent earned by simply killing enemies. Instead, it drops from killed enemies on very rare occasions. It can also be found around some of the levels. Players wont be blamed if they choose to stop worrying about this mechanic altogether. Admittedly, Rogue-like games tend to be about the current run. When all is lost, its lost. So, it could be argued that this isnt the worst misstep. (Update: It should be noted that the framerate issue caused me to avoid heavily populated areas, thus missing out on loads of experience.) There is also an issue with framerate drops. While I dont have an especially beefy computer, it does surpass the recommended specs on the Steam page. Even then, when multiple enemies were on screen, the frame rate plummeted to an unplayable state. This happened a few times, even after turning off all non-required background processes and effects on the PC, and dropping the resolution. I concede that the issue is probably due to my rig, if it can be called that. If this really is the case, though, I would highly recommend that Black Forest update their page.Still, when it works, Rogue Stormers is excellent. There is so much fun to be had in trying out the different characters and their weapons. El Cazador and his sniper rifle is great for players who know how to abuse the vertical movement system to stay out of harms way. Brechts minigun is great for players who want to stay in the thick of it and play the game like a slower paced Contra. This is just two of the five different play styles available. Each works great for solo or multiplayer run attempts. There are also a wealth of secondary weapons to be found. My personal favorite is the weapon that launches a black hole. Certainly, other players will find their own picks. Closing Comments:The most frustrating thing about Rogue Stormers is that it is a few major flaws from being the perfect game. The potential for unlimited replayability, designed to be enjoyed solo or with friends, and permanent cross character boosts make for a title that would warrant untold hours of late nights and miserable, sleep deprived mornings. The pace of actual play hobbles it, though. The technical issues then proceed to beat it in the back of the head with a brick. Rogue Stormers can be easily saved with some tuning from the developer, and considering how hard the people at Black Forest work, it probably will come around. In the meantime, it is not fun storming this castle.", "date": "Bohn on April 21, 2016", "grade": 3.0}