{"name": "KOI", "ref": "https://hardcoregamer.com/?post_type=post&p=202908", "text": "After the success of thatgamecompanys endeavors, namely Flower and Journey, games based on serenity and art have been in an uphill battle. On one hand, this makes sense, considering that we subconsciously judge the merit of something based on how its quality compares to the top of its field. We know what an average basketball player looks like in 2016 because of how amazing Steph Curry, LeBron James and Kawhi Leonard are. Theres no way to know what a middling meal is without experiencing the best dinner of your life. Perhaps a more applicable comparison would be whenever someone says that a shooters mechanics feel tight. Generally speaking, the barrier for tight shooting mechanics involve secret comparisons to a couple of franchises in particular: Call of Duty and Gears of War.its also inherently unfair, however, to compare a game like KOI, the first title from Chinese developer Oasis Games to something like Journey. The latter is a once in a generation borderline masterpiece that has become a go-to pick-me-up for thousands and thousands of gamers around the world. Its the type of game that inspires lunatics like myself to get massive tattoos in their honor. No game can be Journey because only Journey can be Journey. At the same time, its worth bringing up this comparison, as it allows us to know what a game in this vein would have to accomplish in order to be considered superb in the same fashion.KOI does some things right, and it occasionally hits on the serene ambiance that it clearly is going for. Unfortunately, theres a decided lack of focus in its gameplay, with ideas seemingly thrown in for variance before completely disappearing. KOIs also looker, as its art-styles simplicity actually works in its favor quite well, but the entire package feels a bit too scattered to recommend. KOI sports an extremely simple premise that manages to get lost in all its attempts to vary its gameplay. Essentially, you play as a small fish, who is looking to restore beauty back to its environment after humans have, both literally and figuratively, muddied the waters you live in. The thing is, KOIs narrative definitely gets bogged down a bit towards the end, so its actually largely unclear whether or not this is a tale of a fish trying to save his environment or something far more existential. This is emblematic of its biggest issue: KOI is trying to do far too much in its roughly two-hour time-span. While pretty much every stage involves rounding up smaller fish and using them to open up color-coded flowers, there are also light puzzle elements, light stealth, frustrating nonlinear segments and a quest to find collectibles whose importance is left completely unclear until the very end of the campaign. KOI would make for an outstanding experience if it stuck to its best aspect, namely exploring quasi-linear environments while guiding fish to their correct homes. In fact, if KOI lacked any semblance of puzzles whatsoever, it would actually be better for it.Never is this more evident than in the third level, which forces players to memorize Simon-like light/melody sequences on a seven-leaved branch. Imagine, if you will, if Simon lacked any color variation (if the red, blue, yellow and green quadrants were all green). Youd be completely unable to repeat the color sequence in your own head, making the act of improving your memory all but meaningless. Now, give Simon seven lights instead of four, and you have the two memorization puzzles in KOIs third stage. Simply put: its bad puzzle design, and it never improves upon itself at any point. Much like every other puzzle, its here and gone before players can bat an eye. While KOIs more linear stages are actually extremely engaging, with a level featuring a maze set completely in the dark being the standout highlight of its short campaign, its more open levels are flat-out infuriating. In a game designed to challenge you and test your will, frustration can be a good thing. In a game whose entire elevator pitch is based around making players feel calm and happy, frustration is the absolute antithesis of everything that the developers are hoping to create. In these open areas, players simply have to swim around areas with no discernable visual queues until a larger fish comes and makes the path towards progression evident. Unfortunately, even this guiding mechanism stumbles in its execution, as bumping into the fish will send it careening off in the other direction, forcing players to awkwardly dodge it in hopes of advancing. The screenshot above actually shows the stage in which this occurs, and this awkward bit of design hinders what would be the single most beautiful environment in the entire game.Overall, KOI might not appear to be a breathtaking visual experience, but theres something to be said about how gorgeous it is in its simplicity. From its vibrant single-shade hues to its awesome shadows, KOI would certainly be a hit if games were judged purely on their art-styles. Its a shame that this is actually the only item in the entire experience that feels completely consistent, as even progressing to the final stage is based upon the aforementioned collectibles, which seems more suited for an arcade shooter rather than a calming bit of playable art. Closing Comments:KOI is the type of game of which the stumbles sting the most. Its easy to see what could have been with a more unified vision and the fact that its issues lie more in its additions rather than technical follies is nothing short of disappointing. When a game falls around the two-hour mark, there has to be complete conceptual unity, otherwise the end result is going to feel like a scattering of neat ideas that feel shoehorned in rather than elements making up a cohesive whole. Theres no single bit of KOI thats more evident of its misplaced vision than in one of its trophies, which pops once your playtime hits twenty-four hours. Considering this is the type of title that you pick up and put down in one sitting, the inclusion of this trophy says all that you need to know about the disconnect between its goals and reality. If youre the type of gamer who is actively seeking a more calming experience in a landscape scattered with non-stop action and intensity, then perhaps KOI will provide you with the type of entertainment that youre looking for. If, however, you are looking for KOI to be anything more than it is, namely a collection of ideas in a pretty package that dont mesh well together, then youre going to find yourself sorely disappointed.", "date": "April 19, 2016", "grade": 2.5}