{"name": "Stories: The Path of Destinies", "ref": "https://hardcoregamer.com/?post_type=post&p=201992", "text": "Despite the fact that it sports perhaps the blandest name of any game this generation, Stories: The Path of Destinies does deserve credit for having an awesome core idea. A fairy tale is inherently designed to end happily ever after, but we rarely get to see what happens in all of the alternate universes in which things dont close in a spattering of sunshine and butterflies. Spearhead Games might wind up winning some sort of de facto award for having the a damn cool elevator pitch, as the concept of playing out a short story over and over again until your choices produce the ideal ending immediately gets the wheels in your mind turning. Unfortunately for players, having the framework for an awesome game is only one portion of the battle. In execution, Stories is a fairly middling action-RPG that suffers from overly stiff combat, rote exploration elements and technical issues that often directly impede player success. With that said, theres still something to love here from an academic perspective, but the end product feels a month or two away from being the title it had the potential to be.Stories: The Path of Destinies has a relatively simple central narrative premise, even by fairy tale standards. Players take the role of Reynardo, a quick-witted, cunning humanoid fox who is looking to stop the corrupt Emperor from destroying his homeland (and potentially the universe) in an act of pure evil. Because Reynardo has obtained a book that allows him to play out various paths his quest can take, players are given the opportunity to try their luck at choosing which way to proceed through branching paths across this five chapter story. Lets say Stories was a game that wasnt built around the idea of playing through the story over and over again in hopes of getting different results. Wed be left with what amounts to a twenty to thirty minute game without any semblance of narrative depth. However, each path leads you to some sort of new revelation, however big or small, and once players unlock an ending in each of the four major categories (one for each potential main plot-line), the path towards happily ever after becomes abundantly clear. Its easy to admit that the idea of going back in time and revising your choices inside of a branching narrative is fascinating. Imagine a world where Remedys Quantum Break took this idea and made it its own. That would potentially turn Jack Joyces story from an awesome media experiment inside of a decent game into a potential cant-miss narrative experience. The same goes for some sort of Uncharted spinoff, though fans of that series (myself included) would quickly claim this to be straight-up heresy. Again, Spearhead Games absolutely has an awesome idea on its hands (one that works quite well with its Bastion-style constant narration), but trapping this inside of a fairly mediocre fairy-tale feels almost like a waste. Make no mistake, there is definitely a certain level of charm that comes from the friendly tales of Reynardo and his cohorts, but this charm feels more like it belongs in the 90s rather than in a 2016 game with such a novel concept. Its a more dramatic example of what we saw with Middle-earth: Shadow of Mordor and its Nemesis System (though this title is worlds above Stories in every aspect, but stick with me here). Shadow of Mordor without the Nemesis System is a pretty average Assassins Creed clone with an awful story, but it lays the groundwork for a better use of its core hook in future titles. Stories: The Path of Destiny is a clear example of a good idea with middling results, and nowhere is this more evident than in its by-the-books gameplay.Stories central gameplay loop can actually be explained rather simply (much like its core story). Each chapter involves Reynardo going from Point A to Point B, with various hordes of enemies appearing at defined, gated points a la Devil May Cry or Bayonetta. Now, despite its isometric perspective and action-RPG designation, Stories actually plays far more like a character-action game than it does a Diablo clone. There is a satisfying loop to attacking enemies, countering foes Assassins Creed style, using a grappling hook to either remove enemy shields or pull foes in and generally unleashing mayhem. The big issue here is that every sword swing has a split-second delay afterwards, essentially removing any semblance of fluidity, despite what its combo system might suggest. Whereas titles like Hyper Light Drifter or the upcoming Below have satisfying multi-swing core sword mechanics, Stories struggles from a general stickiness that takes what could have been a combat system that perfectly balances rhythm and simplicity and simply bogs it down. The worst part of the entire combat system is that one of the four swords that you can unlock actually gives you the limited ability to increase your combat speed, and this completely solves the entire issue with Stories combat. Of course, this power is tied directly to a general sword energy meter, and the fact that one of your swords gives you the ability to heal yourself completely negates the usefulness of any of the other weapons. It would be one thing if Stories simply had a sluggish combat system and that was that, but the fact that theres a direct indication of what could have been feels like a genuine slap in the face. Each of Stories stages creates this bizarre feeling that no matter which path you take, youre going to wind up getting to the same place. Despite the fact that youre replaying the same levels over and over again, albeit with increasingly difficult waves of enemies, there is some level of satisfaction that comes from unlocking a path that leads towards a chest full of crafting materials. Granted, once youve unlocked the most powerful abilities in Reynardos skill tree, as well as all of the available swords, there is little reason to stray away from blasting through each stage to get to the next choice point. This is the flaw with replaying the same story over and over again, as the lack of gameplay variation and general sense of narrative payoff make the very end of the campaign a bit of a drag. Add this to the fact that were dealing with a fairy tale here, so anyone who has been a child since, well, ever can pretty much guess its ending without picking up a controller, and the final hour creates the sense that youre playing just to get the whole thing over with. Again, awesome in concept, questionable in execution.On top of all of this, the PlayStation 4 version of Stories suffers from some major framerate issues that break immersion at best and make combat unbearable at worst. Nowhere is this more evident than in the final battle of Reynardos true destiny (AKA the last thing you do before the credits roll). Because Stories cannot seem to handle massive amounts of varying enemies on the screen at any given time, players without a full health bar are likely going to die over and over as a result of severe hitching. When exploding enemies are set to detonate and you only have a spit-second to dash out of their area of effect, a drop to single-digit frames will cause you to take massive damage. For a game whose entire narrative builds towards the premise of living happily ever after, the last true bit of gameplay leaves a painfully bitter taste in ones mouth. In addition, I experienced one moment where Reynardo fell through the environment, prompting a full application restart through the PlayStation menu, as well as two full crashes back to the dashboard. Closing Comments:When you take it for what it is, Stories: The Path of Destinies is a cute, charming isometric action-RPG with a central idea that feels fresh and unique. Despite all of its warts, and there are plenty, its still a likable title that does have a slightly addictive quality to it, and that has to speak for something. Clunky combat (that actually manages to showcase what could have been with a bit more speed), technical issues and a by-the-books narrative, however, prevent it from becoming what it had the potential to be. There may come a day where Spearhead Games sees its core hook of a branching narrative you play over and over again stolen and placed in a better game, and this will end up being for the best. Stories: The Path of Destinies is a clear example that the framework for success can only take you so far; the execution of an awesome idea has to be there for a game to reach its true potential.", "date": "April 12, 2016", "grade": 3.0}