{"name": "MachiaVillain", "ref": "https://hardcoregamer.com/?post_type=post&p=299175", "text": "When watching movies,TV shows or reading books, do you tend to root for the bad guys? Do you wish you too could have an army of minions under your capable grasp? If the answer to both these questions is yes then MachiaVillain is probably right up your alley. The pitch is simple enough to have come from the mind of any evil mastermind. Players must build up a manor from scratch with their army of minions, lure unsuspecting humans and then kill them all off once they arrive. The more victims you massacre, the higher your villain status grows. So basically, this is a mashup of Dungeon Keeper and horror tropes with a bit of extra flavor thrown in. Back in 2016, when the game arrived on Kickstarter, only around 500 fans funded it to success. Now that its finally complete it may be able to sink its fangs into many more gamers. Players begin the game with a messy plot of land in the aptly-named Villain City. In order to stay a member of the city, all residents must live up to the standards set by the League of Machiavellian Villains. Of course, their goals focus on murder and mayhem. Fortunately for the villainous protagonist, this is exactly what they were hoping for when they moved in. Players get just three measly minions to start off with. As a villainous mastermind there is no need for you to ever get your hands dirty directly. Instead, players manage their minions around to do every bit of actual manual labor for them. The brunt of the work early on involves collecting resources (wood, stone, etc) which is then used to start building up a mansion room by room. Once youve got at least one room and a writing table, its time to begin sending out spam mail to hapless citizens. These promises of free money, trips and fame eventually lure curious people to your home.Once there are one or more visitors, the minions strike. Its also possible to set up one or multiple violent traps to catch people in as they wander. Once cornered, humans may successfully flee or simply get caught and killed. Letting humans escape is terrible as it raises an overall suspicion meter. If your home becomes the talk of more rumors then folks become far less willing to drop by. The killing is easy early on  the tough part is constructing an ideal mansion. You see, each room must have a function. For example, a kitchen is necessary for holding stoves, refrigerators and a dinner table. A laboratory, on the other hand, is needed because thats the only room that research objects can be placed inside. Some objects can be placed in any room but typically relate only to storage or decoration. Another tough part about this room segregation is that many items cannot even be accessed until building other things. For example, any object requiring wooden boards cant be built until youre able to fashion boards out of the raw lumber on a crafting bench. As such, most players first few playthroughs will probably be filled with mistakes. Fortunately, after a while you do figure out the best order to create rooms and objects during the early and mid game. The toughest part of MachiaVillain really just seems to be its control scheme. Setting jobs for minions is not direct in the way that you specifically tell one to chop down a specific tree. Instead you set them to accept jobs regarding chopping wood and then they automatically go do so. Yet, other jobs such as writing spam mail can at times require players to specifically use that minions context sensitive menu to write. Its also sometimes challenging to target certain objects in the world. One of the best examples of this is trying to clean up or put away dead bodies after a murder. If living humans see blood all over the floor theyll panic and run for the door. Fortunately you can have a minion clean it up. The problem is that attempting to select the blood puddle often requires multiple miss-clicks of clicking on the floor title object itself, as well as any nearby items, rather than always hitting on the blood immediately. Sometimes minions also seem a little too dumb and take inefficient paths when bringing materials to their destination. Mistakes like this take up time and time is important since minions must eat and sleep. Running out of food means death and time to start a new game. Most players will start a new game and another and another due to the mix of challenge and simplicity present despite the gameplay inconsistencies. As players progress through the game they are able to turn their minions into more specialized characters. This is thanks to the fact that each minion has their own natural skills which can be enhanced over time. Eventually this means turning a mummy or skeleton into a master human flesh chef. It can also become a challenge as more minions are added to the crew simply because youll want to have a bedroom for each of them. This, of course, takes up space in a mansion and there is only so much room on the map. Building rooms one by one also tends to yield inefficient layouts until you get especially good at determining what is needed and at what time. Thankfully this constant refinement is part of what makes MachiaVillain fun and heavily replayable. The visuals of the game seem clearly inspired by Prison Architect but with a clear horror/gothic dressing. This top down view is required for a management game of this type and allows you to keep good track of where minions and humans are at all times. Surprisingly, the music is not much to write home about as it appears designed to simply become pleasant background noise while players strategize. There could also still be tweaking done to the menus in order to lay things out in an easier to understand fashion. Alternately, more menus could be linked together so it would be faster to accomplish goals. With that said, it seems likely that the developers will still be working on updates post launch. Closing Comments:MachiaVillain provides a terribly fun concept for a management simulation game. Its a bit rough around the edges, but momentary bits of frustration arent enough to turn players off from the enjoyable core mechanics. This is the sort of game that can easily be played for hours on end and feel like only minutes have passed. Its especially fun as a means to act out as a dastardly character with whimsical aspects thrown in. If the developer makes some tweaks and introduces a more robust tutorial or at least integrate the external wiki in-game then itll prove an even better experience. All in all, MachiaVillain takes a bit of dedication to get into, but its worth the effort.", "date": "May 16, 2018", "grade": 3.5}