{"name": "Unepic", "ref": "https://hardcoregamer.com/?post_type=post&p=200805", "text": "In recent years it has become a growing trend to give older games new life by re-releasing them on new platforms. Unepic has traveled to a few different platforms since its initial PC release in 2011, its most recent port being to the PlayStation 4 and Vita. The premise is not too far removed from what was likely many gamers childhood fantasies, which is being transported inside of a video game world. Our protagonist Daniels story begins playing some table top game with friends involving dice and something to do with places of confinement and giant fire breathing flying lizards.He requests a break after imbibing a few of the wonderful drinks invented by Charlie Mops. As luck would have it, the house he is playing at has one of those annoyingly designed bathrooms where the light switch is outside. While doing his thing, the room gets dark and he naturally assumes one of his friends is messing with him by turning out the lights. Using his lighter to illuminate situation, Daniel soon realizes he has somehow teleported to some fantasy world castle and this is the beginning of his trek through an 8-bit Metroidvania adventure. Things get better for him when he is possessed by a spirit, who apparently sucks at possessing people since Daniel loses exactly zero control of himself due to the possession. The spirit, whom Daniel names Zera, can do nothing to Daniel except talk to him.Zera is now imprisoned in Daniels body and can only be released if Daniel dies, so he serves as a spirit guide through the castle constantly trying to trick Daniel into getting himself killed. This results in entertaining banter throughout the game, which is somewhat akin to a buddy comedy starring a mongoose and a cobra. The humor is one of the stronger elements of this game, and it is not shy about making references to old video games and or having characters (or cheap knock offs) from other franchises stop by for a guest appearance. One cameo by a famous cartoon doctor in the sewer is particularly amusing.The easist comparison that can be made to summarize Unepic is to imagine a Symphony of the Night demake. Travelling through the castle does not follow a straight forward linear path, and in order to progress it is necessary to return to previously visited areas once a boss monster is slain and a key is obtained. This process is made easier by there being a central hub that allows quick travel to discovered areas.There is quite a bit of freedom in customizing Daniels abilities. There is no standard class selection like fighter, mage etc. Instead skill points become available whenever a level is gained that can be distributed however the player chooses to create a combat style that is most comfortable, whether that be specializing melee, archer, or magic wands. The lighter does continue to play a vital role in this fantasy world since none of the torches are lit in any room. Having to manually light every torch in the castle does get old rather quick, but the plus side is they burn forever after the initial lighting.The game is designed to look like a relic from the 8-bit era, and actually does a good job of pulling it off. It has the charm of an NES game, though more forgiving thanks to the autosave feature on easier difficulties if you plummet to an untimely death as far as a respawn point is concerned. There are four difficulty settings, the hardest being extremely unforgiving and the easiest allows the player to fumble through most situations with the finesse of a drunk elephant trying to navigate through an antique store. Even on the easiest setting death is not a rare occurrence. While conventional wisdom says that you should do the opposite of what your spectral parasite advises you, always make sure you have at least one means of teleportation on hand. Some sides require this to return to the area you came from, and if you are on a difficulty setting with autosave enabled you may end up trapped through a portal with no way of returning.The PS4 and Vita feature cross buy and cross save. As small as on screen action is, the game does translate surprisingly well to the smaller Vita screen. Switching back and forth between the two platforms, the controls on the two Sony systems differ somewhat so some mental recalibration is required. Using the Vitas right thumbstick to open the map and menu doesnt always work as well as one might hope, but otherwise controls on both consoles are fine.There is a lamentable difference between the Sony version and the PC release. The Sony version is censored. Revisting the Steam version of this game there is an option when selecting the language that has a 12 year old column and a 16+ column. Some noticeable changes include the removal of numerous droppings of the F-bomb. Unequipping clothing/armor now has Daniel wearing boxer shorts instead of displaying his pixel pecker, though this was never explicit due to the graphic quality. There was also a quest involving orc impregnation that now has been simply rescuing female orcs from an alpha male orc. The censorship, while in this writers opinion does take away some of the lowbrow humor, does not hurt the game in a way that makes it not worth playing. While the developer did not include both dialog options like the Steam version I cannot answer, but I can see the pros and cons of doing so. Explicit or censored, this is an enjoyable game. If you must have the foul version, get it for PC, but sanitizing it for younger or more sensitive gamers does not significantly detract from the enjoyment.Closing CommentsUnepic is an enjoyable retro style action RPG. It has not gotten the attention or acclaim of some more recent retro style 2D platformers such as Axiom Verge or Shovel Knight, but fans of that style of gameplay should give this one a look. It doesnt reinvent the Metroidvania style of game, but the developer is obviously a fan of the format and the effort in creating a quality game to pay homage to old school games is apparent. The self aware humor and references to 80s and 90s gaming allow Unepic to create feelings of nostaligia while being something new.", "date": "April 5, 2016", "grade": 3.5}