{"name": "Blues and Bullets: Episode 2  Shaking the Hive", "ref": "https://hardcoregamer.com/?post_type=post&p=200715", "text": "Editors Note: this review contains spoilers.One of the most awkward follies of episodic games is when theres an extended duration between individual releases. Granted, if it takes a long time to make a game the best that it can possibly be, than thats something thats completely outside of the players control. Still, in narrative heavy games, its exceptionally challenging to remember details from a two hour episode that you played roughly eight months prior, especially if youre someone who plays a ton of video games. Considering Blues and Bullets, the stylish noir thriller from A Crowd of Monsters, would complete its five episode run in early 2018, its worth discussing how the gap between the first and second episode affects the story at large. Sure, we might see the final three episodes come out over the course of the next couple of months and bringing this up will look rather silly, but at this point in time its a major concern. Because A Crowd of Monsters designed its second episode in a way that assumes you remember every character from the first episode, its hard not to feel detached from Shaking the Hive. Of course, there are other issues present in the most recent release that have become emblematic of the disconnect between Blues and Bullets and the titles its so clearly inspired by.Shaking the Hive picks up where The End of Peace leaves off, with the player character, Eliot Ness, embarking on a journey into the mysterious submarine that emerged out of the water before the previous episodes credits rolled. Ness, who is still wearing a disguise made up of bandages, attempts to make a deal with Ivankov, the ruthless Russian mobster despised by the central villain Al Capone. With the intent of discovering what happened to Capones granddaughter Sophia, Ness attempts to con Ivankov into giving up details that could help unravel the rapidly devolving mystery of the young girls disappearance. The submarine sequence suffers from one of the most disheartening issues of many choice-based video game stories, namely that none of the player choices seem to matter. Everything eventually devolves into a shootout that utilities the light cover-based shooting mechanics that managed to provide a nice change of pace in the introductory episode. Sadly, this shooting sequence, as well as one that appears far later in this two-hour episode, drags on just long enough to lose all sense of tension. Because Blues and Bullets is not a third-person shooter at heart, these action sequences need to be long enough to allow it to feel like a video game, but not so long that players feel as though theyre simply playing through a budget-version of Gears of War. Thankfully there are only two of these segments, though they give the player more of a desire to get on with the show rather than being something that actually adds to the episode as a whole. While the bulletin board style investigation sequences feel unlike anything else in the genre, Shaking the Hives dive into Ivankovs human trafficking operation misses an opportunity to really drive home the gravity of the situation. Because of Nesss stiff delivery, none of the remarks about the horrifying acts that occurred on this submarine actually feel all that meaningful. One would think that strolling by human cages, pools of blood and literal body parts would carry some sort of weight, considering how horrifying the imagery truly is, but that simply isnt the case. A Crowd of Monsters had the opportunity to crank up the shock factor during this segment, and not in a way that would simply gross players out. Considering that human trafficking is one of the biggest issues in the world at the moment, and one that flies under the radar all too often, its a shame that Blues and Bullets makes such a despicable act feel so sterile. Dont get me wrong, all of the story beats are there for this investigation segment to feel incredibly intense and overwhelming, but the overall execution finds a way to remove all emotion out of the equation, thus cheapening the single most critical segment of the entire episode.The investigation segment notwithstanding, there are two other cruicial moments in Shaking the Hive that feel completely unnecessary, further detracting from the experience at large. Blues and Bullets version of the famous Eliot Ness is clearly a man who is haunted by his own set of personal demons, but they seem to be thrown in and out of the narrative with no concern for cohesion. Yes, that ever critical voice inside of all of our heads doesnt necessarily schedule an appointment for when it decides to torment us, but when youre crafting a work of fiction, there does need to be some semblance of logic to the proceedings. Towards the end of Shaking the Hive, players are treated to an inexplicable first-person horror segment, and while its clear to see that some of the events leading up to that point are weighing heavily on Ness, its completely unclear why this perspective-shifting segment is presented in the way that it is. Make no mistake, we do get a bit of important information out of the end of this awkward scene, but it almost feels like someone placed a loose cherry into your hands without taking the time to actually make a sundae. The second nonsensical moment rolls around after the initial credits, and as someone who literally never gets offended by works of fiction, its worth noting that that I found it slightly cringe-worthy in all the wrong ways. Lets just get it out of the way so that you know what youre getting into: a child beats a puppy to death with a rock. Now, creators should feel totally free to put whatever they want into their creations, and calling out this particular scene is not some sort of crusade against freedom of expression. However, considering that this is the last thing you see before Shaking the Hive ends, this moment simply leaves an awkward taste in your mouth without really adding anything. A certain three-letter phrase rhyming with but the duck left my lips at the conclusion of Shaking the Hive, which is never a good sign for any game. The optimist in me hopes that this becomes a seminal moment in Sophia Capones character development, but the more realistic side of me wonders if Blues and Bullets just turned itself into that game where a puppy is bludgeoned to death for no reason. Closing Comments:The second episode of Blues and Bullets falls short in enough ways to make it easy to recommend staying away from it at this point until all five episodes are out in the wild. First and foremost, not enough consideration was given to the fact that its tough to dive back into a narrative-heavy episodic title after eight months, even with the sequence at the beginning of the episode depicting some of the major story beats. There is simply far too much assumed knowledge necessary to dive back into Blues and Bullets and feel totally at ease with the proceedings, which is sad considering that a line of explanatory dialogue here or there would have completely solved this issue. Add in the fact that the shooting sequences are far too long and mundane for their own good, and Shaking the Hive feels more like a slog than the thrilling entry it clearly had the potential to be. On top of all of this, several unnecessary scenes and a general feeling of sterility from some of the most potentially powerful moments make Shaking the Hive a missed opportunity. With that said, Blues and Bullets still boasts an interesting premise and the potential to right the ship after its weakest entry to date, but the current path its on doesnt necessarily bode well for the future.", "date": "April 3, 2016", "grade": 2.0}