{"name": "Spellweaver", "ref": "https://hardcoregamer.com/?post_type=post&p=197935", "text": "These days, collectible card games are a dime a dozen. For a while, the pool size of available CCGs, especially digitally, was about one: MtG. But thanks to the popularity of Hearthstone  and other titles like HEX: Shards of Fate, Ascension, Legends of Norrath, even Pokemon TCG  the genre has found itself as one of the more popular ones around (of course, the dozens on iOS and Android devices have certainly helped its cause as well). The problem this all presents, though, is that it is hard to stand out among the crowd as a digital CCG. Because there are so many solid titles fighting for players time these days, developers have to knock it out of the park with their design and execution to get people to leave the heavyweights, like Hearthstone and Magic, and flock to their product. So how does Spellweaver fair when put next to the handfuls of great games in this burgeoning market?Right off the bat, Spellweaver is working against itself. This is not an easy game to simply jump into, learn, and then be off to the races. This is an involved, strategic card game that is going to require expert analysis to outwit opponents. The game uses Magic as something of a foundation, and then builds on it, mixing in additional systems that will delight those looking for high-level, super nuanced play and absolutely madden, and then subsequently isolate, those wanting something a bit more accessible. Its safe to say that with Spellweaver, there isnt going to be much cross-pollination with games like Hearthstone, which is the king of the easy to learn, difficult to master design philosophy. Nothing makes this more apparent than the forty-five-minute time limit each match has. Forty-five minutes. Talk about setting a particular tone.At its core, Spellweaver is a PvP-centric card game in which two players forge decks of cards so as to square off against one another. Like Magic before it, cards here are broken down into items and spells of various types, attacking and defending creatures, damage-dealing spells, enchantments, artifacts and the like. These cards are summoned to a playfield, giving way to a back-and-forth cadence between opponents until one is out of hit points. Sounds pretty basic, right? Yeah, its not. Each play-deck is built by the player, put together from cards obtained through booster packs that range in size from four to ten cards. The cards are random, of course, and can be paid for via in-game resources or purchased with real money. When building a deck, its a pretty standard affair: each card has a fixed cost, which is paid using resource cards that folks must include in their deck composition. So, its just like the system used in Magic; resource cards here just arent called mana but they operate in the exact same way. But, its not as easy to accumulating enough mana to then summon a creature. Theres an extra step in here. Cards now have levels to them. So, what players must do to effectively put a creature on the board is they have to have the required mana and also the required level. So, how does a player gain levels? By making a choice with resource cards. When playing a resource, folks will have to decide if they are going to play it and apply it toward their mana pool or their level. Its an added layer of strategy that really changes the rhythm of the game. Some will love it because theres another proverbial moving part to all of this; others will hate it, not wanting to have to strategize about yet another thing. This mechanic rewards smart play, and because of that, is actually a pretty unique addition to the tried-and-true formula. Unfortunately, as a result of this, it creates another barrier to entry, and it drags the flow of matches down. There are also champion abilities to unlock throughout the game as well. These are level-based, thus giving players another incentive to choose to play a resource card toward their level rather than mana pool.The problem this feature presents is in the domain of balance. It was already easy to get mana-starved in MtG; and now with Spellweaver, its even easier to, not only get mana-starved by a bad deal but to shortchange yourself with one poor decision whose effects linger for the remainder of the match. Again, this presents an issue when trying to build up a playerbase. No doubt, the CCG purists will love this punishing approach; but a game can only survive so long on ardent fans  at some point, they need a broader audience for sustainability, and Im just not sure Spellweaver will have that thanks to these design choices. Speaking of these kinds of choices, lets talk about the games attacking system. So, players cant just summon a creature to the board and then have it attack whomever. Thats not how it works here. Creatures, in addition attack and life values, also have speeds. And a creature can only defend an attacking creature if their speed is equal to or greater than that of which is attacking. This is another factor to keep track of when laying down a card. Again, veterans are probably going to like having another thing to take into consideration when planning their advance; but the average player (not just the casual player) will find this, in conjunction with the others, to be daunting, overwhelming, annoying, or some combination of the three. At least theres the option to play just the AI  so those at a loss, will have the opportunity to understand the various systems. Its just too bad that to even play the AI, one has to be connected to the Internet.With that said, it should be known that, despite these limitations, Spellweaver employs some truly unique cards. With as many CCGs as there are out there, its hard to find a card game that manages to surprise you with interesting card abilities. And yet, I found myself routinely surprised at how distinct some of the creatures and spells are here. Better still, there are a lot of cards available, sure to delight those who want a CCG with serious card depth.Where the game also sets itself apart from the others is in its approach to something resembling a campaign. While this is not HEX, which has a super robust campaign complete with characters, dialogue, and a story, Spellweaver does have a world map with various locations to which players visit. Traveling to these spots (which is simply done by clicking on a target location) nets a quest. Completing said quest then provides a reward, usually in the form of a new card. Its a really neat system that adds a bit more replayability than something thats strictly match-oriented. Players also have a persistent level, which is also a fun inclusion. Completing quests provides experience points; the more a player levels up, the more they unlock  be it modes, titles, or decks. There are also trials in which to take part that earn folks booster packs and gold. When it comes to content, Spellweaver really has a decent amount of it. This is all the more impressive not only because others of its kind sometimes lack in this department, but also because the game is very new. So, heres hoping the devs continue to update and support the game going forward. We do wish, however, that more would have been done with the concept of persistence. It doesnt embrace the notion fully, like HEX, but it also doesnt want its features to be barren like a more straightforward card game. Its as if the developers werent quite sure what they wanted to do with the game outside of the core gameplay. Consequently, what weve ended up with is slapdashed campaign-lite component.Helping Spellweavers cause is its presentation. The game is really quite striking. From the gorgeous card art to the beautiful world map, the game has one of the stronger aesthetics out there regarding CCGs, even if it is a bit on the generic side. The only downside to the visual presentation is the interface. It gets the job done, but can look like a bad browser game at times. Or at the very least, looks outdated by approximately a decade. The music, on the other hand, is also more than serviceable. It wont win any awards, but theres a little bit of everything  smooth, rolling legato pieces thrown in with heavier, pulse-pounding anthems and haunting dirges. There arent a plethora of tracks, which is too bad considering how well-composed each are, but folks looking for a quality aural experience to go along with their card-combat will be more than pleased. Closing Comments:Spellweavers very nature is the thing that will ultimately get in the way of people playing it because lets be honest, you either love collectible card games or you dont. But for those who do love the genre, there just arent a ton of reasons to devote your time and money to Spellweaver and not something like Hearthstone or Magic. Its not accessible like Hearthstone, it lacks the history and entrenched playerbase of MtG and it doesnt commit to fully to embracing its dabbled-in persistence, making it inferior to something like HEX, which is, for all intents and purposes, the only true persistent CCG out there. Those who want to play something akin to Magic with added (but extraneous) systems so as to have just one more layer of tactical depth to contend with will enjoy Spellweaver. At the end of the day, though, it doesnt know its audience  and games that dont understand who theyre for typically fail to capture anyone.", "date": "March 28, 2016", "grade": 3.0}