{"name": "Rpublique", "ref": "https://hardcoregamer.com/?post_type=post&p=198453", "text": "The final release Rpublique presents one of the more interesting review dilemmas of the year. Camoflajs science fiction stealth epic was once a prime example of a premium mobile title, a Kickstarter success and a title that had the potential to thrive on both the big and small screen. After the first three episodes, it seemed prime to reveal a massive would you kindly? level twist, thus thrusting itself into contention to fill that ten-hour, narrative-heavy title that shines as an example of how far video game narratives have come. Sadly for everyone involved, this couldnt be further from the truth. While Rpublique is a fine game, its final two episodes highlight its most glaring narrative faults to the point where its outstanding world-building almost feels all for naught. Whats more, the PlayStation 4 version suffers from a number of technical issues that grow ever more irritating as the adventure progresses. Add all of this to the fact that its gameplay was already shaky and what were left with is a title that fails to live up to its initial promise and highlights perhaps the biggest fault of episodic video games: maintaining momentum after a promising start.Rpublique boasts a mighty fine elevator pitch, adding to a growing list of games in 2016 whose core concepts stand out as particularly compelling (yes, the original episode totally debuted in 2013, but still). Players take the role of both a young girl known simulataneously as Hope and 390-H and an unnamed, silent eye watching over her as she makes her escape from an underground Pleasantville. Hope is known as a Pre-Cal, a mysterious group of young students in a totalitarian state known simply as Metamorphosis. Its pretty difficult to dive into what makes Metamorphosis so chilling without getting into minor spoiler territory, especially when you consider that its largely unclear what the facility is until the final episode. Essentially, an absolutely bonkers Headmaster, who is hellbent on maintaining control of his society through censorship and surveilance, has his citizens perform bizarre experiments on the Pre-Cals, who have been born and raised inside of Metamorphosis with absolutely no exposure to the outside world. After Hope locates a cell phone and contacts the players character, a winding journey of escape commences, with things constantly turning for the worse. Its hard not to get vibes of Rapture while exploring Metamorphosis, especially when you consider the similarities between the Headmaster and BioShocks Andrew Ryan. While Metamorphosis is nowhere near as iconic as Rapture, this bizarre totalitarian environment is the clear star of the show in Rpublique, as well as the single biggest reason for any player to give Ryan Pattons magnum opus a shot. While Metamorphosis is clearly a fictional world, the overarching sense of everyone being watched and controlled certainly draws parallels to the controversies surrounding the NSA, the Patriot Act and, most recently, the feud between Apple and the FBI. We, as a society, are equally obsessed and terrified with the dichotomy between the privacy that humans inherently desire and the overwhelming power of the Internet (specifically social media). Rpublique shines brightest when it attempts to make commentary on the privacy concerns that citizens of the modern world face, especially when real-world situations are inserted into the narrative. Whether this comes from collectibles referencing Edward Snowden, mentions of President Barack Obama or simply the idea that there are organizations that have the power to control the government, the power remains the same. Of course, these smart parallels and references certainly dont make up for some of the bigger gameplay flaws within Rpublique, but they are absolutely enough to keep the player driving forward throughout the experience. Its hard not to wonder what Rpublique would wind up looking like had its thematic elements not hit so close to home, especially when you consider that the final release just so happens to fall right in line with the ever-evolving Apple GovOS controversy. Granted, the narratives final acts are so all over the place that the power of its message is somewhat lost, but without smart thematic crafting, we would be looking at a far more inferior final product. With that said, if you consider yourself a political conspiracy theorist, Rpublique is definitely a game that will have you hooked from the moment it begins.Aside from the technical and gameplay concerns that well dive into shortly, Rpubliques single biggest fault is the way in which it wraps up its story. While some of the major questions about Hopes identity and the fate of Metamorphosis are certainly answered, there are a ton of questions left untouched. Certain characters, including the central figures in Episode Four, seem to be introduced simply to drive the plot forward. Sure, Rpublique does boast some of the best collectibles and audio logs that seen in any game this decade (especially banned works of classic literature and floppy disks containing exposition on notable real world video games), but there are still too many question marks surrounding the plot even after listening to massive portions of the optional content. Whats worse, if youre someone who is not into the idea of looking for collectibles and audio logs, youll likely find yourself scratching your head even more. Still, while Camoflaj should be applauded for the appeal of its side-content, the way in which its core narrative wraps up leaves a ton to be desired. When one finally learns of the true nature of the mysterious Metamorphosis, theyre treated to an absolutely infuriating instruction-free data collection segment that completely drains Rpublique of all of its momentum. Even after completing this section, I still have absolutely no idea what I did, whether or not I missed any content and, most egregiously, how to even describe it. While this next comment is certainly an example of a reviewer being an armchair game designer, its absolutely worth bringing up. Changing a games genre or gameplay style in the last thirty minutes is always a borderline unforgivable offense. Rpubliques gameplay, while conceptually fascinating, does make for an occasionally frustrating experience, especially when using a DualShock 4. Players control Hope using the left analog stick as she sneaks her way through Metamorphosis, with all of this presented through somewhat fixed camera angles that can be controlled by the right stick. The fourth-wall breaking player character has the ability to move from surveillance camera to surveillance camera, giving Hope the ability to predict what is around every corner and behind every door. By pushing the R1 button, the player has the ability to freeze time, access a any of the cameras in the immediate area, view a map (the number of button presses required to view this does get old rather quickly), browse collectibles and hack items in the area. Rpublique is definitely a stealth game in every sense of the term, though its exceptionally forgiving nature makes up for some of the clunkier elements of environment traversal. There is definitely something awesome about feeling both omniscient and under-powered, which comes from the dichotomy between Hope and the player character, but this is far better in practice than in execution. One of the biggest perils of having surveillance cameras as the sole source of view occurs whenever players move into a new area. If youre the type of player who grows frustrated whenever the camera angle shifts automatically and your characters previous direction shifts, then Rpublique will drive you insane. Throughout the ten-hour campaign, the number of times I entered a room, only to have Hope immediately exit due to the camera angle changing. Theres a certain clunkiness to Rpubliques gameplay thats easy to ignore during the first couple of episodes, but its the type of thing that grates on you over the course of a full playthrough (especially one not separated by episodic release dates).Sadly, the PlayStation 4 version of Rpublique suffers from a number of technical follies that manage to break the immersion in a game so heavily dependent upon it. During cutscenes and sequences in larger areas, the framerate will often drop below thirty frames-per-second. On one hand, one could argue that these framerate drops in non-cutscene areas make for a more realistic experience, considering you are essentially always looking at Hope through surveillance footage. The thing is, this doesnt make for a good gameplay experience, especially in a game that already suffers from a bit of gameplay clunk. If the framerate drops in the middle of a guard patrol, you now not only have to fight to maintain stealth, but you have to do so while battling the engine itself for control. Make no mistake, thanks to Unity 5, Rpublique is a far better looking game than one would expect a mobile-to-console port to be, but it definitely seems like the type of experience that is best suited for a PC with a solid-state drive. Framerate issues aside, there is a fair amount of loading that takes place during camera and room switches, only this is done without any sort of icon or loading screen. When you consider how many times youre going to be shifting from camera to camera, two to three seconds each time adds up quickly (Id wager that an extra fifteen to thirty minutes was added to my playthrough just from these moments of loading). Add this to the fact that these moments of loading always feel more like a freeze than a load, and playing through Rpublique comes with a certain sense of anxiety that completely detracts from the experience at large. Closing Comments:Its likely that we will remember Rpublique for being the game with the some of the coolest collectible items in video game history rather than being an awesome experience. The fact that one of the biggest highlights of the experience was picking up floppy disks with art from Shovel Knight, Firewatch, Journey and others is equal parts awesome and disappointing. For a game whose initial episodes showed so much promise, its a shame to report that the full version of Rpublique does not live up to the excitement that it built up over the past couple of years. From an ending that feels oddly unsatisfying to gameplay that finds a way to grate on your nerves during an extended playthrough, Rpublique feels like a game that is best experienced in episodic chunks rather than a full-fledged experience. There is enough to like here, namely its themes and world-building, to warrant a playthrough at some point down the line, but those who have been waiting for the full console release to dive in might want to look elsewhere for the time being.", "date": "March 21, 2016", "grade": 3.0}