{"name": "Blue Rider", "ref": "https://hardcoregamer.com/?post_type=post&p=197564", "text": "Rarely do I find myself relying on not one but two classic sayings at the same time. While the grass has tended to be greener on the other side for shoot-em-ups in recent years, you mustnt judge a new title in the genre by its cover. Or be it, its appearance. With the greatest respect to Argentine developers Ravegan, the newest kid on the shooter block, Blue Rider, may inherit all the colourfully slick and squeaky-clean polish of a mobile game, but its gameplay as much its intentions are as far from such short-lived distraction as you can possibly get. As a result Ravegans motives, while may appear to be of nostalgia, tend to come off more as insistence  an aim to remind players of the glory days of Gradius, R-Type III, Solider Blade, Ikaruga and the like. Of those classic one-versus-a million escapades that were as much about tense survival as they were jolly bullet-infested goodness.But Blue Rider isnt simply another hopeful attempt to replicate (and often imitate) what made past arcade-styled side-scrolling shooters so addictive. Appreciative as much aware of its current position, Blue Rider decides against taking the easy route in simply being but a mere carbon-copy of past endeavours, instead bringing with it the kind of natural evolution you often dont find in this particular genre. Blue Rider takes place, rather than against the backdrop of two-dimensional planes  or, in some cases, pseudo-3D space with mechanics restricted to that of two planes  in a purely three-dimensional World set across ten levels. Each of which are separated by their distinct, if somewhat stock, environmental themes that from the very off try to reach towards a more natural progression than past titles structures. The fact you dont so much start off each level in a completely new region but rather find the World slowly transition between settings already gets each levels dazing difficulty to a good start and acts as a nice touch that only caters well into Blue Riders overall tentatively-paced sense of progression.Tentative is unquestionably the word of the day here for while the game may stick to the tried-and-tested formula of unloading hostile forces in pre-arranged waves, Blue Rider is not a game you can simply deduce, be it through nostalgia or over-confidence. With the way each of the games ten levels are designed  narrow channels leading out into open spaces that are cleverly not-quite-circular but still prevent you from exploiting the geometry of the level  its easy to forget about enemies cropping up from behind you even if your intentions to beat the forces up front arent exactly wrong at the same time. Blue Rider, like a lot of recent bullet hell titles, places heavy emphasis on ducking and weaving between patterns of enemy firepower while making use of the openings around you. The only difference here is that with a full three-hundred-and-sixty degree field, enemy fire can come from literally any direction and as such, a players defensive strategy becomes just as important, if not more so, than their offensive counterpart.To make matters more pressing, neither extra lives nor checkpoints exist to support you, meaning that if you die, its game over  resulting in a trip back to the main menu to restart the level over again. But such is the ease to get distracted by ones bullet-spamming desperation, before you know it, your health can be whittled down to but a slither of its former breath in a matter of seconds. Players will thus require a slightly more cautious approach as they progress through, never forgetting that enemies are likely to hide behind every corner  waiting for (and more than likely getting) an opening in your unprepared and ill-guessed navigation.Enemies, while not as wondrous in deviation of design, offer up a decent enough variety of offensive speeds and styles, from the simple weave-between wall of bullets to machine-gun styled barrages that require quick reflexes and even-quicker counter-attacking desire. As players progress further and further into the game, enemy ingenuity  as much the total number on screen, thus height of chaos  continues to increase as their behaviour becomes significantly less static as they try and maneuver around you, for example, or shunt you into a corner to snuff out your chance of escape. While later foes do run the risk of devolving into mere bullet sponges, theres enough risk involved to turn these momentary skirmishes into something altogether more strategic and calculating.So its a shame that the players own abilities and range of firepower isnt as varied with the option of both bullet-fire and missiles limited to just two types each  upgradeable through pick-ups but still not as poignant as the enemys own array of attack styles on show. Yet the greatest drawback with Blue River  and sadly one that clouds over the entire experience  is not so much what it offers, but rather how it performs when under the strain of so many moving assets on screen. Or be it, so many explosions going off in sequence.While the game has no issue maintaining 60FPS, the game will momentarily freeze at points when enemy ships are destroyed. More so in later levels that can end up cutting the overall frame-rate to, at the worst points, a mere third of this during boss battles. As such, enemy fire will somehow find a way to hit you during these blips and for a game that puts strenuous emphasis on the need to keep moving and maintaining your health, this feels like an almighty oversight on the developers side to let this performance issue slip through onto final release.Closing Comments:Even with unfortunate performance hiccups, its safe to say Ravegan have created one of the more interesting and cleverly addictive shoot em ups in recent years. While Blue Riders visual identity and art style may put you off the idea/concept this is in fact a charming-if-challenging throwback to 16-bit era side-scrollers, what lies behind it could be considered some of the more appealing set-pieces you can expect coming into a bullet-heavy, arcade-style shooter such as this. Blue Rider may not provide much in the way of repeat playthroughs, but its core single-player experience is addictive enough  and well-designed in that respect  to pull in the type of player who just will not rest until that one level has been beaten. Or rather, all ten levels. A welcome surprise given there are so many shallow imitations out there (some going as far as to indulge in art styles pertaining to alets sayJapanese variety). But in the end, its good to know the true essence of a shooter hasnt been lost here.", "date": "March 15, 2016", "grade": 4.0}