{"name": "Samurai Warriors 4: Empires", "ref": "https://hardcoregamer.com/?post_type=post&p=197498", "text": "Considering how prolific the series is, the appearance of another Musou title isnt surprising. Still, the Samurai Warriors strain hasnt seen an Empires version in the west in ten years. Not that the market was hurting for the titles; the Dynasty Warriors brand was covering this aspect quite well in the meantime. Since Samurai Warriors 4 and 4-II have the best battle system in the entire Musou series, though, the addition of the hybrid of battlefield action and light strategy that the Empires titles bring is more than welcome.For those who have skipped the Omega Forces SW4 releases in general, it cannot be stated enough how much has been improved for the series overall. Before, the combos were created using a mixture of light and heavy attack buttons. Effective, but many found it repetitive. Samurai Warriors 4 introduced a hyper attack system to really speed up the battles, making them more fast paced and exhilarating. In addition to the normal attacks and combos from before, the player can utilize hyper attacks. These cause the player to dash across the battlefield making short work of the trash enemies. These are useless against officers, though, so switching back to normal attacks will be necessary.In addition to this system, there are other wrinkles added in. Strong attacks from opposing officers can be parried and countered with a well timed press of the jump button. When close to deaths door, these same officers are susceptible to an instant kill move, as long as the player pays attention to the prompts. The Samurai Warriors 4 games really does have the most varied and interesting twists on the beat em up genre to hit in a long time. Since Omega Force struck gold with the battle system, it would have been acceptable from a fans perspective to have some new scenarios to play through with this iteration. Surprisingly, that is not all this is. In previous Empires titles, the strategic gameplay was simply a matter of capturing territories until the map was filled. Sure, players could opt to work for another ruler and cater to their whims, but come on. Nobody wanted to do this.Instead, this version provides numerous scenarios to take on, each with a multitude of rulers. Each of these rulers have their own Ambition, a goal for the player to reach. It might be to capture a specific territory. It could be as simple as earning fame. No matter which, the Ambition system forces players to utilize different strategies to achieve the goal. Between battles, players are afforded the opportunity to appoint advisers. Each of these advisers put forth suggestions consisting of two actions. These can be along the lines of gaining a certain amount of food and a separate amount of fame. Taking these options costs a point. The player starts off with one point per turn to use, but more can be opened up as the scenario goes on.This game is also loaded with a large amount of inter-character story scenarios. For example, one officer might want to become Nobunagas protege. This desire is introduced before a battle. During the melee, the game could then give the option to proceed with this storyline via a mission. Should the player choose to take it, they simply need to press a button to accept and take control of the required officer. This new system adds a ton of personality to the proceedings, and even more options when playing the game. This is how the player can find mates, masters, and proteges. Omega Force has tried to introduce personal relationships before, but this is the first time that it feels like more than just a meter on a stat screen. All of these features are fantastic and deep should their use be understood. Sadly, this game falls on its face when it comes time to explain the importance of these systems and how they work. There is a fame stat, Empires? Other than being a goal, what does that do? How does all of this fit together? Omega Force really needed to do a better job explaining all of this as it looks like a confusing mess in this iteration. Even assigning advisers was more difficult than needed. In addition to named officers, generic ones can be chosen. Starting off with a scenario leaves the player needing to use characters with names unfamiliar to American eyes. I kept assigning an officer to one segment and then assigning the same one to another. This removed the officer from the previous position to move to the new one. Something as simple as a confirmation screen would have worked wonders. Still, with time, this all begins to make sense. It just takes longer than needed.One final issue to be mentioned. At one point, the game stopped loading for me. I was able to open the game and it would act like it was loading, only to go to a black screen. After numerous attempts, turning off the PlayStation 4 and turning it back on, and so forth, I was forced to delete and re-download the title. At this moment, I am not convinced that this was the games fault. It could simply have been specific to me. Thus, I am treating this as an aberration and it wont be reflected in the score. Should I learn that it was not a local issue, but instead the game, I will update this review and adjust the score accordingly. Closing Comments:Samurai Warriors 4: Empires is not a flawless experience. The explanations of its myriad systems really needed another pass for clarity and this could frustrate that casual fan of these titles. On the other hand, this is also the deepest Empires title to come out of the Musou series. There are so many options and so many ways to experience each scenario that the gameplay offered here is near limitless. That isnt even mentioning the ability to create brand new, personalized scenarios if the built in ones get dull. For players willing to pay attention and read online manuals, there are untold hours of gameplay to experience across the varied officers. Anyone looking for a new excuse to smack down thousands of enemy soldiers per battle should check this one out.", "date": "Bohn on March 14, 2016", "grade": 4.0}