{"name": "The Legend of Zelda: Twilight Princess HD", "ref": "https://hardcoregamer.com/?post_type=post&p=197615", "text": "Out of all of the Legend of Zelda games out there, Twilight Princess was always regarded as the most successful across a wider variety of RPG fans. It was dark, kept up with adult themes and allowed for people to embrace the whole kid saving the world idea without making it seem childish. Where most Zelda games would continue to rehash characters and dungeons, Twilight Princess manages to make a franchise of games that are usually the same seem like an entirely new game. The HD version is no different, but is only just that, an HD version of the game. The real reason behind this release is for the extra items and dungeons that can be acquired through tapping a Zelda amiibo to the Wii U tablet. The Toon Link and Link amiibos will replenish your arrows once a day while the Shiek and Zelda amiibos replenish your hearts. Tapping Ganondorf on the tablet, however, creates a much more difficult experiences as it forces Link to take double the damage whenever he is hit.The real amiibo that everyone wants to hear about, though, is the new Wolf Link amiibo, the amiibo that holds an entire dungeon hostage. Tapping this amiibo to the tablet will grant access to the Thorough Battle: Trial of the Beast dungeon where, upon completing with a full Giant Wallet (a wallet with 1,000 rupees), can give Link a Bottomless Wallet (a wallet that can hold 9,999 rupees). With all of that said, the game is still only just an HD remake, nothing spectacular about the actual gameplay mechanics and no changes in sound quality. The game is still just as wonderful as when it initially came out (specifically the GameCube version of the game), but other than cleaning up a bit of general blurriness from distant areas, it is still relatively the same. It is difficult to compare this with Nintendos previous Zelda re-release, The Legend of Zelda: Wind Waker, as the game physically looked and played different from its 2002 counterpart. Playing the game only to find out that this is really just a filler for Zelda Wii Us overdue release is a little disappointing, but you cant help but feel at least a little nostalgic replaying one of the best Zelda games in the franchise.The game encompasses the Wii U tablet (or the Pro Controller if you feel more comfortable that way) and makes the inventory much more accessible. After a few hours of playing, one of the first things that I observed was the clunkiness in Link and Eponas movements. It seemed as though the characters were only set to move in eight different directions and moved far too sharply to be comfortable. In situations where you needed more smooth movements, like the first minigame, it was difficult to control Epona and made the game that much more difficult to play. Fortunately, this didnt affect all aspects of the game, like fighting, because you are still able to lock onto your enemies in order to fight them easier (though I have no idea why they would have to take that out). With how clean the game looks, far different from the blurry outlines and details from the initial GameCube/Wii version, its difficult to comprehend why other aspects werent revved up as well.Wolf Link, on the other hand, is a little too smooth and event the slightest movements make him jerk towards a certain direction. His movements are also difficult to control and some of his attacks miss the targets, regardless of whether or not you are locked on, because of this. Though it doesnt affect much of the game itself, its concerning that one of the highlights of this particular installment is as difficult to control as it is. Regardless, its easy to power through and get accustomed to, even though you really shouldnt have to. To give the game more points, Link is portrayed using his left hand as opposed to his right, like the Wii version has to do to incorporate the usage of the wand remotes. While this doesnt change much, it is nice to see that the game wasnt mirrored in favor of a certain group of players and was released as it was meant to.The graphical update, while it does sharpen and detail your surroundings, is just as much of a blessing as it is a flaw. Certain things werent meant to be graphically updated and therefore flaws and mistakes are more evident now. One specific moment was during my time walk to Snowpeak Ruins and how the white snow made me feel as though I was in some kind of purgatory. Since all of the graphics were sharpened, that specific portion of the game felt too rigid and more as though I was in a blank, white space rather than snow. It can be easily overlooked if you arent playing the game for the graphics, but it does give the title of HD less of a meaning.Closing Comments:The Legend of Zelda: Twilight Princess HD brings one of the Zelda franchises most beloved games to a contemporary platform, revamping some of the features and making room for amiibo functionality. While flawed in some ways, it gives longtime fans a good reason to replay it. It is clear, however, that this remaster was simply to give some kind of traction towards the eventual release of Zelda Wii U. While I wish that this wasnt the case, it does make the collectors aspect that much more enjoyable and adds a great title to the Wii U lineup.", "date": "March 14, 2016", "grade": 4.0}