{"name": "Mortal Kombat XL", "ref": "https://hardcoregamer.com/?post_type=post&p=197074", "text": "The Mortal Kombat X content train has come to an end with the release of Mortal Kombat XL. A grand total of eight new characters, countless skins, classic fatalities, a new trophy/achievement set and a range of balance fixes have been added since launch. The grand bulk of this new content comes from Kombat Pack 1 and Kombat Pack 2, which do cost money. Is there enough content here to keep fans invested in the year old game, or are these packs preying on the wallet?Mortal Kombat XL is essentially the same game as Mortal Kombat X. All the base content is still there, alongside the additional Kombat Packs. There are no new story expansions, no new Towers, and no new Krypt items to unlock. This is the same Mortal Kombat X that released last year, just with new fighters and skins added in. The core game is still fantastic, but a year has passed since launch. A few new story chapters or new towers would have really sweetened the deal.Warner Bros. and NetherRealm Studios are giving players a few options to get their hands on the new content. Those who smartly waited for the inevitable Game of the Year Edition can purchase Mortal Kombat XL for $60 and get both Kombat Pack 1 and 2 in addition to the full game. Those who own the main game, but didnt purchase either Kombat Pack, can get the Kombat Pack XL for $25. Those who did buy Kombat Pack 1 can get Kombat Pack 2 for $20. Players can also purchase the characters a-la-carte for $5 each. Kombat Pack 1 launched last year and added four characters: Jason Voorhees, Tanya, Predator and Tremor. Kombat Pack 2 added another four: Alien, Bo Rai Cho and Triborg. Kombat Pack 1 also game with the added distinction that each character came with a themed skin pack. With a strong emphasis on horror characters, NetherRealm Studios capably transitions four icons from the silver screen to the fighting game genre. These four characters and their different variations are faithfully reconstructed from their source material. Jason Voorhees swings his deadly machete, shrugs off damage and can even restore his health in small doses. Predators vast array of barbaric weaponry helps him easily slice and dice his opponents in an iconic fashion. He can even humiliate them further by mimicking their voices while he laughs. Leatherface is perhaps the bloodiest fighter yet, causing a massive amount of blood loss with his iconic chainsaw and mallet.Its Alien, however, that is the most impressive addition to the roster. NetherRealm went the extra mile by making Aliens tail a fifth limb. Its not there for decoration, but becomes an integral part of Aliens combos. Alien is also interesting for the fact that his moveset encompasses that of a popular Mortal Kombat character: Baraka. Yes, Alien has a Tarkatan variation that gives it many of Barakas moves. Its an inventive way to bring back an old favorite in a new form.Though much love and attention was given to these horror classics, that same love is never felt for the classic Mortal Kombat characters. In fact, its hard to argue that three of them are even considered classic, and that one is a downright rip-off. Triborg is the real winner when it comes to classic characters. Triborg takes the Variation system and fully utilizes it to deliver four different characters. Triborg can take the form of Sektor, Cyrax, Smoke, and even Cyber Sub-Zero (as a hidden fourth variation), gaining vastly different move sets with each variation. Each cyborg not only has different special moves, but also different combos. There are some shared combos, but theres enough difference between the different cyborgs to make mastering Triborg a real challenge. As such, Triborg stands as a testament to how inventive the Variation system can be. Hes fun to play with and has two of the most brutal fatalities in Mortal Kombat X.While the remaining characters can hardly be called classics, that doesnt mean they arent fun to play with. Bo Rai Cho, the drunken master who first appeared in Mortal Kombat: Deadly Alliance, has multiple deadly combos that consume large amounts of an enemys health. His Variations resemble his different fighting stances from Mortal Kombat: Deadly Alliance/Deception; a normal fighting stance, the Drunken Master, and his staff. Tremor, the brown ninja, makes his fighting game debut and its a solid one. Hes a heavy character, but his earth-based attacks are good at getting enemies off their feet.The odd character out is Tanya, who feels like she should have been added to the game free of charge. This is mostly due to the fact that shes already in the game. She can be fought, without her variations, in the games story mode. Tanya is a fast character and her variations arent bad, but its hard to get over the fact that she should have either A) been included at launch or B) finished post-launch and added as a free addition to the roster.Now, its important to note that Mortal Kombat XL and Kombat Pack 2 are not coming to PC. Warner Bros. and NetherRealm have opted to drop future support for Mortal Kombat X on PC, and focus entirely on PS4 and Xbox One. Though extremely sad, and aggravating for PC players, the absence of a PC version does not affect the games score. Closing Comments:Mortal Kombat XL retains the same great gameplay and content of the base game. The multiplayer has never run more smoothly thanks to a huge overhaul of the net code. If youve been holding off on Mortal Kombat X, XL is the way to go. Its difficult, however, to recommend the extra content to those who already own Mortal Kombat X. Though the four horror characters are well done, non-horror fans may be put off, and the lack of a true classic character aside from Triborg may leave Mortal Kombat diehards disappointed. Without any new meaningful content (i.e. new story chapters, Tower options, or Krypt unlocks), its difficult to recommend older plays dive back in. Its literally just Mortal Kombat X, which is already an excellent game and anyone interested in a few of the eight characters may just want to purchase them a-la-carte.", "date": "March 10, 2016", "grade": 4.5}