{"name": "The Witch and the Hundred Knight: Revival Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=196497", "text": "Metallia has been locked in a stalemate for over a century and it hasnt left her in a good mood. The Forest Witch Malia has kept Swamp Witch Metallia in check, and Metallia is ready to finally break out and change the entire world into a fetid oozing moist squelchy bog of putrefaction after summoning a champion in the form of The Hundred Knight. Sure, Hundred Knight is a small little guy and about as smart as a particularly cute rock, with no moral compass or even the ability to speak, but his reputation is that of an unbeatable giant of destruction. Hes just a little off his game after untold ages off the battlefield. Hundred Knight will get much stronger quickly, but its a shame his new master is irredeemably evilThe Witch and the Hundred Knight: Revival Edition is a complete remake of the PS3 game, with the same story and voice acting, levels, monsters and gameplay systems, but brushed up and looking sharp on the PS4. Its an odd game to update, seeing as the original was fairly niche, but the game cleans up nicely and theres even a major addition in the form of The Tower of Illusion. True, the Tower has some interesting and possibly unintended consequences for how the main game is played, but its a great way to really put the Hundred Knights fighting skills to the test.The Hundred Knight is a fighter, which is appropriate for an action RPG, and while he starts fairly weak it doesnt take long for him to grow to dominate the field. The Knight comes armed with up to five weapons, bringing them out one after the other for a multi-hit combo, and the trick to turning him into a tiny flame-headed combat dynamo is to stack the weapon order in a way that you can live with. Weapons come in a variety of styles, from swords to hammers, spears and pikes, and even magic staves, and each of them attack differently from the other. The basics of the way the Knights combat string works is that you choose five weapons, set them up in the menu to attack one after the other, and then mash the Attack button to break out a five-swing combo using each weapon in order. Each weapon has a magic symbol on it, and arranging the combo string in the proper order is the difference between strike strike strike and a lightning-fast barrage of steel-edged fury. It looks complicated at first until you realize you just count the yellow pips on the symbols and arrange the weapons in numerical order, at which point combat gets much quicker. Rounding out the basics is the ability to have three weapon stacks available at once, cycling through them with the L2 and R2 buttons to switch out your skills appropriate to the challenge. Some monsters are highly resistant to slashing and need a good hammer-smash to break through, while others dont respond to physical damage and need a fireball to the face. It takes a level or two to get a nice weapons selection, and then the possibilities open up.Making life a bit more difficult for the Knight is his Giga Calorie counter, which is constantly decreasing. A hungry Knight is an ineffective Knight, not only weakened but also bleeding out HP at a worrying rate, so its important to keep the little guy fed. Returning to Metallias home base instantly tops off the counter, but staying in the level longer not only grants a nice bonus reward based on how much experience youve gained during your stay but also has a dramatic effect on how powerful the Knight is. As you kill monsters, open chests, and scavenge for goodies, the Knights grade points increase, and you can spend them at the pillars acting as level checkpoints to temporarily increase health, attack, defense, and other attributes. These bonuses disappear when the Knight returns home, so balancing power against the need to avoid starvation is fairly important. Fortunately you can also spend a grade point on getting 10% of the Gcal counter restored, but finding health items is probably more effective. It also becomes far less of a concern as you advance past the first chapter, thanks to the new Tower of Illusion. The Tower is both a lot of fun to visit and also breaks the game balance, but on the whole it adds more than it hurts. The way the Tower works is that you sacrifice a weapon to generate a set of levels, ten levels per chapter of the main game, and the difficulty of the levels is dependent on the strength of the sacrificed weapon. The Tower is a great way to put the Knights combat systems to the test in smaller arenas crawling with enemies, but the weapons and experience gained can quickly make him overpowered. Bosses that were killing me on the PS3 version, taking several times to clear out, went down easily thanks to a nice selection of very powerful weaponry. More power also means spending less time in the main games levels, lessening the threat of the Gcal counters formerly-constant danger.The new Tower of Illusion also comes with a new side-story, featuring a different take on Metallia that allows the Hundred Knight to summon her into battle. Its nice to put Metallia through her paces, but more often than not I realized Id cleared the entire floor and forgotten that the summoning bar had filled up. The Tower also is the only place to get the new catalysts, which let you combine and craft more powerful weapons. Its a nice idea but, again, the Hundred Knight quickly gets strong enough that gaining even more power isnt particularly necessary.While The Witch and the Hundred Knight: Revival Edition is a bit easier than its original version, the story can be just as hard to take in certain places. One of Metallias first actions, on defeating the Forest Witch, is to turn her enemy into a rat and sic a small pack of horny male rats on her. Its passed off as comedy, with the rats running off screen, but somehow trying to have an enemy raped to death just doesnt work as humor. It does set the tone that Metallia is properly, completely evil, rather than some cartoon Snidely Whiplash-style villain, but theres a whole lot of wrong in the scene thats unpleasantly disturbing. Its the kind of thing that can leave you wondering if just maybe playing a game as an agent advancing this persons plans is a good idea. Closing Comments:While the story can be a bit much at times, The Witch and the Hundred Knights gameplay makes returning to Metallias swamp a tempting prospect. The combat engine can seem intimidating at first and the menus are a complete mess, but once youve got a handle on it, the combat is a lot of fun. Learning enemy attacks, timing the dodge to activate a brief period of enemy slow motion, switching between weapon sets to maximize damage potential, and building just the right combo chain make hitting the field and slicing up some monsters a good time. Its still possible to lose the action amidst the numbers, energy circle and text that pops up as you start slashing away, but the updated visuals clear up the muddiness that was a problem with the original version. Most importantly, unlike the original version, I found myself actually wanting to press forward and experiment with powering up the Hundred Knight. The Witch and the Hundred Knight: Revival Edition adds the necessary adjustments to a game that simply wasnt what it should have been the first time around, and while the result is hardly an action RPG classic, its somehow become not only enjoyable, but bizarrely likeable in the process.", "date": "March 8, 2016", "grade": 3.5}