{"name": "Stranger of Sword City", "ref": "https://hardcoregamer.com/?post_type=post&p=196353", "text": "If Japanese games set during the modern era have taught the world anything, its that Japan is a seriously scary place to live. Theres always the chance somebody can be thrown into a television to experience murder by Midnight Channel. The person walking past could be a neo-vampire that can only be defeated by stripping them down. Demons explode from the ground, cities get stomped and its possible to experience amnesia at the drop of the proverbial hat (that is, if I am remembering that right). According to Experience Incs Stranger of Sword City, one cant even escape. The flight could be brought down because someone might have special powers in an alternate fantasy realm. No wonder Japan has a reputation for being weird.This crashed flight is the setup for the dungeon crawling RPG. A flight from Japan to Alaska crashes in an alternate dimension, outside of the titular sword city. After going through character creation, complete with dice rolls for bonus stat points, the player is soon escorted through a labyrinth of underground ruins. Upon reaching the surface, a betrayal occurs, only to be quickly thwarted by an interloping knight. After fighting off a hydra and its minions, the knight and the player beat a hasty retreat to the city proper.Its soon revealed that the player is not the only denizen from Earth to end up in this alternate realm. Called Strangers, many others have taken up residence in Sword City. Due to the relatively reduced gravity, the Strangers have the ability to wear heavier armor and wield weapons like a boss. In exchange for room and board, these folks are tasked with defeating specialized monsters, called Lineage, and gather the crystal left behind. Should the crystal be left, the monster will only regenerate and wreak havoc again. While this plot is interesting, the way its used in Stranger of Sword City can be likened to that of the skewer on a kebab. Its there to stick the grilled meat and veggies together, but not meant to be part of the actual dish. Most will push the tasty food onto a plate and dig in. Frankly, this title could have used a bit more panache in the storytelling arena. Major scenes are expressed through static drawings that, while beautiful to look at, dont hold up to what one would expect on a current gen console. There are two art styles to choose. Type A is uses an anime inspired artistic conceit, while B goes for a more western fantasy styled approach. The latter still maintains some obvious Japanese influences, though.Still, where this game lacks in flash, it more than makes up for in substance. The meat in the kebab analogy would be the dungeon exploration and battles. Taking place in the first person, these segments are deep and challenging. Each labyrinth is filled with monsters to fell, secrets to discover, and shortcuts to learn. These can become long, drawn out affairs to completely map. Fortunately, the auto-map system works extremely well, making sure to point out areas of interest, locked doors, and unexplored areas with no input from the player. A quick glance at this quickly shows where a player left off before retreating back to base to heal up and restock. The exploration is also aided by an auto-move option. A feature that I discovered on accident, the player only needs to pull up the map and select the destination. If it was previously explored and can be reached without changing floors, the party will automatically take the steps needed. This means that the player can head back to a maze, choose where they wish to go, and go grab a drink while the party walks there. Its possible to get interrupted by random battles, but these require input from the player before picking up. It seems strange to praise a feature that removes control from the player, but it really does alleviate a major part of the hassle that these games can have, while still sticking to the classic framework.The battles themselves are also modeled on the tried and true old school style. Turn based and still in the first person view, these have the players select the actions they wish to take. Still, Experience Inc worked to make the trash battles as quick as possible. After inputting the commands, the player can resolve the turn like normal, with each action displayed. Those feeling impatient can opt for the quick resolve. This instantly handles the outcome of the turn, bringing up the menu again for the next. The choice is there to simply hit a button to use the previous turns commands again. These features are an extremely appreciated streamlining of a process that can drain time in other genre titles. That the game respects the player enough to give the choice to keep things moving is an excellent decision. Still, it is highly recommended to avoid using the quick option when facing a new type of foe. Succinctly put, this game is not afraid to stomp the party into a fine paste. Even the first Lineage hunt, the training mission, forced numerous trips back to town to resupply with potions and antidotes. Thats okay, though. In a fashion similar to the Souls titles, the gamer is expected to play smart. The weaknesses and foibles of the enemies must be learned, and committing to a strategy is a must. It might not require the reflexes needed in From Softwares titles, but the feeling of downing a Lineage with the entire party on deaths door can be just as exhilarating.Still, that isnt to say that this title is ruthless. While it does feature permadeath for every party member but the hero, there are ways around it. Each member has two or three life points. When they fall in battle or carelessly wander into a trap, they can be brought back to base to recuperate. When done, they will be down a life point. Further recuperation can regain the lost point, but that character will be out for multiple days. Should the player choose, an instant recovery option is available, but it can get expensive, and equipment isnt cheap. If the dungeon exploration is the meat, party and stat management are the veggies. Terrible if done wrong, but here its grilled to perfection. Each party member can be created from scratch. Chosen from different races, each with their bonuses and drawbacks, there are tons of options available. The game is not afraid to let the player create a stupid build, either. Want to make a frail, elven samurai? Stranger of Sword City says go for it. Even this build can be useful if kitted out properly, but its not a smart way to go. Itll certainly take a lot more level grinding to get strength and vitality up to where it needs to be.Equipment and loot is also important, as any RPG grognard knows. The game actually has a smart system going here. Each maze has certain rooms where the player can set up an ambush. When hiding, squads of monsters happen by. The player can see what kind of items will drop from the group. If its worth it, then the player can attack at an advantage. If its not, the enemy will pass and the next group appears. Each time the player waits, they run the chance of getting caught and put at a disadvantage in the battle. The risk/reward dynamic is interesting and helps shore up the rest of the systems that work on the trademark genre staples. Closing Comments:Stranger of Sword City takes the thirty year old first-person dungeon crawling formula and tweaks it enough to make it feel fresh. While the game lacks personality in the storytelling and character interaction departments, it stands head and shoulders above what its genre contemporaries are doing. Stranger of Sword City is a game that I didnt know I was craving until I got my hands on it. Its relentlessly difficult, but also extremely fair. It requires thought and planning, but allows the player to step away when regaining lost ground. Suffice it to say, Stranger of Sword City is a must-play for JRPG fans who own an Xbox One.", "date": "Bohn on March 8, 2016", "grade": 4.0}