{"name": "Fire Emblem Fates: Conquest", "ref": "https://hardcoregamer.com/?post_type=post&p=196459", "text": "Nintendos catalog is one of the most diverse of any publisher, ranging from vast worlds to explore to running on a single dimensional plane as an Italian plumber. They may not be ones to think too far outside of the box, reusing similar ideas for decades while incrementally improving upon it, but they know how to create a variety of games that have grown men gleefully joyful about. While Nintendo is primarily known for more casual experiences, they do have a couple properties that appeal to their hardcore audience and Fire Emblem is one of them. A game about warring factions where perma-death is a highlighted feature and can occur at the simplest misstep, Fire Emblem has always been something thats intimidating and Fire Emblem Fates is no different. Featuring a brand new story that is separated by two different paths, Fire Emblem Fates looks to be the most diverse game in the long running franchise.There are two different versions to Fire Emblem Fates and its confusing for those not in the know what to expect. Birthright and Conquest are two sides of a coin, playing the same customizable character although going down two separate paths near the beginning of the game. We played Conquest in which the player will go alongside the kingdom of Nohr, which is run by an evil, power hungry king. The way Fire Emblem Fates is structured is that it the first hour or two you get to see both sides of the war and how they operate. Hoshido is a friendly and loving society that has a bright and lively color scheme. Nohr on the other hand is darker, oppressing everything around them and only deals with war and destruction. It feels bizarre that the game has been separated into three releases, especially considering at least two of them are priced as full retail products. After getting to know each group, you are given a choice to join a side, but if you only have one of the versions, youre forced down a single path with the option being unnecessary. Granted, most of the experience in both games are vastly different from one another in terms of story and battle events, but it feels like a lot of the narrative is hidden behind a paywall.In Conquest, you will get to know more about the kingdom of Nohr which, as mentioned before, is a far more depressing side of the world. The two warring factions actually seem to resemble west vs. east in their aesthetics and ideals. Hoshido with their wooden architecture, samurai/ninja warrior techniques and focus on softer and more rounded clothing resembles that of the east. Nohr on the other hand has tall brick structures, knights, and more sharp edged armor equipped soldiers, mirroring that of centuries old western civilization. Nohr is setup to be considered as the evil side who is corrupt and power hungry, and its made apparent throughout the campaign. Unfortunately, while being a lengthy strategy-RPG, the story in Fire Emblem Fates: Conquest isnt anything drool over. The plot is relatively predictable in its approach and doesnt really reveal any major twists that you wont see coming; you basically know who is evil from the get-go despite a number of the characters in constant denial about it. At the very least Intelligent Systems isnt holding back with the various themes scattered about and arent willing to sacrifice the narrative for characters. Meaning that many major plot specific individuals will perish for good throughout the campaign despite your valiant efforts, even though there are plenty of moments where some shouldnt have been able to escape.Despite the story being somewhat predictable and not as compelling as it could be, its the characters that are introduced throughout this lengthy adventure that will catch your attention. Its interesting how a number of the warriors are introduced, though, as you can tell most of them arent particularly evil; they just seem to have be raised in a certain environment that has forgone certain values of life. For example, your siblings are very warm to the protagonist and will spare lives, but theyre not always willing to sheathe their blades quickly. Plenty of them arent just mindless meatbags to use in combat and murder countless soldiers, either. Its the impressively vast cast of characters that will have players enjoying the campaign as you can bring many into combat and better increase your relationship statuses with them, be it friendship or romantically. This somewhat ties into the dating-sim elements Fire Emblem Fates contains. This allows players to build ongoing relationships with characters and potentially grow into something bigger. Unfortunately this element feels stripped down and under developed with the rewards being a little disappointing for the amount of effort that needs to go into it. In some sense, while Fire Emblem Fates: Conquest doesnt have the best story to be told, part of it may be because of how Nintendo has broken it up into three different parts. Fire Emblem Fates has been separated into Conquest, Birthright and Revelation where on chapter 6, players will need to make a choice (made blatantly obvious for the games) that goes down each path. Telling alternate paths in games has been done for centuries, especially with western RPGs where branching storylines has always been a key component, but Nintendo has decided to withhold the stories for two of the paths under a paywall. This restricts you to which set of characters will be accessible and the various story-related revelations spread throughout. At the very least, from a presentational standpoint, Fire Emblem Fates is above anything else on the Nintendo 3DS. It not only mixes well done sprites and 3D artwork throughout, but it features various eloquently done cutscenes and some of the best orchestrated music on the system.Moving onto what really matters with Fire Emblem: the combat. Fire Emblem Fates contains a hardcore and fairly challenging combat system that will test any players thoughtful approach to situations. The core gameplay revolves around strategic role playing, taking various characters into battle and then fighting with an opposing force. Most of the time its against the Hoshido (or Nohr if youre playing Birthright), but theyre not the only group in the world. This is very much a hardcore experience, similar to that of XCOM, where perma-death for most characters is the standard (although it can be switched off). This puts an extra level of worry as a single wrong move or roll of the dice can lead to a fully developed character being removed from the campaign all together. It creates a stressful but greatly thoughtful experience as you will need be calculated in every approach, and even then, there are times when things can go wrong quick. Its a grid-based strategy-RPG, so players will need to maneuver around a rather large battlefield, but its who you bring into battle and who is teamed up (or paired up) that will make the difference. If anything, while the character selection is a strong highlight to what makes Fire Emblem Fates addictive, its the engaging gameplay that will have everyone continue pushing forward. Closing Comments:Theres nothing that gets your blood boiling and your heart racing like a hardcore strategy-RPG with perma-death, and Fire Emblem Fates fits that mold to a T. Its a shame that the overall experience is separated into three different packages, removing the significant choice near the beginning of the game in favor of whats inside of your wallet. It doesnt help that the story itself, while featuring a thick and diverse cast of characters, is filled with rather uneventful story moments, filler material and just an overly predictable outcome. Thankfully, Fire Emblem Fates contains highly entertaining RNG strategy gameplay that will ensure youll be on the edge of your seat and fingers crossed every second of play (for better or worse). It also helps that the presentation value is through the roof, containing not only beautiful visuals, but a majestic musical score. In the end, while the narrative is a bit of a letdown, it doesnt diminish the lasting effects the captivating combat system has to offer.", "date": "March 7, 2016", "grade": 4.0}