{"name": "Peter Panic", "ref": "https://hardcoregamer.com/?post_type=post&p=196344", "text": "If theres one game that more developers should blatantly rip off, its Nintendos WarioWare series. Its unique brand of fast, frenetic minigames forces you to learn and adapt on the fly as new games are introduced and discarded in less time than most games take to load. For whatever reason, few developers seem interested in replicating Nintendos winning formula. Sure, you get the odd Frobisher Says! here or the irreverent McPixel there, but by and large, its an untapped genre, and theres no better place for it than on mobile. Thats where Adult Swim Games saw an opportunity, and so we have Peter Panic, a WarioWare-like for iOS that gets blisteringly close to filling the gap, if only there were more of it.Peter Panic isnt just a collection of minigames; its also a musical. Its a strange pairing to consider especially given the general rarity of musicals in gaming, but in practice, its the perfect pairing. Youll play as Peter, a boy with stars in his eyes and Broadway in his heart who wants nothing more than to put on a show at the local theater, only to find out the theaters been abandoned. He sets out to get help from the local townspeople, some of whom want something in return and some of whom simply need convincing. Every time he approaches a new person, the scene will eventually turn melodic and the characters will break into song. In any other genre, the idea of a musical could easily get tiring, but when youre talking about a quick mobile game made up of even quicker minigames, its brilliant. The scenes are only ever a couple minutes long at most, which is just enough time to get a kick of the musical idea but not enough time to get tired of it. If you failed and need to retry or youre coming back to a location again later, you wont have to hear the entire song over; the developers saw fit to record a much shorter song for each location to take into account that you failed or are back.The musical numbers themselves are surprisingly decent, with good humor and a bouncy, jaunty style. True to Adult Swim fashion, the games weird humor really sells it in a few spots, and the plucky, wide-eyed Peter is the perfect conduit, alternating between unbridled enthusiasm and playing the straight man to the townspeoples oddness. Theres smart writing here, but sometimes the lyrics themselves dont match up with the rhythm theyve set forth, like occasionally they just couldnt find the right word or phrase to end a line and instead have to rely on the singer to fudge their way through it to make it fit. With a couple exceptions, everyone gives a great performance and Peter Panic manages to be a pretty entertaining musical. There arent many games that try to be musicals, much less a musical about putting on a musical, so its hard not to applaud Peter Panic for its uniqueness if nothing else.The real draw in a game like this, though, is undoubtedly the minigames. WarioWare games benefit from their strangeness, but at their core is an addictive formula that keeps you on your toes with fun, fresh games that pop in and out before youve even had much of a chance to process them. As simple as the WarioWare-like genre seems, its only deceptively so; there are so many factors to consider when it comes to a minigame set like this: The games each need to be easily understood and acted upon within about a second or two; at the same time, they shouldnt be so easy as to become boring. They need to clearly mark what you can interact with, what you should be doing and what your overall goal is; but there also needs to be an immediate flash of obtuseness the player has to overcome so that part of the game becomes figuring out what to do. With those qualifiers in mind, Peter Panic does an admirable job with its minigame collection. They offer a good sense of challenge as many of them alternate between testing how quick your reflexes are and then whether you can resist those reflexes. For instance, one of the games in the first level, a packing peanut factory, has you tapping the screen to stamp down little pink cubes. Youll need to do this quickly to get through them all, which isnt difficult on its own  until the game starts mixing in some glass vases youll need to let pass by uncrushed. Youll develop a good rhythm, tapping through each pink cube, before needing to stop your thumb mid-tap to avoid smashing a vase and losing a heart. As the game speeds up and you get to the harder levels, youll even encounter bigger pink cubes that need to be crunched down multiple times to pass through, which forces you even more to stay mindful of what kind of item youre being presented.Other minigames test how well you can operate under pressure, like one reminiscent of Papers, Please that has you sort green papers into a green basket and red papers into a red basket; itd be way too easy if it werent for the countdown timer leaving you without much room to make mistakes or even hesitate. Eventually the harder variants of the game introduces a third type of paper to file, and its almost guaranteed to throw you off your game and lose a heart the first time you see it. Thats standard fare for this kind of game; youre going to fail once or twice just trying to figure out what the heck the game even wanted you to do there, but thats where Peter Panic doesnt quite stand toe-to-toe with the WarioWare games. There were more than few games in every new location that had us completely unsure what to do the first few times we saw them, and in those moments, we missed the polish of WarioWare. Similarly, either due simply to using a touch screen rather than a having a good physical button with digital input or a fault of the game itself, a few of the minigames didnt feel especially responsive, like one that mimicked a Mario sidescroller and had Peter jumping over obstacles in his path. We died on that one more than a few times as the game consistently disagreed whether we tapped the screen before the final enemy approached.Peter Panic has an interesting business model. Its completely free to download and play with just one caveat: you cant save unless you pay $2.99. Its weird how much that specific microtransaction affects the experience, even more so than typical mobile microtransactions. Theres a distinct feeling here that the game is somehow cheating you by locking off something so crucial as saving, and its especially frustrating when you need to stop playing for a few hours and come back to find your progress reset. But all the same, the games developers themselves recorded a funny little skit to acknowledge the microtransaction and remind you that they do rely on revenue from the game to pay for their rent, food and the like. Its a completely fair microtransaction in that sense: you can play through the entire game from start to finish with no restrictions, but you lose the ability to stop and come back and have your progress persist. Still, if youre really trying to avoid that $2.99 fee, again, youre free to play through it all in one sitting.The games real problem, actually, is that it can be finished in one sitting. It lulls you in with the quality of the vocal performances, the excellent pixellated style dripping with personality, and the satisfying (if inconsistent) set of minigames. The story begins to unfold and take an interesting turn then suddenly ends. A big notice pops up to let you know that Act 2 will be coming soon before unceremoniously rolling the credits. This being a game about theater, it would be easy to assume the game might just launch into Act 2 immediately following, but it doesnt, and its a massively deflating moment as a result. An expanse of the town becomes inaccessible and labeled for Act 2, but theres no confirmed date for when Act 2 will be released at the moment.Closing Comments:Peter Panic takes two genres we dont see very often  musicals and the WarioWare-like  and combines them in a mostly sublime experience that ends on such an abrupt cliffhanger that its hard to recommend until the rest of the game is out. Still, if youre a fan of the WarioWare games and want a game that scratches that itch, Peter Panic is a good choice, even if it does leave you wanting.", "date": "March 7, 2016", "grade": 3.5}