{"name": "SwapQuest (PS Vita)", "ref": "https://hardcoregamer.com/?post_type=post&p=195717", "text": "For quite a while genre mashups have been, as the kids say, the bees knees. Taking existing genre tropes and pushing them together have given us classics like Deus Ex and Bioshock. Theyre a great way to bring in cross over appeal across multiple audiences and allow players who wouldnt normally touch a genre to find out what they have been missing. Infinite Interactive struck gold with Puzzle Quest when they mashed up Bejeweled with a fantasy role playing game. Developer Rebusmind must be big fans of the concept, as they have switched the idea. Now Pipe Dreams is the game being dropped into the RPG format with SwapQuest. Surprisingly, it works quite well.Long ago, a land devouring evil was bottled up in a crystal, as these things tend to be. Over time, cracks began to form in the brilliant bauble until it finally shatters. The king sees this occur and sends his kids out to gather the crystals and restore order. Hes just going to stay behind and swing a sword at the emulsified cloud of darkness, thanks. Though not stated in the plot, he seems to have welcomed the respite from his children, as attacking a fog of evil seems like a stupid way to spend time. Its possible that this is because of the childrens peculiar phobia of stepping off of a path. They will follow the path until it reaches an end point, stop, and turn around. Better to wander into the malignant gloom than to step on the grass. Thus, it is up to the player to create a path for them. More accurately, just one of the kids. The player starts by selecting a gender and class. Each class has their own skills that open up as they level up, of course. Then, it is time to wander through the realm to gather up gems for upgrades and smack monsters in the quest to defeat the grasping hands that are enveloping the land.The gameplay breaks down into swapping tiles to mark the way forward. Each stage starts at one end of a long run, and the player must reach the finish line. Therefore, the player must quickly choose and switch out tiles so that the hero has a trail to follow. Along the way, there are chances to sidetrack to open treasure chests and attack monsters. Opening a chest sprays jewels all over the map, leading to a rush to collect as much as possible and move on before the auto-scrolling screen end reaches the player. The astute player could decide to forego these diversions to make a bee line to the end, but will then find themselves woefully unprepared for the bosses that periodically pop up, and the late game where battle is required. The boss portions are actually very interesting. Dropping the constantly moving screen of the main stages, these focus more on laying out ways for the player to avoid attacks while trying to figure out the trick to defeating them. The aha moments here were very cool, and felt great to figure out. The puzzles these bring up werent too obscure, but still lets the player feel clever for figuring them out. To give one quick example, there was a boss that was stunned during the course of the battle, but blocked from direct attacks. After being flummoxed for a brief moment, I realized that tapping the creature directly caused it further damage, and opened the way for the hero to finish the job. These fights are filled with these moments that require thinking around a simple problem.Also giving the title some legs is the upgrade system. While basic on the surface, there is always something to upgrade. Not only are there numerous weapon and armor pieces to purchase, each of these have individual stats that can be strengthened, along with the heros unlockable skills. Its possible to grind to the point where the game is broken, should the player choose, though entirely unnecessary. Still, it is an appreciated aspect. With all of these aspects, the game manages to be pretty darn good, but it really comes into its own once the player reaches the Sky Tower later on. Here, the auto scrolling journey is tossed away and the player must use the mechanics learned to solve increasingly complex puzzles to progress upwards. Each floor is different. Some floors only require defeating the enemies, some to avoid traps and still others to unlock the gate blocking the way forward. All are laid out in an entertaining fashion and become quite difficult as this area progresses. Having an entire game built around this section would be quite alright in my book. It would have been better if some of these puzzles were spread across the game to switch up the gameplay of the journey levels, but at least theyre here.What doesnt hold up as well are the optional minigames. These range from collecting a set number of crystals to avoiding swarms of bees. These short sequences simply arent any fun and are easily not worth the time investment. While speaking of flaws, the music manages to become grating in short order. Utilizing a generic fantasy motif, it manages to be cloying and annoying at the same time. Fortunately, it can be turned down to zero in the options. Closing Comments:Considering the budget price and aesthetic, the most that was expected from SwapQuest was a silly little time waster that used the puzzle and RPG genre to create an enjoyable time. In other words, a throwaway title. SwapQuest does more than that. Though some issues should have been addressed with the pacing, the actual game design is pretty darn fun. Most of the game is well put together and engaging and when it finally reaches its pinnacle, with the bosses and the Sky Tower, it becomes a compulsory addictive game.", "date": "Bohn on March 2, 2016", "grade": 4.0}