{"name": "American Truck Simulator", "ref": "https://hardcoregamer.com/?post_type=post&p=193563", "text": "The open road is calling and its pull cannot be denied. The interlocking transportation network that links the country together consists of highways, streets, scenic vistas, bland interstates and millions of other vehicles all sharing the same space. Some roads are little more than single-lane dirt paths, others are as smooth and wide as a river and all of them want to be explored. American Truck Simulator gives you a truck, job and the opportunity to see the country, hauling cargo from one town to another, but really its little more than an excuse to get out there and go driving.So its off into the wilds of the west coast to explore the bits of the US that have been built so far in a rough 1:35 scale, because actually driving six hours to cross a small section of a state would kind of suck for a game that will eventually span the continental US. At the moment American Truck Simulator is all of California and Nevada, with Arizona being made available as free DLC later on unavailable to be played or reviewed at present. Its terrain is more a rough sketch of the states it covers than an actual representation, with a few landmarks for the bigger cities to give the feel of the place and couple of random streets for the smaller towns. If youre looking to drive through the familiar streets of home it wont be in here, but if you want to haul freight over a recognizably American landscape (or at least the west coast and desert) then American Truck Simulator has you covered.You start out dirt poor but with a dream of not being in debt to the banks for your entire life, taking random jobs using other companies equipment. It doesnt take long to realize this is a suckers game, paying peanuts per mile while stuck running someone elses route, so with gritted and held-out hand its off to the bank for a loan to buy your own truck. Its a small start at the bottom of the ladder, but now the map is open and the world yours to explore. Its probably best to explore it hauling freight, though, because the bank collects on its loan daily and gas isnt cheap. The job manager doesnt have too many offers on there to start with, seeing as it only features employment from cities youve visited at least once, but as the map fills in and more towns get discovered the options soon stretch to several pages. Thankfully they can be sorted by how much they pay overall, averaged out by pay per mile, starting or ending cities, etc. As you level up and choose perks, new types of jobs also become available, further expanding the job roster. Each job starts at a supply point, such as a not-Walmart, industrial plant, construction supplies, etc. The thing being hauled isnt so important as how much youre being paid, although the weight of the cargo shouldnt be neglected. The reward for a successful run is both cash and experience, and every level-up rewards a single skill point to invest in better hauling opportunities. High value cargo gives a nicer payoff than a standard haul, and hazardous chemicals provide an excellent bang for the skill-point buck. Alternately there are runs that pay nicely for getting there on a shorter time-frame, or you can even throw a few points into fuel efficiency. There are many ways to turn hauling freight into cash, but plenty of ways to spend that money too.Money doesnt last long around trucks, as it turns out. The bare-bones truck you start with is almost begging to be tricked out with nicer accessories and a better engine, and a custom paint job isnt cheap either. The starting one-truck garage has plenty of options for expansion, and once youve done that its time to buy a second truck and hire a new driver. Eventually, given enough time and persistence, you can have a vast network of garages spanning the states, staffed with the most skilled drivers money can hire, but thats a long, long, long way into the future. The bank is there to help with a handy cash loan but its going to take a good long while before the money starts rolling in fast enough to buy new trucks by the fleet. American Truck Simulator is a game to be played over months, rather than dump a few dozen hours into it over a couple weeks, and progress is slow but steady. The point of American Truck Simulator isnt so much the progress, in fact, as it is the driving. Its the type of game you can put a few missions into per day and come away feeling satisfied, and while it wont be throwing off adrenaline-pumped bursts of pure joyous excitement it is a great way to kick back and relax. Whether you choose to play with the truck on super-easy automatic, regular automatic, manual, or even with an H-shifter setup, the game simply wants you to enjoy taking a drive into the world. Throw your entire music collection into the Music folder, pick a few tunes, grab some cargo and get moving. The day-night cycle is always pretty, with morning light shooting its rays over the desert or shooting stars lighting up the night sky. The ocean over breaks over Californias rocky shores throwing up swirling mist on one side while the mountains rise on the other. The long straight highways get you where you need to go efficiently while the twisty back roads keep you on your toes. Money and experience are the side effects, not the goal.Its not all pure driving joy as the rig conquers Americas highways, though. Real driving can be incredibly annoying and American Truck Simulator doesnt take all the edges off it. The AI simply isnt that bright, for example, getting easily confused as to which way it wants to go at an intersection, and entry ramps onto the highway make it seem positively suicidal as cars stop and wait for a break in the traffic zipping by at 60 MPH. The road network itself is loaded with areas you simply cant travel over, with the stopping point marked off by a string of XXXX floating in mid-air while the rest of the traffic drives on past the unbreachable barrier. The police have their issues as well, being incredibly zealous about giving fines for speeding during times where it simply wouldnt happen in real life. Driving slower than 65 on the California freeway is not an option for long-term survival, but it doesnt take long before the fines start mounting up in the simulated world if you try to keep up with traffic. And as long as real-life traffic management is a gameplay improvement, maybe a few traffic light turning arrows would help on the busier sections of town. In a game about driving thats as far from Burnout as its possible to get, its incredibly important to be able to bring real-world driving knowledge into the sim. Closing Comments:While a little more realism would make American Truck Simulator more fun, paradoxical as that may sound, theres no escaping how fantastically playable it is. The low-pressure gaming makes a great escape into a fantasy of a familiar world, hauling cargo hither and yon as an easy excuse to get out on the virtual road. Its America is only a couple of states at the moment and more an impression of the landscape than an actual representation of the cities and towns it covers, but when the lighting is right and the road is being kind, its a great place to travel through. American Truck Simulator puts you behind the wheel of the biggest beasts of the road and sets you free to explore in your own way, taking in the scenery while keeping an eye on traffic, and just maybe, even learning to back 18 wheels of pure trucking muscle into its target drop-off point. If youre going to live a driving fantasy, after all, you might as well fantasize big.", "date": "February 21, 2016", "grade": 4.0}