{"name": "Forgotton Anne", "ref": "https://hardcoregamer.com/?post_type=post&p=298815", "text": "One thing we can be certain of among the many offerings from Square Enix Collective over the past two years is the promise of a diverse array of visual aesthetics. After building a fairly impressive portfolio for themselves, it almost feels like Forgotton Anne is the epitome of Collectives unique position in video game publishing at present. There are points when, as the games presser describes, you do feel as if youre [living] out an animated adventure. One of the games earliest moments  the titular Anne, the Enforcer of the Forgotten Lands, a peacekeeper if you will  has you gaze out a window from up high, looking down and out upon the chaos that has ensnared the city and the line between animation and video game really does seem to blur.From the word go, Throughline Games distinct and unique visual style is as potent as it is pleasing. Anyone whos ever watched a 20th century [non-Pixar] Disney flick will instantly catch onto the games whimsical flair and almost gracious use of color and toning. Anyone whos ever watched a Studio Ghibli film will subsequently catch onto how soft and delicate its color palettes seem. Particularly when it comes to world-building, in depicting this fantastical realm of forgotten once-inanimate objects now brimming to life with eccentric quirks to match. The hazy, often-cool hues of blue and green together with the downtrodden atmosphere works wonders in immediately crafting a world that, despite its surreal foundation, isnt exactly overblown on following that through with just-as-bonkers a premise.Part of the games immediate appeal is in its set-up; despite the idea of a struggle between the would-be law and a rebellious uprooting of the populous, its the contained delivery of the story that keeps things progressing at a smooth pace. Some characters and occasional interactions are a little too comical or overblown for their own good, but for the most part, the games array of borrowed dialects plays nicely into the theme of far-flung, forgotten belongings now finding a means to live out their seemingly more animate lives, with the prospect of returning to the human world as is mentioned during the story. Said interactions with these characters can be mere passing comments and tiny conversations that further build the world around you, but some are more plot-critical and its here where one of the main mechanics  that being the dialogue choices  come into play. Depending on your choice of words (as well as a bit of optional investigation from time to time), scenarios will usually play out in either one of two scenes with your prior decision having an effect on later scenes further down the line. It doesnt alter the linear progression through the narrative and admittedly the ability to drain Anima (the life-force of the Forgotlings, as theyre referred to) does seem like a missed opportunity to further expand the decision-based gameplay  rarely granting players such a moral ability outside of a few critical choices from time to time.The ability to extract and transfer Anima is often the means with which players solve puzzles throughout Forgotton Anne. Usually, players must correctly deduce when and where to transfer this energy between devices such as power-lines and generators. Though the puzzles, much like the platforming, remain relatively simple, these segments are neatly dotted about and serve as a tie-in with the story-led exploration that makes up the remainder of the gameplay and serves as the games brightest spark. Considering its 2D plane, Forgotton Anne does a great job at giving its seemingly flat environments a surprising amount of depth. Environments sliding into play as the parallax between foreground and background works wonders, at points even allowing you to shift between differing depths of field via the use of a platform or a flight of stairs. Not unlike a game such as Poncho; Anne herself retaining that novel frame-for-frame jogging animation as she makes her way up or down a particular flight, be it indoors or outdoors. The interiors of buildings especially allowing such things as lighting and tone to further advance a peculiar yet fascinating contrast between Annes sharp, cleanly-drawn figure and the depth of an environment rendered in 2D yet seeming to offer the hallmarks of something more three-dimensional. This multi-layered delivery is one of the more fascinating and best-executed assets of Forgotton Anne overall and part of the charm lies in simply making ones way up the many staircases and corridors  in and out of interior buildings and half-beaten paths  working out which route ends where. Occasionally activating a short-cut or finding another collectible to add to the pile along the way. Its gameplay may seem relatively simplistic and not quite advancing the genres it falls into  be it platforming or story-led adventure  and the game is not without its blatant restrictions.Namely Annes animations during conversation which get repeated quite a lot over the course of the game, but more pressingly some moments during platforming wherein the stiff and clunky controls can grate  meaning a simple jump from platform to platform can a feel little more tedious than it should be. It doesnt help that controls in general feel jumbled as well with your character mistaking a side jump or leap forward for another completely vertical jump or wanting to climb a platform above requires you standing in precisely the right position so as to trigger the correct animation. Its these moments (but only these moments) where the down-time between plot points does start to wear the player down and exploration loses some of its initial appeal. Fortunately, the simplicity in the actual platforming doesnt degrade from everything else going on around it and the decision to strip back on this element, oddly enough, seems to have aided the game in the process. Closing Comments:While it may not be adding tricks at every turn to the platformer genre or making a name for itself with its minimal puzzles, Forgotton Anne will surely win many over with its gorgeous, animated visuals and more importantly, its sense of wonder. Throughline Games have crafted one of the years more unique affairs when it comes to artistic design, but crucially, find the means to deliver it in a way that doesnt become too indulgent in its own aspiration. As if it were taken straight from the reels of a 20th century animation house, the curious but thoughtful world is matched in equal parts by how delicately rendered it is  one players will easily resonate with regardless of their history with animation. In the end, popping in and out of the many alleyways and rain-soaked buildings alike (all the while conversing with a few sentient oddities along the way), Forgotton Anne is a delightful and wondrous trek to make.", "date": "May 11, 2018", "grade": 4.0}