{"name": "Call of Duty: Black Ops III  Awakening", "ref": "https://hardcoregamer.com/?post_type=post&p=192749", "text": "Call of Duty: Black Ops IIIs season of DLC kicks off now with the first map pack, Awakening. As part of a deal with PlayStation, Awakening and all subsequent DLC packs release first on PS4. Adding three new maps, a remake of a Black Ops II map and a brand new Zombies experience, Awakening is sure to set the tone for all future DLC. Is Awakening a great start to a season of Black Ops III DLC, or does the season sputter out the gate?The three new maps are Gauntlet, Rise and Splash. Each was designed using Treyarchs three-lane design, and all three have a good flow. Gauntlet may be one of the most unique maps ever designed for a Call of Duty. Taking place at a training facility, Gauntlet features three different aesthetics, one for each lane. One lane is a jungle, the center is a frigid land of ice and the last is a rainy alley. Each lane feels unique, allowing for different types of strategies. The jungle is an excellent hiding place for snipers, the ice land is wonky and is good for assault rifles and SMGs, and the linear patch of the alley is excellent for long-range engagements. Gauntlet is a big map, perhaps a little too big with its winding tunnels between the different lanes, but its visually appealing and fun to run through.Rise, as described by Treyarch, is the most traditional Call of Duty-feeling of the DLC maps. Taking place at a construction site in Zurich, Switzerland, the center lane features a wide open coliseum area perfect for close-quarter engagements. One lane features a lot underwater combat and the other is suited to long-range combat. Rise is traditional in that it focuses on boots-on-the-ground combat. Sure, there are walls to run on and water to swim in, but the majority of combat is going to take place with your feet planted firmly on the ground. Visually, Rise is bland; grey and plain. Rise can be fun to play on, but does come off as generic. Finally we have Splash, which is the coolest map in Awakening. Taking place at an abandoned water park, Splash contains all the attractions one would want from a water park: slides, splash pads, a pirates cove and a deep pool. Its a fast-paced map, favoring assault rifles and SMGs, but talented snipers will find a home in a few good sniping perches. Splash should be the best map in Awakening, but its not, because its broken.Splash currently suffers from major glitches that allow players to hide inside the geometry and climb on top of the map. This gives them a huge overlook of the map, all while staying well hidden. While it is possible to kill these players, trying to locate them in the geometry can be difficulty. Its been nearly two weeks since Awakening launched, and Treyarch has not patched these issues. It is possible to report players abusing a glitch, but it comes down to Treyarch to properly fix the map. Splash is cool and hopefully Treyarch issues a fix before Awakenings release on Xbox One and PC. Following the three new maps comes the remake, Skyjacked, a remake of the Black Ops II map Hijacked. Skyjacked is, well, Hijacked. Aside from the new broken hull (added to make use of Black Ops IIIs new movement system), this is the same map with a new paint job. The only real issue here is that Skyjacked was not designed with the new, faster movement system in mind. Players can zip across the map to the opponents spawn in less than a minute, making spawn-flipping super easy. If you loved the fast-paced action of Hijacked then youre probably going to love Skyjacked. If you hated it, then youre going to hate Skyjacked.Rounding out the package is Der Eisendrache, the brand new Zombies map. The Zombies saga continues as Richtofen, Nikolai, Takeo and Dempsey infiltrate the Griffin Castle in Austria. Massive deposits of Element 115 have been unearthed and a research facility erected to mine the precious element. Upon arriving at the facility, the team discover that zombies have overrun it, eating the previous occupants. Using their wits, Pack-a-Punch and some mystical help, the team must survive as long as they can.Der Eisendrache is awesome. The map is huge with numerous twists and turns, tight corridors, and wide open spaces. Its not so sprawling that youll get lost and annoyed like with Shadows of Evil, but still big enough that its going take multiple runs to discover everything. Treyarchs team have done a wonderful job fitting Black Ops IIIs traversal mechanics into the Zombies map, using the power of magic. Overall, the map is huge at around 50% bigger than The Giant and comes with two new Wonder Weapons to discover: the Ragnarok DG-4 (based on the Gravity Spikes) and the Wrath of the Ancients (based on the Sparrow). Der Eisendrache is a great addition to Zombies. Closing Comments:Call of Duty: Black Ops IIIs season of content kicks off with a solid start. Awakenings new multiplayer maps are well designed, encouraging players to experiment with different playstyles. Skyjacked will be appreciated by those who loved Hijacked, but others may find its constant spawn-flipping annoying. Der Eisendrache is an excellent Zombies experience that longtime Zombies fans will have a great time sinking their teeth into. The only downside to Awakening is Splash thanks to its numerous glitches. Its the coolest looking map of the bunch, but Treyarch needs to fix these issues. All-in-all, Awakening is a good start for Call of Duty: Black Ops IIIs year of DLC.", "date": "February 12, 2016", "grade": 3.5}