{"name": "Lost in Harmony", "ref": "https://hardcoregamer.com/?post_type=post&p=191088", "text": "Sometimes its not possible to be of much use in any way other than just being there. Emotional support is incredibly important for the person receiving it, but can be deeply frustrating for the one providing it when they want to do more. Kaito is a teenaged boy stuck in the position of wishing he could do anything for Aya, anything at all, beyond being her support as she goes through cancer treatment while the months roll by, but fantasy only goes so far. Instead Kaito chats with her through text messaging, then escapes into his headphones as the music plays and a dream of skateboarding down the road with Aya clamped on to his back plays out, the backgrounds and hazards directly related to the events of the day.Lost in Harmony is a music/rhythm game about avoiding obstacles to the beat, but its also a story of fantasy wish-fulfillment in a very difficult situation. Each level sees Kaito barreling down the road with an enthusiastic Aya reacting to every success and failure along the way as he jumps and dodges everything the road can throw their way. As the story gets darker each journey down the musical path starts out more dangerously, but the point of the fantasy is to escape so by the end the pair has ended up better than where they started.All the elements on the art side of Lost in Harmony come together to reinforce the mood and theme of the story, giving each chapter have impact and the making story honestly moving. In one chapter, Aya is having trouble breathing so the level starts out in the middle of an industrial wasteland, Kaito navigating the course to a crunchy version of Hall of the Mountain King. As the pair leaves the initial area behind they rise higher into the air, a lighter and less ominous track scoring their ascent out of city, into the atmosphere and then up to space. The pipes, garbage, and dirty machinery of the starting area make way for cleaner, more futuristic vehicles, trails of glittering stardust lie on the track, and beat-stars fill the sky to be tapped to the rhythm. Like all levels, it ends with Kaita and Aya standing at their destination, healthy and happy to arrive. And then the fantasy ends. Everything about Lost in Harmony is incredibly well done, in fact, except for the gameplay. The basics are there but the mechanics in the execution make playing with skill far less accessible than it should be. The gameplay can be divided into two types- the kind thats perfect for a touch screen and the kind that isnt. Most of the level is played by guiding Kaita down the road as he rides straight towards you, with very little space between him and the edge of the screen. Vehicles approaching from the rear get plenty of advance notice as you see them pull up behind you, but hazards from the front are indicated by arrows showing where theyll be. The amount of time between arrow appearing and hazard scrolling by is constant, depending on how fast youre moving, but its still easy to lose the indicator amidst the rest of the action on screen. Keeping an eye on the arrows indicating threats are swooping in from the sides while also trying to ride a line of stardust and time a jump to clear a soon-to-appear obstacle requires a few extra eyes and fingers, and it doesnt help that steering and jumping would be far better served with a gamepad.Steering can be done in one of two ways, although only one is actually practical. You can either touch the left or right side of the screen to drift in the appropriate direction, or touch Kaita directly for pinpoint control. That latter method is perfect if you have transparent hands, but for the rest of us its not particularly helpful. Jumping is done by a quick swipe upward, and when the level gets crowded youd kill for a button instead. Theres no way to separate Lost in Harmony from its touch controls, however, because the other part of the gameplay requires them with Ouendan-like beat-tapping. During certain sections of the music, stars appear on the screen with a ring condensing around it, and youll need to tap them as they appear to the beat. Most notes appear in sequence, although there are sections where youll need to hit two at once, and there are also ones youll need to drag as the note holds its tone. While less common than guiding the skateboard, these sections work far better even if the lines indicating which note is next in the sequence are nearly invisible. Later levels combine steering and note-poking together in a way that just doesnt work, because doing both at the same time (not one after the other in quick succession, but simultaneously) requires more than just the two hands. Closing Comments:Its hard to rag on Lost in Harmony, because I love everything about it except for actually playing the game. The music is excellent (its even got a classic Tetris theme), each level is themed perfectly with the events that inspire it and the story of a teenager fantasizing to music because it beats being helpless is honestly moving. It even comes with a course editor and has plenty of tracks available for download, if you own the music or can at least access it through Soundcloud. Playing the actual game, though, is like taking a class in the compromises necessary for pure touch-control. It says something about how the game expects the player to do when a passing score is 50% and a B ranking is 75%. Thats not how completion should work. Lost in Harmony is a fantastic experience and an incredible presentation, but its a shame that its just not that good a game.", "date": "February 6, 2016", "grade": 3.0}