{"name": "Klaus", "ref": "https://hardcoregamer.com/?post_type=post&p=190749", "text": "You dont often see the word cinematic lined up with the first tad piece of information unveiled to a brand new indie title. You certainly dont expect the debut release from a lone studio to be one that would even attempt to go beyond the humble if understandably proud and confident safety net most independent releases would prefer to keep to. In a way this is rather befitting of La Cosa Entertainments debut entrant, Klaus. Sure the narrative premise may sway the situation back into more familiar grounds  amnesiac main character, a quest for truth, puzzle-platforming ripe with opportune displays  yet theres something distinguishably off-kilter about this seemingly clean-cut, polished platformer. Whether or not you want to see its cinematic teaser as but a prescript to its content or not, La Cosa know that to conquer the art of the 2D puzzle-platformer, you have to look beyond the convention of simple mechanics. And to that end, intrigue its viewer-come-potential-consumer base.Thats not to say Klaus is a complexly-arranged title; its controls are built to transition smoothly, from precarious sprint to jump to double-jump and then back to yet another timely sprint. While its somewhat relaxed physics may look and feel dissuasive, the point is Klaus never at any point  at least from a gameplay perspective  wants to be seen as bold for the sake of it. Its bright and contrasting colour palette as well as its hand-drawn illustrated aesthetic does more than enough to suggest Klaus, in both name and persona, is not quite what it appears on screen. Borrowing from noir aesthetics as well as the compact moments of newspaper comics for examples, it takes little time for the game to cement this breaking of standards by doing as much the same thing to the forth wall.Throughout your adventures through the five main chapters, the titular character will continually engage you in conversation. Or at least try to; were not quite in the age of two-way communication between ourselves and video game characters. To that end, Klaus [the game] sets this up in a quirky but fondly humorous passage of questions, curious thoughts and one-liners from the main character. Each bit of dialogue transitioning onto screen with as much the same size, density and emphasis as any line of conversation would and should be. Be it mid-air, on the ground or on a wall, Klaus one-sided converse acts as the conduit for the games story to be told as we venture deep into the bizarre inner workings of the factory the main character has found himself in, minus his memories.We are joined later on by a brutish-yet-modestly innocent assistant in K1 who is essentially the brawn to Klaus brain  able to destroy objects such as crates yet still merit just as much aerial prowess with the ability to glide for longer stretches. It soon becomes apparent that while relations may not be tense, theres a definite lack of absolute peace, from Klaus perspective, about the situation unfolding before him and of the disconnect he has with both K1 and you, the player. There are even moments in-game wherein the two controllable characters are separated and the dialogue-based exposition unravels into an interesting two-sided dont tell the other what I just said back-and-forth. Such an addition is welcome relief given that, for the most parts, the structure and presentation of levels throughout feel rather less fulfilled than the narrative accompaniment.Of course there are some distinguishably frustrating puzzles littered throughout this five-chapter playthrough, yet the substance and indeed overall meat to Klaus front-end product doesnt quite pull off the same flair as the dialogue. And yet, as if by contradiction, La Cosas use of the DualShock touchpad, and the way in which certain puzzles or moments of platforming are accomplished, is a neat touch and one that deserves praise for. Throughout the game, certain platforms or gates can only be controlled using the touchpad and while early examples may only require a simple repositioning of a finger, later challenges will often require touchpad, control stick and jump button used in unison. A task thats harder than it sounds.Players will also come across the designated bonus areas that each subvert the mechanics of the core game, if for a brief moment, so its a shame then that such interesting variances are underused and placed in such niche positions as this. That said, these areas invoke some of the more challenging yet duly rewarding moments of Klaus as a whole. Succeeding each sectioned-off area grants you a piece to one of Klaus lost memories; find six in the same stage and youll unlock what can easily be described as further exposition towards the events preceding the main game itself. While not exactly thorough in its engagement, these memory segments do enough to give the impression the player is slowly making their way to the truth.Even still, its disappointing that the narration  and by extension, the supposed plot-twists and dramatic reveals  arent given the same carefully-constructed execution come the final sections. Whats more the story later ventures too deeply into soap-box territory with its predictably metaphoric comparisons, it takes away from what is a fair but fine platforming formula previously established. So too the gameplay tends to let slip, despite the occasional surprise (which rightfully catches players off-guard)  grinding to a halt in its evolution and, shift in art-style and pacing aside, not quite meeting the highs of earlier proceedings.Closing Comments:Despite its shortcomings and unfortunate slip towards the end, Klaus stands as an admirable and respectable first outing for La Cosa Entertainment. With elements that cater to both the conventional and non-conventional of story-telling, Klaus is  at its best  a nimble and vibrant puzzle-platformer that knows when and where to break the mold without losing touch with its 2D roots. Borrowing from principles of storytelling both in and out of the gaming medium, La Cosa have a solid foundation in enticing their players to continue on and plenty of good material to further improve upon. Without forgetting a presentation that harkens to the best of past and present-day animation techniques, even if Klaus is not one of the most extravagant of platformers, its at least one of the more memorable.", "date": "February 3, 2016", "grade": 3.5}