{"name": "No One But You", "ref": "https://hardcoregamer.com/?post_type=post&p=190379", "text": "For many non-visual novel fans, the genre seems to be one full of teenage romance and little else. Those who actually play a variety of these games know this isnt the case  but there are still an inordinate amount of romantically-focused titles out there. No One But You is a game that appeared to straddle that line when it arrived on Kickstarter in 2015. With a meager goal of $1,300 and a fairly unpolished Kickstarter pitch, something magical happened. It didnt matter that this campaign lacked the flashiness of other visual novels on the crowdfunding site. Folks appeared and suddenly began funding the project until it had raised $18,012. Under a year later, we finally have Unwonted Studios debut game on Steam in order to tell if this was all worth it. No One But You tells the story of a young man named Hideaki who has just returned to his hometown with his mother. Apparently, this mother figure is a bit of an oddball and frequently makes sudden decisions which affect the both of them. The latest of these is the rash decision to move back to their hometown of Okutama. Normally this would signal someone to remember all their great (or awful) memories from childhood about their hometown. Thats not the case for Hideaki, though. Due to a serious accident in his youth, he has no memories of life in this town or much else from back then. This means that his exploration of Okutama is both new for him as it is for the players. Luckily, there is an actual point to his memory loss beyond simply creating yet another amnesiac protagonist.Things begin much like other visual novels based around new high school students. Hideaki may just appear to be an average, everyday guy but for whatever reason a cavalcade of young women get involved in his life almost immediately. Even before arriving at school for the first day he meets with Chinatsu, a quiet, mature senior. Shortly thereafter, he meets up with the ever-excitable Megumi and mysterious Shiro. Then theres Yui, an easily-angered classmate who fights regularly with the only other main male character, Ryo. Each of these characters has their own path with good and bad endings to be discovered through multiple playthroughs.Luckily for players, none of the paths are particularly challenging to unlock. Unlike some visual novels which require incredibly precise (and unexpected) choices, this one makes a lot of sense. Simply make choices which relate to the character you wish to pursue and ignore other characters should do the trick in almost all instances. To be honest, its a bit so simplistic in its choice flagging that most players wont even require a walkthrough. This is a great thing for those who dislike the artificial challenge sometimes present in the genre, but may be too simple for others expecting nuanced gameplay. As the storyline in No One But You proceeds, it starts off very much like any old harem anime. Everyone seems to adore you even though youve done little to generate that interest. However, once you finally get on someones path, things change. The change in tone is quite dramatic in some cases, as well. After learning more and gaining the acceptance of your character of choice they tend to reveal some pretty heavy stuff. Obviously it would be unfair to describe any of these reveals in detail, but some certainly hit harder than others (even if theyre super contrived upon reflection). It is while on these character-specific routes that the final choice you make will decide whether a good or bad ending is received. My suggestion is to make a handful of saves before late-game choices to ensure a place to start from if you inadvertently make the wrong move (or are simply looking to get 100% of achievements). Speaking of achievements  they include spoilers so do your best to not look at them ahead of time.Its a good thing that these storylines make a break for the dramatic because, up until that halfway point, No One But You feels utterly droll. Each character fills their role with such an adherence to tropes that its honestly annoying. Then theres the protagonist who is somehow even more idiotic than most clueless leads in the genre. Some of the lines he says aloud or privately are utterly cringe-inducing. It feels like the writing concept behind Hideaki may have simply been to cram as much humor in as possible, at the expense of creating a realistic or even loveable protagonist. Luckily, these issues are repressed once you finally start digging into the route of your choosing. Fortunately, the first half of the game isnt all that long (especially once you can skip past most segments on a subsequent playthrough). Unfortunately, the rest of the experience isnt all that long either.In total, No One But You might last up to four hours on the initial playthrough. This is hardly enough time to get seriously invested in any character, even despite the dramatic turns of their specific tale. This is an unfortunate issue which seems to plague many Kickstarter games no matter the genre. Due to time constraints of delivering to backers, or maybe due to newness with development, the game is just too short to feel particularly satisfying. Completing each and every route with every ending takes around 7 to 10 hours. While fully completing this visual novel is suggested, as it gives players the fullest understanding of the world, its still not quite enough to stand up against better titles in the genre which can both offer a fabulous story in condensed amount of time. At least the visual quality did not suffer due to truncated story length. The character artwork looks quite nice for an indie visual novel and emulates its Japanese contemporaries well. Backdrops are a bit of a mixed bag. For the most part they look nice, but every so often elements of the background stand out in an unpleasant way. There is no voice acting in the game, in English or Japanese, but maybe thats for the best as indie projects sometimes fail to attract skilled voice actors. Its worth noting that the soundtrack is middling to acceptable, potentially due to an experience reason. Some tracks are fine but others sound like a goofy little melody that even I could cobble together given the right tools. Suffice it to say, those tracks really bring one out of the experience, but most of the time musics not a big deal.Closing Comments:Theres something to No One But You once you make it through the average slog that is the first half of the game. Had there been more time put into fleshing out the characters and ensuring that the complete game was as exciting as the latter portions, its possible this could have become a great visual novel to suggest to newcomers. As is, No One But You is a game with some intriguing moments and great artwork but overall feels too disjointed.", "date": "February 3, 2016", "grade": 2.5}