{"name": "Between Me and the Night", "ref": "https://hardcoregamer.com/?post_type=post&p=189972", "text": "How much patience do you have with puzzle games? Or at least puzzle games in which the puzzles are simply impediments to progress that require artificial, multi-step solutions that are foreign to the simplicity of real life. Between Me and the Night is a stylish and moody adventure puzzle game that does a lot of things well, but fails equally hard in its controls and frustrating gameplay systems.Between Me and the Night puts the player character  a young boy  in a sprawling old house filled with darkness, danger, mental instability and secrets. I wont spoil the surprises by talking story or details because the discoveries the character makes are at the core of the game. Seemingly mundane objects arent what they seem, there are secret spaces to uncover, and the palpable feeling of dread evolves nicely as time passes. While the game is about discovery, there is virtually no direction in regards to where to go, what to do, or why.The characters relationship with 80s-era video games is woven interestingly into the story and playing through brief sections of these games-within-the-game help unlock areas and progress the tale. Well, playing is perhaps an exaggeration. There is almost no meaningful gameplay in the little flashback sections. The art design of Between Me and the Night is that of a picture-book, with a fundamentally innocent, painterly use of color and shape that are in contrast to some of the games more disturbing moments. The game makes effective use of shadow and light, and indeed keeping the lights on is a major thematic motif throughout. The style could be considered overly affected and self-consciously arty, but it grows more convincing as the game progresses into more textured and interesting areas. What never quite connected though, was the faceless and entirely unemotional leading character in a game that is trying to traffic in tension, madness and unease. What also didnt grow more convincing are the pacing and awkward controls. Theres a limited inventory system of only five objects, necessitating constant switching items in and out, shuttling them between areas, and trying second guess if an object is essential or detritus. Using a controller, moving or using an object in inventory requires the a two button combo, the use of the cursor, and overly precise placement. If you miss placing a key directly on keyhole, for example, you have to pick it up, put it in your inventory and then take it out again. The character moves through the world slowly and deliberately even the run control is pretty deliberate  and climbing on or off a chair is a tediously protracted affair. The puzzles in Between Me and the Night range from those that intriguingly help piece together the actual story, to those that seem to simply exist to pad out the gameplay. These usually involve placing critical path objects in obscure or difficult to reach places for no logical reason except for making the player solve the puzzle of how to get to them. Why should the player open a closet door to allow a stairwell  that was there all along  to become visible? Dream logic aside, hasnt game design moved past those kinds of puzzles? The UI is obviously going for a minimalist approach and there is no save anywhere system. Instead it saves at the start of chapters that might be hours apart. The experience is short, but the puzzles dont change with repeated playthroughs and forcing a restart every time accomplishes nothing. The games music is a synth-laden heavy wash of minor chords, deep rumblings and meandering ambient noodling. It is also omnipresent, underscoring nearly every moment of the game and its mood rarely shifts much. Along with the faceless main character and general lack of voiced dialogue, the same-y music adds to feeling of detachment. Closing Comments:The look and tone of Between Me and the Night will undoubtedly appeal to many gamers, but they may ultimately be disappointed by its approach to puzzle design, overly fussy controls, limited inventory system and a mood that has little variety save unease and tension. Playing through Between Me and the Night is a little like hanging out with a talented but perpetually mopey friend: its interesting for a while, but just kind of bums you out in the end. If its use of nostalgic video game styles had been more deliberate and integral and some of its puzzles more essential to telling the story, Between Me and the Nights art and atmosphere could have carried the experience.", "date": "January 29, 2016", "grade": 3.0}