{"name": "The Witness", "ref": "https://hardcoregamer.com/?post_type=post&p=189083", "text": "Theres dozens of hokey ways to begin a video game review. Nearly all of them are hokey and subtly self-indulgent, since a long form article without some sort of insight into the mind of the reviewer often feels like a book report. This last point presents an interesting conundrum. On one hand, you want the reader to understand the person behind the critique. Its impossible to understand the full extent of someones opinion if you have no idea of where that opinion came from. To the contrary, game reviews, and structured criticism in general, inherently focus on the work of others. The author works as a liaison into the intricacies of that which is being criticized; he or she lurks in the background.When it comes to a game like The Witness, the magnum opus of Braid developer Jonathan Blows career thus far, reviews that dont touch on the authors perspective are going to become very dry, very quickly. To get an idea of how bizarre The Witness is, well need to first establish two very important items. First, Blow and his studio Thelka, Inc. have been working on the beautiful first-person open-world puzzle game since late 2008. Second, The Witness features some of the most maniacal puzzle design in the history of video games. A review of this game that doesnt take the authors mindset into account would read like the ramblings of a homeless person with an Ivy League degree and slightly too much LSD.Also, yes, the previous two paragraphs were a golden example of the hokey review introductions criticized at the beginning of this article.We have arrived at the first entry in the official 2016 Tour of the Games Weve Known About Forever. 2016 is set to be a year where The Witness, which was front and center during the PlayStation 4 reveal event, will allegedly be joined by Final Fantasy XV, The Last Guardian, Doom, No Mans Sky, Star Citizen, Mighty No. 9, Zelda Wii U, Below, Fable Legends, Hyper Light Drifter and Inside. If youre feeling daring, you could add the unannounced Sony Bend project to that list. What makes actually playing The Witness truly fascinating is that it feels as though it has seven plus years of intense thought put into it. Jonathan Blow and his team have created a puzzle experience that manages to push the limits of the mind, all while maintaining a laser-sharp focus on its core concept. Its the type of game that simply would not feel as cohesive if it came from a large studio with a two or three year development cycle. The Witness most notable faults also feel like theyre a direct result of the circumstances surrounding its creation.Even though its narrative design can feel pretentious and a number of basic quality of life staples are curiously absent, The Witness is a brilliantly challenging adventure that inspires through intense mental aerobics. If theres one thing that you should know about whats to come over the course of this review, its that not a single puzzle solution is going to be spoiled. Sure, generalities will arise and curious minds might be able to discern the solution if they try hard enough, but only a Grade A Krampus would deliberately steal away the largest draw of The Witness. As someone who is downright terrible at puzzles in video games, despite the number of puzzle games I play, it takes a special game to make me enjoy getting stumped. The Witness builds its magic by forcing players to shift the way they solve problems, so eliminating that thought process would taint the entire experience.Anyone who has paid attention to any of the press surrounding The Witness knows that all of its puzzles are built upon a shockingly simple foundation. Your character finds themselves on an island loaded with bizarre puzzles and structures, and all of these puzzles involve completing mazes where the core goal is simply to get from Point A to Point B. Sure, there are some downright ludicrous twists on this formula; a game where you only draw straight lines for up to one hundred hours sounds like something straight out of the gutters of Steam Greenlight. Take the very first multi-panel puzzle, for example. Its clear that youll have to do something involving a varying arrays of black and white squares, but there are absolutely no instructions on how to figure out exactly what that something is. Furthermore, theres nothing indicating what your reward for success will be. In essence, your goal is to constantly pull your mind out of the dark. In a world where games constantly hold our hands and coddle us, its fantastic to experience a title that treats its players with respect. Granted, one could argue that the occasional frustration that The Witness causes due to its openly overwhelming challenge is actually a negative thing. The issue with this line of thinking is that The Witness would be yet another bland puzzle game if it didnt challenge you beyond what you believe youre capable of. Whenever a game comes around that is perfectly okay with letting players fend for themselves, it gives us a look of what could have been if in-game success wasnt automatically handed to us. On-screen button prompts, tutorials, constant hints and the ability to reduce difficulty on demand are nowhere to be found in The Witness, and the end product is far better for it.So why is a game where you draw paths through mazes after receiving no instructions great, exactly? A great deal of the games that receive critical and commercial acclaim have a solid core concept that is then pushed farther than what was initially evident. Whether youre going through hedge mazes, activating pressurized switches, learning new symbols or messing around with the sun, at the end of the day, youre still solving a maze. Whats more, these solution boards arent simply puzzles. They can be progress indicators, navigation points and a core language. Any maze that you find or activate can be attempted, and walking away carries no penalty. Yes, The Witness is constantly attempting to subvert your expectations, but something familiar is always present. For those of you who, like me, are going to dive into The Witness despite being somewhat puzzle inept, its open-world design is going to feel like a godsend. Not only are you going to have the ability to walk away from any puzzle during your quest to direct lasers towards the islands large mountain, but exploring can often be as rewarding as puzzle-solving. Make no mistake, a great deal of the secrets lurking within The Witness are going to be gated behind puzzles, but exploration can often reward players with more options to focus on. Theres also a chance that by walking around, youll be able to learn rules that will assist you on other puzzles. For me personally, my success came from understanding when to take notes, when to try a new puzzle, when to take a break entirely and when to come back for more. Everything in The Witness is a mystery in some form, and the more mysteries you uncover through exploration, the faster youll be able to progress.Of course, exploring the island wouldnt be half as exciting if The Witness wasnt drop dead gorgeous. At the risk of unintentionally undermining the work that went into making a game look this fantastic, The Witness looks like a modern-day take on the PlayStation-era original 3D aesthetic. Considering that so many gamers are sick of modern games adopting 8-bit and 16-bit aesthetics, seeing games like Grow Home, Volume and now The Witness feature a polygonal art-style has to be a welcome change. The most mysterious island in video games features high resolution, flat textures bathed in a vibrant, powerful palette of color. The secret benefit to a review of The Witness run a bit long is that readers will get to experience even more beautiful screenshots. Every inch of this world feels loaded with care and purpose, which isnt surprising considering its the result of over seven years of effort. The Witness now stands alongside titles like Transistor and Child of Light on the list of the prettiest games on the PlayStation 4. Now, with all of that said, The Witness has a couple of notable faults that manage to bring down its overall experience. Before diving into the biggest complaint here, its worth disclosing an important caveat: I found Braid to be a bit pretentious. Braid features a narrative whose base is strong enough to affect its audience, what with its themes of perception, the ramifications of ones emotions and what it really means to be a monster. The issue is that all of this is undermined through its constant suggestions that something deeper is afoot, whether through deep text passages or Blow himself suggesting that a number of people simply dont understand. If youre someone who finds themselves annoyed by stories that insist on being deeper than they have to be, then The Witness will occasionally rub you the wrong way.The Witness certainly has a core story, which is something that anyone can find out with a few clicks of a mouse. Throughout your time on the island, youll find yourself listening to incredibly well-hidden audio logs voiced by Ashley Johnson and Phil LaMarr, among others. While players will be able to piece together whats happening over time, these audio logs arent something you stumble upon constantly. In essence, youll be spending the vast majority of your time working your way around the island in relative silence, but youll occasionally stumble upon a piece of dialogue that feel vague enough to mean basically anything. The result is disruptive; maintaining focus on a story is challenging when you feel as though youre being intermittently preached to. Blow recently mentioned that The Witness deliberately riffs on several traditional elements of game design. For the most part, its success in living up to this proclamation is without question. It becomes clear, however, that The Witness isnt perfect when you combine its questionable narrative with the absence of a number of basic quality of life components that weve come to expect from modern video games.On the PlayStation 4, The Witness lacks the option to close the game without having to head back to the dashboard and force close the application using the Options button. The console version lacks any semblance of sound options, most notably a way to adjust in-game volume without having to move outside of the application. The most frustrating omission is a camera sensitivity adjustment option, which is compounded by the PS4 versions sluggish right stick responsiveness. Few fixable issues have a way of feeling more awkward than having your view feel exponentially slower than your movement. The hope here is that Thekla, Inc. will sacrifice the pause menus bare bones aesthetic in favor of patching in some of the settings that gamers have come to expect over the years. Closing Comments:Asking The Witness to be a traditional video game is essentially asking the impossible. If the reason Jonathan Blows newest game has been in the oven for nearly eight years is that he wanted to avoid compromising on his ambition, then it makes sense that it would stumble a tiny bit along the way. The Witness is a game that can easily cause players to eclipse the one hundred hour mark and the vast majority of that time is going to be spent engaging with hundreds of brilliantly designed puzzles. While it wont have the industry-shifting impact that Braid did in 2008, The Witness will influence video game puzzle design for years to come.", "date": "January 25, 2016", "grade": 4.0}