{"name": "The Deadly Tower of Monsters", "ref": "https://hardcoregamer.com/?post_type=post&p=188756", "text": "If Mystery Science Theater 3000 has taught us anything  and really, what hasnt it taught us  its that there is still quite a bit of joy to be had in watching old, campy B-movies, even if its just to riff on how cheesy they are. But what if you could actually take all of those kinds of movies, mix them together into one dish, and create a playable video game out of it all? Would the joy still be there? Well, ACE Team has set out to see if thats possible with The Deadly Tower of Monsters, an isometric action game set among the backdrop of the ultimate low-budget 50s sci-fi film. Thankfully, the end result leans more towards The Day the Earth Stood Still rather than Plan 9 from Outer Space when it comes to overall quality. Although if you factor in so-bad-its-good towards overall enjoyment, then that may come out negative andlook, just trust me here, its a damn good game.The Deadly Tower of Monsters is the story of Dick Starspeed, Scarlet Nova and Robot, your average sci-fi trio of lead characters who team up to topple the evil Emperor and save the planet Gravoria from his clutches, which requires scalingTHE DEADLY TOWER OF MONSTERS (cue trailer music). As you might expect, every trope seen in these kinds of films from that era is here, from mad scientists to primitive alien civilizations (that just happen to look like men in ape costumes). That said, without giving anything away, the plot isnt quite that simple and what happens later on in the game is quite an intriguing twist indeed.Naturally, the B-movie aesthetic and sense of humor is The Deadly Tower of Monsters biggest strength. In fact, the whole game has a particularly creative framing device of an old sci-fi film set to be re-released on DVD which the films director, Dan Smith, is doing the audio commentary for. So throughout the game we get to hear Dans various Ed Wood-style insights into special effect failures, maimed stuntmen, his annoyances over people questioning his interpretations of prehistoric monsters, and even handwaving gameplay elements (such as how any gold the characters collect is just magically teleported away). What sells it is just how damn enthusiastic and snarky the guy can be all throughout the game, eager to make films one second but not being afraid to diss his crew the next. Its just a really damn good performance thats worth playing the game for alone.The games aesthetics perfectly play up the 50s sci-fi theme as well. The enemy variety alone is a whos who of classic si-fi camp, including flying saucers, mutant plants, Sleestaks, Dalek expies, and energy beings that resemble the monster from Forbidden Planet hitting the forcefield (a favorite of mine), among many others. The music is also a terrific blend of bombastic over-the-top orchestras and theremin-fueled tunes, and all of the actors ham things up greatly, helping to create the perfect atmosphere along with the plastic props, rubber suits, and general zeerust. Even the little details like visible strings on airborne enemies is a treat to behold.Amazingly, though, the grandest sight to behold in The Deadly Tower of Monsters is the tower itself. It really isnt just a name, because save for a small selection of rooms you enter, the entire game consists of one long, continuous climb up the outside of the structure. At virtually any point, you can look over the edge and see all the way down as far as you can, even right down to the area where you started in some cases. Heck, the game even encourages you to freefall off the massive behemoth in order to explores new sections and find hidden secrets, saving yourself at the last second with your own jetpack in a thrill. And dont worry, the game has numerous ways to allow you to teleport back up the tower to previous areas, so youre never left having to climb all the way up. The point is that theres a real sense of grandeur to everything thanks to the gigantic setting, even with the games short length, and it just looks and makes things feel incredible.Combat is also quite fun indeed. Being a twin-stick action game (or a mouse-and-keyboard action game, your choice), the gameplay is quite simple, as you move, aim, and fight hordes of creatures in a semi-Gauntlet kind of fashion. The numerous guns and melee weapons you unlock are a hoot to experiment with, as they all have their own unique effects and play styles. Trust me, circling around a horde of enemies, dodging attacks, and mowing everyone down with a Tesla-infused electric razor is always a hoot. Each character also has their own unique set of skills, from land mines to chain lightning, and theyre quite fun to try out as well, even if the majority of them are used more for backtracking to and unlocking the aforementioned secrets. Melee combat is a bit trickier to pull off, but it still works quite fine. Plus, no one can resist the lure of an energy whip. The parts where you have to engage in platforming and jump around, though, are a bit trickier thanks to the somewhat top-down view making it a bit hard to judge accurate jumps. In particular, one section towards the end involving a pair of giant satellites will easily end up drawing curse words from anyone. The jetpacks hover ability will save your butt in these cases, though, and there arent too many of these bits throughout the game, though, so it never really becomes too much of a pain.There are few other niggles as well, mind you. For one, checkpoints, upgrade stations, places to swap characters and the like can feel a bit far between at times. Checkpoints in particular have to be noted, as having an enemy knock you off a ledge or landing a killing blow and sending you all the way back to, say, the beginning of an annoying section involving two satellites (seriously, screw that part) can be a pain. And speaking of enemies, the sections where you have to fend off incoming foes that are scaling the tower by peeking over the side are inspired and show off the previously-mentioned impressive view, but having to lock on to the edge of the platform with the push of a button can require a bit too much precision with character position at times, meaning while youre trying to find the sweet spot, the fire-breathing pterodactyls have already reached you.Other bits feel like ACE Team overestimating their own games length and replayability. Not that there isnt a lot to do, even for a game that can take around six hours to beat, but the upgrade systems seem to demand a lot more effort than youd expect. Upgrading weapons almost always requires elusive gold cogs that you have to hunt for and points for stat upgrades are tied into various achievements that you have to earn. None of these are required to beat the game, mind you, and it has the right amount of difficulty as is, its just that it feels odd to finish with slightly less than a third of your characters power having been fleshed out.Closing Comments:Minor issues aside, The Deadly Tower of Monsters is a pleasant surprise indeed and a particularly impressive budget action game showcasing a lot of creativity. The quirky retro cheeseball charm may be the main selling point (right down to having a VHS filter you can use on the graphics), but the gameplay still has quite a bit of meat on its bones as well. So if you have a taste for the days of laser pistols and killer brain monsters, or if you like unique action games in general, check it out. Its work worthy of the Satellite of Love crew (and I mean that in a good way).", "date": "January 23, 2016", "grade": 4.0}