{"name": "Pocket Mortys", "ref": "https://hardcoregamer.com/?post_type=post&p=188360", "text": "Last year we were given Steven Universe: Attack the Light, a terrific mobile RPG that I honestly considered to be a better Paper Mario game than the last actual Paper Mario game. So when I heard about Pocket Mortys, another mobile RPG based on a hit Cartoon Network show (from their Adult Swim block, but still) and one thats a take on Pokmon this time around as well, I jumped at the chance to check it out, hoping that it could be on the same level of excellence.Now, if youre unfamiliar with Rick and Morty, the cartoon that Pocket Mortys is based on, then first it should be pointed out that your unfamiliarity with the show obviously suggests that you lead a sad life. But the basic thing that you need to know is that mad scientist Rick and his grandson Morty go on countless science fiction adventures andyou know what? Words cant do it justice. So heres a link to the Adult Swim site where you can watch several episodes. Go ahead, wet your whistle, well just pause the review until you return.Youre back? Good. Now, oh my god, isnt that show terrific? Funny as hell, extremely witty and featuring some of most creative writing, characters and stories to be seen on television right now.Which, of course, makes it sad that nearly none of that creativity carried over to Pocket Mortys.The setup is based around the shows concept that thanks to multiple universes, there are a near-infinite number of alternate versions of our titular duo. After an attack leads Rick and Morty into an alternate dimension where Morty battling has become a massive trend among the many versions of Rick (and several other alien characters from the show), the Council of Ricks takes Rick Primes portal gun away from him until our demented duo can tackle enough gyms and earn enough badges to challenge the council and defeat them. So the traditional Pokmon setup gets put into play as the central premise and Pocket Mortys proceeds to doabsolutely nothing with it.Yeah. No satires here, no shots taken, no fourth-wall breakage except for one joke at the very beginning. The game is literally just Pokmon with a Rick and Morty skin, so instead of putting a clever twist on the Nintendo classic or poking fun at it, the whole game just ends up feeling like a cheap turn-of-the-millennium licensed cash-in or a fan-made Newgrounds game. Hell, it says a lot about hoe little thought was put into this that the games take on Pokmons rock-paper-scissors elemental battle system is to literally just use rock, paper and scissors for attack and Morty types.But its somewhat unfitting to condemn a game for simply not being what you expected, fair enough. And to its credit, there are several okay things about Pocket Mortys. The controls are simple yet nice, and the on-screen d-pad for moving about the map works surprisingly well on a touchscreen. The combat is effective as well (after all, its kind of hard to screw up a system thats worked for twenty years now), and the graphics are nice, colorful, and bold. The music also consists of a decent variety of sci-fi-infused tones befitting the show, though the random voice clips and in-battle Morty commentary got repetitive incredibly fast (a similar problem was one of the few flaws with the aforementioned Attack the Light as well).All of that is competent, but thats the problem: Pocket Mortys never really aims for anything beyond competent. And this means that when any flaws in the gameplay start to appear, they tend to stick out badly. To start with, one of the few unique things the game has to differ itself from Pokmon is that each new area/dimension to explore is a randomized dungeon with trainer battles, wild Mortys to catch, and various items strewn about, along with a gym leader to defeat as the goal. In theory, not a bad idea, but in execution, this means its easy to wind up with either a string of unavoidable battles (some you walk right into because the trainer and their line of sight were lurking just off-screen) or a gym thats just ten steps away from where you started.That may sound like the difficulty can be inconsistent at times, but whatever the case, Pocket Mortys also gets aggressively grind-y quickly as well, since other Ricks always conveniently seem to be one step ahead of you. Whether you need to boost the XP of your Mortys or earn Schmeckles to purchase the overpriced serums, Morty Manipulators (the equivalent of Pokballs here) and more, youll be heading back to multiple dimensions a lot. But you arent allowed to return to the games hub area with the healing center and day care whenever you want. No, the only ways to get out are to either defeat the gym leader or lose in battle, the latter leading to a tedious unskippable cutscene where Birdperson takes you back to the healing center. So even if youre out of serums and your teams of Mortys is either out cold or low on health, then too bad. Youll need to be forced into battles with enemies seemingly always one level higher than you if you want out. To say it gets tedious after a while may be an understatement (not helped by the Morty battles only having a total of about four attack animations to look at over and over).Speaking of Schmeckles, it shouldnt come as a surprise that a free game like this includes microtransactions. To the credit of Pocket Mortys, though, it at least tries not to shove them in your face, despite the aforementioned inflated prices of in-game items (seriously, you need to win at least four battles to afford even one Morty Manipulator). You can watch advertisements to gain a bit of currency, or you can buy coupons from and for Blips and Chitz machines that contain a variety of random items and a new Morty. However, thanks to the randomized maps, its easy to come across several of those machines in a short distance. heck, on multiple occasions you can wind up with two of them on the very first screen you start at, so it still pressures you into using them. Oh, and theres a crafting system and some side quests where you basically just give characters items you find. If that last bit feels clumsily tacked on to this review, then thats because those gameplay elements are just as tacked on to the game as well.Closing Comments:I should not have to describe anything associated with Rick and Morty as average at best. Heck, the same goes for Adult Swim Games as well. Pocket Mortys isnt even all that funny, because save for a few good lines, the only real joke begins and ends with the title as you try and see/capture all of the weird versions of Morty and battle equally weird versions of Rick. Aside from that, no attempt is made to skewer the Pokmon franchise despite it being ripe with material, or to try and match its gameplay quality. In the end, Pocket Mortys ends up being the video game equivalent of Pirates of the Pancreas: something that had the potential for an amazing ride, but is held back and never gets a chance to shine, doomed to wind up being talked about in unenthusiastic tones. Wubba lubba dub dub, indeed.", "date": "January 21, 2016", "grade": 2.5}