{"name": "Resident Evil 0 HD Remaster", "ref": "https://hardcoregamer.com/?post_type=post&p=187871", "text": "If theres one thing Capcom is good at, its feeding off the nostalgia of their long-running fans. This is a company that was at their prime, at least from a creative standpoint, roughly ten to fifteen years ago. While the developer is far from done creating entertaining properties, most of their fanbase outside of Japan lives off the nostalgia of titles such as Mega Man, Street Fighter and Resident Evil. Over the last year alone weve seen Capcom re-release various older games, for example, Mega Man Legacy Collection, Devil May Cry 4 Special Edition, DmC Devil May Cry Definitive Edition, Dragons Dogma for PC and Resident Evil HD Remaster. Theyre not stopping in 2016, though, as the second original Gamecube exclusive is hitting a new set of consoles (and PC), and is touched up to not only be in high definition, but visually comparable to modern releases. Rebecca Chambers finally gets her time in the sun, hopefully enough to warrant another Resident Evil game, mainline or spin-off, that stars the under-appreciated heroine.The story takes place before the events of the original Resident Evil where Raccoon Citys Special Tactics and Rescue Service (STARS) is sent into the mountains to investigate a set of murders. Players take control of Rebecca Chambers, a member of Bravo Team, who stumbles across an abandoned train and a convict by the name of Billy Coen. This is the biggest issue Resident Evil 0 has: narrative. This was created after the first Resident Evil was released, trying to fill in some of the gaps in the plot, or at least give homage to a number of locations, but what it does instead is make Rebecca Chambers presence more confusing. This is because Rebecca is a somewhat timid and inexperienced character in the first game, whereas in the prequel, she becomes quite accustom to the zombified events. It doesnt help that that Billy Coens story is entirely flat, and while Capcom tries to create more depth for the character, it only ends up creating more questions than it does help establishing him. This is mostly told through CG videos, with the brunt of the in-game cutscenes being action oriented, setting up combat scenarios. It would have been nice to see some of these pre-rendered scenes redone for the new graphics, but for a budgeted remaster, its not entirely surprising Capcom elected to simply scale the resolution up, despite creating rather unappealing CG cutscenes.Outside of the story, another aspect Resident Evil 0 lacks is originality. If youre familiar with the first game in the franchise, youll be right at home because Resident Evil 0 contains virtually the same formula. The only difference is that there are a couple new enemies, such as apes and giant insects that will test the protagonists on their travels. The train at the beginning is the only unique setting, but that only encompasses an hour of the five to eight hour adventure where the rest is the traditional mansion, then underground/catacombs, and finally a laboratory. The partnership between Billy and Rebecca is a nice change in the formula, which set the way for future releases in the long running series. Unfortunately, like a number of Resident Evil titles, the artificial intelligence for your partner can be in question at times. You are able to slightly take control of them with the right thumbstick, but there are times when they get in your way or just wont fully understand what you want them to do.Resident Evil 0 HD Remaster features a brand new set of settings that are more up to date with current gameplay expectations. For one, theres widescreen support so you wont be subjected to a 4:3 image (although its still available for nostalgic fans), along with an alternative control scheme. One of the big issues a lot of people had with older Resident Evil titles was the tank controls; while they are still present, the controls found in Resident Evil HD Remaster are in full force here. Instead of having to constantly turn, the new control scheme focuses on quickly moving around a 360 degree radius. This makes things a lot smoother, even though the camera angles can still be a bother, especially with the new system. There are also multiple types of control schemes to implement. Oddly enough, while our favorite is the more shooter-oriented one, having the triggers act as aiming and firing, there are some slight differences between the console versions. We played this on PS4, Xbox One and PC, and the PlayStation 4 version had these actions designated strictly to the L1 and R1 buttons. This is the complete opposite of the Xbox One version where the triggers take control of the aim and shoot actions. Its the same as the Resident Evil HD Remaster, but the ability to reassign buttons layouts would have been appreciated.The biggest surprise Resident Evil 0 HD Remaster has is a Weskers mode. The iconic Resident Evil antagonist cannot stay dead as Capcom continues to implement his presence in all recent releases. Whether its his heir in Resident Evil 6 or his sister in Resident Evil Revelations 2, theres no getting away from the diabolic Albert Wesker. Fortunately, this mode isnt cannon by any means, but instead is a fun side activity. After completing the main story for the first time, players will unlock the Weskers Mode in which basically acts as new costumes for Billy and Rebecca. It isnt that simple, though, as Wesker retains his superhuman abilities. There are only two new moves, but they make a huge difference. This includes sprinting incredibly fast, and a knockback telekinetic attack that can also kill monsters when timed correctly. Rebecca on the other hand is just purely an aesthetic change as shes given the same mind-control device outfit seen on Jill Valentine in Resident Evil 5. Its a somewhat lost opportunity, but at least the Wesker portion is a nice change of pace and not something expected in a simple remaster.When it was released over thirteen years ago, Resident Evil 0 was a visual showcase. The HD version not only retains this value, but expands upon it greatly. While the remaster of the remake of the first Resident Evil released virtually a year ago to this month was phenomenally done, it doesnt hold a candle to Resident Evil 0. Capcom has not only gone back and redesigned some of the environments to give better lighting, but the character models have been touched up to look a little closer to current games. For example, Rebecca has far more definition and shadowing on her face, along with additional detail to her outfits. Her clothing has also been modified, some of which has been given actual 3D modeling instead of just a plain texture, making things pop out a bit more. The pre-rendered environments also look higher resolution, never really taking you out of the experience. The only downside is that, like Resident Evil HD Remaster, the widescreen mode just zooms in on the picture rather than truly expanding upon it. Itd be difficult and incredibly time consuming to rework each area in widescreen, but its still a notable aspect. Closing Comments:Resident Evil 0 HD Remaster is a fantastic reworking of a solid entry into the mainline series. While there are still glaring issues with its narrative and repetitive progression formula, its not as if Capcom was aiming to completely remake the game from the ground up. The visuals have been cleaned up nicely, giving stronger atmosphere to the already tense set of events. Capcom has even gone as far as to create an additional mode that adds not only an aesthetic change for Billy and Rebecca, but establishes a couple of new abilities at the same time. The new control scheme works great in the remaster, as well, although it can get finicky with some of the unfortunate camera angles. With all the enhancements in visuals and gameplay elements, Capcom has not only set a precedent for how remasters should be done, but helped excel Resident Evil 0 into being a far more enjoyable horror experience.", "date": "January 18, 2016", "grade": 4.0}