{"name": "Taito Milestones", "ref": "https://hardcoregamer.com/?post_type=post&p=421345", "text": "Its not revelatory to say that compilations are a standard practice in current years. If nothing else, with so many of its ilk out in the wild  especially if youre bundling in current-gen remasters/ports to current platforms here  it runs the risk of shining a coarse light on the care and very consideration (or lack thereof) for what these kinds of collections are meant to represent or reflect. For an industry that is, to put it mildly, seemingly indifferent to the concept of preservation  of its own history no less, treasured and iconic in equal parts  some may say this is no grand revelation. Yet no matter what collection springs up, theres always that more philosophical/retrospective-leaning question on what, sales aside, this is meant to cultivate. A highlights reel, an anthology, maybe something more historically important. Perhaps a combination of all three or just none of the above.For the younger generation and maybe so a broader swathe of the video game community, Taito as a brand may not hold the same persistent recognition as something like Atari, Konami or Sega if were limiting this list to companies whose more prominent golden years may be behind them. But a quick name-call that includes the likes of Bubble Bobble, Arkanoid (if not wholly original, an important milestone) and a certain property involving Invaders from space will prove Taito forever remain a crucial player in the grander expanse of video games during the late 70s and much of the succeeding decade. And while Taitos back catalogue  a common theme that pops up in this, the latest compilation from the Arcade Archives series  is very much an ardent drive to refine as much redefine the pull of coin-sapping, wallet-emptying, one more go high-score arcade experiences, one thing Taito Milestones does address in a positive light is the companys refusal to confide in one particular theme.The resulting compilation feels like one intended to be a balance of insightful retrospect as it is short-burst entertainment. And while that balancing of intentions is in one sense admirable, the resulting 10-strong selection feels strong in figurative name only. In fact, you neednt take long upon boot-up for Taito Milestones convincing of its very being to seem less like a celebration and more just some obligatory, marketable product to consider. An archive if you will, to so conveniently tie in with its placement as the latest in Hamster Corporations Arcade Archives series. The compilation offers little by way of dazzling or simply greeting players with some warming introduction or fanfare. It neednt be overblown, but here, only a few seconds upon boot-up, youre immediately thrust into the hub menu that has about as much grace and charm as an internal slideshow reel. The below screen isnt part of the press marketing, this is the actual main menu.Theres just something rather cold and dare I say apathetic to the way the Taito Milestones is presented here. As flawed a package it was, even Konamis Arcade Collection seemed to hold more of a pride and sense of celebration on the basis of how interactive its menu felt. Then of course you compare the semblance of additional material youd almost naturally expect to find in any compilation of this type. To which Taito Milestones offers nothing of the sort; no concept art, no behind-the-scenes details to whet any Taito followers appetite. Comically low-resolution the scans were, at least Konami remembered to explore their own catalogues storied history. Taito, Hamster, ININ  whoever had final say here  appear to have forgotten or simply ignored this aspect altogether. Taking the games themselves out of the equation then, all there is to gauge as to the quality of this compilation is the presentation of its brief introductory menus, cosmetic alterations via filter changes and a few minor save functions that themselves are standard affairs.And while Taito Milestones isnt unpleasant a user experience by any stretch, there are lingering questions to raise on the sterilized look and feel of its menus. Button prompts upon booting up any game met with oversized tables and areas that maybe couldve done with more of a unique or simply sleeker alternative to what were given. Theres nothing wrong with going the minimalist route on its own, but when you correlate the collections generally directionless purpose  other than the suggestion of supposed milestones in Taitos portfolio  you cant help but feel the delivery has played things too safe. An easy comparison to draw upon, but all three of Konamis recent Collection anthologies aimed to showcase the evolution of their respective IPs  in the case of the Arcades Collection, Gradius indirect inspirations, birth and attempted successors. What we have in the Taito Milestones package doesnt necessarily follow a through-line other than the allusion of significant titles. And given the quality of certain games, that Milestones namesake quickly becomes sketchy.Admirable some of these games mightve been at the time, the likes of Alpine Ski, Front Line and Space Seeker come off as heralding one too many design flaws to harbor anything but a novel fifteen or so minutes. Other games like The Fairyland Story and Chackn Pop more forgiving, even if on the solitary basis of their historical importance. That importance being simply to represent Taitos attempt to build on the success  and continuing appeal admittedly  of Bubble Bobble. Whether that was building on the gameplay premise in the former, or merely making the most of the IPs characters/assets through different, if not entirely compelling, gameplay pitches. Chackn Pops surreal floor/ceiling-hopping, labyrinthine puzzle-platforming the type of game that clearly sounded compelling on paper, but whose clunky execution is more than a little wanting.But for every title in this collection that maybe hasnt aged as well or hit its desired stride well enough, there are those titles with surprising longevity. Games whose mechanics, or even just their quirks, make them easy highlights here. That latter characteristic no stronger than in a game like Qix  easily the strangest, in all the right ways, entries in Taito Milestones. The kind of fictional game youd find in some other form of media like television or movies  an even more minimalist equivalent of Tron perhaps  and yet whose basic pitch of covering the screen in a required percentage of self-drawn quadrilateral shapes, offers far more strategy and room for complexity than youd initially expect. The presence of random luck and some archaic traits with its presentation may sully it, but all in all an oddity like Qix  its abrasively-chirpy sounds included  are perhaps one of Milestones brightest spots of investment.Then purely on a gameplay basis, you have 1987s The Ninja Warriors. The youngest game in this collection as it turns out, a game whose interpretation of side-scrolling beat em up affairs is so easy to grasp and whose catchy soundtrack marks it down as one of Taitos quickest successes on delivering a compelling pitch. Even the odd letterboxing aspect, a result of the games format, doesnt sully things too much for its gameplay to win through. So on that basis, with these entries considered, what you have thus far with Taito Milestones may well be the textbook definition of a compilation chock full of diamonds in the figurative rough. One that could very well be described as a deep as a puddle, but at least demonstrates how varied in genre and play-style Taito were. But of course even a compilation as disappointingly non-celebratory as Milestones seemingly feels, needs at least one example to counter that indifference. Its only fitting then, as a personal fan and enthusiast for shmups present and past alike, that an entry in this sub-genre stands as Taito Milestones best. Not just on the basis of it being a great title to replay again and again  the most hours with this collection spent on this single game alone  but as if arguing a case in favor of Milestones existence, a game with curious historical placement.That game being Halleys Comet  a vertical-scroller to sit alongside Taitos more famous, horizontally-scrolling and cult-garnered property Darius. And yet I would be lying if I said that in one mere game, Halleys Comet garners plenty of retrospective intrigue and admiration for all the minor mechanical and visual touches this game professes. Not least for a game sparse on spectacle but surprisingly deep on scale and tone. Be it in its presentation  the sense of dread or desperation as the titular comets close in on the planets youre aiming to defend  the visual indicators such as power-ups subtly being revealed prior to blasting apart specific objects. Even just the very core concept that typical levels act out more as sprints to prevent these comets from reaching their target (as indicated by the bar on the right of the screen) Again, much of this can be put down to ones personal investment in this sub-genre, but if youre looking for a game as interesting to dissect and analyze, as it is to play and replay, Halleys Comet is the stand-out of the ten games on offer here.Closing Comments:Theres no doubting that Taitos back catalogue of 1980s arcade titles still mostly hold up in Milestones. And if you havent yet delved into the companys varied, genre-hopping history, than theres an argument for Taito Milestones being a sufficient if not entirely definitive investment. The main issue is that beyond the selection themselves, there just isnt much of a celebration or retrospective look-back about Taito Milestones to warrant its presence, aside from another obligatory anthology of titles varying wildly in quality and appeal. Not least when these games individually can be acquired elsewhere and without the disappointingly middling attire this package poses. Which is a shame, for if this is your first venture into Taitos work, there are genuinely surprising gems to unearth here. Games that even now can entertain in both their mechanical and conceptual make-up. In what is at times an incoherent and questionable selection of titles  compiled in what feels as drab and corporately sterile an attire one can find  there does remain worthwhile moments to look back on with Taito Milestones.", "date": "April 12, 2022", "grade": 3.0}