{"name": "Zotrix", "ref": "https://hardcoregamer.com/?post_type=post&p=186382", "text": "Space exploration has been a long-standing theme in games and has been around since the early days of single-digit-bit releases. But if youre put off by the complexity of upcoming current-gen titles in No Mans Sky or Star Citizen  or thats simply not your cup of tea  ZeroBit Games aim to please with a throwback that isnt too far flung and instead centers itself primarily around arcade-styled, 8-bit/16-bit shoot em ups with an exploratory mission-based system tying each armada-battling challenge together. On paper, a twin-stick, non-linear, pick-and-choose shooter sounds promising and can still stand up to be a rather enjoyable and worthwhile release.Unfortunately, Zotrixs sum of its whole, let alone its unequivocally shallow gameplay, is so lacking, its hard to even find the willingness to carry through with the multitude of missions  each of which ranked in difficulty with a number. The higher the number, the more proficient and harder hostile forces will be. Sadly this is the only defining deviation between each of the Story modes quests as each mission finds you in a black stretch of space as you attempt to break through the ranks of enemy ships (all of which are designed in a somewhat abstract yet pleasantly vibrant and colorful fashion) that differ in strength, defense and tactics which gives the act of surviving, fortunately, some much-needed scope and breadth. Theres no clear distinction on how far you are from achieving your objective  save for a distant cargo ship that slowly pans upwards across the background  yet despite this, levels end rather abruptly and aside for when and how enemy waves are displaced, theres a distinct lack of design and awareness with the way missions play out.With that said, missions themselves lack variety and act as no more than a non-linear iteration of Zotrixs accompanying Arcade mode. Playing out in a more conventional fashion, Arcades aim is to finish as many levels whilst pitted against endless waves of enemies until your allotted lives are depleted. There are of course weapon upgrades to find but again this potential for variety is cut abruptly short since your third consecutive pick-up counts as the maximum amount of firepower you can hold and unlike classic shoot em ups of the past, your weaponry is limited to a stagnant and repetitively-sounding array of bullet-fire. So its with this where the games trading feature comes into play (or rather should come into play) to help alleviate some of the early woes  allowing a loft of customization and even the ability to trade in resources such as raw materials for other, perhaps rarer, assets. Whats more, with the end goals of certain missions unlocking different outposts and, in effect, offering a wider assortment of items/upgrades/materials, theres at least a discernible end-goal tucked away behind these rather rehashed structures.But once again, Zotrix fails on such hopeful faith by offering up arguably some of the worst menus and user interfaces one can possibly find in a video game. Players will undoubtedly find themselves getting frustrated and running loops with the interfaces horrendous mapping (tapping up takes you left; skimming right pulls you down) and directional placements. Even then, the encompassing design and aesthetic is so incredibly bland and barebones, theres little impression left with the games general presentation. Yet this is a theme that runs through Zotrix and ends up tarnishing its finished product, as it feels anything but. So while the pixellated art and minimalist concept, on their own, do hold a somewhat charming demeanour in principle, the games general design and management emanates outwards as rushed and otherwise forced on the player to work out.There are some comforts to take with the in-game combat. The twin-stick controls are, for the most part, robust and enjoyable, even if aiming does randomly scroll without player input. As noted the variety of enemy tactics and moves do prevent waves of hostiles from feeling as repetitive as the levels themselves. Whats more the soundtrack is commendably befitting of the games bold delivery with its pulsating techno-influenced electronics, though why the game deems it necessary to fade the sound down on its own during combat is an odd one. And given most of your time will be spent holding down the fire button (that is if you can tolerate the lack of sound design and variety in effects offered up), the music can often become increasingly lost and discarded amidst the spectacle directly in front.Closing Comments:There is indeed a one-more-game pull to Zotrixs gameplay and if youre willing to take apart its mission-based structure as slices of a cake, there is a somewhat commendable attraction to the way its resource and upgrade management system plays out like a carrot dangling on a stick. But so little is offered up in the midst of battle and even beforehand with just wanting to set yourself up for the coming battle that leaves a dire and often bitter disappointment with the overall experience. Zotrixs poorly thought-out interface is palpably off-putting on its own. Couple that with its often shallow and empty story arc, and most of Zotrixs content feels like mere placeholder for something that should be arguably more concrete. While the mechanics are enticing, its far from standing out as an otherwise satisfying experience.", "date": "January 13, 2016", "grade": 2.0}