{"name": "Turok Remastered", "ref": "https://hardcoregamer.com/?post_type=post&p=184207", "text": "One of the earliest hits for the Nintendo 64 was Turok: Dinosaur Hunter, but it wasnt without its problems. Coming out a few months after the N64 launched, the games engine necessitated a draw-distance that felt like it was only a few inches in front of the players nose, and this was masked with a smothering fog thats been a gaming punch-line ever since. Turok was also one of the earlier FPSes on console, so the genre was still struggling with controls, and while the N64s analog stick helped, it was still clunky to a point thats almost unplayable by todays standards. Thats 17 years gone, though, and the Turok of today isnt that game any more.Turok (no more Dinosaur Hunter subtitle) tells the story of a stereotypically-designed Native American in a hostile lost world. If theres a narrative in here its left to the player to create, something to do with a quest for pieces of the chronoscepter in a land overrun with soldiers, raptors, lizard-men, robots, and extra-large insects. Thematic consistency is not, as it turns out, one of Turoks strengths. The game is all about killing enemies with a wide range of weapons in large, expansive environments, and if that means a robot is guarding a ruined stone temple, then logic probably got eviscerated by the laser-mounted raptors and wont be missed.Turok is just plain fun from start to finish, in a way that took me by surprise. I played the original game when it came out, and while screenshots look very similar the actual experience of playing it is massively improved. Full mouse/keyboard controls, widescreen and HD support, and almost completely removing the fog have transformed Turok into a game thats finally become what the developers must have dreamed of it being, before hardware limitations got in the way. Fast movement, precise controls, and near-constant 60FPS gaming bring out the best in Turoks sprawling levels, and even the platforming sections work well. Yes, technically the game is butt-ugly, but knowing its origins theres a certain charm in the low-poly designs and blurry textures. Plus its hard to care when youre blasting a quad-rocket into soldier riding a machine-gun-armed triceratops.Turoks two biggest strengths have always been its weapons and level design, and these hold up remarkably well. He initially comes armed with a knife and bow & arrow, and while both of these weapons remain useful even to the end of the game there are a dozen more to find. The pistol, shotgun, and machine gun are as useful as any other FPS, but powering up a particle accelerator blast to freeze then explode an enemy in expanding rings of blue shockwaves never gets old. While its easy to run out of ammo for one type of weapon due to max carrying capacity limitations, theres always something else in the arsenal thats going to be equally effective, although scrolling through 14 weapons to find something useful can take a few punishing seconds in the middle of a fight. Ammo is plentiful, even if its for a gun you might have forgotten about, and there are even alternate types for the bow and shotgun. The enhanced ammo is automatically put into use, so no hoarding, but speaking as someone who always saves the most powerful toys long past when theyd have best been used it feels good to blast the corpses of lizardmen sky-high with an explosive tek arrow.Fun as the weapons are, though, theyre a co-star to the level design, which is intricate in a way that was common in the 90s. These levels dont care if you get lost, but a helpful map plus lots of running around should sort out how all the bits connect. Rooms and arenas can have multiple paths leading from them, and theres frequently no right one to take. The goal of each level is to get all three keys and, if you want to be thorough, an optional piece of ultra-weapon the chronoscepter, and finding everything can frequently take a couple of runs. Each level is large enough to take a good amount of time to explore the first time through but not so ridiculously huge you cant blow through a previously-completed area fast to search out something you missed the first time. This is helped by Turok remembering which enemies youve killed and collectibles youve found, including ammo, and while some enemies will teleport back in with a flash of light and telltale sound effect, with most of them this only happens so many times until youre left in peace to search out secrets. It makes for a nice balance between fast-action shooting and more sedate secret-hunting level tourism.Turoks level design feels as much like a platformer as shooter, in fact, but somehow this works out fine. It helps that, while Turok cant double-jump, he can do a full jump after falling off a ledge. While this isnt particularly useful for long drops, due to the speed of his fall counteracting the momentum of the jump, it does mean that Turok can jump much farther than youd initially think, and many extras and secrets need this technique exploited to its fullest. Honestly, Id hate to imagine wrestling an N64 gamepad around it, but with a mouse/keyboard setup it works great. In fact, it works a bit too well. Several of the bonus areas were designed with the limitations of the N64 pad in mind, and theyre much easier when you can simply point Turok in the right direction and hit Forward. Those thin beams and ledges were much trickier when you had to worry about drifting off due to not holding the analog stick just right. Closing Comments:In order to get the most from Turok, its important to approach it as a remnant of the 90s, rather than a modern game. Theres no avoiding that the graphics are hideously dated, even with the polish thats been applied. AI is weak at best, summed up for almost all enemies as charge and attack, and that includes ones with ranged weaponry. Turok is a fun and playable revival, but theres no ignoring that its a product of its time. On the other hand, that time made some fantastic games, and while Turok was only ever mid-tier at best, the improvements in framerate, controls and graphic effects have improved it immensely. Racing full-speed through the levels, using massive firepower to blast enemies that just get more ridiculous as you go, getting lost in the levels before learning the layouts, and marveling at the best explosion effects 1997 had to offer makes for an excellent round of modern-retro gaming. Turok is a great example of a type of game the FPS genre moved away from, and is actually better to play now than it was in its original version.", "date": "December 29, 2015", "grade": 3.5}