{"name": "Amplitude", "ref": "https://hardcoregamer.com/?post_type=post&p=184097", "text": "Whenever the price of a game comes up, the first thought always ends up being whether or not that is expensive or not. This is a function of being humans who exist in a world where economies exist; everything we spend money on is influenced by perceived value in one way or another. When it comes to video games, value propositions make for juicy article fodder, impassioned monologues and heated debates. This is all well and good, but when it comes to Harmonixs Amplitude reboot, the more interesting point is the appropriateness of its twenty dollar price tag, not whether this is a decent value for this particular product. You see, Amplitude feels like one-third of a full sixty dollar retail experience, and the funny thing is, it has exactly that price point. This isnt meant to disparage Amplitude in any way, as its a rock-solid rhythm game that will appeal to electronica fans, its just something mildly humorous that comes to mind when you consider the whole picture here. Amplitude might not be loaded with content like its much larger rhythm game peers, but it maintains the heart and soul of its beloved PlayStation 2 predecessor in full.The video game industry is loaded with ridiculous euphemisms, but none is sillier than a focused experience. This is a phrase thats only used when talking about the amount of pure content and content variance in a game, and in all reality its a way to avoid saying that there really isnt a lot of meat on the bone. The Order: 1886 is a focused experience, as is Rocket League. While these two games certainly vary in terms of quality, they both contain a small amount of content when you start looking at whats there. Now this doesnt mean you cant replay a game that is content-light, but the phrase focused experience is simply a devious way to hide a simple and indisputable truth. With that said, yes, Amplitude is a game that feels light on content, but the content that is there is engaging enough to suck gamers in and hold them tight. Before diving into Amplitudes content problem, which is essentially its lone major flaw, its worth noting that if you consider gameplay king, then this is the game for you. For those who have forgotten about Amplitude after its meager PlayStation 2 sales and an entire generation without a follow up, it is, in its most basic definition, Rock Band with a controller. Players take control of a self-propelled spacecraft on a number of tracks, each corresponding to a songs individual components, while shooting rhythm gems with either L1, R1 and R2 or Square, Triangle and Circle (for the left, center and right, respectively, of each track). The name of the game here is to get as high of a score as possible by shooting every gem, moving between tracks in fluid streaks and maintain full rhythm at all times. The big disclaimer here is that if youre absolutely against rhythm games, then this is absolutely one of those and youre not going to enjoy it. Still, for those who are looking to get a bit of that classic Harmonix action without having to use cumbersome plastic instruments that will soon collect closet dust, then Amplitude will fulfill those cravings.Theres not a great deal of gameplay more satisfying than being completely in the zone in a game like Amplitude. When that seamless mind-body connection occurs in the midst of a massive combo, the result is a sense that youre a video game demigod. As someone who is admittedly terrible at rhythm games, it was a joy to get lost in a genre that typically causes me a great deal of frustration. This is perhaps Amplitudes greatest victory, as it not only has the tough-as-nails gameplay that experts crave, but its perhaps the most accessible game weve seen in this genre since, well, the last Amplitude. There are no ridiculous dance pads, no arguments over who gets to play the drums and no crazy line at whatever arcades actually still exist. Its just you and your controller and if anything goes wrong, its all on you (unless youre playing local multiplayer as a team, of course). The main draw here is the core gameplay and Amplitudes entire audience is likely going to be made up of people who decide that this is something that they desire. The thing is, Amplitudes central gameplay mechanics are downright stupendous, but its everything else that prevents it from being a true rhythm game masterpiece. Amplitude contains thirty songs, all of which fall neatly into the electronic genre, a fifteen-song concept album composed by Harmonix that makes up the main campaign, a Free Play mode that allows for competitive or cooperative multiplayer, four ships that all function the same, a handful of in-game power-ups, an options menu and a credit reel. Being that the main campaign is only fifteen songs long, its unlikely that the vast majority of players will end up spending more than an hour or two with this mode in total. Because the only other gameplay mode here is Free Play, which does not allow you to create playlists of your favorite songs, thats going to wind up being the section that most players spend the majority of their time in. Even if there was some sort of alternate scoring mode, a more complex way to unlock songs or a way to change how your ships perform over the course of an entire song, it would have been nice to see a bit more meat on the bone here. Yes, this is a small downloadable title with a downloadable price-tag, but it feels more like the content-light retail titles of 2015 than it does an independent offering. Instead of this being the ultimate Amplitude experience, this feels more like Harmonix telling gamers, heres some more Amplitude. This isnt necessarily a problem, but its not ideal.While those of us who enjoy bizarre visuals and weird electronic music are definitely going to be satisfied with a number of the songs available here, it would have been nice to see more licensed tracks across different genres. Make no mistake, there are some enjoyable tracks here, and the thirty-song list does elicit a certain psychedelic vibe, but the original Amplitude was far more expansive (even with its limited track list). Gone are the days where artists like Run-DMC or Blink-182 provide the backdrop for your spaceship-based rhythmic action. Instead, theres a ton of Harmonix-composed tracks which, despite some interesting tracks, feels a bit weaker as a whole than the licensed tracks included alongside them. Being that there are tracks from Insomniac Games and Crypt of the Necrodancer, it seems as though Harmonix could have been a few steps away from diving down a video game soundtrack rabbit hole, rather than compiling a list of decent, but generic electronica with a couple of video game songs thrown in. This could likely have been the result of licensing issues or the difficulty in crafting Amplitude levels around certain musical genres, but the fact remains that this is a title that will disappoint you if you do not like electronica. Closing Comments:If youve wanted to play another Amplitude game for the past generation, then this is going to scratch your itch and then some. Harmonix has delivered a reboot that perfectly captures the spirit and rock solid mechanics of the original, which is something that should be commended. The issues here revolve around the fact that this game, perhaps more than any other rhythm title in memory, inspires players to crave DLC due to its relatively shallow track list and its content-light package. Make no mistake, the core gameplay here is worth the price of admission alone, but if youre looking for a music title that will last you for months to come, then youre going to have to venture into the plastic instrument sector. Maybe this is simply a launching point for the ultimate Amplitude game that will blow us all away. Instead, what we have is a solid palette cleanser that will ultimately inspire palpable feelings of nostalgia and wonder for a fleeting moment.", "date": "December 24, 2015", "grade": 3.5}