{"name": "1000 Heads Among the Trees", "ref": "https://hardcoregamer.com/?post_type=post&p=183351", "text": "1000 Heads Among the Trees has a remarkable premise. Based on a real life experience of the developer, the game is set in a small town in rural Peru. The town, called Cachiche, served as a refuge for witches during the Peruvian inquisition. Descendants of these witches still live in the area today. Taking control of a photographer, the player explores the town over a nightlong exploratory adventure. The gameplay is made up of exploring the town, taking photographs of people, objects and various phenomena. The player can then speak to the various inhabitants about the photos, sharing the images and receiving information about their subjects. It is a truly interesting concept based on what must have been an incredible experience. Its an idea that has incredible potential to be an engrossing and unique experience. Unfortunately, the execution of 1000 Heads Among the Trees does not come close to the conceptualization.The opening sequence is one of instant disparity. The sounds of a busy street wash over you as you stare at a bare, empty street. Over the next minute or so, the sound of a car seems as if it is right next to you, driving past. A sound that we later realize might actually be wind. This realization coming when we noticed that the sound coincided with the blowing of dust across the players vision. A visual effect that we actually noticed while looking into a window. The dust was blowing around indoors. So, yeah. But even with that, its hard to be sure about the car/dust. Such is the quality, or complete lack thereof, of the sound design. People talking in the distance and the occasional note of ominous music make up the majority of the ambiance in 1000 Heads Among the Trees. To mix it up, there is the occasional abrasively loud audio jump scare. So there is that.The level of visual design is not much better. An oppressive fog blocks all view unless the brightness is set intrusively high. Textures are almost completely absent, with the majority of objects a simple flat color. The static (or in rare occasions, awkwardly moving) characters are stiff and discolored. Interiors (only seen as the player looks in from outside) are simply black, with rare objects giving the only clue that you are looking at an interior. Its a strange thing to overlook, as the game seems to encourage the player to look into windows and observe the inhabitants of buildings at every chance. The buildings themselves rarely deviate from a uniform box with a door (not enter-able).At certain points, visual effects are used to conveyuhsomething. Honestly, its not entirely clear what is meant to be conveyed in these sequences. That might be because the first few time these effects happened, however, we were too busy trying to work out why what we thought was a graphical glitch had occurred. To make the overall visual experience just a bit worse, even with the low level of graphical intensity, we experienced substantial frame drops. This with a PC that far surpasses the suggested specifications for the game.Moving on to the gameplay, movement itself was average at best. The first thing we noticed was the high mouse sensitivity. With no obvious way to change it, we were reduced adjusting it manually through the mouses third party control program. Resolving that, we learnt that the player can jump and crouch. Crouching is never necessary, though, and at most only slightly useful for getting a better camera angle. At no point during our playthrough did we find a single instance where the jump was necessary.The overall aim of the game is vague. The player does have access to a journal which gives short term goals to attempt. This gives the player some direction at the beginning of the game. As time goes on, however, the goals become incredibly arbitrary and seem to have little or no contribution to the overarching story. Goals like let your unconscious decide what to photograph next just seem overly interpretive. There is also a complete lack of gratification upon reaching these goals. Their completion seems to serve no purpose other than to cross them off the list.Along with ticking off the various goals, the player character regularly updates his journal. From plot heavy, informative input such as I need to find Don Miguel Angel, a brujo (sorcerer) that owns a restaurant (!) and is going to be my point of contact to fairly mundane observations about things lying on the ground. A particularly perplexing aspect of this is a complete lack of care given by the character when major events come to pass. It seems reasonable to expect that someone who writes about the presence of rubbish on the ground would write about blacking out as a mysterious figure runs towards him; then waking to find an overturned truck, crashed and leaking in the place of his initial blackout. Instead, nothing is mentioned in the journal, and the player is left wondering what the hell just happened. These events and subsequent lack of acknowledgement happen on a regular basis throughout the experience.As the player moves through the town, they encounter a multitude of individuals. Some are named characters, others simply given a title such as Tourist. For a small game, with a limited amount of characters, this seems a strange decision. Especially when the games focus is story telling. Its incredibly hard to get invested into the story of somebody simply known as European Tourist. That is, if they had a story to communicate. In 1000 Heads Among the Trees, interaction with the majority of characters is through the act of showing them pictures you have taken and reading their comments on each picture. The games description describes this as an exquisite corpse-style narrative as you show your photos to local people who spin stories about what they see in them. That isnt quite how I would put it. Showing a character your photos leads them to make a single sentence comment on said picture. That comment is almost always completely irrelevant and a seemingly random-assignment answer generated from a limited list of pre-existing variables that give no consideration to context. No consideration whatsoever. In one instance, the picture of a chicken garnered the response I see a picture of a cloud. Okay then. Occasionally, some unknown trigger would be activated and one of the responses for a seemingly innocuous photo would be given in audio. This audio, however, was in what we suspect was Spanish. Cool.After the initial minutes, its easy to give up on any hope of a coherent dialogue. Interactions simply become an exercise in getting clues to progress the plot, whatever it was. Closing Comments:For a game that has such an incredibly interesting premise, 1000 Heads Among the Trees is utterly woeful in execution. The sound is bad, the visuals are bad, and to top it off, the narrative which is heralded as the focus is horrendous. In the information given about the developer, there is a line that says he generally tries to spend as much of his game development time as he can working away from his computer and honestly, it shows.", "date": "December 23, 2015", "grade": 1.0}