{"name": "A Plague Tale: Requiem", "ref": "https://hardcoregamer.com/?post_type=post&p=428549", "text": "Not to blow ones trumpet here, but theres a part of me that would like to think Asobo Studio have taken to prior comments on 2019s A Plague Tale: Innocence  and its reliance on worn-out AAA cliches  as that of a challenge. Whatever we did in the original, lets ratchet it up with the sequel. It would be a bold move yet one thats in all likelihood to end pear-shaped more times than promising. And sure, the stealth-grass, the scripted chase sequences, the equally-scripted walking segments that grind things to a seeming halt are all here. As they so unashamedly were in the game that, for all the red flags it mightve risen at the offset, somehow made it all work. Credit due in large parts to its story  the ordeal of siblings Amicia and Hugo, on their harrowing, plague-ridden trek across medieval France.But it was in the French studios constructing of such a bleak, oppressive world, broken up by moments of bright and prized optimism, that made the story all that more compelling. And more importantly, made those seemingly-cliched gameplay segments not just tolerable, not just viable, but in fact moments that you could quickly wind up enjoying. Marking the game down in 2019 as one of the years biggest surprises. As noted in that very same counting down of the years best: it was a wonderful example of how high a standard AA development can not only strive for but in some cases, end up reaching. Three years later and while that manner of surprise is unlikely to emerge through mere presence alone, its follow-up, A Plague Tale: Requiem, has somehow found a will and a way to delight in entirely new ways. Expectations were understandably set high given what Asobo had managed in 2019, but now that the surprise is gone, naturally there would be cause for concern that the sequel, drastic shifts notwithstanding, would make a game pitched as a direct continuation of the tale, more formulaic than even its borrowed ideas would imply.Suffice it to say that even ones own similarly lofty expectations  mixed in with such concerns  were not only met, but have been completely shattered in a game that stands as the quintessential sequel: bigger, better, bolder and more engaging on both gameplay and narrative fronts alike. Hooked as I was across the sixteen chapters (seventeen if you include the brief epilogue immediately after the first of the two sets of credits), A Plague Tale: Requiem is a game near-devoid of filler. Even with the momentary technical creases and rare instances of immersion-breaking that stop this years follow-up from achieving perfection, Asobo should be proud of what theyve created. More so, how theyve actually gone about it  doing one better in crafting not just a breakthrough surprise, but possibly one of this years best games overall. As gluttonous with stealth-grass, item crafting and similarly third-person genre cliches this IP may be perceived as to some.In some cases  comically so, as noted  in welcoming a few more of those red-flag taunting AAA tropes that in any other scenario one might roll their eyes at. For one, what if I were to tell you theres an equivalent to the turret section so often popping up one way or another in shooters of yesteryear in here? Yet these sequences  which lead all the way up to the closing chapters  work not just because theyre aptly placed and dont overstay their welcome, but because they fit contextually well into the story underpinning. A story you want to see to completion. To find out just where on Earth this tale is heading in a sequel clearly flexing its artistic muscles in more ways than one given the imagery and scenarios it provides. Not least in the second half that, in keeping things intentionally vague here, certainly goes places. As surreal and occasionally odd such shifts may seem, the game earns its trip towards more supernatural and vividly horror-like visage by way of its more extensive use of color in its environment and level design by contrast. Not that the original was some monotonous slab of varying shades of grey or anything  incorporating an occasional and welcome loft of color and vibrancy to break up its domineering palette of death and disease. But with Requiem, that ebb and flow between surroundings is stronger, mixing and matching aesthetics at a sufficient rate whereby no one environment will grow stale or tired from overuse.A fitting reflection of the storys own balancing of high highs and low lows for Amicia and company to battle through. Bold set-pieces and sequences capped off with sudden turns in circumstance, peppered by shorter or quieter moments that help divide the bleakest spots. Asobo recognize, much like the original, that a tale dominated by such things as struggle, hopelessness and other such negative tones only resonates if its balanced out by contrasting moments of calm, hope and that figurative light at the end of the tunnel. Indeed, in a game where story and more specifically, an expanding on the world-building is so prominent, its hard to go into much (let alone extensive) detail about why the writing in conjunction with its series of locales, houses such impact, without talking spoilers. And given the second half, this is a game whose biggest pay-offs (emotionally, of both positive and negatively-tinged sorts) work best if going in completely blind. What I can say is that the strengths of the 2019 original are once more on full, brilliant show in Requiem; the emotional core at the heart via Amicias and Hugos relationship remains as prominent. Two characters whose own rational and irrational behaviors provide entertaining dynamics and more importantly, three-dimensional status as siblings doing their best against increasing hostilities.So much so that Charlotte McBurney, the English voice of Amicia, deserves stand-out plaudits for just how believable she makes the character. Hesitant as I was to highlight in my review of the original in 2019, McBurneys performance here is nothing short of terrific. A head-strong, determined and competent individual in Amicia, but one still prone to mistakes and weakness of her own doing. And just like the original, one is immediately reminded of a game like Hellblade in how quick you become attached to these characters. In all their struggles, which caps off with a climax even I could not help but utter an unexpected OH! over. So to then add to this performance with a supporting cast both returning and new alike, Requiems success with its writing especially owes much to the characters themselves  and their varied fates throughout  as it does where the narrative eventually progresses towards.But beyond even its writing, Requiem as a game first and foremost  as stealth-oriented gameplay with emphasis on ones constant vulnerability  is evermore engaging to get to grips with, figure out and eventually commend Asobo with their labyrinthine approach to level design. Even the early efforts in its opening chapters demonstrate a natural talent for level design that invites curiosity all the while ready to trip you up should that same curiosity get the better of ones prescribed smarts. Secrets or even just useful short-cuts and alternate routes tucked away around a corner or two. In a game insistent on pointing out every climbable point that exists with some trustee white paint of sorts. Another trope to add to the mix, but another trope whose persistence barely tarnishes what still stands as some truly superb level design throughout. And while the general objective on not getting seen (or at least avoiding a Game Over, be that through humanoid or rat-infested interaction), Requiems set-up now feels like a two-pronged counter against not just the patrolling soldiers and guards, but the ample swarms of rats who again retreat from any nearby light source.Eventually, through a combination of items and abilities both Amicia and Hugo acquire throughout, the very act of manipulation becomes even more ingrained to the core loop that it feels almost surreal that the rats  the same deadly vermin  can shift to temporary ally. Creating a more emergent, puzzle-like approach to stealth where multiple step-forward thinking is even more paramount if you want to make the slow trudge forward safer. Yet none of these mechanics feel mandatory in the grand scheme of things. Its the way Requiem and Asobo have again cleverly spaced out and sprinkled their gameplay environments with opportune distractions, like collectibles or handy crafting materials that are hard to ignore, that gives these settings such staying power. Whats more, with the way game approaches perks and ability unlocks  rewarding you for specific styles of play, whether thats absolute stealth or assassin-like killing as many foes as possible  prioritizing a desired mode of play more so feels like youre building towards something. Its a small inclusion but an effective one that had me, for example, deciding against killing enemies in the pursuit of a helpful perk later down the line. For a stealth game to actively encourage you not to kill  beyond the guilt portrayed all too often in character dialogue throughout  let alone simply provide that as an option, A Plague Tale: Requiem manages to translate that superbly on a mechanical front, let alone tonally.But still you remain vulnerable. A character that can be mauled by a rat infestation if you get either your footing or timing wrong. Or by any humanoid type that after two blows, forces you to restart. Even in its late chapter encounters  humorously falling into the clear a set number of enemies shtick  Requiem, like the original, manages to prevent these ordeals from feeling either mundane or repetitive by offering enough opportunities and enough raised stakes for ones decision to bear weight. Taking down the more brutish, well-armored enemies, requiring an even greater puzzle-solving head in figuring out which objects to interact with, what items to use in conjunction, when to do so and how to reveal that vital weak point as a result. All while two or three other elements are happening around you to keep check of. Even the simplest, ample moments mid-stealth are tense affairs. Deciding, for example, to use ones sling to hurl a rock at an enemy, knowing that said sling creates noise for nearby foes to hear.So for all the talk around story, writing and more importantly gameplay, theres one area that should not go overlooked. An area that can end up playing so crucial a role in any game and here is part the reason why A Plague Tales efforts have and continue to be as memorable as they are. And that is of course its soundtrack, created once again by Olivier Deriviere which, at the perilous risk of making a bold claim here, could well stand as a career best for the French composer. When thinking back to Requiems key moments  or at least the scenes that stick  its hard not to associate them with the music attached. Its rare for a game and its soundtrack to be so intertwined, but if Requiem has solidified any sort of assumption, its that Deriveres approach to strings and traditional instrumentation is A Plague Tale. An effort that goes beyond personal highlights such as his work on games like Get Even and Vampyr, the use of choir and even surprise inclusions like bagpipes in one scene, are hard to ignore and reason enough  if one was still required  why Derivere is arguably one of the best in this industry. Again, even the smallest of touches like the contextual change in strings depending on how close one is to getting spotted mid-stealth, is a nice touch. In a soundtrack chock full of highlights, the musical side of Requiem like so much else present, stands tall and delivers.The only thing stopping Requiem from achieving perfection is in its occasional technical performances. And while the developers have promised a Day One patch will alleviate the locking of frame-rate to that of below 60FPS  even on the PS5  time will tell if the game post-launch can alleviate brief frame stutters experienced during ones time in the review process. A consequence of the bold vision for having as many animated rats on-screen at one time? Perhaps, but given there are no options, like so many PS5 titles, to switch between prioritizing frame-rate and resolution, its a small nitpick that will in all likelihood vary on a critical level from person to person. What may not be as forgiving, if not entirely that damaging in the long run, is the quality of production around the figurative edges of the game. Where the main cast are given plenty of care and detail in their models, that same level of polish and finesse doesnt always translate to the countless NPCs and even environmental textures on show. A few dead-eyed looks and low-quality textures springing up for those keen to stick around a given surrounding for longer than the game deems necessary.Closing Comments:In 2019, Asobo surprised us all with a game that found a way to utilize AAA tropes in the pursuit of a compelling narrative. Three years later, Asobo have not only bested that prior effort, they might well have crafted one of the best follow-ups not just of this year, but of the past few years. Its hard not to understate just how much more refined, fleshed out and expanded in scope A Plague Tale: Requiem both looks and feels. But its because the game is firing on so many cylinders where the former surprise of prior comes flooding back in a sequel that manages to exceed even such high expectations going into this. Terrific story and performances from its cast, smart progression, a compelling stealth-focused gameplay loop, an expanded palette in its visuals and a soundtrack that underscores the roller-coaster of emotion underpinning all of this. A Plague Tale: Requiem seldom loses its footing  a sequel and indeed a tale thats both ambitious and compelling to the very end.", "date": "October 17, 2022", "grade": 4.5}