{"name": "Radiohammer", "ref": "https://hardcoregamer.com/?post_type=post&p=182815", "text": "Radiohammer is what would happen if Jet Set Radio had a love-child with a rhythm game. A somewhat shallow, feature-less rhythm gamebut a rhythm game just the same. Its vibrant presentation, mixed with some solid, but lacking in depth, gameplay make it bite-size 3DS time-killer, but not an essential one, even for those a fan of the genre.Radiohammer originally released on iOS and Android almost two years ago. We bring that up, not just because its priced as such, but because its content is as sparse as such. Thats not to say that what Radiohammer has to offer isnt worth ones attention. In fact, this is a fun little rhythm game. Players start off by choosing one of four DJs, and then take them on a three-episode journey  with each episode containing five songs  to try and top the charts with on-beat timing and impressive manual dexterity. During songs, its all relatively simple: the players cute character is on the left side of the screen, notes come in from the right, and they can use either the face-buttons, d-pad, or touch screen to pound out the desired rhythm. Having multiple control options is great, by the way, and should be adopted by more developers. There are only two lines on which notes travel, though. Theres a top line and a bottom, each corresponding with either pressing up/down or B/X respectively. Theres a third item to keep track of during button-presses, however, and its that of actual presents awarded to the player.Presents are awarded to the player throughout the course of a song, and can be picked up by hitting back on the d-pad or Y on the face-buttons. Capturing these adds to ones score, and in some cases can be obtained in order to fulfill objectives that are given at the beginning of each song in order to rack up an even higher total, but theres a catch to all of this. Bad presents can be given to the player at any given time in the song as well. If the player accidentally picks one of these up  which is easy to do simply because its hard to keep track of the notes and button-presses, on top of identifying if the item jutting in from the far left side of the screen is a good or bad present  then they will lose points. Aside from that, hitting the notes is all basic stuff, however, there are segments of songs where the player can enter a sort of star mode for those of you familiar with Guitar Hero, where all notes hit are considered perfect notes. Normally, a players timing decides if hitting a note is registered as perfect, great, good, bad, or missed; but in this triggered state of star power, all notes hit are are quantified as perfect.Thats the extent of Radiohammers gameplay trappings. Its a somewhat rudimentary rhythm game, really. But, gameplay itself is only one part of the equation in a title like this; much of this kind of experience is derived from the soundtrack itself. After all, a rhythm game is only as good as the tunes it brings to the proverbial table, and in that regard, Radiohammer is a bit of a mixed bag. It has some jams that are quite catchy, no doubt. But the number of those pale in comparison to those that are just okay. Many of the tracks here just feel uninspired, like they were taken from some free licensing song archive for people to use in their WiiWare homebrew game. Its especially disappointing because, from a visual presentation standpoint, Radiohammer is a really great looking title. Its aesthetic just oozes style. Right on down to the menus, the games art direction is incredibly strong, eliciting that aforementioned Jet Set Radio vibe, with its loud, vibrant color, stylized characters, and beautifully wild backdrops. Its certainly the games best aspect, and merely one of the best looking 2D games on the 3DS in many regards. Not to mention, the art really helps give the game an identity, as theres nothing else like it from a purely aesthetic perspective. This is good too, because without it, this could probably be any old iOS game ported to the 3DS hardware.Radiohammer is also short. Not only is it short, but even more frustrating is its over-reliance on the same handful of songs. Because the gameplay never changes from what it presents in the first few minutes of a player firing it up  and because the track listing isnt all that deep players will begin to feel the burn of doing the same things, to the same songs, over and over again. This would be more tolerable if the songs were a pleasure to listen to; but as we just mentioned, theyre really not. The game does include a jukebox mode, random play mode (which assigns random difficulties to random songs), which all extend its life cycle, but that only goes so far when the gameplay isnt terribly challenging or compelling. At least the game has a trophy system, which encourages going back through and mastering songs, but to do that requires playing through those same subpar songs to perfection. And that, friends, is not a good use of ones time.Theres also something of a story here, surprisingly, however the dialogue that bookends each episode is mostly nonsensical. We say that not in a demeaning way, but in strangely endearing one. We should clarify, though, that the story bits included are indeed minimal. Now, that doesnt make them any less effective or at times downright funny, but dont expect anything substantive because in truth, the talking sequences merely serve to explain away who the DJs are and why theyre doing what it is theyre doing.Closing Comments:Radiohammer is cheap in price and gameplay ideas. It doesnt do anything exorbitantly offensive, but never strives to be anything more than a game meant to be played while waiting for an appointment. In that regard, its obvious that this was originally a mobile game that got ported to the 3DS. Its worst quality is sadly the track list, which is both small and bankrupt of inspiration. Its not all bland, though. Its visual style is wonderful and the little story that is included is charming in a minimalist, extraneous sort of way. Moreover, its core gameplay mechanics are perfectly competent; unfortunately, however, theyre also noticeably lacking in depth. Overall, Radiohammer doesnt stack up to the other strong offerings in the rhythm game genre on the 3DS, such as Project Mirai DX or Theatrhythm: Curtain Call, but those games also arent $5.99 like this one.", "date": "December 16, 2015", "grade": 3.0}