{"name": "Big Bang Pro Wrestling (Switch)", "ref": "https://hardcoregamer.com/?post_type=post&p=421180", "text": "We have covered Switchs Neo Geo Pocket Color games to this point and after the all-encompassing collection, it seemed like that might be it. For the most part, SNKs roster of games was well-represented and there werent many big releases unaccounted for beyond licensed games like Pac-Man and Sonic Pocket Adventure. One notable release that wasnt featured, however, came in the form of Big Bang Pro Wrestling  which was a bit like SNKs answer to Capcoms Saturday Night Slam Masters, only with a more limited color palette, a more Fire Pro Wrestling-esque gameplay style, and like Slam Masters, included one prior game character in the form of Eagle, a modified version of Tizoc from Garou while Slam Masters featured Final Fights Mike Haggar.Big Bang Pro Wrestling was released right alongside the peak of pro wrestlings mainstream popularity in the United States in the late 90s, and just after a massive period in both Mexican lucha libre and Japanese puroresu in the mid-90s and does its best to bring some of the pomp and circumstance of the era to a portable platform. Entrances have nice-looking metal sets alongside pyro and look good thanks to all the little touches being included, just on a smaller scale.The game is one that feels more like a late 80s wrestling game in terms of mode selection, with no tag matches and only singles matches offered up in a few different types. Theres a standard match, a casket match and a pole match where you grab a money bag. The pole match itself is something that was an ever-present part of wrestling from the 80s through the 00s, with its money-drawing peak being in Mid-South Wrestling when Ted DiBiase faced Jim Duggan in a pole tuxedo match to a packed house. It kept being used to a far lesser degree under Vince Russo in the WWF in the late 90, WCW in the early 00s and throughout TNAs history in the late 00s before falling out of favor. Surprisingly, Big Bang Pro Wrestling doesnt feature a ladder match despite the money modes money-grabbing mechanic being something that could be turned into grabbing a briefcase or title belt on top of a ladder, but it may have proved too much to ask to try to do a ladder match on such limited hardware. The lack of any kind of cage match is disappointing and something that was featured in a few 8-bit games. It was limited, but players even on the NES could slam foes into the cage and dive off of it. Thankfully, theres more sizzle to the steak than meets the eye. There are no-holds barred matches available that enable things like chair usage  and even doing moves on the chair is neat even if it does no more damage than the floor or mat.The core gameplay is easy to learn, but the timing of everything can be tricky. Its very much like Fire Pro Wrestling from a side-on perspective, with perfect timing needed for various grapples and special moves. Strikes are more forgiving to newcomers as theyre more distance-based and can deal out damage with a single button press. Grapples will lead to instant knockdowns though, while strikes can take more than one depending on whats being done. A basic kick will do a bit of damage, while a massive forearm shiver or flying lariat will send a foe down for a while.There, players can take out enemies with ground attacks either on the mat or in the air. Ground strikes to the mat deal out minimal damage, but weaken the body for submissions  which can be a fantastic way to take out foes quickly. Pins work nicely as well, but nothing tops wearing someone down and throwing them into the coffin. With the rise of inferno matches at the time this game was made, that same mechanic could have been for a basic flame-based match or even an electrified board on the ground, but thats the benefit of hindsight. Whats included is a lot of fun and its nice to have exhibition, tournament, and title-contention modes available. It would be better to have a training mode to help with the exact timing, but luckily, the original in-game manual is always included with the NGPC Selection games and that makes it easier to learn the ropes. Despite it being a two-button game, theres a surprising amount of depth to the gameplay with multiple grappling moves alongside character-specific special moves to take out enemies. Special moves evoke Tecmo World Wrestling with their close-up cinematics to show the characters and the move and help those moves stand out from your rank and file attacks.The roster is impressive, with eight distinct characters to choose from with different styles. Those who enjoy a lumbering brute will enjoy using David Bogner, while those wanting a fast and explosive wrestler will like McDougall. There are a few characters that stand out compared to other games, like the vale tudo specialist Hayama or the Undertake-esque Dietz who lumbers around in a zombie-like stat and deals great damage with his attacks. Those wanting a more technical approach will like Mike Martin and The Eagle offers up a heavyweight Tiger Mask style with more speed than most, but also a fair amount of damage being inflicted as well.Visually, it looks fantastic and right in line with other games on the NGPC. Character sprites are limited in color, but also use a single dominant color to be easy to see and have a lot of detail and lush animation. The NGPC style has aged well here since with only two characters on-screen, more care was given to ensuring that animations are smooth. Things like the flying flipping lariat look great here and in some ways, have more fluidity than even similar animations featured in newer games like Action Arcade Wrestling or Fire Pro Wrestling World. Theres a healthy amount of visual variety for rings and mats as well to help mix things up and prevent the game from looking stale  much like how Slam Masters had an international flavor due to that, the same holds true here.Musically, the soundtrack is fast-paced and impressive, but not all that memorable. The sound effect work is impressive, though, with each kind of strike offering a different level of audio impact. A basic strike sounds minimal, while something like a hard lariat or kick hits flush and sounds like it compacted your opponents jaw. Slams also have a similar scale to them, with special moves resulting in a massive thud while a regular slam does a clear amount of damage but not as much as a special attack. Closing Comments:Big Bang Pro Wrestling offers a fantastic portable wrestling game experience that feels right at home on the Switch. There arent many 8-bit-style wrestling games on the platform, with only Pro Wrestling available via the Switch Online service and no Tecmo World Wrestling as of this writing. The gameplay feel is like those two games, but with more depth and personality. Quality-wise, Id put this above Pro Wrestling, but a notch below Tecmo World Wrestling as far as being an 8-bit-style wrestling game. If you have the other NGPC Selection games and want a pro wrestling game on the go with an SNK feel, this is a great one and works as a nice compliment to the Arcade Archives 3 Count Bout.", "date": "April 6, 2022", "grade": 4.0}