{"name": "HTR+ Slot Car Simulation (PS Vita)", "ref": "https://hardcoregamer.com/?post_type=post&p=181488", "text": "Slot cars were a reasonably-popular pastime in the early 90s. You could go to a local slot car store and either rent or buy a car to race on the track using a game controller-style device as a remote. Despite it being reasonably popular during a gaming boom period, there werent many games produced about it. The RC Pro-Am series from Rare mixed things up by giving you a 3/4 overhead view alongside weapons, while RC De Go! hit the PlayStation long after the fad had passed in the public consciousness. Since that time, its been a dormant genre beyond games that took the RC theme, but nothing else. Surprisingly, no slot car games ever really tried to do a simulation of the events  until HTR on mobile devices.HTR+ follows up on that game with more of everything. The initial release of the game on Steam in 2014 showcased greatly-improved graphics and took HTR from something you could passively play on a phone to kill some time to a game you could sink some time into. This sequel gives you a plethora of modes to play with, including a practice mode to fine-tune your skills and a championship mode. Doing well in championship mode unlocks new tracks, but an argument can be made for the requirements to merely progress in the game being too high.While most games lock progression to a podium finish, you cant get any forward momentum going without first-place finishes. This means that you need to have near-perfect runs just to make any major headway. Luckily, you can at least still earn cash with podium wins  so you have a way to slowly upgrade or buy a new vehicle to increase your chances of victory. It turns a game that is already very challenging into one that can border on being a slog, which isnt a very good fit for the Vita. Its fine to expect some grinding on a PC or console release, but having to do so much of it on the go really kills the fun and pick up and play nature of the game.HTR+ is a simple game to pick up and play, but a tough one to master. The d-pad is used to switch between three angles, while either the left or right stick control the power behind your vehicle, and the triggers reset you on the track if you spin out. Acceleration is controlled in one of two ways  with a touchscreen gauge on the right side of the screen or with either analog stick. Having either one of the analog sticks in play for the power of the vehicle is theoretically perfect. It makes the game easier to play for either left or right-handed players, and should mimic the pressure-sensitive controls of an RC car. Instead, because the Vitas sticks are so small, its hard to really get the acceleration gauge exactly where you want it.If you go too slowly through stages, youll get lapped by your rivals. Similarly, blasting through the stage at full blast will just spin you out of control and force a reset. The best strategy is to always try to take straightaways with max speed until the very end. When you see a turn coming, make sure to lower the speed if you can. Moving down on the stick with precision is nearly impossible though, so you will frequently find yourself decreasing your momentum far more than you wanted to. Fortunately, the mobile controls of touching the gauge with your fingers have been retained. Its a near-perfect control method and if it wasnt for your finger covering up part of the playing area, it would be perfect. This method lets you control your speed intricately, and that is a necessity to survive in this game  let alone thrive. Switching between camera angles is a bit of a pain during races though. None of the camera angles give you a perfect view of the action, either. The best overall is the default angle since you can at least see everything. Another one of the angles is mostly identical, while the overhead angle absorbs you more into the action since youre closer to the cars. The biggest drawback here is that your view is usually obscured whenever youre racing under something. It makes an already-tough game that much harder, and is something that should have never made it past the original release, let alone this port.Fortunately, the camera angles are the only thing that hurt the graphics of HTR+. Compared to the original game, you get far more realistic-looking textures and lighting on everything. Real-time shadows add a lot to the atmosphere, and the sea of headlights that accompany a crowded track during a night race are impressive to behold. Spinouts look good and are aided by solid sound design with screeching tires and collisions during busy sections. The cars themselves usually have intricate paintjobs visible from even the further camera angles, and those do look even better with the overhead camera even if the viewpoint is obscured a bit in the process.The impressive sound design is accented by a fantastic dubstep and pop soundtrack that is unfortunately far too brief. Youll hear some fantastic music in both menus and during races, but only minute-long clips are featured. The songs just loop throughout the experience, and that drags things down a lot. It makes a game that is already tailor-made for shorter play sessions into one that you want to play for even less time with the sound on because of the music  even with strong sound effect work to help offset it. Closing Comments:HTR+ Slot Car Simulation delivers on its name, but is still a highly-flawed experience. Fortunately, unlike most mobile adaptations, it does take the best aspects of the mobile setup and merges them with controller usage. Some of the controller usage is executed well, but accelerating and braking using traditional controls is an absolute nightmare. Luckily, the mobile setup makes the game more enjoyable even if it doesnt do much to reduce the level grind-heavy nature of the tournament play. If you grew up racing RC cars, then you might want to give HTR+ a chance. Otherwise, existing games in the genre will probably scratch the itch for you.", "date": "December 12, 2015", "grade": 3.0}