{"name": "The Mean Greens: Plastic Warfare", "ref": "https://hardcoregamer.com/?post_type=post&p=181791", "text": "The Mean Greens: Plastic Warfare isnt the first game to imagine iconic green and tan army men toys coming to life, but its the first to take them into a squad-based, third-person online multiplayer shooter. Although it features clever map design and varied gameplay modes, The Mean Greens: Plastic Warfare suffers from some critical missing features that might extend its life past the novelty stage.Imagine popular multiplayer modes  deathmatch, team deathmatch, CTF, etc  and transpose them to battlefields designed around familiar household landscapes such as kitchen counters, bathtubs, cluttered craft tables and model trains. That is the central conceit of the game and theres no doubt that The Mean Greens level design is its most outstanding feature. Each level is linked to a specific mode, so that the craft table/deathmatch level is full of hiding spots for sneak attacks and vertical spaces for clear lines of sight, whereas the CTF level in the bathroom has opportunities for sniping from one the side of the tub to the sink. The levels have lots of detail and little clever touches, like ramps made out of toy xylophones that play notes as you walk up or down, and environmental hazards such as gas stove jets. The capture the objective mode on the moving model train is fun and a genuinely new idea. Unfortunately, the actual shooting and gameplay arent quite as fleshed out as the level design. Most squad-based or team shooters have some sort of class-based system, but in Mean Greens, all 6 weapons  rifle, shotgun, sniper scoped rifle, bazooka, RPG, flame thrower  are available to all players from the start and can be switched on the fly. There is also no leveling of classes or players, so while it means that players will never be outclassed by high-level players, it also takes away a lot of incentive for continued play. Having all weapons immediately available also means that the seriously OP flamethrower and rocketlauncher will be used far too often. The game is in desperate need of weapon balancing, and better spawn points.There is no kill-cam, so much of the time it is impossible to know who killed you or where the shot came from. There is no lock on or other form of targeting other than a very hard to see reticule, and hit boxes, hit detection, and aiming are very imprecise and unpredictable. Weapon effects and feedback are almost non-existent. In short, the shooting part of the game is not very engaging. Played with a controller, aiming is sluggish and/or wildly hard to pin down, and there are some platforming elements  well, at least places where jumping is critical  that are frustrating due to the laggy controls.There is no single player component to Mean Greens at all, no story, campaign or practice levels, or bots to fill in for human opponents. In fact there is no tutorial at all other than two menu screens describing basic controls (which are only notated for keyboard/mouse). Sure, theres not much complexity to the controls, as this is a pared-down and simplified shooter but given the relative emptiness of the servers, a way to practice or enjoy the game offline would have been welcome. Team matches are limited to 55, which compared to most recent games, seems tiny. The maps are not huge but in a capture the multiple objective match, a team limit of five makes simultaneous advancement and defense pretty difficult. Just about every aspect of the UI seems bare-bones, from what you are able to do  pick a server and vote on a map between matchesto the static loading screens.On a midrange PC, the Unreal engine-powered game sputters and chugs with framerate issues, texture pop in, and lots of clipping problems. Crashes are pretty frequent, as are UI and control glitches and inconsistent server browser behavior. The bright and colorful levels have some clever touches, but the little soldiers arent terribly well animated or interesting to look at. Mean Greens just looks and feels like a game that wasnt fully cooked before being served. Conceptually, there are some inconsistencies  why, for instance does the player drown/die when falling into the tub of water, yet there are some levels set inside an aquarium where it isnt an issue. It might have been cool to have some sort of story or campaign, just some way of explaining the world and how the levels move from room to room.Closing Comments:The Mean Greens has a strong core concept, but wrapped around it is a game that feels a few major patches short of its potential. Levels are clever and gameplay modes are varied, but the shooting is imprecise and lackluster and without specializations or level incentives, there isnt much reason to keep playing. Sure, real toy army men are featureless and anonymous blobs of plastic, but it isnt that fun to be one. The developers have promised a continued flow of new levels and even vehicles, but there are some serious technical and gameplay issues that are in more immediate need of attention. The modes that require less team coordination, like deathmatch or capture the flag, are more successful than those that depend on an often uncommunicative and less than full squad. Its a great idea with potential, but it isnt a great game.", "date": "December 11, 2015", "grade": 3.0}