{"name": "Moss: Book II", "ref": "https://hardcoregamer.com/?post_type=post&p=421126", "text": "Polyarc introduced the little mouse Quill to the world with the original Moss. This VR title was touted as being one of the best, as it focused on its set pieces, story and environment interactions to create a unique platforming experience for the VR world. Polyarc has now introduced the sequel with Moss: Book II, which doubles down on what made the initial game great, but plays it safe in other areas that could have been expanded on as well. Its also only available for the moment on PlayStation 4 (PS5 with the camera adapter), which could be unfortunate timing due to the PSVR 2 set to launch later this year.Moss: Book II takes place immediately following the story from the original game. After saving Quills uncle, Argus, Quill hopes to shut down the Arcane altogether. The castle remains the main focal point of the story as Quill will teleport across six areas that are broken down into different chapters and separate books. You are the reader while the story is told like an old fairy tale storybook for children. I will say, however, the setting is dark and grim along with the story. I wasnt prepared for some of what happened throughout it.What made the original so special was the interaction between the reader (you) and Quill, along with the puzzle solving and platforming. Polyarc has dove deeper into every aspect of what made the first game so great and creates a more encompassing experience this time around. Quill will unlock abilities that can be used to reach specific areas that cannot be reached the first time. Scrolls are also spread out across the levels and going back through each level to reach locations adds more length to the game. The puzzles start out simple, but these do get more difficult down the line as I found myself getting completely stuck a couple times. Playing the Moss games just requires the DualShock 4 as opposed to using the Move controllers, so technically it can be played sitting down. There are limitations due to the hardware design being dated. Some of the set pieces are large scale and require either reaching or aiming at objects, while some of the more far off ones were difficult to properly get due to how the controller is tracked. One of the unlockable weapons (yes, there are a handful) is a projectile and along with another that requires aiming for direction, the execution wasnt always precise. There were times where I thought I was doing something wrong and not thinking the right way to solve a puzzle using one of these ways, but ultimately it felt like dumb luck getting to where I needed to be. Theres also times where I would accidentally launch Quill off a cliff due to this issue.While its nice to have weapons, armor and ability upgrades, these are few and far between. Yes it adds to the experience, but this could have gone deeper to add variation. These upgrades dont need to be the likes of a looter shooter and yes these specific upgrades are tied into progression of the story, but it just feels like a tease of what could have been with the combat. There are new enemy types in there and they can be hijacked to either solve puzzles or do your bidding with their weapons. Using some of these enemies as weapons is the most efficient way to handle situations. The actual combat scenes still remain spaced out with less than a handful of boss encounters tied in. These encounters are magnificent, however, as you need to plan how to handle the bosses. As mentioned, the story and some of the set pieces are grim, but they all look fantastic. Moss: Book II may be more atmospheric than the first title, with eccentric colors and lighting to help boost this world even more. There are sections of the game where you arrive on a set piece just to progress and you will stop and get lost in the details. The game is the best-looking title on the PSVR when using a PS4 Pro, but the screen door effect remains. Theres a winter level and an area that mimics the Great Northern Lights, and with the sense of scope that VR creates, these areas look fantastic. The animation of the player models, especially Quill, are extremely lifelike just due to the fluidity. These games truly do feel like youre playing on a toy set with figures; that or it just makes me want toys.While all the virtual reality design and integration along with the story is fantastic, the most underrated aspect of the Moss franchise has been the musical score. The music is beautiful and perfectly fits each scene. Even though the second game comes off as more dark, it is added to this by the soundtrack. The voice acting remains as one narrator speaking in different voices much like someone reading a bedtime story like a family member would. Its the musical score that truly stands out, though. Closing Comments:Moss: Book II builds on the revolutionary platform VR title that the original was, but ultimately keeps the game safe and grounded without letting it get out of hand. There are aspects that I wouldve like to have seen or more upgrades or weapons just for some variation, but whats here does work based on the pacing of the game. Moss will always rely on its story and the pacing of that story rather than providing more combat options. The big question for me remains with the timing of this release as one has to ponder if we could have seen an even deeper title if Polyarc lined up Moss: Book II as a PSVR 2 launch title designed for that machine. Moss: Book II is an excellent title to close the book on the original PSVR with despite hardware limitations coming into play. If you loved the first title, youll undoubtedly enjoy the sequel.", "date": "April 5, 2022", "grade": 4.0}