{"name": "Deadpool (PS4)", "ref": "https://hardcoregamer.com/?post_type=post&p=179253", "text": "If the past couple of years has shown anything, its that making new games can get expensive. To shore up their resources and get new fans introduced to long running franchises, the HD re-release has been doing pretty well. Typically, these bundle up everything that has been released for a set of games, do some touch up work, and release it to the masses. Some are done better than others, of course. The Nathan Drake Collection managed to be a high mark. There were some that had some issues, such as the crumbling of the ambitious multiplayer in The Master Chief Collection. While that was a disaster, at least they tried. Sometimes, though, publishers dont put that much work in. Such is the case with Activisions re-release of High Moon Studios Deadpool. There is fun to be had with the experience. Wade Wilson, known as Deadpool, presents the perfect character for an exercise in stab-and-shoot catharsis. This is a character that is known for a good old dose of the ultra-violence and High Moon captured the spirit well. Body parts will fly, heads will mist after a well placed shot and Deadpool just finds this all hilarious. His constant stream of one-liners and his inability to take any of the peril seriously not only captures the spirit of the character, but taps into some strange part of the action gamers id. Plot doesnt matter. Murder does. So much so, that the expository cutscenes that take place are simply excuses for the hero to ham it up, not allowing the guest stars to say their piece. The scene with Cable certainly holds true. Some may feel that Nolan Norths characterization tries too hard, but given the choice, too hard works better than not hard enough.While this lackadaisical attitude towards the plot works for the tone and humor, it should not transfer over to the port work. With the exception of the crashes mentioned in our review of the original release, it seems that nothing has been done to upgrade this version in any meaningful way. This is a profound disappointment. This release could have been a chance to fix up what held this game back previously, but in actuality, it is simply a quick and dirty port of the PC version. There are a couple of additions. First, the game runs at 1080p. This doesnt manage to make too much of an improvement. The texture work was spotty at best. The colors tended to be muted and the overall appearance is muddy. The bump in resolution does nothing to improve upon this. This is to be expected; there is only so much that can be done without a complete overhaul of the original work. The second addition is the inclusion of a couple of challenge maps and costumes that were DLC the first time around. Considering how this is a six or seven hour title, it could have benefited from more content.The glitchy camera and jumping controls remain. When Wade needs to perform any sort of platforming, patience is needed. Falling is pretty much a guarantee. Though he has a double jump ability to allow for extra height and trajectory corrections, the whole affair feels way off, and not to the high quality of standards that High Moon is able to produce. The camera also tends to be a more worthy adversary than any enemy in the game. It tends to freak out and lose our merc in a mess of enemies. Since this is supposed to be a fast paced game starring a hero with the ability to teleport short distances, this needed more love that it did not see.This title could also have used some minor tweaking to its upgrade system. Through combos and collectibles, points are accumulated to be spent on new weapons, ability upgrades, and so on. These systems are great for adding a sense of progression and encouraging skillful play for a higher payout, using the games systems for the mixing of melee and gun play to their fullest effect. It is possible to squander these points the first time through by the sheer virtue of not knowing whats ahead. There was a section where I had to defeat two minor minibosses for which I was ill equipped due to pouring points in health and weapon upgrades that had no ammunition available in this area. This lead to a tedious battle of attrition that was more frustrating than fun. The hit and run methods that should have worked were rendered useless as every time one boss was not attacking, the other was.Closing Comments:Having missed this title the first time around, there was no small amount of glee at the prospect of jumping in with the gussied up version. It is with profound sadness that it must be reported that this is a barebones port of an already middling game. I will admit to playing with a huge smile on my face when I first entered this title, enamored with the silliness and devil may care attitude. Looking at what is actually on offer, though, a feeling of having been taken advantage of rises to the surface. This is a two-and-a-half-year-old title brought to current-gen consoles with minimum effort at close to full price. The entire project seems centered around getting something out there ahead of the upcoming movie. For those who have not played it, it is worth a look, as despite its flaws, a dilly of a time can be had. Just focus on either the PC or last-gen versions.", "date": "Bohn on November 25, 2015", "grade": 2.5}