{"name": "Gems of War", "ref": "https://hardcoregamer.com/?post_type=post&p=178995", "text": "For lots of folks, casual games like Puzzle Quest are as deep as they ever go into gaming, but the fact is that even so-called hardcore gamers often have a secret passion for them too. So its always cause for at least a minor celebration when a good, free-to-play puzzle game comes along that has some depth and still satisfyingly scratches the casual game itch.Gems of War is a familiar type match-3 game with a robust outer layer that helps give the game a nice, substantial feel. Its played on a compact 88 grid and there are various colored gems that represent fire, magic, health, earth, attack and armor and of course by matching them the player scores points against the opponent. Matching four or more gems earns all-important extra turns so theres an immediate strategy of trying to plan moves ahead and look at the board defensively as well. Like Puzzle Quest 1 and 2, Gems of War layers on a role playing component. The goal is to build an army of leveled-up warriors, mages, and other specialists, up to four of which can be played at a time and freely switched between as their powers become available. If all four members of the team are defeated its game over, but as long as one holds on there is chance to win. Characters level up but their specific skills dont change.Players move over a large map with seventeen different Kingdoms to eventually unlock and visit over the course of the game. At each Kingdom stop along the way, there is a choice of game modes. There is the Quest/Story mode which presents a number of levels culminating with a boss fight. There are Challenges, which are matches that earn Souls and the chance to level up characters. For each Kingdom there are 35 challenge matches  Gems of War has a lot of content! There are Arenas and Treasure Map modes as well. The games optional multiplayer components extend the game even farther. By paying a bit of gold, players can invade another players game and if they win, their entry fee is doubled. There are also persistent Guilds. Completing Guild tasks and challenges earns lots of in-game goodies for its members.Free to play games have a nasty reputation for constantly hectoring the player for real-world money, but one can easily enjoy Gems of War without paying anything and the game is happily unobtrusive. Gold is the in-game currency that unlocks PvP or PvE battles but a reasonable amount of gold is earned by completing matches and challenges, so only players looking to really power level need to consider ponying up cash. Closing Comments:The Match-3 genre is one of the stalwarts of the casual game space, but all that means is that there are plenty of bad products trying to grab the attention of unwary gamers. With its depth of gameplay systems and huge amount of single and multiplayer content, Gems of War is one of the best across all platforms and one of the few high-quality casual games on current gen consoles. It isnt the most beautiful or artistically consistent game in the world, with an art style that could be charitably described as generic high-fantasy. On the other hand, it is a free-to-play game that rarely reminds the player that they could or should be paying real money.", "date": "November 24, 2015", "grade": 4.0}