{"name": "Bloodborne: The Old Hunters", "ref": "https://hardcoregamer.com/?post_type=post&p=178825", "text": "FromSoftware has carved out a section of the gaming industry for themselves, and while it started off as a niche category, they gradually made it into a global phenomenon. The Japanese developer has been iterating on their hardcore, methodically structured fantasy role-playing games for the past seven years now, but in 2015, we got their biggest leap yet both in tone and pacing. It was what gamers around the world needed; while a lot of games nowadays hold your hand throughout the course of a campaign, Bloodborne does the complete opposite of that, letting players loose into a vast Victorian-esque world ripe with adventure. It certainly helped that it was far quicker than weve come to expect, making the protagonist look stylish while cutting their way through hordes of diseased creatures. Due to its success, FromSoftware has elected to create additional content for Bloodborne, establishing a more nightmarish world than ever before. It may not be the longest piece of downloadable content, but it helps expand the lore.There are five bosses throughout the campaign of The Old Hunters, one of which is a reworked version of the Cleric Beast. Fortunately for that boss, what has been modified, specifically the second form of it, makes it a far more creative fight. Thats the case for all the bosses in The Old Hunters as their second forms add variety to an easy to pick-up pattern  at least generally. With the addition of the new bosses comes a new patch into the main game where NPC allies can be summoned into a session to help with a boss fight. In The Old Hunters, they become incredibly useful for two bosses in particular, but only in their first form. After they transform, they are essentially disposable and will be killed faster than you can pronounce their names. The fabled Ludwig is the first of many bosses in The Old Hunters and hes a doozy to start things off. Ludwig was regarded as one of the top hunters, wielding a heavy Holy Sword that the player can find in the vanilla game. Unfortunately, because this is essentially a nightmare both in form and name, Ludwig has transformed into a gruesome beast that has zero trace of humanity left. He is not only gigantic, but incredibly fast, making him a dangerous force for any player. His first form is erratic, making it a little difficult to predict his movements and attacks, but he transforms into something significantly easier to chew halfway through. Without spoiling too much, the second and third bosses are fairly straightforward encounters. The first requires managing multiple enemies at one time, with only a single magical spell outside of their one dimensional attack structure. The second, though, is far more interesting due to her skill adjustments. She is a humanoid character wielding dual blades, making her an easy target for parrying. She changes forms two times throughout the fight, one of which extends her reach, and the other adding an elemental ability to her blows. She is by far the most fun to fight because of the diversity in her attacks, trying to time and figure out where the appropriate safe zones are located. The last boss outside of the adjusted Cleric Beast is just a disgusting wreck of a monster who has similar traits to his predecessor. He not only is easy to counter in the early goings of the fight, but has range at his disposal. Overall, these five bosses are what players should come to The Old Hunters for, as while the new areas do breathe life into the nightmarish world, it pales in comparison to the creative new opponents.Unfortunately, one of the more disappointing notions with Bloodborne: The Old Hunters is just how dry a lot of the content can be. There are essentially three new areas to the expansion, one and a bit of which are just an adjusted existing model from the vanilla release. Even one of the new areas, the Research Hall, is fairly straightforward, taking no time to get through and containing few interloping paths. With that said, its format does change halfway through and there are some interesting lore tidbits spread throughout, but even then, its a repetitive and dull area to be in. The final area, though, located in the Fishing Hamlet, is what weve come to love from not only Bloodborne, but the Souls series in general. Its a massive area that spans far outside of its core setting. Its made up of three locations, one of which is a series of tunnels underground, ensuring for some verticality in the level design. They even throw in some rather disturbing new enemies, specifically the snail women and magicians that cast lightning, which seem out of place in an isolated cavern. That with the fish inhabitants and ogres creates an eerie yet fascinating setting well worth exploring. It feels like most of the effort went into this area while the rest is a little underwhelming. Outside of the new areas and bosses, there are a few weapons added, most of which are unique to experience. For example theres a spiffy heavy hammer that has the ability to add a fire element, an extension of Amygdalans Arm, essentially the Moonlight Greatsword from past Souls games, and even a parasite that focuses on the Arcane skillset. Theres also a multifunctional bow that can be used up close or at a distance, although letting loose an arrow does require a great deal of stamina and a Gatling Gun youre somehow able to carry with one hand. Oddly enough, FromSoftware even throws in a new shield thats can be somewhat useful in one given spot, although Bloodborne is still not a game that needs one. Regardless, theres a variety of weapons to be found here, not to mention a scattering of new clothes to fashion your character with.Finally, there are a handful of new crazies that populate the world, although a good deal of them are re-skinned or reworked versions of existing enemies. For example, there are pronograde fish that are basically dogs, and while not entirely the same, some of the barnacle infested creatures in Fishing Hamlet throw spears instead of shoot guns. The ogre creatures are by far the most unique, jumping forward face first (literally) and some of them even wielding giant anchors. There are also these disgusting, big-headed patients that slurp on brain fluids who, while hit hard, constantly flock together to will run the player into the ground fast. Lastly, because this is a hunters nightmare, there are a lot of hunters that are situated in the world, most which wield the new Beast Cutter that acts as a cross between the Saw Clever and the Threaded Cane, or the Boom Hammer. At first they seem daunting, although helping slaughter other enemy types, they are easy to kill due to higher stagger vulnerability. Regardless, theres enough new enemies to like here, even though theres a fair amount were all too familiar with. Closing Comments:Bloodborne: The Old Hunters is a solid add-on to an already outstanding game. While it fails to try anything new and is relatively short, the bosses make this something worthy of trekking through, especially for existing fans. Theres a bevy of weapons to add to your arsenal, additional lore to accumulate in your journal and luscious environments to keep your interest. Its a shame the majority of the new areas are rather straightforward and the standard enemies dont really offer much of a challenge, but theres something about figuring out the strategies of each boss and exploring every nook and cranny of the world that will leave you satisfied. Theres a masochist in everyone and Bloodborne: The Old Hunters helps bring it out in people.", "date": "November 23, 2015", "grade": 4.0}