{"name": "Valhalla Hills", "ref": "https://hardcoregamer.com/?post_type=post&p=178737", "text": "While it sounds a little like the name of a retirement community in Florida, Valhalla Hills is actually an economic simulation/city building game from developer Funatics and publisher Daedalic Games. When it comes to Viking-themed games  and there are many  it seems like they come in one of two flavors: violent and action-oriented or cute and funny. Valhalla Hills falls firmly in the latter camp. You play as a young Norseman, ousted from Valhalla and Odins good graces for not being a manly enough, mead-swilling, axe-wielding Viking, instead spending your time on using your godlike power for building. You are summarily sent to Earth, tasked with building towns and then portals through which real heros may enter Valhalla.From the bright, cartoon landscapes to the roly poly design of the little villagers, Valhalla Hills doesnt take itself too seriously, which is not to say the game is simplistic, shallow, or easy. In fact, there are a number of interconnected systems to monitor and master. Each level begins with a procedurally generated landmass and the players task is to build a thriving community that will eventually  either economically or militarily  unlock the magical portal and the rainbow bridge to Valhalla. Like The Settlers, the player does not directly control the little Viking villagers, instead controlling where buildings are sited, the types of buildings, and the optimal paths between resources and structures. The population is autonomous and while the player may lay down a series of building sites, the workers will determine the build order. A good strategy is one that does not give the easily distracted villagers too many options.While each level invariably requires an early build sequence that includes finding a source of raw materials and food, then crafting a workshop and tools, once the basics are established the choice becomes how to deal with the monsters or hostile warriors that spawn through or guard the portal to Valhalla. The military option requires building barracks and forging and upgrading weapons, which of course require advanced workshops and rarer materials. Less bellicose players may choose to build a series of temples to control and placate the enemy, but that path also requires an escalating series of constructions and upgrades. Both strategies are viable options and on the middle and later maps, both require a vibrant, well-managed economy. Valhalla Hills has two basic modes: a campaign mode in which structures, upgrades, and game systems are introduced slowly, over a number of progressively larger maps; and an open mode in which all options are available from the start  as well as all monsters and other enemies. There isnt much of a story beyond the opening cinematic that explains the premise, and while tooltips pop up every time a new structure or mechanic is introduced, neither is there a tutorial proper. Experienced players of The Settlers or other city builders can probably intuit a lot what they need to know, but it will take all players some trial and error and less than optimal results before the systems become clear.The little Vikings  they all have names and stats  are adorable and fun to watch as they go about their business, working, sleeping under a tree at night or stopping to gossip. But they can be maddeningly unpredictable and easy distracted, taking the longest possible route to where they need to go and not always taking the initiative. Placing structures in just the right proximity and spending a lot of time hand-crafting paths between resources and buildings helps but doesnt entirely solve the pathfinding problems.Visually, Valhalla Hills radiates charm, with highly stylized, picture book graphics. The abbreviated day and night cycle is particularly lovely as the sunrise and sunset wash over the mountains and the glow of the villages lights shine warmly in the dark. Theres not much voice work, but the appealing musical score is a jaunty mix of Celtic and Scandinavian folk influences. As the game has moved through early access towards its December release,the developers have made significant additions to the numbers of structures, tools and weapons, and some of the end game rewards, as well as tweaking the balance. DLC is promised and is included in the deluxe edition of the game. Closing Comments:Its hard not to be enchanted by Valhalla Hills and its beauty is more than skin deep: there are some relatively complex and robust systems and challenges underneath its charming presentation. Lacking a real story-driven campaign, multiplayer support or even a map editor, however, it falls short in both breadth of content and long-term sustainability. Whats there is fun, and DLC is on the horizon, but the package is on the light side.", "date": "November 22, 2015", "grade": 3.5}