{"name": "The Witch and the Hundred Knight 2", "ref": "https://hardcoregamer.com/?post_type=post&p=295492", "text": "Nippon Ichis The Witch and the Hundred Knight is an odd experiment in action RPG mechanics. The PlayStation 3 title isnt lacking in new ideas for combat mechanics and various systems, but its also famously unforgiving and buggy, holding the experience back from reaching its full potential. Nippin Ichi made good with a PS4 re-release with the the title in The Witch and the Hundred Knight Revival, allowing the audience to see what was intended. Reaction was mostly decent, with there being almost a sense of relief that it wasnt terrible. With this reaction, the developer has gone to the well again producing a fresh sequel centered around a new witch. While there arent any problems with game balance or bugs, it provides ample reason why the studio should have counted themselves lucky with Revival and let the series remain a one off.Plot-wise, the game centers around Amelie and her sister Milm. Milm was afflicted with the dreaded Witch Disease, a malady that causes the victim to develop a third eye in her forehead. When the eye is open, the person becomes a powerful witch and a threat to society. Turning to the Weisse Ritter, a religious organization that specializes in curing the curse, Amalie finds herself working to become a high ranking member while Milm undergoes treatment. The surgery wasnt successful, however, and the witch alter ego comes forth and gives life to Milms Hundred Knight doll that serves as the player character.This tale serves as the main draw of The Witch and the Hundred Knight 2. While the dialog is twee as all get out, it isnt afraid to attempt to draw humor from dark or controversial places. That desire, the willingness to go there, is interesting even when the story falls flat on its face. Its not often to see a vivisection serve as the starting point for a comedy scene. Its just too bad that the writers couldnt stick the landing, relying on the subject pointing out that shes not having fun and Hundred Knight being uncomfortable with assisting. The jokes that do land tend to rely on established tropes, such as a man-sized, cross-dressing raven that is absolutely flamboyant. Okay, the man-sized raven part isnt stereotypical, but the flamboyant cross-dresser part is. The wife and I found great amusement riffing on some of the moments in this one, so it might be better played with a sarcastic friend. While the story and set ups keep the butts in seats, actually playing the game feels like a chore. Like the previous game, this is an isometric action RPG centered around loot. The player sets up their own combo attacks by equipping a weapon in each slot. On the surface, this is cool, but in practice, its hampered by the fact that each weapon can only be equipped once. So, if there is an area swarming with hard-shelled enemies and there is only one decent hammer available, its best to slap that bad boy in the first slot and swing it slowly, which makes level progress laborious. Of course, since there is a timer constantly ticking down in the form of the GigaCalorie meter, and the only consistently useful way to refill it is by making use of the combo system and the finishing Desura attacks, that might not always be feasible. For the record, the player can find cookies or bread or digest items, but food is rare and items dont refill much. It just feels tedious.Adding to the tedium is the weapons upgrade system. Eventually, the player will be able to equip three Facets at a time that can be switched through at whim. Each Facet provides different advantages and quick skills and require their own weapons to be set. Again, there is no duplication allowed, so that means there are fifteen different weapons that the player must keep upgraded or swap out when a new one becomes available in order to stay at peak performance for handling the progressively more difficult challenges. Frequent trips to the upgrade shop, the Alteier, with five to ten minutes spent each leaves the player staring at the inelegant menu, sorting through all sorts of garbage. The best way to describe the experience is ponderous. Environmental tile sets and enemy designs see a ton of repetition, not even upping the ante with interesting enemy pairings to keep players on their toes. Boss fights tend to be battles of attrition where the player is doing their level best to keep the GigaCalories up while slowly whittling down the bosses overlong health meter. Save points are few and far between. Even the story segments can go too long without providing the opportunity to save, which serve no purpose in this day and age for a game of this type. This is a huge problem for The Witch and the Hundred Knight 2 as a little bit goes a long way.Its not exactly a looker, either. The visual novel style cutscenes are drawn well enough, featuring expressive characters and nice centerpiece screens for pivotal moments. In game, though, the character models have a flat, bland look reminiscent of a subpar doujin game that managed to sneak onto Steam. Uninspired enemies meet mostly uninteresting environments to create a visually-forgettable title. Now there are some exceptions. Isabel, one of the bosses, looks alright, as does a thorny plant enemy. A few more are peppered here and there, but its easier to note the exceptions. Finally, theres the music. A special shout out must be given to the chirpy, cheerful tune that plays while the Hundred Knight is dancing at the end of the level. Its catchier than whatever our own Chris Shive got on his last adventure to the seedier parts of town, bringing the smile every time its played, much like Chris grimacing in pain as he is receiving treatment for the same. The music in general is quite good, adding to the experience as a whole, and worth owning the soundtrack. Closing Comments: As a fan of Nippon Ichi Softwares output as a whole, its hard not to be disappointed with The Witch and the Hundred Knight 2. Despite the knowledge gained from the previous outing, the developer released a title that plays like the place their unused ideas of other places got sent to die. Staying prepared for the action takes up a huge amount of time and the action itself isnt exactly compelling. Its much more forgiving than the first ones initial outing, and it doesnt crash to the dashboard, but one cant help but wish that the game itself would have been the beneficiary of further refinement to bring in more players. Some daring swings at humor and story beats that lend themselves to mocking elevate the package, but not by enough. Nippon Ichi consistently does better work and its best to appreciate those instead of prodding this bloated thing.", "date": "Bohn on April 4, 2018", "grade": 2.0}