{"name": "Prominence", "ref": "https://hardcoregamer.com/?post_type=post&p=177448", "text": "First-person point and click adventures have been around for awhile. The most well known and classic of them all is probably Myst. For many of us, these games were a staple of our childhood and still hold fond memories. Theyre simplistic now by modern standards, normally just a static screen that either can or cannot be rotated, moving from scene to scene by a single mouse click. Mousing around lets you examine things, getting tidbits of information or pick up seemingly random and useless objects to shove into your endless pockets for later use, in puzzles that either make sense or dont in the slightest. There have been a great many of these games over the years, especially in the nineties. Often refereed to as Myst clones or Myst-like, theyve ranged from great to terrible, but there are a great many to choose from. There have been less and less of them in recent years and none of them quite retouch on what once was. That is, until Prominence.Prominence is a game that will get the nostalgia flowing fast. Not only is it what one would refer to as a Myst clone, but it even looks like a game you could have played in the late nineties. Perhaps this was intentional, perhaps it wasnt, but either way its nice to see again. You have the classic static images you can spin around in to investigate, but more importantly, when you move from scene to scene, the image takes on a slightly grainier quality that just screams old adventure games. This is a feature that could turn some gamers off, but for those of us brought up on them, its just nice to see it again in a game weve never played before.Before getting into the heart of the game, Prominence includes a written prologue that can be read on the games website. Its an interesting look that gives more depth to the universe and characters created by the game. It would be nice if this was integrated into the game somehow, as its likely to be missed by a lot of players. While not strictly necessary for the enjoyment of the game, if you fail to read it, youll miss out on references, as well as being in a position where you arent familiar with the characters. You wont fully comprehend or appreciate whats going on, nor fully understand the stakes involved in the story. If you plan to play Prominence, you should probably take the time to read the prologue before diving in. In Prominence youll wake up on an empty ship in space with no knowledge of what exactly is going on. The games title provides a fairly large clue, but the terminals of emails and voice mails will fill in the gaps. None of this, however, tells you who you are or what happened to the crew. The game is quick to introduce its mechanics, giving you a puzzle to solve to get you out of the small room youre trapped in before opening you up to the rest of the ship. Its rather lonely wandering an empty ship with only the recorded voices of shipmates to keep you company. You find yourself fairly directionless while experiences strange episodes that send you stumbling about. Your loneliness doesnt last long, however, as soon enough youll stumble upon the ships AI computer, ANNIE. Once you have her up and running again, shell be a friendly voice in your ear, helping guide you along.A game like Prominence relies heavily on story, which is why Ill avoid spoilers as much as possible. The story has to drive a game like this, encouraging you to keep going to find out more and answer all of your questions. This is why reading the prologue is fairly important. The story of Prominence is fleshed out by an interesting universe and characters, which youll get to know more and more as you nosily poke their their emails, logs, and messages. The story itself is mostly linear, but gives features two branching paths at the end, allowing you to end the story in your own selected way. Theres a prevalent feeling that something is missing as you go through the game. While the voice acting is well done, theres a visual aspect thats lacking. Later on, you gain the ability to hack cameras and the first time you bring up the camera feed, you fully expect it to be visual, but its only audio. The game feels so much like a classic adventure game that FMV wouldnt have felt out of place. Even a grainy, half-corrupted image from the point of view of the camera where you could barely make out the characters still would have filled a hole. Perhaps its a silly thing to nit-pick, but its absence felt glaring.Its clear the developers love their game, it wouldnt be surprising to find out they had even more information and backstory about the world they created that they had no way of fitting into the game or prologue. The mouse controls, while initially controlling more like playing a crane game while blind drunk, were patched after players expressed their displeasure with the control scheme to give a momentum-less option. Its always good to see a developer that listens to those playing their game and is committed to a good player experience. Closing Comments: Prominence hearkens back to the glory days of first-person point and click adventure games. Its intriguing story will keep you digging through terminals to find out more. Not only does it look like a classic game, but it plays like one too. Its a nice modern addition to our libraries full of old favorites.", "date": "November 16, 2015", "grade": 4.0}