{"name": "Evil Defenders", "ref": "https://hardcoregamer.com/?post_type=post&p=177527", "text": "Originally released on iOS and Android, Crazy Pandas tower defense game Evil Defenders has arrived on PC and Mac. While it might not be fair to call it a cookie cutter product, it doesnt stray far from the template set by Kingdom Rush or Fieldrunners or a dozen other successful tower defense games. Then again, depending on your appetite for innovation and novelty, that might not be a bad thing. Sometimes comforting familiarity fits the bill.The tower defense genre has been around since at least 1990 and the popularity of gaming on mobile systems pushed the genre forward. Its not hard to understand why, as the relatively short stages and waves of enemies are perfect for abbreviated play sessions, and the simplicity of most tower defense control schemes fits well into limited screen real estate. The popularity of mobile tower defense apps likewise encouraged developers to create full-size and full-featured games for PC, such as Plants vs Zombies, Anomaly: Warzone Earth, Defense Grid, Defenders of Arcania or GemCraft. Many of these PC titles eventually found their way to mobile platforms as well.In their purest form, tower defense games require the player to place structures along a predefined pathway, to combat ever-increasing and more challenging waves of enemies. In these classic style games  of which Evil Defenders is a perfect example  each tower can be upgraded with abilities that counter specific enemy types, such as powerful archers or mages that bring down flying enemies or artillery that crushes heavily armored foot soldiers. Evil Defenders, like most games in the genre, warns the player about what type of wave is coming so they can plan accordingly. Most of these games also add into the mix special several hero-type units or god-like powers that are on cool-down timers and must be used strategically. In between levels, just about everything can be upgraded, though there is never enough cash (or stars, or, in the case of Evil Defenders, spirits) to upgrade everything, so choices must be made. The meta strategy is often where microtransactions appear, appealing to the impatient gamer. Visually, it seems like most tower defense games come in one of two flavors: high-tech themed, or fantasy themed. Evil Defenders falls into the latter camp, and its design is bright and colorful and looks much better on PC than on a tiny phone or even iPad display. Levels take place in all sorts of environments, from jungles to deserts to islands, and even some snowy landscapes. Lots of little details, like cascading waterfalls and flocks of birds, bring the levels to life, but none of the levels are very large, presumably an artifact of their conception for the small screen. Most of them have six tower placement positions.Although its gameplay is right-down-the-center rote, a couple of things help distinguish Evil Defenders from its tower defense brethren. For starters, theres the whimsical premise that its the evil characters that are defending The Lands of Evil from good. The player gets to manage all sorts of rather comical and charming looking monstrosities, orcs, wizards, goblins and trolls as they try to defeat the more mundane (mostly) human enemies. Its a fun idea, if not entirely new, to play the bad guys. More negatively, Evil Defenders sets itself apart by being more challenging than most tower defense games, and unfortunately this difficulty comes from the glacial pacing in the way it rewards points (spirits) during combat. Upgrading units or earning enough souls to place needed towers is simply too slow for the quantity and speed of enemy waves. Impatience is not something one usually feels with the pace of these games.On mobile systems, Evil Defenders is a free to play game with everything beyond the three introductory levels locked behind microtransactions, and the player is constantly encouraged to spend money to buy enough spirits to progress at a reasonable pace. Happily, the Steam/PC version lacks this annoyance but the pacing and reward/upgrade issues have not been addressed. Closing Comments:Thanks to these problems, a visually charming and potentially enjoyable  if thoroughly unoriginal  tower defense game becomes much harder to recommend. Of course, grinding to earn upgrade points is always an option, but the levels arent that charming. Tower defense games arent exactly gaming junk food, but their secret is in rapid pace and a steady forward progression. Get that wrong and not much else matters.", "date": "November 15, 2015", "grade": 2.5}