{"name": "Dragon Fin Soup", "ref": "https://hardcoregamer.com/?post_type=post&p=177249", "text": "Among the numerous games seen at PAX Prime, Dragon Fin Soup was one of the most intriguing titles. Truly, my personal anticipation for this was extremely high. Learning at the last minute that this would be released on the Playstation Vita and 4 as a free Plus title seemed to have the makings of another Rocket League moment. This has had every opportunity to gain the word of mouth needed to create another sensation that would retain its popularity past the initial month of being free. Unfortunately, this title could have used more time in the pot.There are an huge amount of things going for this classic roguelike. First of all, it doesnt pull its punches, even from the start. It truly is harder than a mysterious lump discovered on a tender part of the anatomy. Sticking with the tried and true method of every thing takes a turn when the player does will require players spoiled on the likes of Diablo and other off shoots of the genre to re-acclimate. Even the initial dream prologue will murder the protagonist dead if the player isnt smart. Liberal use of potions, power ups and healing items are recommended. Once the player relearns how to play these games, the additional options open up in fun ways. An unaware monster might be sleeping contentedly. The player could drop a bomb and smack it over, sneak up and back stab it, or just cut a freaking tree down to land on its head. Using the environment is much more fun than attacking directly. Its hard to get sick of luring enemies into traps, and compound their grief.The story, while slow to start, becomes a reasonably entertaining tale. The hero is Red Robin, who isnt so little any more. She was rescued by a sleepy village after suffering, sigh, amnesia. Spending her nights getting drunk and her days doing errands or monster hunting, she has come to build a comfortable life for herself. Sure, she is a mean drunk. In fact, if the player drinks too much healing alcohol, she becomes violent and uncontrollable. Still, she gets along with the town. Eventually, she receives a visit from someone claiming to be related to her with hints of what happened before The writing itself is amiable. There are numerous instances of great little touches, such as a vampire who attacks Red because of her fashion sense. The goofiness doesnt end with just the dialogue. At one point, I was dual wielding a bottle and a severed arm, doing quite well for myself, thank you very much. Speaking of severed things, among the numerous pets that can join Red in her adventures to provide support is a severed hand. There are just loads of little touches to make this a fun title. These are the reasons that this could be a top notch, award winning title. With profound disappointment, it must be reported that it is not.While the battle and exploration interface is well designed, everything else is just a mess. The inventory screen quickly becomes a massive dogpile of random items, what with the consumables, crafting materials and equipment all taking up the same screen. As there are numerous types in this game, it becomes a aggravating chore to find what is needed when it is needed. Really, there needs to be a separate inventory for the three basic types to make navigation simpler and more user friendly. It might not be pure, but it would make the title more fun. Crafting is a nightmare. The interface itself is, sadly, almost completely nonfunctional on the PS4 and Vita. With the Vita, it is supposed to be a simple matter of dragging and dropping the materials into place using the touch screen. Due to the small size of the items, this doesnt quite work. This means its better to select each item manually, open the menu cross and select it that way. As many items require numerous ingredients, it becomes easier to just sell the lot and find completed items in the field or store. What is supposed to be a major area of feature of the title is better left forgotten. Note: This pertains only to the console versions. It is conceivable that the PC version would work better here due to the mouse controls.The most heinous issue in this title are the bugs. This isnt an issue where the AI might get hung up on the environment, or the graphics might do something weird. No, this game is prone to frequent and unexplained total meltdowns. The kind where the system asks if you want to send data to Sony. Innumerable are the occasions where the game glitched out for no recognizable reason, losing the player valuable progress. Saving after every event, conversation or battle is mandatory just to progress. The final done moment was when the game crashed mid-save, losing all progress in the story mode. Fortunately, my aborted Survival Mode run is still intact. Closing Comments:Dragon Fin Soup is a great game trapped in a terrible games code. The tile sets for the randomly generated maps create lush environments to explore. The writing is like a clown in corpse paint; silly in its darkness. There are seemingly limitless options to win battles and progress. Unfortunately, there is just so much additional work that needs to go into this title. With the interface issues and disturbing level of instability, it simply cannot be recommended at this juncture. Should these factors be addressed in a patch, I will gladly take this title for another spin as I want so badly to recommend it. For now, though, it should just be noted that Red Robin is supposed to be the inebriated one, not the games code.", "date": "Bohn on November 14, 2015", "grade": 2.0}