{"name": "Norn9: Var Commons", "ref": "https://hardcoregamer.com/?post_type=post&p=175395", "text": "Sony may have fallen out of love with its PlayStation Vita long ago, but publishers such as Aksys Games, Atlus, Idea Factory and others are making it their new home. Fans of visual novels should be especially pleased with the surprising amount of attention the genre continues to receive on this handheld. The latest in the assortment of visual novels is Norn9: Var Commons. Interestingly, it also happens to be an otome title. For the uninformed, the otome sub-genre is categorized by stories which feature women protagonists and typically involve stories of romance between them and a selection of multiple hunky men. Theres no shortage of hunks in Norn9: Var Commons, though you might be surprised by the rest of the story content which reaches far beyond simple affairs of the heart. Players find themselves initiated into the story by an utterly strange, but captivating, prologue. It all begins with a bunch of schoolkids taking a field trip. We assume the role of an incredibly intelligent young student named Sorata who is a total know-it-all. While contemplating, he suddenly begins to hear beautiful music (and yes, the prologue does start with a male lead). Then, without any explanation, he finds himself thrust back in time hundreds of years. Although his logical mind will hardly let him believe it, it appears thats exactly what happened  and now theres no way back. Or is there? After having the fortune of wandering upon a strange young woman, the two partner up and find themselves in an even weirder situation. For whatever reason, a flying ship picks both of them up and thus begins their journey. It seems that everyone aboard this ship is imbued with magical powers of sorts  from protective shield generation to the creation of flora. Each of these people aboard must use their powers for good to keep world peace from ever being disrupted. It might sound totally convoluted and thats because the introduction to Norn9: Var Commons is quite odd. It meshes together a lot of concepts in a short time span and, as such, feels a little disjointed. All the same, this also manages to hook readers instantly. Folks want to know just what is going on in this visual novel and how all this insanity plays out. Without spoiling anything, its worth the journey, though youll end up needing to play through multiple times to get the best understanding of everything going on. Visual novel fans should be accustomed to this sort of multi-playthrough treatment thanks to the propensity of true ends, but newcomers might be a little taken aback by it. One route should take around three to six hours (depending on your reading speed). There are nine routes (as the title reveals) to pursue in Norn9: Var Commons. Its worth noting that there is a preferred path to take through them. If you do not mind being spoiled onto the suggested progression then keep on reading. Players should begin with the Koharu route and select either Kakeru Yuiga or Senri Ichinose as their beau. Next is the Mikoto route with Sakuya Nijo. Then, its time for Nanamis route with Heishi Otomaru. Once these routes have been cleared, the storylines for other men are unlocked. And yes, youll find different facets of the storyline explored and explained with further playthroughs by going through in this manner. Norn9: Var Commons distinguishes itself from other otome titles for more reasons than just a sci-fi storyline. It also is unique in that it allows players to pursue the storyline from multiple perspectives. There are three women aboard the ship and you can explore routes with each of them as the protagonist. Koharu is totally new to this whole experience, which means her perspective fits well with the player themselves. Once you get a feel for the general tale, it becomes exciting to learn what Mikoto or Sakuya were thinking and doing during different key events. Each character also has her own selection of potential lovers, meaning you cannot simply choose from the whole gamut right off the bat. This might annoy some, but is a necessity for the way this game tells its story. Each guy has his own storyline and revealing some things too early either wouldnt make sense or spoil big portions. Although not a dating sim in the traditional sense (where players must increase their stats to attract specific characters), there are some elements of the genre to be found here. While playing, youll need to keep an eye on an affection meter. You can increase this by making the right choices during a dialogue option  and in fact each choice directly relates to potentially increasing the affection bar. Fail to get affection up by at least fifty percent at a critical juncture and you wont get the good ending for your chosen guy. My suggestion is to save as a choice comes up, test out an option and redo it if youve made the wrong one. Also, dont zone out while playing as some choices are timed.Absolutely everything about Norn9: Var Commons is gorgeous. That includes the men, women and scenery. Theres a distinct look with backdrops in particular as they mesh sci-fi aspects such as the flying, futuristic ship with a really rustic demeanor. For example, vines and crops dot the landscape alongside cozy cabins. Who would have expected to see such a naturalistic vista within an obviously far-flung transportation device? There are some disappointments with the sprite work, though they may seem nitpicky. As compared to other modern visual novels, the character sprites feel flat and barely animated. This is likely due to the games PlayStation Portable origins and is certainly not a gamebreaking issue. Audio-wise, the game fares admirably well. Sure, the soundtrack itself is lovely, but what fans tend to focus on more is the voice acting. Youll find complete voice acting in Norn9: Var Commons for each guy as well as all three protagonists. The voice acting is only available in Japanese, but of course, thats what many genre fans prefer and expect anyway. This Vita title also happens to feature a lot of options for setting voices exactly how you like. Youre free to alter volume for specific characters or even turn any of the various voices on or off. In comparison, the text options are far sparser. Although theres the option to speed up autotext, its fastest setting is unbearably slow for quick readers such as myself. Its a bit surprising better options for text arent available considering this is a visual novel and all.Closing Comments: Theres a lot to like about Norn9: Var Commons, from its complex storyline which weaves heavy sci-fi elements with relatable human drama, to its superhero flair thanks to the powers of each character, adding a lot more excitement to action sequences. Playing through a single game nine times might sound egregious, but it does pay off for those willing to stick with it through to the end. Because of the potential for an extended playthrough, however, issues such as a slow autotext feature grow all the more grating. The saving grace here is that its not particularly hard to get a good ending as it is with some visual novels. As such, you wont need to waste excessive hours simply trying to perfect one route before moving onto the next. Norn9: Var Commons might not be the very best the otome genre has to offer, but its certainly up there.", "date": "November 5, 2015", "grade": 4.0}