{"name": "Mushihimesama", "ref": "https://hardcoregamer.com/?post_type=post&p=175051", "text": "Its hard to believe Mushihimesama is eleven years old. It first hit Japanese arcades in 2004, got a mangled PS2 port a year later, then a well-received HD remaster 7 years after that for the Xbox 360 that was, unfortunately, region-locked to Japan. Now Mushihimesama has a port that everyone with the hardware to run it can enjoy without jumping through hoops and its a thing of beauty. The PC version is a direct port of the Xbox 360s Mushihimesama HD, and its as smooth and approachable an intro to the joys of bullet hell as one could wish for.Reco is a teenaged girl with a giant bug living in the kind of peaceful naturalist world thats ripe for trouble. While the story isnt explained in-game, her tribe has fallen to a sickness so she hops on her beetle and flies to the God of the Koju for a cure, passing through a beautiful world that wants to kill her with as many bullets as it can cram into the surrounding airspace. Bugs, plants, random structures, and immense beasts spew out rivers and fans of bullet-pattern death for Reco to fly through, populating five levels of fantastic shooting through multiple game modes and difficulties. Five levels may not sound like much, but theres more than enough meat on this bone to keep anyone whos ever loved flying up the screen decimating all in their path busy for a very long time.Mushihimesama comes with three separate modes included, ranging from the beginner-friendly Novice, the arcade-standard Normal, and a special Arrange mode. Original and Novice both have three difficulty levels to choose from, with different scoring mechanics between the simplified Original and the more intense Maniac and Ultra modes. On top of that theres Training options available for Normal and Arrange, and Score Attack to play in the online leaderboards for all three modes. They all build from the same gameplay basics, but each mode approaches it in a slightly different way. At the games beginning you choose one of three shot types, ranging from a focused straight shot to a wide spread and the final being an average of the other twos dispersal pattern. Enemies drop power-ups along the way, always defaulting to the type you picked but cycling through the other types if you feel the need for a change mid-game, and thankfully death doesnt weaken your shot strength. The other power-up is a baby laser-shooting beetle, basically a Gradius option, with a following pattern either spread out or tracing your path depending on the type of power-up you grab. Its a simple system that offers a decent amount of flexibility, leaving you free to concentrate on surviving the deluge of firepower washing over the screen. If youre feeling cocky about your chances for survival, though, you can start chasing after score to add another layer of complexity to the proceedings.Novice and Normal are basically the same game other than difficulty, with identical mechanics even if Normals more bullet-saturated playing field gives better scoring opportunities. Original difficultys scoring is the simplest, boiling down to dont die, kill everything. Maniac and Ultra modes introduce a counter that acts as a score bonus, increased by shooting enemies and decreasing when nothing is being hit. Keep the counter high and kill enemies quickly to see the score blast through the stratosphere, and collect every yellow gem you can grab. Destroyed enemies leave gems behind, with the airborn gems homing in on you and the ones on the ground needing to be manually collected. To really work the gems, though, youll want to survive the level with no deaths, because every one collected on the life that clears the boss gets added to the post-level bonus. Certain enemies even cancel all bullets on screen and turn them into gems as well, and once you know which ones do this its hard to resist trying to time killing them to maxing out the enemy firepower on screen. Arrange mode is very different from Novice/Normal, in that you start out with firepower maxed and only have one difficulty mode which is more than generous with the crazed amount of bullet patterns it throws at you. Despite this its actually somewhat easier than the Normal, thanks to the enhanced firepower clearing out the enemies faster and a function that auto-drops a bomb if you take a hit. You only carry one bomb to start with, though so its not a feature thats easily abused, but even with my slightly-above-average skill Ive managed to clear level 3 on a single credit. Admitted, Id probably live longer in the regular mode if I remembered to use bombs more often, but the thing about a good shooter is theres always room to improve. One of the feature of Score Attack is the ability to attach your playthrough to your high score, making it available for others to download and watch in the Replay Data tab. Its a great way to pick up points or simply marvel at the shooter gods moving effortlessly through their bullet-drenched celestial realms.Also available, and not included in the overall final verdict in this particular review, is the Mushihimesama 1.5 DLC, which is a rare version of the game previously only available as an exclusive to the day-1 version of the Xbox 360 version. This includes remixed levels, tweaked scoring mechanics, and the option to choose a fully power-up gun at the games start. The drawback to going in overpowered is more enemy bullets, but then again whats bullet hell without lots of projectiles? The scoring mechanics are more closely tied in to the gem count, with counters and multiplier interacting in fairly complicated ways. Its a good extra version of the game and well worth checking out, but just be aware that its an advanced version best enjoyed once youve come to grips with the included modes. Closing Comments:Mushihimesama is a classic shooter for good reason. Its beautiful on the surface, but a master class in how to create a challenge that varies in difficulty from completely accessible to utterly insane, leading the player down the path to acquiring the skills necessary to see how the best players manage it even if that level of ability remains out of reach. The incredible amount of firepower on the screen is always completely visible over the background objects, leading to almost zero deaths from out of nowhere, and while the scoring mechanics may not be quite so deep as Caves later games, sometimes its nice not to need a PhD in Shooterology in order to understand how to earn a top spot on the board. The sheer volume of content is fantastic, making it as easy to replay a mode over and over again for practice as it is to bounce from one game type to another for the shooter version of Short Attention Span Theater. Mushihimesama is a phenomenal arcade game and an indispensable addition to any shooter fans library.", "date": "November 3, 2015", "grade": 4.5}