{"name": "Deathstate", "ref": "https://hardcoregamer.com/?post_type=post&p=173993", "text": "What lies in the realm between life and death? Its hard to say, but apparently its got too many tentacles and can spray endless streams of eldritch bullets. The realms between are packed with shambling horrors and weird mockeries of life, and every single one of the inimical beasties wants to kill you. The outer planes are swarming with deadly horrors and impenetrable fans of bullet-based doom, but its not so bad when youve got an endless stream of your own decimating firepower to throw back into the dark unknowns face.Deathstate is a roguelike Cthulhian bullet-hell procedural death maze, which wins it the prize for sheer volume of awesomeness in a genre description. At the games start you find yourself in a library with no way out except a glowing portal. Scattered around the place are a few tables with info on items, enemies, and secrets, but to start filling in all the blanks youll need to journey through the between-realms and try not to get overwhelmed by the volume of enemies waiting there. Each level is packed with a variety of creatures ranging from swarming grunts more suited to absorb firepower than pose any real threat, to the more troublesome creatures using the throng as cover to get in a stray hit. Some enemies run at you fast while others pepper the screen with bullets, and when they attack in numbers its an important decision as to which to target first. Thanks to Deathstates aiming system, the answer is always the closest one.Deathstate looks and acts like a twin-stick shooter but isnt actually one. Firing is automatic, focusing on the closest enemy within range, and the surprising thing about this is how quickly controlling where the bullets go becomes second nature. Technically theres no denying that this takes away player control, but in actual practice its almost an irrelevancy. Once you know the closest enemy gets targeted it takes very little effort to make sure the right critter is being pelted with bullets, even as you dodge enemy firepower while using positioning to line up the shots. Its a highly effective system and great fun once you realign your thinking to take advantage of firing system. If that still is an issue, though, there are endless dozens of items and unlockables to help clear a path through the swarming mass. This also frees up the second stick to use for a brief dash move, rendering you invulnerable for a life-saving quarter second. Like all the best roguelikes, Deathstate has doezens of items to find that can significantly change up your strategy. The items come in five different categories- books, swords, relics, potions, and internal organs. The starting library holds a set of books that keep track of everything youve found, some of which is unlocked when you find it the first time and others which only become available after meeting certain objectives. Each level holds a miniboss monster, for example, and killing it guarantees a brand new internal organ that will permanently modify your stats for the run. Character speed, shot power and firing rate, extra health, and other stats grow and change through a run, and while each organ is guaranteed to be a net benefit, it may still knock down one stat while driving up two others. You dont know what it does until you pick it up, and once auto-inserted into a handy cavity its not coming out. As a rule, though, the effects are fairly minimal, so it takes quite a few of the same type to have a major effect on your abilities. Relics grant a magic spell, generally of the exploding kind, while potions are single-use mystery items. Once youve used a potion you can identify it, and the same colored bottle with have the same effect each run, but they get randomized between rounds so the effects a mystery until you swig the first one. The real fun comes from swords and books, which have a nice effect on your shot style.Most characters fire the standard psychic bullet from their upraised hands, pelting the advancing horde with an endless stream of firepower. Swords change the shot type in various ways, from exploding bullets to missiles, orbiting hammers or short-range waves of flame. Books act as Gradius-style options, although you can only carry one at a time, and they also come with different shot types. Lasers, plain-vanilla shots targeting multiple enemies at once, fireballs, and even deadly bubbles of floaty doom all emanate from the pages of your helper-book. A good sword and book combo can couple with your regular shots to cut a vicious path through the bullet-spewing throng, and by the time you get to the fourth world youll need all the backup you can get. Deathstate seems like an easy game, at the start. The regular skeletons dont post much of a threat despite their numbers, red skeletons move quickly and absorb a lot of firepower but a few good bullets slow them down enough that theyre more nuisance than threat, and even the fancy skellies only toss out a few bullets at a time. The tentacle-faced green guys are a bit better armed, and the roving green pyramids shoot out a sparse enough bullet pattern that you could drive a small truck through it. They come in large numbers, so the firepower can make the screen somewhat crowded, but for the most part the first few levels are there to power you up for the challenge to come. World 2s teleporting dogs, exploding mushrooms, short-range-firepower mages, and running jackal-men combine with smaller open areas to make it very easy to take a hit or two, whittling health down quickly. It also doesnt help that its hard to resist defiling the altar in the first level of each world, which summons a bullet-spewing Cthulhian boss that raises the difficulty level when defeated. Even without summoning the mid-boss, getting to the fourth world is a respectable challenge that will most likely take more than a few attempts to achieve, and clearing it with enough health to give the boss a proper fight is an accomplishment in itself.It doesnt help, though, that the hit box on your character isnt clear. The spot to use to avoid bullets is the ground under your chosen characters feet (assuming the character has feet), but this isnt clear and can take more than a few deaths to drive home. The other problem is one of mobility, because reading the ground and knowing when certain obstacles are actually obstacles, rather than something you can just float over, is frequently unclear. It doesnt help that grazing the edge stops you dead, without the character doing a slide around even the smallest hit on a wall. When avoiding a huge spray of bullets the last thing youll want to worry about is grazing a corner in just the wrong way to kill your escape plan. Closing Comments:Deathstate is a great little arcade roguelike, filled with tons of secrets and unlockables to discover long after the first completion of the main quest. New playable characters and items, not to mention the quest for the proper ending, give it huge replay value. The difficulty level is well tuned, ensuring even the easiest levels cant be blown through without paying attention, and cranking up the difficulty by fighting the optional bosses does a great job of keeping you on your toes. The Lovecraftian theme doesnt seem like a great mix with an arcade-action game but still makes for a nicely atmospheric shooter. Deathstate has secrets to uncover, huge bursts of firepower to dodge, loads of upgrades on the path to the final zone and a nicely unpredictable journey on the way there. Its a long and dangerous road out of the realms between worlds, but with enough shooting and a nice selection of helpful new internal organs, you might just get strong enough to escape.", "date": "October 30, 2015", "grade": 3.5}