{"name": "DeltaZeal", "ref": "https://hardcoregamer.com/?post_type=post&p=172761", "text": "Shooters generally dont come loaded with secrets. Sure, theres frequently a bonus character to unlock by beating the game or meeting certain conditions, and sometimes bombing a secret spot opens up a few bonus points, but in general the genre is more about memorization and system mastery. Learn when the thin spots in the chain show up so you can save an enemy to act as a bridge, or the best place to use a bomb to maximize the bonus pickups, and other similar experienced-based tricks. DeltaZeal takes that idea and builds the entire game around it, to the point where you can miss well over half the game if you dont learn to find the secrets it hides for experienced players to discover. Theres far more game buried under its shooter-standard surface than is readily apparent, and discovering how to find it all while working its weapons and scoring systems makes for a shooter with a huge amount of replayability.DeltaZeal is the story of a heavily-armed fighter plane shooting a whole lot of aircraft, tanks, ships, trains, and anything else the enemy can muster to get in your way. Maybe the enemy is an evil empire, or maybe they just stole the pilots cookie. Who knows? The point is the cookie thieves have it coming so you fly up the screen laying waste to all in your path. The shooting is fairly straightforward, with only a little technique in choosing the right powerup and maximizing the bonus-point drops, and the rest is all about shooting and dodging. DeltaZeal is a classic pre-bullet-hell early 2000s-style shooter, which is fitting seeing as its original version (named G-Stream G2020) came out in 2002, but with a few unique twists to set it apart.The first and most obvious difference between DeltaZeal and your standard shooter is its power-up system, which lets you use all three of its weapons at once. Enemies sometimes drop the typical power-up orb, which changes from red to blue to green to indicate which weapon it effects. The game starts with three pips of red filled in, giving you a nice spread-shot, but after that the power-up path is yours to decide. There are ten spots on the power-up bar and each orb fills in one, with the color collected increasing the effectiveness of its weapon. Want a huge and powerful spread-shot at the expense of anything else? Get all red orbs. Blue powers the laser and green the missiles, and you can balance things out or specialize in a favorite weapon any way you like so long as youre careful about the timing of orb collection. Alternately you can grab the power-ups as theyre available and adapt on the fly, which is also a lot of fun. So long as youve got a good amount of power-ups DeltaZeal wont leave you defenseless, even if you do end up wishing for an extra missile or two. The ship also comes armed with two powerful sub-weapons. The first is the all-purpose bomb, same as in just about any other shooter, limited in number but still a handy get-out-of-jail-free card when you need it. The special weapon, on the other hand, requires care and precision to get the most from it, and proper use can shoot the score through the roof. The black hole is charged by destroyed enemies, with more killed equaling a longer duration. The singularity acts as a shield against enemy firepower and also turns any bullets into point bonuses, but timing the drop for maximum pay-off requires both experience with the section its being used in plus careful management of the point drops.Almost every enemy destroyed drops a pink gem, with the first one being 10 points and each additional one increasing in value until the eighth one is 1,000 points. The trick is to not miss any, because each gem that falls off the bottom of the screen resets the scoring to 10, so you end up constantly weighing the need to clear away all enemies with the ability to zip across the screen in time to snag a gem before its gone. Survival may be worth more than points, but careful mining of the gems can mean a 500,000 point difference between one run and the next just by the end of level 2. Primarily by use of the black hole weapon, of course, because nothing says scoring heaven like a massive stream of bullets converted into 1,000 points apiece. The other trick to scoring is experience, which is true of any shooter but far more so in the case of DeltaZeal. Levels can be very short or much longer depending on how fast you clear out the enemies, with easily half the length being bypassed on your first encounter. Enemy chains, entirely new areas, and even mini-bosses are there to find on subsequent runs, not to mention entire alternate levels. Level 3A is a completely different area from Level 3B, and both of them have alternate routes and hidden areas to uncover. Each run has the potential to play differently from every other run, and its going to take many, many play-throughs before anyone gets good enough to not only find the optimal path through the game but also wrest the best score from it.DeltaZeal is a fantastic arcade shooter, but if theres one disclaimer its that the PC port is very bare-bones. The output resolution options are limited to 640480, Auto, and 1280720. There are two filters to choose from, one with sharp pixels and one smoothed out, and the screen can be rotated for tate mode and scaled up both vertically and horizontally to maximize the monitor real estate. There are a few other settings such as controller configuration and audio volume, covering the absolute basics of options, and the nicest thing one can say about the menus is that theyre designed for functionality over attractiveness. A few backgrounds for playing in standard widescreen mode would have been nice, at least. Closing Comments:Shooters have had a resurgence in recent years and while more and new are always welcome, there are still many incredible games lying almost forgotten in the past. DeltaZeal was not only excellent for the time, its weathered the years exceptionally well and can easily stand with the best of today. Yes, theres no denying that it looks like a PS1 refugee, balanced slightly awkwardly between low- and hi-res pixel art, but it works well enough and the shooting action is excellent. The ability to tweak the weapon balance on the fly as power-ups become available makes for some welcome customization, and being rewarded with a brand-new challenge in an area that had seemed familiar when youve done particularly well is always a happy surprise. Usually followed by a death or two, of course, because the reward for skill is to have it tested, but its hard to complain too much at being gifted with new scoring opportunities. DeltaZeal deserved better than to be lost in shooter history, and is an easy recommendation for anyone whos ever enjoyed flying up the screen maxed out on firepower but only a single bullet away from death.", "date": "October 20, 2015", "grade": 4.0}