{"name": "Sword Coast Legends", "ref": "https://hardcoregamer.com/?post_type=post&p=172818", "text": "Dungeons & Dragons has endured over 40 years because of its engrossing storytelling opportunities and do-as-you-will encounter options. Yet, despite its age, there have only been a few video games bearing the same namesake that have lived up to the tabletops prestige, regardless of the fact that there have also been scores of attempts at capturing the pen-and-paper magic via digital means. Baldurs Gate and Neverwinter Nights are the two games that immediately come to mind as those that have managed to successfully capitalize on the illustrious franchise, while others like Daggerdale, Neverwinter, D&D Online and D&D Tactics failed to recreate that which we deem synonymous with the series. Sword Coast Legends, then, is in a tough spot; not only does it have to usurp the reputation garnered by those recent failings  after all, many fans would say there hasnt been a quality D&D game since the mid-2000s  but it also has to compete with others in its genre, not tied down to the weighty franchise name, that have managed to redefine the cRPG genre.Sword Coast Legends tells many tales: a 30-40 hour story campaign written by the developers, and then all of the modules made by fans that are also available to play through. Thats right, Sword Coast wears many hats; single player game, four-player cooperative dungeon crawler, 4vs1 multiplayer game wherein four friends team up to take on dungeons that are actively DMd by a fifth player who constructs their own dungeons and stories also also manipulates baddies in real time to trounce said four friends, and content/scenario maker thanks to the devs giving players a wide range of tools to forge their very own D&D campaigns. Its a right massive game.The campaign that developers N-Space and Digital Extremes have created is one of the packages highlights. Thanks to Jay Turners stellar writing and characterizations and the diverse quests players take on, players will want to experience Legends narrative if for nothing else than for the interesting personalities and quality voice acting. This particular story is one that starts off seemingly benign, but then quickly unravels into a much larger mission that essentially comes down to a save-the-world situation. While on paper, it may sound like the usual stuff in the way of D&D stories; however, assuming that this is a run-of-the-mill tale would be flat out inaccurate. The characters bring to life Sword Coast Legend, including the player themselves. This is an RPG with a bevvy of choices for the player to make. Some of them are obvious ones, in terms of what kind of character players want to assume, while many are morally ambigous and have pretty lasting effects. This type of gameplay keeps the player, not just engaged in the plot, but also feeling truly connected to their character and the compatriots in tow. Much of this is thanks to a solid writing team. While the lore may not be as rich as Pillars of Eternity for the average player who doesnt know much about Dungeons & Dragons, there is still a good amount of history crammed into the gamethough it does assume folks know the D&D Forgotten Realms world. So for those that dont know it, the world-building may seem adequate but never deeper than that. So, being a fan of the franchise will add to the experience, hands down.We mentioned character attachment earlier specifically because becoming invested in ones avatar is an important aspect of the game. Before folks start up their first game, regardless of the mode, they will be tasked with creating their character. Theres a good bit of customization that goes into this, even if the isometric view the game employs doesnt allow players to see many of the details of their character. Sure, its not the most robust creator around, but being able to choose ones gender, class, race, sub-race, and background (which gives ones character a bit of a back story), and then tinker around with the dozen or so options under the hair, cheeks, nose, mouth, and ears categories does the job well enough. Since the view really restrict how much of ones character players can actually see, it seems this was thrown in their more to emulate the feeling one gets when creating a character in the tabletop game.After physical appearances are all set, folks can then move on to tweaking attributes and abilities, which are arranged and play out in the same way they have in the hundreds of RPGs before Legends. Its standard stuff when it comes to character creation, but what is there provides enough depth to feel that aforementioned bond with ones character. And the leveling up that occurs throughout the adventure, granting skill points, allows for allocating points into a number of skill trees to really form the type of character players have idealized. The skill trees are fairly linear, but having a few paths per tree is welcome. Be warned, though, the skills and their subsequent trees very very WoW-inspired. We can see that turning off cRPG purists. This is a double-edged sword, really: on one hand, it can feel like a game trying to mimic two very different genres, and on the other, it makes the game feel familiar and accessible to those wanting to cut their teeth on the cRPG.Aside from story and creation, an RPG is not complete without gameplaying conventions. The game is very rooted in the ways of Pillars of Eternity or even the PC iteration of Dragon Age: Origins in the sense that its an isometric RPG/hack-and-slash with pause-time combat options. But while Pillars was an engrossing, challenging ordeal when it came to battlesalmost to its detriment at timesSword Coast Legends tries to strike a balance between that kind of experience and also one thats a bit more pick-up-and-play, newcomer friendly. To this end, folks are given a skill bar at the bottom, not dissimilar to an MMORPG, to pop off skills in combat. But just rushing in and taking enemies on without forethought will indeed lead to a quick demise. Though Legends isnt the most challenging game around, especially for those familiar to the genre, its difficult enough to require some planning and battlefield awareness.This is where the pause-time combat comes into play. Being able to hit the space bar at any time, in or out of an encounter, pauses the game and lets players issue orders to their adventuring party of four. This is nearly required for the bigger encounters, such as an area boss and the like, and its pretty intuitive. Being able to simply click on a character, tap the corresponding skill icon, and then click on their target allows for fast pauses that allow folks to get right back into the thick of it. If things ever feel too easy, though, then changing the difficulty is always an option. Having easy, normal, and hard modes ensures that most people have something that fits their playstyle.Unfortunately, when in dungeons, the only choice players will have it combat. This was a bit frustrating in the sense that N-Space and Digital Extremes failed to capture the entire essence of D&D. Had we been able to resolve certain dangerous encounters in a dungeon with non-lethal means would have been fun. But alas, this isnt usually an option. Occasionally there will be the chance to talk things out with a foe, but this isnt always made clearwhich led to a few instances where we just assumed we had to kill our targetthanks to the party seemingly auto-attacking him without our directing them to, but were told by one of said party members that we could have used the target alive to interrogate him. This wasnt made clear to us and thats the irritating part. While in town, however, or just in the field, there are more options from which to choose when it comes to how to proceed with ones mission.The dialogue, for instance, has numerous reply options that the player can use to further deduce information from NPCs. Being able to successfully intimidate someone due to our decision to poor attribute points into the right category felt satisfying. Knowing that, had certain scores of ours not been leveled up appropriately we wouldnt have been able to get information from the NPC in said manner, was a neat and gratifying feeling. In the end, when there is the ability to choose ones actions and reactions based off of certain attribute points, its a wholly fun experience, and one that N-Space and Digital Extremes has gotten perfectly right when it comes to making Legends feel like something of a tabletop simulator.Speaking of Sword Coast being a simulator of sorts, a big draw here is the Dungeon Master mode. In this mode, players can build their own campaigns or choose to actively dungeon master a player-run game. Although the creation suite isnt nearly as extensive as we assumed it would be, its inclusion is neat enough for fledgling storytellers wanting to introduce players to their own world and tales. Being able to write all of the dialogue as well as design locations, be it towns or dungeons, does give players the opportunity to forge a unique adventure. Its just too bad that the palettes from which we can choose are limited, stifling how distinct DMs can make their campaigns.This mode seems more focused on telling ones own story rather than creating their world from scratch since a player can only do so much with only a handful of location tiles. We imagine, however, that this will grow over time, as N-Space has stated that they are dedicated to expanding the Legends experience post-release. This seems very much so like their baby, and theyre wanting to provide it a lot of attention in the coming months and perhaps years. So the creation suite is indeed restrictive right now; but were confident that wont last for long. Nevertheless, we have to grade the game based on what is present right now, and right now, this mode needed a bit more time in the oven.Though the other aspect of the Dungeon Master mode is the ability to be the evil overlord that thwarts players in real time by controlling all bad guys in a dungeon. Like Fable Legends, this 1vs5 feature seems to be turning into a desired mode, and for Legends, its delivered upon well. In fact, this mode in and of itself is what very well may allow folks to transfer their weekly tabletop games into a digital experience, as its entirely possible to get friends together on Skype or Ventrilo, and actively narrate players adventures while controlling all enemies like a true tabletop DM would. When we gave this a test spin, we noted that it was a pleasantly smooth event, and went exactly how we thought and hoped it would. It never ceased to excite when a party cleared a difficult boss only to then drop a second, more difficult boss on them. In other words, this lets players be trolling bastards or fair DMs, and just having that choice is a great sense of empowerment.The multiplayer aspect of the game in general is well-executed. When we werent DMing, we linked up with others to run a fan-made campaign and then to simply run a quick dungeon. Theres the chance to do either-or in Sword Coast Legends. Dont want to commit to a full campaign, or only have 30 minutes to spare, then just jump into the Dungeon Crawl mode, which is simply a one-off dungeon. And since character progression is persistent, folks can jump in for a one-off dungeon, then come back days later and play a full campaign with all the experience and items they scored in the previous one-off mission. Truly N-Space and Digital Extremes have left no stone left unturned when it comes to modes of play.The same can be said for the games soundtrack, which is classic high-fantasy. Its not as captivating as Pillars of Eternitys beautiful score, but it nevertheless sets the mood well. Ranging from bombastic to devilish, theres a track for practically every mood the game wants to elicit. The voice work is also spot on. Nearly all important dialogue between main characters is fully voiced. And the actors here really knocked it out of the park, offering voice work that is only rivaled by triple-A productionsand even then Legends may still prove to be at the head of its class. Its top-notch stuff. The visual presentation, though, is not as solid.We ran into some performance issues throughout the game (though these seemed to be less and less frequent the closer we got to the retail launch, what with N-Space cleaning things up and all), but they were noticeable just the same. The game looks really solid from its birds-eye, isometric viewbut when zooming in closer, there are some issues with texture work and the like. Characters also have a sort of action-figure look to them that Im assuming wasnt intentional. Their proportions seems a bit off, with sometimes stiff animations only accentuating those issues. Of course, there are times when the vistas in Legends are beautiful. Running through a forest with a waterfall spewing over the side of a cliff really evokes that grand adventure feeling; and its in these moments that Sword Coast Legends feels like a true D&D experience.Unfortunately, to achieve these moments the game will chew through GPUs and memory. Seriously, this game is a resource hog to the max. The Dungeon Master mode in particular made our rig sound like it was a plane taking off. And our setup is rather impressive in terms of system specs. We do want to take a minute to note how accessible and sleekly designed the interface is. Everything has a written description when moused over and simply the placement of icons, item names, quests and the like are all well-placed, never getting in the way of ones view. Closing Comments:Sword Coast Legends is a solid loot crawl with more options than most games of its kind. It may not be the Dungeons & Dragons simulator many were hoping for, but it works well as just a straight video game. There are some hiccups, mainly in the graphics, optimization and customization departments, but its host of modes, delightful story, clever writing and the ability to play player-run and -created campaigns solo or with others, on top of having a creation suite for those who want to play the part of dungeon master, all make for a content-rich experience. The combat and overall gameplay mechanics can prove a bit shallow at times, never offering the depth or tactical veracity of Pillars of Eternity, but as a hybrid of Baldurs Gate and Neverwinter Nights, Sword Coast Legends is a game that mostly excels in all that it tries to do. Post-release will be an interesting time, though, as the limited and sometimes restrictive options are opened up and iterated on by N-Space. Until that time comes, however, its a good game with the capacity to be great.", "date": "October 20, 2015", "grade": 4.0}