{"name": "Saint Seiya: Soldiers Soul", "ref": "https://hardcoregamer.com/?post_type=post&p=172884", "text": "Anime tends to come and go. One eras classic series is easily forgotten when the next big thing comes around. For example, there was a time when Golgo 13 was a big deal. Kids with parents that dont pay attention used to enrapture entire playgrounds by telling of the most insane, perverse things that happened in this, gasp, cartoon. Trying to find a modern fan of Duke Togo nowadays is more difficult than finding an Objectivist adherent with an accurate understanding of how society actually works. That is why the continued releases of Saint Seiya titles continues to be remarkable. These arent part of some big push to revive the series. They happen because people like it.Bandai Namco and Dimps Saint Seiya: Soldiers Soul sells its storied saga starring Seiya and the stalwart Saints. (Ill stop now) The story campaigns for this fighter retell the entire manga across four arcs: Sanctuary, Asgard, Poseidon, and Hades. Each arc contains multiple episodes. The episodes tend to be one of two things: cutscenes, or cutscenes with an occasional fight against an adversary. All told, these retellings are an interesting experiment in adding narrative to a fighting game. They do not quite reach the level of the last two Mortal Kombat titles, but the classic anime goofiness still abounds. Even better, someone who has never watched an episode can still follow the story if they start at the beginning.Additionally, there are the expected local multiplayer and online battles. When playing a fighter, local really is the way to go. Calling someone a (censored) with milk sauce can seem mean-spirited when broadcast remotely. When the other player can see the teeth in a smile, and subsequently remove them, there is a more enjoyable time for all. However, not everyone has that option. Fortunately, Seiyas net code ran flawlessly during tests. There was no lag detected, and no hesitation on the other players parts to eviscerate this reviewer.The look of the game, while not stellar, is sound. On PlayStation 4, the graphics are sharp and the character models are very detailed. There is flat texture work in some of the arenas that betray the titles cross-generational origins, but they do manage to capture the look and feel of an 80s anime without adding nonsense graphical filters like fake film grain. Overall, the bright and smooth visual presentation manages to surprise. The sound is where the presentation really shines. The sound effects all seem to be pulled from the original anime, including the easily recognizable laser chime that was so prevalent in this series as well its contemporaries. The music is suitably epic, foreboding, and cheesy in equal measures.Where the title falls from an easy recommendation to Saints Fans Only is in the actual combat. The system here is based around free running around the arena with simple combos. In addition to jump, there is a weak, strong, and ranged attack button that are used to string together attacks. Once the meter is full enough, a Big Bang attack can be triggered. There are also a few side things that can be used, like triggering 7th Sense, but these do not add to the tactical options. Anyone who tried Duel Mode in Warriors Orochi 3 know what to expect here. While not terrible by any means, the combat simply lacks depth. This is especially disappointing as fabled battle developer, Dimps, had their hands in this one.One other annoyance: when defeated, the player is taken to a game over screen where one can hammer the button to continue. During this time, Athena gives you a guilt/pep talk to encourage the player to get up. Cute on its own, and this is coming from a series neophyte, but how is she able to do this, especially in the opening arc, when she is unconscious with an arrow in her chest? Why would she take the strength to project her spirit just to nag? Snotty rhetoricalists want to know. Closing Comments:With dozens upon dozens of playable characters, arenas, music and art pieces to unlock using currency earned in game, series faithful will have plenty see and do before they are done with Saint Seiya: Soldiers Soul. Other players will find themselves wanting something with a bit more teeth. With a fighting system as shallow as a conversation with a cat, the single player mode boils down to which will break first: a newbies interest in the story or their boredom with the actual action. Trying to keep a second players interest for multiplayer based on the systems in place might be futile. Still, after the debacle of previous games based on this show, passable for fans is a step up.", "date": "Bohn on October 19, 2015", "grade": 3.0}