{"name": "Sid Meiers Civilization: Beyond Earth  Rising Tide", "ref": "https://hardcoregamer.com/?post_type=post&p=171157", "text": "The long awaited expansion to Sid Meiers Civilization: Beyond Earth is finally here. Rising Tide focuses on ocean development, but adds a lot of additional depth while, unfortunately, removing other elements essential to a Civilization game. Its a must for those who love Beyond Earth and even worth trying for those who were indifferent, but makes two major mistakes.Before delving into the most important thing this expansion does, fixing some of the things that were wrong with Beyond Earth, lets talk about the ocean. The oceans of Beyond Earth were barren places that only functioned as a barrier to colonization and location for the relatively two dimensional naval combat. The oceans now team with their own resources that look good, break up the monotony of the land tiles and feature new objects to explore. This effectively doubles the amount of the world that can be colonized and developed. Even better, aquatic cities function differently than land based cities.Aquatic cities have some different buildings and acquire tiles by moving around the ocean. While the move city mechanic is successful in theory, it would be better if you could, say, use military units or workers to claim tiles within two tiles of your city. As it is now, I just end up mostly buying tiles around floating cities because it would take a lot of moves to claim the full area around them. The strategy of moving large cities out and building new cities near where they used to be proves difficult because it requires lots of moves which each take multiple turns and you move your city through production which means that it might not be doing anything useful for 10-25 turns while it moves just a few spaces. The other problem is managing the citys resources during this process. As you move further out, you move out of range of your developed tiles and can end up with stagnant cities unless you purchase and develop the tiles ahead of time, thus circumventing the point of moving to acquire tiles. You dont seem to be able to queue city moves which becomes problematic when you reach the stage in the game when you have large numbers of cities. Its also unclear how city connections between aquatic cities are maintained; it seems as though none of the ocean cities are connected to the trade network, although this may have been the design choice. Frankly, the underwater cities in the Call to Power series would be preferable because you could build underwater magrail networks which could highly alter the relative geography of the planet. The aquatic cities do look great, though, especially on the menu screen. It should be mentioned that they look similar to the city in Stargate Atlantis, but thats fine because that city looked really cool.The oceans are also teaming with new sorts of life and alien nests. The aliens in Beyond Earth were rather simple in their composition, so adding this biodiversity helps immensely. There seems to be a new sea alien, a couple of new land aliens and a new amphibious colossal alien. This is a good set of additions and that the alien types are now diverse enough to be interesting, although they lack the mystery of the mind worms in Alpha Centauri. The best thing about aliens now, though, is being able to capture them and use them against your enemies; this was a great feature of Centauri which has been adapted well here. You can make aliens capture a military strategy unto itself and I keep my explorers by alien nests near enemy civilizations so that I can steamroll them with a couple dozen aliens on top of whatever else Im bringing in the event of conflict. There are plenty of great unit additions in Rising Tide. There are now melee as well as ranged ships which need to be used in conjunction. The AI often spams melee ships, but that makes strategic sense and you need to spam them right back. There are a diversity of new and useful orbital units. While this system is great, especially the military satellites, an overall satellite management system would have been nice. Stations seem to be less survivable in Rising Tide (or maybe it was done with patches or how it was on release), however you can now launch satellites to protect them and increase trade yield. Most of the new hybrid affinity units serve interesting support roles, adding new dimensions to ground combat and encouraging you to build powerful deep assault forces with lots of tricks up your sleeve.Not only do you have new Hybrid affinity units, you also get hybrid affinity bonuses. This doubles the number of potential focuses for your civ, although there are no hybrid victory conditions. This gives the game more character because it could be said that the lack of meaningful civilization bonus diversity is somewhat mitigated by the fact that your civ *can* develop in numerous interesting ways. Espionage has also been enhanced substantially. I ended up recruiting a good percentage of my units through espionage in the mid game and was even able to cause a coup in an enemy capital during a war which essentially defeated him. Espionage is now a much more useful component of the game and something you can focus in for great benefit. Itd be nice if more could be invested in covert ops, though.]. I still miss the old spy system of Civilization II where there were actual spy units and I could have a very espionage-based civilization and could divert my economy into this rather than military units or domestic investment (buildings). The new agreement system is a terrific feature, giving incentive to work together with other leaders and have peace. The political capital system is a great way to manage this. You get points per turn for certain buildings that can be spent on traits which are new civ bonuses or, if another civ likes you enough, pay them points per turn for useful bonuses and vice-versa. The new diversity of messages in the respect system is refreshing. Leaders dont just insult you as you start to win, but instead tell you something meaningful. This is extremely useful and gives you a window into what youre doing well or poorly and what is upsetting the other civs. When it comes to the points, however, all you can do with them is cooperation agreements and alliances. This is because the agreement and respect system is all there is to diplomacy now. Rising Tide removes the old diplomacy system in favor of the agreement and respect system, which is unfortunate as the Civilization diplomacy system was great. You could exchange anything for anything if both parties agreed; its hard to see the reasoning behind replacing the diplomacy system because the systems seem compatible. Its nice to see the developers trying new things, but the net effect of this change is negative.While the gutting of the diplomacy system is a misstep, its not as large a misstep as the new peace system. You can no longer specify your own terms in a peace treaty, with the terms now automatically chosen. Opening the diplomacy window reveals a prepared list of what cities will change hands to stop the war. As your war score gets higher, however, your demands get more outlandish and they seem equally unlikely to accept. I like the idea of a war score like in Europa Universalis IV, although the war score in that game is determined by what you could ask for in terms of peace, not what you had to ask for. This causes me to have to prosecute every war to conclusion (since I cant get them to accept peace) even if thats not what I feel like doing. Its hard to imagine why theyd implement a new system that is so different from anything seen before, but this problem almost breaks warfare and frankly needs to be immediately patched. Furthermore, for everything that has been fixed and improved in Rising Tide, there are still lots of lingering problems with Beyond Earth. Differences between civs remain minimal. I like the covert ops civ, which is actually a bit different from your standard fare, but its not worthwhile to play as all the different groups like it was in previous games because the experience is almost completely unchanged. This is a rather big problem for a civ game, where the substantive differences between factions give the game its character and are key to its replay value. Alpha Centauri did this beautifully with mechanics, wonder videos and game text (I still remember Santiago explaining the Nano-factory in a wonder video) and this continues to be one of Beyond Earths biggest drawbacks.I had hoped that this expansion would come out far more polished than the base game which had to undergo patching so significant that if you happened to be playing a game during the patch process, your civilization would be totally broken every time the Steam icon turned green. Unfortunately, this is not the case. Ocean trade paths seem glitchy; they go over land and allow connections that would have been otherwise impossible. There seem to be national wonders in the Civopedia which cant be found in the game. Also, many games that you play over long periods these days dont seem to think you need a big continue button at the top of their menus. I just cant fathom why that is. The problem isnt as acute here as it is in some other games which have long load times for menus, but I have accidentally started new games over a dozen times by clicking without thinking in the menus. The trade system could also generally be reorganized, as a higher level view or at least sorting by yield is needed. Just not having them renew was a band-aid, an essential band-aid, but something more permanent needs to be designed and implemented. Closing Comments:Rising Tide looked to be one of the biggest and best Civilization expansions ever because of the new artwork, mechanics and fresh take on ocean cities. The new content is undeniably great; the new units add depth and strategy and taking control of aliens gives you a fresh way to play the game militarily, which is quite interesting and fun. Hybrid affinities fill in those clear gaps from the base game, diplomatic agreements make peaceful relations more interesting and espionage is highly improved and can now be leveraged for real gain. Unfortunately, not everything has been fixed: trade, faction distinction, the diplomacy system and the look of the game in particular are issues. Civilizations anything-can-be-traded-however-unlikely diplomacy system was a key element of the game and seems to have been removed and the war and peace system is broken as stands. Hopefully this will all be patched at some point, the way Beyond Earth had a significant patch history, as Rising Tide brings a number of positive changes to the table.", "date": "October 8, 2015", "grade": 3.5}