{"name": "Ghostwire: Tokyo", "ref": "https://hardcoregamer.com/?post_type=post&p=420586", "text": "Every once in a while you come across a game youre grateful for in what it offers as a distraction. Not in a way that automatically dismisses the core gameplay, but on a brighter note, signals a game whose more optional content is more captivating than youd otherwise have given credit for. But of course that latter sentiment isnt entirely true with a game like Ghostwire: Tokyo  having discussed twice over how Tango Gameworks latest titles most impressive aspect was in its surrounding material. Namely the rendering of a muted Tokyo ward. Specifically that of Shibuya and its surrounding neighbourhoods  a broad region of the city that in a way, somewhat comically, has become to RPGs what the Golden Gate Bridge is to mandatory action in modern-day films.Yet unlike the Golden Gate Bridge, Tokyo was (and here, still is) not one of destruction or complete disarray in its visual set-up. Instead, its Ghostwires eerie and awkward conflict of silence and rowdy activity running on autopilot thats appealing. That insistence on capturing this part of Tokyo as if in a freeze-frame  to borrow a recently-used descriptor  all the while its many shops, restaurants and public announcements continue on as if nothings happened. If theres one thing Tango gets right, its in the vibe and tone of a city having lost its human voice. Its many hundreds-of-thousands of voices. A welcome sentiment that thankfully extends to that of other means of interacting with its world, namely its exploration and of course, the act of figuring out how to traverse not just on ground, but up above from roof-top to roof-top alike.The main highlight of this game is of course its world: exploring it, casually strolling through it, leaping above and around it. Regardless of how insistent (or addicted) you found yourself to its blatant collectathon temptation that is hoovering up every stray spirit you stumble upon. As meaningless the rewards may seem in the long-run, what Ghostwire: Tokyo fundamentally acknowledges and prioritises in its design is not on the end reward in of itself, but rather the sheer satisfaction in figuring out that ideal route from A to B. Basic a design principle it might be  Ghostwire is far from the most original philosophy when it comes to encouraging its player to engage with its level design  its easily the type of game whose continuous temptations hardly ever lose their lustre. Thus, a grateful aspect whose very presence you look back on with both surprise and a smidgen of dismay. Because last time I spoke of ones experience with Ghostwire: Tokyo, I briefly muttered my current play-time of around a dozen-or-so hours. What I didnt disclose was that this was a result of the games convincing me to deviate away from the main route to end credits. A route that, if the world of Ghostwire has none of the gravitas it had on me, you can clear and beat in little more than around eight to ten hours. And come the end credits where regardless of ones investment in side activities, an underlining thought creeps up: ohthats it?I wont go as far as to say Ghostwire: Tokyo feels incomplete or rushed, but you cant shake off the feeling that Tangos latest effort seems like its trimmed too much off. A sentiment that is in part due to a plot that establishes, scales and is so quickly resolved it barely spends time in exploring the in-between. Be that the paranormal nature of its premise or the handful of characters it focuses on. The closest the game attempts to exploring the background, motives and reasons for its protagonists and antagonists alike, settled in little more than mere cutscenes and forgettably-paced finales alike. Without spoiling anything here, even the (what itself would like to deem, Im sure) subversion of a climax lacks any of the weight its going for. And this is down to how hurriedly-paced the overall game feels  how it rarely invests any time with its characters beyond a passing remark or flash-back that initially teases a grander spot of exposition, but doesnt deliver on. Such is the off-guard nature of the over and done with pace. Theres a point late on where a motorcycle  and the obligatory fetch-quest that ensues  is introduced and your immediate thought is naturally: oh, this is the point the game gives me something to get around the world easily. Nope, that motorcycle is only ever used once and its in a cutscene to get you to the last story-critical objective. Ghostwires point-of-no-return marker if you will. Six chapters after booting up a new game, youre done.It might all seem obvious in hindsight, but you cant help but double-take and ponder at the reality that this isnt some first act or lead-in to much grander narrative or world-building implications, but is the whole game in totality. Let me be clear: the argument isnt that Ghostwire: Tokyo should be longer for the sake of being longer, or that Tango need to find a way to artificially and shallowly inflate the run-time. Be it through grinding or unnecessary objectives dotted about the map. Rather, Ghostwire perhaps mistakenly gives off the impression that things are only getting started, only for the premise to wrap itself up with little weight or impact to suggest what one has gone through has been much of an accomplishment. While not detrimental, its not much of a spoiler to state you dont even get some upbeat epilogue-like scene of a city bustling with people again. Main protagonist Akito comes to a conclusion of sorts and goes on his merry way  roll credits. Add all these niggling little nitpicks up and while this is by no means death by a thousand cuts, Ghostwire: Tokyo can at its worst, seem too thin on impact.Its only because the exploration aspect of the game is so rightfully centre stage that Tango manage to salvage what couldve been a deflating response to what Ghostwire offers up. As mentioned, its an aspect that  unlike the narrative and main route progression  the studio have thought long and hard on how not just to construct, but to tempt players back again and again. Whether thats how selective Ghostwire is in the very placement of bird-like Yokai to grapple onto  so as to easily reach roof-tops on first pass  or with how stray Spirits are placed that immediately ask questions on how to even reach them. Mechanically its not the most complex of gameplay systems, but its in the structure and level design that keeps this part of the game as entertaining and as consistently-inviting as it is. Regardless of how close (or liberal) a 1:1 rendering of this part of Tokyo it is  on how much you can put down to genuine imagination compared to simply replicating what already exists in real-life.Not only that, but as previously stated: when it wants to be, Ghostwire: Tokyo is visually intriguing, both technically and artistically alike. The former side, one that even PS5 owners will find plenty to admire. Namely in the way illumination, colour and reflections are wonderfully utilised. That early-game moment of staring in awe on how electronic advertisements and building signs reflected back in puddles of rain-water? Ghostwire: Tokyo offers ample examples where you cant help but freeze on the spot and soak in all that a single instance can illustrate. If not in complete awe, respect for what Tango have managed to pull off. Its a game you involuntarily decide against sprinting through  deciding instead to casually stroll through its many grimy back-streets and brightly-lit districts alike. For those who have the hardware or at least the resources to see this playing on higher-end screens or monitors, its worth it. Granted, if were talking strictly the PS5 version of Ghostwire: Tokyo, its application of the systems features are overall admirable, if not groundbreaking. Its spatial rendering of audio, namely rain-drops, may not have the eye-widening timbre of something like Returnal, but you cant knock Tango for dedicating the resources. And overall, its one of the games best decisions.Even without any mention of hardware or platform specifics, on a pure aesthetic front, that contrast plays well on its own when talking about the paranormal premise. That surreal reality of convenience store music and a myriad of music genres still playing while corporeal entities stalk the streets, sounds like an awkward match. And while not the main focus, Ghostwires occasional pockets of such a mismatch do compliment the overall tone the game is going for. This can all sound like this is a game more about spectacle and presentation than its interaction but again, when taken strictly on the basis of gameplay, its not that Ghostwire: Tokyo is intentionally absent of such areas, its that what interaction there is, doesnt hit the same highs. Namely its combat, though serviceable, its by no means an area many will be writing glowing reports about. Though things arent helped by the feeling that the defining of serviceable seems to be an eventual devolving into spamming projectiles just to get through the next encounter, random or scripted alike.Thats not to say there arent reasonable bits of nuance and means by which players can get invested of their own choosing. Figuring out which of the three main elemental attacks work best when dealing with specific enemies is the first. Green wind energy being your standard, single-shot projectile; blue water types creating a wider if shorter-range arc so as to attack many foes at once; then lastly theres the red fire type that is the most powerful but is one whose holding ammunition is scarce. The fact each element type has its own carry limit does admittedly encourage players to think carefully on how they play and to pick their shots carefully. But its one that eventually doesnt have as far reaching an influence given how quickly and easily proceedings get in resorting to randomly spamming ones way to victory. Other subtleties like the idea that extracting an enemys core  rather than simply blasting a foe to pieces  restores a smidgen of health, are similarly welcome additions. Additions that also play into the stealth aspect of Ghostwire: Tokyo. One that itself is charitable when it comes to how long it takes for enemies to spot you and how easy it is to retreat and reset proceedings should you find the necessary hiding spots or corners to wait around.But even the combat, like the narrative, feels like another unintentional victim of Tangos hurried pacing. That hurried mentality  so too a lapse in quality over quantity  can unfortunately result in performance issues, albeit at only a handful of occasions. Even when choosing to prioritise frame-rate over resolution, enough enemies and accompanying particle effects can cause the performance even on PS5 to tumble as low as around 15-20 FPS. Perhaps what sours things more so is that in Ghostwire you can identify the flickers of greater promise, but that which hasnt been explored as deeply due (again, it seems) to time constraint. Another scenario I briefly alluded to in my first impressions piece is the fact that later enemy types have the ability to detach KK  the secondary protagonist of the game, the one who possesses Akito at the beginning and grants him his powers  from your person. Resulting in a temporary loss of powers and restricted means to counter enemy attacks, requiring you to rush in and reunite with KKs spirit so as to regain your abilities. But again, just like certain sequences where your powers are cut off, these moments are  visually appealing and novel given the placement in the story  sadly under-utilised.Instances that are saved once more and perhaps defined above all else by their visual design. Not least in the more scripted set-pieces that find the paranormal-influenced Tokyo streets replaced by more bizarre and distorted interpretations. A stand-out moment taking place in a neon-drenched apartment complex seemingly flipped on its side. Not that dissimilar to moments peppered throughout previous works The Evil Within and its sequel, this is clear-cut proof Tango can be artistically creative with where they pit players. As disjointed a transition these may provide, the ability is clearly here. There just isnt enough of these moments, even in the context of Ghostwires brief main campaign. And while not the biggest culprit, its a shame that such encounters further down the line end up resorting to little more than do thing three times or keep shooting until its down.Closing Comments:A common criticism youve no doubt identified throughout this assessment is that certain aspects dont offer enough  not least when the foundation is clearly there  to give Tangos latest that critical edge over its peers. Even with a new IP, the team are yet to make their perfect or complete game. But while its easy to pick apart that which is lacking  and there are a few areas where thats the case  its no detriment to what Ghostwire: Tokyo undoubtedly nails. Namely its presentation and above even that, the desire to explore this gorgeous-if-unsettling vision of Tokyo. Even if youre someone lacking the personal biases or desires to hoover up every last stray Spirit out of some embedded collectathon habit, this is a locale that will quickly convince you to spend that extra bit of time climbing buildings, leaping across roof-tops and generally getting lost amid the grime, the rain and the vibrant colour alike. An eight to ten hour plot that can so quickly stretch out to around 15  20 hours defined more by pure satisfying exploration. Tangos technical handling plays its part, but its thanks to its level design and suggestiveness on top where the game is at its best. The moments in-between  especially those the game deems most critical to plot and progression  may not have the same punch, but Ghostwire: Tokyo though brief just about shines through where it matters. A journey you will actively and quickly decide against sprinting through.", "date": "March 21, 2022", "grade": 3.5}