{"name": "Ghost Blade (Dreamcast)", "ref": "https://hardcoregamer.com/?post_type=post&p=169184", "text": "Had you told us fourteen years ago that wed be playing a brand new Dreamcast game in the year 2015, we wouldve looked at you like you were crazy. And yet, here we are fourteen years after the Dreamcasts death, in 2015, reviewing a brand new game for Segas last console. Its a strange, strange world. Nevertheless, Ghost Blade is the latest title from developer HuCast Games, most known for their hits Dux and Redux, that like Ghost Blade are also shmups. While their past works have been divisive in terms of fan reception, Ghost Blade seems like itll be less so in the sense that its exponentially better than all of their previous efforts.For anyone whos been following the game since its announcement, it may be apparent that the finished product here does not look quite like what we were led to believe it would in those early screenshots (which now we probably can call more concept art than anything). Though Ghost Blade is a slick looking Dreamcast game-  especially for those with their console running through an S-video component  it is not nearly as pretty as we had hoped. For instance, that stage we were shown long ago with the animated water background is not anywhere to be seen here. So the gorgeous backdrops we thought we were getting have instead been replaced with ones that are a real mixed bag in terms of graphical fidelity. Some look really nice, while others lack detail and will be forgotten about the moment the game concludes.Whats more irritating is how bullets seemingly blend in with those background, making for a frustrating gameplay experience. Perhaps the biggest faux pas in Ghost Blades presentation is the animation employed when using one of the ship bombs. These are screen-clearing attacks that wipe out any enemy around. Unfortunately, using one triggers one of the most jarring animations ever seen in a game. Its small hiccups like this that make the game not the visual powerhouse it was touted to be. Suffice to say, Ghost Blade could have been the most beautiful thing on the Dreamcast, had it taken full advantage of the machines capabilities. As it stands, however, its middling at worst and inconsistent at best. While on the topic of presentation, Ghost Blades audio fidelity is less than impressive. There are some tunes that bolster the exhilaration felt when weaving in and out of walls of bullets and its during those moments that the game shines and shows what it has to offer. Unfortunately, those instances occur less frequently than whats ideal. Most of the soundtrack is devoid of anything terribly compelling. There are so many STGs out there that have memorable soundtracks-  ones that are comprised of songs we can still recall (Bullet Soul and the DoDonPachi games immediately come to mind). Ghost Blades OST is not in the same league as those titles. Although the game comes with a soundtrack CD, we cant see many people popping it in for their listening pleasure. Its a shame too, because early videos of the game showed off some jams that sounded quite lovely. It just didnt seem to come together for Ghost Blade in the end.Gameplay-wise, the title is also a mixed bag. For starters, this is one of, if not the single easiest shmup Ive ever played  easier than the aforementioned Bullet Soul and thats saying something. There are two difficulty options: Normal and Easy. We literally 1CCd Easy in two tries, and then 1CCd Normal in three times that. Mind you, while I love STGs, Im not very good at them. So for me to be able to 1-credit the entire game after only putting two hours of practice into it really speaks to its challenge level (or lack thereof). Of course, this could be a wonderful thing for newbies of the genre. In fact, Ghost Blade is arguably the most accessible title in its entire genre. So newcomers wanting to get into the scene should start here, because itll be a great learning opportunity, and youll have fun along the way. Unfortunately, most of the people going out of their way to buy a Dreamcast, or dig out their old one, just to play this are probably already hardcore fans of the STG genre, meaning they wont find merit in the game being an easy entry point. They need something that meets their needs and Ghost Blade wont in that respect. Now, thats not to say Ghost Blade isnt fun. In actuality, we really liked our time with it. We had fun. Even with it being easy, its a genuinely enjoyable vertical-scrolling shooter. The shooting mechanics are basic, sure, but they make sense and are rock-solid. Theres a focus-fire attack, spread-shot attack, and of course screen-clearing bombsso all the essentials have made the cut. Bullet patterns that folks will dodge are also nice, if a bit uninspired and sparse at times. Wed argue that the game doesnt really pick up the pace and start throwing interesting/challenging bullet patterns at players until around stage 3, but those last few levels are really a blast. Having three separate ships from which to choose is also a nice addition, as each girl and her accompanying craft play fairly distinctly from one another. So that aspect will increase replayability. Ship designs are also rather nice; even the more throwaway enemies have been given care. In fact, design, from top to bottom, is one of Ghost Blades strongest aspects. Bosses look especially interesting.Unfortunately, the game is over too fast. With only five stages and no extra modes other than a training mode and a 2-player mode (that are rather hectic), there just isnt a whole lot to do here. There are leaderboards, but theyre not onlineso folks will only have themselves to compete with in that regardwhich will be enough for some. Whats most disappointing is the fact that Ghost Blade was originally billed as a caravan shooter. But, lo and behold, there is no caravan mode to be found. Again, this is a game that just couldnt deliver on all it promised in the early goings.Worse still is the choice to make bullet colors a very faint hue. This would not be an issue if said bullet color contrasted well with the stage backgrounds. Sadly, because of how faint they are, its super easy to lose sight of them. In fact, had bullets been a vibrant, easy-to-notice tone, we probably would have 1CCd the whole thing faster. But instead we found ourselves dying due to not being able to see the bullets coming our way. SaiDaiOuJou also had this problem. This is super frustrating because dodging bullets is integral to the experience. So, to not get that right can severely limit the enjoyment factor. Moreover, the controls too are not as tight as we would have liked. It was hard to put our finger on what about the controls felt off, but the best we could come up with is they vacillated between floaty and a little sluggish in response time. We never died because of this, but it took some getting used to. Once we did though, it was smooth sailing; so thats a minor quip.Lastly, and most important in terms of criticism, the game stutters. A lot. Frame rates dip below 30fps, especially if played in tate mode, and there are parts of levels that chug for seconds on end even in traditional orientation. We are fine with some FPS drops, most shmups have them  to the point that theyre expected  but this baby slows to a crawl at inappropriate times, even when theres not a lot happening on screen. Is it still playable? Absolutely. Is it annoying? Absolutely. Should this have been worked out before launch? Absolutely. Closing Comments:The Dreamcast has played host to some great shoot em ups over the years and even the indie projects that have released post-mortem have been note-worthy. Sadly, Ghost Blade is not among the upper echelon of those games. Its not a bad game  it really isnt, despite our complaints. In fact, its developer HuCast Games best title to date, easily trumping Dux and Redux, though still not on par with N.G:Dev.Teams work. Its a perfectly competent shooter and is even quite fun. Frustratingly, its never anything more than that. Ghost Blade had so much potential, but needed more time in the oven.", "date": "September 28, 2015", "grade": 3.0}