{"name": "Chocobo GP", "ref": "https://hardcoregamer.com/?post_type=post&p=420285", "text": "When Chocobo Racing first released on PS1 the reception was mixed with some positive outlooks on the unique racer Squaresoft had crafted for the time. Now over ten years later Square Enix has given the series another chance in the limelight. Upon its reveal most fans were ecstatic that the cult classic was coming back once more. It looked great as well, seemingly taking ideas from Mario Kart and giving them Final Fantasy twists. While the initial reveal was positive, that began to wane when it was revealed there was going to be a Season Pass included and the iconic protagonist Cloud locked behind it. This was ultimately the beginning of the end for what could have otherwise been an enjoyable kart racer.Theres a story mode for Chocobo GP, but its nothing to write home about. The story is a generic and bland one about the titular Chocobo and friends competing in a race, but things turn awry when theyre stopped periodically on their journey to compete against others which ultimately comes down to a clash against an antagonist that ends with little fanfare. The voice acting, despite having a good cast, is grating to listen to. The campaign is short and unlocks most characters, aside from a few that are shoved in a shop to purchase with one of the three currencies that can be earned. While its worth playing its advised to skip the cutscenes cause they can be annoyingly long and not at all entertaining or amusing despite how hard they try to be cheeky and poke fun at old Final Fantasy tropes.Gameplay in Chocobo GP has a good few modes to select from such as Story, Time Attack, Series Races, Multiplayer and the real time event-based Chocobo GP. Racing itself is straightforward and familiar to anyone who has played modern Mario Kart titles. The key ability is drifting to get a speed boost, but in addition to this each character also has their own unique skill thats charged up over time and can be unleashed to either attack or speed them up. There are also magicite that can be collected as usable spells to hinder opponents or aid the current driver. Many magicite spells can be improved by collecting more of the same kind to have stronger effects, which is key especially when playing online against others to stand any chance. Online is one of the few positive experiences Chocobo GP has to offer. Its enjoyable racing against others to be the best, but it also depends on the mode chosen assuming players arent going up against their own friends. The regular multiplayer mode is the fun, casual experience. Although seemingly one thats hard to get a party going in. Setting up a lobby is simple and straightforward enough, but it led to waiting around for over twenty minutes with no one joining at all which was disappointing to say the least. This is mostly because the other online mode is the focus due in part to the season pass. The biggest and most-populated mode is the Chocobo GP, in which a group of 64 players slowly gets slimmed down race by race until there are only 8 remaining for the big finale. This is fun in concept as only the top four proceed to the next round making it an exhilarating experience, but its also a shame that so few players are doing the regular multiplayer mode because it does not reward points for the season pass.There are three currencies that are used in Chocobo GP. The first is for single player, which unlocks most story characters in addition to their extra vehicles and skins. Theres another specifically for online which is earned through multiplayer racing and gaining levels in the season pass. Lastly theres the premium currency, fittingly called mythril, which is used to buy the most sought-after items in addition to of course being locked behind real money or login bonuses. The first login bonus is 800 mythril; conveniently just enough to buy the Season Pass that will unlock Cloud at level 60, which is far from an easy grind. This mythril also might as well be used immediately as it will expire after a mere five months. This is utterly egregious and a disgusting practice for any sort of title with premium currency that, outside of occasional login bonuses, costs real money. If anyone decides to spend their mythril on any other item theyll be immediately locked out of Cloud until they manage to earn enough again  which is just another painful grind that wont come quickly without coughing up more cash. Hopefully theres no plans to include this five-month usability for any myhtril armor in the next big Final Fantasy title, although it might not be surprising at this point.Visually, Chocobo GP is nice to look at. It looks polished all things considered, running smoothly when racing online with a full group of others from around the world. The music is fine, but not particularly outstanding. Theres an exception, however, in that the title theme is absolutely ear-shattering. Its just listing the names of races and items and repeats so often that its better to mute it instead of listen to the obnoxious music while deciding what mode to go into next. The control setup for Chocobo GP could also use refinement. While there are options to change it, they are online pre-set changes and not fully customizable which makes for a bunch of control schemes that never feel right to use.Closing Comments: If Chocobo GP had been a free-to-play title, most of the criticism would still be here, but it would at least feel more appropriate for what it was going for. At $50 this racing title with live-service approach is hardly worth it for anyone who values their time. The races can be fun under the right circumstances, but it will get repetitive fast and the annoying menu music will never get any better. Its likely that many things will be addressed such as the lack of variety in tracks as it seems possible more will be added down the line. Right now at release, however, Chocobo GP is utterly barebones and pales in comparison to so many other kart racers before it. Its a disgrace to see this title even released how it has, especially when Mario Kart 8 is getting a DLC expansion thats half the price in a little under a week. To give credit where credit is due, Ben the Behemoth is a cute character that would probably have an adorable plushie worth buying, but its not enough to make Chocobo GP worth picking up for anyone.", "date": "March 14, 2022", "grade": 3.0}