{"name": "Sakura Swim Club", "ref": "https://hardcoregamer.com/?post_type=post&p=168264", "text": "Steam has been around for over ten years, yet it was only within the last few that visual novels finally got their chance to shine on the digital distributor. Since those first formative steps, and the introduction of Steam Greenlight, the service has been absolutely swamped with all manner of visual novels. With that said, it was in 2014 that developer Winged Cloud launched Sakura Spirit on Steam and stumbled on the fact that gamers were looking for titles with copious anime fanservice. Since then, theyve created not one or two but five other titles in the Sakura series, with even more on the horizon. As of right now, the latest is Sakura Swim Club is completely unrelated story wise to any previous entries. The premise is quite simple. You play as the new guy in school named Kaede whose father is a total prodigy that made a great name for himself over the years. Unfortunately, he pushes Kaede to be just as incredible  and as such, he does everything in his power to stay decidedly average. School is outrageously boring to Kaede but something about this newest one draws him in. There are rumors about the swim club that keeps everyone away. Its this total mystery which pushes him to pursue the truth, and join the club in the process. There he finds just two other members: Hiromi and Mieko. Although both initially lash out at him (related to the fellow just always being in the right place to see fanservice sequences), they quickly welcome him to the team as the third member of their swim club. From there, the story takes itself in a fairly predictable trajectory, with a variety of super dramatic subplots thrown in before theyre ultimately ignored. The writing stands about average with Sakura titles which is to say its comprehensible but not particularly an enjoyable read. Alongside a few typos remaining in the current version, theres a real lack of creativity or spirit to the cast. Both Mieko and Hiromi are caricatures who in no way feel realistic. Kaede, while given a bit of an interesting backstory, acts more as a viewpoint for players to get an eyeful of anime skin than to become an interesting guy in and of himself. Other characters, such as Kaedes parents and a dutiful teacher get even less characterization and act as incredibly simplistic means to progress the plot. They might as well have spoken like the adults in a Charlie Brown cartoon. With all that said, it may actually be unfair to criticize Winged Cloud for their games writing because it is becoming increasingly obvious what the goal of their work is. The Sakura series was never meant to be the Citizen Kane of visual novels. It was meant to be a way to get some sexy anime art into the hands of folks who appreciate that sort of thing. So, lets look at it from that viewpoint. Even then, its fair to say that Sakura Swim Club does not attain its goals, and in fact makes a bit of a fool of itself in the process. First, the fanservice in the Steam release is ridiculous in its frequency as well as its inability to titillate. Sakura Spirit may have once enticed gamers with its shocking displays of shiny cleavage, but the series has since gone quite far with depictions. This game actually steps back from that with less-revealing, if more eye-rollingly implausible CG.Now, some fans may be shouting at the screen about the fact that there is an uncensored patch freely available for Sakura Swim Club. I am aware and, as the dutiful reviewer that I am, installed it and played the game through once again to get a complete view of what Winged Cloud did. This is the first time sex sequences have been implemented in a Sakura game, but they very likely wont be the last. Again, you cannot get these scenes just by purchasing a copy on Steam. Without delving too much into the topic, there are four (five if you count an alternative scene) sequences in all and each last about a minute. Its very obvious that this is their first foray with such material and it lacks any real finesse because of it. Again, while Sakura Swim Club aims for erotic intensity, it is simply a dud in that department. So what is left to make Sakura Swim Club stand out? This game still retains the same art style as almost all the other releases (barring Sakura Beach). If you like that, thats great, but theres nothing more to say about the anime artwork. Well, aside from the artists (or directors) obsession with ensuring certain characters wear striped underwear every day of their lives. The music is rather goofy and tends to make the whole game feel like it treats itself as a joke. If thats the case then the developer is definitely laughing their way to the bank with how many sales these games continue to generate. Most players should be able to beat this visual novel in one to three hours. Despite a few choices here and there, the story plays out the same, meaning you cant even work for additional endings. Closing Comments: Sakura Swim Club is a visual novel for people who dont really care about visual novels. If you do hold an affinity for the genre then youve probably dismissed the series up to this point. Continue doing so, at least until a title distinguishes itself from the lineage of its predecessors. This is not that game. Instead of attempting to hone their craft with a more nuanced, interesting story (as seemed to be the case with Sakura Fantasy Volume 1), theyve veered fully into the path of pure fanservice. At this point, though, they are still a long way from mastering such a singular focus.", "date": "September 24, 2015", "grade": 1.5}