{"name": "FIFA 16", "ref": "https://hardcoregamer.com/?post_type=post&p=168450", "text": "FIFA has always been odd in the fact that its the only EA series thats not intended first and foremost for the North American market. This makes absolute sense, however, given that in practically every country outside of USA and Canada, soccer rules supreme. Quite suddenly, however, weve seen a paradigm shift that is seeing the North American market become a priority. Last years FIFA 15 was picked up by an entirely new audience riding the wave of the exciting 2014 FIFA World Cup and this year sees that audience increase even more after the sensational 2015 FIFA Womens World Cup. While womens sports popularity almost always play second fiddle to mens, the recent Womens World Cup proved immensely popular. More than twenty million people tuned into watch the final against Japan, which set a viewership record for any televised soccer game in the United States. EA has shrewdly taken advantage of this historical success and has added women into the series for the first time, alongside a bevy of updates.Considering that this is the feature that most North American players are most excited to hear about (which is awesome), lets get straight to the women. FIFA 16 allows players to play as Womens National Teams including France, Germany, USA, Australia, Sweden, England, Brazil, Canada, Spain, Italy, Mexico and China. While many womens teams have been excluded (baby steps), the most inexplicable one is Japan, who went up against USA in the finals. Its a shame their club isnt included as not only are they undeniably great, but being able to recreate the World Cup finals in-game would have been swell. Not only are their now women in the former boys club, however, but they look strikingly similar to their real-life counterparts thanks to all-new in-game animations, life-like head scans and 3D player modeling that saw many of the best female players head into EAs studio. Modes for the Womens National Teams include Match Day, Online Seasons, Online Friendly Matches and an offline tournament. So while its not nearly as complete as the mens side, its a commendable first step and simply having option to play womens soccer really is great. The next biggest addition to FIFA 16 is FUT Draft, a new mode and way to play FIFA Ultimate Team. This mode tests team-building skills as players pick the best fit for each position from a five-man draw. Players begin by choosing between five different formations that will remain as their default formation throughout the matches. Next up a captain is selected from a set of five stars and then the rest of a 23-man roster is filled by picking players  including Legends on Xbox consoles  for each position from a random draw of five players. Once a team is assembled, players then compete in a four-match series solo or online, earning rewards, coins, packs and more along the way. While a FUT Draft series has an entry fee of 300 FIFA Points, 1 Draft Token or 15,000 coins, a lost match results in a reward matching the value of the entrance fee, so its low risk. Although it sounds simple, FUT Draft is an impressive addition to FIFA similar to Madden NFL 16s Draft Champions thats just as easy to learn as it is to become addicted to.FIFA 16 also boasts an improved career mode that adds Pre-Season Tournaments and Player Training to the mix. In the pre-season tournaments, the players club will be invited to three out of a possible nine tournament played in Europe, Latin America, Asia or North America. The matches allow players to hone the tactics and skills of their team to get a feel for where they stand before the games start to count. In Player Training, managers are able to train their squad to increase player development, allowing up to five squad players to train from numerous training drills. This mode allows more growth for young players to increase transfer values or form a formidable roster of rookies. Career Mode also brings with it year-long scout reports, friendly subs, improved transfers and the ability to sign free agents outside of the transfer window. FIFA 16 always introduces a myriad of gameplay tweaks. On the defensive side of things, new AI gives players better awareness of dangerous space on the pitch, allowing them to track back to stop advanced attacking runs. Players also now anticipate passes and move to shut down passing channels and options, looking for more opportunities to play through the midfield. Theres also new standing, slide and fake tackles that make attacking the ball more responsive. Finally, there are twenty-five feature changes to mobility and locomotion that allow defenders to close down space and quickly change direction. Offensively, passing has been improved with the help of ping-driven ground passes to help locate teammates in tight spaces. A new dribble control system has been added that allows for separation between the player and the ball to perform skill moves without having to touch the ball. Finally, better placement of the foot gives players more variety in shooting at the net, allowing where the ball is struck to be felt to allow for adjusting the approach.Much like practically every FIFA before it, FIFA 16 offers a fantastic soundtrack that tops every other EA Sports offering. Maybe it says something about the personality of soccer fans, but its always refreshing how stacked FIFAs soundtrack is with indie rock and emerging artists. Standouts include Becks Dreams, Miami Horrors All it Ever Was, RACs Back of the Car (who also just did the entire score for the excellent Master Spy) and Unknown Mortal Orchestras Cant Keep Checking My Phone. The amazing thing about the soundtrack is how well the developers seem to have their pulse on the music world. Foals Mountain at My Gates is from an album that released three weeks ago, while Baios (of Vampire Weekend fame) Sister of Pearl is from his album The Names that just came out this past Friday. Having this great music in the background makes FIFA 16 all the more pleasurable. Closing Comments:Much like its predecessor, FIFA 16 is likely to be picked up by a brand new audience purely thanks to the fact that professional soccer is growing exponentially in popularity in North America. Thankfully, newcomers and veterans alike will find an excellent game of soccer that yet again takes advantage of the higher processing power of current-gen consoles to deliver an experience more realistic than ever. Simply having the presence of the Womens National Teams is a huge boon to the series that adds another exciting dynamic. That added to the instant gratification of FUT Draft and the impressive gameplay tweaks makes FIFA 16 a clear winner.", "date": "September 22, 2015", "grade": 4.0}