{"name": "Volume", "ref": "https://hardcoregamer.com/?post_type=post&p=165023", "text": "Pure stealth is so hard to execute properly that it seems as though developers are moving towards improvisational stealth as the new genre norm. Games like Far Cry 3 and 4, Dishonored and Metal Gear Solid V: Ground Zeroes give players an incredible amount of freedom, which prevents those frustrating moments that arise when you lack the tools to fight after being discovered. For a pure stealth title to succeed, players need to be able to retry instantly, master rock-solid mechanics and have clear context for every action. Not only does Volume, the latest game from Thomas Was Alone developer Mike Bithell, succeed on all of these fronts, but it also manages to weave an interesting (though occasionally poorly written) narrative, that though futuristic and dystopian, has a great deal of real-world themes. Despite its few flaws, Volume is one of the best stealth games to come out in years and is perhaps the best modern take on the PlayStation/N64 era of graphical fidelity.Volume tells the story of Rob Lockley (the name puns are out of control here), a modern-day Robin Hood who is essentially delivering his rob from the rich and give to the poor message via a fictional take on Twitch. Obviously Amazons massive streaming company isnt directly mentioned whatsoever throughout Volumes six hour campaign, but its clear that the idea of someone live-streaming something that could change the course of society at large isnt that difficult to believe. Robs AI companion Alan, who is delightfully voiced by Danny Wallace, guides him through a number of robbery simulations, with the goal of influencing those watching into committing the actual crimes being orchestrated through the Volume simulation. Volumes campaign is comprised of one hundred robbery simulations, each translating into no more than five minutes of pure stealth gameplay bliss.Volumes overarching thematic elements and stunning conclusion stand out as particularly exciting, but the road that the player takes to experience this narrative isnt particularly exciting. This creates a bizarre dichotomy that hangs over this particular tale; on one hand, theres an awesome story loaded with awesome modern-day parallels, on the other, theres a narrative that is more fun to think about after the fact than it is to experience in the moment. The good news for players is that the lasting impression that Volumes narrative leaves you is quite impressive, and at the end of the day, you wont necessarily remember whether or not cutscenes are sporadic and dialogue is infrequent. If youve ever found yourself wondering about the potential downfalls of sentient AI, the political ramifications of technology exceeding the boundaries of modern law, a word in which corporations have complete political power and the influence that Internet personalities can have on the greater public, then youd be doing yourself a disservice not romping around this disturbing British tale.Narrative quirks aside, Volume plays fantastically, and though it can occasionally frustrate players, Mike Bithell and his team of developers have figured out a way to challenge players sufficiently without ever crossing the line into unfair territory. The basic gameplay loop in all 100 stages (and in every player created stage for that matter) involves collecting a number of floating gems and activating numerous locked barriers in order to activate a glowing gate that officially ends that particular simulation. Sounds simple enough, right? The big twist, as you may have guessed being that this is a stealth game and all, is that you have to complete the stage without being killed by AI enemies. Rob cant really fight back against the various foes that inhabit all of these simulations, with the exception of the occasional use of a ranged blackjack that temporarily stuns whatever foe is targeted, so sneakiness is absolutely the name of the game here. While theres always a clear path through each stage, there are often times where players have to come up with a number of contingency plans on the fly, which is what makes Volume such a special gameplay experience. Sure, Plan A might seem completely obvious, but do you have the skill to ditch that plan and come up with an entirely new solution within a second or two? Its in this way that Volume is much more of a mental game than one of dexterity or reflexes.| Being that this is an isometric title that clearly takes a fair amount of inspiration from Metal Gear Solid: VR Missions, you can bet your bottom dollar that there are a number of visual cues that keep players aware of their surroundings at any given time. It wouldnt be a traditional stealth game without clear vision cones, well-defined shadows and obviously illustrated enemy traits, and in these departments, Volume certainly doesnt disappoint. All of the visual cues that aid you in your sneaky pursuits are strengthened by Volumes polygonal graphical style; though those who are looking for insane 2D visuals or hyper-realism will likely be disappointed, theres something special about a game that is able to modernize the PlayStation/N64 style of early 3D visuals. Sure, there is a ton of aliasing in the handful of cutscenes that play throughout the 100 stage campaign, but if you have nostalgia for late 1990s gaming, Volume is going to scratch an itch that not many titles are able to reach.In addition Volumes 100 Core levels, players are given the option to create their own stages and share them online with the community at large. While navigating to this level editor is a bit challenging at first (anyone looking for a Create option in the standard menu should know that the option to Edit Simulation is only accessible by exiting the main menu), all of the tools that you could possibly need to create your very own Volume is accounted for. Granted, there arent really any instructions for those looking to dive into this creation engine, but if youre the type of person who is going to fool around with an editor until you figure it out, this is likely the game for you. The one disappointment with Volumes player-created stages is the genuine lack of curation present at the moment. The Staff Picks section of the selection screen is still unpopulated, and other than searching for levels and scrolling through, the filtration system leaves a lot to be desired. Closing Comments:Volume isnt without its flaws, but the highs that its able to hit completely squash the minor gripes players might have. One of the best pure stealth titles in recent years, Mike Bithell and his team have not only captured some of the storytelling magic that made Thomas Was Alone so special, but they also managed to capture the best parts of a genre that sees a great deal of failures. With its instant restart system, mechanics have been put in place to prevent frustration, which couldnt be more key in creating a solid stealth title. Whether youre looking for a story that might shed some light about where society could go horribly wrong over the next few decades, or if you just want to recapture the magic of Metal Gear Solid: VR Missions, Volume is one of those games that demonstrates how cool independently developed games can be.", "date": "September 1, 2015", "grade": 4.0}