{"name": "Back To Bed (PS4/PS Vita)", "ref": "https://hardcoregamer.com/?post_type=post&p=164099", "text": "Creating a solid puzzle game, much less one focused on path finding, must be a daunting task. If the puzzles are too easy, people complain about the lack of challenge. If they are too difficult, others will put together condescending articles and commentary regarding the lack of coherent minds at the developers office. Then there needs to be a hook, something unique to differentiate the new offering. In fact, the purview of the puzzle game designer has to seem even more thankless. With other genres, sliding difficulty options are there to help a player get the just right experience. Bedtime Digital Games and Loot Interactive took a solid swing at this undertaking with Back To Bed. Its really too bad that it didnt quite connect.Back To Bed stars Bob, a poor sap who simply hasnt been able to get a decent nights rest, and his subconscious guide, Subob. Right out of the gate, questions must be asked about Bob based on the appearance of Subob. Why does it look like a cross between Zeldas Tingle and a dog? Could Bobs restlessness be related to some repressed emotions or self realizations that remain unrecognized? Is there some thing that maybe should be addressed by Bob so sleeping issues do not become a lifelong affliction that will haunt him to the end of his days? Setting these ponderings aside, he is having issues in his dreams and it rests on Subob to guide Bob through them.In these dreams, Bob is a sleepwalker. One with a particularly suicidal slant at that. He will wander the levels moving in a straight line unless he is impeded by an object, in which case he will react accordingly. Typically this means making a ninety degree turn. Its Subobs job to use over sized apples to direct Bobs path and to build bridges using fish to get to the goal, represented by Bobs bed. Basically, the entire game is an escort mission. To give credit where it is due, even in his oblivious state, Bob remains a more predictable ward than Resident Evil 4s Ashley (take that, you ten year old classic that helped shape modern gaming to what it is today!). Poor little Subobs task is made easier by a decent interface. The ground of the environments are divided with tiles to make planning turns easier and footprints on the ground show the expected path of Bobs narcoleptic stumbling. Where an apple will be placed is delineated by a subtle highlight around the tile, which also helps. It all fits together well to make the actual stage navigation into an easy task.It helps that the look of the game just pops, especially on the Vitas screen. While he was notoriously subpar at rockin the mic, M.C. Escher managed to find fame with his distinct, perspective bending art style. Marrying this with Salvador Dalis more famous works does very well at creating a dreamlike state. There are other random touches that give this a unique appearance, from random, nonsensical utterances (The apple is a hat) and pun/word associations that could pop into a slumbering mind (whale roads instead of railroads). That also leads into one of the issues with this game. It appears that quite a bit of work went into creating the feel of this one, but much less in utilizing it in the proper fashion. With the exception of two levels where the perspective was part of parsing out the puzzle, this could easily have been re-skinned with no change to the actual play. Even taking stairs to walk up a wall to pick up an apple or a fish could have been changed to just dropping the object in a more convenient place from the beginning. More could and should have been done with this style. As it is, the vast majority of the game is apples and fish, with some pressurized wind that blows Bob off course making an appearance late in the game.With the game broken up into thirty distinct, short levels, Back To Bed lends itself perfectly to to Vita. With each one taking between thirty seconds to five minutes to solve, it is easy to pick up and put down when traveling, waiting in lines, or waiting for the police to figure out how to use their new computer system to log your mugshot. (I couldnt think of a third activity.) This is also its other major drawback. Completing a regular play through only takes about an hour and a half at the most. There is a more difficult Nightmare Mode to solve, but these are simply the same puzzles and environments with the added annoyance of needing to direct Bob over a key to unlock the door to his bed. Closing Comments:While Back To Bed is not a terrible puzzler by any stretch of the imagination, it is terribly underwhelming. There is simply so much more that could have been done to really make this a gem. The stylish look of the game is superlative, but that is really all there is to it. Much like going on a date with an extremely attractive person and having the dinner conversation consist solely of the best way to pot a plant, the view is good but the mind languishes.", "date": "Bohn on August 26, 2015", "grade": 2.5}