{"name": "Evoland 2: A Slight Case of Spacetime Continuum Disorder", "ref": "https://hardcoregamer.com/?post_type=post&p=163741", "text": "If you havent played Evoland, chances are youve probably at least heard of it. Evoland took you on a journey of gaming, from the classic RPG to the modern, going through its graphical changes over the course of the game. Evoland 2 is much longer than its predecessor. Where Evoland progressed through graphical changes, Evoland 2 is not nearly as linear. While it is mostly set in a retro zelda-esque environment, the graphics will vary from better to worse as you hop about time. As youre displaced in time, the graphics around you will represent these changes. Likewise the fact youre time traveling is represented by map changes, towns appearing and disappearing as they cease to have yet been created, or are built in the future.Thrown into the mix are just about every other popular game you can think of. From Professor Layton type puzzles, to Match Three games, to a clearly obvious Mario platforming level, straight up to Mortal Kombat fight sequences. Such a hodgepodge of game elements seem like they would be messy, that switching between them would be jilting, but Evoland 2 makes it work. Nothing ever feels like its out of place and every time you stumble upon a level straight out of one of your favorite games, you cant help but get a bit nostalgic. Most importantly, you always feel like youre still playing the same game.The cohesive experience is key for a game like Evoland 2 to work. Most of the adventures off the RPG genre path play as mini-games, for example, waiting tables Dining Dash style in WokDonalds. It would be easy to fill this entire review just by mentioning all of the genres Evoland 2 touches on, but while some are mentioned, its probably best most are left as a surprise. Half the fun of Evoland 2 is just seeing what it throws at you next. Evoland 2 is ripe with storytelling, throwing backstory and plot at you from every which way. Its interesting to travel through time and see the consequences of things, such as war, then to travel back and see things from the losing side. What your character grew up knowing as the truth, but not have been entirely truthful. At the core of the story is the war between humans and demons. Obviously the demons were the bad guys and the humans rightly prevailed, but is that truly the case? Your adventure through time will lead you to the answers, and perhaps you can even change things for the betteror worse. On your journey, youll pick up companions from across time. All of them vastly different and having their own special ability to help you through the game. Like most classic RPGs these companions morph into your body until theyre needed, either for a chat, or to bash through some rocks.The music composed for Evoland 2 fits right in, never feeling out of place. Both time and place have their own tunes, adding to the cohesive experience. Whether its a jaunty 8 bit composition or a modern orchestral performance, it all blends together seamlessly. Evoland 2 is also chock-full of references, like the aforementioned WokDonalds, right to a farmer refusing your help gathering up his loose chickens because the last time he trusted some kid dressed in green to do it, his poor hens were traumatized for weeks. The controls for Evoland 2 are responsive across all the genres it represents. Where so many games fail to get the controls right for just their singular concept, Evoland 2 manages to get them right every time. That alone is quite the accomplishment; you wont find the controls floaty on the platforming bits or delayed in the fighting sequences. The only oddity apparent at the time of playing was swimming in the platforming sections, but no one ever really likes underwater levels anyway.While the beginning of the game is quite linear, map becomes more through progression, allowing freedom to explore the world in the different times represented. Doing something in the past will change the future, so make your choices carefully, or when you get back to your own time, you may find the world has become a vastly different place. For the most part, Evoland 2 is a great experience. Some dialogue gets a little long winded (which an NPC even jokingly references), some puzzles can be a little obtuse, and some paths a little too well hidden (which is all well and good for hidden collectibles, but not for an area you absolutely have to find), all of which can lead to some frustration. Closing Comments: Evoland 2 manages to seamlessly blend an incredible number of genres into a single, wonderful experience. With only a few gameplay frustrations, it simply must be experienced, especially for gamers with eclectic tastes. The first game is completely unnecessary for enjoying the second one, but those who appreciated Evoland will love Evoland 2 as it merely expands on the ideas and concepts of the original.", "date": "August 24, 2015", "grade": 4.0}