{"name": "Gears of War: Ultimate Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=163817", "text": "Its hard to believe that the original Gears of War was released nine years ago. To celebrate this joyous occasion, Microsofts newly founded studio dedicated to the Gears of War brand, The Coalition, has remade the first game with up-to-date visuals and more modern expectations when it comes to online connectivity. This means dedicated servers will help remove the host advantages that were present in the original release, not to mention a handful of new and improved modes. In an age where remastering games that were released a couple years ago to run slightly better on newer hardware is becoming an accepted practice, its good to see Microsoft stepping up to not only fully remaking the visuals of one of their hottest properties, but also adding upon it, too. How does an early Xbox 360 AAA title hold up in the current generation?Players will once again take control of Marcus Fenix, a former soldier who was sentenced to forty years in prison for abandoning his post  a bit of a harsh punishment, especially during such an ongoing conflict. The story revolves around this invading army called the Locust that have come from underground with unknown violent intentions. All you know is that Emergence Day sparked a massive war with the humans of Sera, and the world has been torn apart for over a decade. Marcus is accompanied with his best friend, Dominic Santiago, and eventually meets up with two other comrades: Augustus Cole and Damon Baird. The main plot primarily revolves around the group of COG soldiers to deliver an underground scanner to a location and let the bombs loose. Of course its never that simple, but its a straightforward plot that feels relatively light on its feet. Its not necessarily about the story, but more about the strong gameplay elements.The fully two-player cooperative campaign is back and more or less the same. Its about five to six hours long in length depending on which difficulty is chosen and features exciting firefights and a diverse arsenal. It has aged well, but its clearly not up to snuff with many modern AAA games. For example, combat scenarios and boss battles are straightforward with little to no puzzle elements or strategy put in. The story isnt anything to marvel at either, as theres barely any character building and no twists to be found. Because The Coalition was able to recreate the entirety of the visuals, however, it will give players some serious nostalgia. It may not be the most complex campaign, but its incredibly enjoyable to play, especially with a friend, as the core mechanics are still tight. The campaign features all five acts that the original Gears of War contained, but now also includes five chapters that were originally exclusive to the PC version. This adds about an extra hour of content, all of which could be argued is the best scenario the game has to offer, while at the same time adding some clarity to why you needed to jump on a moving train. The environments have far more vegetation to them, and it helps that the boss battle at the end Jurassic Proportions is more entertaining than any of the other boss encounters. Other than that, not a lot has changed. Theres a new Normal difficulty, but its highly advised to go straight to Hardcore as it doesnt offer much of a challenge, allowing the most casual players to breeze through. Theres letterboxed split screen and individual difficulties for co-op, and my personal favorite, haptic feedback support in the triggers when chainsawing enemies in half. Everything you know and love from the original Gears of War is here with slight alterations that help enhance the experience in many positive ways.Unfortunately, those looking for a completely up to date Gears of War experience will have to fire up the third installment that was released four years ago. Other than some of the alterations that we listed above, Gears of War Ultimate is basically a shot-for-shot remake of the original 2006 game, meaning that this is more or less the same game millions of Xbox 360 and PC owners around the world played before, just with better visuals. Because of this, a lot of the key features that made the Gears of War series grow are absent. For example, if playing the story solo, there isnt a bleed out stage for your bumbling AI to revive you. Locust enemies dont enter this state either, meaning meat shields and the patented curb stomps are no longer available (although curbing is in competitive multiplayer). Grenades can still be attached to Locust, but its not as fun as tagging someone freshly captured and kicking them into a group of enemies. Some of these gameplay elements are understandably absent as they werent developed or intended for the combat scenarios in the first game, but at least have the most up to date multiplayer possible. Its not completely without enhancements, though, as there are some small additions, such as reviving teammates while in cover and tagging enemies for others to see their location. Its more that The Coalition has streamlined a number of the elements than anything else. The missing gameplay mechanics arent even that big of a letdown; its the lack of a Horde mode thats truly disappointing. While survival modes were popular before Epic Games got to it, Gears of War 2 really put it on the map as a viable and highly addictive extension of length that wasnt necessarily competitive. Even now, so many developers are taking elements from Horde Mode and using it in their own games. This is why its even more saddening, having The Coalition not even bother implement a basic Horde Mode to build off of. There was nothing better than getting together with a group of friends in the evening and running through fifty waves of enemies only to realize that the sun was rising. Mind you, multiplayer is still highly addictive, but even for a remake, this is a step in the wrong direction.While Gears of War has a strong, albeit short campaign, one of the biggest attractions to the Ultimate Edition is its multiplayer. Like the rest of the package, this is very much the multiplayer that was in the original Gears of War, just with a few alterations. Theres nineteen multiplayer maps to be found and eight different modes. This includes all the multiplayer maps that were post-release DLC, such as Old Bones, Bullet Marsh and Raven Down. There are even maps such as Courtyard and Gold Rush that were only available for the PC version. Each map has been finely remastered for the Xbox One, all of which look absolutely magnificent in their own way. The multiplayer modes taken from the original Gears of War include Warzone, Assassination, Annex, Execution and King of the Hill (which was originally in the PC version), with Team Deathmatch added from Gears of War 3. There are also two modification modes: Blitz and Gnasher Execution. Gnasher Execution is self-explanatory (Warzone with mandatory shotguns) while Blitz is King of the Hill but requires players to stay in the ring, and the more players in at once, the faster points are obtained. Another large aspect to the Gears of War multiplayer formula is its level-based system. As the multiplayer modes are played through, experience is gained that helps build a stronger portfolio. By leveling, access is gained to newer character skins, allowing players to show off both as an avatar and a number. Depending on what type of match is played, experience will be distributed differently. Ranked matches will give out the most experience, allowing players to grow quicker, while private and causal matches barely give out anything, especially for those on the losing side. Its something that helps players keep moving forward, giving them a reason to play over and over again, but thats not the only incentive. Multiplayer just feels plain good. Picking up the Gnasher Shotgun or Boomshot and getting into a fast paced, exciting match is one of Gears of Wars best traits. Its a game that, whether or not youre winning, youre having fun regardless. It certainly helps that the multiplayer sections runs at a smooth 60 fps, has dedicated servers and a ton of customizes to matches, such as adjusting bleed-out times, self-revives, active reloads, and various other elements. Suffice to say, theres a lot of content here to be digested.If you play the original game today, you can instantly tell how much of an achievement the Ultimate Edition is. The remake looks exactly how players thought they remembered it looking, but going back, theres no comparison. Mind you, Gears of War looked good for a 2006 game, but The Coalition has put a lot of time and effort into remaking every square inch of this release. It looks modern, with new lighting, textures, models and just new assets all around. They even remade all nineteen levels from the multiplayer, and as stated before, runs at a staggering 60 fps while the campaign is locked at 30  but at least its resolution is 1080p. One of the bigger differences is that, instead of in-game cutscenes, newly rendered videos have been put in their place. This is for the best as the original release had an incredibly poor framerate during cutscenes, so having a silky smooth, epic scene go off without a hitch makes the experience all the more enjoyable. Closing Comments:It feels good to finally get back into Gears of War. People Can Fly experimented with Judgment, but it ultimately didnt work as well as it could with the series formula. The Coalition on the other hand has gone back to the roots, literally, giving fans and newcomers alike a taste of what made Gears of War so popular. The franchise has always had an alluring nature and The Ultimate Edition is no different. Unfortunately, this is almost purely aimed towards nostalgia, as while its accessible to those who havent played it before and the mechanics still hold up today, many of the advancements that were made over the last decade are not present. This includes a number of key gameplay mechanics and Horde Mode. Thankfully, the Ultimate Edition is packed with so much content  eight different multiplayer modes, nineteen different maps and a six hour campaign  that players will be immediately hooked. Gears of War is a game truly worthy of remaking and The Coalition has done a bang up job doing so.", "date": "August 24, 2015", "grade": 4.0}