{"name": "Submerged: Hidden Depths", "ref": "https://hardcoregamer.com/?post_type=post&p=420134", "text": "Via pure coincidence or some odd fate, today on Hardcore Gamer we have a particular double bill of reviews for games that share a similar theme. That theme being former timed Stadia exclusives that center around a pair of siblings journeying through some sort of fantasy world. We cant believe something like that popped up here either, as the Stadia part alone is likely confusing many right now. The first game was Young Souls, the second is Submerged: Hidden Depths, Uppercut Games sequel to their 2015 miniature open-world adventure. Truth be told, I actually did remember seeing Hidden Depths first emerge on Stadia, and my initial thought was A Submerged sequel? Are they really that desperate for exclusives?Lets back up a bit. The first Submerged game came out in 2015, proudly billing itself as sort of a non-violent action game built more around climbing and exploration, back when a claim like that could still be seen as revolutionary. Unfortunately, the reaction from critics was tepid at best and at worstwell, we ended up giving it a one out of five, a score typically reserved for the likes of The Quiet Man and Ride to Hell: Retribution. But I looked at the initial Stadia reviews for Hidden Depths, and people wereloving it? How could this be? Is it possible that we just didnt get what Submerged was doing at the time? Did it end up aging well?To answer this question, I dug up my old livestream of Submerged, took a look at it, andno, I got bored of the game almost instantly. In my opinion, the original game still doesnt seem to hold up as well (neither did my attempt at a livestream, but I suppose thats another story). And yet based on what I had heard, I decided to give Submerged: Hidden Depths a chance, and I liked it a whole lot. Somehow this once-forgettable indie title decried as being monotonous and dull somehow completely reversed course. How was this possible? Well, lets take a dive into things and see what happened Taking place some time after the original, the game sees protagonists Miku and Taku sailing into another sunken post-apocalyptic city to explore. At the end of the first game, Miku was basically given a plant-based power by parts of a being known as The Mass that has claimed this fallen Earth while trying to save Taku from dying, and now Miku wants to use the power for good, while Taku worries about it. And both of them have things to worry about, as this city is being strangled by some sort of force known as the Black Plant, which Miku has to help by scaling nine major buildings and finding the seeds needed to cure it. And along the way, well learn about some of the duos past demons, while also confronting those of the city as wellOn the surface, it seems not much has changed when it comes to Submerged: Hidden Depths. After an opening act tutorial in an area known as the Dome, Miku and Taku can sail off (Taku naturally not being confined to one place anymore), go wherever they want, search for whatever buildings they choose, tackle them in the order they see fit, scale them with standard third-person action game climbing abilities as seen in Uncharted and the like, except you cant fall off and die in any possible way, search for a few secrets in betweenit sounds like a decent formula on paper, but it didnt work the first time around. So what makes it suddenly click now?Well, its simple: Uppercuts world and level design skills have vastly improved in the last six and a half years or so. A good open-world game with exploration at its core should make you want to explore it. And aside from a few landmarks, Submerged just had a generic ruined city with generic skyscrapers and buildings that didnt have any deep variety when it came to level design because they had to seemingly account for them being tackled in any order. Hidden Depths, thankfully, improves upon all of that. It even made sure to improve upon its narrative via one simple trick: making the city a character as well.This time around, there isnt just one ruined civilization to work with, as our heroes find remnants of a more recent tribe having built upon the old ruins as well, finding makeshift bridges, huts, living quarters and more. Not just a mere backdrop for Miku and Takus story, the city is now front and center, with each location having its own unique feel, ranging from power plants and cathedrals to toppled skyscrapers and cargo ships somehow lodge into skyscraper tips. You get a feel for what each district was, how it operated and more. And it helps that the graphics and art style are stronger than ever, showing off impressive wear and tear mixed in with more vibrant greenery and flowers courtesy of Mikus powers, not to mention the tribes decor. Speaking of the tribe, though, what immediately makes you want to explore the world of Submerged: Hidden Depths even further is a desire to figure out just what the hell happened to them. You quickly see such sights such as plant-like echoes of people created by The Mass known as Remnants, creepy altars where the seeds are located with loads of electronics hooked up to them, operating over and over, the Black plant practically choking every area in some way, blocking things offjust what happened? The answer lies in a series of collectable diary entries, but where the first game kept things too vague, Hidden Depths adds dialogue with each group of entries you find, eventually painting the portrait of a captivating tale.Getting back to gameplay, though, whats important this time around is that each level or minor building with a secret is perfectly designed with varying levels of complexity. Not challenging, mind you  challenge isnt the necessary goal here, after all  but each area has its own distinct path and level of obstacles to traverse. Condominiums with a focus of ziplining between buildings at one point, a more grounded power plant with puzzles where you open gate to let your boat through at another. One diary entry require a complex climb, another one is more out in the open. The result is a truly open world where you can go anywhere and find areas with varying depths, not just the same level of design over and over.The kicker on top of things is all of the secrets added to the game this time around. Aside from the diaries, the originals landmarks and wildlife to discover and boat upgrades to find are still here (with a lot more wildlife as well), but now we have relics to fish out and flowers to find as well. The latter two new additions being the most important, as our siblings use them to decorate the Dome, making it truly feel like their current home, a notable theme present that plays a good part in their well-told story as well. The improved world makes them more fun to find, be it via just sailing around and spotting them, searching for them with a telescope or using the lookout points you can come across as welleven if those last ones reveal a small amount of notable points. One of the more notable flaws with Submerged: Hidden Depths is one of its secrets, namely the parts you find to unlock new boat appearances, plus hairstyles and outfits for Miku. Unlike every other collectible, they arent tagged on the map, and theres nine of them to find in each major building if you want to unlock things, so it creates a rather annoying hunt where you can easily miss one part, leading to annoying backtracking. And on the topic of secrets, while exploration is the name of the game, backed up by the thrill of discovery, it would have been nice to allow for waypoints on the map as well.The big drawback beyond that, though, is that Submerged: Hidden Depths can feel almost aggressively linear and hand-holding at times. Invisible walls can be easily found along the way, even in areas that seem like they should be open, and our characters pretty much refuse to interact with almost any surface not painted red (or whatever you choose the guiding color to be), not even stepping down from a side of a box if it isnt the red side, despite leading to the same ground. Its odd, especially since one big strength in some buildings is the large amount of different paths leading to secrets, and while it isnt a dealbreaker, it does take you out of the immersion, even coming across as cartoonish at worst. But thats a price to pay for improvement, I suppose. Closing Comments:Given our memories of the first game, it would have been a miracle if Submerged: Hidden Depths had just been a merely fine distraction. So its a shocker to see a perfect example of what a sequel should be, making terrific use of the strengths its premise provides, allowing you to truly chill out and explore the drowned city, coming across something that feels fresh at every turn, backed up by breezy visuals and a nice soundtrack. While still linear at times, Submerged: Hidden Depths is a vastly-improved adventure that should easily stand a shot at being the years best sequel, and Uppercut should be proud of what theyve done.", "date": "March 10, 2022", "grade": 4.0}