{"name": "Gathering Sky", "ref": "https://hardcoregamer.com/?post_type=post&p=163443", "text": "Does everything have to be a struggle? Is it always necessary to be challenged by a razor-spiked wall of difficulty instead of relaxing into a lovely little slice of peaceful activity? Gathering Sky says that, yes, kicking back with a flock of birds in a giant breezy sky, flying in a top-down view with the entire experience set to a full orchestral soundtrack, is a good way to blow off an hour. You can get from start to finish in sixty minutes and come out feeling refreshed for it, which is a very different feeling from the usual adrenaline-kick or rage-quit of standard gaming.Gathering Sky starts with a single bird alone in a cul-de-sac in the sky. The physics of how that works are a little wonky but lets go with floating sky-islands in a top-down 2D plane and move on. You dont have control of the bird directly but rather of the cursor, and the single control is to press the mouse button to call the bird towards it. The lonely little avian doesnt stay that way for long, as flying near other birds adds them to the flock. It doesnt take long to go from two to three to about twenty or so birds all flying along towards the circle of light that indicates the active cursor, staying in formation as best they can while avoiding the sky-rocks and getting caught in the jet streams that populate the air.And thats pretty much the whole thing. You guide the flock through the sky, high above the giant painting thats the world below, trying to keep the flock together and exploring six giant levels. Whether you zip to the end or choose to go exploring makes no difference to the final result, because the point is to enjoy the trip rather than chase after ever collectible. Light-sprites make giant crystals resonate when flown over, strange balls in the sky light up when flown into or pushed against each other, and the effect on the end result is only whether or not you enjoyed playing with them on the way by. Thats not to say Gathering Sky is all restful relaxation, because the hawk attack is startling even when you know its coming, and the storm is dark and ominous, but most of the time is spent guiding the flock, enjoying the flow of the birds, catching a wind current, and feeling a sense of flight that doesnt seem like it should anywhere near as effective as the 2D overhead view makes it.As a relaxing chill-out game its hard to fault Gathering Sky, but its biggest issue would be that the game simply feels designed for a touch screen. After playing the first level on a regular PC, in fact, I switched hardware to a Surface Pro, simply because using a finger or pen to point at the screen felt so much nicer than holding a mouse button down for an hour. From a mechanics of control perspective, it just makes more sense to play on iPad or other touch-screen device. Closing Comments:Gathering Sky is exactly what it wants to be  a lovely journey in the skies of a sprawling world, guiding a flock of birds through passages and over wind currents to their eventual resting place. The story elements are slight, but the scenery changes often enough to ensure that theres always something pretty and new to see in the background. Whether youre flying through corridors or over clouds, or even through clouds while leaving trails for each individual bird behind, the art and music combine to evoke moods ranging from playful to foreboding, complementing the motion on screen. The journey may not take very long to travel and the challenge is purposefully minimal, but its a pretty flight to take. The birds have a place to be and a massive journey to get there, and with a bit of guidance through the free-flying sky, they may eventually get to rest their weary wings.", "date": "August 23, 2015", "grade": 3.5}