{"name": "The Flock", "ref": "https://hardcoregamer.com/?post_type=post&p=163744", "text": "When it comes to creating a memorable game, a novel idea is only half the battle. In the case of The Flock, the first-person multiplayer horror game making waves for its temporary availability, it seems as though execution and content took the back seat to gimmickry. The result is a weak, repetitive bland experience whose extent can be experienced in all of twenty minutes. Theres a fair amount of tension that can result from turning around to find another player hunting you down, but its unclear whether that tension is a result of the core game inspiring it or the dichotomy between a mild shock and struggling not to fall asleep. Developer Vogelsap should get some credit for The Flocks main gimmick, but this studio should also be lambasted for charging a fair chunk of change for what might be the shallowest multiplayer experience of 2015. A unique idea, The Flock fails to execute on just about everything that makes multiplayer games fun, leading the player-base to wonder whether or not its being charged for the opportunity to never play it rather than paying for a satisfying video game experience.Before diving into how The Flock actually plays, its downright impossible to discuss it without diving into its unquestionably unique premise. Volgelsap has purposely created a game with a limited shelf life, as there are a limited amount of player lives available before The Flock no longer becomes purchasable. After roughly 215 million total player deaths occur, which is an insane number considering the fact that it appears to be sporting a fairly weak player count at the moment, potential consumers will no longer be able to buy a copy. This initiates the as of yet unknown final phase, hilariously being dubbed the climactic finale, after which the servers will be shut down and nobody will be able to play The Flock ever again. The developer has stated that this premise was designed to combat the all too common occurrence of new multiplayer games burning hot for a short period of time before everyone stops caring. Vogelsap has mentioned that games like Titanfall and Evolve have rapidly dwindling player bases, and rather than having a game that fades off due to disinterest, it wanted to create an event-like experience. The idea of temporary availability is intriguing, well-thought-out and likely the only redeeming quality of The Flock, as its core gameplay isnt fit to hang out in the same zip code as the two games its development team made a point of calling out, let alone sit at the same lunch table as them. Its insane to think that 215 million plus player deaths will have to occur before the coolest part of the entire experience arrives, especially when you consider that as of this writing on the second day of its availability, The Flock doesnt have 1400 concurrent players according to Steams Game and Player Statistics. When you consider that this statistic is based off of data from a Saturday night, likely one of the biggest times for gaming, it makes you wonder whether or not The Flock will actually end at all. To phrase this another way, you could be paying for a game whose only redeeming quality may never arrive.To put this a different way, the initial number of player deaths required to trigger The Flocks ending was 215,342,530. The population as of Saturday night at 6PM PST was 215,335,500, meaning that roughly 7,000 player deaths have occurred in both the pre-release press review sessions and the first 36 or so hours after release. For the sake of simplicity, lets over estimate and say that 7,000 deaths took place in the first 24 hours of play (even though the actual number is likely much lower due to the factors mentioned above). This means that, if this pace is kept up, The Flock will end after roughly 30,763 days, or just over 84 years. To put that into context, this is over five years longer than the average life expectancy of an American male and over three years longer than that of an American female. At this rate, The Flock will likely never end in our lifetime, meaning that everyone buying into its premise will literally never get what theyre paying for. Lets move into how The Flocks actual gameplay, shall we? Its lone game type is a combination of Halos Oddball and the schoolyard classic Red Light, Green Light. Players take the role of one of The Flock, a pack of skeletal monsters with the ability to move quickly and turn to stone when theyre not moving. When an ancient artifact appears on one of the three playable maps (take that last part in for a second), whoever gathers is it transformed from a member of The Flock into a somewhat humanoid-looking Carrier. Each game ends when the Carrier reaches a score of 100 (though games dont necessarily end immediately), which is attained by holding onto the artifact and activating various objectives around the stage. The artifact itself shines a bright light which instantly kills The Flock when theyre not made of stone, meaning that those without the artifact have to use a combination of quickness and patience to kill the Carrier.and, well, thats about it.The moments of tension that arise from playing as the Carrier and constantly looking over your shoulder are actually pretty exciting for the first game or two, but one can only be freaked out by the appearance of a terrible-looking character model so many times. All three maps feel exactly the same, likely a result of The Flock being potentially the greyest game of all time, which means that after about two or three matches, theres a quick transition from mildly neat to utterly boring. If a player feels as though he or she has experienced everything that there is within fifteen or twenty minutes, potentially fictitious ending aside, thats a bona fide death nail in a multiplayer games coffin. Its also worth noting that The Flock might be the single ugliest game of the year, as its already heinous looking polygonal graphics combine with the entire color palette consisting of a couple of shades of grey. This works in tandem with the fact that player movement is cumbersome, clunky and loaded with surface clipping to deliver a particularly unappealing game to the eye. Add this to the fact that the options menus are currently completely broken, as theyll cycle through every option if you highlight them while arbitrarily saving, and you have a recipe for disaster. The latter point is about as frustrating as it gets, as there is a good chance that entering the graphics menu will automatically cause The Flock to decrease its resolution and graphical fidelity without ever giving you the chance to change it back. Closing Comments:The one or two tense moments that The Flock provides might be mildly thrilling, but the overall package is about as weak as it gets. Even if the temporary availability idea is set aside, which had the potential to be cool, the core game itself feels like a glorified demo, let alone a $16.99 release. With three maps and one bland game mode, The Flock doesnt just have a lack of meat on the bone, it might not even have the bone itself. Combine all of this with the idea that, as of this writing and barring any changes, the touted climactic finale is basically mathematically impossible to reach before servers shut off or players wind up passing away, and The Flock feels like a game that literally doesnt deliver what its advertising. While Vogelsap likely anticipated more interest in their project, something will have to change before this mess of a multiplayer game goes from bad to an outright lie.", "date": "August 23, 2015", "grade": 1.5}