{"name": "Nekopara Vol. 0", "ref": "https://hardcoregamer.com/?post_type=post&p=163307", "text": "Every so often, a visual novel fan just wants to unwind with a brief, cutesy little experience. At least, thats the case for some of us after reading through any of the 40+ hour time commitments that some of the genres best require. Nekopara Vol. 1 fell into the category of silly fluff when it launched late last year. The game revolved around the story of a young man by the name of Kashou Minaduki who was finally pursuing his dream of opening up a bakery. Unbeknownst to him, his two family pets  cat girls to be exact  mailed themselves over to the location and took it upon themselves to become his bakerys first staff members. Although the story was definitely not a sprawling, serious tale it provided a good deal of amusement and fanservice for those who enjoy both. Instead of Vol. 2, which is still upcoming from developer Neko Works, a prequel made its way onto Steam. Titled Nekopara Vol. 0, its a fandisc, meaning its meant for fans of Nekopara Vol. 1 to get even more of the precocious Chocola, Vanilla and all the other Minaduki household humanoid kitties. Those who are brand new to the world of this visual novel should honestly gravitate toward the original title first and then appraise whether or not they are interested in even more of the experience. As a fandisc, it also proves a far shorter playtime and one that doesnt provide deep insight into the events of the main game. Honestly, it doesnt provide much of anything at all unless youre desperately in love with the cast.The reason I say this is because you get little with Nekopara Vol. 0. This story takes place when Kashou still lived at home and therefore coexisted with his harem of cat girls. Unlike Vol. 1, however, Kashou doesnt even really exist. He appears at one point and is often the topic of discussion, but never exerts himself as a protagonist or even utter a word. Instead, this time around players are simply a passive audience to all the shenanigans that the cat group can get into. Well, the cats and Kashous younger sister. She might as well be part of the harem though as her brother complex is played up once again for amusement. If all youre looking to do for 45 minutes is watch cutesy cat girls goof off and sometimes say lewd things, then youre in for a great time. However, if youre looking to learn much of anything more about the cast or Kashous past youll be sorely disappointed. Then again, its worth recalling that the original visual novel was fairly simple too. Its just unfortunate to see how vapid this release turned out. As with before, this is still a visual novel that offers the player no choices at any point. There is one ending and everyone receives it if they read through to completion. Youll find achievements to collect, though they are related mostly to petting each character. The pet mechanic is brand new but just amps up the cute factor and doesnt actually impact the progression.Luckily, one excellent aspect from Nekopara Vol. 1 still remains: the lovely artwork! Sure, its anime artwork like so many other visual novels out there but each character is strikingly adorable. Not only that, but the colors of their clothes and eyes absolutely pop. The E-mote animation system is still at work and turns what would often be static character art in a visual novel and brings it to semi-life. Each character blinks, speaks, breathes, and generally adds a good dynamic touch to scenes. CG art also showcases just how wonderfully goofy the group can be. The game is fully voiced in Japanese and players may choose to read through in English, Chinese, or Japanese. Finally, theres the matter of the writing. This is a visual novel, after all! For the most part it feels akin to any average anime. Character dialogue is readable and makes sense, but isnt particularly realistic (not as if the tale of a bunch of cat girls is meant to be relatable). Most of the time it just feels that the characters are constantly busy one-upping each other, and while that comes through, it isnt particularly interesting to read. That point will vary depending on who is playing, but its how things felt during my playthrough. Who would expect that when you get a bunch of cat girls together and let them go crazy the result is utter boredom?Closing Comments: If you are a devoted fan of Nekopara Vol. 1 then theres little reason not to buy Nekopara Vol. 0. Not only is it far cheaper at the price of $2.99, but it also gives you nearly an hour more with a cast of colorful cat girls. Those brand new to the Nekopara world, or folks who only found the previous game to be okay, shouldnt bother. What is present here will not get you to suddenly like the franchise considering it offers far less than Vol. 1. Sure, the petting is cute and the art is still lovely, but thats not enough to sustain reader interest. Hopefully the next full release will improve upon the best of Vol. 1 rather than incorporate the worst of Vol. 0.", "date": "August 19, 2015", "grade": 2.0}