{"name": "Super Mega Baseball: Extra Innings", "ref": "https://hardcoregamer.com/?post_type=post&p=162900", "text": "With gaming technology the way it is now, hyperrealism seems to be the priority and the sports video game genre seems to be at forefront when it comes to achieving as much realism as possible, be it in visuals or gameplay mechanics. In a quest to become as close to the real thing as possible, sports video games started to become too grounded in reality, giving up on the simple pick up and play appeal. Wrestling video games are the biggest offender when it comes to this, as the more realistic entries weve seen in recent times are a huge far cry from the simplistic, fun arcade-style grappling games we saw during the N64 and early PS2 days. There was a time when sports video games were merely grounded in the basics of their respective source material but they prioritized being a video game first and foremost, and not a simulation. Games like Ready 2 Rumble Boxing (Dreamcast), Decathlete (Saturn) and the many Mario sports spin-off titles were all about keeping things fun, adding some interesting mechanics to make the sport feel more like a video game. Vibrant cartoony visuals, super-charged abilities and simplistic controls and execution is what makes an arcade sports title appealing to everyone, even to gamers who may not be too familiar with the sport itself. Super Mega Baseball first landed on the PlayStation 3 and PlayStation 4 and was quite well received for being a fun baseball offering, a welcome addition considering the obvious lack of baseball video games at this point. Now the follow-up lands on the Xbox One as Super Mega Baseball: Extra Innings, keeping the same game intact while adding new content and refinements.Whats great about a game like Super Mega Baseball: Extra Innings is that you dont have to be a baseball aficionado to enjoy its offerings, and it doesnt take long to get grips with the controls and systems. Extra Innings may appear to be far removed from reality, but the core baseball shenanigans still stays true to the conventions and intricacies of the sport. Dont expect the simplicity of Wii Sports or Kinect Sports, as Extra Innings takes its source material seriously, all while adding some interesting mechanics of its own.When it comes to the core baseball systems, Super Mega Baseball: Extra Innings will almost surprise you with how much it has going for it, whether its batting, pitching, or running bases, theres some fine nuances and intricacies in the mechanics, and they really kept all the little touches of baseball intact. That being said, all the systems become second nature rather swiftly and the first Exhibition match does a great job of teaching you as you play. In terms of the playability and execution of mechanics, Super Mega Baseball: Extra Innings does a good job of keeping things simple,clean, and responsive, which makes the pace of games quick and fun (although you can expect a game to last a good 30 or so minutes).Things get more interesting when it comes to player stats, and apart from the typical stats dictating their performance, theres a couple of interesting meters and systems that play a huge role in the core gameplay. Mojo is the confidence that a player has during a match, and this ties with Pressure. If a players Mojo is high, then theyre going to be amped up under pressure, but if theyre too nervous and worried then they will crumble under pressure. Pressure kicks in during key moments of the game, and so the way players react and respond to a certain points of the game, makes the baseball experience in Super Mega Baseball: Extra Innings feel rather natural and organic.Exhibition mode is great to kill 30 minutes,and the local multiplayer option allows up to four players to join in on the fun. The lack of online isnt too huge a loss, as this is a game that shines over a good old fashioned couch session which anyone can sit in and enjoy. The A.I. of the CPU is actually quite the challenge even when you lower the difficulty for yourself, and so theres definitely more incentive in getting human players involved to even the playing field and make things more fun. Baseball aficionados wanting a little more can get their fix in the Season mode. This has all the micromanagement youd expect from a Baseball simulator, with detailed stats and some serious player management as you sort through your roster and make some staffing/contract decisions. Its nothing intense, but there is certainly enough customization depth (you can even alter the appearance of every player) to satisfy those looking for single player depth. Levelling up during the Season mode gives you points to hire new staff (like players or even coaches) and also get some useful stat boosts for your star players. Closing Comments:Super Mega Baseball: Extra Innings sits comfortably between being an inviting arcade-style romp and a serious baseball simulator. Its easy enough to get into the swing of things, but theres plenty of depth for those looking for a baseball video game to invest in. Super Mega Baseball: Extra Innings offers enough content and gameplay systems to engage players regardless of their appreciation of the sport. As seriously as Super Mega Baseball: Extra Innings takes the sport, its still a fun video game first and foremost.", "date": "August 16, 2015", "grade": 4.0}