{"name": "The Last Cube", "ref": "https://hardcoregamer.com/?post_type=post&p=420086", "text": "Its nice once in a while to come to a game that doesnt take itself too seriously. Or to be more specific and blunt: doesnt go about disguising its scarce, maybe limited content of substance by masquerading as something more profound. That beyond some simplistic gameplay loop or unimaginative thread of doing A then B and capping off with C, that what it should be praised for is its other aspects. That which isnt mechanical, structural or even artistic, but is more profound than anything that can be bogged down by such needless things as objectivity, or perish the thought, actual critique. Whether this line of thinking indeed pops up in puzzle games, in platformers, maybe a combination of the two. Thats not to say that a game cant excel via the themes its professing, if not uniquely exploring.But analyze a title for long enough (or in some cases, not long at all) and you quickly stumble upon a disheartening truth: a lot want to be perceived as more than the sum of their parts. Not least when said parts dont exactly spur much of an impression. Needless and somewhat confusing praise this may sound to those who arent avid puzzle fans, I give credit first and foremost to a game like The Last Cube and its developer Improx Games for not falling into this same trap. The trap of assuming its premise needs some thematic, high-concept narrative or themes that may or may not hit too close to home for some, in order to keep things investable. Sure theres a set-up of a cube-shaped homeworld and optional tidbits of lore that do at least want to make the surroundings feel more than brief, competent backdrops.But not for a second does The Last Cube take itself too seriously. Nor, to kick things off, does it begin the campaign by warning players that the game somehow explores sensitive subjects or words to that effect. Come on, its a game about controlling a seemingly-sentient cube across grid-styled stages; not exactly the most lavish of pitches, but theres admiration to share with a game like this. Not just for the reasons established, but more importantly, it allows the delightful little symptoms of head-scratching, Sokoban-esque, multi-step puzzle-solving to blossom. A strange notion to make, but the frustration of not thinking far ahead  and maybe even the mistake of thinking far to begin with  is what makes a game like The Last Cube a delightful little endeavor. After all, what could be any higher a plaudit in the puzzle genre then the idea that even making a mistake can still emotionally be a net positive.The reasons for these lie naturally in the main mechanic  the application of what the game dubs stickers to each one of your cubes six faces. Throughout each level, specific tiles house a given ability as indicated by a colored symbol. One of a blue cross allows you to rotate on the spot without having to move space. Another showing four smaller green square grants you a clone thats not only controllable, but can also have colored stickers applied to its own faces. There are some abilities that sadly dont have the same novelty or potential for stand-alone use. After a few worlds of levels comes a purple-colored skill that simply allows you to teleport to any space in close proximity which on its own doesnt stir much intrigue, but does at least compliment well when applied to puzzles with multiple stickers to utilize. A process The Last Cube fortunately sticks to for a large chunk of its play-time. Another one, a red circle sticker that can allow your cube to descend diagonally from off a platform, as if going down a staircase, does on occasion spur a desire to hunt down collectibles, but often works more effectively when it too is part of a process, rather than granted an entire level of its own. Not least when invisible walls and assumed spots to descend to often sully a portion of that former novelty.But here is where The Last Cubes hidden, seemingly unforeseen delight as a puzzle game slowly but surely reveals itself. Because while the natural order of levels to complete  with or without the personal need to find all optional collectibles  is a obvious and straight-forward objective to process, the beauty of a game like this is in how cleverly it has manifested an entirely different conundrum separate from the levels themselves. And thats the [theoretically simple] task of getting the right face to line up with the right grid-space. Indeed, for as basic a detail this sounds, its this concept  a three-dimensional shape moving atop a two-dimensional space  that in fact stirs up some of the most satisfying and satisfyingly-frustrating moments of all. Not only are you thinking sufficient steps ahead long-term on how to activate a given panel to enable said bridge or door alike, youre also thinking some number of steps ahead short-term, on simply getting to a spot with the desired face correctly pointing up, or down, or even to the side.Intentional a design or not, the best moments playing through The Last Cube dont necessarily revolve around switches or devices or even figuring out how to get an ability on the other side of a row of tiles that erase all stickers should you step on them. The highest moments of satisfaction are in getting the right sequence of left/right/up/down movements, just to activate said switch or device. A solution could already be discovered after minutes of it being completely oblivious. But you could so easily spend that same number of minutes dancing around the grid trying to get the right face to land on the ground. And this isnt a fault of the game, nor is this some convoluted or unnecessary padding out of time that works against it. It works in the games favor  a process that later on embeds itself more so into the puzzles themselves. Scenarios too that require you to plan accordingly on specifically which faces to assign certain abilities to so that a desired attempt makes it all the way.But then there are sequences that precede even the very act of applying that planned assortment of multi-colored faces. Scenarios that are as much about avoiding contact with specific faces and sticker symbols. Laughably at points, for example, hoping youve added up the right number of rotations so that an autonomous cubes particular face doesnt make contact with yours. What you have then is a game that is aware of its players own methodology in working out the solutionand means to mess it up. To catch out those who, most of all, arent focused every step of the way and whom may unknowingly allow complacency to creep in at the end. Something of which I myself was guilty of numerous times and one that, while annoying, only reflects positively back on how well The Last Cube is able to pounce on such unbeknown mistakes. Its maybe not as profound or as substantial as something like Baba Is You, but while that game was all about tinkering with its own embedded logic, The Last Cube similarly seems to warrant tinkering of sorts, with the nature of sequencing. And because the game dedicates itself to thinking beyond mere switch-pressing and transporting stickers across a space, its why these brief moments of second-guessing are as delightful as they are. Both in hindsight and in the moment.Closing Comments:Some will take one look at The Last Cube and perceive its sterile aesthetic and reliance on geometric simplicity as something altogether lacking. And while the surrounding visuals and artistic design may be secondary to the mechanics of its gameplay, its because the gameplay is so focal here why its, at the very least, a charming take on the nature of sequencing. Because while such things as a correct order of play arent, on their own, anything to remark highly on, its the ways that line of thinking is utilized  almost against the player, as if manufacturing another unforeseen puzzle amidst the one already at play  that results in anything but a game lacking in substance. Most of all, this is a game that acknowledges it neednt require the pretense of grander themes or assumed narrative to engage its players, emotionally or otherwise. Who knew flipping and rotating a cube to face the right way could be so involving, but The Last Cube revels in such a hidden complexity. The Last Cube is commendable in its execution, but even more delightful in its unraveling.", "date": "March 10, 2022", "grade": 4.0}