{"name": "PGA TOUR 2K23", "ref": "https://hardcoregamer.com/?post_type=post&p=428627", "text": "2K and HB Studios have brought back their golf game with PGA TOUR 2K23. After taking a year off, 2K has doubled down to make the most complete PGA Tour game that anyone has seen in almost ten years. While HB Studios continues to develop the series, this is its fifth entry as the core of the series was established with The Golf Club. PGA TOUR 2K23 addresses a lot of what was missing with the previous game while adding even more depth to the series. There are still legacy issues and the fact that microtransactions still dominate the customization portions ultimate holds the new version back from achieving true greatness.While the series has had the PGA license for the past two releases, it felt minimal. Yes, there were official courses that were seen in the tournament in the game, but the focus was purely on customizing MyPLAYER rather than letting players select real players to play with. This has been rectified as the roster is headlined by Tiger Woods and includes Stephen Curry and Michael Jordan as DLC. Players can choose from fourteen PGA Tour Pros complete with licensed apparel. This also includes LPGA golfers, as well, as the game will mix and match both in the matches. While fourteen isnt a ton, these are some of the bigger name golfers out there. This also allows friends to quickly choose someone rather than having to go with a guest outfit, even though that option is still in the game. This is a much-needed aspect the series desperately needed and 2K and HB Studios delivered on this.Along with the PGA Tour Pros comes twenty courses with three new ones: the South Course of Wilmington Country Club, The Renaissance Club and St. Georges Golf and Country Club. A lot of these dont stand out as amazing, but there are a handful of great courses that stand out. Unfortunately, the likes of Pebble Beach and Torey Pines wont be available until later. Each course is replicated well and provides a solid representation of whats seen on television. The staple also remains for HB Studios with the return of the Course Designer. The game does consist of hand-picked courses from the past to easily download and jump into. The process is more simplified this year for easier approachability for designing courses and this is a whole separate aspect to the game itself. While adding playable Pros to the game is a huge bonus, the biggest addition to PGA TOUR 2K23 comes with the addition of Topgolf. This is basically an adult putt-putt on steroids that results in hitting different types of shots to accrue points in competition. 2K has nabbed the backdrop of Las Vegas with the official Topgolf in the town being represented. I feel like 2K missed an opportunity by not including an option to see Las Vegas at night, but its a cool backdrop nonetheless. I recently stayed at The Linq in Las Vegas and you can see it and the ferris wheel in the distance. This is the ultimate couch co-op mode, even though it does have matchmaking. Youre provided ten balls to score the highest points by focusing on aiming for zones that provide bonuses. Each target has its own quadrant that provides different points allocations. I went head-to-head with three friends locally and three hours had passed before we knew it. The mode is simple, approachable and inclusive while providing challenge if you seek it. 2K and HB Studios thought outside the box with this much like what was done with adding Divot Derby to previous game.Another big addition that 2K and HB Studios has added to be more approachable is the inclusion of the three-click swing. This is an aspect that has been missing in the HB Studios games that pre-dates the Swing Stick we see today. Holding down X for power measurement then hitting the timing of the fore swing and backswing allows for more straightforward shots without the risk of being overly precise. The Swing Stick does return and includes a new power meter on the screen to help with better swing mechanics. There are varying difficulty levels in the game and both Beginner and Amateur provide a good bit of fun without incorporating frustration. Once moving to Pro, the speed of the three-click swing becomes faster and more difficult. The Swing Stick still remains frustrating at times, but seems to allow for more leeway on the shot results. Putting, with either type of swing, is still a tough learning curve as reading the green is more important than providing a perfect shot trajectory. It still feels at times that a mess up with the Swing Stick will pre-determine a penalty such as landing in a sand trap that doesnt feel like it should. The swing feels more fluid, but theres still too much focus on exact precision no matter what the difficulty is. This even gets to the point that you overly focus on how you shoot just to prove a point. Swing speed from start to finish is the biggest culprit as compared to having a straight swing plane. I dont feel like the game is against me, but rather that I can improve my accuracy, but time will tell.One thing I want to note before jumping into detail on the visuals is the difference between the quality mode and performance mode on current-generation consoles. Quality mode provides better reflections but a worse framerate while performance provides a smooth 60 FPS. It feels like the quality mode tanks even below 30 FPS for some reason. The biggest problem with this is the precision that the game requires. Trying to do this with a lower framerate means the input is much slower. It just doesnt feel right and will have your game tanking, especially if using the three-click button swing. This works better when using the Swing Stick, but I still had better results across the board with the performance mode. MyPLAYER and MyCAREER are still the hefty part of PGA TOUR 2K23. One thing that was missing was the lack of progression from the previous game as success for the player was based on purchasing and upgrading clubs. While this remains a part, 2K and HB Studios have implemented a much-needed progression system by adding a skill tree for MyPLAYER. Some skills will activate in certain situations to add a boost to the player. Archetypes have also been added to help fully shape the direction of the player. This can all be reset at any time if the build isnt working, but theres a grind to fully unlock the type of player youre looking for. To be fair, the game is designed to improve your golf game if you so desire, so this takes time as golf isnt a patient game. MyCAREER adds the ability to play against a selected rival of your choosing, which is a nice change of pace. Theres the choice of the four tours related to the PGA, but the mode is largely unchanged.What also feels largely unchanged is the presentation of the game. While the menus are much better, the actual television presentation during the game is carried over. There are three announcers now with the addition of a female broadcaster and the broadcast remains solid at best. The cuts and replays are still nice, but the actual graphical overlays feel stale. I am not sure if the PGA has its own broadcast overlays or if its tied to specific courses or networks, but I believe PGA has a TV network. The overall broadcast still provides a good golf atmosphere, it just hasnt meaningfully changed. Also remaining unchanged for the new game is the inclusion of microtransactions. Everything can be purchased with in-game currency, but there isnt much provided in relation to the amount of time that is invested. Whether it be licensed apparel from Bridgestone Golf, Callaway Golf, Nike Golf, PING, PUMA, etc, it will have you grinding for a new shirt or watch. The goal should be to bolster your golf bag with new clubs. Clubs can also be fitted with different parts and there are unlocks along the way to help out. The Michael Jordan clothes are almost 3,000 VP and I have yet to accrue that to purchase it. At least microtransactions dont power the unlocking of skill points for upgrading your MyPLAYER, but certain golf ball boosts are purchased and lost over time.The visuals provide an excellent look at the game of golf from a distance. As mentioned above for current-generation consoles, theres a choice of quality and performance modes that provide a variation in FPS and fidelity, but I dont think theres a large jump in fidelity to sacrifice the FPS thats needed. SSAO is also an option thats separate as the focus for this comes on reflections and lighting in the environment. There may be more assets that can be seen, but ultimately the difference isnt superbly noticeable outside of the drop in frame rate. Player models, even though the faces look real on the pros, feel like a NPC you would see in The City on NBA 2K. There isnt a lot of detail and the created characters do take a bigger hit. The golf environments do look good until you close in on some of the environments. I feel this is largely due to the game being available on previous-generation consoles with the current generation getting a locked 60, but not necessarily being optimized for the hardware.The overall audio experience for PGA Tour 2K23 still remains above average. Changing up the commentary helps to freshen things up, but it still feels like the Korn Ferry Tour. When the crowd gets into it, the reactions sound great. The soundtrack is still fantastic as some synthwave was dribbled in for the game this year. I will also prefer a game-specific orchestrated soundtrack to the commercial playlists that have been implemented in the last fifteen years. It encompasses the game of golf while modernizing the feel within the menus. Closing Comments:2K and HB Studios have made the necessary additions and changes to make PGA TOUR 2K23 the best in the series. The three-click swing option opens play up for everyone while also eliminating the frustration of having to be overly precise with the Swing Stick. Topgolf is that couch co-op golf that everyone has been waiting for while MyPLAYER finally sees a progression arc added to the series. The game does get held back by a lack of meaningful changes to the Online Mode and that includes no cross play, which frankly makes no sense. Connectivity was fine during the pre-launch period for the three-hole rounds, Divot Derby and Topgolf. The option to select a PGA Pro for Topgolf is needed, however, as it currently isnt available. Along with those things and the microtransaction aspect, the positives outweigh the negatives and PGA TOUR 2K23 simply brings back the fun in golf.", "date": "October 12, 2022", "grade": 4.0}