{"name": "3D Streets of Rage 2", "ref": "https://hardcoregamer.com/?post_type=post&p=160305", "text": "The SEGA Genesis had some great games back in the day. While it barely stood up against the Super Nintendo, it was the console of choice for the kids who thought they were too cool to play a little kids video game system. Either way, there are a few games considered too violent for Nintendos taste which is why folks checked out Streets of Rage 2 for the Genesis. Luckily, times have changed and were able to enjoy the same game nowadays on the Nintendo 3DS. Its introducing a new generation to a classic title and keeps the genre alive.If you havent played Streets of Rage 2, the gameplay is simply: go through each level inflicting pain on enemies as you progress. Its simple to understand and fun if you have a bit of rage to let out. This remains the same for 3D Streets of Rage 2 as youre still traveling through the game to defeat Mr. X and his syndicate in order to rescue an old pal, Adam Hunter. You can choose one of four characters, each with their own strengths and weaknesses.If you grew up playing Streets of Rage 2 for the Genesis, youll notice not much has changed in 3D Streets of Rage 2. The overall control and gameplay remains largely unchanged but players will enjoy some upgraded graphics and new modes. From the start, you can switch around with different features to make for a unique visual playthrough. There are options of switching between the English and Japanese versions as well as giving the screen that old school fuzzy appearance found on retro color televisions; like the ones you played the original Streets of Rage 2 on growing up. Not only that, but the 3D aspect appears to be one of the best for any 3DS game. With two options to pick for third dimension pleasure, neither of them would lead to any disorientation or dizziness like some games can. Switching between 3D and 2D is relatively flawless with no discrepancies from either mode. Whichever style you choose to play will look as clean and crisp as the other.The whole Syndicate Gang is back and cant wait to get their hands on you after over 20 years of bumming around alleyways, baseball fields and thick jungles. Duking it out on the streets is still enjoyable and has held up nicely through the years. Enemies can be predictable on easier settings but youll still find yourself getting knocked around when it comes to the bigger bad guys. Upping the difficulty will be a challenge for even the most skilled players; enemies come in swarms, theyre much faster and have more health.All this hasnt changed since the Genesis days but what is new are the added modes of play: Casual and Fists of Death. With Casual Mode, some of your attacks will do more damage to opponents which can be helpful in your fight. If youre looking for the easy way out, then youll want Fists of Death mode which allows you to knock enemies out in one hit. Its the perfect way to play if youre going for some kind of speed record as well. The game itself is short especially if youre on easy settings; the entire experience can be completed in less than an hour given the right circumstances. 3D Streets of Rage 2 could benefit from added stages and new enemies, but since this is basically a port, it wont happen. Theres also a mode called Rage Relay allowing you to play as all four characters. Once one of their health meters is empty youll automatically come back as the next fighter you chose. Its a good mode to check out if you dont have a character preference or just want to try and master each one.One of the downsides is the co-op mode. The only way to play with another person is if they also have the game. It makes sense since its for 3DS with no way of have true multiplayer; if the game was available for Wii U it could have made a big difference. That was a great feature back on the Genesis and would have been fantastic to try out today. Local play is fun but just doesnt give the same feeling of bashing bad guys side by side with a friend.Closing Comments: Back in the day, Streets of Rage 2 was considered one of the best video games of all time and much of that proclamation still rings true. 3D Streets of Rage 2 is as fun as it used to be in the 90s and stands out in the genre. In addition to new games modes, the ability to save a game at any point in time makes a great game even better. Its been perfected upon and an overall better experience since you can play on the go. Fans of the original and newcomers alike will have fun playing this remake.", "date": "August 6, 2015", "grade": 4.0}