{"name": "Etrian Odyssey 2 Untold: The Fafnir Knight", "ref": "https://hardcoregamer.com/?post_type=post&p=160676", "text": "Etrian Odyssey is one of the few series that releases an new installment, or a remake of some kind, every year or two. While annual franchises are a thing these days, many of them seemingly get worse with each new iteration. While it has been just over two years since The Millennium Girl launched on 3DS, Etrian Odyssey 2 Untold: The Fafnir Knights release could very well still feel like a little too much, a little too soon.Etrian Odyssey 2 Untold: The Fafnir Knight, like The Millennium Girl, is a remake of an older EO game, the second title in fact. In fact, its hard to believe that Etrian Odyssey II: Heroes of Lagaard was released seven years ago as the games formula and aesthetics dont look but a few years old. And with Fafnir Knights release, the game looks better than it ever has. The enhanced visuals are more vibrant and clearer, helping bring to life an already strong visual style. The character designs seen in the new Story Mode also do a great job of fitting into Etrians world. Although players assume the role of the Fafnir Knight, the main protagonist remains silent throughout the journey.This in turn requires a fleshed out cast of characters, the likes of which Untold 2 does effectively. With four companions, The Fafnir Knights story is a compelling one; more so than Millennium Girl, which I spoke highly of in its review as well. Still, if folks were disappointed by what the first remake had to offer, know that the narrative this time around has more depth, more characters, and enhanced thematic undertones. All in all, its simply a better told story thanks to crisper writing thanks to the localization team, and a more concentrated effort to let the player really get to know the characters. They have depth, their own internal compasses for morality, and their own histories.Naturally, this is still an Etrian Odyssey game, and by that very nature, the tale is not going to rake in any awards. Even though it has the elements that Millennium Girl lacked, it still does not stack up when compared to JRPG juggernauts like Dragon Quest or Shining Force. So, if folks are only here for the story, they will leave fulfilled but not wholly satisfied.This is okay, though, because it simply means that the focus of Fafnir Knight is on its gameplay; namely its exploration, combat, and customization mechanics. If folks ever played the original Heroes of Lagaard, theyll know that the aforementioned gameplay conventions are not much different than those found in other EO games. So, what that means is players can expect to roam giant labyrinths while mapping the area via the bottom screen and stylus, and fighting hideous baddiessome of which will be easily trounced, some of which will one-shot people into oblivion. While Fafnir Knights Story Mode is considerably easier than a typical Etrian title, the Classic Mode is every bit as challenging as weve come to expect from the franchise.Combat plays out in a turn-based fashion after encountering a monster on a separate screen while wandering a dungeon, and is less about sheer power and more about the prep-work that folks haveput into developing a well-balanced team of fighters. Like in the rest of the Etrian games, 2 Untold is every bit as tactical as its brethren. Its what makes the formula work so well; managing, leveling up, and then properly outfitting with gear and skills is the name of the game here. Figuring out how to play off enemy weaknesses, as well as finding a team composition that can handle practically any scenario, is key to success. Its wonderful that this has remained untouched in both Millennium Girl and now this. Whats even better is the added aspects to the gameplay that only serve the complement that which is already in place.For starters, there have been improvements made to the skill trees. When unlocking a new section of a characters Skill tree, the new abilities are automatically learned by the system automatically adding a free skill point thus making things a bit easier for newcomers. But this is not necessarily a feature to make things easier, or to cater to only the ,asuals of the world. This simply streamlines the process of skill trees, allowing players to then allocate their time to managing battle setups. This doesnt mean theres less micromanaging per se, it does however mean that the time one used to spend on things such as skill trees, can now be spent elsewhere. To have this so accessible merely helps the pacing of the overall endeavor.Secondly, map icons have now been enhanced. In the past, it always felt like Etrian Odyssey never gave players enough icons. It got to the point that we would be marking the map with very general/vague icons to indicate a variety of things. This was always frustrating because it meant having to come up with a system of your own to keep track of if a particular symbol meant that there was a treasure chest located in that particular spot on the map, or if that was something else entirely. Now, with the enhanced map icons, players have better overall awareness of their travels inside the giant labyrinth. For instance, theres now a set of icons that depicts a closed treasure chest and an opened one. It seems strange to think about how this seemingly common sense feature was never in past Etrian installments; but to have it included now is a breath of fresh air.Another new feature is the ability to confirm commands in battle, a la Persona Q. Again, a small tweak, but a welcome one all the same. And speaking of welcome additions, the new side labyrinth to explore, Ginnungagap, is right massive, making an already content-rich experience that much more full-bodied. And its not like Ginnungagap has been hastily put together; the dungeon is filled with creative level design, difficult encounters, and of course multiple floors of treasure-hunting goodness. Its then, nice that, because these labyrinths are indeed so huge, that loading times have been vastly improved. Theres a lot of moving between floors and areas in Etrian Odyssey games. Its frustrating that loading times have made that traversal something of an annoyance. Now, players can sweep between rooms, not instantaneously, but pretty close to it. Even the save time has been greatly tweaked, making it easier and less pace-slowing than before.Theres also the opportunity to create advertisement campaignsbased on what the hub towns citizens desire in terms of goodswhich in turn rewards players with money based on how well they advertised their townees preferences. This plays into unlocking the town development mechanic that lets folks invest money into the towns wards, resulting in attracting more people to town and more wards to open up. Its all a fun diversion from the usual hacking and slashing that consumes most of the players time here. Though its by no means the focus of the game, and is pretty rudimentary in design, its neat that this almost mini-game like feature is present.Etrian Odyssey 2 Untold, as mentioned earlier, is a great looking title. Its interface and overall graphical fidelity is on par with Etrian IV, mostly because its working off the same engine. Surprisingly though, for an engine that is several years old now, it still looks brilliant. Sure, there are some aliasing issues, as there are with every 3DS game, but on the whole this is a vivacious game that has brilliant art design. Animations and small things like how towns look during the evening as opposed to during the day is a real treat to see.These excellent visuals are joined with an equally as impressive audio experience. Etrian IIs OST was already great, and that much remains true for Fafnir Knight. The tunes may not be as inspired and varied as they are in Legends of the Titan, but they still know when to wail on the electric guitar during boss encounters, and when to soothe emotions once returning to town after an exhausting trek through a dungeon. The voice acting is also top-notch stuff. In fact, the Story Mode is practically entirely voice acted, and has performances that range from just okay to really good, with most residing in the really good department. The actors have just really done a bang-up job here, conveying emotion at all the right times and pulling back for those more somber, serious moments.Closing Comments:Etrian Odyssey 2 Untold: The Fafnir Knight continues the trend of quality dungeon-crawling conventions. The Story Mode is a cut above Millennium Girls, with characters and a story that are far more developed, the combat and customization remains engrossing and deep, and the production values are impressive. This is a DRPG that can be played and enjoyed by veterans, thanks to Classic Mode, or complete genre newcomers thanks to the more narrative-heavy Story Mode where the level of challenge is far more accessible. Those looking for a new 3DS game to sink at least 100 hours into should buy The Fafnir Knight; its the definitive Etrian Odyssey game.", "date": "July 30, 2015", "grade": 4.5}