{"name": "Guild of Dungeoneering", "ref": "https://hardcoregamer.com/?post_type=post&p=159148", "text": "Theres absolutely no lack of dungeon crawlers available these days. Whether you want turn-based and highly strategic or super quick and simplistic its possible to find one that feels just right to your personal tastes. The less-common option when designing these games is to treat the player as a dungeon master. In Guild of Dungeoneering, thats exactly what is going on. Thanks to a brand new guild, and a constant influence of idiotic saps, youre able to send folks out onto dungeon runs in your stead. A successful run yields gold, which in turn can be spent to increase the guilds power, and slowly build up the power and breadth of your cronies. Of course, with such a sad sampling of minions, it might take a while to become an all-powerful guild.So how does all this dungeon commanding work in Guild of Dungeoneering? It all starts with selecting one of multiple missions to take on from a world map. The selected character will jump right in at level one and without any items. Heck, even the grid paper dungeon map will be 80% blank, with only a few rooms with enemies or treasure chests drawn in. Each turn players are given the option to play a card from their hand in order to help draw in the dungeon. They can draw new rooms, pathways, coins, and even add more enemies. All of this has a purpose, as well. You see, its actually impossible to control the guild member directly. Instead, youve got to hope that a glint of gold coin on the ground will get them hurrying in a good direction.Each dungeon has its own goal which varies in more ways than you might expect. Sometimes youre just going to want to kill off everything within while other times the goal is purely greed-based. Early on, one area even introduced a slightly puzzle-based element by expecting players to figure out how to level up quickly before a boss monster pounced on their guildee. No matter what, the overarching goal is to make money because thats what persists even when characters die off in droves. Without money, theres not a way to attract different classes of characters to the guild, provide them with a bit of starting equipment, or even get stronger folks by default.Money is gained not just by tossing it on dungeon floors but also via battles. Fights in Guild of Dungeoneering might take a bit of getting used to, but the basics should come easily to folks who have played card games before. Once in a fight both the player and enemy draw a selection of cards and play in alternating turns. So, they toss out the attack or defense card theyre going to use and then you are free to react to it with your own. Obviously, each characters goal is to kill the other, so youve got to do everything in your power to whittle away the monsters life first. Often, this proves challenging because of the utter randomness of card draws. You cant fully craft your own deck either, though there are ways to tweak it which well get to shortly. Some cards offer the ability to attack first which is mighty useful when both characters have just one heart left.Although theres not a treasure trove of card abilities, theres enough going on to allow for battles to stay compelling through most of the journey. The biggest issue for card fans is probably hearing that you cant create a deck from scratch. This is solved (to some degree) by granting characters new cards upon beating an enemy along with items for the guild member. Theres only a few items to start, but after accruing enough gold you can expand the guild to unlock more rare items. The same holds true for unlocking new classes, persistent magic abilities, and the like. Still, theres something about this lack of deck control that is a little disappointing.Theres also the fact that some aspects of Guild of Dungeoneering just arent displayed even when you would expect to see the information. Mainly this relates to placing monsters in the dungeon. Each monster is unique in that it may have different starting health stats and special statuses applied by default. However, you arent able to see any of this information prior to placing a monster card. Once its out there then you can see exactly how much health it has as well as whether its frail or powered up. When youre expected to utilize a bit of strategy with dungeon creation it gets annoying to have another degree of randomness still involved. Then again, it seems a lot of the gameplay is focused on always including a random element.Finally, its imperative to discuss Guild of Dungeoneerings visual and audio presence. Visually, the game stands out tremendously from the dungeon crawling competition with its graph paper backdrop and hand sketched artwork. Theres incredibly minimal animation to characters, though, which would have added a layer of polish in my opinion. Most of the experience is also black and white save for the red and blue decks of cards. As for the music, it sells the experience of exploring dangerous dungeons in a more serious tone than expected. However, that main theme is suitably campy!Closing Comments:The concept behind Guild of Dungeoneering is fantastic and more people should delve into tweaking genres like this. As the game stands, however, there are features that seem missing from a typical full release. With cards playing such an integral theme, why is there no means to more strongly create or influence a deck? Where is the potential to do something outside of the main story missions, as well? It does appear that developer Gambrinous is updating their title with little tweaks based on feedback. Its unlikely theyll make more sweeping changes, but smaller fixes are appreciated. Some will get even more out of the game than me, and if you believe youre one of those folks, then dive right into Guild of Dungeoneering.", "date": "July 20, 2015", "grade": 3.5}