{"name": "Europa Universalis IV: Common Sense", "ref": "https://hardcoregamer.com/?post_type=post&p=158845", "text": "Europa Universalis IV expands once again with the addition of Common Sense, bringing new mechanics for parliamentary monarchies, theocracies, the HRE, protestantism and Buddhism. The new patch released alongside Common Sense includes a new defensive fort system, new diplomatic options and a reworking of the way the economy is modeled including buildings, tax revenue calculations and gains from looting foreign provinces. Both the free and paid for content includes new events which add flavor and are historically instructive. As is usually the case with these expansions, the free content is more major than the paid content, but the paid content is significant enough to merit a purchase in its own right. The paid content again makes one or two countries particularly unique and interesting in a way that encourages giving those countries a play. Even for those whove played England before, this DLC will make that a new enough experience to justify a return.Since England is this expansions focused country, it makes sense to look at the new experience playing as this country. While the parliament system is the biggest change here, the most immediate change is that England is now at peace with France at the start. Apparently in 1444, the Hundred Years War took a holiday and the games start now reflects this. I was always reluctant to begin a game with a country at war and England and France were two countries I would often shy away from for this reason. Simply having some time to get to know your country before finding ones self in an existential war with the super power on the other side of the Channel makes those countries a lot easier to play.The second thing youll notice about England is their new parliament system. This works in two ways; first there are benefits and costs to the provinces being represented in Parliament, you can grant representation but you cant take it away. Then there is the actual legislative function of Parliament in which you propose legislation (a set of bonuses) and then have to trade favors with your MPs to get their support for your agenda. This could be as simple as bribing them, as dangerous as granting their region additional autonomy and as frustrating as hiring their brothers for military commissions, reducing your army/navy traditions. This adds a nice dynamic to English government, whereby one can experience an interesting series of bonuses that seem to last just long enough and doesnt seem to overbalance England, at least in the games I played. All constitutional monarchies gain access to this mechanic, but Englands government is now a distinct government type with its own bonuses. As for the rest of the paid content, the new buddhism mechanics work well and give an excuse to try playing as a southeast Asian country which was a interesting experience. Perhaps the Karma slider bar was a somewhat obvious mechanic, but its different enough from other religious mechanics to provide a unique flavor especially in relation how often one can fight wars and calls for a unique way of thinking diplomatically. The free city system for the HRE give those factions some interesting new diplomatic options which are always good and its also nice to see theocracies given additional distinctiveness.The free content is, in all, a significant reworking of most of EU4s systems. The building system no longer involves spending monarch points, but limits the number of buildings per province based on the provinces economic development which can be increased by spending monarch points. These changes seem to simplify building decisions substantially and provide a nice outlet for surplus monarch points. The biggest changes, however, are in the prosecution of war. Forts now play a deciding role, as provinces without forts fall to siege within a month. Provinces with forts take longer to capture but cost significant upkeep per month to keep in operation, are expensive to build and now you are limited to a certain number of buildings per province. Active enemy forts also limit movement in a region. This means that with a proper fort system is can be impossible to chase down a retreating army or attack certain provinces until the forts are taken, a refreshing new layer of strategy. Invasions must also be planned out in greater detail and troops placed in the correct locations for a speedy capture of certain forts allowing a breach that opens up more territory to occupation. The new looting system made war a more interesting and lucrative source of funding and the new economic system is preferable over the old one because it adds additional depth and gives the player more options for revenue. The last major thing of note is the new disaster system which gives the player a window into the potential consequences of low stability and other problems so they can take action to prevent things like the English Civil War. While the patch notes say that they reworked the mission system to reduce the number of impossible missions, most of the ones are rather impossible to complete, especially in a reasonable time frame. A significant number of events in both the free and paid content were also added. Its hard to discern the new from the old, but its always great to see more historical flavor in this game as Paradox attempts to program 400 years of historical events into this game which teaches history through a functioning experimental model while also being great fun to play.Lastly, as someone who has taught the game recently, I will say that the menus have become increasingly cluttered over the patches and DLCs, not that they were terribly straightforward to begin with. After a dozen or so hours, muscle memory sets in and it will all somehow make complete sense, however, a more straightforward interface would do wonders for reducing the barriers to entry for new players. Closing Comments:Common Sense is a terrific addition to Europa Universalis IV. Existing players will find additional depth in key countries and incentives to dust off an old favorite, like England, or try something new. The free content is major rethink of EU4s key systems and worked out quite well, greatly improving warfare as well as rationalizing and deepening province level development. This update, due to the scope of the changes, could have easily ruined the game if it wasnt done well. Fortunately, it came out polished and clearly well tested. This reworking of the games mechanics was so significant that its the sort of thing one would expect from a game that was previously broken. Instead Paradox took an already great game and made it significantly better. Common Sense is a great buy and a great reason for another playthrough  or three  to enjoy these new mechanics and unique country/religion flavors.", "date": "July 16, 2015", "grade": 4.5}