{"name": "Godzilla (PS4)", "ref": "https://hardcoregamer.com/?post_type=post&p=158677", "text": "Why cant Godzilla get a good game? The giant lizard has been around for over fifty years and throughout the entire existence of video games, yet not a single worthy game has been released. Its not for lack of trying  theres been nearly fifty games that include the officially licensed Toho beast. This is a franchise centered around a gigantic lizard monster destroying towns and fighting other gigantic monsters; its the epitome of what a video game should be. Yet since Godzilla first debuted in game format in 1983 on Commodore 64, only one halfway decent game has come along  Godzilla: Destroy All Monsters Melee  and it has aged quickly and poorly. Instead of going back to the drawing board for the current-gen debut of the king, theyre drawing off the putrid Godzilla Generations for some reason. Yeah, this is going to end about as well as Tokyo after a thorough Godzilla stomping.So lets get this out of the way first; much like the 2014 film, Godzilla sadly does not include Bryan Cranston. While that alone is devastating, the plot literally doesnt amount to more than Godzilla first appearing sixty years ago and laying waste to a city before going into seclusion and appearing again. Now mankind must once again defend against this menacing beast  but is it man whos the true beast? Its clearly the flimsiest set up imaginable for explaining why there are giant monsters rampaging around and the basic plot of at least seventy Godzilla films. While its not like anybody follows the franchise for its gripping story, it would have been nice to build more of a plot around the events.Of course, that would be assuming that theres a deep gameplay behind the story which there isnt. The main mode of Godzilla is known as God of Destruction, which allows players to rampage through cities as Godzilla. Gameplay is incredibly basic, even by Godzilla game standards. Theres a button for normal attacks, a button for strong attacks, a button to breath fire, a button for a defensive energy blast, a way to grab (which is difficult to pull off) and a way to charge. Thats literally everything. Theres no real combos and its rudimentary even by hack n slash standards. Breathing fire or blasting energy uses up the Breath Gauge which takes about ten seconds to refill. Both attacks are far and away the most effective, which will result in most battles devolving into waiting around for the gauge to refill. While it seems like the action takes place in large open cities in screenshots and videos, in reality everything takes place in miniscule cordoned off areas. God of Destruction presents players with around thirty different levels that are progressed through branching paths. Each level features a generic coordinated off city, military base, body of water or forest area. Thats about all the variety that exists and each setting is blandly generated. The goal of each of these levels is to locate and destroy several G-Energy Generators whilst fending off G-Force (the military protecting the city) units. A kaiju will show up about halfway through each level that must be dealt with before continuing to destroy the G-Energy Generators. Once all the generators are destroyed, the level is complete. Thats literally the entire game. Theres no variances, no other targets to seek out, just destroying the same generators time after time. A scant few levels attempt to shake things up by making players destroy other generic objects like submarines (which are still referred to as generators for whatever reason), but overall its the sort of game that youve beat after beating the first level.There are multiple other modes, but none are of any weight. King of Kaiju is a Horde-esque mode where players face off against six increasingly difficult kaiju one by one, but the gameplay is exactly the same as facing off against kaiju in God of Destruction. Evolution Mode is not actually a mode but rather a clumsy upgrade screen that allows kaiju to be leveled up by collecting items and energy throughout the main modes. While it unlocks new abilities and strengthens default ones, no further combos or gameplay elements can be unlocked. Diorama is a diverting mode that allows players to place kaiju models in replica environments and take screenshots using their PS4s share ability. While nifty, theres not really much to it and unlocking models is a slow and unfocused prospect. Kaiju Guide is a commendable addition that allows players to read the bio and see a still from a movie of a kaiju theyve unlocked. The most notable mode outside of King of Kaiju is VS Mode, which proves to be a sorely lacking multiplayer addition. Players choose their kaiju, map and whether they want to face one or two other players and have at it. Thats it, no game types, no variances with single player, just mindless smashing. The ability to have three players is actually odd as either everybody is either chaotically going at it at once hoping they spam the buttons enough times, or one of the three is hiding in the corner as the other two duke it out only to swoop in and take the damaged survivor out. Considering this mode has almost no longevity, it would be entertaining only if it featured a local mode to mess around in with friends, but to the games detriment, only an online mode is included.Longevity is not only an issue in multiplayer, however, but for the entire package. The base game can be beaten in about an hour due to its branching paths. Of course thats not intended to be the end, but players must fully complete everything in God of Destruction to reach the true ending. This means finding all four camera angles in each levels (that momentarily swaps the view from third-person to a G-Force operative filming Godzilla), exceeding one hundred meters in height (Godzilla grows bigger upon every destroyed object) and reaching 100% destruction rate. This all feels like busy work and reaching 100% destruction rate is constantly frustrating as its not always clear where the last few destroyable objects are. Only the most devoted players will actually see this through, and although it will take hours to complete, merely completing every main level will not take more than a couple. Closing Comments:It boggles the mind that a good Godzilla game hasnt been produced yet; its a franchise about a giant lizard destroying things for Petes sake. Until a studio like Platinum is given the reigns, however, perhaps its time for the King of Monsters to hang up his size 1000 video game shoes for good. Bandai Namcos stab at the icon is mostly a rehash of a terrible Dreamcast game that does little to distinguish itself to fans. Its clear that the developers hearts were in the right place; as much content as possible was clearly eked out of the likely meager budget and mindlessly destroying things is fun enough to not feel like a chore. Faint praise, however, as while this could have become a so-bad-its-good Earth Defense Force type experience, its instead held back by clunky controls, dated visuals, confined level design and a lack of gameplay variety. Theres some fun to be had here, but this use of some is coming dangerously close to meaning minutes instead of hours. Perhaps Godzilla will get a decent game by his hundredth anniversary, but this isnt it.", "date": "July 15, 2015", "grade": 2.0}