{"name": "Coffin Dodgers", "ref": "https://hardcoregamer.com/?post_type=post&p=158310", "text": "The kart racing genre was a staple of the 32-bit era. Every possible franchise you could imagine had an entry  even Mega Man and Final Fantasy. Some of these wound up being highly-forgettable due to their mediocrity, while top-shelf entries like Mario Kart 64 and Crash Team Racing raised the bar for the genre. Due to the glut of games, however, a lot of these franchises just had one and done entries and the genre wound up being downgraded in terms of the quantity of games, but increased in quality. The Mario Kart games kept things going, as did a scattered assortment of other games like Crash Nitro Kart while Sonic and Segas All-Star Racing franchise remains the third-party gold standard now.With the console-centric entries in the genre keeping quality high, its led to an influx of kart racers on mobile platforms. Some have just been mobile variants on console games, like All-Star Racing Transformed, while others have gone with a 3D look like Shreks kart racer. The 3D games tend to look rather ugly and dont do much to freshen things up. While Coffin Dodgers isnt a pretty game and sadly continues that trend, it does freshen the genre up a bit with a unique premise. The Grim Reaper is coming for a slew of old people and its to whichever character you choose to play as to save the day for themselves.Wins and losses actually have a sense of importance in the championship campaign since whoever comes in last place winds up dying. This means that they cant make any progress in the story, but Death will revive them to get in your way. In a neat bit, Death actually takes part in the races too. I guess hes really hands-on and wants to make sure that he takes care of all these codgers himself to at least try and ensure his job is done properly. Luckily, Death can be thwarted here thanks to some power-ups and your default melee attack. The control layout works fine and everything is responsive  not razor-sharp like Mario Kart 8, but still reasonably good.Standard kart racing rules apply for the main game with the basic goal being to score in the top three to ensure progression throughout each set of championship-level races. The better you do in the standings and on the track, the easier time youll have making progress. Proper weapon use nets you a ton of XP, while wins get you cash. Cash allows you to upgrade your mobility scooter in a variety of ways. If youre not happy with its handling, just focus on mobility upgrades. Speed and melee weapon damage can be increased, and when youve got everything there maxed out, go for some paint work. Sure, you could do that first  but it could lead to you suffering in the standings, and thats something youll want to avoid. Unlike a lot of kart racers that let you re-race tracks to get the best score, you cant quite do that here. Youre free to retry as much as you want to right after a race, but cant go through an earlier course with new gear to try and gain more money. Its a bit of a shame, but it does allow things to be a bit more fair and not make any single player a demigod in the lineup. The games use of rubber banding is annoying, and can easily send you from first into the back of the pack with either a single mistake that sends you into the scenery or a weapon blast. Scenery tends to block you at random with boxes not doing a thing, or cones, but cars and fences of all things stopping you dead in your tracks.The core game offers up a lot of fun with a combination of a melee attack that can be charged up to do tons of damage in one shot and the usual array of power-ups. The combat evokes a bit of Road Rash by offering up some satisfying bonks to the head during a close race. Item pickups are fairly standard, with a boost, rockets, and homing rockets available. The biggest change is the inclusion of a sub-machine gun, which you certainly wouldnt expect in a game like this. Its fairly low-powered, but can do a lot of fast damage and take foes out  so its great for late-race shifts in your favor if you have one and bad if you dont.Visually, Coffin Dodgers looks like a fairly old mobile game. Nothing about the graphics is all that eye-pleasing, and to say that theyre on-par with the PS2 would be an insult to the beauty showcased during that generation. The character models are simplistic, as are the environments and animations. The most impressive part of the graphics probably lies in the explosions from the rockets  and even those arent all that amazing, theyre just the best-looking things in an otherwise bad-looking game. Animations are nearly non-existent and every part of the world looks like a paint-by-numbers design. Its a sloppy-looking game in every way. One can argue that PS1 games looked worse, but they at least looked good for their time and in some cases, you have things like Crash Team Racing that run circles around this game visually.The audio is worse than the visuals because at least theres some variety there. Musically, you get very few tracks to listen to and theyre short and loop constantly. Sound effects are okay, but forgettable due to being bog-standard with what youd expect. You get a basic thwack sound for melee, braking, acceleration, and power-up weapons like rockets. You can just imagine them and thats what youd hear  the game loses nothing being muted, and thats never good. Sound design is such a crucial part of the puzzle and its just been forgotten here.Closing Comments:Coffin Dodgers is a heavily flawed game that winds up being ever-so-slightly greater than the sum of its parts. On the surface, it shouldnt be as fun as it is due how rough around the edges so many parts of it are. The core game is still fun to play even with its issues, though. The options are somewhat limited for PC kart racers and this one does have enough going for it gameplay-wise to be satisfying. Its graphics and sound fall far short of any standard set in the past 15 years, however, and it looks far sloppier than any kart racer weve seen on the market in many years. As a result, Coffin Dodgers comes with a very mild recommendation if youve played through every other kart racer out there and just want something to dink around with for a bit.", "date": "July 13, 2015", "grade": 2.5}