{"name": "How to Take Off Your Mask", "ref": "https://hardcoregamer.com/?post_type=post&p=158292", "text": "It might surprise folks who have recently jumped into the world of visual novels, but there are copious amounts of games available in English but not on Steam. Seriously! Only recently have many of these niche developers and publishers been able to get their wares in front of the digital distributors massive audience. One such company is roseVeRte. Luckily, their newest title, How to Take Off Your Mask, made its way to Steam very quickly. This is an otome game in particular, meaning that it focuses on a female lead and her potential male beau. With that said, although the title is targeted at women, absolutely anyone can play and enjoy this sweet romantic comedy.The setup for How to Take Off Your Mask centers on a few individuals living within the fantasy city of Leezera. Although the setting is a bit medieval, with castles and kings, theres also a bit of modern technology as well. For example, text messages can be transferred between people with pager-like technology. In any case, the visual novel stars Lilia, a young woman who works at her grandmothers bakery. She lost both her parents at a young age but also gained a lifelong friend around the same time. This childhood chum, Ronan, has always stuck by her, and in fact seems far too klutzy and childish to ever leave her side. Everything seems charmingly perfect at the start  perhaps a bit too perfect.Lilias blissfully simple life is changed when she wakes one morning and finds that she has been transformed into a cat girl. No, this isnt just some weird fanservice thing either! Another feature of this fantasy world is that humans as well as Luccretians exist, with Luccretians being the cat people. Unfortunately, the local townsfolk generally hate this other species and wish they would stay out of Leezera. Tensions have flared so much lately than a rogue team of locals have banded together to exile any and all cat people they find. As such, this presents one heck of a problem for Lilia who had, until transforming, been well-liked by everyone. Luckily, she quickly discovers a means of switching between both forms, though it doesnt change the fact that shes not a normal everyday person. Things quickly grow complex as, while in Luccretia form, Lilia discovers Ronan is living a sort of double life. When not with her, he serves as a town guard and is totally mature! Ronan, who has no idea the cat girl is actually Lilia, finds himself confounded as to why his emotions are stirred. As How to Take Off Your Mask progresses, things get even weirder as both characters work to uncover the emotions that they have for their childhood friend, as well as how to contend with the hatred of townspeople. With this sort of plot you can expect all sorts of wacky moments and misunderstandings between both leads as well as the supporting cast.The best aspect is, as you might expect, the characters and how they banter back and forth. The writing is solid, although a few choice sentences come across as stilted. For the most part you quickly grow to like each cast member and want to see things work out for the better by the end. Depending on the dialogue/action choices you make during a playthrough, your ending will be pushed toward one of two main endings. Unlike many visual novels, the storyline of How to Take Off Your Mask is tailored toward just one romanceable lead as well. Luckily, hes a great guy worth fawning over, though I admit it would have been cool to have options with the other hunks too despite it not making total story sense. Fans of visual novels should find nothing to complain about as far as How to Take Off Your Masks visuals are concerned. Unlike some other indie visual novels on Steam, this one features some fairly colorful anime art to depict its previously-mentioned hunks. Although only Ronan is romanceable, his friends are equally dashing. The two versions of Lilia are cute as well, even though they look surprisingly different (for story-based reasons). Theres not a massive amount of CG scenes included, but those that are look lovely and feature your typical scenes of blushing characters crammed together in embarrassing circumstances.Finally, theres the matter of length and replayability which is often on a visual novel fans mind. My first playthrough ended at exactly 3 hours with auto text on. People actually reading at a fast speed could probably clock in closer to an hour on one playthrough. Thanks to multiple endings, including side routes, theres definitely a reason to dive back in at least once more. The addition of Steam Achievements makes the urge even stronger, at least if youre into that sort of thing. One aspect to note, though, is that the Luccretia path may strike some otome fans as fairly creepy, considering in this form Lilia (and everyone else) suggest she looks like a 12 year old child. Closing Comments:How to Take Off Your Mask provides a mostly sweet storytelling experience with its diverse, engaging cast. Its sappy, but this game is based on that sort of appeal. Along with the cute aspects, it also brings (fictionalized) social issues into the spotlight in order to make Lilias eventual triumph all the greater. It might be short, but How to Take Off Your Mask is a good little tale. Its just a shame they couldnt have offered it at a slightly lower cost, but with that said, interested parties can and should check out the free demo first. Once you play youll know whether this is the otome visual novel for you.", "date": "July 13, 2015", "grade": 4.0}