{"name": "Galactic Civilizations III", "ref": "https://hardcoregamer.com/?post_type=post&p=156904", "text": "Galactic Civilizations III is one of the latest entries into the now somewhat crowded 4X market. With series such as Civilization, Endless, Total War and Stardocks own Sins of a Solar Empire, newcomers need to be polished, deep and offer the player something (or a combination of things) they cant easily find elsewhere in order to cut through the clutter.Galactic Civilizations III is a turn-based random hexmap game, like Endless Legend and Civilization: Beyond Earth. GC3s map is the best looking of the three (though I am a fan of space porn), however only at a zoom too close to be useful in gameplay. Unfortunately throughout most of the game youll be looking at different colored circles, but it does give the option to zoom in on certain interesting locations to aid the player in imagining the societies that they are building and competing with. Speaking of the look of the game, the space battles are slick, but the top down view becomes rather boring and the cinematic view doesnt seem to know what to do with the camera. Though the battles look more dynamic than this games most similar competitor, Endless Space, they dont look as cinematic, dramatic or rich as ES or Sins of a Solar Empire. The ships sometimes seem confused over what to do next, especially at higher speeds leading to the occasional bunch of ships just flying around aimlessly until something clicks and the next round of combat begins.They have opted for no user control over the battles, which is fine for the most part, but would have been a better experience if the user could control one or two small things in combat to make it more engaging, say, optional manual target selection or a retreat button. Something that somewhat ruins the tension of watching the battles is that the damage of an attack seems to be calculated at the time the weapon is fired, rather than its time of impact. This means that theres no point in really watching to see if a missile hits or misses because you know whether the ship will be destroyed already. One last note regarding the graphics and universe immersion are the use of cinematics. Cinematics are important because they often give the player something of a Google Street View moment where they can really zoom in and connect to the civilization theyre building. Launching that first large ship or building that first massive space station are occasions, and theyre treated as such. This stands in contrast to most modern 4x games including the recent Civilization: Beyond Earth which was a disappointment given how well they worked to build the world in its predecessor, Alpha Centauri. Based around planets, starbases and fleets, the gameplay is mostly solid. Planets work kind of like cities in non-space 4x games, letting you build improvements to enhance their production, gold generation and so on. The ability to strategically place tile improvements on planets which give synergy bonuses based on whats next to them is a neat addition. Starbases allow players to exploit resources, expand fleet range and boost the output of nearby planets. They can range from simple mining outposts to huge orbital production and science facilities, giving the player a lot of options to the point where one cant do everything they could and would want to do and is forced to make meaningful choices. The maps are large and spread out giving the game a very space-like feel which I quite like. Because of this distance, getting fleets into position and deciding how far your constructors will have to travel to reach their destinations are important. Speaking of fleets, three weapon and defense types are featured and can all be upgraded substantially over time. Most ships specialize in one type of weapon and armor and a good mix of ships is both optimal in combat and more fun to watch. You can also design your own ships down to the model design which is great, however this system was somewhat confusing and inferior of the much more straightforward ship design system of Endless Space. I ended up using the default designs rather than my own creations which was a real disappointment.Regarding replayability, the different races offer some amount of variety. Much better than the flavorless groups of Beyond Earth, but lacking the truly different races of Endless Legend which really require their own playthroughs. The randomness of the maps are going to account for most of the variability between games, but given the sparsity of resources and colonizable planets, this can be rather substantial. One of the issues in any 4X game is the endgame. As an empire expands, many of the early games fun choices and necessary micromanagement turn into huge distracting chores. To deal with this problem, a 4X game needs one of two things: good helper-AI management (of cities, workers, explorers, etc.) or useful overall views of the empire that allow these small decisions to be made with the big picture in mind (see EU4 and the Total War series for the best examples of this). Galactic Civilizations III has neither of these two things aside from auto-exploration. It also has another twist which makes things even more difficult. The shipyard and planet production views (which you will usually end up in by clicking idle production button) has nothing but the name of the system its located in to let you know where on the galaxy map youre building. If you dont memorize all these names, and you wont, you might be working in a shipyard either one or twenty moves away from the fleet youre building or station youre trying to upgrade. I often found myself just hoping the right ships would somehow get built in the approximate locations of where I needed them to be. Another major flaw and constant distraction are the move paths, which seem to always say that your ship will fly twice as far in one turn as they actually do.One feature Galactic Civilizations III seems to exhibit is that content was clearly cut out in order to be inserted into DLC. The game constantly makes mention of political parties which are nowhere to be found in the menus, thus causing me to stop playing and start Googling. Im a relative newcomer to Galactic Civilizations, but they seem to have been an element in previous games that are conspicuously absent (other than the techs constantly mentioning it) here and widely expected to be added with a DLC pack. Its hard to have much positive to say about a game overall when the new version removes important features from the previous game, not to streamline, but simply to package up those features and sell them later (i.e. animal units in Total War: Rome II).I regarded Civ 5 as a piece of junk before the final expansion due to its lack of depth compared to its predecessor and Beyond Earth was and continues to be a major step down from Civ 5 and the biggest embarrassment to the franchise since Civ 3, dashing consumer trust for a company that could do no wrong just a few years before. Its easy to feel the difference between the best 4X game a company could make (Endless and Paradox) and the games which feel empty until all the features youve come to expect in the game are slowly sold to you (everything else, usually with a number at the end). Closing Comments:Galactic Civilizations III is better than Beyond Earth (especially at release), but in this ever improving genre you have to come up with your best shot at launch and, if you want to sell DLC, build on top of that in engaging ways. This genre is one of high replayability and hundred hour games so your product has to challenge last years fully DLCed 4x games in a substantive way to merit the kind of investment in time, intellectual energy and money that these games require. This genre is increasingly being dominated by smaller firms with a passion for the projects they work on and a deep involvement with their player base. Galactic Civilizations III is good (and I love the cutscenes which really build up the universe), its just not good enough to stand out in such a crowded market, particularly due to its endgame and micromanagement problems.", "date": "July 1, 2015", "grade": 3.5}