{"name": "Operation Abyss: New Tokyo Legacy", "ref": "https://hardcoregamer.com/?post_type=post&p=152061", "text": "Its interesting that Japanese dungeon-crawlers are a dime a dozen in the year 2015. At one point in time, the genre was comprised of just a few franchises (at least here in the West), and now it seems like the Vita and 3DS are practically overrun with them. Fortunately, its difficult to mess up a formula as tried-and-true as the DRPG, thus allowing for a number of unique and subsequently solid takes on the genre. Operation Abyss: New Tokyo Legacy is the latest installment in the niche sector of roleplaying games, and comes our way from the team of NIS America and developer Experience Inc. While Operation Abyss borrows much from those that came before it, it manages to eek out an identity of its own thanks to some interesting presentation choices and gameplay distinctions.Operation Abyss: New Tokyo Legacy tells the tale of a group of adolescents who have been recruited by a secret government agency thanks to their unique powers that are exclusive onto them. The year is 20XX, and creatures known as Variants have besieged the city of Tokyo. These monsters have incited sheer terror throughout the city, even rendering the police and military all but helpless. Enter the aforesaid teens, who form the team known as the Xth. Their duty? Face down monsters, known as Variants, where they are most concentrated  a labyrinth known as the Abyss.Because this is a DRPG, players might assume that there isnt a story to really sink their teeth into, but surprisingly Operation Abyss indeed has a story to tell. Its not particularly strong or comprising a well-developed cast of heroes and villains, but theres perhaps more of a narrative foundation here than the likes of Demon Gaze, Moe Chronicles or even Class of Heroes. Toward the latter half of the story, things start to pick up and the game seems to suddenly find its cadence, which is excellent. Its just too bad that the characterization never jumps off the screen, instead giving us eye-rolling tropes and archetypcal personalities. There are moments when it looks like the writing is on the up and up, but then some cliche comes along and undoes what the game worked hard to achieve up until that point.Speaking of writing woes, the beginning of the game especially suffers from text-overload. This jumbles the pacing as the first hour or so feels more like a visual novel and less like a dungeon-crawler. A balance in this area is never found as things progress; some talking segments drone on and on, while at other times its like they cut dialogue entirely and are just shipping players from dungeon to dungeon without much explanation. In fact, this sort of sums up the story experience in Abyss. Its a bit all over the place and doesnt really go anywhere even during its most exciting moments.The primary goal of New Tokyo Legacy though, is not its narrative. Instead, its the gameplay that has been given the most care and attention. Gameplay at large will feel familiar to those who have played Etrian Odyssey or Unchained Blades. Labyrinths are explored via a first-person perspective with a party of six at the ready and are littered with baddies just waiting to send players to an early Game Over screen. As such, combat is the real focus of New Tokyo Legacy, with turn-based battles that go down at a faster quip than something like Persona Q. There are an expected variety of ways to attack, so employing physical attacks, spells and skills are all key to victory. Theres more to consider than just that, though; Variants in Abyss are categorized as certain species with specific, defining elements, requiring players to take advantage of those in order to levy profound amounts of damage.Whats interesting then in the combat mechanics is that players cannot directly choose their targets of attack. In Operation Abyss, the game auto-attacks groups of enemies once commands are imput. So if someone wants to home-in on Baddie A, but Baddie A is part of a pack of like-enemies, the player will merely strike the pack at random, meaning they could indeed attack Baddie A, or B, or C, or D, or whatever other enemy is in said swarm. This eliminates some of the strategy that goes into the actual battles themselves. As a trade-off, it requires greater pre-combat preparation, so as to outfit a party that can adjust to any particular combat scenario. Unfortunately, we often times felt disempowered by this, and at times downright powerless, during fights. To not feel in direct management of ones party in an encounter is a quick way to strip a player of feeling responsible for their victories, and but also a sure-fire method of sending them into a rage when dying as its very easy to say well, had the game allowed me to attack who I wanted to, I would not have lost that battle. Theres another trade-off here, though. It would appear this decision was made so as to make combat more fast-paced and less of a marathon of tactics. In doing that, Abyss does indeed seem like one of the faster, if not the fastest games in its genre. This makes labyrinth exploration a bit more streamlined for sure. But of course, it comes at the cost of everything just discussed. This is most known in the lack of depth combat seems to have, then. Instead of making each fight, even the run-of-the-mill ones, feel challenging and important (a la Shin Megami Tensei), Abyss can frequently feel more like a game of Checkers instead of Chess.Another interesting design choice of New Tokyo Legacy comes in the form of how difficulty is handled. You see, the more players fight inside the Abyss, the more dangerous it becomes. This danger level is measured by an Encounter Gauge that fills up the more bad guys are trounced, making each successive fight in the labyrinth harder than the last. This becomes more fascinating when knowing the benefit of fighting deeper and deeper into dungeons: players receive more experience points and better drops the higher the Gauge climbs. Certainly, this opens play up to a fun dynamic, where aggressive exploration and fighting enhances loot and EXP, but also increases the likelihood of getting straight obliterated by a single, mega-powerful enemy. Just the same, this risk-reward system really does add something to the DRPG formula, making exploration a bit more intentional and carefully planned. Speaking of which, our time with Operation Abyss was far less infuriating than our time has been with other dungeon-crawlers. Sure, Abyss can be challenging at times, but on the whole, its one of the more accessible experiences in the genre, similar to Demon Gaze in that regard. New Tokyo also diversifies its experience through the use of objectives. Essentially, the Xth Squad are expected to complete missions throughout the game. A mission may include investigating their school/academy or an Abyss, eliminate specific Variants, collect particular items, or tackle some other special type of undertaking. This variation is nice, especially considering how just plowing through labyrinths for no provided reason can grow boring rather quickly.Even with these fresh concepts, though, Operation Abyss still feels like a been-there-done-that game. It iterates on a few basic systems one would expect from a DJRPG, but never does so in substantive ways. Instead, these modifications to the formula are just that  tweaks. Its obvious that this a game comfortable not reinventing the wheel, rather trying to polish it instead. At a time when the genre is starting to get crowded, a game has to stand out among the crowd. For DRPGs, this is usually in the way of mechanics. And unfortunate, New Tokyo Legacy fails to capture in that department seeing as what it does do integrate isnt especially groundbreaking.Abyss also suffers from a lack of dungeon and monster design. The same enemies are seen far too often, making the inherent grinding all the more well, grind-y. The environments are noticeably bland, seemingly ditching the colorful aesthetic of the characters, and painting everything in greys and browns. This is particularly jarring because of how vibrant the character designs are as well as the backdrops for the talking segments before combat.But, Tokyo Legacy does at least provide some options, so as to tailor to different gamers styles of play. This is most evident in its introduction of play modes. Here, there are two options to choose from before kicking off the adventure: Classic Mode and Basic Mode. When starting up the game for the first time, players will be prompted to choose which mode fits their playstyle best. In Classic Mode, folks can select the outfit pieces for their character portraits and take their time completely customizing their warriors. With fourteen style pieces that allow hairstyle, eyes, mouth and face to be customized, this mode is for those who want a more personalized experience. Basic Mode, on the other hand, lets folks jump right into the game with a pre-established party of six, where they dont have to mess with these facets whatsoever.Where New Tokyo Legacy really knocks it out of the park, though, is in its presentation. Without a doubt, this is the most aesthetically-impressive dungeon-crawling RPG out there. The entire color wheel has been utilized, with pinks, purples and blues being the focus. Although the game is 2D, with the implementation of such vibrant hues, its hard not to just stare at the game, enamored at how the graphics pop off the Vitas beautiful OLED screen. Its sprite-work is especially wonderful, complemented by character designs that dont fall into the category of hardened warriors, instead adorning glorified high-schoolers with stylish armor and effectively-designed weapons. This could have been a dark, gritty, borderline drab game, like so many in its genre  especially given the premise  but instead, its opted for a loud chromaticity. Even the interface is fantastic, making great use of screen real-estate. The soundtrack has proved to be infectious too, though it doesnt show a great deal of depth. Players will hear many of the same tracks over and over again, especially while delving labyrinths. It would have been nice for each dungeon/area to have its own theme, but alas it would seem the developers werent too concerned with that.Closing Comments:Operation Abyss: New Tokyo Legacy is a fine DRPG. It has all the facets one would expect from a game of its genre and manages to implement those features effectively. What it does not do a lot of, however, is think outside the box in big ways. This is a cookie-cutter dungeon-crawling experience, the likes of which weve already seen many times before. Of course, it makes for an extremely accessible game because of this, and is quite possibly one of the best entry-points for newbies. While its level of polish may indeed be phenomenal  thanks to the strongest presentation values perhaps ever seen in the genre  it still never finds a way to surpass its rivals from a mechanics standpoint. Had it been comprised of a combat system that empowered the player rather than strip them of certain tactical decisions, incorporated more monster and environment variety and had better overall pacing, it would have easily superseded Experiences previous Vita DRPG Demon Gaze.", "date": "June 6, 2015", "grade": 3.5}