{"name": "Adventures of Pip", "ref": "https://hardcoregamer.com/?post_type=post&p=152043", "text": "In an age when the industrys AAA offerings seem to have lost their way, gamers have turned to the smaller, often more ambitious, indie studios to feed their cravings for unique experiences. Titles like Shovel Knight and Hotline Miami have led the charge, but sometimes the world needs a smaller, more humble hero to inspire them. Adventures of Pip tells the tale of Pip, an unlikely hero determined to rescue Princess Adeline from the clutches of the devious Queen DeRezzia. As just a single pixel in a village full of individuals of various resolutions, hes hardly the most dynamic or detailed of the townsfolk. What he does have, however, is gumption, a trait that ultimately makes him the most capable pixel of them all.As a studio comprised of ex-Wayforward members, Tic Toc Games knows its way around a platfomer. That fundamental understanding is on display everywhere you look in Adventures of Pip, and it makes for an experience thats at once familiar yet distinctly unique. The levels are designed to teach players as they progress, letting them learn from their mistakes and overcome increasingly challenging obstacles on their own merit instead of being strung along by a plodding tutorial. It makes for a much more organic experience than many modern games allow, and by respecting the players competence, the game starts strong and only picks up steam from there.Pip may start as a solitary pixel, but he doesnt stay that way for long. In fact, the hero eventually gains the ability to transform into two higher resolution versions of himself, gaining versatile new abilities along the way. While pixel Pip is light and can glide to the ground after jumps, 8-bit Pip is more agile, his freshly formed arms and legs introducing running and wall-jumping to his arsenal of moves. Finally, 16-bit Pip is a heavy, rugged hero, sacrificing the mobility of his 8-bit form for the might of his sword. The adorable hero can evolve by defeating glowing enemies and absorbing their pixels, and can also devolve at will with the press of a button. That flexibility between forms makes it easy and exciting to experiment with each of Pips evolutions and explore every corner of the beautifully designed levels.Each stage is a sprawling series of well-crafted, wholesome platforming challenges, loaded with branching paths and secrets galore. Smiting enemies yields pixels, which can also be found in the assortment of chests subtly strewn about every level. You can spend those pixels on helpful items and upgrades from the merchant and blacksmith back in town, all designed to make the game a tad bit easier for any player struggling to overcome its hazards. Whether its a potion to restore your health or a more powerful sword, there are an assortment of useful options available to those players who deem them necessary. Theyre quite pricey, though, so its best not to rely on them too heavily.Tic Toc Games has produced some masterful pixel art for Adventures of Pip, embracing the games multi-resolution premise and building a world that subtly combines the styles of games old and new, creating beautiful, deceptively simple backdrops and character animations that exude personality. Its always great to see masters of their craft at work, and Tic Toc Games talent is evident not only in the world its constructed but in how well Pip controls in all three of his forms. Every movement is tight, calculated and fabulously responsive, making Adventures of Pip an absolute joy to play.The real fun of Adventures of Pip comes from switching between the heros three resolutions at full speed, using your momentum and each forms unique abilities to propel yourself through the treacherous obstacles and perplexing environmental puzzles of the games five worlds. It s those sequences, when the smallest hesitation or misjudgment can cost you your life, where Adventures of Pip shines brightest, and luckily Tic Toc Games knows exactly how special that formula is. As the adventure unfolds, those strings of wall jumping, sword swinging and enemy stomping become more and more frequent, each more satisfying to conquer than the last. The game becomes almost like a puzzle platformer in those instances, forcing the player to deduce the correct sequence and approach to continue their journey unscathed.Behind the platforming, treasure and transformations, however, lies a tale of overcoming adversity. Pip is looked down upon by almost everyone he meets throughout his journey to save Princess Adeline, scoffed at because of his simple four-sided visage, but his heroic feats prove that no matter what you look like or where you come from, theres a hero in all of us. Its an inspiring message that could easily have strayed into corny territory, but Tic Toc Games handles it masterfully with witty, well-tuned dialogue. The illustrious Jake Virt Kaufmann contributed his talents to Adventures of Pip as well, composing yet another superb soundtrack to match the spirit of the game and giving Pips journey a fantastic sense of grandeur.Adventures of Pip has a lot of great ideas, but some of them dont quite feel fully fleshed out. There are a number of intriguing mechanics at work in the games environments, but Tic Toc Games doesnt quite realize their full potential. Many times I would wrap my head around a new challenge, gleefully expecting the more complicated iteration deeper in the level, only to be left disappointed at the stages conclusion. The boss encounters, while challenging, were slightly underwhelming as well, though only because they followed such excellent level design. There are also some unfortunate technical issues with Adventures of Pip at launch; I encountered brief stutters every so often during my time with the Wii U version, which while hardly a death sentence, surely shouldnt occur. Thats an issue that will undoubtedly be fixed soon, but for now its an issue worth noting.Closing Comments:Adventures of Pip is a delightful little platformer full of charm, challenge and impeccable level design. While still a little rough around the edges, its mechanics are unquestionably solid, and its clearly been crafted with the love and talent of a team determined to realize their vision. The foundation is firmly set for a superior sequel, and I can only hope that Tic Toc Games can further refine their fantastic concept given the chance. Until then, though, Adventures of Pip is absolutely worth your time.", "date": "June 5, 2015", "grade": 4.0}