{"name": "Yakuza 6: The Song of Life", "ref": "https://hardcoregamer.com/?post_type=post&p=293073", "text": "Fun fact: there have been as many writers having reviewed a Yakuza entry on this site as there have been releases covered thus far and if youve been lucky enough to follow us for that long, youll know that Segas long-running action-adventure beat em up has left many of us with a good (or rather great) impression. Ironic that for all the talk about IPs becoming stale and fatigued upon doing the exact same thing over and over again (Assassins Creed), Yakuza has managed to keep a near-faultless streak going the more time rolls on by doing the exact same thing. But we know by now that its an absolute winning formula; outside of minor additions and tweaks to its quality-of-life flow, Sega have so often triumphed in finding the treasured middle-ground between new and old  seldom changing, seldom waning from that wonderfully-orchestrated mix of entertaining gameplay, intimate story-telling and an undeniably bonkers delivery.Yakuza 6: The Song of Life comes on the back of two quick showings for the series via Yakuza 0 and Yakuza Kiwami  a distant, stand-alone prequel and modern-day remake, respectively. But if there was any concern (or even just the most minute of second-guessing) as to how the first proper chronological follow-up would play out, rest assured. The game may be running on an entirely new engine and built from the ground up for what some would consider a console tentatively close to its final years, but theres no doubt in my mind that Yakuza 6 is not just the same brilliant experience weve come to expect from Sega, its also one of the most visually-impressive entries in the series to date.The transition to the new Dragon Engine allows Yakuza 6 to breathe even more life to the fictional spins on both the series-staple Kamurocho district, as well as new setting, the coastal town of Onomichi in Hiroshima. Its clear Sega have gone to even greater lengths this time round in the case of getting the most out of the PS4s hardware; even on a base system, the Dragon Engine easily rivals Konamis FOX Engine or Guerrillas Decima Engine when it comes to the overall fidelity and rendering of textures and lighting, both up close as well as at a distance. Character faces particularly are immaculately detailed, right down to the pores on their skin and the sweat on their foreheads. Add to this the multicolored neon-lit advertisements of the narrow Kamurocho streets or, by contrast, how elegantly ambient Onomichis back-alleys and narrow walkways are. Yakuza 6 easily grips you with its believability as a world lived in, let alone one you can freely explore at your leisure. These two primary locations may not be the biggest in scale or even grandest in spectacle, but Segas near-agonizing attention-to-detail in both the aesthetic as much the structural design (right down to the paving slabs) is but the start of Yakuza 6s delightful presentation. Cutscenes, by contrast, may still be delivered in the same static physicality as previous, but it takes nothing away from the voice acting which, again, delivers on point for a tale that, in classic Yakuza fashion, flings itself between the brooding grittiness of its crime-thriller core but isnt afraid of venturing out into more ridiculous set-pieces, be they tainted in pure slapstick comedy or not. As simple a set-up it might be, seeing main protagonist Kazuma Kiryu eyeing up [yet] another gang of thugs/criminals  added to this time by one/two/five/ten more foes, sometimes not even fully-dressed, whom you must defeat  seldom loses its delightful balancing of open palm-waving ridiculousness and overriding, wholesome enjoyment.Perhaps the biggest compliment that can be given to Yakuza 6 in terms of its plot is the fact that not for a second does the player feel inundated by the material on show. For a game that casually introduces as many new characters as it brings back old ones, Sega does a terrific job at giving each of its characters meaning and purpose in the grander scheme of things. Be they someone whos supportive or otherwise antagonistic towards Kiryu, for all the high-flying madness that ensues and all the terminology that is spun on the nature of the criminal underground, Yakuza 6s delivery is as much grounded and concise as it is genuinely intriguing to follow. Whats more impressive is the way this coherence and indeed variety, expands further into the array of side-quests and secondary missions, dubbed Side Stories, and while interactions with quest-affiliated characters does revert to the reliance on in-game animation, its in no way a detriment to the care put in each one of these scenarios. Whether its the deadpan nature of Kiryu and his scowling, arched brow interacting with an Alexa-like AI, something stupidly goofy as dressing up as a town mascot or even somewhat heartfelt as helping a girl (who may, or may not, have leapt through time) trying to make amends with her father, the journey there is paved with a consistent stream of great writing and characters that are surprisingly fleshed out. Couple this with the fact these side missions are there to be discovered and tumbled upon as you naturally explore the districts and its another sign of how perfectly Yakuza nails a more organic approach to open-world game design  filling its environments with content to indulge in, yet not thrust on the player as a result.There is of course the additional layer of quests which take a more checklist-esque mentality in having you simply finding a set item or two, but much like how the game sets this up via a mobile app dubbed Troublr, Yakuza 6 tends to recognize that these optional challenges (which pop up at random and are usually time-restricted) are there to be checked during your more casual moments  there if need-be, avoiding the need to fill up the map with needless icons. Dont worry, there are plenty of those from the word go in the form of restaurants to eat in, stores to shop at andas you might have guessedmini-games to play. The latter of which retaining that familiarly alluring desire to waste hours upon hours on games that, shockingly, could get away with being entirely stand-alone and separate titles themselves. Beyond the Sega Arcades that house the likes of Puyo Puyo and Virtua Fighter alike, beyond the Karaoke bars that can get aggressively tense as you try and perfect each and every button prompt. Beyond even the returning Hostess clubs that play like fully-built strategy card games, Yakuza 6 takes even this aspect, another level. Moderating the playing season of a baseball team that at points has the micro-management intricacies of a sports sim, or most impressively of all, the new Clan Creator mode which has you expand your clan by taking on rival gangs in overhead, real-time SRPGs of sorts. Without boring you with all the details, its easy to not only get distracted, but find yourself completely lost (overwhelmed perhaps) in the intricacies and multi-layered mechanics on show. All of it entirely optional of course and (outside of rewarding you small doses of XP points) bearing no influence on the main story, but richly entertaining nonetheless.Finally, we arrive at the core gameplay, possibly Yakuza 6s least-changed system but one that, like everything else, carries over with as much the same immense satisfaction to control, as it is to eventually master and conquer. Particularly during the boss encounters that often demand a near-faultless combination of combo-building, Heat Actions and evasion skills. While little has changed mechanically in regards to its attack-and-block tactics  making sure not to get surrounded by foes, deciding when to bait characters so as to land a perfect combo or counter, making use of the environment in that charismatically, over-the-top fashion  its a winning formula that bears even greater fruit with its fluidity and raw antics. Brute attacks are flashy yet visceral, regardless of whether theyre of the regular perspective or go in for a close-up during one of many quick-time events. Yakuza 6, much like DOOM, takes immense pride in its spectacles and doesnt shy away from the hyper-violent nature it carries forth. If anything, it both celebrates and embraces it. Accompanying this is of course the RPG elements of the series and the manner at which players level up Kiryu over the course of the game. In this case, players accumulate experience points across five different tabs, with different activities netting differing amounts. There are two means to building yourself up: either through the standard screen which dictates the level of HP or strength for example, or through one of the dedicated skill screens that with enough points allow you to learn combat skills, additional Heat Actions or even social skills that can aid you outside of fighting. Not only does this provide an interesting dilemma on whether to save up for additional skills or prioritize your standard level, Yakuza 6 manages to avoid the perils of becoming a mere grind-fest purely in the amount of activities that will net you XP, no matter how small. Anything and everything  from eating to playing mini-games to even reaching seemingly-meager milestones  rewards you for investing in what the game has to offer. Add to this the temporary buffs/perks players can acquire from vending machines, Yakuza 6 offers plenty of opportunity for players to ready themselves while at the same time making sure to be flexible in allowing them to enhance whatever stats they deem fit.For all the lavish distractions and off-beat moments present in both its world-building and plot, Yakuza 6  much like its brethren  doesnt wait for its players to catch up with such a demanding flux of strategy and tactics required at almost every turn. While it might be easy to get caught off-guard by a sudden emergence of a boss-like encounter or battle housing one big-bad and maybe half a dozen littler-bads to deal with, after the first few or so set-pieces, players will easily catch onto the natural flow and usual repertoire of cutscenes followed by another round of combo-building combat. Yakuza 6 can be unforgiving, but only when the player loses sight of the need to incentivize smart-thinking as opposed to just pressing buttons and hoping for the best and its rare to find a series such as Yakuza that perfectly gets that balance of player wit and game smarts.It wouldve been easy to conclude this with an unmistakably glowing report, but for the sake of blunt honesty, Yakuza 6 comes so close, yet so agonizingly lets the odd unflattering moment seep into the foreground. While its easy to shrug off the occasional blurred texture or pop-in during in-game cutscenes, the same cant be said for the pre-programmed intelligence to the AI. Particularly the NPCs and civilians that do their best to breathe life into the surroundings, but more often than not come across as nothing more than the cold and emotionless calculation of 1s and 0s that they really are. Case in point: the fact NPCs will often make comical U-turns in the street or even walk into view  again during cutscenes  only to suddenly dematerialize right before you, does unfortunately veer into immersion-breaking. Especially during the less-comedic moments; an interaction between Kiryu and another character interrupted by expressionless civilians merely wandering into shot. Closing Comments:Aside from the most nitpicking of complaints, Yakuza 6 is but another declaration to the well-documented notion that Segas decade-long series remains one of the finest, most consistent outings in the medium. Both lovingly old and welcomingly new alike, while it would be criminal to reveal any plot spoilers, it wouldnt be surprising in the slightest if this were the chapter with which Sega closes the coveted Yakuza series. Yakuza 6 isnt just one of the best entries in the series to date, its also one of the most fulfilling experiences youll find in 2018. A game bursting with content and character alike, it takes its rightful place alongside some of the best releases of the year not just on substance or style, but on its ability to balance all its attributes yet pace it in a way thats both manageable and inviting. Entertaining, engaging, emotional and enthralling, though it pains me to deny it the mark of perfection, make no mistake about it, Yakuza 6: The Song of Life is an unparalleled masterclass in full flow. Fellow AAA/open-world outings, take note.", "date": "March 15, 2018", "grade": 4.5}