{"name": "Sakura Fantasy Chapter 1", "ref": "https://hardcoregamer.com/?post_type=post&p=151804", "text": "Once upon a time a visual novel named Sakura Spirit hit Steam. Featuring hefty amounts of fanservice and little else, many gamers snapped it up immediately. The success has been so much that developer Winged Cloud quickly went to work on newer games in the Sakura series. First came Sakura Angels and now we have Sakura Fantasy Chapter 1. One thread has remained the same between each release  theyre filled with incredibly shiny anime women wearing little clothing. Despite being in the same series, however, each title is effectively brand new and offers a different cast and storyline. As such, you can jump right into Sakura Fantasy Chapter 1 without fear of missing something.Sakura Fantasy Chapter 1 immediately throws players into a world where castles and knights are commonplace. Not only that, but theres a degree of magic thrown into the mix. Also common for knights-in-training is that each comes with their own special skill. Everyone has their own skill and must learn to hone it just as they would any other battle skills. In the case of our protagonist, Raelin, shes got the ability to farsee. With this she can see through the eyes of other people whenever she darn well pleases, which leads to a heck of a lot of spying on her fellow knights at private times. Oh, what am I saying? She basically manages to get into situations where girls are severely underdressed with and without farseeing. But hey, thats what these Sakura games are known and loved for.In any case, the story picks up once Raelin meets with a mysterious woman in the castle who foretells of a star falling from the sky. Lo and behold, this prediction comes true. From there she and her friends must venture out on a journey which is fraught with danger, friendship and hefty amounts of fanservice. As far as stories are concerned, this is the best Winged Cloud have produced yet. Thats not necessarily high praise considering the relatively low bar that was set by previous Sakura titles. At times the concepts feel ganked from Attack on Titan as there are towering beasts which only have a weak point at the base of their skull and citizens live within a wall-enclosed city, but the story goes other places too.Most interestingly, this is the first release in the series which features a female protagonist. As such, since it still deals so heavily in romantic comedy this is basically a yuri (or lesbian-focused) game. That doesnt mean it is prime fodder for actual members of the LGBT to celebrate, however. Unlike previous releases which would focus purely on the women of the protagonists eye, now the protagonist herself is thrown into the action on occasion. At times this is awesome, as we see her in battle, but at other times seems most intent on pleasing that existing audience of dudes. Considering they were already the target audience, its not a particularly brave step.As competent as the storyline may be, and as attractive as many will find the artwork, Sakura Fantasy Chapter 1 is extremely short for a visual novel. My playtime clocked in at exactly 61 minutes meaning that those with faster reading abilities might even take less than an hour. There are different events which can occur, but the resulting cliffhanger is the same regardless. How do you see different scenes? They require multiple playthroughs (or simply saving before each choice) to fill out all CGs. The biggest positive outside of story for this Sakura release is that there are also tons of choices to make. This is a big step up from previous titles, although truth be told it doesnt yet appear that they matter all that much. In many circumstances, it even feels like the game will play both choices out regardless of what you choose. When attempting to not select the most perverted of options, at times theyd still pop up anyway after a brief bit of dialog for my choice. Of course, no matter which way you try to play, Sakura Fantasy Chapter 1 still swings heavily toward providing sexual artwork in every possible instance. Fans are prepared for this, though, so its hardly a surprise. What was a bit of a shock is that it feels this release contains the most risque art yet. Some CGs feature completely nude women just barely covering their bodies. Others seem prime material for uncensoring (which Winged Cloud is apparently working on at the moment). If thats what youre into, then this release provides it in spades.Even so, fans may finally start feeling annoyed by Winged Cloud. So far it seems theyve been able to handle frequent releases and future game announcements, but this is the first time theyve gone episodic with a release. Each previous release is $9.99 and generally offers at minimum two hours of gameplay. But here we have Sakura Fantasy Chapter 1 with its one hour long story (depending on your reading speed) which also includes that same $9.99 asking price. That doesnt sound particularly fair to fans who have supported these titles thus far. Considering theres no specific statement how many chapters the series will even be, it could become a fairly expensive prospect to see it through to conclusion.Closing Comments: The developers of the Sakura series are finally creating games which provide both ample amounts of fanservice and an interesting, worthwhile storyline to go along with it. So far their artstyle and lewd CGs continue to hold up the same standard that fans have come to expect. The release of Sakura Fantasy Chapter 1 feels a bit exploitative, however, in that it costs the same amount as previous titles while offering much less from a length standpoint. If Chapter 2 fails to increase the length, or feels like it pads the story further to necessitate even more chapters, it may be time to step off this busty bandwagon.", "date": "June 3, 2015", "grade": 2.5}