{"name": "(I Fell in Love With) The Majesty of Colors Remastered", "ref": "https://hardcoregamer.com/?post_type=post&p=293164", "text": "Even though the gaming industry continues to bring forward  and rightfully embrace  bold and imaginative ideas from developers, there is always one standout title that will take the extraordinary and attempt to firmly establish it into reality. (I Fell in Love With) The Majesty of Colors Remastered is an atypical experience for any person. For those that enjoy venturing into unknown territory, The Majesty of Colors does everything in its power to do exactly that and, in the process, have them pleasantly mystified by their experience with the title. Thats neither a negative nor a positive, but rather what The Majesty of Colors can do to people. The brainchild of Gregory Avery-Weir, The Majesty of Colors initially debuted as an online Adobe Flash-powered title a decade ago. Fast forward ten years later and The Majesty of Colors has withstood the test of time. Its artistically moving as it is charming and engaging. Its as simple as it is complex with its underlining themes and social commentary. But what is simple is that The Majesty of Colors is a one-of-a-kind experience.The Majesty of Colors wastes little time to introduce players to its world and story. The player takes control of a sea creatures tentacle, as it begins to interact and question the meaning of color and the inhabitants above the surface. Gameplay, unsurprisingly, is straightforward: the player drags the creatures tentacle to interact with the environment, different animals, objects and humans. As its core mechanic, The Majesty of Colors clean interface allows the tentacle to easily reach anything without any obstruction in its way. The tentacle also has a cartoonish feel about it, with it possessing the capability of tossing something off the screen with the same speed and power as, say, Team Rocket blasting off in the Pokmon anime series.The story is told purely through text-based form, with all of the creatures thoughts and decisions presented on the screen. As almost everything runs in real time, aside from when the title is paused, there are occasions where the player might overlook or completely miss what has been said in relation to their previous actions. Considering the effort put towards the remastered version, there was a missed opportunity to introduce voice-over work to drive The Majesty of Colors narration forward. Maybe it didnt happen because it wasnt in the original title, but it could only have benefited and eased the text-heavy story for the player. From the opening moments of The Majesty of Colors, however, it sets the tone for players to understand that their choices will directly impact and alter the course of the story. Its branching choice-and-consequence system has the same influence as episodic titles on the market, from Life Is Strange to Tales from the Borderlands. Theres no right or wrong when it comes to making a choice. By the end of the story, though, the player will recognize whether their creature is considered a savior lying deep in the waters or the hellish beast making Davy Jones Locker a reality. Despite featuring five different endings, The Majesty of Colors is built around its short playthroughs. Each playthrough can last either a couple of minutes or maybe ten to fifteen at maximum. Its endings arent as varied as they could be, with all of them unlockable within an hour. For its $2.99 asking price on the App Store, it might be a tough pill to swallow for someone to shed out the money for a relatively short experience. The Majesty of Colors is all about quality over quantity, though. Its a truly eye-opening experience, dabbling into ideas and themes seen across all forms of mediums. The Majesty of Colors is a not a simple showcase for its visuals or art direction. Its not sold on the pretense of being a fully-fledged triple-A title or an indie title with multiple developers working on it. No, it is a well-designed, well-thought-out title that executes on a riveting concept and questions the moral decisions the player would make as a creature that comes into contact with the world above the sea.Future Proof Games is responsible for bringing Avery-Weirs The Majesty of Colors to life in its remastered form. Its not a port like many developers are capable of doing with titles for todays mobile market, mainly for how The Majesty of Colors needed to be modernized for its re-release. The Majesty of Colors, for the most part, has been remade with Unity and benefits from an improved interface and new visual effects and sound. The natural sounds make the experience feel authentic, which does not distract the player at any point in the story. Future Proof showed no hesitation in how it could improve The Majesty of Colors visuals, but it retains its unique art direction and builds on it. The Majesty of Colors blocky pixel art remains as sharp as ever, capturing a classic, retro look in the process and effectively elevates the horror elements throughout the experience. Closing Comments:The Majesty of Colors might easily have flown under most peoples radars when it was first released in 2008. Its a tough sell for any consumer, especially when it falls between the lines of brilliance and pretentious. The Majesty of Colors Remastered, however, has only reaffirmed that Avery-Weirs concept was one that was criminally underrated a decade ago. The Majesty of Colors hardest appeal is its longevity, but its not enough to deter a newcomer from putting some of their time in with the title. Sure, The Majesty of Colors could have done with some additional content, whether it was new endings or a mode to even behind-the-scenes footage or an interview with the creator. Despite the lack of new content, The Majesty of Colors Remastered puts its browser-based days behind it, excels with its minor and noticeable improvements and does nothing more than make its narrative poignant and memorable for the player.", "date": "March 14, 2018", "grade": 4.0}