{"name": "3D Thunder Blade", "ref": "https://hardcoregamer.com/?post_type=post&p=150146", "text": "Its good that Sega already has the next wave of 3D Classics lined up for the summer, as going out on 3D Thunder Blade is less than ideal. Its not that this last entry in this second series of nostalgic gems is particularly bad, but it does, however, take the title from Fantasy Zone as the weakest link in the entire 3D Classics lineup.Thunder Blade will immediately be off-putting if players have been playing the more recent 16-bit darlings from Sega, as it lacks the vibrancy of Out Run, the charm of Fantasy Zone II W, and the graphical prowess of After Burner II. Of course, this is a top-down shooter, so there genre and design are inherently limiting to a degree. Still, its jarring to go from such loud, neon games like the aforementioned, to one that looks as washed out as Thunder Blade. That being said, this rendition, when compared to its original late-80s release, is the best looking version of itself. The stereoscopic 3D is superb, as one would expect from M2, who have really honed their craft by this point, and the game runs at a silky smooth 60FPS. It comes packed with a widescreen mode, and even a simulated arcade cabinet view, the latter of which is designed to elicit warm feelings from anyone who played this in its original, arcade glory. Needless to say, the presentation, aside from the core aesthetic, is just as good as any of the previous 3D Classics titles.While its visuals are a bit of a mixed bag, its story is far easier to quantify: bland, boring, and all-around uninteresting can sum it up quite nicely. Of course, if folks are looking to play Thunder Blade for a compelling narrative, then they clearly dont know what theyre doing. In life. Thankfully, the game picks up the slack in its gameplay department. As an arade game, the gameplay is what was given the most attention, and its obvious thanks to a challenging difficulty, slick controls and enough explosions to make Michael Bay blush. Its not as straightforward as one would expect from a top-down shooter, though.Thunder Blade mixes up its formula by offering four stages that are divided into three sections  a vertically-scrolling shooter in the vein of Under Defeat, a more daring behind-the-copter action approach reminiscent of After Burner and then boss battles. Each of these three parts surprisingly blend together effectively, mostly because of how well the in-game camera transitions and adjusts to each section. Because theres so many perspective shifts, it could have been easy for Thunder Blade to be a mess of a game; but its competent camera manages to keep pace, seamlessly evolving into each viewpoint. As one can imagine, levels are never boring thanks to the diversity of play. In fact, it adds to the frenetic nature of the game, as well as serves to make Thunder Blade stand out from the crowd. This could have been just another shmup, but instead its unique partly because of how it handles the merging of these three very different gameplay styles.The one area that 3D Thunder Blade trumps some of its predecessors is in the domain of control. While After Burner II was kind of a hot mess to physically manipulate at times, we found ourselves shooting and dodging here without a hiccup. Of course, like After Burner, there are a few control schemes, which is nice in that if one doesnt feel right, theres a few more to try out. Alas, like those that came before it, movement doesnt feel as precise as one would like it to. This can be frustrating in high-stress moments where the slightest mismanagement of the control stick can send players careening into a barrage of bullets and subsequently to their death.One should get used to death, however, in Thunder Blade because it is a hard game. At this point, one should just assume all of these 3D Classics are going to test their mettle. Thankfully,M2 has added difficulty options, so dropping things down to the lowest level allows for a far less maddening experience, and is probably the best way to play up front and/or if throwing your 3DS against the wall is a tendency you have observed within yourself.But, this degree of challenge is offset by a super short runtime. Literally, 3D Thunder Blade can be completed in less than 15 minutes. Our best time was around 13-ish, but wed imagine for the experts out there, this is a ten minute game. There are no branching paths or anything like that, so this linear experience is over quite quickly. Again, M2 recognized the problem in this and added a patented Special Mode that is unlocked only after clearing Arcade Mode once. Special Mode includes one extra behind-the-vehicle part as well as a boss encounter at the end of the fourth stage for an additional few minutes. In this mode, there are other small changes such as enemy placement and scoring modifications, but its basically the same game  so dont expect Fantasy Zone IIs Link Loop Land.Closing Comments:Those nostalgic for an old-school shmup with a few twists that have $5.99 just collecting dust could do worse than 3D Thunder Blade. Its fun, its mindless, and if you really hate it, its over in about ten minutes. In fact, thats the games biggest problem; there just isnt a whole lot here. M2 has added in an extra mode, but thats about it. Unless youre a score-hunter, it could be difficult to get the most bang for your buck. In the end, its the weakest of the 3D Classics line, but at this point, a bad 3D Classics entry is the equivalent of a pretty decent game otherwise.", "date": "May 23, 2015", "grade": 3.0}