{"name": "Not A Hero", "ref": "https://hardcoregamer.com/?post_type=post&p=148980", "text": "What does it take to get elected? According to BunnyLord, it requires marrying the blatant pandering to whatever it is he thinks the electorate wants today to a murderous rampage through the citys underworld. As for the daily post-mission milkshake and debriefing at the local diner with a stunned and bloodied operative, thats a bonus for a job well done.Not A Hero is a combo-based run & gun action shooter with a cover mechanic, and also fantastically insane. You pick a minion of mayoral candidate Bunnylord, a purple bunny-man in a snappy suit, and murder your way through the citys underworld. Warehouses, office buildings, tenements, and any other run-down urban structure becomes a playground for gun violence, as you tear through the slightly isometric side-view levels leaving the corpses of unlucky goons in your wake. Theres a trick to it, of course.At the start BunnyLord only has the one minion to choose from, Steve. Steve is a basic character with a balanced set of basic abilities. He runs at a fair pace, his pistol has a decent amount of ammo and reloads relatively quickly, the slide move travels for an average distance, and any enemy tripped up by the slide is easily dispatched with a quick execution using minimal ammo. There are better minions to be earned, though, and each one plays differently enough that its easy to come up with a set of favorites as you tailor your play style around them.Samantha is an early favorite, for example. Shes fast and, unlike most characters, can run and reload at the same time, and her execution move is quick. Jesus is a fun character whos always got a hip-thrust going on, and he can also shoot and slide at the same time. Mike is where things start getting properly deadly, though, because while hes only got two shots in his sawed-off shotgun before needing a reload, it packs enough of a punch that a single blast can take down the big enemies. Hes also got a knife for his execution move, which has the advantages of being silent and using no ammo. This means with a bit of practice he can slide, trip up enemies, and stab them in a single quick motion, and the other enemies on the floor will remain blissfully unaware of your killing rampage unless they actually see it happen. Clive, on the other hand, wields twin pistols, and while he cant pick up grenades or other limited-use items he can shoot in two directions at once and is incredibly accurate as well. Jesus gun may have a roomy clip but it works off the spray & pray principle, and theres something to be said for all bullets in a barrage heading towards their target.My favorite of the bunch, though, is Ronald Justice, a deranged super-hero wielding a hammer and pistol. He plays like a cross between The Tick and The Crimson Bolt (from James Gunns Super), filled with bombastic proclamations and vicious blows of justice. Like Clive, he lacks the ability to use grenades, but makes up for it with a hammer-blow thats an insta-kill on anything it hits. While he can only stock three hammer-kills at once each execution adds one back making him a character with a very fun gameplay cycle. His abilities make Ronald a fast character who rarely uses cover, instead sliding into enemies and doing a quick execution move before sliding into the next, saving the hammer blows for tougher opponents. Its incredibly effective against the samurai, who jump out of the way of a slide, and ninjas, who will single-hit kill you if you try to trip them up. The gun still comes in handy for crowd control, of course, when the density of enemy gunfire means poking out from the background for more than a second to squeeze off a shot turns Ronald into a bloody bullet-sponge, but when the crowd is thinned out a bit he can go right back to slide-hammer-splat cycle. It also helps make him (and a few other characters with speed and melee attacks) incredibly effective for some of the trickier level goals. Each level of Not A Hero comes with three goals in addition to its primary objective, ranging from save all the hostages, to collect the hidden items, get to the reporters before time runs out, beat the level using under 100 bullets, etc. Different characters are better suited to different objectives, but in order to fully clear the level youll need to get all three in a single run. Getting two goals in one run and the third in another isnt going to cut it. On the plus side, the harder objectives really make you learn how to play Not A Hero right.Theres no way to avoid that Not A Hero can be a very difficult game, but once you dial in to its movements everything starts fitting together perfectly. Once you see how the move-set fits together youll be effortlessly stringing one kill into another, charting the best course through the level and practicing the perfect line. Its very similar to OlliOlli except youre shooting, bludgeoning, and exploding goons rather than riding a skateboard. It takes a bit to get used to how the slide and cover button are one and the same, and that when used right its actually an advantage to have them tied together, but thats what the practice that comes from dying and re-dying is for. The time pressure of the earliest level to have the clock as a secondary objective is incredibly frustrating at first, but learning how to work within its constraints also teaches you how to play the game, reinforcing its flow and turning whichever character youve decided to play as this time into a highly efficient mass murderer. Closing Comments:I have to admit that I wasnt easily sold on Not A Hero. It was difficult to figure out how it wanted me to play at first, and even the easiest levels saw a lot of dead BunnyLord minions due to arguing with the combination dash/cover button and forgetting to keep an eye on my ammo count. Then I learned to play it right and then it all made sense, with each level becoming a test of both action and course execution. Running a perfect level is incredibly fun, and if it takes a bit of practice and endless reloading (especially on the last set of levels) then that just makes success feel better. The post-level debriefing (with celebratory milkshake) ends the day, and the next days briefing promises a new mission as weird, funny and violent as the previous one. Its always a good day to be BunnyLord, and if he and his crew can kill their way through to an election day victory, then the party doesnt ever have to stop.", "date": "May 16, 2015", "grade": 4.0}