{"name": "Burnout Paradise Remastered", "ref": "https://hardcoregamer.com/?post_type=post&p=293140", "text": "If there was one arcade racing franchise that defined the early 2000s, theres an argument to be made for it being Criterion Games Burnout series. For a decade, Criterion released over a half-dozen main entries and spin-offs that focused on high-octane speed and over-the-top crashes, with an attention to detail and an equally fast-paced soundtrack to match. While referencing the best entry in the franchise, many fans point to either Burnout 3 or Burnout Paradise, depending on ones preference for the more straightforward nature of the first two Burnout titles or the ambitious nature of integrating Burnouts crash-focused gameplay into an open-world design. Regardless of which you prefer, Burnout Paradise was well-revered at the time of its release, enough so that EA announced a remastered version last month with an updated presentation and all of the available DLC included within. With no Burnout titles to speak of over the last seven years, Paradise remains the send-off for the main series, leaving this remaster as a new chance for fans to remember their fondness for the series or introduce new players to the chaotic arcade racer. Despite a mixed presentation and a lack of variety in the single and multiplayer modes, the open world of Paradise City remains a blast to race through thanks to the plethora of drivable cars and hidden shortcuts.Burnout Paradise takes place within Paradise City, a respectably-sized open world that ends up being the star of the title. While the environment never presents anything too unexpected, the city is jam-packed with billboards to destroy, shortcuts to discover and ramps to leap off of, all of which are constantly tracked and a joy to complete. The city itself also serves as the main hub for the huge quantity of races, with every individual lane being a drag race and every intersection an opportunity for one of five different race types: Race, Burning Routes, Marked Man, Road Rage and Stunt Runs. While each race mode offers different appealing aspects to each player, the core experience for the first three feel eerily similar to one another, as drivers attempt to get from A to B as quickly as possible with minor caveats. Unfortunately, the AI in these modes often feels lackluster, with city navigation and the high sense of speed being the only true dangers to prevent the player from completing events. What these events lack in variety they make up for in quantity, as the included DLC area expands the number of available races and objectives to dozens of hours worth of entertainment that are often best experienced in short bursts. Speaking of high speed, the inevitable crashes and wrecks that occur as a result of these populated streets and narrow turns still remain impressive over a decade later, with each of the dozens of cars and motorcycles featuring an incredible attention to detail, even as they dent and bend as they collide with other vehicles or buildings. Few of these vehicles feel drastically different from one another, especially due to the floaty nature of the driving, but theres plenty of options to fit various playstyles and race types, and unlocking new vehicles by wrecking them out in the wild is as appropriate and enjoyable as it sounds. The single player campaign ends up featuring the majority of the draws while playing Burnout Paradise, as the multiplayer only offers two modes: Freeburn Online, where up to eight players can complete five hundred short but unique individual and co-op challenges, and Race, which includes both casual and Ranked varieties. The manner in which players can switch seamlessly between the offline and online modes is impressive, however, and exploring Paradise City with a group of friends remains as chaotic and thrilling as ever.As with most remasters, the greatest point of curiosity lies in the upgraded presentation and the results for Burnout Paradise Remastered are mixed. On the positive side, the game runs very smoothly on Xbox One X, running at 4K and 60 FPS in both the singleplayer and multiplayer modes, with neither having any major instances of glitches or lag during our time with the title. The soundtrack remains a strong standout as well, with the original games lineup of modern rock and classic tracks from earlier entries in the series still populating the in-game radio and setting the mood for high adrenaline racing. While the game doesnt look particularly ugly, the textures for both the environment and the vehicles seem uninspired, with little improvement when compared directly to their 2008 predecessors. The updates that Criterion has included with Burnout Paradise Remastered make the game serviceable for the current age of gaming, but those hoping for a drastic improvement to the graphics will likely be disappointed. Closing Comments:Burnout Paradise Remastered still offers one of the best playgrounds to speed and smash through over a decade later, fueled by a smooth presentation, abundance of cars and an engaging soundtrack. The same issues that plagued this racing title in the past generation still remain, including lackluster AI and mission variety, and the slight improvement to the graphics leave much to be desired. For those eager to return to Paradise City or those looking to take their first trip, however, the sheer quantity of races and objectives to complete offers dozens of hours worth of blood-pumping excitement that few other racing titles can compete with.", "date": "on March 13, 2018", "grade": 4.0}