{"name": "I Am Bread", "ref": "https://hardcoregamer.com/?post_type=post&p=144142", "text": "During the last few years, a special classification of games arose called YouTube bait. Arguably pioneered by the stellar Amnesia: The Dark Descent, these games are usually indie oddities built to appeal to the spastic world of Lets Players, bringing out goofy reactions despite their low budgets or simple gameplay. Theyre usually nothing substantial, but Bossa Studios Surgeon Simulator was able to join the likes of Slender: The Eight Pages and Five Nights at Freddys to become a flawed, yet goofy game to stream or record. Their newest game, I Am Bread, has been in Early Access for a while, but finally got a full release. Is it an indie gem or just another bit of YouTube bait for the Lets Play pond?I Am Bread follows a man who believes that the bread he keeps around his house is sentient. Deemed mentally unstable, the man is sent to the Therapy Barn on a routine basis. You dont play as this man, but instead, the bread that is terrorizing his psyche. Its your goal to wander around various locations, find a source of heat to toast yourself and finish each stage. Its as insane as it sounds, following in Bossa tradition. Your bread, however, is controlled in an unorthodox way. Each corner of the slice is controlled with a specific button (or key). Holding down the button when against a surface locks the corner in place. With careful rhythm of locking and releasing, you can walk around the house. After you find a source of heat, you must toast both sides of yourself to finish the stage, but if you hang out around dirty floors or other areas where you can be contaminated, your Edibility will decrease. When it hits 0%, its game over and back to start.Its as cumbersome as it sounds. I Am Bread is intentionally designed to be a frustrating spin on QWOP, following in the hilariously awkward controls of Surgeon Simulator. You can get some laughs out of squirming and shaking throughout each level, but its when other gameplay elements enter that things get rough. Theres a grip meter, which decreases the more you hang on with the grip buttons, very much like (and I cant believe Im comparing this game to it) Shadow of the Colossus. Hang on too long and you drop like a rock, which can make escalating walls or surfaces a painful balance of stop-and-go, or worse, 52-pickup. Theres nothing more frustrating than making an enormous trek up a wall or across a level, then having your grip meter run out and you falling to the floor for a game over. Controlling your bread slice is awkward, even after a ton of practice, and while thats funny novelty at first, eventually it gets on your nerves. The camera is a constant nightmare, especially when levels drop you inside a container right from the start, giving you almost no good angle to see where youre going. Squeezing against a wall or object is routine in I Am Bread, and let me tell you, its a chore to contend with at best. It doesnt help that the levels in I Am Bread require a lot out of you. At first, finding sources of heat is easy. A toaster, space heater, or lamp is easy, but later stages require a ton of setup to provide an open flame, like dropping matches on flammable objects. These levels are also enormous, much bigger than they should be. Between massive treks across levels, demanding coordination of puzzles, clumsy controls, and an expendable grip meter, I Am Bread is sheer frustration. And a single drop onto the floor usually means its back to square one. Its tedious and perpetually inconvenient for the player. Having a player constantly restart their session because of one failed mistake is one thing, but when so many factors are built to make the already frustrating controls worse, I Am Breads goofiness just cant hide the amount of player-hostile factors at work here.I Am Bread started in Early Access, so its had its share of bugs, glitches, and inconsistencies since launch. Sadly, there are still technical issues in the full release, far more than there should be. The frame rate can take unnecessary chugs in some of the oddest, most inactive places, and the bugs? Theyre bad. Often times, my bread would get stuck in objects, preventing me from moving. Sometimes my bread would distort and spaz out for no reason whatsoever. I even got some crashes throughout my playthrough during loading screens, forcing me to exit from my Task Manager. I Am Bread was not ready for full release, as its technical issues clearly show. Bossa also added some extraneous modes as well. You can play as a baguette to destroy objects in Rampage Mode (which is admittedly a good stress reliever), find cheese in Cheese Hunt (which is an awkward scavenger hunt for random cheese wedges), Free Roam any level you already completed (dull, overall), race as a Bagel (with suffers from awkward physics and still has plenty of falling off and reclimbing surfaces), and Zero-G Mode (where you play certain levels without gravity, which is as frustrating as it sounds). None of these extra modes fix the fundamental issues with I Am Bread: its cumbersome controls and unaccommodating level design. Frustration can lead to a laugh for a while, but eventually, reality sets in and the novelty disappears. I Am Breads novelty wears off astonishingly quickly, leaving nothing but headaches behind.As previously stated, I Am Breads technical issues are bad, ruining a presentation that would otherwise be perfectly passable. The animations are simple and charming, while the music has minimalist piano jams and some cool, almost coffee shop kind of tracks. Its all slimmed down and easy on eyes and earsuntil the technical problems arise, which bring terrible frame rate issues and a bad camera. I Am Bread has a simple aesthetic, but even its simplicity is harmed by its technical infidelity. Closing Comments:I wanted to like I Am Bread. Heck, I thought early builds were surprisingly solid, but this full release didnt just avoid fixing many of the issues, but actually made them worse. The controls are awkward, but its the lackluster level design that really kills I Am Bread. Stages are far too labyrinthine and spacious, and when combined with a slim grip meter and the high amount of traversal required to complete the stages, youre left with repeated failures and tedious restarts. With graphical slowdown, obnoxious navigation clipping and bad crashes, the technical bugs are inexcusable for a game that had so much attention in Early Access. I Am Bread has novelty, but that novelty drains away quickly, leaving nothing but frustration in its wake. Its YouTube bait and nothing more.", "date": "on April 14, 2015", "grade": 2.0}