{"name": "MLB 15: The Show", "ref": "https://hardcoregamer.com/?post_type=post&p=144161", "text": "Many reviews start with a clich along the lines of its hard to believe its been ___ years since ___, but in the case of MLB The Show, its hard to believe its only been ten years the franchise started. Even though it kicked off less than a decade ago (the Xbox 360 was available by the time it did), it already feels like a staple of the sports genre. Perhaps its because were already on the tenth installment or because 2K discountinued their baseball franchise a few years back leaving The Show the only, ahem, show in town, but the series now epitomizes virtual baseball. For the tenth installment of the series and second on PS4, SCE San Diego Studio went back to the drawing board to introduce an entirely new game of baseball. Batter up!The biggest new feature MLB 15 brings to the table is undoubtedly Year-To-Year Saves. The feature allows those who purchased MLB 14 to continue their Franchise, Season and Road the Show progress in MLB 15. Not only is this a first for the series, but a first for sports games in general. More still, those who played MLB 14 on PS3 can still utilize the feature on PS4 simply by uploading their save to the cloud.Franchise Mode has also been refreshed to become more dynamic, requiring players to consider ownership expectations when running a team. Owners can now also partner with sponsors for extra cash whilst simultaneously increasing the reality of the mode. Trade Finder has also been added to the mode and brings improved trade logic, salary guides, GM history records plus updated and editable contracts. Franchise  along with Road to the Show and Season  also features a new suite of features providing news updates around the league. The new Inside The Show radio broadcast will be heard at the beginning of each new day and will discuss recent scores, team news, records, milestones and more. While it might not seem like a notable feature, its handy for those who spend countless hours looking at stats and taking care of their GM duties. Diamond Dynasty has also seen a complete overhaul. Overwhelming in the past, the mode is now driven by a new collection-based management system that builds a team simply by playing The Show. With the assistance of MLB Players Alumni Association, thirty legends are now playable in MLB 15, unlockable by collecting an entire MLB team  one for each. Playable characters have also been downsized so that one created player can simply play multiple positions.Gameplay has also seen improvements. Most notable is the new Directional Hitting interface that allows players to influence the direction of hits in-real time as they swing. Using the left stick can influence ground balls, fly balls, pushed hits and pulled hits. Outside pitches are better for hitting to the opposite field, for instance, while inside pitches are better for pulling. If no direction is pressed with the left stick, however, the prior Timing Hitting interface is simply reverted to. Directional Hitting is a commendable addition to the formula that allows each hitter to have more playable variations. Additional gameplay improvements include user controlled cut offs, a new slide/tag system, enhanced AI, advanced ball physics, more than 700 new gameplay animations and new situational base covering. Of course, being the sophomore entry for PS4, Sony has had more time to play with the hardware and improve the visuals. One of the coolest new features is real time sun and shadow positioning that bases the sun/shadows in stadiums on real life satellite data from Google Earth, ensuring that the stadiums accurately represent the part of the year the game is taking place in. More still, Color Matching technology has been introduced that allows stadiums to have their correct grass/dirt color pulled from real game footage. MLB players even have their own unique skin tone based on their real life counterparts, where as past games only had seven different skin tones. Ten new minor league stadiums have been added and the backdrops in all thirty major league stadiums have been revamped. Rounding things out is player individually (titled caps, necklaces, piercings, etc), new celebrations, new Jumbotron movies and split screen functionality.Enhancing the realism even further is the addition of licensed equipment. Brands like Nike, Sam Bat, Under Armour, Wilson and Louisville Slugger all appear in-game and everything from batters gloves to shoes now look as they do in reality. Universal rewards have also been added in addition to XP and Stubs and allow players to earn new items like virtual baseball cards (assembled into a Diamond Dynasty team).On the audio side of things, sound effects sound more realistic than ever with the accurate muffled yell of an umpire or the swift crack of a Louisville Slugger. The soundtrack conundrum that has plagued the series since its inception remains; the ratio of good to bad tracks is extremely high, but there simply isnt enough music. Death From Above 1979, Interpol, Until the Ribbon Breaks, Spoon and Porter Robinson all appear on the soundtrack, but their contributions make up literally half of it. Ten songs is hardly a soundtrack at all, but at least licensed music remains to keep things interesting unlike Madden which has completely rid itself of it. Closing Comments:Now that the PS4 has been on the market for over a year, SD San Diego has had time to fine-tune the MLB franchise, giving it more sheen to the point that its easily one of the most realistic sports games on the market. MLB 15: The Show doesnt bring any major additions to the table, but it does respectably tweak the most beloved modes to streamline the experience for pros and casuals alike. The introduction Year-To-Year saves makes upgrading to The Show 15 easy (figuratively and literally) and the plethora of visual enhancements ensure the upgrade wont go unnoticed.", "date": "April 13, 2015", "grade": 4.0}