{"name": "Toukiden: Kiwami", "ref": "https://hardcoregamer.com/?post_type=post&p=141771", "text": "When Toukiden: Age of Demons launched on Vita in February 2014, it left folks divided. Some really enjoyed it (were among them), while others really did not. Nevertheless here we are, a little over thirteen months later, and were getting Toukiden: Kiwami. Though not quite a sequel, this can best be described as an enhanced version of Age of Demons, effectively building on the formula laid by last years title and packing in a boatload of new goodies. With generally more content in terms of story, weapons, items, locations and monsters, the latest from developer Omega-Force is looking to fill that hunting game niche on the Vita and PlayStation 4, seeing as the latter has nothing to really offer in that domain. But just because a game has been tweaked and given more content doesnt always mean its worth a purchase. Where does Kiwami fall?Toukiden: Kiwami tells the tale of you, the player, fleeing your homeland to one of the last remaining human strongholds left after the Awakening occurred  an event that saw hundreds of thousands of demon menaces known as Oni ravage the lands of Nakatsu Kuni. Finding your way to Utakata Village, you wish to become a Slayer, a defender of the human dedicated to seeking out and destroying Oni. Although Toukiden is a endeavor that places gameplay at the forefront of everything else, its story is one of the more fleshed out tales in its genre. While other games of its kind  Monster Hunter and Ragnarok Odyssey specifically  dont have strong central narratives, its refreshing that Kiwami goes out of its way to develop a cast of genuinely likable and distinct characters. Clear motivations are laid out for the personalities, and the game finds a nice harmony of action and storytelling.Certainly the story segments take a backseat to the core action, as they should, but when talking portions do go down, they dont feel superfluous, instead intentional and important. These plot development and character interaction pieces dont overstay their welcome either, ensuring that folks can get back to what the game does best as quickly as possible. Is this an award-winning tale, though? No, not by any means. But its compelling enough to not make players just want to skip past anything resembling exposition. But when the core gameplay kicks off, Toukiden really catches its stride and clearly feels most comfortable in its skin when doling out baddies for players to trounce with enormous weaponry. On this front, Kiwami is a formulaic game. We say that with positive regard though, seeing as said formula is one that, by and large, works well. It goes down in pretty much the same way across the games original 30-hour campaign, in addition to the lengthy new one added for this release: Talk to pivotal characters in town, get mission, go on mission, slay a bunch of stuff, return to town, get reward, spend new money on buying or forging new equipment rinse, repeat. Its a rhythm most will know if theyve played Monster Hunter, Phantasy Star Online/Universe and to a lesser degree, Soul Sacrifice. Its also a rhythm that, while predictable, is rewarding all the same as the thrill of the hunt is what drives players to keep pace with the methodical cadence.Its in an actual encounter that the rush of combat begins to recompense folks for their efforts. Toukiden is an action game, but its not balls-to-the-walls hack and slashing like Tecmo Koeis other franchise, Dynasty Warriors. How it all plays out, however, will be familiar to genre vets. Players have a level that is divided into smaller areas, and they systematically cut their way through each area, usually filled with hordes of fiends, until they clear the entire map, or until a victory condition is met. They dish out the punishment via combos that are executed with the square, triangle, and circle buttons. These button presses can be mixed up to create combinations, and knowing an enemys attack patterns, strengths and weaknesses will ultimately be the deciding factor on which combos to execute given the situations circumstances. The problem in Toukidens battling mechanics doesnt lie in its speed, because that feels great; its that we could have used more moves per weapon. Since this is the type of game that offers little else outside of combat, it would have been ideal to have an arsenal of attacks from which to choose in order to vanquish monsters. As it stands though, folks will want to get used to seeing the same animations over and over due to this issue. The combat also lacks weight sometimes. Its one of the defining elements of Monster Hunter, but is somewhat absent here. Even with the new spiked club we felt underwhelmed; sure, it packs the biggest hit of all the weapons, but even wielding it wasnt satisfyingly punch-y On-screen, it looked like we were carrying a hilariously large baton, but we never felt it in our hands. Some kind of feedback from the DualShock 4 would have done wonders in this department.Speaking of the new weapons, the other additions, the naginata and rifle, left us divided. The rifle, though not very powerful, felt like EZ-mode in the sense that all a player has to do is hang back, lock onto a target and fire away. Sure, if they only do this they wont be making the most out of the rifles purpose, which is to locate weak points and fire on them in a way that other classes who are caught up in melee combat simply cant. But this only makes a marginal difference, and a player can do almost just as much damage by hanging back and firing at random without having to sacrifice manual dexterity, the headache of positioning themselves correctly or getting caught in the cross-fire of the action to do so. The neat aspect of the rifle, however, is its use of bullets. Bullets come in a variety of kinds that range from explosive AOEs, to single-target ones, with some debuffing capabilities thrown into the mix, thus making the player who uses the rifle one of the most ideal utility fighters a party could ask for.The naginata, on the other hand, is excellent. Its a polearm, but has a moveset and style that is actually a hodgepodge of the pre-existing kusarigama and twin blades. It acts as something of a happy-medium between both of those weapons, what with being stronger than the twin blades, but having less range than the kusarigama. Its primary hangup is that it drains stamina very quickly, which is sure to confuse newbies, especially when locked in the chaos of a fight to the death. The aforesaid spiked club was our favorite new weapon though, because its vastly different from all the rest. It, too, is a polearm moveset, and acts as a middle-ground between the gauntlets and spear, but deals absolutely massive damage from a mid-range, and can counter most attacks with the right timing.Regardless of a players weapon of choice, Toukiden still falls victim to a lack of diversity in terms of actual gameplay. Its not the hunting-game formula that will put folks off, its the lack of interesting, varied environments, creature types, mission objectives and repetitive moves and animations. For a game that is essentially a one-trick pony, it has to make up for its genres inherent limitations through ancillary means; but it doesnt, which makes an already repetitious game, feel all the more so. There are at least new items, monsters, and missions for Kiwami, so consider it an upgrade over Age of Demons, but the problem still exists, just to a lesser degree.Also new to this release are the enhanced graphics. Age of Demons was only a Vita game, and thus since Kiwami uses it to build off of, what we are left with on the PlayStation 4 side of things is an up-rezzed version of a handheld title. Thats not to say the game looks bad, it doesnt at all. In fact, the improved textures look especially great  but its obvious at all times that this is not a game meant to show off the PS4s technical prowess. As such, it looks more like a middle-aged PS3 game. The Vita version, on the other hand, looks spectacular, especially via the OLED screen. Better still is the overall performance of both titles, which suffer very little from slowdown, long load times and pop-in.Toukidens presentation in general is worth noting because its top-notch. Despite initially being a Vita-exclusive, it would appear that no expense was spared to make this look like a top-shelf game. Menus are clean and thematic, the soundtrack is a combination of typical Omega Force rock-anthems during heated encounters, and traditional Japanese feudal ditties when in town or wading through texts of a talking segment, character portraits pop with color and the CG-rendered cutscenes sprinkled throughout are staggering.Where the game also excels is in its multiplayer component. Its seamless, supports up to four players, and is even cross-play. This type of game is meant to be enjoyed with friends, and thus being able to do just that, and do it effortlessly without any kind of cumbersome setup, is just what it needs. Though, if youre more of a solo player, know that, unlike most of hunting games, Toukiden allows folks to take into battle with them up to three of AI-partners. Better still, the AI here is actually really competent. If they ever get out of line, however, theres even the ability to give them orders via the d-pad. Theyre basic commands, such as attack, defend, etc., but their mere inclusion is quite nice. Closing Comments:Toukiden: Kiwami is a great entry in the PlayStation 4s catalog, specifically due to the lack of its genres presence on the machine. It builds off of last years Vita game in intelligent ways to make it the definitive Toukiden experience. It has its shortcomings, but they dont hamper the enjoyment that can derived. Its action is fluid and fast, its customization options plentiful. Its setting is also compelling, if for nothing else than for the fact that its not a frequently employed one. Players looking for a fun multiplayer experience steeped in the ways of Monster Hunter will probably want to pick this up. Those not looking for either, or just someone who wants a sound single player endeavor, may want to test the waters before committing to a purchase.", "date": "March 31, 2015", "grade": 3.5}