{"name": "Mario Party 10", "ref": "https://hardcoregamer.com/?post_type=post&p=140720", "text": "Its hard to believe Mario Party has been around since 1999. Mario Party 10, actually the thirteenth entry in the series, marks the franchises debut on Wii U and brings with it the expectations of innovative amiibo and GamePad functionality. While both of those criticized elements of Nintendos home console are embraced, theyre sadly unimpressive additions to a series that continues to lack direction.In the basic Mario Party mode, up to four players sit in a car and take turns rolling dice to propel the group around the board, collecting mini stars and competing in minigames along the way. This is where the majority of the content lies, offering six different boards and a multitude of minigames. Its enjoyable for a while, but as star distribution becomes more about luck than skill and games drag on unnecessarily, it becomes plain to see that Mario Party 10 hasnt learned much from the hiccups of its predecessors.The minigames themselves are largely enjoyable, utilizing the various motion and button controls of the Wii remote in simple yet challenging competitions. Some are 2v2, others 1v3, but most are frantic 4v4 tests of skill and concentration. Theres a ton of variety, but not as many standouts as past Mario Party games. The biggest issue with the basic Mario Party mode is that its simply too watered down. Throwing everyone in the same car was a bad idea in Mario Party 9 and its just as bad in 10, making the experience much more passive and boring than it ever should be. Luckily for Mario Party 10 and its players, however, it doesnt rely solely on this disappointing mode.The first new mode, amiibo Party, is built around Nintendos recently released Super Mario line of NFC figures. Youll want to have at least one of the figurines handy, too, because the mode is actually locked away until you tap one to the GamePad. Once inside, players can either choose to use an amiibo as their in-game token or a cardboard-cutout equivalent, but only those using amiibo have access to the variety of useful tokens youll collect while playing. Each totes a unique ability, like covering the board in coins or changing a portion of the game board, and when used shrewdly afford amiibo users a notable advantage over their cardboard opponents. Apart from that, though, theres not much reason to use Nintendos hit figurines  in fact, Id recommend you dont.The biggest problem with amiibo Party is that if youre playing with an amiibo, nearly every interaction with the game board is controlled by tapping the figure to the gamepad. That means everything from rolling your die, spinning a roulette, stopping said roulette, or activating a token is and can only be controlled with your amiibo, and the lack of an alternate control scheme (whatever happened to pressing A?) is absolutely unacceptable. Its understandable that Nintendo would want to incorporate amiibo as much as it can, but forcing you to hunch over the gamepad multiple times each turn is completely obnoxious.Apart from that mind-boggling decision, amiibo Party is actually decent. The goal is to collect coins and cash them in for stars over 10 turns, while competing in minigames for coins after each full turn, just like classic Mario Party. Thanks to warp pipes and a more diverse selection of dice, theres actually a tangible element of strategy to amiibo Party, a welcome change from the luck-based gameplay of so many past (and present) Mario Party iterations. The ability to customize the board with quadrants inspired by different Super Mario characters is a neat idea, but the differences between each board are so miniscule that theyre really not much more than aesthetic changes.Bowser Party, on the other hand, is an intelligent twist on the Mario Party formula. It retains the 4-player road-trip format of standard Mario Party, but gives a fifth player control of Bowser on the GamePad in a sort of dungeon-master role. Instead of mini-stars, the four players in the car try to collect hearts in an attempt to survive their journey to the end of the board. After all four passengers have taken their turns the gamepad player rolls four dice at once, and if Bowser catches up to the other players everyone is tossed into any one of a range of diabolical minigames. These differ from those found in both Mario Party and amiibo Party, because the player on the gamepad has direct control over Bowsers actions. Its an awesome power trip, offering a welcome shift in the dynamic of the experience.Theres a ton of GamePad functionality in Bowser Party, not only in the minigames but also in various areas on the board. The player on the GamePad can lay traps and mislead other competitors with graffiti and stamps during certain intervals, making for a much more interactive and unpredictable Mario Party experience. Unfortunately, while Bowser Party is easily the most interesting and enjoyable portion of Mario Party 10, its also the most barren. With only three boards to choose from and significantly less minigame variety than the other two modes, youre bound to get tired of it much quicker than you should. Bowser Party is the most interesting spin the Mario Party series has seen in years, but sadly its not shown the attention it deserves.Still, Mario Party 10 isnt all bad. It benefits greatly from the beefier graphical power of the Wii U, making great use of Super Mario 3D Worlds luminous visuals. Its also loaded with the Mushroom Kingdom charm thats become synonymous with Nintendos mustachioed mascot, and the emotional responses of each character are always a treat. Theres even a few bonus games and a host of challenges to complete, which help fill out a disappointingly stark package. Even so, its frustrating that Nintendo couldnt find the inspiration or desire to make Mario Party 10 a truly worthwhile experience.Closing Comments:Despite its flaws, its hard not to have fun with Mario Party 10 in small doses. Obnoxious amiibo functionality and an overall lack of variety make it hard to recommend to anyone whos not already a fan of the franchise, but those who enjoy a bit of Mushroom Kingdom chaos with friends might just find reason enough to give it a shot. Mario Party 10 takes tantalizing strides towards the innovation players have been calling out for, but its lack of commitment to any of its modes ultimately sees it fall flat.", "date": "March 23, 2015", "grade": 3.0}