{"name": "Bladestorm: Nightmare", "ref": "https://hardcoregamer.com/?post_type=post&p=139428", "text": "If it sort of feels like the Warriors series is Tecmo Koeis Call of Duty, then you too are noticing that the venerable franchise has turned into an annual one, releasing some kind of new installment at least once a year. It can become exhausting keeping up with them and even more frustrating playing them all, as they can sometimes feel remarkably like the last. While the company has been pulling away from this more and more lately, now embarking on various crossover endeavors with the likes of Nintendo and Square Enix, sometimes even those formulas dont feel different enough to keep things fresh. When the company released Bladestorm: The Hundred Years War for the PlayStation 3 back in 2007, right in the thick of Dynasty Warriors-overload season, however, it was a breath of fresh air thanks to its use of the series core systems to build a more elaborate strategy-action title. Here we are then, some eight years later, revisiting Bladestorm again (now with the subtitle Nightmare), this time with more content and greater graphical fidelity. Is it enough for some a second go-around?Think of Bladestorm as Dynasty Warriors, but set within the Hundred Years War timeline and, instead of controlling just one character, players are tasked with leading an entire squad into battle, sometimes upwards of 20 or more combatants. This is the premise of what Tecmo Koeis action-strategy hybrid has to offer at its center. The backdrop is a nice change of pace from the Feudal era of Samurai Warriors and the Three Kingdoms period of Dynasty Warriors. So what we are presented with is a tale of the war between England and France that spanned much of the 14th and 15th century. Players assume the role of a mercenary warrior that is out, not for glory, but money and in turn takes on missions from both sides of the war.Although the protagonist is player-created, the rest of the cast is comprised of both historical and original characters; so the likes of Joan of Arc, Edward the Black Prince and John Talbot all play pivotal roles in the storyline. The former two are the characters focused on most, with the player often serving directly under these famed champions. The story is primarily delivered through text briefings before and after battles, though the occasional CG cutscene happens at critical junctures in the narrative. While its not magnificently constructed by and large, the story is rather good just the same; not to mention, it is far less convoluted than that which is seen in Dynasty Warriors and doesnt require pre-existing knowledge to immediately follow and enjoy the events unfolding.While the plot has a few major crescendos, the path to getting there is up to the player and which battles they choose to fight and sides they opt to align with. In this, a good amount of power is given to each person to decide the cadence of the war, and ultimately  depending on the choices made before the finale  dictates who wins the whole thing. Its a fascinating, more engaging tale than what is typically seen in Tecmo Koeis beloved franchise and one we couldnt help but feel was refreshing when compared to its predecessors. Of course, this only chronicles the original mode from the 2007 PS3 release. New for this remaster is the Nightmare mode. In this, the story is changed drastically, taking a few aspects of the Hundred Years War history, and mixing in a substantial helping of fantastical elements that introduce monsters, demons, dragons and possessed historical figures. While the original mode is a bit more open-ended, Nightmare feels far more focused in its scope and storytelling conventions. As a result, the characters are more fleshed out, and by proxy, the player feels more a part of an actual struggle, rather than being just a nameless slayer on the fields of combat. In fact, the inclusion of Nightmare mode is quite excellent, as it fills in the gaps left by the originals pitfalls. Not to mention, its a lengthy tale (and so is the original mode), so the fantasy backbone of the story can be enjoyed for hours and hours, making a 50+ hour game all the longer. Oh, and did we mention theres an evil Joan of Arc acting as the storys primary antagonist? Because thats a thing, and its awesome. Needless to say, folks looking to get their moneys will want to look no further.That is, unless the gameplay isnt up to snuff, because while the new mode does much in the way of story, a Warriors-esque game is only as good as how it plays. To that extent, Bladestorm will feel both familiar to fans of the series and different thanks to how to approaches the classic Warriors formula. For starters, folks dont just control one character here. No, they instead command entire squads of soldiers, while still controlling their own character simultaneously. When whisked away to the frontlines, folks start off attached to a squad that they choose pre-combat. While a part of this regiment, players charge headlong into battle with soldiers ready to do their bidding. Wherever the player goes, the squad goes. Whatever attacks the player dishes out, they do the same. In all squads, folks are given three attack options that are contingent upon the weapon class of the squad. There are sword squads along with knife, lance, bow, and mace variants just to name a few (there are more), and depending on which group the player attaches themselves to in combat, determines what weapon they wield as well. So while individuals will start off with the group they decided on before the engagement, at any time they can run up to another squad, press the confirm button, and they will immediately leave their old one and link up with their new comrades, even changing weapons and therefore attack palettes entirely on-the-fly, should they wish to go from sword-swinging viking to arrow-shooting archer. There is a caveat to all of this, though; to link up with particular squads, players must be trained in the weapon type of that group in order to adjoin themselves. Thus, the extensive amounts of character and squad customization that goes on pre- and post-battle is absolutely essential to winning the war. Those who love extensive customization will feel right at home in Bladestorm as players can not only outfit their created character with armor and weapons, they can then train their squads, learn new moves and enhance stats  all of which are needed for those grueling encounters that come later on in the game. In fact, disregarding Trinity: Souls of Zill Oll and the forthcoming Dragon Quest Heroes, this is probably Omega Forces most RPG-heavy title. This facet of Bladestorm: Nightmare is a real treat, as we found ourselves spending 20 and 30 minutes before and after scenarios just tooling around with tweaking our favorite squads. Since players earn grades depending on their combat performances too  and then are rewarded with skill points  we were often poring over which growth domains and attributes to sink our hard-earned cache into, so that we could be best prepared for the next face-off.All of this, of course, leads up to those dramatic moments that take place on the battlefield itself, where folks will routinely control whole squads across enormous maps (easily three times the size of a standard Dynasty Warriors map) with sometimes upwards of one hundred enemies on-screen at once. Its almost breath-taking to see it all go down, and to then be in the thick of it, fighting for your life (and doing so with hardly any framerate slowdowns) is a treat; unfortunately though, the actual fighting is not as astounding. In other Warriors installments, there are loads of combos to learn and divvy out to baddies, but not here. In Bladestorm, youre given no combo opportunities, and are at all times limited to the three squad attacks that are mapped to the face buttons. Sure, players can build up their gauge and unleash super powerful Bladestorm assaults after racking up monstrous combo chains, but thats the extent of combat nuances. So literally every encounter can be beaten by holding down the right trigger (which delivers a standard attack) and then executing a face-button skill once its cooled down from the last time it was utilized. Had Bladestorm incorporated components of Kingdom Under Fire, and allowed players to pull back and issue orders to various squads in an RTS-like fashion in addition to the fighting, this gameplay experience would be second to none. Since this isnt an option, and the best a player can do is switch to another squad that an AI partner controls, there just isnt a lot of variety to be had. It doesnt help either that the AI, on both sides, is mediocre at best. Sometimes we found ourselves plunging into the enemys stronghold, only to find that our fleet was nowhere to be seen, and instead it was just us and our squad of 20 taking on four and five times that number.Still, since the game is quite long, battles all start to play out the same until the latter stages, when the difficulty ratchets up and requires players to jump from squad to squad in order to capitalize on enemy weaknesses. Only in those instances does this formula shine. The ten or so hours that are needed to wade through to get to that pointmhowever, can be a real slog.The presentation of Bladestorm: Nightmare, like its gameplay, is a mixed bag. Its important to remember that this is an almost eight year old game. So while a remastering has indeed taken place, one can only fancy up a blemish so much before its obvious that, while all dolled up and shiny, the blemish is indeed still a blemish. Texture work, anti-aliasing issues, stiff animations and pop-in are among the worst offenders. If theres a saving grace its that the battlefields are indeed massive; when in motion, and players are marching on a castle with an army of a five dozen in tow, its hard not to be captivated. Enhancing these epic segments is the fantastic soundtrack. Its all strings and orchestral anthems that would well accompany films like Braveheart and Kingdom of Heaven. There arent a wealth of tracks, but whats there is rather masterful.What Bladestorm is missing, then, is some kind of multiplayer feature to keep things exciting. As it stands, theres only the original and Nightmare campaigns and a free mode. This kind of experience would benefit greatly from some kind of two-player co-op, or two-versus-two deathmatch. But alas, it was not meant to be, and as a result, feels like a missed opportunity. Closing Comments:Bladestorm: Nightmare can appeal to both Warriors fans and those who dont even get into Tecmo Koeis flagship series. Its brilliance exists in those moments of storming enormous strongholds with an army of 100-strong at your back, ready to slice and dice through wave after wave of enemies. Unfortunately, these moments dont happen as much as they should, leading to an experience that can instead feel uninspired and repetitive. Still, it gets a lot right; the scope, large scale battles, story and new Nightmare mode are particular achievements. Ultimately, Bladestorm may not be Omega Forces finest hour, but its a good one just the same.", "date": "March 17, 2015", "grade": 3.5}