{"name": "OlliOlli World", "ref": "https://hardcoregamer.com/?post_type=post&p=418965", "text": "Ive brought this up before when checking out games such as Session, but its weird that that the indie gaming world hasnt made any attempt to revive the extreme sports genre. You keep seeing comments on how we should be moving on from pixel art in indie games to PS1-era aesthetics, but outside of boomer shooters and the occasional retro survival horror title, there hasnt seemed to have been much of a movement towards bringing back actual games and subgenres from that era, extreme sports included. But also as mentioned back then, one of the few developers actually willing to take a chance on extreme sports again is Roll7, with their OlliOlli series of 2D skateboarding games. And now, seven years after the last OlliOlli game, theyre back with OlliOlli World, an extreme sports experience like no other.And immediately, OlliOlli World lives up to that promise of being a unique experience the moment you begin the game and witness its story. Set in a world known as Radlandia where five Skate Gods each carved out their unique lands in order to create their own skating paradise, the game sees you playing as someone being considered for the role of a Skate Wizard, one who maintains the balance between the gods home of Gnarvana and the actual spirit of skateboarding back in Radlandia. So now, accompanied by a group of new friends, you set out on a journey to reach Gnarvana, one that involves a lot of grinds across roller coaster-like rails, huge flips across entire pools of sludge and several smashed cat souvenirs, to name a few things.If the names of Gnarvana and Radlandia didnt already tip you off, OlliOlli World is more out there compared to its predecessor, having switched to a vibrant and colorful cel-shaded style designed to appropriately evoke the likes of Jet Set Radio. The use of bright colors isnt just for show, though, as the game also uses colors to great effect when marking rails, rideabale walls, and various hazards to great effect while still feeling like organic parts of each level. The characters are also fun and enjoyable (even if they have this jittery animation style in cutscenes that doesnt mesh well), with a nice blend of humans and fantasy creatures, all of which wouldnt feel out of place in a Pendleton Ward cartoon (honestly, one character even kind of looks like a melted Princess Bubblegum). Throw in an expertly-chilled electronica soundtrack and the style sets the stage for Radlandia to be a sort of utopiaor rather, five of them, with each land having its own distinct flavor. But while the setting, story and visuals have all received a major overhaul, the core gameplay still remains as tried and true as ever. In fact, its actually shocking that despite not having played one of these games in over half a decade, I was able to almost immediately slip back into things. The controls remain as nice and simple as ever, with the right thumbsticks used to to pull off tricks, grabs and grinds, the A button used for pushes and manuals, and the left and right triggers used for spins. Performing simple tricks was a snap, though advanced tricks and chaining them together into combos requires more mastery, once again sticking to the tried and true motto of easy to learn, hard to master.There are new additions to the formula this time around, though. There are little things like not automatically slamming when you hit the ground, bigger things like the addition of quarter-pipes for additional air time and trick potential, and the biggest addition, branching paths. Sometimes you can just press the X button when passing by a certain area, or sometimes its as simple as dropping down to a rail below you, but the levels in OlliOlli World have multiple ways to reach the finish line. And the reason this is the most important addition is because it defines what makes this entry truly stand out, and its right there in the title: OlliOlli WORLD.The level design in OlliOlli World is just superb, plain and simple. While each area is perfectly built around pulling off as many insane tricks as possible, getting over insane obstacle courses in platformer-esque actions, or both, theres always this wonderful sense of exploration baked into everything. Each stage has multiple challenges to attempt based around the environment, like wall-riding across certain billboards, booping a number of vultures scattered about the area or even just high-fiving your friends that can you can find along the way. Achieving all of these challenges requires a keen eye and proper timing as you suddenly try and decide what route leads the correct way (and thankfully, once youve completed certain challenges, they remain completed even if you fail afterwards and warp back to a checkpoint), sometimes even leading to a Gnarly! route thats more difficult. It can feel like a mix between a labyrinth and a roller coaster at times, especially with some of the more intense grinds, but it always feels like a blast. No matter what, though, the route you choose always feels rewarding somehow, sometimes just because it leads to unique bits of scenery like an audience of cactus people or golden thread spread along a cat statue. You know, those little details that go towards building up the world even further, that alongside the level layouts and characters bring the world of Radlandia to life and truly make it seem like a skaters paradise. It also ensures replayability as you head back to certain stages, wanting to see every route and unlockable side quest. There are also local heroes with score challenges to beat, so finding routes that maximize score potential pays off as well (including later levels where you can potentially have looping paths, either staying the same or changing in certain ways).This is where things got trickier for this reviewer, as much like fighting games, I dont exactly have the skills needed to memorize the maneuvers needed for the more advanced tricks and combos. Thankfully, OlliOlli World is a lot more accessible and doesnt put any major pressure on you when it comes to high scores. Do you want to master every skill possible and crush the high scores? Thats cool, says the game. Do you just want to get through all the levels, complete the story and enjoy the well-crafted courses? Then thats cool as well, it says. The challenges only unlock cosmetics, anyway. Cool-looking cosmetics for well-designed character customization, but still just cosmetics, no biggie. Make no mistake, OlliOlli World is still challenging and can get tricky at times, but it knows to place the importance on fun regardless of whether you get your fun through high scores, epic journeys or both. That said, if you are going for the high scores, then there admittedly is a difficulty spike once you get to the fourth land, Sketchside, as the target scores notably increase. For that matter, theres also this one set of levels in Sketchside that kills the momentum a little. While other areas teach and have you get used to new tricks in a more organic way throughout their levels, like with large slabs for wall riding or giant crystals that that you have to perform a grab in order to smash through, apparently Roll7 couldnt think of a good way to implements a required use of manuals in certain levels, so immediately after their tutorial, it just goes okay, we know we just taught you these, but now you have to perform them in very specific ways as part of certain tricks in order to proceed. It might be a minor nitpick, but it does stick out like a sore thumb compared to all of the other amazing levels and feeling of freedom experienced before it.This hasnt even gotten into the mastery challenges given by each Skate God, the Gnarvana League where you can complete against other players, or the Gnarvana Portal where you can skate in millions of randomly-generated levels and share them with passcodes (not as awe-inspiring as the regular levels, but a nice touch). OlliOlli World truly is a skating paradise, one with tons to do, aim for, discover and unlock. Be you a casual skateboarding fan or someone more hardcore, theres a ton to do here that will keep you hooked for a long time. Closing Comments:Even if it still doesnt lead to some sort of resurgence in extreme sports games, OlliOlli World can still stand as one of the most unique and fun skateboarding games of all time, one thats perfectly suited for both novices and masters alike thanks to its intense and immaculate level design, massive variety of tricks to pull off and tons of challenges to keep players coming back for more. Top it all off with a superbly psychedelic style and setting to make things pop, and what you have is a skateboarding experience that may very well indeed be the closest to Gnarvana that you can get.", "date": "February 18, 2022", "grade": 4.5}