{"name": "Resident Evil Revelations 2", "ref": "https://hardcoregamer.com/?post_type=post&p=139481", "text": "For the last month, Capcom has been releasing Resident Evil Revelations 2 in an episodic format: Penal Colony, Contemplation, Judgment and Metamorphosis. While the series started off a little slow, it grew into something more, containing a well-paced and highly entertaining adventure at a minimal cost. The story revolved around fan favorites Claire Redfield and Barry Burton as theyre thrown into yet another unfortunate set of events, becoming involved in a plot to potentially spread a new form of BOWs around the world. With the concluding release finally out, were here to take a look at the game as a whole and see how it holds up.Each episode is broken up into two stories: Claire with Moira and Barry with Natalia. Claire and Moiras tale is unfortunately the most lacking of the two campaigns only because of the large focus on action. Mind you, Resident Evil has been moving more towards a high octane, cinematic experience over its methodically paced puzzle solving horror elements in the last couple of iterations, but its very apparent here. Thankfully, the last two episodes change things up quite a bit, throwing in a fair amount of puzzles and time-oriented challenges, but for the most, these portions will be mostly known for their gunplay scenarios.Thats not to take anything away from the gameplay, though, as Capcom has nailed the controls and feel of combat. Ammo can be incredibly scarce even on the normal and hard difficulties, and the reliance on running becomes a huge factor in many situations. Theres essentially only one boss throughout Claires portion  thats not including an optional fight and an enemy that becomes prominent later on  and it can be an intense battle. While not overly creative, it helps conclude the twos gratifying adventure, especially considering the last episode somewhat shoves them aside for Barry. Their story, on the other hand, is a lacking as the plot twist can be seen from a mile away, and the enemy variety simplistic to the point that a lot of encounters can be won simply by blinding enemies with a flashlight and delivering a finishing blow after a devastating kick. Overall, Claires campaign is still strong, showing off how much Capcom has learned in terms of creating a solid action title with a few puzzles thrown in from time to time.The biggest and best scenario, though, is Barry and Natalias. While Barry has been a fan favorite since the first game, his appearance in the vast survival horror universe has been limited to a quick couple of seconds at the end of Resident Evil 3. He definitely deserves a better treatment than being written out and shipped to Canada, so its a delight to know Revelations 2s plot is centered more on him than anyone else. It tells more about Barry and his daughter Moiras relationship than youd think, along with a better paced story filled with cliffhangers at the end of each episode. His combat scenarios are by far the highlight as they generally offer a way to stealth through areas. Considering this is supposed to be a survival horror title where ammunition conservation is key, this opens up entertaining scenarios for the STARS veteran to participate in. It helps that Natalias abilities are useful for seeing through walls, even though calling and tagging enemies with her finger is only helpful when facing invisible foes.While Claire and Moira had a couple of bum episodes, Barry and Natalia stayed strong all the way through. Episode 3 does open a little slower than usual for the two, but its quickly countered with new enemies and a puzzle solving scenario that allowed for a little more exploration. Even in the end, this story is all about Barry as hes the one who gets to face off against the main antagonist, who will have fans on the edge of their seats by episode 2. The antagonist herself isnt all that prominent throughout Barrys campaign as much as she is with Claire, but the final boss is a tense and somewhat frightening encounter. Barrys chapters will be an absolute treat for those who enjoy old school Resident Evil elements with tidbits of what the series has been doing lately.Outside of the main campaign, there are two additional episodes for those who bought the season pass or disc-based release. The first centers on the rather rambunctious Moira after her story closes up in the main campaign, while the other is centered on little Natalia and her bizarre journey right as Barry finds the island. The two stories will take anywhere between thirty to forty minutes to complete  shorter if you know what youre doing  and changes up the formula nicely. The idea around Moiras quest is that she needs to survive on the hazardous island, both in terms of battle and rations. This is far different from what weve come to expect as shes forced to hunt animals, such as rabbits and even those giant spider cockroaches, in order to survive for the many months shell be on the island. The first mission will require Moira to hunt as much as she can in the allotted time to fill up her ration bag. If she dies in combat in the next couple of missions, or spotted in one specific stealth area, a ration will be used as a form of continue. When the rations run out, players will have to start the entire story over again. Its an interesting idea that could have been more realized as it doesnt really give much tension on such a short campaign, although more of the stealth missions would not have been enjoyed. Regardless, her plot is entertaining and even bridges the gap right into the end of Barrys story, tying things up nicely.Natalias side story is far different as its entirely stealth oriented. While her involvement with Barrys campaign included a fair amount of sneaking, this is entirely dependent on maneuvering around enemies in rotating animation cycles. Players will take control of two little girls as they go on a journey to find Natalias teddy bear Lottie who has become suicidal  a somewhat grim notion for a kid, but it works. The mechanics are a little different as Natalia can spot enemies in the distance with her vision ability, while the second character is able to move ahead without being spotted and become a helpful guide. This is definitely not for everyone as theres no action whatsoever this time around, with lots of waiting and slowly moving to avoid being seen as the prime focus. Like Moiras side tale, its a nice change of pace and does shed some light on who she is, even though we never really get a great understanding in the end. Raid Mode is probably the biggest surprise Revelations 2 has to offer. While fans undoubtedly predicted the over-the-top campaign, no one would have expected there to be a massive, time consuming secondary mode. While it doesnt come with online cooperative play at launch, this still is a substantial addition thats highly entertaining and rewarding. It takes everything that was decent in the first Revelations mode and amplifies it to where the series should have been going. This is a mission structured horde mode that pits the player against a specific number enemies. Sometimes it gives you a countdown clock, but most of the time its just fighting against waves of monsters before theyre depleted. Its never that simple as there are many enemy types, several of which are pulled from past games, and different elemental effects that they may be equipped with. Sometimes they will explode if killed, emit a poisonous gas, run incredibly fast and so forth.Raid Mode does include multiple environments from Resident Evil 6 and the first Revelations, but the way theyre structured ensure for exciting scenarios. Theres an overwhelming number of missions to partake in, with over 160 ranging in three difficulties, not to mention a great deal of characters to choose from. Theres also an extensive leveling system that adds a whole new layer to the combat, allowing each character to be specifically enhanced, and some with unique abilities that can be passed onto others by Inheriting them. Finally, weapons can be customized with mods that are found in missions or bought in an in-game store, allowing aspects such as elemental effects to be equipped or the ability to shoot more than one round every time the trigger is pulled. Raid Mode will have fans playing for hours on end, bringing into question how such an expansive mode helps Revelations 2 outshine its mainline series. Closing Comments:Resident Evil Revelations 2 is an absolute surprise. While the first game was arguably the best spinoff the series has seen, Revelations 2 steps it up by offering a perfectly suited episodic format. The bite-sized experience comes with more content than most sixty dollar releases, with the Raid Mode alone being worth the investment, giving players an unhealthy amount of enjoyment. Its a shame the survival horror title doesnt have online co-op at launch, but it still offers something far deeper than anything in the series, and is the best value for your dollar. Resident Evil Revelations 2 may have started off a bit slow, but Capcom was able to redeem themselves by creating an irresistible adventure through and through.", "date": "March 17, 2015", "grade": 4.0}