{"name": "Final Fantasy Type-0 HD", "ref": "https://hardcoregamer.com/?post_type=post&p=139256", "text": "The Final Fantasy series is no stranger to spin-offs. Tactics, Crystal Chronicles and Mystic Quest are just a few of the many works Square Enix have developed outside of the mainline series. Final Fantasy Type-0 HD falls in with the Fabula Nova Crystallis saga, taking various games under the Final Fantasy name and establishing them in a similar universe. While there have always been connecting traits to each title, Type-0 HD includes aspects such as the lCie, Pulse and other terms that have been exclusive to XIIIs world, but altered to have a slightly altered relation to the world . With a significant lack of Japanese RPGs being available on the PlayStation 4 and Xbox One, Square Enix is capitalizing on re-releasing their three and a half year old handheld game to a new audience.Its best to start off with what Final Fantasy Type-0 HD does right: combat. Final Fantasy has always been a turn-based series, even though the illusion of complete control over characters has been seeping into the last couple of games. Type-0 HD is entirely an action-RPG in that everything is in real time. The easiest comparison would be to the Star Ocean and Tales franchises, placing characters into a three dimensional battlefield in which they can move around freely. The mechanics here are simple as all of the possible commands are laid out in the in-battle user interface. Each of the fourteen playable characters among Class Zero have a basic attack and can equip two offensive commands and a defensive ability. The offensive commands range from character-specific traits to standard magic attacks (such as Fire, Blizzard, etc.), whereas the defensive side of things contain cure, protect, block and so forth. Theres a good amount of variety and the fourteen unique characters to choose from make combat all the more enjoyable.Random encounters also make a return as the world of Orience is brimming with frequent battles. While thats not necessarily a bad feature, the inability to run is, forcing you into possibly dire situations. Its also apparent that Type-0 HD is meant to be played more than once. The campaign starts off with low level characters but offers various Expert Trials and other side missions later on that contain significantly higher requirements to complete within a given amount of time. There are also dungeons that are not recommended on the first playthrough as they contain some of the toughest enemies to be found. Granted, if youre good enough and utilize the Kill Sight feature, which basically acts as a counter system that hits the enemy in a vulnerable situation, they can be excellent places to grind. The combat is easily the best and most accessible part of Type-0 HD, but unfortunately thats not the case for the rest of the game. While the core combat is quite satisfying, there are a number of mechanics that stand out as rudimentary. Only one side mission can be accepted at a time, which can become troublesome thanks to the time management system where going outside of Akademeia uses six hours of the in-game clock. Transportation within Akademeia is also clumsy; theres one central terminal that will bring you to multiple locations, but once in that area, you can only transport back and nowhere else. Its a cumbersome system that will have you moving back and forth unnecessarily.Those arent even among the worst of the bunch, though. The most disappointing is how the campaign itself is structured. Class Zero will be given a story quest, ranging from roughly 15 to 30 minutes depending on how quickly you can move through it, but after thats done, youre forced to grind for hours just to meet the recommended level for the next mission. Its only difficult because you have to manage all members of the class. There are some missions where death in inevitable, forcing you to switch out party members on the fly, so having those ready for battle is essential. It wouldnt be so bad if Type-0 HD had a natural way to level up, not forcing you to grind, but unfortunately thats not the case.Its not just how the main campaign is structured, but how the story itself is presented. While Final Fantasy games generally give players a good understanding of the story and world within the first hour or two, it takes Type-0 HD an exceedingly long time to get to the point. The lengthy RPG doesnt pick up until around fifteen to twenty hours into the campaign where an actual plot is finally established. Up until that point, players are forced to slog their way through four rather dull and somewhat repetitive chapters with the main goal being simply to invade a land or steal secret plans. After the world opens up, theres a little more to see and do, but its unfortunate that it takes as long as it does to get your attention. Even after that point, the story itself isnt all that compelling and feels far too slow with little to no character development for most individuals. Mind you, players are thrown into the story with no understanding of who these fourteen killers are, but you only ever get a small look at their personalities as it feels like theyre spread out too thin. From a presentational standpoint, you can tell Final Fantasy Type-0 HD came from a PSP game. This is not a particularly visually appealing release, having shockingly low resolution textures on virtually everything in the game, with the exception of the main fourteen characters. Class Zero have been remodeled to great detail to be up to standards with the current generation, but while this is appreciated, they stand out immensely in the undetailed world. The world itself is flat and repetitive, having only a select number of enemy types with different shades attached to them. Almost all of the cities you visit outside of Akademeia are basically cut from the same mold as you wont be able to tell them apart from their brown or grey palette. With that said, outside of most of the cutscenes, which contain an awful drab aesthetic, Akademeias environment has a good amount of color, causing the visuals to stand out a bit more. Its when you get up and close you realize just how scaled this is from the PSP release.To make Type-0 HD look a little better than it actually is, Square Enix has added motion blur to the camera, which unfortunately hampers the experience. It works fine in battles because the focus is usually on a single enemy, but rotating the camera even just a little bit within a city is nauseating and headache inducing. Moreover the camera work and targeting system can cause problems in both combat situations and the open world. The voice acting is also stilted and awkwardly executed and it doesnt help that the script is so vague that you need to go look up what they meant in an in-game book. Theres no doubt that Final Fantasy Type-0 HD looks better than what was being offered on the PSP in Japan, but this will make you question why it wasnt a PlayStation Vita re-release instead. Closing Comments:Final Fantasy Type-0 HD contains highly enjoyable combat thats unfortunately limited by its design. The repetitive nature of how the missions are structured damages the overall experience, not to mention it isnt until roughly halfway through the campaign before a meaningful plot is established. That tied in with a cast thats spread too thin equates to a story that had incredible promise but ends up falling flat. Its apparent that this wasnt designed for the current generation consoles as, not only are the visuals lacking outside of the fourteen main protagonists, but many of the mechanics are constrained and not fully realized. How do you have a side quest system where you can only take one request at a time? It doesnt help that the added motion blur will pierce your eyes in the most painful way possible, and the vast majority of cities outside of Akademeia are carbon copies of one another. Final Fantasy Type-0 HD has some fantastic ideas implemented with restrictive elements that ultimately dont work with a console release.", "date": "March 16, 2015", "grade": 2.5}