{"name": "The Awakened Fate Ultimatum", "ref": "https://hardcoregamer.com/?post_type=post&p=137987", "text": "The Guided Fate Paradox launched to a divisive reception back in 2013. While it was an accessible roguelike with a silly, though often poignant story, it lacked the depth fans have come to associate with the genre. Its unfortunate then, that the games sequel, The Awakened Fate Ultimatum, would suffer from this same issue. But even so, does this follow-up manage to improve upon its predecessors formula that make it worth a look nevertheless? Lets find out.Right away, its plain to see that Ultimatums story is not only more effectively executed this time around, but seems to take itself a bit more seriously as well. Sure, the premise of a young male being chosen to be God is just as ridiculous as it was in the last game; but how the story is captured, leading up to that point and subsequently thereafter, is handled with less tongue-in-cheek. Theres still plenty of humor involved and zany characters to grow attached to, but they are few and far between now, and even when they are presented, its done so in a more controlled, corralled fashion. In fact, the narrative at large here seems to be more focused overall, and has a tighter delivery in its message, too. While Paradox had significant thematic meaning, Ultimatum is more overt in its commentary, requiring its players to dig less in order to see what the tale is actually trying to say, thereby making the significant parts of its story harder to miss due to not being buried in some kind of double-meaning exposition.To get more specific, the characters here, by and large, are well fleshed-out and come complete with diverse personalities. They have back-stories that are given ample screen time to play out, and their interactions with Shin  the main protagonist and God of the realm of Celestia  help to create a world thats worth investing in. Of course, all of this is accomplished by long dialogue segments. In truth, within minutes of the game opening, players will sit through an almost 40-minute conversation that set the stage for the events to come. Some might write this off as a non-issue on the grounds that every good story, especially in an RPG (and a JRPG), needs to set the groundwork for whats to transpire; but that would be unwise because, while we generally agree with that particular notion, it just doesnt apply here because the game never becomes less talk-y.Actually, playing the game reminded us a lot of Tears to Tiara II in that gameplay almost seems secondary, while extended talking sequences make the experience feel more visual novel-like than RPG. There were long stretches where we were just itching to get back into the fray, but had to wade through dozens upon dozens upon dozens of text-boxes. This is interesting especially because we are fans of visual novels  but to have the game billed as something other than that, gave us the impression we were going to get to play, check this out, an actual roleplaying game. Its a shame as well, thanks to gameplay that is pretty enjoyable. To have the experience stifled by boundless dialogue exchanges was frustrating, particularly so considering that this is no Final Fantasy. The story is fine, sure, but were not certain anyone is going to purchase The Awakened Fate Ultimatum looking for an award-winning tale. Thankfully, though, the localization is wonderful; excellent grammar, great characterizations and very few of those oh, you can tell that line was translated from another language because it doesnt sound natural at all instances. So kudos to NIS America for quality work that really helped bring to life the cast.What the game does well in this department, though, is load up on player choices. Throughout the game, Shin will be presented with scenarios that require him to respond in a way that builds his dark side, or light side. Since he has been resurrected (upon dying in the Human Realm) by the soul of an angel and demon, he shares both properties. How players decide dilemmas, and build their character through actual gameplay customization and combat, will dictate if they are a more demon- or angel-loving God. Whats best about this system is the choices actually have consequences. We assumed our decisions would have trivial influences on the story, but we were very wrong. While the choices are obvious in which side they correspond to, light or dark, their implications are not easy to predict, which is a breath of fresh air.So while the narrative aspects of Ultimatum are an enhancement over the last game, its gameplay feels like a step back in ways, despite still being fun. Paradox was a game focused on being an accessible dungeon crawler. To that degree, it succeeded, as its systems were easy to understand and its challenge was low, relatively speaking, however, Ultimatum takes those already dumb downed facets and streamlines them even further. Although this may sound like a fantastic design approach in making a pretty tough-nut-to-crack genre more appealing to broader audiences, it alienates its core fanbase in the process with derivative mechanics. In actuality, the gameplay here is just rather shallow. Its not bad  not by any means  just incomplete.The customization components feel superficial at best, allowing folks to really only upgrade a weapons attack and defense, and thats about it. There is the angel and demon customization, which lets players build their characters combat prowess through a combination of skills taken from demon- and angel-centric skill trees, but this doesnt feel overly interesting thanks to the attacks learned in both domains remaining relatively the same in effect. Really, the ability to build Shins dark and light side in combat only exists to allow players to adapt to combat situations that require them to assume their angel form to deal with demons, or their demon form to deal with corrupt angels. On the whole, the customization just never tries to be all that nuanced or complex; instead, it seems content with being something that has the depth of a roadside puddle. This will be a treat for those wanting to cut their teeth on the genre, no doubt  and to that extent, mission accomplished, Nippon Ichi. For everyone else (thats everyone else who is actually going to buy this game), there just wont be enough meat into which they can sink their teeth.At any rate, we found ourselves clawing for more to do in Ultimatum because, while its dungeon-delving and subsequent combat are a bit unfulfilling, its clear that Ultimatum has the makings of being great. Its balance is specifically interesting as its never too daunting, but not a cakewalk either. That being said, it will feel significantly easier than some of those other titles of this ilk that are out there, so hardened gamers may find themselves breezing through various segments of the adventure, but its not just a complete breeze. Even still, this normally wouldnt be too big of a hit to a game overall, but considering Ultimatum does not make up for its general lack of challenge in other important areas, makes for an experience that feels unsatisfying. Not to mention, the game is surprisingly short to boot. Considering the nature of roguelikes, we expected this one to take a while to plow through; alas, it was not meant to be, as this endeavor felt quite a bit shorter than even Paradox, which was already a somewhat bite-size adventure. When combined with the lack of challenge and depth, then, it is easy to see how this could be a problem for some.Where Ultimatum sets itself apart from the pack, though, is in its presentation. This is a lovely-looking game. The transition from classic sprite-work to more chibi-style 3D models has made the game visually appealing if for nothing else than for how the colors, animations, and models really pop amidst environments and the action. The use of the entire color palette is impressive too, certainly helping the vivacity of it all. That being said, characters are not as intricate as what was seen with Paradoxs sprites  and by and large this change up will undoubtedly leave some folks pining for the sprites of the last installment  but we found ourselves actually never wanting to go back after seeing the visuals in motion. Theyre just super clean, which can also be said about the interface as a whole.The games soundtrack is also worth mentioning. Although it wont join the ranks of Nier and some Final Fantasy installments as one of the great soundtracks of gaming, it nevertheless has a charm of its own. Its jams are often whimsical, but it also contain some of the more rock-anthem, adrenaline-pumping tracks associated with those big, dramatic crescendos weve come to expect from story-heavy games. Sadly the OST isnt extremely exhaustive, so players will hear the same tunes over and over again. Like the gameplay, the audio department merely lacks depth. Its not that whats there is bad, its just that whats there isnt enough to satiate.Closing Comments:The Awakened Fate Ultimatum can probably be best compared to Sorcery Saga in that its lacking in core ways, but remains incredibly accessible because of it. Its quite a bit different from The Guided Fate Paradox, as well; to that end, its foregone the use of sprites and watered down its system, but bolstered its story and placed a specific emphasis on player choice. The ardent NIS fans will probably play this regardless of its pitfalls, and we cant even fault them for that because The Awakened Fate Ultimatum is not an inherently broken game, and it has plenty of enjoyable elements. It is, however, an experience that leaves a bit desired. Newcomers looking to get into the roguelike genre for the first time though, will probably find this to be the ideal experience.", "date": "March 9, 2015", "grade": 3.5}