{"name": "Mystery of Neuschwanstein", "ref": "https://hardcoregamer.com/?post_type=post&p=137802", "text": "For whatever reason, much of the gaming community fails to recognize certain genres as legitimate games. Such titles include anything from Facebook, smartphones, and the entire realm of hidden object games. Because of this, most will never get around to playing Mystery of Neuschwanstein  but maybe they should. It breaks through some of those misconceptions targeted at the genre and provides a good deal of fun for a couple of hours with a variety of puzzles, intriguing plot developments, and some surprisingly good hidden object screens in comparison to other titles out there.First off, what the heck is Neuschwanstein? Neuschwanstein Castle is a real-life location in Bavaria, Germany that was built during the 19th century and still stands today. King Ludwig II was behind the castles creation and design, and used it as his personal retreat. Why is all this relevant? Simple: the game is directly related to the history of the 19th century and in particular Ludwig IIs reign at the time. This game directly references facts such as his mysterious death (the aforementioned Mystery of Neuschwanstein) as well as the many diary entries he wrote throughout the years.In fact, this is probably the one of those rare instances it makes sense for a game to be full of scattered diary pages to read. So how does the fact of Bavarias King translate into a fictional game? It all begins with investigative reporter Sarah Hamilton deciding to look into the conspiracies surrounding Neuschwanstein and Ludwig IIs death. Once there, she quickly meets up with a handful of folks who will be integral to solving the mystery, some people secretive, some helpful and others deceitful. Although the storyline does not go particularly into depth, it works well enough to get players interested, despite the fact that many of us Western folks have never even heard of Ludwig II before. Although not an educational game, youll likely leave a bit wiser. For those players who do have ties or reverence to Bolivia, it seems the title treats the subject matter with care. Thankfully theres a lack of total mysticism which tends to permeate hidden object games focused on historical people and places.Gameplay feels much like what youd get out of a point and click adventure game. You click around to visit different scenes from a first person perspective and get to examine various portions. Depending on your difficulty setting, clickable objects can display a gleam or not, sometimes resulting in a new item, a new diary entry, opening up a puzzle, or presenting a hidden object screen. Puzzles are fairly varied, ranging from lock-picking tasks to solving pictographic codes and hacking terminals. Apparently this journalist is a Jill of all trades. As for inventory puzzles, they also follow typical point and click adventure stylings. Every so often you might not recognize what to do, so fuss around with the inventory until something works.Hidden object portions of Mystery of Neuschwanstein are surprisingly not as prevalent as they are in many other games of this type. Each screen presents a visual of something that would obviously be super cluttered (messy desks, stuffed drawers, etc), but unlike many hidden object games which just place items in completely weird impossible locations, this one attempts to ensure every item you click is grounded in reality. Even so, it can be challenging to find some objects. This is because sometimes they are very small (ex: a needle) or are in the shadows of another item. On rare occasions, item names are problematic such as the term peasant used to refer to a chess pawn. You cant exactly find something if you dont even know what the name is telling you to find. Mind you, these instances were pretty rare, though.Mystery of Neuschwanstein has some gorgeous artwork as typical for the genre, and unlike many other titles, its decision to implement a historical site requires special care. I cant comment on how accurate it is, but the place certainly looks regal when required, and dark and damp when you enter more mysterious locations. One failure of the game is an apparent awkwardness to the English version. Voice actors sound quite good in English, but their lines sometimes feel stilted or grammatically incorrect. Its not a huge distraction but does lessen the overall impact.Closing Comments:If youre looking for a hidden object game to play, then Mystery of Neuschwanstein certainly fits the bill. Yes, there are definitely some issues with the translation as well as a few finicky puzzles, but the overall experience is enjoyable. Exploring a historical mystery through the lens of Sarah is unique, and provides a few twists along the way. Lovers of the hidden object realm might be disappointed by a lack of sequences, but in either case, Mystery of Neuschwanstein offers about 3 hours of gameplay with its unique historically-tinged tale and setting.", "date": "March 7, 2015", "grade": 3.0}