{"name": "Trash TV", "ref": "https://hardcoregamer.com/?post_type=post&p=136957", "text": "By 2015 its safe to say that most consumers have ditched their CRT TV sets in favor of a flat screen set or two. Trash TV asks players to imagine what happens when these televisions are kicked to the curb. In this game you actually assume the role of a lone CRT monitor who has unceremoniously been brought to a dump. Unfortunately, in the process it became separated from its remote and its your goal to search for it to reunite the trashed pair, but it wont be easy. This dump journey is filled with puzzles and enemies poised to make things challenging, and at times, a bit frustrating.Trash TV is best described as a 2D puzzle platformer. Yes, its a genre absolutely swarming with competition, but this game does stand out in a few ways. Outside of the unique theme, our CRT pal has access to an expanding collection of weapons, including a pistol, bow and arrow, and C4. Youll find one in each new wing of the dump site and occasionally use new weaponry to unlock a previously inaccessible location. How exactly all this equipment ended up in perfect working condition is never explained, but then again you must take the whole thing at face value. After all, this TV set is both alive and capable of inflicting violence against others!Visuals deserve special attention as they perfectly mesh with the games concepts. Although the screen doesnt project scanlines or fuzziness you do get a sort of rounded screen border to mimic how a CRT set looks. With that said, while 16:9 video ratios are available, it defaults to 4:3 to complete that retro feel. In an interesting design choice only the TV, enemies, and weapons have chunky pixel art while backdrops are straight-edged. For a dump, the place isnt that messy. Instead it projects much more of a depressingly bleak factory filled with different shades of grey.Puzzles themselves range from incredibly simple to a little tough, with a few bits of possible glitch-related issues thrown in. After you get over the initial hump of thinking within Trash TVs constraints, most areas become an absolute breeze. Placing objects on buttons, waiting for proper timing, and activating pathways may not be the most mechanically demanding tasks but theyre still enjoyable. Platforming itself seems fairly precise. The biggest issue youre likely to run into is when timing-based explosive jumps come into play. It can be annoying to perfectly align yourself and then jump to be boosted at just the right angle. Luckily, this component comes later in the game meaning theres not a ton of times players are forced to use it.Enemies are a fairly rare occurrence, and when they do crop up you simply need to fire a few rounds in their direction to be rid of the distraction. Although it feels like theres a bit of buildup to a boss, there are no such special fights to be found. Theres one pretty neat boss-esque sequence, though. Although your little tube TV dies easily (squished by falling blocks, melted by hot lava, etc), an incredibly friendly auto-save system ensures death is hardly an issue. Once in a level you cant save, though, and must finish it before any relevant unlocks are applied.On one occasion it seemed my game glitched out, allowing me to walk in the air for a bit before finally falling back down. There were a few other issues as well, such as puzzles resetting (or spontaneously completing themselves) when using the rewind function, but none of these were huge problems, at least. Its worth mentioning that there is no hint system included, so that if you do find yourself stumped momentarily simply try working with the latest weapon youve received. The game utilizes an Ikea-esque tutorial system which offers a small video clip to explain functions of new weaponry.There are not a ton of areas to explore in all, but each tends to focus on utilizing a specific weapon in a variety of ways. It basically feels like Trash TV is laying out all the basics on a per stage basis to combine them all in one final gauntlet of tasks. However, such an event never really comes to fruition. Kicking butt through every section of the dump is a good enough time but all that learning seems for naught  well, unless the post-credit statement of Stay Tuned for Season 2! means that a planned next episode or DLC chapter will begin where we left off.Closing Comments:Trash TV is definitely a game with unique intentions, but the biggest dampener on the experience is that it only lasts around three hours. With puzzles that are mostly a breeze, it also leaves one wanting to test their skills at some point  but such a moment never materializes. Its possible a new episode will fix this, but thats little solace to people who have Trash TV right now. The game provides a brief, enjoyable taste of something that deserved to be fleshed out further rather than cut short.", "date": "March 2, 2015", "grade": 3.0}