{"name": "Dynasty Warriors 8: Empires", "ref": "https://hardcoregamer.com/?post_type=post&p=136745", "text": "While some may not know it, Dynasty Warriors is essentially an annual franchise, especially as of late with the eighth installment coming out in 2013 and Xtreme Legends following in 2014. This is up to standards with the hackn slash series, but theres one game that needs to be released before Omega Force can begin their new journey on the next Dynasty Warriors mainline title: Empires. Empires is drastically different from the other two games, not in terms of the repetitively addicting gameplay, as the combat remains more or less the same, but in how the campaign is structured. While the Dynasty Warriors games have been criticized for reusing assets and features, all the while making only small adjustments over each release, Empires may very well be the defining example of that.Mechanically speaking, Dynasty Warriors 8: Empires is basically what weve come to expect from the series, at least when looking at combat. Players will find themselves running through thousands of enemies within a matter of minutes, making us wonder about the types of slaughters that occurred in ancient China. Theres a large lineup of characters to choose from, each pulled out of the different kingdoms and are scattered between 184 and 249 AD. The character selection is so massive that one feature is still lacking: a search function. How characters are organized are based on the Dynasty they fight for and then are listed based on what I believe to be rank, so it becomes troublesome to find someone who you know their name, but dont know what their allegiance is. Granted, I probably fall under a very select group, but considering how dedicated the Dynasty Warriors fanbase is, this could be a great addition next time around.Unfortunately, while theres a huge array of characters pulled from Dynasty Warriors 8: Xtreme Legends, theres only one new individual. This is Xun Yu, a member under the Cao Wei Dynasty and is the handsome individual who appears on the box art. Making his playable debut, Xun Yu actually adds an enjoyable new set of moves to Empires. His primary weapon is that of a staff, one that he uses to extend the growth of an AOE attack at the end of a specific combo, and unleashes hell once it becomes large enough. Hes a solid addition and is perfect for crowd control during hectic fights, but I do wish there was more than just him added to the cast. While the campaign is structured differently from other games in the series, it just highlights how little effort Omega Force has put into make this a marquee release.As mentioned before, this isnt a game primarily for traditional Dynasty Warriors fans. While it has all the trappings of what players love, its the Empire Mode that makes this a far more tactical experience. Its about strategizing your position in China depending on which of the six time periods is chosen, ranging from the mandatory Yellow Turban Rebellion to Coa Shaungs coup dtat, and what kingdom is being fought for. All choices have consequences as this is more about building upon a dynasty and participating in the various historical events. Going into battle ill prepared can reduce resources and man power, and wasting time making weak alliances with other kingdoms can be costly in the long run. The problem is that theres very little that has changed since the last Empires game, with a slightly more fleshed out marriage system and new stratagems. Players familiar with past games and their politics simulator will feel right at home here, but maybe a little too much as its hard to parse the initial differences.The Empire Mode is also not recommended for newcomers, which means neither is Dynasty Warriors 8: Empires as a whole. Theres virtually no instructions when starting up the campaign as it throws players right into the midst of a war council to make some dramatic choices for the kingdom. There are some blurbs that pop up when going through the many menus at the beginning of the campaign, and theres a confusingly written tutorial tucked into one of the option menus, but this is definitely something newcomers to the franchise will have a hard time adjusting to at first. Its for the most hardcore of hardcore fans, making all the right choices for the empire, while at the same time pushing forward into continental dominance. It might be a bit daunting to even those who have played a Dynasty Warriors game before, but not an Empires title. Other than the main Empire Mode, theres some of your typical offerings, such as Free Mode, which is basically self-regulated fantasy battles of the players choosing, Edit Mode, which allows the creation of personalized characters, and Online Mode which brings in the character creations to play with others around the internet. Theres very little here that will convince fans to upgrade.From a presentation standpoint, Dynasty Warriors 8: Empires doesnt look any better than its Xtreme Legends predecessor. Assets are reused to an alarming degree, and while the historic figures contain strikingly more detailed character model, the environments are still as bland and lifeless as ever. Sure, there can be tens, if not a hundred enemies on screen at once, but not only are they carbon copies of one another, but when special musou attacks go off, the frame rate can slow down to a crawl. In addition, the user interface, while retaining its vertical similarities to past games, is poorly designed. Its not that its an unusable system, but the static, slightly rotating columns on the left side of the screen look cheaply made and theres a lot of empty, underutilized space. While Dynasty Warriors 8: Empires isnt particularly a visual eyesore, its simply nothing special and fails to impress.Closing Comments:Dynasty Warriors 8: Empires has all the entertaining, albeit repetitive combat the series is known for, but lacks the features to back it up. While this is par for the course for an Empires game, its still hard to recommend as little has changed over Dynasty Warriors 7: Empires outside of some insignificant updates to the highly strategic politics that go on outside of battle. Its a matter of refusing to think outside of the box, not in terms of the gameplay mechanics, but in terms of features and variety, offering a seemingly mirrored product to a new generation of console adopters. With a country domination simulator thats not readily accessible to newcomers, and a user interface thats straight out of the 90s, theres just not enough here to warrant a recommendation. Some may be content with more of the same, but theres just simply not a lot here to carry the series forward.", "date": "February 27, 2015", "grade": 3.0}