{"name": "Pokmon Shuffle", "ref": "https://hardcoregamer.com/?post_type=post&p=136077", "text": "While many games in the Pokmon series center around battling, there have been some that take the approach of brains over brawn. There have been a couple of puzzle games in the franchise over the years and theyve always been a fun, casual ways to enjoy your favorite pocket monsters. Pokmon Shuffle is the latest in the line and includes a few features from the franchises most recent generations.It starts out with a few tutorial levels to get to know the gameplay. Each level has a Pokmon to battle using your team. Its actually fairly simple to play as you just need to match three Pokmon tiles either vertically or horizontally. Every time the tiles disappear on the bottom screen, they deal damage to a Pokmon on the top screen. If you do it enough times youll beat the level and after defeating the Pokmon, you get the chance of catching it. On top of that, similar to other Pokmon games, each Pokmon used in the battle gains experience points to eventually level up. Youll get the hang of Pokmon Shuffle in no time but its not just about matching three in a row.It takes some strategy to complete many of the levels. Lining up four or five tiles will give you more points and deal more damage. Experts of the series will notice the Type Weaknesses are relevant even in this puzzle game and combining Pokmon with these advantages, along with creating chains of more than three matches, will earn the highest scores. Many Pokmon exist with two types, but in Pokmon Shuffle, theyve made it a bit easier by giving them a primary type instead. A Pokmon like Sableye in another game is Dark/Ghost but in Shuffle its just Dark, so it does take a different strategic approach. To make it a bit more complicated, each Pokmon you face could try and fight back. They do so by changing some your tiles to different ones or forming blocks and barriers that you must break through. Some levels may take you a few tries, especially when going for the high scores.Three kinds of levels exist in Pokmon Shuffle: main, expert and special. Main means youre trying to defeat the Pokmon in a given amount of turns, with fewer turns to better your chances of capturing it. This is where youll spend the bulk of your time playing as gaining experience and catching most of your team members will occur along themed paths in main mode. In expert, the levels are timed instead, sometimes only giving you a minute, and feature legendary or fully evolved Pokmon. This is more of a challenge, so its best if you have enough high-level Pokmon before wasting time on them. Lastly, there are special levels which could have a variety of Pokmon to find, be it legendary or rare, and youre given a certain amount of turns on these ones, as well. Some special levels may only appear for a day while others last for weeks, so if youre trying to catch them all its best to check-in often.Now, with all that said, in comes some of the negative points. Pokmon Shuffle only allows you to play a few levels at a time as hearts are used as currency. After trying one, youll have to wait half an hour for a heart to regenerate, so if you use up five, youre waiting hours for them to all to come back. Theres the option of spending a gem to replenish hearts or spend real money on them. Microtransactions are always bothersome but at least this is the kind of game you can casually play and not have to constantly feed money into. If levels are frustrating, you can spend coins on little power-ups that could help, but theres no guarantee though since puzzles are randomly laid out. Theres also literally nothing else to do in the game when youre waiting except read about some of the Pokmon youve already caught, which shouldnt take long anyway. Its a huge disappointment to have to wait so long between turns, but its free. I would not recommend taking this game as your only source of entertainment on a trip. Youll be bored before getting your seat belt on.Closing Comments:Pokmon Shuffle is a very cute game with enjoyable music and adorable designs. Bringing Mega Evolutions to the scene as well as Type Weaknesses makes it feel more like Pokmon and less like a puzzle game. Its a huge bummer waiting for a turn, but you cant beat the price of free. Ive found myself becoming more and more addicted and playing every couple of hours. Its fun and challenging enough to keep Pokmon and puzzle fans entertained.", "date": "February 27, 2015", "grade": 3.5}