{"name": "Monark", "ref": "https://hardcoregamer.com/?post_type=post&p=418457", "text": "If video games are a reflection of reality educational institutions are much more exciting in Japan than in America. Persona and Blue Reflection are just some examples every day students getting to travel into a world beyond our own do some daemon fighting while most of us considered a trip to the box factory an exciting fieldtrip. Monark is the latest game to feature and academy setting where the student extracurricular activities include meddling in the affairs of daemons through some interdimensional travel. Though in Monark ego seems to be the real entity that needs to be conquered.The player begins as a second year student at the Shin Mikado Academy. He recently went to the Otherworld with his sister Chiyo where he encountered a daemon who granted him a power called the Authority of Vanity. Unfortunately, one of the side effects of going to the Otherworld and becoming a Pactbearer (at least in the protagonists case) is amnesia so he has no idea whats going on. Back in the real world things arent running so smoothly, as Shin Mikado Academy is surrounded by a mysterious barrier while a mist that leads to madness engulfs several of the floors of academic buildings. Oh, and a bunch of students keep ending up dead.Soon after the realization he remembers nothing, the protagonist ends up meeting some of the characters who will be involved his adventures. The president of the True Student Council, Nozomi Hinata, is one of the first people he meets and first initial party member member. The player ends up meeting other characters as they explore more of Shin Mikado Academy, which end up feeling like familiar tropes more than fully actualized characters. We get the incredibly intelligent but socially clueless character, the one that goes on about being a bad boy rebel tough guy but still joins forces to help and the one that hates Pactbearers but decides to join up the protagonist and his party. The different personalities can lead to some entertaining banter but the characters are less memorable as individuals but more so as specific JRPG character archetypes. Vanitas is one of the more entertaining characters. He is the a stuffed black rabbit that speaks in rhyme, alive like the Velveteen Rabbit but covered in grime.One of the more interesting approaches Monark takes to character development is the emphasis on each characters Ego and the different aspects of their personality. The Ego is divided into different attributes that are linked to each of the seven deadly sins: Lust, Pride, Wrath, Sloth, Gluttony, Envy and Greed. These attributes can be raised in battle, but its more interesting when the player has to to take a psychology test. Sometimes a student NPC will ask the player a multiple choice question and their answer will determine which attribute will raise or Vanitas will give a more involved series of questions where the answers will provide some sort of insight into the personality of the protagonist. The question of how accurate this analysis is can be debated but it is a nice take on character development.Monark takes place in a two different worlds, the real word and the Otherworld which is home to daemons, which can be entered via cellphone in appropriate locations where the daemonic energy strong or in proximity to Vanitas. The Otherworld is where all the battle are fought when the player isnt exploring Shin Mikado Academy and where enemy Pactbearers have their Authorities destroyed. One thing that was particularly satisfying about the sequences where the player traveled here to battle an enemy is that it would give a window into their psyche, sometimes humanizing them in a sympathetic light. It didnt absolve their evil deeds or make you regret going into battle against them but did offer some understanding as to how trauma may have created the monster you had to slay.Mist is one of the hazards that seeps into the Academy from the Otherworld and has a myriad of ill effects on students exposed to it. Phantom pains, passing out, losing their minds are some of the afflictions that are observed. Pactbearers are more resistant to Mist than regular students but arent immune. Too much time spent in Mist filled environments can increase a characters madness level which can happen both during real world exploration and during battle. While the effects of maxing out the mad meter vary in the different settings, the end result is always death so its best to keep an eye on it.Most of Monark is spent exploring the school. A lot of missions and story arcs are confined to a single building where clearing a floor will lead to a confrontation with a daemon in the Otherworld. A lot of these segments will be in a mist afflicted area where the Mist will serve as an artificial time limit, though if it looks like the character will succumb to madness they can take mind stabilizers or return to Dr. Kakeru. Progressing through these areas generally requires some puzzle solving, and while these puzzles are far from being brain busters theyre just clever enough where they can be interesting and satisfying. Using environmental clues to figure out locker combinations or logging into someone elses computer gives a puzzle solving component that feels less forced than it often can in other games.The battle system of Monark is one of its highlights. The turn based system takes place on a grid where proximity and unit placement makes a difference. The party starts small but eventually there can be a total of six characters being controlled in the battlefield. Each character can learn different skills but using some of the more powerful attacks have hidden costs like using a characters health points. Characters can also defer their turn to let another character go a second time. This can be advantageous based on positioning where they can pull off another attack or use the turn to heal but taking the deferment comes at the cost of an increase to their mad meter. Back attacks are preferable since enemies cant counter them, and attacking an enemy in close enough proximity to your allies can cause a chain reaction of attacks that can make short work of an opponent. Unfortunately that strategy works both and if the protagonist is by several enemies when their turn to attack comes that chain reaction can lead to a quick game over. Combat can be challenging but learning how to work the battle system can lead to some feelings of satisfaction when victory is achieved.Monarks characters may feel like trope filled archetypes and the amnesiac protagonist isnt exactly new ground but the use of Ego for character development is one of the more interesting approaches to character development. There are some obvious parallels to Persona, the more obvious one being high school kids using modern technology to get sucked into a different world but since the development team includes some Shin Megami Tensei alums that shouldnt be too surprising. While strategy in battle can overcome stats the character stats do need to be high enough to survive the battle so there is some level grinding required. Whats nice is there arent random encounters interrupting exploration but in order to grind the player will need to use their phone to call the number for previous battles to grind out for skill points to raise levels which can become very tedious. The music in in Monark is one of the games stronger attributes where it blends influences from jazz, metal and pop into a varied soundtrack and complements each scenario. The graphics on the other hand might have some nice stylistic choices but on a technical level it could pass for an HD remaster of a PlayStation 3 game.Closing Comments:Monark weaves an engaging story even though it may rely on tropes and archetypes to do so. While characters and certain themes may feel familiar from playing similar games there ego centric method of character development helps carve a unique identity for Monark. The puzzles and exploration arent very difficult but occur in a way that feels organic within the story. The tactical turn based battles do offer a challenge but nothing that cant be overcome through learning the system and properly strategizing. Level grinding can become tedious quickly and can disrupt the overall pacing. In spite this, Monark is a very enjoyable RPG that offers satisfying combat along with a compelling story.", "date": "February 16, 2022", "grade": 3.5}