{"name": "There Came an Echo", "ref": "https://hardcoregamer.com/?post_type=post&p=136011", "text": "I can guide you, but you must do exactly as I say.Everyone knows the scene in The Matrix from which this quote originates. Neo gets a package containing a phone, Lawrence Fishburne (I mean Morpheus) dials him up, and a healthy dose of tension is served to the audience. Now, imagine if you will, you were playing the role of Morpheus. What would it be like to guide someone else through a potentially disastrous situation using only your voice? This question serves as the elevator pitch for Iridium Studios There Came an Echo, one of the most unique titles to arise in quite some time. Were currently residing in the strangest video game era, a time where weird triumphs over normalcy. Fresh ideas are critically rewarded, whereas iterative blandness seems to finally be getting its fair share of disdain. When every cylinder fires, There Came an Echo stands out as a conceptually novel example of what video games have the potential to be.Players take the role of Sam, a faceless voice tasked with helping the mysterious, Morpheus-like Val in guiding a lovable band of vagabonds. If you think its bizarre that the player is thrown inside of the fourth wall and given a role in the cast, youre right. Its strange, unique and one of There Came an Echos coolest story elements. The four-to-five hour adventure begins with Val telling Corrin, the anonymous developer of an unbreakable encryption software known as Radial Lock, that he needs to escape a number of pursuers heading to his office (sound familiar?). This engaging, but occasionally convoluted, story continues to spiral to levels that seem initially unreachable. Corrin teams up with the money-hungry mercenary Miranda, the nineteen-year-old sociopath Grace, and the mysterious (possibly) British (potential) hacker Syll. While some of the teams dialogue can occasionally suffer from split-second delays and an slight tinge of corniness, its hard not to like this unique cast of characters, headed up by the ever-talented Wil Wheaton and Laura Bailey. Sure, its easy to poke tiny holes in certain moments of each cast members performance, but for a title whose story is dependent on an endearing cast, There Came an Echo is largely successful. There Came an Echos narrative feels like the lovechild of Transistor and Metal Gear Solid 2. Its the perfect example of why a video game storyline doesnt necessarily have to be fifteen hours long to be good. Its borderline impossible to not spoil anything, as Iridium Studios crafted a spiral-like story in which every beat is dependent on those that preceded it. Basically, Corrins Radial Lock technology encrypts a great deal of the secrets behind a godlike technology that has the power to create echoes, or beat-for-beat copies of a human being. The evil Heather Farrick desperately wants this technology for her own selfish reasons, so she sets her armies out to obtain what she needs from whatever sources become available (including Corrin himself). All hell breaks loose in the final ninety minutes, and the player is left to pick their jaw up off of the floor. The Metal Gear Solid 2 comparison is especially apt  There Came an Echo gets very, very weird. There are moments where youll ask yourself, What the hell is going on here? Youll find yourself laughing, scratching your head, and stepping back for a minute to try and process exactly whats going on. There Came an Echo doesnt contain the most logical story of all time, nor does it try to, but its bizarre in the best way. Say what you will about whether or not this narrative makes complete and total sense, but you cant deny that its pretty damn cool.Yes, There Came an Echo sports and intriguing combination of lore, narrative design, and character development, but its gameplay is what stands out from the pack. The world is clamoring for novel experiences, and controlling a RTS title using your voice is certainly more unique than whatever the tedious titles flooding the headlines have to offer. A number of easy-to-remember commands are your buttons, your mind is the controller, and your voice is the connection between the two. Its worth noting that Iridium Studios recommends owning a headset microphone to take advantage of this feature, and you certainly will considering the clunky, wheel-based traditional controls. Your roommates and families will probably hate you after hearing Miranda to Alpha 5 for the ninety-seventh time, but having characters respond to vocal commands almost every time is badassery at its finest. The defining gameplay sequence (heh, Iridium Studios pun) in There Came an Echo tasks players with defending a base using a combination of lane-based turrets, two snipers, and mines. While the biggest factor in voice recognition is, well, the recognition, creating a sense of rhythm leads to a level of immersion that droves of games simply cannot touch. Waves of enemies flood the screen for six minutes, and its up to the player to use all of the tools at his or her disposal to destroy every one of them in a fluid manner. Turret 2 to Lane 3. Mine 18. Syll Target 2. Turret 1 to Lane 2. Were so used to giving commands through our controllers, keyboards, and mice that using our voice is like riding a bike for the first time. Its thrilling, new, and interesting, and its hard not to find yourself engrossed in the action when everything is firing on all cylinders. This isnt to say that everything is perfect in There Came an Echo from a voice-recognition standpoint. Players, especially those with deep voices prone to mumbling like myself, might find themselves repeating a certain command to get it to register. Thankfully, being able to stack commands by ending a series in on my mark, will allow players to rapidly execute a number of actions simultaneously. Combine this technique with the War Room, a wave-based training arena that allows players to practice their commands, and anyone can become a master of voice commands. Of course, if youre even mildly interested in There Came an Echos weird story, you definitely wont be exiting mid-session to hone your techniques in the War Room, but its the thought that counts, right?Setting aside its characters, story, gameplay and structure, There Came an Echos best feature might wind up being its outstanding original soundtrack. Easily the best OST the gaming world has seen since Transistor (sorry Destiny) this Big Giant Circles and Ronald Jenkees composition makes the story. Every pivotal moment seems to be accompanied by a piece of captivating music, none more chilling than the spectacular theme song. The video games are art argument has been driven into the ground, jumped the shark, and is now a dead horse. The blend of aural mastery, colorful art-design and general oddity, however, make There Came an Echo a nearly unrivaled sensory experience. Whenever the topic of game-breaking bugs arises in a review, it usually spells doom for the game in question. After all, if a players progress is stalled permanently, theres no hope for it to be good, correct? After finding a point in There Came an Echos eighth mission where our characters wouldnt advance to the final room in a three-room sequence, however, Iridium Studios completely corrected the problem within three hours. This took place in the middle of the night, no less. This prompt fix, and the fact that we encountered no other major issues, is a surefire sign that There Came an Echo will be properly supported after launch. It wouldnt be shocking to see its occasionally spotty, but largely excellent, voice recognition software improved upon in the future. Of course, rating a game based on potential corrections to its flaws creates a whole mess of problems, but let the record state that There Came an Echo was developed by a team thats clearly committed to squashing problems as soon as theyre discovered. This is an era of disappointment, so being able to report that a team is dedicated to creating the best experience that their abilities allow them to isnt just refreshing, its actually mildly shocking. Closing Comments:There Came an Echo is the equivalent of walking through a desert for days before receiving an ice cream cone. Yes, water is definitely what this hypothetical traveler desired, but, hell, if that ice cream cone isnt wonderful. Iridium Studios accomplished three important things with this strange, voice-controlled sci-fi adventure. First, it showed the gaming landscape how to successfully tell a story within a five-hour package. Second, There Came an Echo is a shining example of how non-traditional control schemes can appeal to hardcore gamers. Finally, and most importantly, Iridium Studios has demonstrated how to properly create something fresh and exciting that encapsulates everything that the indie scene is capable of. Sure, its story can get a bit incoherent, its non-voice controls are awkward, and there are moments of spotty voice-recognition, but the good greatly outweighs what little bad there is. If youve found yourself bored with all of the monotony and nonsense surrounding recent titles, youd be doing yourself an injustice not giving There Came an Echo a shot.", "date": "February 23, 2015", "grade": 4.0}