{"name": "Bayonetta Origins: Cereza and the Lost Demon", "ref": "https://hardcoregamer.com/?post_type=post&p=438900", "text": "The gun-toting witch known as Bayonetta has established herself as a tough-as-nails action protagonist across her three M-rated games. Hearing the first part of the title of Bayonetta Origins: Cereza and the Lost Demon suggests that this will be an origin story thats filled with the expected amounts of harsh language, suggestive imagery and over-the-top gratuitous violence. A quick glance at Metacritic indicates that this is a working formula that made the Bayonetta games as successful as they are. When presented with images from the newest game, confusion is a suitable reaction as this is clearly not that type of origin story.The change in character is immediately noticeable as her characterization in Bayonetta Origins is that of a young girl, and as a younger witch shes far more timid, lacking the wit and confidence fans are used to seeing in her previous games. Its an odd direction to take a game with such an iconic character, who in this adventure simply goes by Cereza.With her mother imprisoned due to her forbidden love affair, Cereza is under the tutelage of Morgana, learning the arts of the umbra witch. Morgana is a harsh instructor, but Cereza knows its because she wants whats best for her and Cereza is so hungry for her approval. Cerezas other companion is the demon Cheshire, who is bound to the her in the form of Cerezas stuffed cat. The stuffed animal companion combined with the art style and storybook presentation suggest this may be meant for a younger audience than the typical Bayonetta fan. Like a demonic Calvin and Hobbes, Cheshire is Cerezas travel companion throughout and she couldnt get far without the plushies assistance. When Cheshire is summoned out of his toy form, the control scheme borrows a page from Brothers: A Tale of Two Sons where Cereza is controlled with the left Joy-Con and Cheshire with the right, which ends up being an intuitive system. Cereza needs to get where shes going and Cheshire can use a variety of elemental powers to assist her in getting there.As if things werent already drastically different from the original trilogy Bayonetta, Cereza is completely lacking in her traditional combat abilities. Her primary action in any sort of battle situation is to use Thorn Bind to trap and enemy is place. This is where Cheshire gets his paws dirty as its the stuffed cat that dishes out the actual attacks. For a feline plushie Cheshire has a variety of attacks at his disposal. Cheshire cannot die in battle but may have his powers depleted. When this happens Cereza needs to hug him in order to get him back in the fighting spirit. It might not be to the degree that fans might expect from a Bayonetta title, but having Cheshire dispatch the enemies is still a satisfying activity, largely due to the spectacular animation quality. Bayonetta Origins: Cereza and the Lost Demon is a strange game, mainly in that it exists. From the gameplay mechanics to overall presentation it ignores all aspects that made the previous Baynoetta games successful. In fact, it wouldnt be unreasonable for Baynoetta fans to look at the screenshots, see the T rating and decide they want nothing to do with the this particular title. This would be a mistake, as while Bayonetta Origins casts all expectation to the wind, the game itself is quite good. It does take a few hours for the story to take off, during the time there shows no indication save for the protagonist how this connects to Bayonetta, but as things progress the watercolor story book presentation is subverted by darkness that is befitting the umbra witch. What seemingly begins as a storybook for children ends up becoming a tale that brings with it tremendous emotional impact, reminding everyone how story books shouldnt be judged by their cover.Previous Bayonetta games put a lot of emphasis on combat and while that does occur here, theres a much greater focus on puzzle solving. This requires using Cerezas magic with Cheshires elemental abilities in tandem with each other. Rewiring ones brain to simultaneously control two characters can take some getting used to, but the result is satisfying battles once the player gets acclimated. The puzzles themselves generally arent difficult and even so there are plenty of customizable settings to make them even easy, another suggestion that this game is targeted to players who might be too young to be playing the mainline Bayonetta games. Closing Comments:Bayonetta Origins: Cereza and the Lost Demons ignores everything that fans are looking for in a Bayonetta game to deliver a charming and deeply-emotional experience. Players who are only interested in the traditional Bayonetta experience might want to skip this, but those who are willing to see the familiar character in a completely different context will be rewarded for their open mindedness. The puzzle solving and joint combat from controlling Cereza and Cheshire together ends up leading to enjoyable and satisfying combat even if the challenge is on the lower end. The beautiful watercolor-inspired design and storybook presentation does a perfect job of setting the stage for the emotional tale of Cerezas origins. It might not be what fans were hoping for, but sometimes great games are created by taking things in a completely new direction.", "date": "March 22, 2023", "grade": 4.0}