{"name": "Overture", "ref": "https://hardcoregamer.com/?post_type=post&p=133711", "text": "A while ago we had a chance to preview a build of Overture by Black Shell Games, the same people that gave us the rather cool ASCII turn-based epic, Sanctuary RPG: Classic and the new and improved Sanctuary RPG: Black Edition. We stated in our preview that Overture will hand your butt to you, and this rings even more true in the final release. Overture is one tough cookie, and while we had some fighting chance when we were toying around with the demo (even making it past the first boss in our first attempt), the finished game turns the challenge up a few notches and will make clearing the first area an uphill battle.Overture is a rogue-like action RPG with simple control and mechanics, but a whole lot happening around it. It claims to take inspiration from The Legend of Zelda (at least the visuals do), gameplay sensibilities from PC loot-fests like Diablo and the sheer madness of Binding of Isaac. Overture immediately thrusts you into a random floor that is just swarming with enemies, and chances are your first you attempts will end in an almost instantaneous defeat, but thats okay, because Overture is all about getting right back on the saddle with more experience and a stronger character.The controls are simple; you navigate with keys and use mouse clicks to attack, equip items and to use magic/specials. An interesting hook involves the mouse cursor, which dictates attack direction. The controls can feel rather strange at first, but after a while the intuition becomes clear. This is especially apparent with the running mechanic, where your character has to run towards the mouse cursor to pick up enough speed to evade enemies. This mechanic is so important that the game flashes a reminder before the start of each playthrough.Overture in its final form is much more difficult than its already challenging demo. The huge selection of enemies are meaner and more relentless (especially those darn red minotaurs with pickaxes), and a number of bosses and mini-bosses guarding exits that can wipe you out in moments (which is why its important to practice running). The navigation assist was quite apparent in the demo, but it only occasionally pops up in the final release, when it feels like youve tumbled around enough and need a helping hand locating the exit. As often as youll taste defeat in Overture, you are still able to retain gold which can be used to upgrade characters and make the subsequent playthrough a tad easier. In that sense, there is always a feeling of progress being made which can encourage players to keep jumping back in upon facing defeat.Being a rogue-like, Overture has a lot of chaos going about. Youre thrown into any given dungeon floor of various difficulty types, even floors where enemies are far stronger than your current level. But thats part of the appeal, as you get to play around with a whole bunch of weapons and equipment, and gain an upper-hand each time you level up. Another cool thing is being able to rescue NPCs that can join your party and provide a useful assist, though not for long as the wave of enemies get bigger and stronger with each passing moment. Overture is a game meant to be enjoyed in quick bursts, and essentially has that coin-grabbing arcade cabinet appeal of encouraging you to perform better than before. The fact the game keeps track of the stats and numbers of your best run helps you progressively improve your skills.That being said, as fun as Overture can be, it doesnt necessarily have that draw to keep you hooked. Its a low budget production for sure, as evident by its humble asking price on Steam, and ultimately Overture feels like a dime a dozen distraction that the digital platform has become known for. The animations are minimalist, and more importantly the level design is sparse and bland, youre essentially thrown into vast empty spaces cluttered with enemies. Still, there is still a fair bit of gameplay variety given the distinguishable character classes. Its really one of those games that does the bare minimum of a fun and simple game, and doesnt try to reach beyond that apart from its many character classes. If anything, Sanctuary RPG still remains the definitive Black Shell Games experience, and a much better showcase of what the developers can accomplish.If there is one aspect of Overture that outshines everything else about the package, its the soundtrack. Rafael Langoni Smith, who composed the intoxicating score of Sanctuary RPG and a number of other projects, gives Overture a catchy and chiptune savvy soundtrack. Its the kind of music that almost immediately makes you contemplate purchasing from BandCamp. Rafael is the up and coming composer to keep an eye on for sure, his work thus far has been nothing short of great.Whats cool about Overture is that not only is it one of the cheaper Steam releases, but its also one that is almost constantly updated with fixes and new content. A good example was the irritating screen shake every time your character took damage, a visual touch that can now be toggled thanks to a recent update. This type of reactive development certainly helps Overture and the reputation of its developer, Black Shell Games.Closing Comments:Overture has a lot of cool things going for it, from its pick-up and play gameplay to its catchy chiptune music. At the end of the day, however, Overture feels too by the books to leave a lasting impression. It takes inspiration from games like Diablo and Binding of Isaac, games that youd probably want to play instead. Overture doesnt try to achieve beyond its influences, instead serving as an inexpensive distraction that wont last long despite a nice selection of characters. If you have not been acquainted with Black Shell Games, then Sanctuary RPG is what you want to play first, a game that not only pays homage to the past, but also successfully achieves beyond thatwhich is something that Overture doesnt quite do.", "date": "February 9, 2015", "grade": 3.5}