{"name": "Zombeer", "ref": "https://hardcoregamer.com/?post_type=post&p=132303", "text": "Its probably best to get this out of the way quick: Zombeer is a terrible game. The humor is unfunny, the action is easy despite the main weapon being weak and unsatisfying, and you spend more time walking to the next encounter than you do fighting it. On the plus side, its so short that morbid curiosity will take you all the way to its overly-optimistic to be continued ending, and sometimes a train wreck is pretty entertaining.Zombeer attempts to mix zombies and frat-house humor and manages to fail at both. You are K, a college student waking up in a bar after getting falling-down drunk, with a bite on his arm and an angry message from his girlfriend. Theres no mirrors around so no way to tell if his friends tattooed a penis on his forehead, but seeing as the first weapon K gets is a pink dildo it seems like the kind of thing Zombeer would find funny. Once K gets his improvised melee weapon the zombies start attacking, and a couple good swings takes them down to constant cries of Headshot!. Theres no impact from landing a hit, but seeing as eventually the zombies heads disappear it seems likely some form of contact was made.While the zombies are inconvenient, theres another mildly annoying issue plaguing K, and thats his impending zombification. Theres a meter at the bottom of the screen that ranges from permanent zombie to black-out drunk, and you need to keep it within reasonable boundaries to avoid Game Over. You do this by drinking Zombeer, which gets you a bit more drunk and a bit less zombie. Too little and K becomes a shambling undead, although he can survive like that for a brief period that has the benefit of the zombies seeing him as one of their own and not attacking. Too much beer and K starts staggering about for the brief period it takes to sober up a little. Really overdo either state, or take too much damage (with no health indicator to tell how badly youve been hit) and its back to the most recent checkpoint. Between game start and finish youd probably see the Continue screen a small handful of times, but seeing as zombies only attack three to four at a time its not a pressing concern. As Zombeer continues you get three more weapons, but the wimpy little nailgun is going to cover 95% of the game. The Octogun (a gun with an octopus on it) is a shotgun with a maximum ammo capacity of six bullets, and the exploding beers have a little too much potential for splash damage in the cramped corridors of Zombeers Mianus (ha-ha, gettit!?) University. The final confrontation in an cordoned-off section of the football field ends up being the only satisfying encounter of the game, simply because theres room to move, enough ammo to use the more powerful weapons, and (finally!) a decent handful of zombies to use your weapons on.And then its over, with an overly-optimistic To Be Continued screen. The developer commentary message from just before the final area mentions the lack of budget, and its easy to see that Zombeer simply didnt have the resources to be anything more than a rough sketch of the game it should have been. No ending, terrible pacing, a cut-scene introducing the Octogun several areas after youve found it (and a developer commentary mentioning this), an unused game mechanic in the zombies not attacking when youre zombified, and a complete lack of anything resembling polish point to a game that was kicked out the door rather than actually finished.Even the references to other games and movies trail off after a few levels. Zombeer is what happens when a developer is forced to take what theyve got, knock off as many rough edges as possible, and call it a day.Zombeer was never going to be a great game but it might not have been awful in a world where it was finished. This isnt that world, though, so what weve got is a terrible game that tries to be funny but cant even manage that. The voice acting for the PC version is supposed to be all-new, and its actually not that bad if you ignore the terrible mistake of having K say something with every beer he drinks. The story is almost nonexistent, though, and the few characters never give you a reason to care about their incredibly dumb antics. Couple that with a game thats more about walking through halls than shooting the two or three enemy types that occasionally show up to be easily dispatched and Zombeer falls apart completely.Closing Comments:Fortunately, it falls apart in a semi-entertaining fashion; not in a so bad its good way but rather a cant look away way. For all the well-deserved kicking Ive given Zombeer, I also pushed through to finish the game not because I was obligated to for the review, but because I was morbidly curious as to where it was going. While that turned out to be a we cant finish the game so lets pretend its a two-parter ending screen, it was still a game I enjoyed yelling at for sucking. If youve got the tolerance for terrible and the four hours or less that it takes to beat the game, maybe youll have fun groaning at how bad Zombeer is too.", "date": "February 2, 2015", "grade": 2.0}