{"name": "Splice (PS4)", "ref": "https://hardcoregamer.com/?post_type=post&p=131811", "text": "If you know anything about game design, you know that its a process of iteration. You try new concepts and fail until you find something that works, then you refine it until you have something you can publish. The notion that we can take a single brilliant idea and turn it onto a masterwork is nothing but an appealing myth. Puzzle games are different though. To make a good puzzle game, you need to start with a solid mechanic and extrapolate it in all possible directions. Youll need to have a significant chunk of your development process done before you even know if your mechanic works or not, and if it doesnt you often need to start back from square one. There are aspects you can polish  timing, UI design, power-ups  but creating something elegant like Tetris or Bonza requires strong intuition and more than a small leap of faith.So when a new puzzle game comes out that actually works well, that achievement deserves celebrating. Philadelphia-based Cipher Prime has found that success twice now, first with their debut game Auditorium  a puzzler that asks players to create music by bending light waves  and again with their 2012 iOS hit Splice. In the interceding time they released two more titles  Fractal and Pulse  but one is a little too complex for its own good, and the other is more of a straight music game. Auditoriums success brought it to the PS3 and PSP in 2010, where it sold well and earned critical acclaim, and now Splice hopes to follow suit. Unfortunately, it doesnt take to Sonys consoles nearly as well as Auditorium. While the core game is solid, this port has a few issues that ultimately hold it back.In Splice you are given a cluster of cells and tasked with rearranging them in order to fit a predefined pattern. This seems straightforward initially, but several restrictions make things trickier than they first appear. Each cell can have either one or two others attached at its end, creating simple trees with binary branches. Even so, the patterns can get complex quickly, and youre only given a very limited number of moves in which to properly sort them. Just doing that much can be quite difficult, but if you feel up to an additional challenge, you can try to solve puzzles under-par for an angelic ranking. Youll need more than just basic splicing to earn most of the games angelic ratings though. In addition to normal cells, there are three special cell types that make things a little more complicated. These cells have unique abilities that can be activated in sequence down the cell chain. Cells marked with an arrow extend outward when activated, creating two cells in sequence. Cells marked with an X delete all cells below them on the chain. The last cell type, marked with a double arrow, splits in two, duplicating all cells attached to it in the process. Puzzles often require that you duplicate other special cells in order to solve them, taking relatively simple patterns and making them grow exponentially. Later puzzles require some serious lateral thinking, and when everything clicks together Splice delivers some serious eureka moments.While youre sorting cells, youll enjoy the games slow, mellow classical music and minimalist art design. Splice clearly wants to evoke a Zen vibe akin to Thatgamecompanys flOw with its musical sensibilities and layered petri-dish world. However, that soothing mood clashes somewhat with how complicated Splices puzzles can be. Its a lot easier to relax and zone out while swimming around lackadaisically than it is while staring at the same screen for minutes on end trying to make disjointed pieces fit together. A sense of motion is vital for this sort of meditative aesthetic to work  Auditoriums flowing light being a prime example. While I realize that Cipher Prime is trying to give their games a uniform appearance, I think Splice might have benefitted from brighter colors and more upbeat music. Splice would definitely benefit from providing a little more in the way of instruction. Aside from some diagrams depicting how cells can be laid out, the game provides no explanation as to how its mechanics work. Instead, when it introduces new mechanics  such as the aforementioned special cells  it does so in simple puzzles where the solution is only possible through their use. This does a good job of teaching players to use these tools, but it doesnt necessarily convey the more nuanced aspects of their design. For instance, because splitter cells are technically two cells in one, they cant be made part of branches before theyre activated. Additionally, unused special cells cant be made part of your solution for a level, even if they fit perfectly into your target pattern. These hidden rules make some sense, but theyre not exactly intuitive, and whenever you run up against them you end up feeling cheated out of what ought to be a viable solution. When all of the rules in play are clear, solving Splices puzzles is quite gratifying, but these moments suck the fun out of it.Splice is a port of a mobile game, and that really shows when youre playing it. You move cell structures using a drag-and-drop interface that feels awkward with a controller  the gameplay was obviously designed with touch screen and mouse controls in mind. Cipher Prime has adjusted the game to fit the new control scheme as best they can, even going so far as to integrate Sixaxis tilting and the Dualshock 4s lightbar, but those gimmicks hardly distract from how poorly-suited the game is to consoles. A vita version might have worked better, but the developers elected to skip Sonys handheld altogether. More troubling are several bugs that seem to be new to the console version, including one that causes entire puzzles to disappear whenever you move on to a new sequence. Closing Comments:Splice is a well-conceptualized puzzle game, but its not as well-executed as it ought to be. Its minimalistic sensibilities end up leaving some important rules unexplained, and they dont quite gel with the type of game Cipher Prime has created. Bugs crop up with alarming regularity, though thankfully theyre all pretty easy to work around. If you can get past the instability and lack of aesthetic cohesion, youll find a foundation of smart mechanics and clever challenges. With that said, youll probably better enjoy those elements on your phone or tablet.", "date": "January 29, 2015", "grade": 3.5}