{"name": "Saints Row: Gat Out of Hell", "ref": "https://hardcoregamer.com/?post_type=post&p=129771", "text": "Its difficult to believe that Saints Row was once a blatant Grand Theft Auto clone. An exercise in both genius and incoherence, Saints Row: The Third threw logic out the window and made one of the most enjoyably frivolous sandbox games in ages. Saints Row IV upped the ante further with superpowers, challenging the titans of the genre as a game that was about fun and energy, not drama or seriousness. With the new standalone expansion, Gat Out of Hell, Deep Silver are giving the original icon Gat another round in the spotlight. Saints Row: Gat Out of Hell is another ridiculous odyssey for the Saints, but even as an expansion pack, the shadow of Saints Row IV constantly hovers overhead.Gat Out of Hell begins with the Saints Row IV team celebrating aboard their spaceship. Things take a quick turn when they break out a Ouija board, summon an evil spirit, and have their boss (The President) dragged down to Hell. In an effort to get him back, Gat and Kinzie summon the spirit once again and travel to the Underworld to save The President. Turns out that Satan wants his daughter Jezebel to marry The President, but as expected, Gat doesnt want any of that. Its up to Gat and Kinzie to team up with various residents of Hades and save the Saints leader. Gat Out of Hell follows in the same goofy footsteps as Saints Row: The Third and IV, with all of the same extremely well-written dialogue youd expect. Sadly, the story simply cant deliver on the quantity. The story ends almost immediately after gaining momentum, which doesnt give you enough time to really associate with the characters. Theres a stellar musical number smack dab in the middle, but thats really the biggest highlight (aside from the ending). Gat Out of Hell doesnt really do much with its story, and while that might not be a deal breaker, its a mismanaged follow-up from the superb story of Saints Row IV.Gat and Kinzies journey to Hell isnt really anything new for Saints Row. If youve played Saints Row IV specifically, youll probably be floored at how similar the two games are. Building off of the superpowers of its predecessor, Gat Out of Hell gives the players various powers to use in the Underworld. Super speed, blast attacks, stomps, all what youd expect. These powers function very similarly to how they did in Saints Row IV, letting players use guns and powers in tandem. The combat is still a joy; the satisfaction of laying waste to an army of hellspawn with a colossal stomp to the ground is immeasurable. Still, the powers have very auxiliary changes, like different effects of draining health or petrifying enemies. The similarities to Saints Row IV are easily the biggest issue here, as there isnt too much expansion beyond the core elements of the last game in the series.However, there is one major change that ends up mattering a lot: flight. In Saints Row IV, you could run up buildings and super jump long distances, but Gat Out of Hell actually gives the player full flight. Using Satans broken halo, Gat and Kinzie can use fiery wings to explore the city. Various techniques like diving, climbing, or flapping to gain altitude and speed are all at the players disposal. Flight takes a little time to get used to, but ends up feeling natural. Dashing down a highway and dodging highway pylons is a rush and shows that flight is something that can work extremely well in games (take note, Superman). It also helps that Gat Out of Hell doesnt copy Saints Row IVs city design. The city in Hell was built from the ground up with flight in mind, so youll find ample opportunities to dive and weave while on the wing. Easily Gat Out of Hells best feature, flight makes navigation an absolute breeze.The games missions are almost exactly like those in Saints Row IV. Mayhem, Survival, and Insurance Fraud (now Torment Fraud) all return, sticking to all the same features (for better or for worse). The new missions like Hellblazing (a twist on Blazing, though now youre flying) end up faring better, taking advantage of the new mechanics. One mission type has you saving souls from being beamed up to Heaven, with you flying and collecting their falling husks. These missions are great, changing things up in just the right ways to keep players interested. Its just a shame that so many of the missions feel recycled from Saints Row IV.Side-quests also stick to the series guns. You can wander around town finding Souls (the games version of clusters) to upgrade your powers, collect money through missions, finding the huge number of audio tomes, and deactivate the citys infernal security missiles. These are all still fun, but like a lot of Gat Out of Hell, very few of them take advantage of the nuances. Also, without any character customization or buildings to hack, youre left with collecting, fighting, and missions as a majority of your enjoyment. Thats not bad, but its very familiar.For $20, Saints Row: Gat Out of Hell is more likely to appeal to those new to Saints Row. Its self-contained and still has a large amount of the content that Saints Row IV had (though at not as high a quantity). The missions and collectibles will keep you hooked for hours, especially with the excellent flight mechanics. Still, the story is so short that it can be completed within a couple of hours. Your enjoyment of Gat Out of Hell is dependent on how much you like the distracting side missions (the game literally calls side-missions diversions). Saints Row fans have known that for a while, but Gat Out of Hell just doesnt have enough new stuff to be a must-buy for them. If you havent played a Saints Row game, though, Gat Out of Hell is a real bang for your buck, especially if youre a completionist.Graphically, Gat Out of Hell iswellSaints Row IV. In Hell. Fortunately, the game benefits from the change in aesthetic. While Saints Row IV had the Tron-esque blue going on, Hell is a huge shift. Chock full of fire, lava, and tortured husks, its a balance between familiar and fresh. Some architecture is a nice twist, like Blackbeards Barrens or the dragon skeleton near Downtown. However, there were some annoying graphical glitches in the game, such as clipping into a building and being unable to get out, or the occasional crash.The voice acting is still amazing, with Daniel Day Kim reprising his role as the lovable psychopath Gat. Natalie Lander returns as the misanthropic Kinzie Kensington as well. Other prolific voice actors appear in Gat Out of Hell like Travis Willingham (Fullmetal Alchemist, Infamous: Second Son) as Satan and even Jay Mohr, returning for his first role as Dane Vogel since Saints Row 2. Sadly, the voice acting suffers from the middling story, leaving some great dialogue (and singing performances), but just not enough of it. Closing Comments:Saints Row: Gat Out of Hell captures the madness and destruction that made the series so fun, but even as an expansion pack, theres not much new here. So much of it is cut from the same cloth of Saints Row IV that the nuances end up meaning much less than they should. The animations, the powers: its all too familiar. That being said, its still a joy. Its open-world design at its finest, with constant distractions and an excellent transportation method. The flight is amazing, a pitch-perfect example of how to make open-world exploration fun. Its a shame that the story is so unfulfilling, though, because Saints Row has always nailed its presentation. Saints Row: Gat Out of Hell is Saints Row IV Lite. It doesnt do enough new to be a must-buy, but for anyone looking for a quick, easy way to get into this devil-may-care sandbox series, its still a solid act. Hell yeah.", "date": "on January 19, 2015", "grade": 3.5}