{"name": "Train of Afterlife", "ref": "https://hardcoregamer.com/?post_type=post&p=129851", "text": "What happens when we die? Many people have attempted to come up with answers for this over human history leading to many religions, philosophies and personal lifestyle choices as a result. But when it really comes down to it, none of us can say with 100% certainty what does or doesnt occur. Train of Afterlife provides one possibility. In this visual novel the protagonist named Wind begins by simply gaining consciousness inside a train. Of course, this train is anything but typical.Outside the windows there is nothing but whiteness  no ground or sky. The interior is where things become far stranger. Along with the lead character there are five other passengers. None have any distinct characteristics and appear only as blue silhouettes. According to them none have any memories of their lives or anything else. All they seem to know is that this is a train filled with people who have passed on. Beyond this simple tidbit of knowledge each passenger is equally in the dark. No one knows their names, ages, or even gender. The names theyve taken were chosen at random though perhaps they have some relation to their past.Discussing much beyond the basic story framing of Train of Afterlife is impossible without revealing spoilers. With that said, the storyline does evolve and shift in intriguing ways. Finally working your way to the last ending is definitely worth it as it ties together all the odd, disturbing, and depressing facets sprinkled through each playthrough. This is thanks to the games focus on multiple paths and endings. Gameplay is pretty simplistic but is challenging for a reason to be discussed in a moment. Basically, you choose who to talk to at various hours on the train before it is time to leave. Sometimes dialogue choices pop up during these discussions and each choice affects Winds status.There are three aspects of status: awareness, enlightenment, and darkness. They can be checked at any time but on a first playthrough youll have no clue which choice increases which status. As such, its imperative to remember which choices were selected before, and keep track of the status, to work toward multiple endings. They trigger when the three statuses are aligned in the right way. Along with this are tarot cards which allow characters to recall one memory at a time. Unfortunately, they dont tend to be happy recollections.There are nine endings to discover in Train of Afterlife and youll want to see them all to complete the tale. The biggest problem with this is the high degree of repetition required to get there. Upon each consecutive playthrough youll have to hear a lot of the same chatter again. Many visual novels offer the ability to skip previously read text but such a feature is lacking here. One thing the game doesnt tell you is the importance of each storys end screen. It displays a few letters and you must jot these down somewhere because they reveal a password to unlock the second set of endings! Finally, unlocking that last one can become annoying if you arent paying serious attention to each tarot card reading. Keep these tips in mind and it should cut down on some frustrating elements.Despite such complaints, the visual novel redeems itself mostly thanks to a solid storyline. It might sound a little hamfisted at first but really delves into dark territory. Discovering who each character is and why theyre aboard the train is exciting. Then theres Wind themselves. Who are they and what are all these memories theyre slowly recovering? Following through to the conclusion provides a very powerful reveal. The biggest complaint to be held is with the mechanics of its script, which sometimes present awkward grammar. In all, thats a relatively minor complaint.Finally, one cant avoid discussing the art given that this is a visual novel. The reason its not necessarily a highlight is due to the very somber, restrictive nature. Theres honestly very little on display. The backdrop is a monochrome train and its shadowy inhabitants. Every so often you do get a bit of anime-style art via the tarot card and flashbacks. Some scenes are simplistic and beautiful while others are downright creepy. The simple aesthetics help it stand out against most other visual novels.Closing Comments:Subdued visuals, a mysterious storyline with strange characters and nearly ten endings make Train of Afterlife a commendable visual novel effort. Thanks to the utilization of status markers, players must focus on the decisions they make because each leads them down a different path. The game falters in regards to forced repetition, which dampens the otherwise great storyline. That, paired with a few other frustrating elements, necessitate a great deal of determination to truly complete the story. Those who make it through will find that Train of Afterlife is worth the effort.", "date": "January 19, 2015", "grade": 3.5}