{"name": "The Talos Principle", "ref": "https://hardcoregamer.com/?post_type=post&p=122203", "text": "What does it mean to be sentient? Its a favorite philosophical question with as many different answers as people trying to answer it. The Talos Principle takes its turn figuring out at one of the great mysteries of life by pitting a newly-minted AI construct in an artificial world against a series of puzzles set forth by its creator, interspersed with e-mails, notes, and snippets of corrupted data found at computer terminals throughout the worlds. Something isnt quite right in Elohims peaceful puzzle gardens, and to find out what it is youll need to aggravate your creator by wandering off the path hes set before you. Not completely away from his tasks, though, because while Elohim may not be completely trustworthy, hes really good at making clever, devious puzzles for you to solve.The gameplay of The Talos Principle is centered on endless puzzles set in the crumbling ruins of ancient civilizations. Or at least they look like crumbling ruins, but regular glitching never lets you forget the artificial nature of the world and that maybe its not held together quite so well as its master would like you to think. Still, youll need to solve the little puzzles to figure out the big mystery, and this is done with a number of tools ranging from jammers, crystals, time-warping consoles, pressure plates, fans, and of course the ever-present crates. Its all played from a first-person perspective, and your robotic body zips along at a pace more appropriate for a Quake-style deathmatch than a leisurely bout of puzzling. It takes a bit of getting used to but, seeing as the environments are almost as large as they are pretty, you come to appreciate the speed fairly quickly.After a few basic learning puzzles, The Talos Principle gets down to business and starts requiring serious brain power. Use the jammer to open the blue electro-gate so you can get the crystal rod behind it that you can then use to connect a red beam of light from the emitter to the lock on another gate nearby. Get the block behind that gate, put it on top of the fan, use the crystal to link up to the emitter again but dont connect it to anything else, put it on top of the box on the fan, and then use the second box on top of the pressure plate to activate the fan to blow the crystal high into the air so it can be seen from elsewhere in the level. But not everywhere else in the level because that would be too easy, and you wouldnt want to be able to finally find another crystal rod and be able to use it to grab the red beam from the airborne crystal and just open any door at all without any effort, would you? The Talos Principle is equal parts logic and trial-and-error, devising a plan and then working the bugs out, but when you put all an areas pieces together and complete the solution it almost always comes with a clever feeling of accomplishment.Its nowhere near as simple as all that, though, because why stop with a series of self-contained puzzles when they can link together in unexpected ways? There are three main areas in The Talos Principle (with a fourth tower thats off limits, dont go there, no really, Elohim means it) that act as hub worlds to smaller collections of individual puzzle areas. Each smaller area is, in practice if not geography, an island containing three to five puzzle areas that reward a sigil on completion. Each island has a computer near its spawn point with some texts that further explain the world, and signposts helpfully pointing the direction to the various puzzles. The puzzle sections are self-contained areas bound by walls, carefully designed so that the solution flows in a specific way and no external influences from elsewhere on the island can interfere. Unless theyre supposed to, of course, because each island may have a star or two that tends to be very tricky to unlock, and frequently requires figuring out how to shoot a beam of light across the walls and over the island to another section hundreds of feet away. Figuring out how to free the stars is incredibly satisfying when it involves linking up multiple areas, but not so great for the times it turns into a scavenger hunt across the island for the one tool necessary to weigh down a pressure plate.Once youve got a star it turns into a special sigil, similar to the ones youve been gathering as the reward for each completed section. Sigils are tetronimoes, Tetris pieces that are used to unlock new tools and areas. Gather enough of the right kind and youll need to enter them into a rectangular grid, jigsaw puzzle style, turning and reorganizing them until they all fit in place. The flow of The Talos Principle then becomes 1) Solve puzzle, 2) Get piece of key to unlock another puzzle, 3) get the occasional verbal pat on the head from Elohim about how impressed he is with your cleverness. In the meantime, the QR code graffiti on the walls shows youre not the first AI to come this way, and the information from the PC terminals is making it clear that something went horribly wrong in the real world. Closing Comments:Getting to the truth may not be an easy task, and involves sifting through a good amount of Philosophy 101 ramblings on the nature of sentience with heavy religious overtones thrown in for good measure, but extracting a solution from every puzzle and challenge along the way is fantastically satisfying. The large, beautiful worlds of The Talos Principle are filled with lovely ruins and pretty weather effects, making the time youll spend ramming your head against its stone walls and locked energy-doors a pleasantly relaxing experience despite its many periods of momentary frustration. One problem leads effortlessly into another and the reward for being clever is a requirement to up your game for the next area, which is exactly how a good puzzle game should be. The Talos Principle expects you to be smart and knows youve got the brain to figure it out, and the reward for it being right is the a sense of satisfaction at solving something properly tricky.", "date": "December 8, 2014", "grade": 4.0}