{"name": "fault milestone one", "ref": "https://hardcoregamer.com/?post_type=post&p=125034", "text": "The visual novel has come a long way in the last few years. Until recently they were thought unsellable in the west, but now Steam is lousy with the things. Phoenix Wright has a sizable fan base on the 3DS, were finally seeing western releases of crazy stuff like Hatoful Boyfriend and PacaPlus. But now that we have so many to choose from, were starting to see the same problem they have in Japan: many visual novels, especially those released by independent Doujin Circles, arent very good. fault milestone one from Doujin circle ALICE IN DISSONANCE, in addition to having a title that my word processor hates, is one of the most lackluster that weve seen to date.Sekai Project is a small localization house thats made a name for itself by translating quirky, low-budget visual novels for a western audience. Their best game so far is Planetarian, a classic sci-fi visual novel from Key, and right now theyre in the middle of a kickstarter campaign to localize Keys all-time tearjerker classic CLANNAD. Their other releases range from mediocre to decent, but theyve improved drastically over the last year. Sunrider is a fairly solid tactical game with some overlong cutscenes, and Sakura Spirit is surprisingly inoffensive for what basically amounts to porn. Their work on fault shows two things, though: they need to be a little more selective with the games they bring over, and they desperately need an editor for their translated scripts.fault milestone one is a kinetic novel, which essentially means that the camera zooms in and shakes sometimes when things get dramatic. Aside from these flourishes, there isnt really anything in the script that necessitates this being a game. The story isnt voiced, which makes reading through it a bit of a slog to begin with, and theres only one binary decision in its entire seven hour run time. The choice happens early on and changes some of the dialogue to follow, but the story plays out in almost exactly the same way regardless, and thats the sole moment of interactivity in the entire game.The whole draw of visual novels is that they allow players to experiment with choice and consequence, so its bewildering to see fault abandon the concept entirely. Visual novels dont absolutely need to have branching plots, but if they are linear there needs to be some sort of puzzle mechanic, like Ace Attorney or Danganronpas trials, to keep players invested. Without those interactive elements, all youre left with is a suboptimal storytelling vehicle. Music, sprite animations and CG arguably add a bit of dramatic weight to the proceedings, but this could easily be a light novel or a manga without losing anything  though now that I say that, it could stand to shed a few excess tons of expository dialogue.In fault milestone one, nothing is said in one line that could be said in twelve. Characters bicker back and forth about the most inane nonsense, doing nothing to push the plot forward or even develop their relationships. If someone offers a compliment, you can bet that theyll restate it three different ways over seven or so lines. If something about the world needs to be explained, the characters will either spend eons discussing basic facts that all of them should already know, or the protagonist Ritona will break into expository soliloquy. Even faults ellipses are overblown, stretched out over three text boxes every single time they come up. Despite being relatively short, this is not a game that respects players time.Its a shame, too, because the world that ALICE IN DISSONANCE has created is pretty interesting. Every aspect of daily life is enhanced by magic  manakravte in the games ponderous lexicon  but it isnt just used to handwave miracles. Spellcasting and the nature of mana have very specific rules that the game delights in explaining, and while the exposition is always overlong the details of how kravte works are fascinating in their own right. I absolutely love it when a fantasy world takes a scientific approach to its magic system  the works of Type-Moon thrive on this sort of obsessive technicality  but fault squanders that good will by spending too much time mired in its own ideas. We dont need twenty lines to outline a basic principle of the world, especially not when theres a codex in the games menu that explains everything anyway. The constant exposition makes the dialogue feel clunky and unnatural  stories like this should trust the audience to pick things up as they go along.Ritona, the games protagonist, is a magical prodigy who abhors violence, but nonetheless serves as a royal bodyguard for the kingdom of Rughzenhaide. Her charge is princess Selphine, a demure, kind-hearted, and generally optimistic girl with a knack for language. When their kingdom falls under attack by a crew of vicious teenage mercenaries (this is Japanese, remember), they attempt to escape with a teleportation spell and end up transported to the Outer Pole, a distant land with almost no mana. There they meet Rune, a bubbly young girl with a mysterious past. The bulk of the game is spent digging into Runes history, which proves to be interesting and thematically resonant, but ultimately feels completely disconnected from the plot that brings Selphine and Ritona to the Outer Pole in the first place. The main story only kicks in at the very last moments of the game to remind is that this is the first part of a series and leave things on an artificial cliffhanger. Even discounting the overblown dialogue, faults storytelling is just plain sloppy. The atrocious, clichd characters dont help much either. If youve seen more than ten seconds of anime in the last decade, you can make an accurate guess at just about every characters motivations and personality at a single glance. Ritona is serious and driven, Selphine is sweet and lacks confidence, and Rune is very obviously hiding something beneath her cheerful demeanor. The four mercenaries pursuing Selphine are even more obvious  you have the no-nonsense pragmatist, the weird, quiet badass, the tiny hothead (she even uses fire magic. Symbolism!) and the stone-cold crazy leader. Now, theres nothing wrong with using such archetypal characters to expedite storytelling, but thats not what happens here. fault spends ages establishing each of them as though their personalities are unique and difficult to grasp, wasting time with trite, predictable asides where they grab dinner or go shopping. When it does come time to advance the plot, characters often act like complete idiots for the sake of narrative convenience  a sure sign of lazy writing.Even if the writing were as taut and measured as it needs to be, it would likely be let down by Sekai Projects translation. The games script is littered with typos and grammatical errors, but thats just symptomatic of larger issues. Even without a great original to work with, translated dialogue should never be this stiff and unnatural. The greatest flaw by far lies in the narration, which suffers from exceptionally awkward and inconsistent phrasing. Sekai Project conjugates most of their scripts in past tense, which I find to be a poor choice for visual novels, but thats a matter of taste. The trouble is that they cant seem to keep their tense consistent, and frequently switch to present tense whenever they need to describe characters  sometimes jumping back and forth mid-sentence. The narration also jumps randomly between Ritonas first-person perspective and a detached, omniscient third person. Its awkward and jarring whenever it happens, and makes the whole production seem amateurish. The games artwork is also pretty lackluster, though for a small independent team thats more forgivable than bad writing. The proportions are off on most character sprites, especially with male characters, and the games artist doesnt seem to have a great grasp on perspective. The net result is that, in spite of some nice shading, the world and characters look ugly and flat. Bad artwork doesnt necessarily detract from a visual novel  Higurashi is one of the all-time greats, and it looks like it was scribbled by a kindergartener  but in conjunction with everything else that fault gets wrong, the flaws are pretty glaring.The games sole saving grace is its music, and even that isnt without its faults ( sorry). The dark, atmospheric songs that underscore serious, dramatic scenes are powerful and subtle, and while the action music would work better as a JRPG battle theme, it would make for a pretty fantastic battle theme. When the game tries to be lighthearted, though, it all kind of falls apart. The upbeat comedy music that accompanies funny moments is generic and boring at best, and irritating at worst. faults composer clearly has his strengths, and he should stick to them. Closing Comments:Its great to see more visual novels hit our shores, but not all of them can be winners. fault milestone one is poorly-crafted and barely interactive. It has an interesting premise, but its let down by padded, disjointed plotting and awful character writing. There are some exceptional tracks in the games score, but theyre wasted on awkward scenes. If this game is any indication, both Sekai Project and ALICE IN DISSONANCE are in dire need of editors.", "date": "December 23, 2014", "grade": 2.0}