{"name": "MXGP  The Official Motocross Videogame", "ref": "https://hardcoregamer.com/?post_type=post&p=118709", "text": "MXGP is an all-new series from the creators of MotoGP, Milestone. This cross-generational release focuses on motocross instead of the more sim-based motorycle racing in that series. This racing sub-genre has had a lot of interpretations over the years. The 8-bit era gave us Excitebike, while the 16-bit landscape was barren, and Excitebike 64 brought it back to life to some degree. The PlayStation 2 era saw the MX vs. ATV series shine, while the last generation largely saw that series dominate until Pure came out and raised the bar for all arcade-style racers. MXGP strikes a fine line between arcade and sim, but leans more towards the former than the latter.Bike handling is essentially how its become in the MX vs. ATV games where the left stick controls your movement and the right stick shifts your weight around. MXGP handles this far better because while MX vs. ATV is almost a twin stick shooter with racing, you dont always need to move the weight around to do well. This makes riding much easier than that series since you dont need to rely on cumbersome stick movements to do something as theoretically simple as getting your bike to go where you want it to. The end result is a game that is a breeze to control for the most part, as you can easily shift your weight for things like jumps and ramps. However, you can still shift your movement a bit with the left stick, which allows you to avoid the pitfalls that come from trying to lean in too far with the right stick on tougher turns.Unfortunately, while the game controls nearly perfectly, its mode selection leaves something to be desired. Youve got an instant race, a longer grand prix with a series of races, a fairly long championship mode that you can tackle with a real-life rider, or you can start a career mode with a created character. While this may seem like a lot of variety, it amounts to seeing the same basic menus before a race, outside of a paper-thin attempt at creating an environment in the championship and career modes by showing your bike getting minor work done before races and having a bit of in-game social interaction in the career mode by picking teams, rivalries, and the like. In each longer-form mode, you can pick between the lower-powered MX 2 bikes or the more powerful MX 1 bikes  so if youd like a gradual or more severe challenge right out of the gate, you can tailor things to your play style.Online, youve got single races and longer seasons. The inclusion of an online season is perfect for die-hard fans of motocross who want to do a lot of races in a single play session. Theyre a great way to earn a lot of XP too since you gain XP for every race, and can shave a few steps from the process by basically doing one long playlist instead of a ton of piecemeal races. Online play is impressively lag free. During numerous sessions of both the season and single races, absolutely no lag crept up in a session. Most of the time, youll get at least a bit for a short while, but it never happened and thats an impressive feat. Online and offline, the fruits of your labor go towards equipment for your created rider, so if really get into that mode, youll want to devote as much time as possible to unlocking new gear. Theres a definite sense of sameness throughout all of the mode types, which is a bit disappointing. Luckily, the constant earning of XP helps placate the feeling that every race is the same. While there is a general pattern to a race, things do get varied enough to keep you excited. Early on, you can expect a mad dash where riders are knocked off the bikes. Odds are, youll be among them and thats when youll notice things looking a bit wonky.When flying off the bike, theres no weight to the rider. While ragdoll physics might work well in this context for a Saints Row game, for something thats meant to replicate something athletic in real life, it causes a disconnect for the player. Similarly, youll also tend to clip right through the dirt, which just looks weird. When things get really hectic, youll see parts of other riders, but their bodies arent quite fully-formed, so its like theyre forming in real-time, which also looks strange. MXGP doesnt show many signs of being a current generation game. Character models are thin and theres a lack of movement from your suits despite them zooming through areas at a high rate of speed. Youd think theyd move a bit to indicate the movement, but there isnt any. Suits do get some dirt built up on them over time, which is a nice touch, but like the bit of mud that cakes the tires, isnt something we havent seen done before on last-generation hardware.Track deformation is theoretically in the game, but its not something youll really see visually. Apart from seeing dirt fly up, you never really see any proof of the terrain changing as it appears the same no matter what. Terrain deformation has been shown before in other games, so its puzzling why its not shown here on far superior hardware. There are also times when your wheels appear to clip through the dirt, and while an argument could be made for that showing the wheels going through the dirt, thats not how it appears when youre playing. It makes the game seem a bit cheap, and that furthers the feeling that this isnt making the most of the current-gen tech its running on.The rock-heavy soundtrack fits the fast-paced action, but never really gets you pumped up or sticks with you. The horns and crowd noises add a bit of life to things and definitely make the world youre in seem alive even if the crowd and background objects are just static parts of the world. Engine roars sound satisfying when youre surrounded by other riders, but arent up to snuff when youre leading the pack. Even with horns going off, things just feel lifeless then and you never want that in a game. Also, beyond not having any effect visually, crashes dont make much of a noise either. In theory, theyre supposed to be these bone-crunching events, but they sure dont sound like anything more than an eraser being dropped on a table.Closing Comments:MXGP is a mixed blessing of a game and those dying for a current-gen motocross game might be tempted by it. The solid controls and reasonably-exciting gameplay make it fun for a while, but the modes are far too similar with only surface-level changes beyond the overall length of the events to set them apart. Its not the prettiest-looking game on the PS4 and wouldnt even be a top-tier game on last-generation consoles. The sound design also underwhelms. The total package is one, however, thats at least worth a rental for motocross fans, and die-hards will likely get a lot of use out of the lengthy career mode.Version Reviewed: PlayStation 4", "date": "December 18, 2014", "grade": 3.0}