{"name": "Game of Thrones: Episode One  Iron From Ice", "ref": "https://hardcoregamer.com/?post_type=post&p=123027", "text": "Is it more important that your choices in a game matter, or that they feel like they matter? Thats the question Im left with at the end of Iron From Ice, the first episode of Telltales new series based on HBOs Game of Thrones. Telltales adventure games over the last few years, starting with The Walking Dead, have been episodic magic tricks; interactive choose-your-own adventures that promise to let you forge your own story. Youll pick what your character says, shape their personality, and ultimately be forced to make life-or-death decisions. Its like watching a TV show that stops occasionally to ask for your input. So, naturally, the whole experience hinges on whether or not you feel like your choices are meaningful. If they arent, whats the point? Unfortunately, like all magic tricks, if you pull too much on any one thread in Telltales games, the whole thing starts to unravel, and Game of Thrones first episode is no different.Iron From Ice begins where the third season of HBOs show ends, the infamous Red Wedding, and casts you as several hapless members of House Forrester, each desperately trying to survive through the fallout. House Forrester has never appeared on the show but has been referenced in the books, so for someone like me who only watches the show, its definitely cool to see familiar events play out from a new angle. If you havent watched the show or read the books up to that point, though, youll be missing a lot of context worth catching up on before you start.To Telltales credit, I didnt notice how little effect the choices were actually having on the story playing as different characters, and thats why Im torn on the issue: every interaction legitimately felt like it could lead to a swift and sure end for my characters. Every dialogue option incited real panic and left me with a sickening sense of regret. Every impossible, show-stopping decision brought a sense of helplessness as I obsessed over every possible ramification; and true to the source material, no decision left me feeling good about what I had chosen. Its only once I got to work the next day and started excitedly comparing choices with a coworker that we each quickly realized that none of it really mattered anyway; almost every decision results in the same outcome regardless. We started looking up all the different options on YouTube, and thats when the illusion crumbled completely. There are very few real choices in Game of Thrones, and even fewer that actually make a difference. The game might present you with three options that sound wildly divergent, for instance, but one way or another, all three will get folded into the same path. Sometimes it feels like a natural convergence; other times it makes no sense and directly contradicts the players choice. Of course, its difficult to judge how much decisions made in this first episode will change the course of the story in subsequent episodes, but if Iron From Ice is at all representative, the effects will be minimal at best. Theres also very little reason to replay the episode multiple times to make different choices since things only ever really play out one way. But choices arent the only problem with Iron From Ice, either.The pacing is all over the place, and more importantly, nothing like the show. It plays out like it was made by people who have heard about the show, maybe even read a bullet-pointed list of defining characteristics, but never actually seen it themselves. Youll take the perspective of multiple characters, like the show  check  but you wont switch back and forth between them every few minutes; you only play as each character once or twice over the entire episode for lengthy sessions. Sometimes, youll follow a character through multiple consecutive scenes, the screen fading to black and everything, before youll finally switch to someone new; compared to the show, the games pacing just drags as a result. One characters actions will occasionally affect another character later, like the show  check  but everything plays out so slowly that it rarely feels satisfying.There are long stretches of very little happening in Iron From Ice, something that never happens in the show: Game of Thrones the show is brisk, tightly packed, and often gets criticized for moving too quickly for viewers to keep up. Game of Thrones the game will often place you in an empty room with completely meaningless environmental interactions, just opportunities to look in an empty bucket over and over for no reason. Even still, compared to The Walking Dead, Iron From Ice positively flies, though thats admittedly thin praise.Telltales usual cartoony visual style just doesnt work in a series as grim and political as this, where backstabs happen out of nowhere and words are often a persons most deadly weapon; it hurts its legitimacy when characters overact every emotion in a way that is decidedly untrue to the show. The stiff, robotic animations are comically bad, like a kid posing his actions figures around, and consistently pulled me out of the experience. One of the playable characters in particular, Gared, has such goofy facial animations that my girlfriend and I spent most of his scenes laughing and making fun of how dumb he looked, even as tragedy and death swirled around him. Telltale has been putting out these games for years now, has licensed two of the most popular shows on television, and grown significantly as a studio. Theres simply no excuse anymore. Closing Comments:There are reasons to like Iron From Ice, but theyre few and far between. In the moment, it can be thrilling to spar words with Cersei or choose whether to execute a thief or send him to the Wall. For that to work, however, you have to be willing to put up with a lot: the slow pacing, the exaggerated visuals, the awful animation and the fact that those choices dont make much of a difference at all. Things could improve over the long haul, but based on this first episode, committing to a season pass is not recommended to anyone but the most diehard Game of Thrones fans with a high tolerance for mediocrity.", "date": "December 13, 2014", "grade": 2.0}