{"name": "Serious Sam: Siberian Mayhem", "ref": "https://hardcoregamer.com/?post_type=post&p=417660", "text": "The thing about an invasion of Earth is that its not confined to a single country, or even continent. Serious Sam has fought through large chunks of everywhere, from Egypt to Europe to Central and South America, but in all the years hes battled alien overlord Mentals forces the fight had never gotten to Russia. The gap in Sams travel itinerary has finally been plugged with Serious Sam: Siberian Mayhem, which is a stand-alone adventure that chronologically would fit somewhere between the last couple of levels of Serious Sam 4. Like the rest of the Serious Sam games theres no heavy continuity to keep away new players, but if you have played Serious Sam 4 then there are a few story elements youll recognize. Overall the plot is no more complicated than that Serious Sam Stone is in Russia and theres a whole lot of alien monstrosities out to stop his trek across Siberia.The main Serious Sam games have always been pure-action FPS and Siberian Mayhem is no different. The game opens with Sam on a boat, landing on the Russian shore armed only with a pistol. The initial enemies are the standard grunts, relatively harmless so long as you keep moving, and the starting area doesnt give the slightest hint of the hordes to come. The pistol is soon joined by the shotgun and AK-74MX, both of which make taking out the increasingly deadly enemy swarms more satisfying. The soldiers are soon backed up by the tougher gnaar and laser-firing robo-mechanoids, flying drones and of course the headless kamikazes. The entire Serious Sam menagerie shows up over the course of Siberian Mayhems five massive levels, but not before youve got the armament to handle the big creatures.While Siberian Mayhem is only five levels, theyre huge and packed with secrets. The initial landing area, for example, proceeds as a beach for a while before the trail leads up a hill to a large snowy plain with a couple of industrial compounds. A yellow diamond marker always shows where the next checkpoint is, making it easy to go exploring knowing that you wont be tripping over any of the main objectives. Sometimes exploring just turns up an empty field, other times it nets extra ammo and equipment, and sometimes theres even a bonus objective with a special reward at the end. The level structure is half open-world, half directed level, with a start and end point clearly defined and a path from one end to the other, but a lot of room to go wandering along the way. The best example of this is the third level, Siberiade. This is a long trek through Siberia on snowmobile and ATV with Sam hopping off when necessary to explore points of interest. You can zip straight to the checkpoint or poke around a bit, turning up several puzzles and a bonus objective along the way to the first of two major checkpoints. The first checkpoint leads to road leading down a hill to a small village with a church on the other side, guarded by enemy soldiers who are just barely within range of the grenades from the shotguns secondary fire mode. Getting to the church triggers some plot and a major battle, with the reward being one of best weapons in the game. The energy crossbow is a beast of a gun, able to land a powerful shot with pinpoint precision and made even deadlier thanks to its scope. Theres plenty of space to get to grips with the shiny new toy, seeing as its a three kilometer trek across snowy farmlands to reach the next area, and ambushes pop up at regular intervals to keep the journey interesting. After that the snow is left behind for a while and Sam gets to travel the rest of the way to levels end on an ATV, as always keeping an eye out for branching paths and bonus goodies.By the time level five rolls around Sam is armed to the teeth with a powerful arsenal that includes the trusty rocket launcher, a wonderfully-overpowered heat-laser, bonus weapons like the auto-shotgun (that could have used more ammo just because its such a fun toy to let loose with) and of course the cannon. Making Sam even more dangerous are the purple orbs found in special crates that grant a skill point when used, and one of the major skill branches is dual-wielding. It uses up ammo twice as fast, of course, but when youve got a parade of were-bulls followed by a wave of headless kamikazes and swarms of the skeletal horse-like kleer, all backed up by rocket-launching bio-mechs plus a couple of four-armed homing-orb-throwing reptiloids, maybe theres more to worry about than speed of ammo consumption. Its going to require full knowledge of how each weapon works as well as the occasional use of the gadgets Sam finds along the way (health, back-up drone, air strike, etc) to complete the mission, and there are more than enough enemies to drive the lessons home. Closing Comments:Serious Sam: Siberian Mayhem is an excellent entry in the long-running series. While more of a small side-story its still got plenty of meat on its bones, providing a satisfying campaign that ramps up quickly and hangs around just long enough to be satisfying without dragging on. The flow of combat/explore/combat is tuned so that one always provides a break from the other, and both are equally enjoyable. The FPS action is fast, with Sam moving at a quick pace when walking and zipping along ridiculously quickly at a run, which also helps makes looking around not feel like a chore. Its worth exploring too, because sometimes secrets are no more complicated than a pack of rockets behind a door and others involve blasting a pile of suspicious boxes to find a wall with a C4 marker on it, which then blows open to reveal a warp to a battle from the original games complete with low-poly environments and the classic powerups. Serious Sam: Siberian Mayhem is everything a Serious Sam game should be in an economy-sized package, and a great game for both returning fans and those whove been wondering what it is thats kept this series alive for the past twenty one years.", "date": "January 25, 2022", "grade": 4.0}