{"name": "WWE 2K15", "ref": "https://hardcoregamer.com/?post_type=post&p=119470", "text": "Another year, another wrestling game featuring the biggest Superstars of the WWE. This years entry in the venerable franchise, however, is a bit different than the rest, and the new direction of the series is going to be one that divides fans. Its time to find out if this fresh take on in-ring action is worthy of your time.WWE 2k15 puts gameplay above all else. Its clear that developer 2K Games was less concerned about cramming every mode from previous iterations into this one, ultimately resulting in a game that feels light on content and anything but sleek. This years entry sees two primary features front and center: the 2K Showcase is an ode to the likes of 30 Years of WrestleMania and Attitude Era from past installments, while MyCareer is a totally new addition to the franchise.The former places players in a series of matches depicting two of the WWEs more compelling rivalries: John Cena-CM Punk, and Shawn Michaels-Triple H. Between matches there are various facts about the rivalry interspersed with footage from the matches and build-ups. It has the usual 2K Sports polish, giving players a glimpse at what these two epic rivalries were like; however, its far less lengthy than 30 Years of WrestleMania or Attitude Era. While those modes went on for a delightfully long time, 2K Showcase feels more like a flash in the pan, gone before players even know it. Furthermore, though each of these rivalries were only comprised of a few matches in real-life, this mode tries to draw things out a bit more, but in doing this, uses filler matches that feel more like busy work than an integral part of the storylines playing out.MyCareer is similar to that which is found in 2Ks other sports titles. In this, players create a superstar from scratch and then run him through the ranks of the WWE, first starting out as a new recruit and eventually working up to WrestleMania and the title belt itself. This mode could have been stellar had it spent more time in the oven cooking. As it stands, though, it feels half-baked thanks to a lack of any substantive interactivity or meaningful cutscenes. Most everything here is delivered through an in-game segment with some voice-acting, which is quite solid mind you, or through text blurbs that pop up before matches. Unfortunately, most of the time the latter is how players will learn more about their rise to superstardom, which is a missed opportunity.And then of course theres the much adored Universe mode, which lets players simulate all the shows and matches of WWE. Players are essentially given total control over storylines, title holders and the like, and are given free reign to do with the WWE Universe as they please. Want to make Heath Slater WWE World Heavyweight Champion? Go ahead. Want to put the tag straps on Kane and the Undertaker? Have at it. This mode has always been a charmer, and it remains a gem here. Sadly, though, it has gone entirely untouched, which means it utilizes the same features from last years entry. While this is fine, considering its already a solid addition to the formula, it would have been nice for the first WWE game on current-gen consoles to come out swinging, giving players a different experience than the one they could get by just replaying either of the last two installments in the franchise. For those that like straight up exhibition matches, there are plenty of those in 2K15. In fact, pretty much any match that has taken place on WWE television or pay-per-view in the modern era is available to play.The gameplay is perhaps the area that has undergone the most radical modification from previous series titles. Gone are the days of fast, arcade-y matches, and in their stead are methodically structured simulations of what happens within the squared circle. This is going to be a huge point of contention for some, but for anyone looking for something more realistic and authentic to the actual product, this will be a dream come true. For starters, the speed of the match has been slowed down a considerable amount. Wrestler movements are more calculated, maneuvers are executed with deliberation and even basic actions like running and striking have a real sense of weight behind them. This often leads to longer bouts and more opportunities for back-and-forth action.That last bit is especially important considering counters are more important (and easier to pull off) than ever before. Because moves are doled out at a lessened pace, it is easier to hit the counter button and guess opponents upcoming attacks. The AI is not going to lie down for anyone, however, and seems just as adept at countering as players will become. This leads to some fantastically epic moments of countering a counter to a counters counter, giving big matches those moments that feel important, especially down the homestretch of the showdown, reminiscent of a WrestleMania main event where all the signature spots are being answered by each performer.The new chain wrestling system is also a fairly welcome addendum to the action. This current-gen exclusive is another feature implemented to enhance the realism of matches. By pressing the grapple button at the beginning of a map, a collar-and-elbow tie up is executed. From there, each opponent can press one of three face buttons to place their foe into either a side-headlock, wristlock or waistlock. A basic rock-paper-scissors mechanic is used to decide which move trumps the other. Whoever then wins that mini-game places the other in the corresponding hold before having to face off in another minigame. Once one of those three manuevers is initiated, players must rotate the right analog stick to find a sweet spot on a graphic at the bottom of the screen. If the attacker hits the spot first, theyll perform another move; if the defender finds it first, theyll gain the upper hand and transition into one of the three original holds themselves, thus starting over the sweet spot minigame. But it gets more complicated. While trying to find the sweet spot, the attacking wrestler can either strike or wrench their opponents limb, making it harder for the defender to locate the sweet spot. This entire series of minigames only happens 2-3 times per match, but for folks who really dont enjoy it, the feature can be turned off entirely. We played with it on the entire time, as it added much to the flow of combat. To further control the pace of a match, theres now a three-tiered stamina system. Essentially, the first tier allows moves to be performed easily. The second tier is when wrestlers start slowing down, while the third sees a completed exhausted competitor. They can drop so low that they arent able to even pull off a finisher. This, mixed with the chain mechanic give that sense of simulation to each contest.When further coupled with the generally slowed animations, matches feel less like quick romps, and more like strategic endeavors that allow for comebacks from even the most damaged wrestler. For some, this significant departure from the more action-packed nature of past games will be a bore, or too cerebral to enjoy. For those wanting tacticality in their wrestling, theres so much to love with what 2K Sports have done here. This feels like the studio took note of everyones adoration for the N64 classic WWF No Mercy, and tried to incorporate as much of that design philosophy as they could, without feeling like a carbon copy. To that end, sits somewhere between a more traditional WWE 2K title and the beloved AKI-developed games.One main gripe with the gameplay, though, is the pinning setup. When getting pinned, players have to hold down a button and time its release just at the right time to kick out. Although it becomes easier to do so the more practice one has, its still frustrating that this somewhat luck-based mechanic is so integral to wins and losses. We found, on more than a few occasions, that we lost a match fairly early on simply due to not being able to time the kick-out properly, and not because we had been bested in any great way. This was at the very least frustrating, and never really grew un-frustrating over the course of our play time. Moreover, a major area of concern for this years title is the stripped down create-a-wrestler mode. Not only is it a mess to navigate, as the game has to constantly load the new hairstyles, tights, and other body mods each time players want to see what the change would actually look like one their guy, but the options presented are limited at best. We specifically chose the word guy in the sentence before because gone is the ability to create a Diva; so folks better want to only create male Superstars.Outside of gameplay, WWE 2K15 still struggles to look impressive. In matches, the visuals get the job done, as animations are especially fluid. But during segments where there are close-up shots, such as ring introductions, its clear that this effort was rushed in order to get it on store shelves for the holidays. At times, its like the team didnt even bother adding textures to wrestlers. And, yet again, the developers seem to specifically struggle with facial animations; some wrestlers look great, others look ridiculous. This has been a series trend, and thus its profoundly disappointing to see it, again, cropping up.Sadly, even outside of the visual presentation, WWE 2K15 is just not a refined game. There are a slew of bugs and glitches, some of which will halt a match entirely; others are more comical than anything, like going for a pedigree in the center of the ring and suddenly being transported to the outside to deliver the move in mid-air. A patch may fix some of these issues, but launching with them present is unacceptable. We also found that the online multiplayer was a bit of a mixed bag in terms of latency. Some matches were fairly lag-free, whereas others were a mess to the point of being unplayable. One would think that after this many incarnations of the series, something as fundamental as netcode would be ironed out. Alas, it apparently is something Visual Concepts and Yukes still cant seem to perfect. Closing Comments:Neither great nor terrible, WWE 2K15 is truly divisive. Its a departure for the series, but this new direction should be unsurprising for anyone familiar with how 2K does sports. To that end, some players may pine for the older days of this franchise, where gameplay was frenetic and fast-measured. WWE 2K15 steps away from that methodology, and in turn delivers a much more deliberately-paced game, and one that is more intent on providing an authentic, one-to-one recreation of the drama that goes down in the squared circle. Its methodical pacing will put some off, but those wanting a wrestling match simulator will welcome 2K15 with open arms.", "date": "November 28, 2014", "grade": 3.0}