{"name": "Adventure Time: The Secret of the Nameless Kingdom", "ref": "https://hardcoregamer.com/?post_type=post&p=119077", "text": "Adventure Time is one of the sweetest shows on TV at the moment. Its unique off-the-wall humor and irrepressible charm combine with some deeply intriguing lore to create a consistently enjoyable program for viewers young and old. While the series adventuring premise seems tailor made for video games, it has struggled to find its footing in interactive media. Set in an amazing and unpredictable world full full of beasts to battle and mysteries to explore, fans have been aching for a worthwhile Adventure Time title since the series debut. The heroic duo of Finn the human boy and Jake the shapeshifting dog opens up an array of theoretical gameplay possibilities, but everything released thus far has been far from ambitious.The first Adventure Time video game, Hey Ice King: Whyd You Steal Our Garbage?, was a sidescrolling action title that drew very tangible inspiration from The Legend of Zelda II: The Adventure of Link. The next game in the series, Explore This Dungeon Because I DONT KNOW!!!, adopted a dungeon-crawler style not unlike Diablo. With The Secret of the Nameless Kingdom, Wayforward has returned to the Zelda series for inspiration, this time drawing from the legendary A Link to The Past. It seems like a fantastic fit on paper, but the problem with drawing from such rich and time-tested game design is that anyone familiar with the source material will not only know many of the tricks already, but theyll also expect a certain level of quality.Sent on a mission to the Nameless Kingdom by Princess Bubblegum, best buds Finn and Jake are tasked with finding and saving the lands three princesses from their respective temples, a plot immediately familiar to Zelda fans. Equipped with his trusty grass sword, a wicked cool weapon that wraps itself around Finns wrist until called upon, the hero controls very similarly to Link, the iconic protagonist of the Zelda series. Wayforward even implements Jake as Finns shield, as the heros shapeshifting canine companion pops out from Finns pocket at a moments notice. The sword and shield combination will be familiar to most players, but Wayforward also apes more Zelda staples.Throughout the course of your journey youll acquire a bananarang, which functions the same as Links boomerang, multi-purpose plastic baggies, similar to Links empty bottles, and even a Hero Gauntlet, which allows Finn to pull and lift heavy objects much like Links power bracelet. These whimsical interpretations of familiar Zelda items are enjoyable at first, but it quickly becomes apparent that The Secret of the Nameless Kingdom doesnt bring many of its own ideas to the table. Many of the enemies you see around the kingdom are simply Zelda enemies with Adventure Time skins; chus are now worms, octoroks are crystal people, and knights are, well, knights. But while some of these may appear slightly lazy in design, they all possess the Adventure Time charm fans adore, and are therefore successful.That charm is most evident whenever you speak with one of the numerous Adventure Time characters strewn throughout the Nameless Kingdom (who all enjoy full voice acting), but its also alive and well in the numerous sidequests they provide. Theyre admittedly short distractions, and are often nothing more than fetch quests, but The Secret of the Nameless Kingdom is strongest whenever is emphasizes Adventure Times fantastic stable of characters and utterly unique sense of humor. These moments extend the novelty of exploring an interactive Adventure Time world, but they cant save the game from suffering fatally where it counts.Because of its borrowed elements, the game plays very much like A Link to the Past. Where it falls short, however, is in the actual level and puzzle design. The Secret of the Nameless Kingdom is never brave enough to bring its own ideas to the equation, settling for a barrage of block puzzles and switches that are more tedious than challenging. Its strange that a series as creative and off-the-wall as Adventure Time would settle for such generic level design, but thats unfortunately exactly what we have here: a frequently stale and cumbersome experience.That monotony often turns to frustration due to an utter lack of direction at crucial points of your journey. I spent far too long backtracking through every screen of the kingdom looking for something I had missed, and when I eventually figured out the solution it was far from intuitive. These moments make the time between dungeons, already far too long, unbearably tedious. The only redeeming factor is that you can properly take in the surprisingly detailed visuals, which wonderfully capture the colorful style of the show while toting some awesome sprite work for the characters and enemies.You could argue that Wayforward was attempting to cater to a younger, less experienced sect of gamers with The Secret of the Nameless Kingdom, but that still doesnt excuse its generic and generally boring design. The game feels unfinished, especially since it runs so short and contains a frustrating amount game-breaking bugs towards the end. Wayforward walks a dangerous line between loving homage and shameless copycat here, but with all that said its also easily the best Adventure Time game yet, and lays the groundwork for a more realized and innovative vision down the line.Closing Comments:Wayforward has scraped by with The Secret of the Nameless Kingdom. Its inspirations are pure, and give birth to some solid if all-too-familiar mechanics, but its ultimately a disappointing adventure that squanders source material that remains begging for a true video game adaptation. With that said, fans of the show will likely still enjoy the journey, despite its faults. Gamers looking for an adventure of the same quality as A Link to the Past, however, should save their money; nothing of the sort will be found here.", "date": "November 26, 2014", "grade": 3.0}