{"name": "Pokmon Omega Ruby and Alpha Sapphire", "ref": "https://hardcoregamer.com/?post_type=post&p=119057", "text": "After seeing a number of titles suffer massive technical issues, playing Pokmon Omega Ruby and Alpha Sapphire feels refreshing. It might seem weird to praise a video game for simply working, but after slogging through Driveclub and Assassins Creed Unity, among others, the ability to function cannot be taken for granted. The Pokmon games are quite similar to the NFLs New England Patriots in that they never seem to wind up being the best in class, yet we seem to be singing their praises every year. Omega Ruby and Alpha Sapphire, the gorgeous remakes of perhaps the two most underrated titles in the heralded series, are no exception to history. If youre hoping to purchase a polished RPG with addictive gameplay, solid mechanics and surprisingly expansive lore, look no further.Arguably the most intriguing remakes of this remastering-heavy year, Omega Ruby and Alpha Sapphire manage to make the twelve-year old Ruby and Sapphire versions feel like entirely new games. Combining the quasi-3D visuals and new mechanics introduced in last years Pokmon X and Y with a heavy dose of nostalgia creates an experience that frequently feels special. Anyone whos blown his or her nose within five feet of a Pokmon game knows that each games narrative places emphasis on acquiring eight gym badges, defeating the Elite Four and the reigning Pokmon League Champion, and fighting off an organization of self-righteous baddies. Omega Ruby and Alpha Sapphire are no exception to this rule, and while the story is almost identical to that of Ruby and Sapphire, it remains one of the stronger tales in series history. Team Aqua and Team Magma (the main, color-coded group of villains present in whichever version one chooses to play), while obviously evil, manage to feel more justified in their actions than villains past. Rather than focusing on stealing and exploiting Pokmon, a la Team Rocket, Aqua and Magma aim to revert the world to a state in which Pokmon can roam free. Add these clueless, yet relatable villains to the main characters adorable friendship with his or her neighbor and the evolving confidence of his sickly rival Wally, and Omega Ruby and Alpha Sapphire boast the best version of one of the more engaging collection of small stories in the entire series.Of course, with all of the new mechanics present, namely Mega Evolution and the essentially identical Primal Reversion, it would be fair to expect a few minor narrative tweaks. Game Freak should be commended for managing to organically squeeze new information and cutscenes into an existing story without making the entire tale feel awkward. Pokmon Omega Ruby and Alpha Sapphire always feels like a unified tale, never devolving into an old game with random bits of new dialogue strewn about. In fact, if these were your first Pokmon games, youd be hard pressed to figure out which bits of content were new or old. Its a difficult task to advance an almost twenty-year old franchise by using two decade-plus old titles, but Omega Ruby and Alpha Sapphire feel like a step forward rather than a step back.The classic JRPG-style battles that make the Pokmon series so engaging have returned, as has the aforementioned in-battle Mega Evolution system. New battle animations serve to both enhance immersion and modernize the static fights prevalent in Ruby and Sapphire. Every Pokmon and each individual move has its own action, highlighted by those for high-level fire attacks (which provide some of the best visuals found on the 3DS). However, its worth noting that these new animations dont always run perfectly. The framerate drops to a lower level when the 3D-slider is turned on, and the diagonal split-screen view of in-battle Pokmon consistently chugs. These hiccups arent necessarily game-breaking, but those looking for the best experience possible should consider avoiding the 3D effect entirely. Interesting animations arent just limited to battles, with the player character changing the way he or she moves based upon how far the Circle Pad is moved and crouching down to talk to young children and small Pokmon. In a series that has paid great attention to detail since its first iterations, its exciting to see how far Game Freak is willing to expand on the most minute aspects.Every mechanic youd expect from a Pokmon game is present in Omega Ruby and Alpha Sapphire. Type advantages, leveling, catching new creatures, and evolution are all there to hook you in. However, for better and for worse, Omega Ruby and Alpha Sapphire are clearly the easiest Pokmon entries to date from opening to credits. On one hand, its nice to know that new players wont ever find themselves overwhelmed, as its never been simpler to jump into the long-running franchise. If youre someone who feels as though the Pokmon train has been missed, fear not. The numerous Mega Evolutions available make it enticing to try and catch every Pokmon that has an advanced form, though this mechanic makes it fairly easy to roll through even the most difficult battles. For example, Mega Blazikens speed increases every turn, essentially preventing it from ever having to go second in a match. Those who start with Torchic might find that the only reason to visit a Pokmon Center is to restore the PP of certain power moves. The controversial new Experience Share from X and Y, which gives a hefty dose of experience to every member of your party as opposed to just a single Pokmon, removes the engaging grinding necessary to evolve a given creature. One could argue that the Experience Share allows low level monsters to quickly catch up to more powerful party members, but by removing the need to switch specific Pokmon in and out of battle, leveling feels much more shallow. Rather than playing a direct role in every Pokmons fortune, one simply has to place it into his or her party and watch the rewards roll in. It also seems as though confused and paralyzed monsters attack far more frequently than their negative status effects would indicate they should. Its not uncommon to see a paralyzed Pokmon land a few attacks in a row, thus rendering them all but normal. The Pokmon series has never been particularly difficult, but Omega Ruby and Alpha Sapphire feel tangibly simpler than any game to have ever come before them.After seeing the credits roll, you might be tempted to step away from your 3DS. After all, to most players, seeing the credits indicates completion; in Omega Ruby and Alpha Sapphire, they signal the beginning of the best thing Game Freak has done in years. the Delta Episode, a two-hour narrative expansion, tells arguably the best story the Pokmon has seen, all while linking the events of the previous fifteen hours with those of Pokmon X and Y. In last years iterations, there was mention of a horrifying ancient weapon that required the sacrifice of Pokmon in order to operate. These sacrifices were thought to be for the greater good, as a cataclysmic event was set to destroy the world before the use of said weapon. Fast forward 3000 years, and your hero finds himself or herself at the center of another potential world-ending event. In order to save the planet, the main character is tasked with befriending a mysterious new character, uncovering the secret of Mega Evolution, and harnessing the unique power of a certain legendary Pokmon. The result is a gripping conspiracy tale that features numerous high-level battles, two legendary Pokmon appearances, and perhaps a glimpse at the future of the series. The Delta Episode shows that Pokmon has the potential to grow as a franchise, as it indicates that an excellent story can be told without the classic eight badge formula. Game Freak also proves that story-based DLC can work in this franchise, being that the Delta Episode feels like an expansion of the original story and something entirely new on its own. As strange as it sounds, the surefire best part of Pokmon Omega Ruby and Alpha Sapphire comes after its completion.Omega Ruby and Alpha Sapphires online functionality is back, providing players with the opportunity to continue playing long after the Delta Episode ends. Battling others and trading online has never been easier, and though the connection times are often noticeably long. its a pleasure to report that online gameplay actually works (surprising in this day and age, no?). Gone are the days where one has to search for their Link Cable in order to turn that Machoke into a Machamp; the trading process now feels as seamless as ever. Wonder Trading is back, and while its definitely an exciting idea, its still bogged down by one inherent flaw: any mechanic that revolves around the generosity of strangers is destined to fail. Dont expect to get equal value for that high-level Pokmon unless you consider equal value to be a Level 4 Zigzagoon. Nonetheless, there have been numerous Wonder Trade success stories, so this function should prove to be exciting if youre the gambling type.Closing Comments: Pokmon Omega Ruby and Alpha Sapphire may not be perfect, but theyre an exciting step forward for the long-running franchise. Its a tough task to make a remake feel as exciting the second time around, but Game Freak managed to pull that off in spades. The solid and addictive mechanics that have made Pokmon a staple of the RPG genre are back in full force, and while theyre noticeably easier than years past, its still hard not to be engaged. Omega Ruby and Alpha Sapphire are almost worth purchasing for the Delta Episode alone, as this unique apocalyptic tale combines engaging battles with a gripping narrative to deliver what we can only hope is the future of the series. Whats more, the interesting online functionality has the potential to keep players coming back for more months down the road. Pokmon Omega Ruby and Alpha Sapphire arent just great RPGs, theyre a great example as to why Pokmon might be the surest thing in gaming.", "date": "November 25, 2014", "grade": 4.0}