{"name": "The Moon Sliver", "ref": "https://hardcoregamer.com/?post_type=post&p=117941", "text": "When video games are so near and dear to your heart, it can be hard to accept one that tries something different. That may be why some push back exists against the concept of titles so heavily focused on narrative that they eschew more typical gameplay mechanics. The Moon Sliver is one of these games  but it poses no issue for those willing to try something a bit different. This game is steeped in atmosphere that should lure even wary participants in immediately.You start in complete darkness. Immediately, youre instructed on how to use a flashlight (but are also warned that it has a charge). This calls to mind a great many horror games in the recent past  but The Moon Sliver is still dissimilar. Players will go about collecting notes and recalling moments in time, but its done in a way which actually makes sense. Portions of the game narrative are unraveled as you explore. The order in which things are revealed is somewhat up to player choice, and other times on when things unlock. In any case, its up to you to mentally organize what relates to what and when things occurred.It seems that the protagonist is alone on the island. Every area they explore reveals that there were once multiple people living here, each engaged in a cohabitational life. Where did everyone go? Discovering the answer to this mystery comes after examining every part of the small island. As questions are answered more begin to form. Are you really the only one left  or is someone (or something) else out there? Sure, the game might only take about an hour, but that hour still provides players with an engaging bit of narrative to mull over.The visual style in The Moon Sliver is understated. Peoples homes are sparse  but not nearly as much as the island itself. A few shed-homes, a lone utility pole, and gnarled trees are found peppered around. Although the 3D graphics alone arent particularly impressive, the lighting raises it to another level. With careful heavy shadows and bright beams of light you start to feel like the island is otherworldly in nature. Developer David Szymanski definitely worked with what they had and made the best of it. Because the location is so limited its also hard to become stuck for long.Exploring the island, uncovering its remnants of the past, and seeking to understand were only part of the playthrough. As you continue, the world reacts to events and tweaks itself accordingly. Without revealing much, it really felt that the landscape was a character unto itself. This is not a feeling you typically get with games and as such was particularly exciting. Youll know what I mean when playing for yourself.A few may suggest that The Moon Sliver wraps up too quickly, but that seems more due to an expectation of game length rather than a true criticism. The game manages to be shadowy with its past long enough before players begin to recognize whats going on. Beyond that, the game costs only $2.99 which should temper most time arguments. Sure, you wont likely get multiple playthroughs out of it, but the single playthrough is memorable.Closing Comments:Those who choose to play The Moon Sliver should follow the developers suggestion of playing in a single sitting. A run-through should only take 40 minutes to an hour depending on your reading speed and desire to explore. As long as you come in with the expectation of a short, non-linear storytelling experience then you wont be let down by The Moon Sliver. Its a bit creepy, sad and ultimately quite compelling.", "date": "November 20, 2014", "grade": 4.0}