{"name": "Hatsune Miku Project Diva F 2nd", "ref": "https://hardcoregamer.com/?post_type=post&p=117126", "text": "Over in Japan, Hatsune Miku is a superstar. Shes sold millions of albums and can be seen all over the country, but before last years Hatsune Miku: Project Diva F on PS3 and Vita, most western consumers had never even heard of the green-haired popstar. Why is that? Well for one, Hatsune Miku isnt a real person. Indeed, shes actually a digital diva, given a voice by a vocaloid program and a legion of devoted musical minds. Segas gamble in bringing her west seems to have paid off, too, as Miku has since toured with Lady Gaga and appeared on Letterman, and now returns to PS3 and Vita with Project Diva 2nd.Like its predecessor, Project Diva F 2nd is loaded with content. The core of the experience is without a doubt the Rhythm Game, where players will attempt to time their button inputs to the prompts on screen, which are synced with any of 40 vastly different songs. Unlike many traditional rhythm games, however, half the challenge of Project Diva F 2nd is keeping your eyes trained on your target. Notes will fly in from all angles of the screen, and combined with the perfectly choreographed music videos playing in the background it can often be quite difficult to maintain perfect focus. With that said, difficulty levels from easy to extreme makes an otherwise daunting experience accessible to anyone, and regardless of previous rhythmic exploits every player will find something to challenge them here.The game is definitely at its best at the higher difficulties, which take full advantage of the controllers main and directional buttons in complicated sequences and patterns to really test your hand-eye coordination. Anyone who played last years Project Diva F will feel right at home here, but the sequel does add a bit of variety to certain cues. Where its predecessor required certain prompts to be met with movement of either joystick in any direction, some now ask you to use both joysticks together, while others need to be held down and chained with successive notes. It doesnt fundamentally change the gameplay, but instead adds just that slightest bit of extra variety to the experience. Project Diva F 2nd can be unforgiving  youll have to complete at least 80% of any track to clear it  but once you wrap your head around the mechanics and timing its an absolute blast. Successfully completing a song unlocks a slew of content, from extra songs to new diva outfits and accessories. With a constant stream of unlockables and the infectious j-pop jubilee, Project Diva F 2nd is a game you can easily lose hours at a time to.This is especially true when you begin to explore the games Edit mode, which lets players create and edit their very own music videos and song designs. Its an incredibly robust editor, offering all sorts of precise and granular customization. But although its an amazing tool, and will undoubtedly give birth to some truly spectacular fan-made productions, its simply too complicated to be of any real use casually. Even in the modes supposedly simple setting, youre given only a brief explanation before being dumped into the editor to fend for yourself. Because of this, I can imagine many players will give up on the mode before they produce anything even slightly complete, which is a shame.On the less complicated side of things is the Diva Room, which invites players to customize the rooms, accessories, and outfits of each pop star, and even lets you interact with them. The customization is great, with all sorts of goodies available to purchase from the in-game store throughout the game, but things start to get a bit strange when you start rubbing the head of any particular diva to build rapport. Its a peculiar, almost uncomfortable mode that has you literally stroking the heads and faces of each diva as if they were some sort of submissive pet, a stark departure from the carefree fun of the main Rhythm Game mode. Like much of Project Diva F 2nd the Diva Room wont appeal to all gamers, but even the most devoted Hatsune Miku fans may find the return of this mode a little odd.Luckily, the games focus is very clearly on the music, and thats precisely where Project Diva F 2nd shines brightest. A collection of fan-favorite Miku tunes mixed with some brand new tracks, the roster is incredibly diverse, dabbling in genres from enka to jazz and of course the ever-popular electronic J-pop. Altogether the games 40 tracks are a joy to listen and tap along to, but theres a notable lack of the soaring highs of its predecessor. Project Diva F 2nds songs are all solid, and many are quite memorable, but the game just seems to lack those few standout tracks that lit up the first installment.Hatsune Miku: Project Diva F 2nd was only localized because of the tremendous support western consumers showed for the series first installment, and the extra features Sega has thrown in this time around are a clear acknowledgement. Anyone who imported the Japanese version of the game can transfer their data in full to the North American version, and players who buy the game on both PS3 and Vita can cross-save their data seamlessly. Sega has also pledged to support the game with the full DLC lineup its Japanese counterpart received, so if for whatever reason you find yourself seeking more content you can rest easy knowing its on the way.One glaring issue with Hatsune Miku: Project Diva F 2nd, however, is its constant and lengthy loading screens. In comparison to its gameplay, which offers concentrated frantic fun, the games frequent loading bogs down the experience significantly; Moving between menus, selecting songs, and even making the simplest of cosmetic changes to your diva all require extended waiting periods, spoiling an otherwise smooth experience. Displaying fan art during these moments is a nice touch (even if some are a bit risqu) but being constantly interrupted by loading screens can quickly begin to wear thin on ones patience, especially when youre trying to squeeze in that last song. Its only a small quibble, but one returning players will greet with a groan.Closing Comments:Hatsune Miku: Project Diva F 2nd isnt for everyone. It appeals to a very specific sect of gamers, but those who find themselves within its territory will quickly become spellbound by the polish, challenge and sheer volume of content offered. At its core it may simply be more of the same tight, frantic rhythm gameplay found in its predecessor, but with intelligent additions and a robust tracklist, Project Diva F 2nd is an easy recommendation for returning fans and anyone looking for a concentrated dose of J-pop flair.", "date": "November 13, 2014", "grade": 4.0}