{"name": "Senran Kagura: Bon Appetit", "ref": "https://hardcoregamer.com/?post_type=post&p=116635", "text": "In the past, Senran Kagura is one series which would have never made its way to North America. Thanks in part to the increasing openness of the industry (and digital distribution), the fighter with a busty cast has since arrived on 3DS and Vita. Right on the heels of Senran Kagura Shinovi Versus is Senran Kagura: Bon Appetit. This isnt just another fighting game, however, instead introducing the all-female team to the rhythm/music genre.Anyone with opposition to the original Senran Kagura games thanks to their presentation will dislike Bon Appetit in equal measure. This is said up front because this series knows exactly what it is, who its targeting, and theres little chance it will change anytime soon. So, lets get right into this newest adventure for the cast of combatants. The storyline is quite simple. A cooking competition is set up offering the winner a scroll which will grant one wish. Who doesnt want that? After all the girls have caught wind of this challenge, they enter immediately and begin cooking against one another.Battles are hectic and seem like an even more anime version of Iron Chef. Each contestant has their own station while judge/grandpa oversees the whole thing. Surprisingly, the cooking aspects themselves are not sexualized and simply show both characters working away to create delicious dishes. Where things get their traditional Senran Kagura flavor are at three judge points throughout a song. When these appear the player who has done the best so far will be safe. The losing player, however, loses a bit of her clothing. By the second time theyre basically reduced to their underwear. Skilled players will win both times without issue which opens up a final blast, revealing a naked (but obviously censored) loser.If youre both a Senran Kagura fan and rhythm game player (or just a rhythm lover) then you certainly need to hear how it plays mechanically. Bon Appetit is a pretty simplistic music game. The bottom fourth of the screen displays basically all youll ever need to look at while playing; in fact, watching the animated action above will probably screw you up. There are two horizontal bars and button prompts appear on both as they move to the left. Once at the end of the bar you must hit the corresponding button. The four directional buttons as well as four face buttons are what youll need to hit when prompted. The first two difficulty settings are pretty easy, especially if youre skilled in similar rhythm titles already.Each character has her own respective music track and food specialty. However, only half of the cast is unlocked to start meaning youll need to work through a lot of musical repetition to unlock new stuff. Included in the game are a few gameplay modes: Story, Arcade, and Free Play. Story offers humorous, but incredibly fluffy storylines. Arcade mode is similar except theres no story to run across and combatants are selected randomly. Finally, Free Play mode just lets you select your fighter, your opponent, and get some practice in. Because of the limited variety of songs and characters, though, even this amount of modes seems a bit excessive.Music is the aspect which can make or break a rhythm game. In Bon Appetit its really up to personal tastes. It doesnt seem like Senran Kagura is a series known for its music and so the tracks arent likely to inspire devotion. Still, no songs sound outright awful, and a few are ones I happily played through multiple times. All in all however it doesnt feel like the soundtrack is of high quality enough to base an entire music game around. Considering there arent a huge amount of tracks either this is a shame.Closing Comments:When it comes right down to it, Senran Kagura: Bon Appetit is a competent, but completely average entry into the rhythm genre. The biggest change it brings are exposed anime bodies, which are already readily present in core Senran Kagura games. Diehard fans of the series will get a kick out of this, but most others (including music game fans) can feel confident in skipping it over. There are both better rhythm games as well as better Senran Kagura titles available on Vita.", "date": "November 11, 2014", "grade": 3.0}