{"name": "Halo: The Master Chief Collection", "ref": "https://hardcoregamer.com/?post_type=post&p=116046", "text": "For so many of us, the Halo series played a pivotal role in our development as gamers. Perhaps your freshman year of college was defined by talking trash in the midst of massive Halo 2 system-link parties. If youre a child of the early nineties, your group of friends likely had to make the difficult decision between a game of backyard football or a 4 v. 4 sniper match. Countless gamers lined up at midnight for the latest Halo game, bought Xbox 360s at launch in anticipation of Halo 3, and tried to fit that ridiculous Master Chief helmet on their giant heads. Yes, at its core, Halo is a phenomenally-designed first-person shooter franchise, but to the gaming community its so much more than that. This is a series that defines our hobby. It brought people together in a world where were so often growing apart. For these reasons, and oh so many more, Halo: The Master Chief Collection simply feels like a dream come true.At first glance, the sheer amount of content in Halo: The Master Chief Collection appears daunting. If the entire collection was comprised of the Halo: Combat Evolved Anniversary, Halo 2 Anniversary, Halo 3, and Halo 4 campaigns, it would still be a fantastic value proposition. Hell, the public would likely be satisfied if 343 and Microsoft decided to simply release a standalone version of Halo 2 Anniversary. By including every numbered Halo campaign and their corresponding multiplayer modes, Halo: The Master Chief Collection pushes the limits of what a $60 retail release can include. Think about it: thirty to forty hours of story content, four outstanding in-engine multiplayer titles, 106 maps and access to the Halo 5: Guardians Beta in late December. Halo: The Master Chief Collection might just be that one game you choose to take to a hypothetical deserted island. Being able to play each campaign back-to-back manages to strengthen each individual Halo tale. While the average quality of Halos story is often overblown due to its fantastic level design and superb gameplay, as single massive narrative it functions quite well. Gone are the days where youre perplexed over the admittedly convoluted nature of Master Chiefs epic journey. While Halo 4 essentially functions as a stand-alone product, being that its the start of a new trilogy, the first three numerical Halo titles essentially feel like a single space opera. Between 2004 and 2007, it was easy to forget exactly who the Gravemind was, for example, making the missions in Halo 3 where his voice suddenly appears. Halo 2, which some consider to have the weakest narrative of the four games, sees a marked increase in tension during its opening sequences immediately after the end of Halo Combat: Evolved. Sure, one can think of the four Halo titles as separate games, and they certainly function exceptionally well as such, but being able to treat Halo as a thirty-five hour epic is something special. Playing through all of Halo: The Master Chief Collection is a bit like reading an entire book series in order: the whole winds up being greater than the sum of its parts.In what could only be considered a massive understatement, Halo: Combat Evolved Anniversary looks significantly better than its 2001 counterpart. Its clear to see that it stands as a beautiful game on its own, but the difference becomes dramatic once players make the switch over to the original Xbox graphics (a feature present in Halo 2 Anniversarys campaign as well). Basically every shadow and lighting effect instantly disappears upon making the swap to the original engine. Textures suddenly become two-dimensional; one look at an in-ground boulder shows that depth was illustrated through darkened color rather than actual inward distance. Even the character models have received an incredible amount of polish. Grunts now look like actual aliens rather than bizarre multi-colored piglet creatures; elite armor has a level of shine to it that was never before possible. Yes, this is technically the same Halo: Combat Evolved Anniversary that we saw in 2011, but the increase to native 1080p and 60 frames-per-second makes every ounce of that remastering effort pop. Being able to see a physical manifestation of the game we imagined we were playing thirteen years ago shows just how far development has come. Halo 2 Anniversary is the unquestionable star of Halo: The Master Chief Collection. Just like in Halo: Combat Evolved Anniversary, the remastered visuals are nothing short of a sight to behold. Because Halo 2 sports a more colorful campaign than its predecessor, we get to witness 343s talent on an even grander scale. Gone are the muddied blues, greens, and purples that highlighted Halo 2s campaign. If Sunset Overdrive didnt exist, the world would be looking at easily the most beautiful color work of 2014. What might be Halo 2 Anniversarys most dramatic visual upgrade can be easily missed if one doesnt take the time to make the comparison to its original 2004 iteration. During Regret, the campaigns ninth mission, players take numerous elevator trips through lush underwater environments littered with remnants of civilizations past. The algae and aquatic foliage littering the lost artifacts of the past are highlighted by the array of sea-creatures swimming about; its a dead world thats brimming with life. A quick press of the Xbox Ones View button shows that this gorgeous environment simply didnt exist in 2004, as the elevator is simply surrounded by darkness and faint outlines. However, Halo 2 Anniversarys visual upgrade isnt just limited to lush sea-life; it sports what might be the most beautiful computer generated cutscenes in video game history.Theres no way to embellish the work that Blur put into Halo 2 Anniversarys cutscenes; theyre that stunning. This level of visual fidelity would have made our heads explode ten years ago. No console title has come this close to crossing the uncanny valley, as every character has moments where they appear to be actors simply playing a live-action role. The staggeringly realistic hair coating Tartartus exterior creates the illusion that Blur and 343 found an actual Brute roaming around in the wild to play his role. Cortana goes from being a slightly sexualized blue video game character to being a hyper-intelligent, elegant person in hologram form. The Gravemind makes the change from wiggling green tentacle monster to the terrifying villain it was always intended to be. No scene illustrates the narrative power of Halo 2 Anniversarys new cinematics more than the iconic give back the bomb scene. While the sight of seeing Master Chief soar through space holding a spiked purple ellipsis was exciting in 2004, the blockbuster-scale Blur version makes the original cutscene look like a home movie. Chief is surrounded by one of the most realistic interpretations of space the industry has ever seen, with massive explosions and gigantic spacecrafts surrounding him. All of this runs at a silky smooth 60 frames-per-second, so its hard not to feel like youre right there is space witnessing Master Chiefs grand decent. If youre one of the many who considers Halo 2 to be one of the best first-person shooters of all time (ending notwithstanding), you would be remiss not to give Halo 2 Anniversary a playthrough. It might seem odd to hear that Halo 3 is actually the worst looking title included in The Master Chief Collection, but a quick rundown of the development timeline explains why. Halo: Combat Evolved Anniversary and Halo 2 Anniversary are essentially 2011 and 2014 games, respectively, as their remastering efforts came years after Halo 3s 2007 release. Halo 4, released in 2012, came at the tail end of the Xbox 360s run as Microsofts flagship console, meaning that it was able to take full advantage of years of hardware experience. Halo 3 is essentially the oldest game in Halo: The Master Chief Collection, so it makes sense that its the least visually impressive. Nonetheless, rendering Halo 3s environments in native 1080p has certainly livened them up. Sure, the character models might not be the most impressive (especially after witnessing the beauty that is Halo 2 Anniversary), but they certainly dont make this franchises third installment ugly. A combination of evolved gameplay and the ability to alter the appearance and tendencies of individual members of the Flood, thus reflecting the organism they were before being inflected, have allowed Halo 3 to evolve quite well.Halo: Combat Evolved Anniversary and Halo 2 Anniversary were expected to be stunning, and Halo 3 is certainly not a sight for sore eyes, but no one could have predicted the change that upping the resolution and framerate on Halo 4 would have. For all intents and purposes, Halo 4 looks like it could have originally been released on the Xbox One. With fantastically detailed textures and extremely high-fidelity cutscenes that occasionally give Halo 2 Anniversarys cinematics a run for their money, 343s initial dive into the Halo universe is more exciting than ever. The latest numbered Halo release feels exceptionally modern, providing players with a wonderful change of pace after roughly thirty hours with the original trilogy. In 2012, it wasnt as evident how big of a leap into the future Halo 4 was, but seeing it stacked up against the first three games highlights the areas where it truly shines. Simply put, its exciting to mess around with new weapons and enemy types after fighting the Covenant and the Flood for so long. 343 didnt just stop at including the four main Halo campaigns in The Master Chief Collection, instead opting to include a number of intriguing set mission playlists in addition to having every mission unlocked from the get-go. If you want to seamlessly complete the entire four-title story, and youre looking to forgo sleep for the better part of two days, you can undertake the fourty-five mission The Master Chief Saga playlist. Vehicle-lovers will feel right at home with the Hogs, Jets, Tanks, and Mechs playlist, which comprises the best vehicular mission from each Halo game (this is perfect for cooperative play, by the way). Those who enjoy their enemies running straight at them can go through the 7-mission Flooded playlist, and sadomasochists can cry themselves to sleep after beating the high diffculty, 24-skull The Legendary Master Chief Saga. Theres dozens of Playlists available when taking into account single-game and cross-game playlists, so there should be something to suit everyones random Halo urges.So, Halo: The Master Chief Collection already sounds pretty massive, right? Take everything you just read, add every multiplayer game engine, mode, map, and weapon, sprinkle in six remastered Halo 2 Anniversary maps and you have the complete Halo experience. If theres one Halo multiplayer mode you love in particular, then play that one over and over again. If you love every Halos multiplayer gameplay, then rest assured knowing theres a playlist for you and the switch between games is actually not as jarring as one would think. Rockets on Longest. Pistols-Only Slayer on Hang-em-High. Team Slayer on Zanzibar. Multi-Flag Capture the Flag on Blood Gulch. Its all there. If youre looking to buy an online shooter, Halo: The Master Chief Collection is as robust of a multiplayer package as the world has ever seen. Every games multiplayer runs in its original engine, meaning that every Halo feels exactly how it did when it was released. Of course, the increase from thirty to sixty frames-per-second definitely takes a game or two to adjust to, but its a change that benefits the series greatly. Being able to aim Halo: Combat Evolveds insanely powerful pistol more accurately should do wonders for those who werent able to experience it first-hand thirteen years ago. Perhaps the largest general gameplay change is the addition of weapon placement indicators that show whether or not a weapon is actually present or not. These small circles, which become grey once a gun has been taken, allow players to concentrate on the action in front of them rather than simply staring at their feet. Seeing the original graphics from each game, with the exception of the six gorgeous Halo 2 Anniversary maps, running at 1080p and sixty frames per second places a cherry of modern flair on top of a proverbial nostalgia sundae.The aforementioned Halo 2 Anniversary maps, each one created using Halo 4s engine, are as much of a sight to behold as the moment-to-moment visuals in both of the first two campaigns. Gone are the flat walls on Zanzibars beach wall; instead, Stonetowns ivy-covered bricks provide much needed texture depth. Ascensions formerly grey skies are now rife with color and life in the beautiful Zenith. Lockdowns insanely detailed mountainside scenery is a welcome change from the Lockouts foggy environment. Shrine uses all of the incredible detailing technology available to take Sanctuary to the next level, and Warlords incredible sense of scale is a marked improvement over the already oustanding Warlock. Oh, and how can anyone forget the wonder that is Bloodline, the remastered version of Coagulation (which, in it of itself, is a remastering of Halo: Combat Evolveds iconic Blood Gulch). Every map has seen intriguing changes that both affect gameplay and make the world feel far more alive. From minor weapon placement changes to major alterations like the vehicle-disabling EMP devices found in each of Bloodlines two bases, Halo 2s best maps have never been more engaging.Theres something inherently fun about playing Halo with other people; rarely do we see multiplayer games this ridiculous, intense and addictive. Gungoose CTF, the newest multiplayer mode from 343, illustrates just how fun multiplayer games have the potential to be. Literally a version of the Mongoose ATV with a turret attached to the front of it, the gungoose is the most enjoyable vehicle in Halo history. Think of it like a ghost that can shoot and boost at the same time (as the Mongoose has only one speed: fast), all while landing the most ridiculous jumps that one could possibly imagine. These majestic vehicles can be found on Stonetown and Bloodline, the latter being as as close to perfect as a multiplayer map can get. Gungoose CTF makes it mandatory for players to ride on gungeese at all times while they attempt to capture flags located behind each teams base. The result is pure, unadulterated chaos, as two teams of up to eight players attempt to work together while piloting the most ridiculous vehicles the Halo franchise has ever seen. Its hysterical, its epic, and it just might be the best party mode you can find in a multiplayer shooter. Closing Comments:Rarely does a game deliver everything its players could ever ask for, but Halo: The Master Chief Collection does just that. Everything is here that should be here: the campaigns, the multiplayer engines, the maps and the visuals. By adding numerous campaign playlists, six spectacular remastered Halo 2 Anniversary maps, new game modes and increased social connectivity, Halo: The Master Chief Collection finds a way to insert exciting novelty into a collection that would have been spectacular with or without it. The Halo series is all-but required gaming, so 343 should be commended for giving generations old and new the best possible way to play these four titles. Halo: The Master Chief Collection is sure to be on the hard drives of millions for years to come, and it likely will be strange to see an Xbox One owner who doesnt possess it. This is the definitive first-person shooter experience, a no-brainer purchase for the vast majority of gamers, and the first true system-seller of the new console generation.", "date": "November 7, 2014", "grade": 5.0}