{"name": "Dreamfall Chapters Book One: Reborn", "ref": "https://hardcoregamer.com/?post_type=post&p=115661", "text": "One and a half million dollars is a lot of money any way you slice it, but when it comes to making games, it can get sliced awfully thin. When Dreamfall Chapters pulled in that much during its Kickstarter it set high expectations for how the game would turn out  after all, it made only a little less than the excellent Shadowrun Returns  but this first episode exceeds them several times over. The world of Dreamfall Chapters is huge and immaculately detailed, with lighting, models, texture work,and effects that would not look out of place in a 30 million dollar AAA title. This is one hell of a gorgeous-looking game, and it has a beautiful, haunting musical score to match.The Earth we know is only one half of two parallel worlds  the technologically-advanced Stark, and the magically-infused Arcadia. Zo Castillos ability to shift between the two allowed her to uncover a dimension-crossing conspiracy in Dreamfall, but while she saved the world it ultimately cost her deeply. At the end of that game her body lay comatose, and her mind was left to wander The Storytime  the world of dreams. The Storytime is not a peaceful place, however, as overuse of new lucid dream machines in Stark has caused dreamers to become trapped in looping nightmares. In Dreamfall Chapters Zo has spent the last year there helping lucid dreamers to face their fears and wake up, but she discovers that the real world needs her once again  the dream machines are stealing peoples dreams in order to reshape reality  and reluctantly wakes herself up in order to return. Arcadia isnt in much better of a position. The anti-magical Azadi empire has spread itself far across the world in a campaign of conquest (under the guise of liberation) and the rebels who oppose them are on the ropes. Though the Azadia apostle Kian Alvane refused his mission to assassinate the rebel leader April Ryan (heroine of The Longest Journey), she merely fell at another soldiers hands while he was branded a traitor and sentenced to death. With everything he ever believed thrown into question, he resigns himself to that fate. However, on the eve of his execution, a rebel warrior breaks into the prison to rescue him, setting him on a path that could redeem the world and (maybe) give new meaning to his life. Unfortunately we dont see anything of Kian beyond the prison break in this first episode, so by comparison to Zo this new arc in his story feels underdeveloped.After these short prologues, the bulk of Dreamfall Chapters takes place in the European city of Propast, circa 2220. After awakening from her year-long coma with partial amnesia, Zo moves to the cyberpunk metropolis with her boyfriend Reza in the hopes of rebuilding her life. This mostly involves running around the neighborhood talking to people and doing odd jobs  as adventure game protagonists are wont to do  and the interesting thing is that you actually do run around. In other adventure games you might see the city as a series of self-contained screens, each hiding puzzle elements, but Propast is a single free-roaming area (not unlike the Citadel in Mass Effect), with nary a load screen save for when you enter a building.This is remarkable from a technical standpoint, especially coupled with the jaw-dropping visuals, but Im not sure its entirely the best approach for a puzzle-driven adventure. For the most part the puzzles around Propast are fairly compact; you dont have to go too far to find everything you need to solve them. However, there are a few cases where you can miss something on your way to a destination, and these instances can leave you wandering around aimlessly. The city is laden with cool, world-building details like street performers and friends discussing politics or media, so wandering around is never boring, but it does detract from the otherwise tight pacing of the narrative.One of the more modern trends in adventure design that Dreamfall Chapters has embraced is the idea of narrative choice, but the choices the game presents you with arent like anything youll see in the likes of the walking dead. Sure, there are standard conundrums of morality (like whether to kill a dying man out of mercy or let prison guards torture him) but there are far more subtle questions with seemingly  farther reaching consequences. Does Zo bring Reza his standard cheese soup for lunch, or a more adventurous pork sausage (real meat being something of a rarity in the 23rd Century)? Is it better for Zo to dive headlong into an unknown future when she wakes up, or does she want to reclaim her old life and the sense of direction that came with it? These questions of personal identity and mundane decision-making somehow feel far more profound than the melodramatic, life-or death dichotomies typical of modern adventures, and exploring their consequences in full already promises to be fascinating. Ragnar Trnquist, the creator of The Longest Journey, has never been shy about tackling heavy themes with his games. Dreamfall was, at its core, about a directionless young adult struggling to find meaning in her life  a struggle most of us can relate to on some level  while his MMO The Secret World draws on real-world religion, pop culture, and conspiracy theories to craft its lore. Dreamfall Chapters is no exception, and as you wander around Propast youll encounter pointed commentary on partisan politics, corporate culture, and even game addiction (not-so-subtly reframed in the context of the dream machines). But while the game can go to dark places, it does so with a humorous edge. The dialogue trees in Dreamfall Chapters feature some of the funniest jokes Ive had the pleasure of hearing all year, and with the voice acting drastically improved compared to Dreamfall it is actually a pleasure to listen.Unfortunately, none of these elements really come into play during the brief time we spend in Arcadia, and as a result it feels a lot flatter than the richly-developed Stark. Of course, fans of the previous games are aware of the complex political and religious forces that underpin the magical world, but taken just on what we see in this episode it seems like a painfully generic fantasy setting. The problem of not seeing enough isnt entirely limited to Kians story either, as it feels like the entire episode cuts out just when things are heating up. Cliffhangers are an effective way to build suspense from episode to episode, but Red Thread Games could stand to take a few pages out of Telltales book in making sure each episode feels like it has its own self-contained arc. Closing Comments:On the whole the team at Red Thread Games has done an incredible job updating The Longest Journey for the modern era. With graphical fidelity to match any AAA game and a strong aesthetic sense informing its visual direction, Dreamfall Chapters is one of the few games this year that Id call beautiful. But underneath those modern trappings lies the same foundation of smart, profound storytelling that made the series so great in the first place. Unfortunately, this first episode ends a little prematurely, and it feels like weve yet to reach the real meat of the experience.", "date": "November 5, 2014", "grade": 4.0}