{"name": "Fist of Jesus", "ref": "https://hardcoregamer.com/?post_type=post&p=115406", "text": "Religion and video games dont inherently seem to go together very well. Oftentimes, we end up with oddball shovelware such as Super Noahs Ark 3D or Bible Adventures. Fist of Jesus utilizes religion, but not particularly as a teaching tool. Instead it serves as the dressing for a ridiculously over the top beat em up. Why would someone cast Jesus and Judas in starring roles like this? Well, Fist of Jesus was actually based off an action-oriented independent film of the same name! As such, it basically goes without saying that Fist of Jesus is completely sacrilegious, and if that bothers you then never ever play it.The minute you enter the game two things are readily apparent. First, the chibi art style is 100% adorable and works completely counter to the gory battles that Jesus soon finds himself embroiled in. The next thing is how much this title borrows from the smartphone app school of design. From a touch interface with big buttons to gameplay which is also quite minimal its quite easy to see its mobile roots. Theres certainly nothing wrong with smartphone titles just as long as you come into playing one with proper expectations.Fist of Jesus offers many levels of brawling action. Each stage offers a specific goal (ex: kill X amount of enemies) and runs a timer. As either Jesus or Judas you then wreak holy vengeance on ever-approaching zombies. Attacks are very simplistic as youll mainly hammer the same button over and over to fight. A special can be unleashed after it has fully charged. Specials range from benefiting the player to causing heavy damage to surrounding enemies. Usually these charge at a super slow rate which means most of the time is spent frantically pressing attack as you walk back and forth.Unlike many beat em ups, this one doesnt grant expansive levels. Each stage is incredibly small and enemies continually pool into it. This arena style play quickly grows bothersome once special zombies with long range weapons appear. Managing to weave between and away from hordes becomes an annoyance. Perhaps things would be different if each character didnt walk so slowly, but they do. The best thing to do in some stages is to simply run to the edge and pummel zombies as they spawn into a level.There are multiple ways in which Fist of Jesus attempts to inject fun into gameplay. Players can level up their fighters in between stages or gain new power ups. Everything costs coins although in the Steam release coins are purely collected during a stage. In the free to play version (not available in U.S.) theres presumably a typical real money market available. In any case, none of this succeeds in injecting the game with much excitement. Watching a new power up for the first few times is cool, but everything else feels primarily meaningless.Sometimes levels also feel rather cruel in completion requirements. Killing 10 bosses or 50 zombies by itself isnt hard until you factor in level timers. Being timed in games rarely turns out fun. With only a minute or two to complete your task youll do well but often still fall short. When the gameplay itself isnt fantastic being forced to replay stages to continue is the last thing anyone wants.Closing Comments:Of course, many beat em ups fall into the same traps, surviving or failing based purely off personality. In Fist of Jesus case, it is drowning in blasphemous sequences and visuals. Seeing Jesus rip a heart straight out of a zombies chest is bad enough  let alone the terrifying pleasure evident on his face  but being bombarded with humorous/irreverent imagery doesnt make the experience fun. It works, and it will bring some laughs (especially with friends), but there are better beat em ups out there.", "date": "November 4, 2014", "grade": 2.0}