{"name": "Space Invaders Extreme", "ref": "https://hardcoregamer.com/?post_type=post&p=289070", "text": "Nobody ever expected Space Invaders to matter again. The original was an arcade classic that helped catapult videogaming from Pong and Breakout into richer settings. While there were a good number of games before Space Invaders, it was the hit the market needed to fully kick off the arcade scene and push gaming into the public eye. It spawned a million clones like Astro Invader, set the shooter genre on its feet as Galaxian and Galaga evolved the enemy behavior in new directions, and while we might have had games as diverse as Jamestown, Ikaruga, or Ketsui without Space Invaders, theyd have been created from a very different set of origins.Actual Space Invaders, though, was stuck in the past, with several arcade games that were more curiosity than actual quarter-eaters. Return of the Invaders, Space Invaders 91 and 95, and Space Raiders on the Gamecube all failed to capture much attention. Then in 2008 Space Invaders Extreme did for the series what Pac-Man Championship Edition did in 2007, changing up the gameplay to a faster pace while still maintaining the heart of the game, and all of a sudden the invaders were back. It originally came out on 3DS (which also saw a sequel) and PSP, and then was ported to the Xbox 360 with a little help in the backgrounds by way of Jeff Minter/Llamasoft. Now, a decade later and with Space Invaders hitting its 40th anniversary, Space Invaders Extreme has been revived on PC. Its roughly based on the Xbox 360 version but with a some major tweaks and quality-of-life enhancements.The basic structure of the game is about what youd expect from Space Invaders. The shields are gone, leaving the screen empty of protection, and the invaders are a bit bigger than the eleven by eight pixels in the original, but the rest is all there. The invaders move across the top part of the screen and you shoot them from the bottom one bullet at a time, except now the invaders are bigger, brighter, faster, and set to the beat of a thumping techno soundtrack by Taitos in-house band Zuntata. Just playing to take out invaders gives a satisfying round of colorful effects merging perfectly with the music, but theres a lot more going on under the hood than is readily apparent. Shoot four invaders of the same color in a row to earn one of three different types of special shot powers or a shield. Shoot down enemy types in a specific order and youll call out a flashing saucer that opens a bonus round, and succeeding at the bonus goal launches you into Fever mode to really rack up the points with a powerful weapon and all saucers awarding a jackpot. Its not hard to luck into a Fever just by shooting whatever comes your way, but learning the system opens up the gameplay to allow precision shooting to pay off with insane scores. Each level is divided up into stages, with each wave of invaders arrayed in a new pattern. Some waves take a few seconds to clear, others are better dispatched more carefully, and it doesnt take long for the invaders to do more than just wander back and forth. An invader with a reflective shield that sends a shot back where it came, or one that descends to the bottom of the screen when shot resulting in an instant death if you let it land require careful handling. Outlined invaders explode, which is quite helpful when in the middle of a group and less so when theyre inches from your tank, while striped invaders split into more enemies when hit. By the time you hit the final of Extremes five levels the enemy mix of each wave is as much a puzzle to figure out the best scoring options as it is arcade shooter. Not that the game will complain if you decide you just want to dispatch aliens without worrying about min/max-ing it.While Space Invaders Extreme is mostly the Xbox 360 version there have been a few upgrades and changes. The nicest update is the level progression, which originally sent you from one level to the next automatically, but now theres a level select letting you choose the harder route if youve scored well enough to earn it. Once youve beaten a level its available in Free Play, letting you practice the run for best scoring opportunities and making it a bit easier to earn the best path terminating in level 5-D. The one negative change is a small thing, in that the backgrounds are original to this version rather than being ported over from the Xbox 360. Its not that theyre bad so much as forgettable, while the 360 version pulsed to the beat with light and color. If you played the originals on DS/PSP or its your first time to the series you wont know theyre not there, but if youre returning to the game from the 360 it may be a disappointing omission. Closing Comments:Space Invaders had slipped off the gaming radar when Extreme revived the series and a decade later its still a great shooter that deserves to be pulled from the resting grounds of old hardware onto something more accessible. On the surface its a flashy crowd-pleaser, but underneath theres a good amount of room for skilled play to pay off in high scores. Whether you choose to play for the light show or a spot on the leaderboard is personal choice, but neither option is a bad one and both offer plenty of high-energy shooting action. Its great to have Space Invaders Extreme back, dancing away on a modern platform, and maybe if it does OK for itself we could get Infinity Gene as well. Theres always hope.", "date": "February 7, 2018", "grade": 4.0}