{"name": "Stealth Inc 2: A Game of Clones", "ref": "https://hardcoregamer.com/?post_type=post&p=114606", "text": "Between the gray headband of Metal Gear Solids Solid Snake and the red necktie of Hitmans Agent 47, weve all seen the icons of the stealth genre of video games. While these gritty agents scowl their way into the gaming pantheon, you cant help but look for someone who is less a soldier and more a survivor. Stealth Bastard Deluxe gave us a stealth survivor, a timid and confused clone desperate to escape certain death. Stealth Inc. 2: A Game of Clones is the sequel to Stealth Inc.: A Clone in the Dark (the tamer-named console version of Stealth Bastard Deluxe on PC). As a Wii U eShop exclusive, Stealth Inc. 2 is one of the rare cases where an indie hero is not just representing his series, but also an entire console.Stealth Inc. 2 puts you behind the goggles of a mysterious clone who must escape the hazards of a treacherous testing facility. Awoken by an egotistic tester, the clone navigates the complex, avoiding lasers, drones, alarm dogs, turrets and so much more. The silent observer who initially freed your clone sinisterly displays messages on the back wall of the game, mixing between snarky sarcasm, false empathy, and emotionless desire to see you die. The speaker is where a majority of the games humor comes from, channeling the spirit of Borderlands 2s Handsome Jack. Its subtle, but it stands out as Stealth Inc. 2s best source of character.Controlling your clone in Stealth Inc. 2 comes down to not just platforming precision, but item management. The clone is controlled with the D-pad or left thumbstick on the Wii U Gamepad, with actions like jumping, crouching and using environmental items with the face buttons. The Z shoulder buttons allow inventory items to be used and deployed, while certain items can be moved or aimed with the right analog stick. Its here where Stealth Inc. 2 starts to get complex, as many puzzles require an item to not only be positioned in place, but also while keeping it activated or moving your clone around. It can be a bit tough to handle, especially in the more frantic challenges, but the micromanagement only shows the complexity of each of the puzzles, a stellar showing overall.The main challenges are centralized in the test chambers, where youre given a single new gadget to use. The chambers are essentially puzzles that focus specifically on the new item, acting as great tutorials for all its different utilizations. For example, one of the earliest items, the Inflate-a-Mate, lets an inflatable block be used to trigger switches, a platform, or even to bounce to higher areas. Theres a tremendous amount of versatility in how each item is used and the chambers do a fantastic job of easing you into the new abilities while also delivering some great puzzle design.And these puzzles can be quite brutal. Stealth Inc. 2 doesnt mess around with its stealth; sloppiness will not only leave you detected, but dead. Stealth Inc. 2 rewards precision and a careful hand, especially in its superbly crafted puzzles. The puzzles bring lots of ideas to the table, let you associate yourself with the nuances of each skill, while keeping you on your toes during the more hair-raising scenarios. Tripping switches in the right order, planning a hacking attempt at the right time, and narrowly dodging a range of detection are all crucial and exciting moments in Stealth Inc. 2.On the overworld, however, Stealth Inc. 2 plays much like a Metroidvania game. Unlike the first Stealth Inc., which had a more linear progression, Stealth Inc. 2 is much more open-ended. It has you progress through each room without being blasted by turrets or ratted out by loud megaphone dogs. Your map is expansive (though not as enormous as, say, Shadow Complex), but what makes the overworld so great is an open-ended use of your gadgets. Getting a new tool to use not only allows you new paths, but also more options in avoiding detection. For example, your Inflate-a-Mate can inflate so you can vault over detection ranges, while your Jack Boy lets you outright hack enemies to move them away from your path. This gives exploration a superb amount of variety and gives players plenty of options in getting around the map. While there are some more stringent moments that require a specific item, Stealth Inc. 2 does what every great stealth game should do: give you plenty of gadgets and let you use them your own way.Stealth Inc. 2 is a complex game with a lot of features. Beyond its campaign, Stealth Inc. 2 provides leaderboard support for the test chambers, where rivals are taken on to beat their completion times. Players can also work for S ranks on each test chamber, which can be earned by being quick and stealthy. The game also allows for co-op play for a second player with the Wii U Pro Controller or the Wii Remote and Nunchuk, where the Gamepad is used for a more support-based role. It adds plenty of fun, as long as pitch-perfect precision isnt the priority. Clone outfits can also be collected, scattered throughout the overworld, that add some clever bits of personality. Off-TV play for the Wii U Gamepad can be turned on with the push of the  button and Miiverse functionality is available for sharing experiences in stages. Theres also an extensive level editor, which allows the Gamepad to be used to design custom levels and share them online with the community. Community members can even rate these levels and share their thoughts on Miiverse. The level editor is not without its quirks, as like many level editors in games, it demands a lot of patience to understand the interface. Still, the amount of depth in the user-generated content sphere and the smart use of the Wii U Gamepad make Stealth Inc. 2s community features second to none on the eShop. Overall, Stealth Inc. 2 is a massive package, rich with features and content to complement its gameplay.In any great stealth game, smart use of light and shadow are an absolute must, and Stealth Inc. 2 takes that philosophy to heart. Each level uses lights, signals and alarms integrally, which makes the sneaky gameplay precise and honed. The charming designs, both in your clones and enemies, are mixed with comic-book-esque cutscenes with thick shading and detailed expressions on their characters. The light/shadow contrast, however, means the game rarely mixes up its aesthetic design. The facility has its moments of quirkiness, but most of the time is spent in grey corridors, which can make some of the gameplay uneasy on the eyes. A little more aesthetic variety wouldve been appreciated. The soundtrack, however, is a great combination of dramatic spy-movie themes and catchy indie charm. Like its predecessor, Stealth Inc. 2 has an excellent soundtrack, well worth listening to even outside of playing the game. While its dark rooms and hallways might be too much at times, Stealth Inc. 2 has a great presentation, and one that supports its stealth gameplay well.Closing Comments:Stealth Inc. 2: A Game of Clones opens a lot of doors for the series. The Metroidvania overworld lets you learn and use the different gadgets in open-ended ways, offering ample opportunities to experiment. The dark aesthetic design doesnt offer as much variety as preferred, however, and the controls can be difficult to juggle in the more advanced puzzles. Still, Curve Studios deliver a confident progression from their original hit, building upon their stealth philosophy and piling on more content than any Wii U owner could ask for. From the level editor to the community features to the leaderboards, the campaign is just the tip of the iceberg. Stealth Inc. 2: A Game of Clones is a buffet of quality content, focusing around a seamless mixture of stealth, puzzles and platforming that any Wii U owner should definitely investigate.", "date": "on October 28, 2014", "grade": 4.0}