{"name": "Freedom Wars", "ref": "https://hardcoregamer.com/?post_type=post&p=114323", "text": "Freedom Wars, the newest offering from Sony Japan Studio, Shift and Dimps, brings up a number of intriguing questions. When does a game cross the line between deep and convoluted? Can a fantastic premise carry a somewhat mediocre narrative? Can a title be exciting and monotonous at the same time? A great deal of effort was put into making Freedom Wars feel fresh and unique, but novelty doesnt necessarily erase every blemish. Its easy to envision numerous players falling in love with this cyberpunk action-RPG, as it boasts some excellent moment-to-moment gameplay and one of the strongest concepts seen in 2014. Once one dives deeper into its mechanics, however, evidence begins to mount against Freedom Wars being the Vitas messiah.Freedom Wars unquestionably unique premise revolves around your characters life as a prisoner in one of fifty city-based Panopticons. Taking place 100,000 years in the future, humans have essentially left the planet in ruins. Intense resource-management has become so necessary to sustaining human life that those who are deemed to be drains on society are jailed for their perceived uselessness. Every Panopticon is monitored by an advanced surveillance system that essentially monitors everything they do or say, meaning that true freedom is all but a thing of the past. Burdened with a 1,000,000 year prison sentence for amnesia, your task is to literally fight for your freedom. See, in this future dystopia, the only way to prove that you deserve to be a free citizen is to prove your uselessness. Prisoners, or Sinners, are forced to participate in various resource-gathering Operations in order to reduce their unrealistically long sentences. This fascinating concept is undoubtedly Freedom Wars biggest draw, and those who pitched the initial idea should be praised. In a world where were constantly questioning whether or not someone is watching us, Freedom Wars themes find a way of hitting home. Within the first ten minutes, players are likely to violate a number of sentence-extending rules, including lying down, sprinting too long, and coming too close to a member of the opposite sex. A rule is never explicitly mentioned before its broken, and frankly, why would it be? Your character is considered to be less than nothing in Freedom Wars, so why would he or she get the benefit of understanding whats truly going on? Simple rights, or Entitlements, must be purchased with Entitlement Points earned from Operations. Its your duty to prove that youre worthy of the right to recline or run to your destination, as nothing is taken from granted in the year 102014. It bears mentioning that these unlockable personal freedoms all but disappear after a few hours, as Entitlement Points are better spent on resource-development facilities and more powerful weapons for your allies. Nonetheless, having to literally purchase human rights is staggering in the best way regardless this mechanics brief presence. Freedom Wars also tackles the issue of self-worth, a concept that every individual confronts in his or her life. Your character is tasked with proving that his or her life actually means something, which is not unlike the existential debate that frequently lingers in the back of our minds.While its concept and themes are incredible, Freedom Wars actual story somehow leaves something to be desired. In what can only be considered to be a feat of narrative design, this 25-hour tale manages to be both simple and convoluted. All of the standard character tropes are present: the overzealous right-hand man, the heroine who constantly overcomes her fears, the wise older mentor, the overbearing superior, the rude comrade, and more. Your character and his or her allies are attempting to rise up the nine sinner rankings, or CODE Levels, in order to gain better weapons, rights, and living accommodations all while attempting to solve a never-ending series of mysteries. Each CODE Level tends to have four or five mandatory operations and a final CODE Exam mission that enables Sinners to progress to the next rank. This process is exciting at first, but after about ten hours it quickly becomes a lesson in monotony. Players will walk, or fast-travel, to a non-player character location, initiate a dialogue, complete an operation or sneak through a labyrinthine section of the ever-changing Cell Garden, and continue onward. Its truly a shame that the campaign relies so heavily on repetition, as the constant conspiracies and inter-Panopticon struggles find a way of feeling less exciting. Its fairly difficult to become heavily invested in the uncovering the identities of mysterious puppet-masters or the story behind a mysterious ally when youre constantly grinding your way through the same types of sequences over and over. It doesnt help that countless long loading screens pop up during the moment-to-moment non-combat action, thus breaking down the overall game flow. Oh, and youll have roughly 900,000 years remaining on your sentence by the time the credits roll, meaning the vast majority of your punishment-reduction occurs after Freedom Wars ends. Operations tend to revolve around killing hostile sinners, destroying large robotic beasts (known as Abductors), and rescuing captured citizens. While a more interesting gameplay mode may arise, namely fighting off Abductors and waves of hostile sinners while capturing points around a given map, these exciting twists are often overshadowed by the repetition of two particular Operation types. In Liquidation Operations, players simply have to destroy every enemy, human or otherwise, that arises. In Citizen Reclamation, Sinners are tasked with transporting a designated number of nameless citizens to designated recovery pods, thus rendering total enemy annihilation optional. Even though the two most prominent game modes might seem completely different, the general gameplay sequences tend to be exactly the same. Players will kill a wave of hostile Sinners or smaller mechanical enemies before one or more Abductors (occasionally containing citizens) arrives. Your four-man team will fight said Abductors until they either die or release the citizens held captive inside of them. There might be multiple waves of abductors, waves with humans and abductors, or waves of humans, but the general formula tends to stay the same. While there are slight structural and elemental variations to Abductors and multiple weapons at the disposal of hostile Sinners, Freedom Wars feels like it severely lacks enemy variation. Most unfortunately, these encounters only take place in a handful of locations, thus leading players to constantly feel like theyre doing the exact same thing again and again.With that said, the moment-to-moment gameplay in Freedom Wars is an absolutely blast, as it feels like the Console on the go experience we were promised at the Vitas launch. Players are given the option of selecting two weapons, various combat modifications, and a handful of in-battle items to take down foes. Enjoy long-range encounters? Equip a sniper rifle and a rocket launcher and take out enemies from afar. Want to get right up in the action? Equip a light and heavy blade to physically strip away resource parts from Abductor bodies. Do you favor a more balanced attack? Try using a gun and a blade in addition to frag grenades. Whats more, players are given access to a Thorn, a vine-like device that allows players to attach themselves to walls, reach high areas, attach themselves to Abductors, or perform rapid leaping attacks. This added level of verticality allows Freedom Wars to take its combat to places that titles like Monster Hunter can only dream of. Thorns also have one of three secondary functions: binding, healing, and shielding. These modifications allow one to be the lead in battle, the savior of his or her team, or the player that gives his or her squad a helpful defensive advantage, respectively. Freedom Wars gives players the opportunity to take down massive enemies in the exact way they please, and its control scheme lends itself perfectly to its handheld setting. Nearly every control is mapped to a button, with the exception of the simple touch-based team commands, thus allowing Freedom Wars to maintain the tight level of control that its massive battles demand. Although Freedom Wars has some notably exciting gameplay, its reward system is nothing short of baffling. Theres definitely a lot to like here, in theory: a deep crafting system, numerous weapon upgrade possibilities, rewards that can shave time off your sentence, and individual loot pieces to scratch your RPG itch. The problem is, all of these interesting RPG elements are hidden behind bizarre menus and poorly described items. Sure, players can create new weapons, upgrade existing ones, or add modifications to their tools of choice, but its often unclear just what components are necessary to do this. The same goes for crafting medical equipment, combat augmentations, and in-battle items. Every Operation grants you a ton of items (which seems odd, considering, you know, the world is starved of resources), but its often unclear just what these objects do. Its certainly possible to read all of the painfully slow scrolling text descriptions underneath every cryptically-named item, but memorizing the difference between an Electromagnetic WillO Valve and a piece of High Density Layered CNT Plating seems meaningless when your upgrade facilities make it difficult to discern how to get ones desired upgrade. This isnt to say that its impossible to completely understand this convoluted resource system, but the amount of time necessary to get even a basic grasp will turn off countless players. The RPG mechanics in Freedom Wars are a perfect example of the old infomercial cliche, There has to be a better way!Freedom Wars online elements will almost assuredly be a draw to many Vita owners looking to play competitively and cooperatively with others. Instead of using non-player characters to populate your squad during a certain mission, players can enlist up to three other players to take down Abductors and save citizens. Of course, this requires all four players to want to undertake a given mission, as being the one person repeating a mission for three others would assuredly be a bit of a drag. PvP arenas also provide the opportunity for eight players to test their Thorn skills in a more active setting, though Freedom Wars bread and butter is taking down a massive enemy as a team rather than killing a group of humans. Its worth noting that as of this review, online connection times are noticeably slow. Whether or not this is a result of Freedom Wars not having a fully populated online ecosystem or a larger server issue is unclear, but those looking to spend a significant amount of time online should keep an eye on this. Closing Comments:Freedom Wars is a decidedly solid action-RPG. Its fantastic premise and intense thematic elements will engage those willing to put up with its weaker elements. Even though overall mission structure can feel repetitive at times, the feeling of bringing down a massive cyborg with a rag-tag team of prisoners never ceases to get old. Players who take the time to fight through Freedom Wars confusing menu system will find some of the deepest RPG elements the Vita has seen in a fair amount of time. Freedom Wars isnt an unmissable gem, but theres enough good here to overshadow the bad.", "date": "October 28, 2014", "grade": 3.5}