{"name": "Shadow Warrior (Xbox One)", "ref": "https://hardcoregamer.com/?post_type=post&p=113978", "text": "We live in an age where video games are consistently growing more and more serious. This isnt necessarily a bad thing; after all, The Last of Us is a masterpiece and titles like Persona 4 Golden show us how powerful emotional storytelling can be. There comes a time, however, where pure, dumb fun can feel refreshing after being constantly bombarded with heaviness. Shadow Warrior, a remake of the classic arcade shooter of the same name, not only finds a way to satisfy this urge for cheap, violent bliss, but it serves as a reminder that its still okay for a game to focus on fun.Originally released on PC in 2013, Shadow Warrior tells the story of Lo Wang (get your chuckles out now, gutter-minds), a powerful, but juvenile assassin. After his attempt to purchase the Nobitsura Kage,a legendary sword, is interrupted by hordes of bloodthirsty demons, Wang sets off on a journey to acquire all three pieces of the incredibly powerful weapon. Along the way, he runs into Hoji, a revenge-driven, masked demon who informs Wang that the Nobitsura Kage has the power to slay immortal beings, thus making it the most powerful weapon in multiple realms. Shadow Warriors narrative generally comes across as more of a buddy comedy than a serious tale of redemption, as constant puns and toilet-humor litter the moment-to-moment dialogue. While this low-brow style of humor might seem grating at first, Wang and Hoji find a way of growing on players by causing the occasional guilty smile. This isnt to say that Shadow Warrior is without heavy undertones, as hand-painted mythological cutscenes occasionally arise, but this insane first-person action title feels more at home when it doesnt take itself too seriously. Though Shadow Warriors admittedly cheesy narrative may hook in a fair amount of players, its gameplay is clearly the star of the show. After the initial cutscene (which will undoubtedly leave Stan Bushs Youve Got the Touch stuck in your head for hours), every moment takes place in first-person, allowing for maximum immersion. Players have a number of deadly tools at their disposal, including, but not limited to, a revolver, submachine gun, rocket launcher, and a crossbow. Shadow Warriors shooting is certainly refined and varied enough to not feel clunky, but those seeking a perfect first-person shooter experience will likely find themselves searching for more. Thankfully, Wang has access to his trusty katana, thus making it impossible not to feel like a badass. Though Shadow Warriors unique mouse-based swipe controls are clearly absent from the Xbox One iteration, constantly mashing the triggers to slice enemies is thoroughly satisfying. Youll chop off arms, legs, and heads. Youll expose weaponized demon hearts. Youll spray blood absolutely everywhere. Most importantly, youll have a certifiable blast doing it.Shadow Warriors unique customization system allows one to place emphasis on the traits most important to him or her. By collecting cash scattered around the gorgeous environments, players gain the ability to purchase weapon upgrades or extra ammunition. Defeating enemies with varied tactics increase ones Karma score, thus enabling the purchase of various attribute upgrades. Finally, Ki Crystals unlock energy-based powers and, of course, corresponding tattoos. Do you favor your submachine gun? Save up enough cash to unlock the ability to dual-wield (this will save your hide in boss battles). Are you constantly dashing and sprinting? Upgrade your stamina as soon as possible. Sure, Shadow Warrior, at its core, is about killing everything in sight, but the ability to alter ones tactics is a welcome addition. Of course, the gaming universe already knows that Shadow Warrior is centered around making ultra-violence fun. After all, it was released on PC over a year ago. Unfortunately for those seeking additional features, its exactly the same on Xbox One as it is on PC. Nothing of consequence has been added, unless you count the inclusion of the formerly patched-in Survival Mode. With that said, Shadow Warrior is downright gorgeous on the Xbox One. On a macro-level, its hard not to be amazed at the environmental design and lighting effects constantly on display. Its worth noting that textures and character models can look slightly lackluster up close, but when looking at the bigger picture, its hard not to be impressed. Occasional framerate hiccups do occur when an extreme amount of enemies and particles are on screen, but these moments are few and far between. Shadow Warriors most frustrating imperfection, without a doubt, comes in the form of momentary freezes during checkpoints. Players can expect a roughly two-second delay every time an auto-save occurs, thus breaking the flow of a game fully dependent on continuity. Closing Comments:Even though Shadow Warrior has minor technical imperfections and runs about two hours too long, its nothing short of a blast. Those seeking a break from deeply emotional narratives and overly serious gameplay should find a nice pallate-cleanser here. First-person katana gameplay is even more fun than it sounds, and the constant hordes of demons flooding the screen provide a suitable challenge. Shadow Warriors three-tiered customization system increases its depth without making things too confusing, making it more than just a simple button-masher. Most importantly, Shadow Warriors quality adds to the notion that Devolver Digital is one of the most trustworthy publishers in the gaming industry.", "date": "October 26, 2014", "grade": 4.0}