{"name": "Sid Meiers Civilization: Beyond Earth", "ref": "https://hardcoregamer.com/?post_type=post&p=113428", "text": "If youre like most people, the world is pretty messed up at the end of your Civilization campaigns. Swaths of earth are stripped bare by industry, cities have been devastated by war, and whole continents have been razed in nuclear hellfire because someone had the gall to build the Eiffel Tower before Gandhi. Your choices, really, are to become the dominant force on a boned planet, or to escape to the stars in a cool rocket and colonize a new one. As the name suggests, Sid Meiers Civilization: Beyond Earth is about what comes after that: more squabbling for cultural dominance, but on the surface of an alien world.What this boils down to, basically, is more of the Civ you love, but with satellites overhead and giant alien krakens lurking in the ocean depths. This game has been hyped as a spiritual successor to Sid Meiers Alpha Centauri, and while elements of that beloved game are certainly present, the influence of the Civ series feels a lot more prominent. But fans of Civilization V shouldnt get too comfortable either  the sci-fi elements go far deeper than just being cosmetic additions, and will have a dramatic impact on the way you approach the game. If youre not familiar with Civilization, you should give Civ V a try while its still free and see why this series is the reigning king of the 4X strategy genre.Mankinds new home is well and truly a new frontier  one with several topography types to pick from  and even before you land youll have several vital choices to make. Instead of choosing from dozens of potential nationalities, Beyond Earth gives you a pick of eight civilizations (ranging from an American megacorporation to a cabal of Australians and Polynesians), each with a substantial factional bonus that distinguishes them from the others. You can further define your faction by choosing the resource specialties of your colonists, which affects the output of each city you build. You can customize your spaceship to gain sort of advanced knowledge of the planets surface or an advantage in city placement or starting energy (the games currency.) Finally you can choose the cargo your colonists brought with them, which will let you start with unit, building, or technology already available.Instead of moving a settler to your desired starting point, youll pick a spot within a small radius for your ship to land in, and your city will be founded there. From that point the early game will feel pretty familiar to long-time fans  you must develop tiles on a hex grid to yield resources like food, which makes your population grow, and production, which lets you build things over time. Energy lets you buy improvements and units right away if you have enough, while culture lets you establish virtues (similar to Civ Vs social policies, though theyre all available from the start) that further affect your resource output and unit behavior. Youll start to notice some substantial changes, however, when it comes to science. Gone is the linear tech tree from previous Civ games, replaced with a sprawling web of options. From the word go you have six branches to explore, with further more specialized branches shooting off from them. Each branch also has one or two ultra-specialized leaf technologies that can confer serious advantages (though investing in them tends to be more costly). In addition to giving you new buildings and units to play with, certain technologies will also advance your affinity level.One of the big overarching themes of Beyond Earth is the question of how mankind will adapt to a new planet  will use technology to bend it to our whims, cohabitate with the alien life, or reject progress entirely to preserve mankinds ideals? Depending on your answer, your Civilization will develop an affinity for Supremacy, Harmony, or Purity. As you gain levels in each category youll unlock passive bonuses, first affecting how aliens react to you, then changing how your units interact with the world (supremacy specialists will get free roadways, for instance, while harmonious players will be healed instead of hurt by clouds of toxic alien miasma). Theres nothing stopping you from pursuing two affinities at once, but doing so will mean it takes you longer to reach the late game.Each affinity has its own unique victory condition that can be reached through researching certain branches of the tech tree. The harmony victory involves communing with a mysterious life form that dwells within the planet, eventually melding with its hive mind to transcend humanitys limitations. Both purity and supremacy require that you make contact with old Earth using an FTL communication satellite and build a warp gate to reach back home, but thats where the similarities end. The purity victory allows the rest of mankind to leap across time and space their new home  the Promised Land. Meanwhile, the supremacy faction seeks to return to earth and forcibly emancipate mankind from its greatest downfall  humanity itself. You can also win as any faction by making contact with the progenitors, a race of ancient aliens whove left remnants of their society spread across the planets surface. These four win conditions are distinct and well-themed, posing the sorts of philosophical quandries that are at the root of all good sci-fi, but if youre so inclined any affinity can forgo them entirely in pursuit of good old-fashioned world domination.There are many ways to fight in Civ, not all as straightforward as bombs and bullets. Combat is as solid as weve come to expect from the series  a tight rock-paper-scissors balance between infantry, ranged units, and cavalry, with cities powerful enough that youll need a substantial advantage in firepower if you want to lay a successful siege. Aircraft give cities an extra layer of defense, and in Beyond Earth the areas around them can be further enhanced with orbital units that grant buffs to every friendly unit below. It can be much easier to disrupt a city from within, using your spies to steal energy and technology, convince their soldiers to defect, or even stage a coup detat, taking the city for yourself without bloodshed. Regardless of what tactics you use to pursue domination, though, you will want to pay heed to the affinity system anyway.Advancing through an affinity grants serious upgrades to your military, and lets you develop unique units in the mid-to-late game. Players who merely focus on researching military tech will be left at a severe disadvantage, and while players who scour the planet for ruins and focus on building satellites might be able to reach their win condition quickly, chances are theyll be steamrolled (possibly literally) before they get there. Purity factions will build big, bulky, hovering war machines to keep their human pilots safe and uncontaminated (ironically, their spies can plant dirty bombs in other factions cities). Supremacists use cybernetic augmentation and cloud-based thought sharing to shed their human weaknesses, and their sleek robotic armies are capable of superhuman co-ordination (plus they have some giant screw-off robots that dont mind breaking formation). Those flying the banner of harmony will eventually be able to tame the planet and fight alongside its alien inhabitants, bringing giant hydras into battle and using spies to sic monstrous siege worms (think Tremors but scarier) on unsuspecting cities.Dealing with the aliens adds another unique wrinkle to Beyond Earths dynamics. Unlike the barbarians in classic Civ games, aliens are not inherently hostile. They spawn from nests spread throughout the map and roam the world at random, but the odds are low that theyll attack you unless you get in their way. If you cross them, though, youre in for a fight. If you try to wage a war in the early game theres a not-insignificant chance that it will be crashed by some aliens  or worse, a siege worm. These hulking monstrosities have more health than your average city, and it usually takes a good half dozen units to bring one down. This sense that its you and your fellow colonists against the planet encourages co-operation early on, before ideological differences and a shifting balance of power almost inevitably throw you into conflict. As such, the escalation into war feels more organic and natural than it does in the average game of Civ V. On the other hand, city states arent really a concern anymore. Instead of having their own territory and armies, minor factions occupy stations, and wont attack at all unless theyre attacked first. You cant take over their territory if you defeat them either  youll only gain some resources by salvaging the wreckage. Stations are intended primarily to serve as trading partners, providing substantial boosts to resources like Culture or Production. You can also establish trade routes with other colonies or between your own cities, but doing so provides benefits to both sides (production and food for local trade, science and energy for international trade) and is usually less lucrative than connecting with a station. As such, the only real reason to attack a station is if one of the other players is pulling too far ahead with their help (or if another station assigns a quest to destroy them), and using such a disruption strategy can often lead to war.Of course, a big draw of the Civilization series is its historical themes  it allows you to learn about mankinds past and pit historys greatest leaders against one another. As a work of speculative fiction Beyond Earth doesnt have that advantage, but to compensate Firaxis has filled the Civilopedia with page upon page of lore about the various factions and the Great Mistake that drove them away from Earth. While this lore makes for a fascinating read, the real focus of the game is on what happens next, so Firaxis has also tried to inject narrative elements into the proceedings through a quest system similar to that of Endless Legend. In contrast to the simple city state quests of previous games, each of these quests has its own mini-story, and asks you to make decisions that can affect your citys resource output as well as your affinity. Taken individually the writing for these quests isnt nearly as strong as that in Endless Legend, but strung together they tell a surprisingly fluid emergent story about your Civilizations progress toward whatever future suits its ideals.Aesthetically, Firaxis has done a great job selling the otherworldly nature of Beyond Earths setting. The landscape is green and blue like youd expect of a habitable world, but in subtly-off shades that that make it seem a little alien. Bizarre geography adds to the effect, with chunks of land separated by vast glowing chasms and immense turquoise mountain ranges. Flora and fauna, too, are strikingly odd, looking almost like something youd expect to find on the sea floor. The various human factions all start out in uniforms that look like an evolution of NASA gear, but as their affinities develop theyll lean toward appropriate looks. Purist gear is bulky and well-armored like modern military hardware, supremacists look sleek, grey, and well-optimized, and harmonizer vehicles and suits adopt the smooth curves and blue-green color scheme of the alien landscape. The games visuals are well thought-out and well-realized, but then we really shouldnt expect less from Firaxis.Speaking of what we expect from Civilzation, the orchestrated music in Beyond Earth is incredible. It takes remarkable skill to craft songs for a linear, single play-through experience, but to compose ambient music that people can listen to for hundreds of hours without getting sick of it is impressive, to say the least. Firaxis brought on four composers for Beyond Earth: series vets Geoff Knorr and Michael Curran, relative newcomer Griffen Cohen, and industry legend Grant Kirkhope. Many of the tracks are dark and moody, eliciting a sense of mystery or tension with subtle shifts in tone and tempo. Others can only be described as  and I am loathe to use this word in nearly any other context  epic. Previous Civ games have done an excellent job of capturing the scope and scale of not just one battle, but the full weight of human history in a few carefully-chosen notes. Here the songs are different enough to instead convey the wonder and majesty of our future, but the effect is similar  its very easy to get caught up and feel your heart swell as a song hits its crescendo. Though obviously no track in the game is quite up to par with Baba Yetu, its easy to see why this was the first game series in history to win a Grammy.Closing Comments:It must be an interesting challenge for developers of a series so focused on history to tackle questions of humanitys future. Obviously both subjects tap into many of the same sources, but where most Civilization games explore who we are, Beyond Earth systemizes who we could be. This is a work of speculative fiction that allows the player to speculate for themselves, starting from a similar place each time but potentially reaching vastly different conclusions. Its also a tightly-designed, well-balanced 4X game that is sure to consume many gamers free time in the coming months and years. Thats one bit of speculation Im confident in.", "date": "October 23, 2014", "grade": 4.5}