{"name": "Tears to Tiara II: Heir of the Overlord", "ref": "https://hardcoregamer.com/?post_type=post&p=111805", "text": "Tears to Tiara II: Heir of the Overlord is the sequel to the mid-2000s SRPG released first on PC and then again three years later on PS3. Sadly, that first game never made its way to the States, thus making Heir of the Overlord the series debut appearance here in the West. As such, publisher ATLUS and developer Aquaplus have given us an adventure that feels fresh, due to the general lack of Japanese SRPGs on consoles these days, but also one that doesnt break new ground.Tears to Tiara II is a story-heavy game, as most of its ilk are. After all, these titles are usually two-trick ponies: they focus extensively on combat, and all that goes into preparing for it, and lengthy talking scenes between the encounters. The latter is a strong point for Heir of the Overlord, though, as it covers a lot of themes and events, making it an RPG that is widely different from something like Disgaea due to its serious plot. While as of late it seems JRPGs have strayed away from dire storylines that encapsulated the PSX and PS2 eras, instead emphasizing light-hearted fun and Otaku-obscurity, Tears always seems to keep its eye on the prize, rarely wavering from dramatics and intense narrative devices that rely on love, betrayal, oppression and war. That said, while its a compelling tale, it is nevertheless one weve heard many times before. To that end, the story can fall into overused tropes, resulting in more than a few eye-rolling occasions at predictability of it all. Its a good enough account on the whole, with some twists and turns that are delivered without being telegraphed; thus, people wanting something epic in scope will find much to like. Sadly, though, sometimes its desire to build a fleshed out world gets in the way of actual gameplay. Tears to Tiara II can almost be thought of as a visual novel with combat scenarios sprinkled in every once in a while. Meaning to say, some of the talking segments can literally last hours. Thats not hyperbole, and to have an event scene go on for almost 150-minutes is borderline insanity. While this indeed helps establish certain character motives and unveil big crescendo moments, the out-of-balance pacing is taxing.Having said that, it does help that the characterization in Tiara II is unique and often interesting. The reliance on ancient mythology is a nice touch, as well, sure to entice anyone who loves such trappings. Hamil, the games protagonist, is particularly fascinating, his personality initially morose to the point of being hard to relate to, but eventually coming into his own and by extension turning out to be extremely likable. He actually ended up being one of my most favorite leading men in a roleplaying game of the past few years. This is an example of something Heir of the Overlord does proficiently: over the course of the expansive runtime, characters actually evolve with the world around them. As circumstances peak and valley, so too does the cast; they react, become effected by and ultimately change because the situations in which they are embroiled change. Much of the sound storytelling can be credited to the localization team, though, as they seem to have a solid grasp on how to convey emotion through mere text. Because this is a text-intensive game, its imperative that the prose themselves are top-notch. While there are occasional editing issues, ATLUS have hit a homerun with the translation, even if it is needlessly wordy at times. It helps, too, that the Japanese voice acting is superb. The lack of dual-audio is a missed opportunity, however, as this type of inclusion is becoming more standardized in such releases. Of course, a small budget game like this isnt given the luxury, or the financial backing, for such a feature. Thus, purists will appreciate it, and those wanting something a bit more accessible, or English VO-friendly, will be let down.But as mentioned, SRPGs are two parts: story, and combat. Tears to Tiara II is a traditional, grid-based strategy RPG with poise and refinement. Its not a new system, but where it lacks in originality, it makes up for in options. Battling here necessitates thoughtful positioning and optimal assaults wherein players use the host of action options given to them to their advantage. Missing out on a tactical maneuver of any kind can mean certain defeat, as even on normal Tears can be a challenging game. On hard difficulty, its punishing. Maybe not Natural Doctrine levels of punishing, but its tough all the same. This makes besting the AI via a well-designed strategy even more paramount to victory. The number of ways to achieve success is pretty vast, too. Unlike the just-mentioned Natural Doctrine, we never felt like we had to play Tears a certain way to win. Instead, it allowed for problem-solving and creative solutions, never trying to push its agenda of how players should experience what it has to offer.Some of the more interesting features of combat are the opportunities to tame monsters and swap characters in and out of battle through a setup similar to Disgaeas summoning circle. These arent game-changing concepts, but they add pizzazz to the more routine mechanics. To gain a good understanding of how the battles go down, just think of titles like Final Fantasy Tactics or the Disgaea juggernaut. Its all executed well, and folks who like stat-crunching will probably get the most out of the experience, but the games reliance on grinding will equate to hours and hours of monotonous, meaningless combat. Yet again, we get back to poor pacing: players may need to grind for hours to best a particular encountersuddenly putting hours between talking portions.Although the gameplay and story are fairly strong, the same cant be said about Heir of the Overlords visual presentation. In fact, the aesthetics are generally ugly. Outside of making poor use of the PS3s technical abilities, the art direction is truly anacquired taste. Models have a caricature-like feel to them thanks to how they were created; they are somewhat chibi in design, but have enormous arms and heads. This clearly was an intentional design decision, but its one that feels at odds with the serious tone and heavy thematic messages of the story. Moreover, the characters arent depicted in this way during cutscenes or in their dialogue/talking-head box, making the juxtaposition all the more jarring, and well, weird. It begins to detract from the narrative overall, which in our book is a failure. Ones art direction simply should not get in the way of the story. Aside from that, the texture work is especially bad to boot, sometimes looking like there arent textures at all, rendering the whole game an early PS3 look-alike. This all is too bad, especially when considering how great the characters look in the actual animated cutscenes.At least, then, the audio fidelity is stellar. The soundtrack in Tears to Tiara II is quite the powerhouse. Although many of the tracks are apparently rearranged from the first games release, most western players will have never heard any of them. The tracks themselves range from inspiring to taut, seemingly knowing when to slow things down for an intimate scene, and when to put front and center wailing electric guitars and thumping percussion. Theres a great sense of cohesion with the tracks, each feeling like something of an extension of all the other songs. In constructing such a wide breadth of compositions, sometimes a composers style is lost in all the diversity. Thats not the case here, though, making this a wholly fulfilling and downright beautiful OST. Closing Comments:Tears to Tiara II: Heir of the Overlord is a more than competent SRPG. Its combat is tactically-sound, though not unnecessarily complex to the point of being inaccessible. Furthermore, it has a story to tell, and does so with a degree articulation and a cast of well-developed characters. In the process of telling its tale, however, it forgets how to pace itself leading to a regular occurrence of front-loading information by way of event scenes that can literally last hours. This, coupled with the incessant need for grinding between battles, makes Heir of the Overlord a JRPG that simply doesnt respect its players time. Should that not matter to you, theres plenty to like here. Just know its going to take a while to see it all.", "date": "October 16, 2014", "grade": 3.5}