{"name": "Borderlands: The Pre-Sequel", "ref": "https://hardcoregamer.com/?post_type=post&p=110854", "text": "One of the biggest and best IPs to come out of the last generation was Borderlands. It mashed RPG elements into an overly enjoyable first person shooter, while boasting an astonishing amount of loot to dig through. The world of Pandora was massive, and while the stories lacked depth, it still contained some of the most comical dialogue and characters around. While Gearbox Software has had a shaky track record as of late, the Texas-based developer has joined hands with 2K Australia to develop a prequel to the second game, hopefully giving more insight into Handsome Jacks motives and actions. Introducing new Vault Hunters and a low gravity environment, Borderlands: The Pre-Sequel is shooting for the stars.Like every Borderlands game in the past, there are four playable characters to choose from: the badass gladiator Athena, the hardened gunslinger Nisha, the robotics expert Wilhelm, and ever so comical Claptrap. Having used all four characters for an extended amount of time, Claptrap is by far the best and most unique selection. Each character does have three skill trees to spread their points across, but Athena is treated as the melee tank class, Nisha is the enemy clearer and Wilhelm is the distraction. Claptrap on the other hand has his own unique traits, mainly revolving randomness. Players can go down the route of having a Claptrap that receives boosts from helping others or being aggressive in combat, but the tree that stands out the most is the Fragmented Fragtrap. This introduces bonuses and reductions to weapons and health at random, causing a little bit of chaos, yet fun into the mix. The little robot buddy even has a special skill that will assess the situation and establish a power from another Vault Hunter thats best suited for the job. Sometimes hell receive dual wielding weapons, a mini-Claptrap that will attack enemies, or he could turn into a rubber ducky. It certainly helps that he has by far the best dialogue between the four characters, interacting with everyone in less of a serious manner. The other three characters are not bad selections, but Claptrap is the only one that offers a new type of experience than weve become accustomed to. While the core story takes place before the events of Borderlands 2, centered on Handsome Jacks fall to tyranny on Pandoras moon Elpis, the narration itself is primarily set on the floating city of Sanctuary as Lilith is interrogating Athena. The narration can be a bit strange if the player doesnt have Athena in their party because she will be the one thats talking in the background and appear in cutscenes from time to time, saying things that may be out of context to whats going. Regardless, this is an entertaining way to tell a Borderlands story, even though, most of the quips from Lilith and others vanish a couple of hours in. Its definitely something that should have been pushed harder. Familiar faces such as Torgue will chime in during quest related scenarios, but sometimes its difficult to indicate what version of a character is talking. True to the franchise, the story is pretty lacking, but whats different this time around is the dialogue and script are unfortunately dry. The problem is that almost all of the jokes and references are not clever, and sometime end up being awkward, even for the Borderlands universe. It just doesnt have the wit or charm that past games have had, but instead shouting out what seems like randomness. Thats not to say its the entirety of the campaign thats like this, but its definitely lacking for most of it.It should also be noted that this is the shortest Borderlands game by far. It took us roughly 25 hours to complete everything in a single playthrough, thats including the post-game raid boss, which is just a stronger final boss, and all of the side-missions. Its difficult to determine if it being short is a good or bad thing considering how mediocre most of the content is. Some of the main missions can be creative, but the side quests are unoriginal and sometimes even require you to do the same thing over again in another area. It fails to venture outside of its bubble as side activities are mainly coated as fetch quests, defense missions, and assassinations. If most of the Australian-accented quest givers had better dialogue, it could have made up for it, but we are left with uninspired and rather tedious mission structures only completionists will run to. At the very least, the side quests do feel a part of the world, not segmented bits that dont seem to belong. There are also nine different bosses throughout the campaign, and only two require any specific strategy to defeat. The rest amounts to nothing more than unloading a clip on them continuously before their health bar is depleted. Loot has always been a significant part to what made Borderlands special. There were what seemed like infinite combinations of weapons, and finding the next chest felt exhilarating. Unfortunately, the loot in The Pre-Sequel feels somewhat limited. For one, throughout our entire campaign, no legendary equipment was found outside of a vendor. Every loot chest, besides those that need 40 Moonstones (which is equivalent to Eridium), almost never includes unique or epic items, and more times than not, useless common weapons will be found. Bosses do occasionally drop good loot, but the equipment that will be most appealing will be found at vendors, making this more of a grind for cash than anything else. It wont be uncommon to find yourself playing with under-leveled equipment for quite some time.With all that said, the core gameplay is still enjoyable, even though its placed in a sterile world. Players initially start off with two equippable weapons, along with the standard shield slot and class-based item. The biggest new addition is, because theres no air on Elpis, a piece of headgear must be obtained to act as a characters use of oxygen. This oxygen tank depletes over time when in space and recharged in bubble stations or strange cracks in the ground. This adds a whole new dynamic that, while can be a bit frustrating at first, does offer new and interesting ways of traversal. The player can sacrifice O2 to boost in air, and being that gravity on the moon is low, moving through the environment can be both speedy and satisfying. In addition, these pieces of equipment also offer slam attacks, so boosting up into the night sky and pressing the crouch button will hurl the player towards the ground to perform an AoE attack. Later in the game, these become significantly powered when attaching elemental effects, such as corrosive or ice, causing unbelievable damage to everyone around. Laser rifles have also been added to the large arsenal of weaponry, and they are a stellar addition as they come in various forms of attack patterns, whether in a constant beam or three spread shot. The problem is that Borderlands: The Pre-Sequel can be incredibly unpolished in spots. We ran into multiple occurrences where we had to quit out of the game in order to clear things up, including having NPCs block the way, not open specific passages and even our characters put in what seemed like slow motion animation when moving. There were so many instances where, in a Fight for your Life! state, our characters were unable to shoot their weapon at all, resulting in an unnecessary death if no one was around to revive them. Its also something to mention that the number of geometry that can be passed through is exhausting. There are railings, rocks, spawn caves, and so many other places on Elpis that didnt include a proper collision detection. On the other side of the spectrum, invisible walls are found sometimes in the weirdest spots, not allowing the player to fully venture where they clearly should be able to. This is an open world RPG so its somewhat expected to have a couple of bugs here and there, but the lack of polish can be staggering at times and it almost feels like an unfinished game because of it, causing nothing but frustration.Its hard to gauge Borderlands: The Pre-Sequels visual traits only because most of the game is made up of generic, uninteresting environments. When the player first steps on the surface of Elpis, they will feel ecstatic over the idea of adventuring into unknown territory. The moon of Pandora has some absolutely gorgeous backdrops, but whats mainly in front of the player will disappoint them after twenty hours of staring at the same structures over and over again. The moon is a boring wasteland of grey rocks and metallic fortresses that, while its exciting at first, wears thin mighty quickly. Even when the player makes it off the rock and onto the space station of Helios, the environments dont change drastically enough to make a meaningful difference. Its only near the end of the game when the palette does look different from the rest, practically mocking Halo, but its a little too late at that point. There are a few differently positioned spots in the world, but not only are they weighed down by the underwhelming lack of variety, but some are straight up pulled from past games, both in terms of assets and creature types.It certainly doesnt help that, including the infrequently inaccurate invisible walls, the graphics can look just plain bad. Borderlands has never been about poly count but instead its colorful artistic design, and while the core cast of characters and sections of the world do look visually appealing, a lot of The Pre-Sequel can be cringe worthy. Playing on PC, gamers have come to expect a certain quality for what theyre buying, and when you have textures that look like theyve been pulled from a fifteen year old game, then you have a problem. Even the cables that run throughout the environments are a single, flat polygon with a crummy gradient texture. Granted, while these arent necessarily isolated incidents, the majority of the game does look fine, as much as it becomes rather dull. Closing Comments:Its hard to follow-up on what Gearbox Software has created over the last two iterations and what The Pre-Sequel brings is nothing short of a letdown. While 2K Australia were able to replicate certain parts of what made the Borderlands series fun, the frequent bugs, dull script, short campaign and repetitive world design will leave fans disappointed. It doesnt help that the only playable character that changes the dynamic of how comical the story can become is Claptrap, with the rest of the cast giving a stale performance and resonating no personality. Thats not to say the shooting mechanics arent entertaining, and the physics of low gravity makes traversal fun, but the loot system feels scaled back unless youre willing to grind cash to buy something from a vendor. Borderlands: The Pre-Sequel is an unpolished, uninspired adventure where fun can be had with friends, but that time could be better spent elsewhere.", "date": "October 13, 2014", "grade": 2.5}