{"name": "Alien: Isolation", "ref": "https://hardcoregamer.com/?post_type=post&p=110758", "text": "At a time where games with helpless protagonists fleeing from certain death are hotly becoming the new standard for survival horror, Alien: Isolation stands out from the pack. The style, made popular by Amnesia and continued recently with Outlast, relies on the premise that horrifying things should be more powerful than the thing theyre trying to scare, which especially doesnt seem like much of a stretch for this SEGA-published installment of the genre. After all, the Alien in this game is based off the one from Ridley Scotts masterpiece Alien, where the titular character wasted an entire ship and its crew in less than two hours. Game on.Instead of being able to kill Aliens with a couple of bullets, (looking at you, Colonial Marines) Isolation gives the creature the respect it deserves, placing Amanda Ripley, daughter of Ellen, aboard a spaceship with no hope and the realization that everyone she comes into contact with will die a brutal death. That is, unless Amanda can escape much like her mother did. The comparisons between the two characters jump off the screen in Alien: Isolation. Ellen Ripley has some large combat boots to fill, both with stature and attitude, and ten minutes into Isolation, Amanda shows that the apple doesnt fall far from the tree.The strong, likeable protagonist makes the game all the more scary, by giving you someone to care about and putting that person in danger, and danger is everywhere aboard the Sevastopol Space Station. The game can be played for upwards of four hours before ever encountering the Alien. If someone were to draw up a frequency chart of deaths before and after encountering the Alien, the latter half of the graph would be populous, to say the least. And thats not because the Alien is the only real threat; people and malfunctioning, I-Robot-esque androids provide a nice buffer of traditional foes still capable of ending Ripleys life in mere seconds.The games difficulty was on display at PAX, where players had a simple challenge mission to do but had to do so without dying. Only a few people completed the challenge the entire weekend, according to reports by developer Creative Assembly. Playing the game, its easy to see why so many people struggled. The Aliens AI is as advertised: hard to predict, hard to distract and hard to sneak around. It doesnt follow a path, and its non-traditional style of AI irked some players who felt its seeming randomness was a defect. Creative Assembly went so far as to call the Alien sentient when describing its AI. Although this reviewer wont take that jump, its refreshing to see an enemy with the propensity to turn around for any or no reason, the way a person playing hide-and-seek (or hunting other people) would do.The human and android AI pales in comparison, which could just be Isolations way of making the Alien the main enemy to fear. When a person is encountered, youll be more afraid that they will fire off a shot that attracts the Alien than you will be afraid of that shot actually killing you. Before that happens, its hard to guess what the Alien is doing when its not an ominous blip on Ripleys radar (which fortunately bears no semblance with a minimap). Theres nothing scripted about it. Sometimes it will show up to a level, kill you and all the NPCs only to be nowhere to be found when you reload your save.The intelligence of the main antagonist helps carry the game throughout its considerable playtime by giving it a true element of unpredictability. Depending on how often you die, which directly correlates with what difficulty you play on, Alien: Isolation can easily last 20 hours. While its laughable to consider a twenty-hour game too long, merely because of that fact, whole segments of Isolation objectively didnt need to be in the game, while others required an unnecessary degree of backtracking. This kind of padding is expected, to some degree, and Alien: Isolation does a good job of making these segments enjoyable while playing them.If youre a fan of the Alien series, this game will hit home. While the later titles got away from the innate fear factor, in favor of bigger set pieces and more Aliens, the original Alien film knew that true horror is achieved best through helplessness and (forgive me) isolation. Ellen Ripley and the crew were all alone aboard the Nostromo, save for the creature lurking in the shadows. Alien: Isolation kept with that tone, and even stuck to the gold standard of monster movie narratives by giving ample time before ever showing the Alien.For a game that bills itself as survival horror, the fear tapers off pretty quickly. Although the game lets your imagination do most of the work, theres a point where that runs out. The sound and music crews try their best to keep you scared, with no shortage of ambient thumps and bumps to keep players on their toes. The low bass tones combined with high-pitched string screeches evoke a feeling reminiscent of watching The Shining, where something just feels off. Those expecting to be scared all the way through will be disappointed, but Alien: Isolation certainly doesnt flounder in the absence of fear; the fear is simply replaced by a feeling of desperation and intensity that even the most in-your-face action games fail to replicate.Closing Comments:The game becomes less about being scared of the Alien and more about confronting a worthy adversary and trying your damndest to best him at every turn (by running away from him, of course). The crafting and resource system allows several different methods to distract it or ward it off for a time  usually a short, short time  but none of these methods are foolproof. This makes Isolation the highest-stakes chess match you will ever play, and theres nothing wrong with that. Despite having a few superfluous levels, Alien: Isolation ends up being a game Alien and survival horror fans can hold in high esteem.", "date": "October 11, 2014", "grade": 4.0}