{"name": "Project Spark", "ref": "https://hardcoregamer.com/?post_type=post&p=110256", "text": "Project Sparks beta has been a highlight for the Xbox One in 2014. It gave people a bit of single-player quests, game creation and the ability to play user-created content that was quite good. Its microtransaction model was a bit iffy for a beta, though, and has been greatly downplayed in the final product. The forty dollar starter pack gets you everything from the beta, some theme and content packs for creation suite, and a slew of single-player missions as well as access to any user-creations that you want. The user-generated stuff is free for all, and like the LittleBigPlanet series, is likely going to be the thing that keeps people coming back to the game for years to come.The single-player campaign called the Champions Quest is an action-adventure game with swordplay, some RPG-style conversations around towns and tutorials about the mechanics of things. Under the guise of fetch-quests, players are actually taught about the games whole brain system which plays into the creation aspect of things. The brain controls every action a character is given  so if you want him to jump, youll have to go through the flow chart-esque menus and assign that function to whichever button youd like and then go a bit further to ensure that there isnt a delay in your actions. This is key because if not done properly, the result will be something that technically works, but doesnt play smoothly. While the LittleBigPlanet series may take the cake for narration, Project Spark has the best and most user-friendly game-creation tools yet in a commercial game. No matter if its the LBP games or even the Trials franchise, in-game creation tools have never quite worked out for me. This breaks things down step by step and doesnt explain how to do something, but guides you through it with an interactive tutorial and explains why its important. This results in the experience being a lot of fun even for those whove struggled with game creation before.A lot of tools are available to work with, and practically anything can be made with the starter pack. So far, users in both the community and part of the Team Dakota development team behind the game have made excellent original games and some stuff heavily inspired by other things as well. Theres a fantastic Angry Birds clone available, as well as one for LIMBO and something that will bring back a ton of memories for Geometry Wars players. Variants of Tetris have been around since the early days of the beta, and the top-level stuff has received updates. Some games, like the ones inspired by the TV show Wipeout, have major collision issues but otherwise play fine. The most impressive thing about whats been made is the diversity. Theres platformers, puzzle games, shooters and 3D action-adventures that all feel natural. The first LittleBigPlanet was hurt by games being shoe-horned into genres that they didnt quite fit due to the limitations of the tools, which later creation-based games fixed up. Theres nothing like that here, and while theres a lack of fine-tuning, whats here is impressive given the relatively short length of the beta. Much like LBP, Project Spark is going to have a long tail to its overall lifespan. Plus, if you see something you like and want to tweak, you can choose to remix an existing creation. Visually, Project Spark looks like something between the Xbox 360 and Xbox One  which isnt an altogether bad thing. The hair and character models look cartoony, with an almost Xbox Avatar-esque plastic sheen, but they fit the environments nicely. Animations are smooth and never feel clunky despite the tools having to work well for a variety of genres. Reflection effects off ice are incredible, while lighting effects can be a bit overdone. Generally, theyre reasonable and never blinding, but some user-made games are hard to see due to extreme lighting and can be hard on the eyes as a result. For a creation suite with a fairly limited amount of themes so far, its impressive just how colorful things can be. Most games have the fantasy world setup, so theres a lot of foliage, but anything with the sci-fi tools pops with color.The voice work from narrators and other characters is good but nothing special. Its got enough life to it to keep people engaged, but never stands out or elicits a chuckle like the LittleBigPlanet series. Musically, everything is cheery and becomes a bit grating after extended play sessions. There are some user-created song programs available, and those are pretty good. Sound effects for slashing, jumping and magic throwing are solid. Closing Comments:Project Spark is the most user-friendly game creation suite to date, enabling one to be crafted with less work than anything else like it on the market. Theres an impressive array of games to play thanks to the user-creation tools, and theres something for everyone to enjoy as a result. Visually, colorful games can be made that are about on-par with Xbox 360 titles. The default campaign works both as a standalone experience and tutorial  teaching skills to passively be absorbed. Despite some rough edges and weak audio, Project Spark is a must-buy for anyone interested in game design.", "date": "October 10, 2014", "grade": 4.0}