{"name": "Final Fantasy XIV: Endwalker", "ref": "https://hardcoregamer.com/?post_type=post&p=416483", "text": "Its amazing how far Final Fantasy XIV has come from its original conception. The 1.0 release over ten years ago was met with rightful criticism due to its inconceivable designs. It was nothing short of a disaster that crippled the Japanese giant, so its even more impressive that they not only bounced back in creating the best MMORPG on the market right now, but ushering in the most profitable title in the franchises thirty-four-year continuous run. Its one of, if not the most, impressive comeback stories in gaming history. Its even more astounding considering how the MMO has evolved since A Realm Reborn. Shadowbringers was this crucial step that contained an emotionally-charged narrative that resonated with many players. It helped that the villain wasnt just someone waiting ominously for the player to arrive, or was evil for evil sake, but someone who you could actually sympathize with. With the next expansion, Endwalker, Square Enixs Creative Business Unit III has gone above and beyond in creating an even bigger, better and more impacting story that will leave you battered and broken at the end.While most MMOs emphasize raid bosses or the need to get to endgame as fast as possible, Final Fantasy XIVs is all about story, and what a story it has. Just when we thought the developers couldnt top themselves with Shadowbringers, Endwalker had to show up and steal its thunder. This is easily one of the best Final Fantasy stories ever told, featuring a compelling narrative strung together by surprisingly strong antagonists  at least to a certain degree. Fandaniel is a lot more enjoyable than he was over the last year, and most importantly, still has one of the most punchable faces. Zenos also grows ever so slightly, but his character still retains that sometimes infuriating ego which no doubt will turn a lot of people off. Unlike Shadowbringers, though, what sells this isnt the villains, but a dark and dreary question the expansion poses halfway through. More than anything, it focuses on not necessarily an existential threat, but more of a crisis. It deals in not only death but the ideals of life itself, questioning what people strive for, and what makes them keep going. As you can imagine, this opens up a lot of questions in itself, leading to a dark and deep story you wont be able to put down. It was stated that this would be the longest expansion yet, and it lived up to this promise as its upwards of fifty hours, and every moment had us glued to our seats. It invokes so many reactions; from fear (which it has a surprising amount of horrific events) to sadness, Endwalker is a rollercoaster ride of emotions that you dont want to get off. Theres an incredible number of twists and turns youll never see coming; just when we thought we had this plot figured out, it throws a curveball. Now Endwalker does require the player to have gotten through the entirety of at least Shadowbringers to fully appreciate the events and reveals, but it does a phenomenal job setting up new and old threats. In fact, this somehow enhances and expands upon the events in Shadowbringers, making us appreciate it even more. It goes in wild, unpredictable directions, to the degree that the events in Heavensward and Stormblood feel insignificant in the grand scheme of things. The universe has been completely blown wide open and while this concludes the story started over a decade ago in a perfect way, tying a knot on almost every little loose end, we feel almost lost as we have no clue where the storytellers could possibly go in future expansions. In the end, Endwalkers story is a masterpiece that must be experienced by anyone who enjoys a good tale.Outside of finally bringing bunny boys to the game, Endwalker also establishes two new jobs: Reaper and Sage. Reaper is a welcome addition, even though theres now an excess amount of melee DPS in comparison to casters or physical ranged. I was hesitant on Reaper, even during the Media Tour, as its base is a relatively simple job wrapped in a complex number gauges to maintain. While some melee such as Dragoon and Samurai become a little busier, Reaper is by far the busiest. Fortunately, its rewarding to play and has some of the flashiest animations you can find. As for Sage, this is by far my favorite new healer. As someone who plays on a controller, the modifier Eukrasia is a godsend, especially considering a job such as Astrologian, which had far too many actions prior, has received far too many new skills. This allows you to modify an attack or heal into a dot or shield heal, which cuts back on the amount of UI clutter. Sage also encourages doing more damage as Kardia essentially acts as Closed Position (dance partner), allowing every attack you land to heal your partnered individual. Both of these new classes just feel good to play, alongside most of the positive changes to existing favorites. Same as past expansions, there are three trial bosses alongside six new dungeons (plus two optional ones after the story has concluded). The trials have been done immaculately, even throwing off players with who they might be. A couple of dungeon final bosses probably deserved their own trials outright, but what we got were massive and well executed. Theres a good balance of elements and one of the creepiest final bosses you can image. As for the dungeons, the vast majority are exceptional. There are only two of the eight that didnt resonate with us, but even then they were spectacles in their own right. In fact, the final dungeon and one of the post-game optional dungeons, titled Smileton, are two of best dungeons in the expansion, from an aesthetic, storytelling and mechanical perspective. Outside of these core components, there are number of solo instances spread throughout the forty-to-fifty-hour campaign. The developers clearly were trying to do something a little different, some of which work, while a couple feel out of place. Theres also a system where NPC characters will follow you as you perform tasks, but considering they will be left behind if you get on a mount, moving too fast, this pads a number of sections out.From a presentation standpoint, Endwalker knocks it out of the park. The six new zones have their ups and downs, but generally are varied and unique to the overall universe, not to mention one of them is the single most beautiful areas in the entire game. Obviously, this isnt going to win any awards from a technical perspective as it still uses the same old animations weve become accustomed to, and there seems to be a good chunk of crafted and dungeon gear that has been repurposed, but the production values have been improved by a substantial degree. The music is also on point. Masayoshi Soken is renowned for his work on Final Fantasy XIV, and Endwalker brings the best out of him. While the track Answers may be used a few too many times, the original work is monumental, and this includes the remixes that take all the best themes from past expansions (and other games such as Final Fantasy IV). Whether its the calm and soothing Old Sharlayan, Indian-inspired Radz-at-Han or just the boss theme, the music in Endwalker helps immerse the player in this beautiful world. Closing Comments:Final Fantasy XIV: Endwalker is the perfect sendoff to a saga that was started over a decade ago. Shadowbringers was a monumental step forward for the MMO in terms of storytelling and character development, and yet somehow, the writers were able to create something even more remarkable. Youll go through a number of emotions: anger, joy, sadness, fear, awe and so many more. Its something that delves deep into the existential question regarding life and death, and our reason for living under suffering. It also goes in an immensely different direction, one that it felt impossible to see coming. This is all enhanced thanks to the original soundtrack that goes well beyond what we could have hoped for, immersing us in a tale we will never forget. Thats not to say there arent flaws, though, as theres a few moments throughout the campaign that felt like padding, and some of the solo instances, as creative as they may be, killed the flow of events. This is on top of a good chunk of gear being reused assets. Thankfully, all of this pales in comparison to the rest of the adventure, witnessing one of the most well-written RPG stories ever told. Truly, Final Fantasy XIV: Endwalker is like nothing youve ever experienced before, in an MMO or otherwise.", "date": "December 15, 2021", "grade": 4.5}