{"name": "Tenkai Knights: Brave Battle", "ref": "https://hardcoregamer.com/?post_type=post&p=110906", "text": "Tenkai Knights: Brave Battle is a game I wanted to like. Something about its general attitude is pleasantly reminiscent of the Game Boy Advance era where an obscure or flavor of the month anime-based game would be seen on store shelves and often times turn out to be surprisingly fun or deep. Tenkai Knights fills both of those niches as its based an anime which recently began airing on Cartoon Network in the U.S. and boasts customization as its strongest aspect. Brave Battle should be a nostalgia-filled respite from the current wave of AAA titles, but instead is one of the most frustrating games this year.Brave Battle follows the story of the anime closely, telling the story of the the Corekai army on the planet Quatron who attempted to fight off the evil warlord Villius (Im not making any of this up) to preserve their planet but were overpowered. Suddenly four heroes appeared whove mastered the Tenkai energy known as the Tenkai Knights. Valorn  the armored firepower of the team, Lydendor  the cunning warrior of stealth, Tributon  the lighting quick master of the Tenkai Bow, and Bravenwolf  the fearless leader of the group wielding a sword of pure Tenkai Energy. The knights turned the tide forcing back Villius and his army of corrupted. In a last stand, Villius unleashed the Tenkai Dragon, who was destroyed by the knights and its remains scattered around the universe. Generations passed and the four were never seen from again. Villius has now returned, however, and now threatens Earths existence, where some of the Tenkai Dragon remains have surfaced. Earth kids Guren, Ceylan, Toxsa and Chooki accidentally fall through an inter-dimensional portal where they find themselves on the other side assuming the role of the Tenkai Knights. Players themselves then assume the role of the Tenkai Knights and set off to fight off Villius the only way possible: monotonously.The controls are simple with three attack types  weak, strong and special  mapped to one of three face buttons. Theres nothing notable about them, all just minor variations of swinging a weapon. B jumps and holding it hovers, L guards and R changes the target. The lock-on system is awful as theres not much use changing targets as generally only one is attacking at a time and attempting to do this renders it impossible to change directions. Quite frankly, gameplay is atrocious. Its not simplicity thats the problem, but rather the clunkiness. Its impossible to attack while moving or jumping, making it so the only way to engage in combat is to stand completely still and spam the buttons whilst trying not to get hit. Jumping out of the way is a pain as repositioning will need to occur, so guarding needs to frequently happen. The issue with this is that enemy attacks are unpredictable so its downright impossible to get into a rhythm and successfully parry. As such, the best way to be successful in combat when difficulty ramps up is to utilize guerrilla tactics, which is never fun. Making matters worse is the game itself. What could have been an interesting fighter, strategy game or juicy Custom Robo/Virtual On type of experience is instead boiled down to a daft brawler. The entire experience takes place in a series of almost identical maps (besides the backgrounds) that take place in a shockingly empty setting devoid of anything but platforms and generic enemies. The goal of practically every level is simply to kill a certain amount of enemies. Sure, theres slight variations, but its nauseating how many levels boil down to practically doing the same exact thing in the same exact way as the very first level. In an attempt to break up the monotony, the occasion Titan battle is added that lets too giant robots duke it out instead in an even more confined area with even clunkier controls.Although customization was touted as the main draw, it boils down to being inconsequential. Customization occurs by collecting parts enemies drop through the main mission that can be fused together to create weapon upgrades or armor. Its not deep and is basically a manual way to level up to survive the increasing difficulty. Whereas in games like the aforementioned Custom Robo, seeing a tricked out robot was half the fun, none of the upgrades are all that interesting and serve as little motivation to complete the game. Theres multiplayer modes to show off in, but as they feature the same combat and basic gameplay as single player, theyre not worth experiencing.Closing Comments: Tenkai Knights: Brave Battle is a one-trick pony and its a shameful trick. What could have been a nostalgic callback to GBA days is instead a worthless cash-in on a burgeoning anime. The level of pure apathy on display must be seen to be believed, with practically everything boiling down to slight variations on the first level. Combat is frustrating, stages are painfully confining and difficulty ramps up too quickly. The one saving grace could have been a deep story, but instead its complete trite. If even a ounce of effort was put forward, Brave Battle could have been a guilty pleasure, but instead it wastes everybodys time with dreadful execution.", "date": "October 10, 2014", "grade": 1.0}