{"name": "Falling Skies: The Game", "ref": "https://hardcoregamer.com/?post_type=post&p=109757", "text": "In terms of television shows that needed a video game adaptation, Falling Skies falls somewhere between Rizzoli & Isles and How I Met Your Mother. In general, licensed games based on television shows usually are somehow less entertaining than just leaving the console off. Thus something like Falling Skies that is not just a licensed game but one with little promotion that just sort of popped up out of nowhere inspired almost zero confidence in its quality. The good news is the game is entirely playable, complete with a lengthy campaign and countless aliens to shoot. The bad news is that there is very little reason to play it, and is so lacking in both originality and fun that it begins to drag almost immediately after it starts.The game throws players into the events between season three and four of the show with a brief minute introductory segment that informs about the bad aliens turning humans into aliens by the power of adoptive parenting (seriously) and good aliens that want to stop the bad aliens because of reasons (maybe). There seems to be some sort of basic assumption that the player has been following along all this time, which is probably a good assumption to make for anyone playing a low quality, overpriced Falling Skies game of their own free will. Anyone who isnt well versed in the story can just take a quick nap during any of the many cutscenes, which are so poorly written and awkwardly acted that it is probably for the best regardless.Falling Skies is a fairly standard turn-based strategy game that essentially plays like most other similar games in the genre. There is a squad of members of various classes that can be moved around the screen and either shoot or take other actions depending on their class. Enemies are polite enough to wait their turn and then will try their hardest to kill the human squad that has been slowly walking around their stomping grounds. Characters unlock more skills as they level up, although the skill tree is extremely linear and even skipped skills can be learned with enough resources. Gameplay alternates between these turn-based missions and going back to the base to purchase various power-ups for the upcoming missions. It is perhaps one of the simplest turn-based games like this on the market, and perhaps those looking for a scaled-down, bare bones kind of experience might find something to enjoy here.Unfortunately, gameplay lacks the refinement found in bigger budget titles, and the end result is Falling Skies playing like a dumbed down version of XCOM. Sure, the individual pieces are here and at its core this is essentially the same game, but no time was taken to iron out the little details to actually make that game enjoyable. Perhaps the most egregious misstep comes from the enemy AI, which can at best be described as entirely absent. Enemies never seem to move unless you first move into their little circle of sight meaning most levels play out like the worlds shootiest game of hide and seek. Fog obscures the areas you are unable to view at the time, and it isnt until an alien comes into view that it realizes the level has started and it should probably try to start doing bad things in the players general direction. Thus, there are all these weird scenarios where you will kill an alien with a shotgun blast, a grenade and a shot from a rocket launcher, and then move two spaces forward to find there was another alien just offscreen that had to have heard all of this but didnt think it was worth heading over to help.It isnt just that the enemy AI is lazy and wont attack you until it finishes its smoke break, because when they finally do get around to doing something, they always use the most simplistic battle strategy possible. Almost all enemies (with a few exceptions) will just rush straight towards the squadron members which might be troublesome if they actually attacked in large groups, but as most of the levels have them scattered about, it is just a good way to get some target practice in. Here is a strategy that worked for almost every single level. Move the team slowly forward until an enemy is encountered. Move back and have the rest of the team defend. Laugh as the enemy cant quite make it over to attack in their turn or manages only one attack and leaves them surrounded by six guys with guns. Shoot them. Continue laughing. Move on to the next enemy and repeat. Some of the later levels are a bit trickier, but far too much of the game can be coasted through in this fashion, and enemies never really come in groups larger than one or two for the large majority of the game. Enemies with ranged attacks are a bit trickier, although they never seem willing or able to take any cover so they will fire their one shot and then give plenty of time for a counter attack that leaves them in tiny alien pieces. Heal, hide and reload as needed, but there is never any genuine strategy needed in any of these levels.The end result is too easy, and any attempt at complexity fails. Only a select few levels require any sort of higher strategy, and the enemy AI is so pitiful that it almost feels bad to just mow them over. Its like running into a snowball fight and pelting the neighborhood kids with rocks; sure the victory comes easily, but there is no escaping the profound sense of shame that comes from picking on someone that is so vastly overmatched. Some of the later levels and bigger enemy types provide more of a challenge, but not due to any sort of actual strategy they employ. They are simply bigger and tougher, requiring more shots to kill and capable of dishing out chunks of damage. Every level plays out in essentially the same way, and the lack of a more complex AI kills any need for strategy or planning which is kind of the point.There are some flickers of some good ideas, but Falling Skies never fleshes anything out like it should. The whole management of the home base system is poorly implemented and does nothing but serve as some way to break up the tedium of the missions themselves. There are various upgrades to purchase requiring specific resources, but with the exception of boosting your team size to six, there isnt anything here that is needed because of the lack of a challenge. Even basic concepts like line-of-sight are botched entirely, and there were multiple times the squads weapons took on some sort of wall piercing capacity as they were firing and hitting guys they should be unable to hit without some sort of magical rebounding bullets. This doesnt happen all the time, but what does is their ability to completely shoot through allies without any sort of penalty. A guy or two would be standing between the character and the desired target, and my crazy trigger happy shotgun wielding squad member would somehow shoot around both of them to hit the alien half the screen away.Falling Skies also looks like absolute feet and the graphics are several steps away from being passable. The actual mission segments are fine primarily because everything is so far away, but once you get in close during any one of the numerous cutscenes it becomes apparent that these are the sort of visuals that would get a first year art student kicked out of school and banned from illustration forever. The human characters reside in the depths of the uncanny valley, and their dead eyes and weird Ken doll hair make them infinitely more creepy than any of the alien monsters could hope to be. There is the unmistakable feel of the generic from everything from the level to the character designs, and this on top of the cut-and-paste gameplay makes it feel like Falling Skies has no actual identity of its own.Closing Comments:Falling Skies is a turned based strategy game, and that is about the best thing that you can say about it. Competent yet wholly unremarkable, this is a title that fails to excite in any way and does nothing to distinguish itself from any of the other, similar titles on the market. The lackluster AI and the repetitive and dull missions make even the simplest of excursions mind-numbingly boring and an absolute slog to get through. Even diehard Falling Skies fans (if they still exist) will find very little to like here. This plays like XCOM if XCOM was made by a group of scientists trying to develop the first turn-based strategy game that could also be used as an elephant sedative. Those truly interested in this should just watch an episode of Falling Skies and then play a mission of XCOM as this mixture works about as well as oil and vinegar and diazepam.", "date": "October 10, 2014", "grade": 2.0}