{"name": "Stronghold Crusader II", "ref": "https://hardcoregamer.com/?post_type=post&p=108675", "text": "The medieval times used to be the coolest era to thrust ones imagination on. You could be a knight, and slay a dragon or a king imbued with magic powers. This isnt that kind of medieval times. Stronghold Crusader II seeks to provide excitement with the harsh realities of the situation: a lord at the behest of a king, trying to maintain and build up a castle in the face of many obstacles. Battle lions, heathens and the challenges of maintaining a population on the way to ultimate castle domination, but more interesting is developer FireFly Studios battle to build on a series long past its prime.Stronghold Crusader II, like its predecessors, is a little bit Total War and a little bit Sim City, certainly a combination with lots of potential. This new addition to the series supposedly adds a new 3D engine with up-to-date physics to make it closer to a re-skin of the old titles. Starting up the game is like a trip to the medieval era of gaming, however, where 3D games were just finding their footing; though a large step up from the 2D world, the graphics are objectively bad. For a game with a zoom-in feature, there is certainly not much to zoom in on, with flat-textured characters and embarrassing animations.The actual gameplay, though, presents a challenge exactly as promised: balance the RTS micromanagement with the upkeeping a bustling economy and population. In Starcraft II, this is like having to keep your SCVs happy on top of defeating your enemy. Because of this juxtaposition, neither gameplay element gets displayed with any gusto in Crusader II. Although Starcraft II was a better analogy, the pathing and combat of the units plays a lot more like the pre-Broodwar days of Starcraft, which is to say theyre laughable at best. The city upkeep elements also become hard to reconcile with the combat, given that a significant portion of the population can be soldiers, but the food and bedspace only matters for peasants. Evidently, soldiers just feast on their own wounded.Campaign challenges are where the game excels without question. Although the sandbox mode can be fun for a person looking for Cities XL  lite with knights, the campaign steps up the challenge putting you in an already developed situation and throwing in curve balls. Stronghold requires fast learning, especially for higher difficulties. Some of the challenges presented can seem impossible until you beat them, which is the desired effect of similar RTS games.The lack of balance between gameplay styles almost acts as an immersion breaker during the most enjoyable campaign moments, though. Why are the lions (which are reproducing like rabbits, by the way) getting arbitrarily aggravated, but then returning to their lair? Why does the population not care when the king sends scores of soldiers to slaughter, but have lots to say about whether there is a brewery in town? Suspension of disbelief only goes so far when Crusader II tries to be a realistic interpretation of maintaining land in an ever-changing feudal system.Closing Comments:A game with the mechanics of both Total War and Sim City can be good, but Stronghold hasnt executed the core mechanics of either well enough to fit the bill. Taking the magic out of an often-fantasy-filled era is not the true crime here; its that Stronghold fails to improve upon the formula of its previous titles. FireFly lives up to its promise of producing a better-looking version of its first games, but thats all they live up to.", "date": "October 1, 2014", "grade": 2.5}