{"name": "Arcana Heart 3: LOVE MAX!!!!!", "ref": "https://hardcoregamer.com/?post_type=post&p=106547", "text": "Have you ever loved a game so much you simply need to shout its name from the rooftops? With the updated release of Arcana Heart 3 as Arcana Heart 3: LOVE MAX!!!!! for PS3 and Vita, fans now have just that opportunity. Of course, this fighting game needs to back up its five exclamation points with solid gameplay. A lot has changed  but much has also remained the same.Thankfully, the core fighting mechanics remain as fun as ever. Those who already own Arcana Heart 3 will be pleased to know its gameplay has been rebalanced here. The fast-paced attacks, pounding supers and an interesting Arcana system add up to quite the unique fighter in a saturated genre. Of course, theres also the fact that the cast is entirely comprised of females. That isnt particularly common outside of a few fighters like Dead or Alive (mostly) and Skullgirls.Lets dig into the gameplay a bit more. Theres a cast of 23 ladies to choose from, each with their own fighting style. This is augmented by Arcanas, which tag along to provide additional powers unique to them. When playing in normal mode, you can select a character and Arcana separately. In simple mode the game selects the official Arcana for the fighter. The fact that there are so many combinations of fighting styles to mash up leads to tons of variety. Fighting fans should enjoy mastering different character and Arcana combos.The visual aesthetics of LOVE MAX!!!!! are splendid. The sprite art perfectly captures the speed of each fighter, attack and beautifully displays explosions and bursts for each super. Lately many fighting games have gone from sprite to 3D modeled visuals to the annoyance of some fans. As such, that makes this game feel a little more authentic in presentation. There are a few tweaks to the formula, though, such as optional animated scenes on both edges of the screen. Theyre meant to display whats happening in the fight but can become a little distracting.Something that might surprise genre enthusiasts is the great deal of modes on offer. Theres the requisite Story, Training and Versus modes, but also Survival Score Attack, Trial, Time Attack and initially mysterious After Story modes. Story takes players through the relatively tame tale about an evil force which is preparing to assault Japan. Although the base story remains the same, each character has her own spin on dialogue before battles. Of course, After Story continues each girls tale after theyve saved Japan. Those who enjoy visual novel-style presentation creeping into fighting games will want to check this mode out. Here each character is given her own little storyline to read through (with some fights interspersed throughout).Unfortunately, as with the tedious storyline of Story mode, even After Story cant fix LOVE MAX!!!!!s vapid writing. Its all fine and cute in a typically anime style, but doesnt do much to hook players. Of course, complaining too heavily about fighting game storylines is silly, but its harder to ignore when there is an entire mode devoted to presenting a story. Beyond this theres even some additional backstory fluff accessible via the Gallery. If, like me, you couldnt care less about each girls history and goings on, then these features arent going to add much to the package.Closing Comments:Luckily, Arcana Heart 3: LOVE MAX!!!!! is a fighting game and not a visual novel. When focused purely on the fighting, there is a great deal to like. Battling to ascertain what combinations of characters and Arcana works best is enjoyable all its own. Of course, you can also test your skills on PSN (and engage in local battles if youre on PS3). Some players will dislike the oddness inherent from this lady-exclusive roster, but thankfully, it has engaging gameplay instead of relying purely on cute anime characters to sell. In all, Arcana Heart 3: LOVE MAX!!!!! is an extremely competent fighter as long as you look beyond the obnoxious name and narrative missteps.", "date": "September 22, 2014", "grade": 4.0}