{"name": "Disney Infinity: Marvel Super Heroes 2.0 Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=106122", "text": "When I wrote our Disney Infinity review last year, I mentioned how I found myself at Target staring at a display of figures and had to restrain myself from purchasing more. Since then, my self-control has failed and I have indeed picked up a number of new characters for my collection at Target. And Best Buy. And Toys R Us You see, I have a problem now that can only be solved by acquiring more Infinity figures. But theres worse addictions to have and if theres one thing to be learned from my example, its both the staying power of this brand as well as the physical appeal from a collectors standpoint. Disney is picking up right where they left off by refreshing the brand this year. Dubbed 2.0 Edition, the new line skews mouse house and Pixar classics in favor of Marvel super heroes. As weve already gone in-depth about the functionality of the platform in our review of 1.0, this review will focus on whats new in 2.0.Before we get cracking on Marvel Super Heroes, lets talk 2.0. 2.0 marks both new refresh for the platform and an era of incompatibility. The good news is that everything from 1.0 besides Play Sets will work with 2.0. The bad news is that nothing from 2.0 works with 1.0. So unfortunately those who have already purchased 1.0 will have to buy the 2.0 starter pack to utilize any future Infinity releases. The good news, however, is that in addition to the Base and 2.0 game, the Starter Pack includes three figures  Iron Man, Black Widow and Thor, two power Discs and a Play Set. These add up to about a $50 value, so youre really only having to shell out an extra $25 to have 2.0 compatibility. Its annoying that 1.0 Play Sets dont work with 2.0, but even if Disney continues to do yearly incompatible refreshes, it wont sting so long as every figure remains cross-compatible.The Starter Pack includes only The Avengers Play Set. There are currently two more Marvel Play Sets available: Spider-Man and Guardians of the Galaxy. The Avengers Play Set is basically a redux of The Incredibles Play Set last year, as both are sandbox-style action games that take place in similar big cities (and seem to share assets). Players can choose an Avengers hero of their choice and take to the streets of New York to stop crime from an assortment of enemies, collect seemingly endless collectibles and participate in hundreds of side-missions. While some missions can become repetitive, they never over stay their welcome, and overall theres a surprising amount of variety. The Spider-Man Play Set is disappointing in the fact that its the same world and structure as The Avengers Play Set, just with a few swapped assets (the lack or addition of Oscorp, etc). That being said, the missions vary from each other and the developers had the unfortunate luck of both franchises being set in the same city. The only way to avoid it would have been to design a linear game from the ground up, and obviously, thats not feasible here.Thankfully, however, Guardians of the Galaxy doesnt take place in New York City and its Play Set takes player to Knowhere to protect it from Ronan and his attacking Sakaarn fleet. Although its still a limited open world, this Play Set is more focused on mission structure and feels removed from its brethren. This is clearly the most intriguing of the current Marvel Play Sets as its riding the wave of popularity from the recent film as well as the fact that there are a number of gamers clamoring for a proper video game adaption. While nobody should rush out and pick up Marvel Super Heroes solely to have a Guardians video game, it stands nicely on its own as an impressive Play Set. Another neat addition to the Play Sets this year is that some figures can now cross over into other universes. For instance, Iron Man and Nova can be played in all three Play Sets while Rocket and Hulk can be played in Avengers and Spider-Man, respectively. This is accomplished by collecting ten character coins for each character, a method that further extends lasting appeal.Gameplay has improved in Play Sets versus 1.0. Controls feel better consolidated between characters; theyre similar enough that players can seamlessly swap between characters once familiar with the game, but different enough that every character seems unique. Skill trees have been added this year that feature over 50 upgraded and new abilities that are earned by completing objectives and defeating enemies in-game. These range from special attacks to increased damage and health. Admirably, all 1.0 figures will receive their own unique Skill Tree when played in 2.0.Thanks to player feedback (and hiring), the fan-favorite Toy Box mode has been enhanced for 2.0. Most importantly, its been restructured to better explain how to properly utilize it. In 1.0, you were sort of just dropped in a giant empty space and were left to you own devices. Some players came up with amazing things, but other  especially younger  players were left in the dust. In 2.0, a tutorial has been added that features Game Play Hosts who will give missions and provide tips. Although I figured out the original Toy Box through trial and error, I was able to accomplish more detailed designs in 2.0 thanks to the given tips. Besides new toys, by far the coolest addition is that of the Challenge and Game Maker. Players can now create their own games inside of the Toy Box or can engage in pre-made games with the use of select Game Discs.Visually, 2.0 looks superior to 1.0, although that likely can be attributed more to an upgrade in consoles than it can be with any inherent design choices. The original release was plagued with screen tearing, something never evident here. Buildings render quicker and view distance has increased. On the audio side of things, the soundtrack has been improved and is more varied. It could become grating in 1.0, but there are some tunes here that may even start toe-tapping.Closing Comments:Disney Infinity was surprisingly robust when it released last year, but 2.0  here debuting in the form of Marvel Super Heroes  continues to expand its universe with a number of impressive tweaks. Toy Box mode has been notably upgraded and overall gameplay is more polished, while increased depth will have players of all ages coming back for more. The physical quality of the figures have remained outstanding and focusing on Marvel should bring in a whole new group of collectors and gamers alike. It may not revolutionize, but Disney Infinity: Marvel Super Heroes 2.0 Edition firmly establishes the property in the gaming landscape.", "date": "September 19, 2014", "grade": 4.0}