{"name": "Planetarian ~the reverie of a little planet~", "ref": "https://hardcoregamer.com/?post_type=post&p=103708", "text": "Ten years ago, visual novels didnt have nearly the genre recognition in the West that they do now. The first time most players got a taste of them was with Phoenix Wright: Ace Attorney, but Planetarian ~the reverie of a little planet~ launched in Japan in 2004 and even saw an English fan translation shortly after. At this point in time PC gamers now often follow the mindset of only playing games that release on Steam, which is why Planetarian will soon get its long-awaited attention. But why did this decade old visual novel even get published in English right now?Yes, the general consensus of those who have played it is that the story is phenomenal. Of course, that varies upon personal opinion. In either case, heres the basic setup for Planetarian. The Earth has basically been destroyed and only small groups of humans still live there. This post-apocalyptic landscape is incredibly dangerous due to violent factions as well as robots that were built during the war. Even without someone controlling them, they still patrol with fully-functional mounted weapons. Our protagonist is a Junker which effectively means hes a vagabond who collects valuable goods. Hes on the move at the start of the game and spots what he believes to be a military base. Expecting a good deal of salvageable material, he enters only to discover the building actually houses a planetarium.There also happens to be someone  or something  there as well. A young woman, Yumemi, introduces herself as having worked at this planetarium for the past thirty years. How is this even possible? Well, shes a robot who was built to serve the building alongside her human co-workers. It seems theyve all long disappeared but yet here she remains as a remnant of a much different time. The clash of personalities between the two characters is immediate. Here we have a permanently cheerful machine contrasted against a junker fully aware of the massive dangers posed every day. Somehow, he doesnt immediately destroy the machine and instead lets himself take a brief rest from harsh reality.A game like this lives or dies by the atmosphere it presents. Thankfully, even as an aging property Planetarian still looks and sounds good. The visuals are simple static shots most of the time, but the CGs are gorgeous. Similarly, the soundtrack sets a melancholic, but hopeful mood fitting with the story. When dialogue appears, both characters are voiced (often visual novels only add voice acting for the female cast). Mechanically, the writing is very strong with only a few moments it turns into that sort of awkwardly-phrased English that anime and manga sometimes thrive upon. The biggest issue is the white text which is harder to read against a few lightly-colored CGs.Of course, with visual novels being so focused on the story, thats the really all one can say without delving into spoiler territory. Planetarian quite honestly may be the most pure example of a visual novel. You see, many people have come to expect that games within this genre still offer some degree of player agency. Perhaps there will be a few mini games here and there, or at least a handful of dialogue options. In this titles case, there is absolutely none of that. From beginning to end you read, read, read and never get to directly interact with the storyline.This is a huge deal to those with specific expectations for what video games are supposed to be. The visual novel scene has often accepted these so called kinetic novels as a style of the genre, but the same cant be said of the gaming community as a whole. Of course, some would even argue minigame-focused visual novels arent games either. In any case, you need to know what youre getting into here. Planetarian tells a beautiful story, and tells it well, but you as the player dont do anything to manipulate it.Closing Comments:Showcasing the expert storytelling abilities Visual Arts/Keys are renowned for, Planetarian ~the reverie of a little planet~ is a visual novel that fans of the genre should be required to play if they missed out on it previously. Once you know what youre getting into with kinetic novels, its easier to simply sit back and let the storyline work its magic. Once the game is over itll stick with you, too, which is still a surprisingly rare and impressive experience to get with games.", "date": "September 12, 2014", "grade": 4.5}