{"name": "Fairy Fencer F", "ref": "https://hardcoregamer.com/?post_type=post&p=103311", "text": "Fairy Fencer F is a Hyperdimension Neptunia game. Sure, its trying to pretend to be something else and it might be going by a different name, but its a disguise that is easy to see through. It has the same basic combat, tone, humor and fan-service on demand. This is Hyperdimension Neptunia in everything but the name, and if youve played a Compile Heart title in recent years you already know if youll like it or not.You play as Fang, who despite all indications from his name is not a rejected American Gladiator. He is instead a Fencer, a group of select people that can use magical swords that have been imbued with the powers of fairies. These swords are leftovers from a war between the Goddess and the Vile God, where in the climactic battle they threw a bunch of swords at each other to seal each others power. Turns out being an all powerful god doesnt give you all powerful accuracy as many of these swords missed and are now just lying around for any Fencer to pick up an use as they desire. Fang happens to get partnered up with a rather persistent fairy named Eryn who refuses to let the poor guy get some sleep in his all expenses paid jail cell and instead talks him into finding more of these magical swords. Fang soon gets roped into helping revive the Goddess, along the way meeting a cast of friends that cant help but take their pants off every once in a while. This wouldnt be a Compile Hearts game if the game didnt take a break every couple of hours to hold up a big FAN-SERVICE IN SESSION sign and shake lady parts in your direction. Honestly, you have to expect this sort of thing from a game like this, and if you come out surprised at the amount of fan-service in this game you are just bad at pattern recognition at this point. I do wish they took the time for it to at least make sense in the context of the story, because at times it just feels like people got two different scenes mixed up and no one bothered to correct it. At one point in a dungeon a character offhandedly comments that it is slightly hot apropos of basically nothing and one of the other characters goes yeah, I guess it is a bit which serves as a cue for the first person to get almost naked and then act confused when everyone freaks out. It feels like a team of writers was working on the script while one guy sat in the corner and rang the fan-service alarm at random intervals that would force the writers to put some in, regardless if it made sense in the scene or not.It doesnt feel too jarring, as this is a game that doesnt have any aspirations of taking itself seriously. The story itself really isnt anything interesting, but it is kept afloat by its humor and some enjoyable interactions between the characters. A lot of it feels a bit like a parody of the modern JRPG, with self aware humor and efforts to subvert some common tropes in the genre. A bandit is shocked to discover Fang knew he was a bandit, and when pressed to disclose how he figured it out, Fang nonchalantly points out it is his characters name. There are a lot of little winks like this and although the game never really is laugh out loud funny it does a nice job constantly integrating humor into the script. The game does seem to get a bit tripped up on its tone every once in a while like it cant quite figure out what sort of game it wants to be. Relatively early on a villain in the game swipes one of your party members and basically insinuates that his soldiers are going to have his way with her, which comes like two minutes after Fang swaggers his way into town and proclaims himself a hero in hopes that the townspeople will shower him with food. I get you like food Fang, but maybe cool it for like two seconds while the war crimes are going on in the background. It just feels schizophrenic at times and the humor can fall a bit flat because it doesnt fully dedicate itself to the wacky tone it seems to be going for.The combat system shares a lot of similarities with the Hyperdimension Neptunia, in the same way a photocopy shares a lot of similarities with the original. The combat in that series has been refined and fine-tuned over the course of several games, so there are certainly a lot of series that would serve as worse starting points. Combat is turn-based with plenty of variation and customization allowed in the gameplay. Characters have an assortment of skills at their disposal and spells to use if necessary, but the core of the combat system comes from a customizable combo system. Characters have a handful of different combat styles with specific moves that can be learned for each style. Each step of a characters combo can have three separate attacks allocated to it which are triggered by pressing one of three buttons, and the maximum amount of hits per combo can also be powered up through the course of the game. Certain enemies have weaknesses to specific weapon types, and you can swap between different weapon types after every move of the combo if so desired. It sounds significantly more complex than it is, and it is remarkably simple to both customize your combo moves and execute them in the course of battle. Another core aspect of the combat comes from the ability for your character to Fairize, which basically serves to power up your characters for tougher battles. A meter will fill up as you take or give damage, and once it reaches a certain point you can trigger what sounds like a Power Rangers theme song and watch a brief cutscene showing your character Fairize. Not only does this boost your attack and set you on the path to wrecking monsters faces, it allows you access to some more powerful attacks that are not available otherwise. This isnt even mentioning some of the games other tricks, like team combos or special abilities unique to specific characters, and there is a lot to play around with during battles. It is a very well executed system (it should be after all of these attempts), and while there is a lot of complexity to it I never at any time felt overwhelmed. Considering there is very little to do in this game other than fight and crawl through dungeons, the strength of the combat really pulls this game through what would have otherwise been an unbearable slog.There are still some issues with the overall gameplay that pop up every once in a while that do end up hampering the overall experience. The game is a bit too easy, an issue that arises because Fang is just too overpowered for the poor cast of enemies he is thrown up against. In addition to some good combos and special attacks, he also has the ability to substantially increase his damage at the expense of using some of his skill points for even basic attacks. Combined with the fact that you can usually Fairize within two turns, and suddenly Fang and crew become absolute killing machines. There are some tougher fights near the end of the game, but for the most part even the bosses fail to provide much of a challenge. Because of this, the combo system the game implements takes a back seat at times to just mashing x and wiping out the enemies.Fairy Fencer F also fails to really open up, and exploration seems stunted and unrewarding. Sure, there are tons of quests to complete and technically the game isnt lacking in content, but the quests are all basically the same and complete one and youve completed them all. For the most part, they are broken down into killing x amount of enemy y, or bringing back a set number of items, usually obtained by killing enemy z enough times. The end result is just going back to wander through old dungeons fighting the same enemies again, or if youre smart checking the posted quests before exploring a new dungeon as they usually get posted then. The dungeons themselves are disappointing, and almost all of them are comprised of linear compilation of rooms punctuated with some occasional treasure and the boss fight. They arent even nice to look at, and they feel like generic maps and backgrounds pulled from some RPG maker game from the mid 2000s. And you cant even explore towns, instead navigating several pull down menus if you want to go to a shop or talk to people at a location. I know this has been used in the past, but it just feels like a lazy way to throw down a town without actually having to render it. I feel like Im navigating Microsoft Excel and not a big, bustling metropolis.Closing Comments:Fairy Fencer F sniffs around the edges of being special, but never musters up the courage to jump them with any real effort. Dialogue is humorous and the battle system is solid enough to keep the constant battles from growing tedious, but the game finds itself mired in mediocrity that it can never quite rise above. Its enjoyable, however, and provides a brief respite from the legions of over serious RPGs with brooding protagonists and increasingly impossible hairstyles. Its something to tackle for a week or two and then forget about when something meatier is bit into. Fairy Fencer F should serve nicely for those who dont want anything too complex or something that will force them to think, but those hoping for something with a serious, epic story and meaningful exploration will want to look elsewhere.Version Reviewed: PlayStation 3", "date": "September 10, 2014", "grade": 3.0}