{"name": "NHL 15", "ref": "https://hardcoregamer.com/?post_type=post&p=102931", "text": "Poor hockey. Last year, all of EAs yearly sports titles were on current-gen systems except NHL 14. Not only was this further proof of its third fiddle status in EA Sports roster, but was also a crime as it was one of the best entries in the long-running series. A year later, the franchise is finally debuting on current generation consoles, but is unfortunately facing an uphill battle. Although NHL 15 has been overhauled graphically, its stripped of several features and releasing the same day as Destiny. Besides a visual upgrade, NHL 15 is also at the receiving end of multiple gameplay improvements. Most noticeable is the Superstar Skill Stick, which introduces independent control of skating and decking using both the left and right sticks simultaneously. For instance, players can head down the ice idling the puck by holding the right stick out to one side, but will protect it when the left stick is used to steer in the opposite direction. New Stride Dekes are activated by pulling both sticks quickly to the same side and are useful in beating a defense. Dekes are made even more fluid thanks to the enhanced puck physics. Where before the puck has always been approximated as a small ball, it has now been retooled to take on the characteristics  size, shape and weight  of an actual puck. While this might not seem all that crucial, it makes the game play more realistically ever than before. Much like in the real sport, youll see more random bounces and goals off of rebounds that werent possible before.Collision Physics have also been improved. All twelve players can now stumble at any time, whether its by being hit by an opponent or tripping over a teammate. Instead of a pre-determined outcomes, players realistically react to their movements. Player sizes, ratings, speed, center of mass and physicality are all factors that go into determining this.Visually, NHL 15 looks fantastic. Players look more realistic than ever before thanks to layered rendering that makes clothing moves more accurately. Facial expressions are detailed and look less hollow than in previous iterations. Commentators look photo-realistic and thats because they are. NBC Sports Doc Emerick and Eddie Olczyk replace Gary Thorne and Bill Clemet, but instead of voiced computer rendering, EA has decided to use real film of them in front of a green screen, filling the background with in-game renderings of the current match-up. Quite honestly, this tactic should become standard. No matter how far graphics come along, it will never match honest-to-goodness reality, and having video recordings of real human begins is inherently less creepy. The final part of the visual coup detat comes in the form of arenas. NHL venues have been individually recreated to make a home game feel more genuine than ever before. Playing at TD Garden or Gila River Arena actually feel like different experiences, which is great for devoted fans. Whats filling the arena is equally impressive. NHL 15 features some of the most impressive crowds to ever grace a sports title. Fans are physically varied from each other and wear an impressive amount of varying team apparel. Theyll even hold up signs at the right times. Instead of the entire venue rooting for the home team which is unfortunately unrealistic, sections and scatterings of visiting team devotees have been added. More than fans, vendors, ushers, security, cameramen and more can be seen in the background during games.Whats here is highly impressive, but what isnt dampers the experience. EA has omitted multiple modes and features from the current-gen debut of the franchise, most noticeable of which is the fan-favorite EA Sports Hockey League (EASHL), which allowed players to create their own clubs. More still, last years upgraded Be a Pro mode, Live the Life, has been downgraded back. Another mode introduced last year, NHL 94 Mode, has also been removed. The ability to use its control scheme in regular modes remains, but gone is the fun recreation of the classic game. Some modes that made the cut have been stripped of functionality, including the inability to draft in GM mode. More stripped features and modes include Battle for the Cup, OTP, Winter Classic, GM Connected, Shootout, Season Mode and Tournament Mode. Closing Comments: NHL 15 is one of the most frustrating sports releases to date. The core experience has been markedly improved. Players and arenas look more realistic, using video footage of the commentators was a stroke of genius and the impressively rendered fans actually seem to be reacting correctly to the unfolding events. More than just improved visuals, gameplay mechanics feel more realistic and polished, leading to a satisfying game of hockey. Unfortunately, in the process, a number of coveted modes and features have been dropped entirely. Losing a few would be acceptable, but theres a plethora of excised features that will be missed  most notably EASHL. Those simply looking for a great game of virtual hockey will find some enjoyment here, but dedicated players who enjoy digging deep into the various modes EA has introduced over the years will be sorely disappointed.", "date": "September 9, 2014", "grade": 2.5}