{"name": "Professor Layton vs Phoenix Wright: Ace Attorney", "ref": "https://hardcoregamer.com/?post_type=post&p=102855", "text": "In theory, Professor Layton and Phoenix Wright are a perfect combination. The two flagship DS franchises from Level 5 and Capcom straddle the line between visual novels and traditional point-and-click adventures. Both are renowned for their compelling mysteries, their colorful characters, and their top-notch music and production values. Without them, adventure games arguably wouldnt be seeing the resurgence they are now. However, while Professor Layton vs. Phoenix Wright: Ace Attorney is certainly my cup of tea  and a delicious one at that  the blend isnt quite as smooth as it could be.For the uninitiated, Professor Hershel Layton is an archeologist from London, renowned the world over for his deductive reasoning, his gentlemanly demeanor, and his puzzle-solving acumen. Together with his apprentice Luke Triton, he travels the world unearthing ancient mysteries and battling dastardly villains  he borrows more from the Indiana Jones school of archeology than from Howard Carter. In Layton and Lukes England, people contextualize nearly all of their problems as puzzles, and a master of brainteasers can very likely conquer the world. Its a strange, abstract universe, and though the games have never been placed in a specific time period, the cars, fashion, architecture, and general lack of German bombing runs indicate that theyre set some time in the 1950s.Phoenix Wright is a defense lawyer from Los Angeles who has a penchant for winning cases by improbably finding the true culprit among the witnesses brought forward by the prosecution. He is assisted in his efforts by Maya Fey, the heir to a long line of Japanese spirit mediums also based out of California (bear with me, the localization is ever-so-slightly muddled). The Ace Attorney world is likewise a little bizarre  parrots and whales have been known to take the witness stand  but it exists within a fairly rigid timeline. All of the Ace Attorney games take place after April 11, 2014 (and the fans have been wonderfully anal about documenting it).That disparity in timelines might not necessarily concern you  indeed, if youve been paying any attention to Layton vs. Wright, youre likely aware that the bulk of the story takes place in the magical kingdom of Labyrinthia. Both series make use of some pretty fantastical elements, so it would make sense for the our heroes to jump across dimensions to meet each other. Only thing is, thats not what happens. In the games introduction, we look through Laytons quaint living room window (next to a phonograph) to see a commercial airliner carrying Nick and Maya to London. This sets Laytons London  with its ancient motorcars and dapper fashions  sometime in this decade. (Probably early 2018, judging by the fact that Miles Edgeworth is working as a prosecutor again and oh my god what am I doing with my life) I can only think of two explanations for this: either this universes Europe has somehow lagged half a century behind the rest of the world in its technology (which would explain Francisca Von Karmas whip), or everyone there is a colossal goddamn hipster (which would explain all the puzzles and also the whip).Of course, this is all non-canon, so none of that actually matters. Why devote three paragraphs to it then? Firstly, the nerd in me would appreciate it if it were possible to line up the story of PvP with the timelines of each series. Secondly, this disparity hints at a much bigger problem with the way the two franchises mesh. See, Professor Layton is a very European game (despite being made by a Japanese studio), and this comes across most potently in its boxy ligne claire art style. By contrast, the Ace Attorney series is very, very Japanese, and wears its anime influences on its three-tone-shaded sleeve. Both styles look absolutely gorgeous, but they dont gel together particularly well. When you put Layton and Wright next to each other, the Professor looks like some sort of deformed freak. The characters that populate Labyrinthia are divided evenly between the two styles, which makes the contrast feel less jarring over time, but its hard to get over the feeling that these characters dont belong in the same shot.An effort was made to blend the styles (by making Wrights design a little more simple and Laytons a bit more detailed), but the end result is that neither character looks quite right. Phoenix definitely gets the worst of it, as his head is noticeably too large compared to his body. With that said, all of the character models look fantastic in a vacuum, and Level 5s animation team have done a superlative job bringing the diverse range of characters to life. Compared to Dual Destinies, where characters jump between sharp, dynamic poses, here the movements are more natural and realistic. Actions have very smooth follow-through, and every characters chest heaves and sags as they breath. Its also worth noting that all of the characters fit perfectly with the gorgeously detailed environments, so the aesthetics, while disjointed, arent completely irreconcilable.One way that the series do fit together is in their music, which is equally phenomenal. Any fan will find it a treat to hear Ace Attorneys jazzy courtroom songs orchestrated using the harpsichord, xylophones, and violins that characterize Layton soundtracks. A reimagining of Confess the Truth that makes heavy use of an organ is especially captivating. As this is a Level 5 game, the iconic Professor Layton themes are left largely untouched, though a few notable exceptions have been injected with a bit of swing. Its a shame that the Ace Attorney influence is a bit less distinct in these songs, but it makes sense given the setting.Labyrinthia is a strange medieval town plagued by witchcraft and governed by the almighty storyteller  a godlike figure whose every written word comes true. Its a land where magic is real and logic nearly unheard of. Maya, Nick, Layton, and Luke are all drawn into the world when they try to help Espella Cantabella, a mysterious girl on the run from the witches. Espella ends up on trial for being a witch herself, and the Wright and Co. team must take the stage to defend her while their gentlemen colleagues scour Labyrinthia for clues.As you might expect, the gameplay is divided fairly evenly between Layton-style exploration and Ace Attorneys patented cross examination. In this sense, Labyrinthia is a fairly ingenious setting for this crossover, as Laytons puzzles seem right at home in a kooky medieval setting, and the towns obsession with witch trials gives Wright plenty of chances to stand in court. Running around town feels very much like any 3DS Layton game (which shouldnt be surprising given that its the same engine), with environments represented in full 3D on the upper screen. Likewise, puzzles could be taken from any Layton title, though on the whole they feel easier than what you might encounter in other entries.Courtroom encounters, on the other hand, are a little more complex than Ace Attorney fans might be accustomed to. Youll still be pressing witnesses and presenting evidence to contradict their claims, but youll be doing so with a lot of them at once. In witch trials, all witnesses take the stand simultaneously and deliver their testimony all at once. This can make things a little confusing, but it also gives Phoenix new weapons to use. He can stop a witness in the middle of their statement to ask another one what they think of it, for instance, and even use conflicting testimony to highlight contradictions. However, hell also have to contend with a justice system that believes in magic, which can turn the proceedings into a bit of a kangaroo court. Its a little infuriating when a clear contradiction is countered with magic, duh, but the spells in the game do have a kind of logic to them. At times it can feel a bit like youre being tried by the Queen of Hearts in Alice and Wonderland, but on the whole it works well. Id like to see the multi-witness mechanics used in a future Ace Attorney game, though with the direction they took in Dual Destinies the chances of that seem slim.No matter which series youre a fan of, youll find plenty here to keep you entertained. Phoenix takes on four trials over the course of the game, while there are 70 puzzles scattered throughout Labyrinthia. Ingenious interface design helps to meld these parts together. Its not too difficult to bridge the mechanics of the two games, given their similarities in genre, but regardless the Level 5 team has done a good job of integrating visual and mechanical elements from Ace Attorney into dialogue and cross examination. All the right audio cues are there as well, meaning the game will feel intuitive to fans of either franchise.Youll note that I havent said much about the story itself. In part thats because I dont want to spoil it, but even if that wasnt a concern there isnt really much to say. Anyone familiar with the Layton series will see most of the twists coming a mile away, while the courtroom drama is more referential than it is genuinely surprising. Of course, the real draw hear is watching characters from both series bounce off each other, but thats sort of where the game makes its biggest fumble. Aside from Layton, Maya, Luke, and Wright, almost nobody from either franchise makes an appearance. Chelmey and Barton show up at the start of the game, and we see Phoenix briefly square off against Edgeworth at the end, but thats it. Most of the game is spent with the inhabitants of Labyrinthia.I adore Professor Layton and Luke, and I cant tell you how long Ive been craving more interactions between Nick and Maya, but they only represent a fraction of the appeal of their respective series. Both Layton and Ace Attorney are fundamentally character-driven franchises, and without bumbling from Gumshoe or villainy from Don Paolo PvP feels a little hollow (also, how is there confetti when you win a case if Gumshoes not there to cut it up? These questions keep me up at night). Theres so much potential for characters to bounce off each other: I can see Luke and Pearl becoming fast friends, and it would be hysterical to watch Wendy Oldbag try to seduce Chelmey or Layton. As it stands the game poses only one interesting hypothetical with the characters it has, and that just ends up being an excuse for the heroes to swap sidekicks. Labyrinthias townsfolk are charming and quirky in their own right, but PvPs target audience just doesnt have that same attachment to them.Closing Comments:", "date": "September 6, 2014", "grade": 3.5}