{"name": "Hatoful Boyfriend", "ref": "https://hardcoregamer.com/?post_type=post&p=102343", "text": "Lets talk about an anime series called Welcome to the NHK. It tells the story of two socially inept young adults that have ill-thought dreams and ambitions to become video game developers, but without putting in the real effort or acquiring the necessary skills to do so. From the outset they decide that creating a visual dating simulator is the best way to go because that is apparently the easiest type of video game to make. The dating simulator that they ended up construing may have been bad, but at least they didnt think that adding romantic pigeons into the mix was a good idea.When you have a running joke among friends, theres always a situation where the joke has long run its course but no one is willing to put a stop to it because itll just make things awkward. Thats how I feel about Hatoful Boyfriend, its a game that probably started out as a joke among friends that somehow grew into a fully realized product. Even from a country that gave us Cho Aniki, Hatoful Boyfriend is perhaps the most absurd idea to have ever turned into a video game. In many cases what happens in Japan should stay in Japan, and I believe that it was the collective effort of neck-beard hipsters that allowed Hatoful Boyfriend to not only get translated, but somehow get enough interest and votes to make it through the Steam Greenlight process. I am certain all of those votes were made ironically.Hatoful Boyfriend is a visual novel through and through and so its basically a lot of stills, text and making choices along the way, but unlike conventional visual dating simulators, this one shows off feathers instead of skin. Its quite simply a pigeon dating simulator, and Im afraid to even imagine the thought and creative process behind all this. Its a reverse-harem dating adventure where you assume the role of the sole female human attending an all pigeon institute, and youre caught in a love nest involving a cast of testosterone fueled male pigeons and other feathery friends. Speaking of which, did you know that doves reach sexual maturity within their first year? I figured that would be useful information to mention.The human protagonist is a hunter-gatherer living among birds. Her home is a cave (it has a doorbell) and and its unclear why she is in this clearly mismatched society. It follows the conventions of a dating simulator where a limited amount of time is used to decide which suitor to give your undivided attention to, which eventually blossoms into a melodramatic romantic confession. There are numerous endings to unlock, and as you try different paths and spend time with different birds, the sheer absurdity and randomness of the plot and setting starts to unravel. As a romance adventure, Hatoful Boyfriend is tacky and cringe inducing; its like all the tropes and plot devices of smutty Japanese romance novels parodied in generic fashion but with pigeons instead of androgynous anime men. Its amusing for what it is, and fully aware of how purposely bad its writing is. The pigeon and bird related puns add a little to the otherwise cookie cutter dialogue. While it appears to be drama about dating male anime archetypes who just happen to be birds, it unexpectedly and dramatically ventures into the genres of fantasy, science fiction and even horror, but still maintaining the parody. The jarring inconsistencies in the plot add more to what was already a bizarre game.Theres stats for the main character to work on (such as wisdom), which you can do via activities like studying, sport and music, but for the most part youre probably going to wonder why developing stats is even important. The stats that you work on only occasionally show their purpose in the most unexpected and bizarre situations, but such moments are very few. For the most part youre just triggering scenes, making different choices, in order to fully blossom your romance with one bird, and once that happens the credits start to roll. Its a very short game, over in less than an hour with subsequent revisits being even shorter. The idea is to replay it over and over to try different choices and work on building a relationship with a different bird each time, and also stumble upon new story arcs that are a dramatic departure from the dating shenanigans.The visuals and presentation are purposely bad. The character designs are literally realistic stock photographs of birds, although you occasionally see some form of effort, like the gang of pigeons with tacked on mo-hawks and sunglasses. It does allow the option to momentarily show human portraits of these birds for those wanting a different mental image, but they resemble amateur fan art that was probably stolen off someones Deviantart page. Hatoful Boyfriend is a purposely bad game, but coming up with an idea of pigeon dating simulator and seeing it through to the end is certainly no easy feat. The fact that a game like it even exists is perhaps its biggest accomplishment. But once you move past the shock value of dating pigeons, Hatoful Boyfriend is a badly written and sloppy visual novel adventure that is best experienced very briefly for curiositys sake..Closing Comments:Hatoful Boyfriend began life as a joke and ended as one. Calling it bad is not going to offend anyone, because thats exactly what it wanted to be. Even among the most outlandish visual novels, Hatoful Boyfriend at least succeeds at being one of the most bizarre things to come out of the genre. How this made it on Steam for ten dollars is a mystery; these are the kind of cheaply and lazily made games that should be free. Hatoful Boyfriend is not a genuine comedic venture, its just a ridiculous idea turned purposely bad game. Charging money for it is just wrong, even if it is the best pigeon dating simulator on the planet.", "date": "September 4, 2014", "grade": 1.5}