{"name": "Amazing Princess Sarah (PC)", "ref": "https://hardcoregamer.com/?post_type=post&p=101316", "text": "Behind the filthy waves of terrible dating sims and awful iOS App Store rejects, Amazing Princess Sarah was one of the rare sparks of life on the Xbox Live Indie Game storefront. Channeling the spirit of NES-era platformers like Castlevania, the underdog of an indie game was strong enough to succeed on the marketplace, giving developer Haruneko the opportunity to move the game from XBLA to Steam. But the stakes are higher on Steam, as many exceptional retro platformers have already made their mark. Its not easy to stand out against indie hits like Guacamelee and Super Meat Boy. Amazing Princess Sarah thoughtfully references the classic 8-bit platformer ideology, but suffers from uninspired level design and a lack of reason to return after the initial playthrough.Amazing Princess Sarah is a throwback to the action platformers of yesteryear. Sarahs father is kidnapped by the demon mistress Lilith and its up to Sarah to fight through an enormous horde of monsters to rescue him. Its a simple, to-the-point action platformer, with constant references to the Castlevania series. In fact, Amazing Princess Sarah is absurdly reverent toward Castlevania, adopting a number of features that range from good (fast, strong attacks) to bad (obnoxious knockback when attacked). Sarah controls well enough, though her jump is a bit more delayed than, say, Mario. The game is fast and exciting, with a great pace and a design that doesnt distract. Like the original Castlevania, levels are linear, so it isnt too difficult to get lost. You normally have to locate switches to open new doors to further areas, but aside from some brief backtracking, the game doesnt adopt too open-ended a style. Some call it Metroidvania, but its Metroid is almost non-existent, sticking to Castlevania most of the way. Its a to-the-point action game that delivers a great amount of flow to its combat and exploration.But Sarahs sword isnt her only weapon. Her major skill is the ability to pick up and throw objects, very similar to Super Mario Bros. 2. Environmental items like clocks, chairs and statues are normally available, but defeated enemies are the best projectiles. You can pick up the enemies corpses and hurl them at other enemies for extra damage, but different enemy corpses provide different effects. Throw a fire nymph to create walls of fire that damage enemies. Throw an archer to provide a rain of arrows (which conveniently bypass walls and floors). Its a fun mechanic that brings some variety to an otherwise straightforward game. Following up the combat is experience, which is earned when defeating enemies. Repeatedly killing enemies in sequence brings up a multiplier, offering more experience. Sadly, the experience doesnt do too much for Sarah, as leveling up only provides a small attack boost and a couple extra hit points.The levels are standard to a ridiculous degree. Aside from different items to throw and the occasional floor change (such as ice in the caves), there arent any environmental changes between levels. This makes the design feel flat, a huge missed opportunity to spice up the game. While the flow of the game benefits from this simplicity, allowing you to focus on attacking enemies without distraction, it doesnt give the levels any personality. Youre still fighting bats, archers, and succubae; just with a different background. Some levels can be outright poorly designed, such as one level that requires you to navigate a specific path while falling, a path that would be impossible to guess without already knowing the way. There are moments in Amazing Princess Sarah where the game shamelessly drops you into a pit of super-powerful monsters (essentially an instant life loss) simply because you missed a jump. The level design is simple most of the time, but these traps arent simple. Theyre just cheap. The boss fights in Amazing Princess Sarah are also underwhelming, and most of the time, terribly easy. Some bosses can be defeated without picking up a single enemy (just a mindless sword slash barrage), while others suffer from awkward collision detection. Some bosses have a stomp attack, but finding the safe spot to avoid that attack is a guessing game thats never put into cohesive practice.Amazing Princess Sarah has a weird endgame as well. Haruneko provide seven New Game+ modes to the game. Seven and many of these are solely designed for you to gain enough experience to defeat the true final boss. These new modes are essentially new gimmicks for the five stages. Angry Princess Sarah, for example, has Sarahs ghost chase her throughout the stage, where touching the ghost damages Sarah. Drunk Princess Sarah has the screen wobble throughout the playthough. Theyre nice quirks, but the game doesnt change drastically from these quirks. Youre still playing the whole game again, problems and all. At $5, Amazing Princess Sarah is a reasonably priced action game, but its replay value comes from experiencing the solid platforming again, not the gimmicky New Game+ modes.The presentation in Amazing Princess Sarah is presented in all the 8-bit glory of the NES, but with slick visual effects and a beautiful 60fps frame rate. Harunekos pixel art design has all the creativity of a Castlevania circa 1986, but with a shimmering polish. Level designs may suffer from a lack of originality, but the game never drags, instead staying energized the whole way through. The audio follows suit, with a downright amazing soundtrack right from the modern retro book. Revving electric guitars complement intense levels, while simmering sonatas pepper the more subdued ones. Sarahs voice, however, screeches and yelps anytime she gets hit, which can grate on your nerves after only a few levels. But with a stylish retro aesthetic and a great collection of level themes, Amazing Princess Sarah stays true to retro philosophy and delivers plenty of spark to the genre.Closing Comments:Amazing Princess Sarah is a competent, if uninspired indie platformer. It takes the spirit of retro to heart from square one, but despite its commitment to the simplicity and straightforwardness of its inspiration, doesnt evolve when it should. Levels change in aesthetic only, never delivering any new elements or ideas to keep gameplay fresh, while some levels suffer from awkward construction and cheap design. The post-game content list is also stretched thin with clever, but gimmicky New Game+ modes. Still, the charming graphic design and stellar soundtrack invigorate a gutsy approach to the action platformer, sticking to beefy challenge and purity in gameplay philosophy. No distractions, just you versus the game. Amazing Princess Sarah is well-worth five bucks if you love old-school gems like Castlevania but if youre not into that classic retro scene, Amazing Princess Sarah will do as much to convince you of the genres flaws as it convinces you of its strengths.", "date": "on August 29, 2014", "grade": 3.0}