{"name": "Out of Ammo", "ref": "https://hardcoregamer.com/?post_type=post&p=287844", "text": "The PlayStation VR has been around for a year and a half and while there have been some excellent titles, none of them have been a real-time strategy game. The idea of commanding units with motion controls on a battlefield always have seemed inviting and not until now will players get that chance. Zen Studios and Rocketwerkz are bringing Out of Ammo to PSVR and it goes a little deeper than just being a RTS. The game is a hybrid of sorts as players command a base and build defenses while taking control of individual units. With a focus on a simple approach and an engaging aesthetic element, Out of Ammo is deep and is possibly the most fun Ive had with PSVR to date.Looking at screenshots and videos dont do the game justice. On the outside, the character models are taken right from Minecraft, but the environments arent nearly as blocky. Starting the game puts players directly into the barracks, where they will use motion controls to teleport to different places. Theres a tutorial that will walk players through managing a base and building defenses. Helicopters provide supply packages as waves of defenders are fought off. The opposition increases in classes as it starts off with rifleman and eventually players will see red lasers from snipers in the distance, then eventually tanks. In the barracks, players have to kind of figure out how to navigate and do things. Hitting X on either motion controller will turn the player 90 degrees. All of this is listed on the wall once you realize that its there after about ten minutes. From the barracks, players can look for multiplayer games, find missions and practice shooting.A multitude of games in one, the aesthetic makeup of Out of Ammo is where the it shines. There are missions to build a base and stop the opposition from invading. Its taking over the units that add even more to the element of the game. Players will literally remove and reload clips from guns, remove and reload rockets into launchers and pull back the bolts on a sniper rifle to load one bullet that they grab from their hips. Included are rifles with attachments such as red-dot aiming and the sniper rifles have scopes that work. What doesnt translate well is looking down the scope, since both eyes are needed for a clear view in VR. With the sniper rifle players can bring the scope closer to their faces, but this amounts to a more difficult shot. Players can hit square to quickly navigate back to the battlefield. Engineers are used to build and repair structures and can be housed to avoid danger. Medics will automatically be dispatched to heal units. Players also have grenades at their disposal and can blow up barrels. Adding to this is the ability to call in different events from the remote in your left hand. Artillery and other battle changing events can be called with the literal click of a button. Everything in Out of Ammo is done as if you are doing it, including navigating the menu or even using the literal mouse in the barrack to search for multiplayer games. Out of Ammo is ridiculously engaging.On top of the battlefield and strategy aspect, theres also first-person only missions. One of these missions is playing as a sniper in a small town where teammates are pinned in the middle, fending off and eliminating as many defenders as possible. Another has you trying to hack a computer in a penthouse. The opposition discovers youre there so navigating with the transport button on the motion control to take down blocky terrorists with a shotgun is the key. The last mission takes place when your plane goes down in the desert. Its dark and players have to find clips on the ground rather than having them strapped to their hip. The hip is generally where all ammo is grabbed throughout the game. Now while this all sounds fantastic, the game isnt easy. It features an addicting element and thats due to the detailed elements of shooting and managing. The learning curve for navigating and controlling is steep. Frustration may set in initially, but spend time adjusting to the controls and learning the exact point to grab a bullet or rocket with the motion controls or placing structures correctly. The controls actually work well using the PlayStation Move Controllers, but there will be space needed in your room. Once you realize that you dont have to turn around 180 degrees and can navigate with the X button turning 90 will help dearly. The adjustment is huge on this in terms of finding your comfort zone, but sniping someone on a cliff makes it all worth the hassle. On top of learning the controls, the enemy doesnt stop and they come harder and faster.Honestly, the biggest gripe I have is the inability to restart a level. If you die or just want to start over, the map must be exited altogether. While load times are fine, this still feels like a waste of time that needs to be addressed. Zen Studios clearly aimed for the aesthetic feel as there is nothing in the technical department that stands out in this game. As I mentioned earlier, the player models are directly from Minecraft as shooting enemies does throw out blocky blood and the ragdoll physics are funny at times. Structures blow up with smoke and fire. Each unit has a visual distinction. Its important that the game runs smoothly and it does just that. The battlefields fit a cartoon-y board game. Theres no music in the game to set the mood and the sound effects such as gun fire and explosions are sufficient enough. Closing Comments:While a lot of focus on VR games comes from playing games in a first-person view, its great to have a change of pace with a real-time strategy game that includes an FPS element. On the outside, Out of Ammo doesnt look inviting. Once youre plopped in to the battlefield and realize all the small things needed to win on top of managing a base, though, its enthralling. The controls take a while to get comfortable with, but youll notice your own progression. As great as Resident Evil 7 or Gran Turismo Sport are in VR, Out of Ammo is the most fun Ive had with PSVR. Just make it so players can retry a mission and not force them to exit out.", "date": "January 31, 2018", "grade": 4.0}