{"name": "Infamous: First Light", "ref": "https://hardcoregamer.com/?post_type=post&p=101275", "text": "It has been half a year since Infamous: Second Son hit the PlayStation 4, offering breathtaking visuals and compelling super powers, but Sucker Punch Productions doesnt want to stop there. As the Bellevue-based company has done with their last Infamous title, a standalone short story has been released digitally, this time giving us a taste of the ever so charming Fetch. The neon glows bright with this one, as we get a taste of even more supernatural talents, and a story that can only be described as depressing.Infamous: First Light explores the events prior to Second Son, centering on former supporting character Abigail Walker, or better known as Fetch. We knew she had her own inner demons, mainly involving drugs and the death of her brother, but this standalone DLC helps explain her situation a little bit better, and how she became who she is. The story takes place both right before the events of Second Son and two years even further as Fetch recalls her previous encounters with devious and powerful Seattle drug lords. After a mess with the Russian mob, Fetch finds out her brother has been kidnapped and she must help this scummy looking fellow named Shane to get him back. The story itself is a little predictable, and not in the sense that we already knew about her brother. All the way through the campaign, youll have strong expectations of whos going to die, whos going to be betrayed and how things ultimately turn out.The difference in comparison to most Infamous games is that theres no mortality system in play. This is a direct story about Fetch with no influences over what she does next. Thats not a particularly knock against First Light as Laura Bailey, voice actress of Fetch, delivers such a strong performance that you really dont care about any missed branching path opportunities. In fact, theres one spot in particular right at the ending where Sucker Punch could have easily slide one in, but it would have been to the games detriment if they had done so. Unfortunately, while the story is predictable, most of the characters outside of Fetch are also meaningless. You can tell Fetch cares for her brother and starts to warm up to a new individual, but they dont flesh them out enough to really make a mark on the overall plot.If you didnt enjoy Infamous: Second Sons gameplay, First Light will by no means change your mind. Because Delsin Rowe has the ability to absorb other powers, he doesnt get the full breath of a singular capability, so this leaves Fetch with even greater abilities to use. Its virtually the same combat gameplay weave come to expect, though, as players are greeted with a projectile attack, a wide stasis shot, homing neon rockets and a Singularity thats charged up as enemies are defeated. Aiming will always slowdown time so you can hit with a precise shot, and there are also finisher blows that are racked up after bludgeoning enemies to death. Traversal is even better this time around as there are portals scattered across Seattle, giving Fetch a nice boost, sending her across the island in no time.Unfortunately, this is all brought down by how the world and missions are structured. Seattle is half the size it was in Second Son, which isnt necessarily a bad thing, but the theres far less interesting tasks to do in the world. There are drive-bys Fetch can stop, Lumes to collect, drones to destroy muggings to interrupt and races to partake in. The graffiti mini-game has also made a return, but instead of using spray paint, Fetch is able to tag walls with her neon powers, makings things a little more vibrant. Unfortunately, most of these side quests are rather dull or just way too easy to complete. Just like combat, which feels dumbed down as there are far fewer engaging encounter, theres no real challenge to be had, making it feel more of a chore than a fun activity.First Light clocks in roughly four and a half hours to complete everything with the exception of the separate arena mode and most of the challenges. The arena mode is an interesting addition to partake in once, but then probably never load up again. This pits Fetch in three different arena classes where she can either help rescue unsuspecting digital civilians from being killed, or surviving against waves of enemies. As these challenges are completed, Fetch will earn skill points and your score will be uploaded to a leaderboard where you can taunt your friends. These activities are not the DLCs main attraction for a reason. Survival can sometimes be enjoyable, especially considering theyll be the only time youll get a real challenge, but the rescue missions are just plain not fun. At least the aesthetic is a nice change of pace as it reminds you whos in the compound with you. Closing Comments:", "date": "August 28, 2014", "grade": 3.5}