{"name": "Halo Infinite", "ref": "https://hardcoregamer.com/?post_type=post&p=415489", "text": "For nearly twenty years, Halo remained the flagship title for the Xbox brand. It revolutionized the shooter, propelling the genre into the future on how to do these types of games correctly. 343 Industries is now handling its third iteration of the series with Halo Infinite. The developer is broadening how the game is played while keeping the Halo-feel at its core. It has added much-needed changes that dont ruin the experience its fanbase is accustomed to. A campaign mode that offers open-world gameplay and a return to excellent nostalgic multiplayer action makes Halo Infinite live up to its predecessors, albeit with some issues.Halo Infinite follows up approximately a year and a half after Halo 5: Guardians, where Master Chief seemingly met his demise but has now been located by a random pilot who picks up a friendly on his radar. The Banished have won the war and are in control of things as a resurrected Master Chief aims to not only restore humanity, but also take down the Banished and figure out what happened to Cortana. Halo Infinite combines both a linear level structure with an open-world interface that takes place on Zeta Halo.The early and closing linearity will feel close to home for Halo fans. These areas take place inside of dark corridors as waves of increasingly-difficult enemies and boss encounters stand in the way. Infinite features returning enemies with some new Banished thrown in for good measure. Enemies will arm themselves with better weapons over time and increased armor along with cloaking thrown in there. Luckily, new assistance has been offered to Master Chief to help thwart these encounters. Master Chief is able to be upgraded with the addition of Spartan Cores. These are found via the open-world area of Zeta Halo, which is large and features different levels of terrain that require separate vehicles to navigate. All the vehicles that Halo fans know and love are here including the Warthog, Ghost and more. With the Spartan Cores, however, players are able to upgrade new attributes such as the Grappleshot, Shield Core, Threat Sensor, Drop Wall and Thruster. I never knew that I wanted to be Spider-man with Master Chief, but the Grappleshot offers this experience and is one of the series biggest game changers. The Grappleshot allows players to grab items like explosive canisters, latch onto vehicles for immediate entrance and quickly move out of harms way from enemies. It works well in getting to hard-to-reach areas, as well. Upgrading this adds perks such as shocking enemies for immediate kill with a melee attack. In fact, its seemingly possible to beat the game by only using the Grappleshot. Its an excellent mechanic thats been well implemented.Zeta Halo makes up the middle and main portion of Halo Infinite. The entire landscape just screams Halo with the varying terrain. Taking a cue from The Lord of the Rings games in recent years, Zeta Halo offers a lot of bases known as FOBs that are overrun with Banished. Clearing these FOBs will claim the base for the player and allow not only fast travel locations but access to resources and support including marine assistance. There are also high value targets on the maps that provide a better version of certain weapons that can be access from the FOBs once defeated. Zeta Halo is split between a major wall and will open up more as the story is progressed. Going with the open world brings up a ton of filler time and exploration for players. Currently, theres no cooperative campaign in Halo Infinite, as this can open things up for multiple players. The idea of going open world is good up front, but short sighted. There are Spartan Cores that can be found for upgrading Master Chief, but there isnt a broad range of upgrades. Theres no leveling up in the game, so basically the exploration comes down to finding Skulls, which offer different effects to play with, and taking out high-value targets to unlock better guns to choose from. Do note, however, that these guns will only be accessible from FOBs and cant be used during the later portion of the campaign. So ultimately, it questions what youre playing for other than hitting 100% completion on the game. The area can be re-accessed after beating the campaign.The gunplay still feels like Halo should and theres a major focus on matching the right weapon with the right enemy. Players will be switching between weapons as four different types of ammo exist to match up with specific enemies. There are a range of guns to choose from alongside varying grenades and explosive canisters. Throwing grenades or items in general takes a minute to get accustomed to as they seem to just float forever. Lobbing regular grenades can be especially aggravating as they basically bounce and roll for miles. The combat remains great and with adding the Grappleshot and other tools, it enhances a deeper gameplay experience. Including some exploration during my campaign run, it took roughly ten hours to complete when focusing on the story. That isnt overly long and the fact that grinding for upgrades doesnt amount to much of a difference, the campaign ends up feeling short. Couple this with a lot of areas reusing the same assets with extended sections of not offering any encounters, and it feels like a lot of filler. This also depends on difficulty level as the higher the difficulty, the fewer shots Master Chief is going to take before going down. The enemy AI seems mixed, but varies based on difficulty level. Most of the boss battles feel special, but none of them will prove memorable. The story itself stays grounded as Master Chief searches for what happened. The plot is consistent and tends to stay conservative with lore while shoring some things back up and providing answers to what Master Chief is seeking.This review was conducted on PC rather than a Xbox console. The recommended specs are demanding as the game recommends an Intel i7-9700 or AMD Ryzen 3700X and either a NVIDIA RTX 2070 or AMD RX 5700 XT. The recommendation also includes 16 GB DDR4 RAM. The test bench offered the Intel i7-9700 and it was paired with 16 GB DDR4 RAM and a NVIDIA RTX 3080. On paper, this setup was no slouch in 4K averaging right around 70 FPS outdoors and 90 FPS indoors. Settings were at Ultra and the game offers no Ray Tracing or DLSS options. Even with this, there were major issues and this may be related to the build that was provided for review and possibly a driver issue. Having played the multiplayer since it was released, these issues werent there on that side. During the campaign, there were major microstutter issues that seemed similar to what I experienced in Forza Horizon 5 prior to it being patched. There were artifacts that would take up the entire screen the deeper I went into the game and doors would not load. Hopefully, this is just the build and the artifacts werent an issue until I updated my video card drivers, but the microstutters and frame drops have been consistent.The game is much improved visually compared to what was originally showcased last year, so those fears can be buried, but it isnt perfect. Halo Infinite heavily relies on its lighting engine and it can look beautiful at times. HDR is imperative for Infinite to shine as it allows all the indoor lighting in the dark areas to stand out. Assets up close arent perfect, but items at a normal distance look fine and the reflections look fantastic. The main issues crop up in Zeta Halo with object pop in and large structures at a distance. These structures just dont look right at times and its as if they were just cut off. Player models, especially Master Chief, are highly detailed but these models depend on the reflection from the armor to look great. Audio remains a top priority for 343 Industries and they deliver on providing some of the best in the industry with Halo Infinite. All of the sound effects from guns and explosions remain, along with the dialogue from the Grunts. I almost feel bad for killing these little guys as they seem innocent and cute spouting their hilarious dialogue. Brutes sound like generic big bad guys youve seen before. The soundtrack is wonderful and strangely the multiplayer has a separate soundtrack that includes music you could listen to on a daily basis. The voice acting and all the audio across the board is undoubtedly award worthy.Halo Infinite multiplayer almost needs its own separate review as its its own separate entity. While theres no local split-screen multiplayer or campaign coop, the game does support LAN connections and is F2P. There are four game types for ranked arena action, which pits 4v4 and offers every bit of nostalgia you can imagine. The gameplay is addictive and going back to capture the flag offer the best experience for that mode in any game. Theres also a big battle available and ongoing seasonal events to help change things up. Itll be nice to get more maps and modes over time, but this is the multiplayer FPS to play in 2021. The team is addressing concerns about the progression system, but this is really only a focus if you care about cosmetic items. If youre looking for a F2P online shooter that you can pick up and play, this is the best to date. Closing Comments:Halo Infinite concludes a good run of 2021 Microsoft exclusives and it stands up to the best of what the Halo series has offered over its near twenty year run. The hybrid linear and open-world concept is enjoyable on its surface, but couldve gone deeper on the open-world side. Co-op will aid this down the road, but the lack of any type of customization for weapons or secrets will make it no more than a mode to mess around with. The gameplay and shooting mechanics remain excellent and the inclusion of the Grappleshoot proves to be the right mechanic for the series. The lighting and reflections stand out the most with the visuals, and hopefully by the time the game launches, the PC issues will be ironed out. The story doesnt dare to do anything outlandish but it also isnt memorable. The longevity of Halo Infinite will rest with its multiplayer battles as this is the online shooter the world has been needing. Halo Infinite is the defining project from 343 Industries thus far.", "date": "December 6, 2021", "grade": 4.0}