{"name": "Magnetic By Nature (OUYA)", "ref": "https://hardcoregamer.com/?post_type=post&p=99044", "text": "Magnetic By Nature is another Kickstarter project that shows just what kind of amazing games can be grafted thanks to crowdfunding. Its a puzzle-platformer for those who are usually too impatient for a regular puzzle-platformer. Furthermore, if you have an affinity for art deco designs, youll fall in love with its visuals immediately. The pace is quick and you have to be on your toes at all times. Both magnetic powers and physics need to be considered for both jumping and careful ascents and descents. There are a lot of layers to MBNs gameplay, and just a surface level swap between attracting and repelling to get from Point A to B explanation sells the depth of the game short.L2 unleashes a blue sphere around your character that attracts you to blue sections of the map, while R2 repels you from orange ones. You can jump with A, and youll be using it a lot to not just make a first leap, but also make a last-ditch save as you get just a pixel or two short on a risky move and need to hop up to the platform to find an exit. Colored spheres are a regular part of the scenery and play a variety of roles within the game. Some are there to be rolled with as you attract yourself to them and move along sloped surfaces, while others are there to be bounced off of in a certain sequence. If two are nearby, you can hop off of both with more power, and the closer you are to the spheres, the more power youll get from a jump off of one. So if youve got a stage with a bare-bones jump off of one getting you to the exit, you might be able to get a hidden-ish item by being a daredevil and waiting until the last second to leap. Theres a risk/reward system in place, and it results in thrilling victories and agonizing defeats within mere seconds of each other.As with any puzzle-platformer, trial and error play a big part in things. However, I never got frustrating by this game. There was never that moment where I had enough  I always came close enough to moving on with a particular challenge that I knew it was just a matter of getting the timing down. Theres one particularly tough section in the Stone Warriors set of stages where youve got to ride a series of spheres one after the other going vertically and horizontally while avoiding sawblades. In theory, this should be something that aggravates players, but the execution doesnt do that. You know there are only so many directions for the spheres to go and that you can only do two things with them, so that simplifies things greatly. The hard part then becomes making sure that you maneuver yourself around the sphere properly so that youre not too close to a sawblade during a dismount. There are even sections where you have to use the spheres to form a barrier around you to avoid being killed by oil. Manipulating the position of spheres can be difficult at first, but Magnetic By Nature features a very gradual difficulty curve.Youre taught everything you need in earlier levels, and the later stages of a larger set are just your final exams. Sometimes, they wind up being much easier than earlier stages due to what they focus on. If going from sphere-to-sphere is tough, then you might struggle with a mid-tier stage, but excel at one that relies on attraction and repulsion pads to get around the level. With those, you know its just a matter of getting so close to something to fly high and then getting yourself in the proper position to propel to the next set of pads to reach the end of the level. The gameplay balance here is nearly perfect because youre never given a set of 25 levels that just focus on one thing  they will all use a variety of mechanics from beginning to end and ensure that youre at least proficient at the game until you get to those moments where you feel like a master. It took me until the Voyage Avec Retour part of the Stone Soldiers section to feel that way as everything just clicked during a particular play session.Mastery comes from not just knowing what to do, but when to do it. Accurate controls play a large part in that since you need to have responsive controls to do with a high level of precision. With the default OUYA pad, things work perfectly most of the time. However, there are still occasions where youll press a button and the desired action wont happen for a second or two. In a twitch platformer like this, thats a killer. Luckily, a PS3 pad can be paired with the game and works perfectly. While most of my leaderboard-topping scores were set using an OUYA pad, some were done with the PS3 pad, which doesnt suffer from the latency issues the default OUYA pad has from time to time. The control layout is logical, although a quick-restart button would be a time-saver. As it is, pressing Y/Triangle brings up a menu to do a variety of things, and while that works, there are so many unused buttons that it seems odd to not have one reserved for a quick restart. Menu navigation with the d-pad and in-game movement with the analog sticks is also a bit strange  one would think you could do both of those things with either setup and not just one.Glitches are a bit more troublesome than I would have liked. There were also times when I would get stuck mid-jump and have to restart. It happened a few times, and wasnt a frequent issue  but it is worth noting. Another issue cropped up when I got to the speedrunner section of the game and opted-out of playing it. Normally, bringing up a sections menu and leaving takes away the menu, but it didnt work that way here. As a result, there was some extra text on-screen for the Red, Red Romance section when I first checked that out. Exiting the stage and restarting it worked to resolve this particular issue. These are very minor issues overall, and really the only flaws I could find with the game. The best part is that they can probably be fixed up with some patching. Magnetic By Nature is an impressive game to both see and hear. The heavy color-saturation in each level set helps them all stand out and gives each one a unique feel. The purple-hued Lost Generation levels are a bit creepy, while the heavily-red Modern Times use shades of red and pink to create a more welcoming environment. Rhapsody in Blues heavy blues are calming, while the blue-green look of Stone Soldiers is almost soulless and definitely uninviting. Red, Red Romances stages are anything but. Theyve got a heavy-red saturation that is dark and foreboding because beyond all the red, youve got purple and blue mixed in with black and its terrifying.The use of color reminds me a lot of Miami Vice where the tone of everything could shift along with the color scheme even if the events stayed the same.Beyond the colors, youve got a game with smooth animation as well. The beams used to swing you around look good, and your movement and jumping animations are smooth too. There isnt a single flaw I can really find with the graphics  theyre pleasing and impressive in every way. The audio follows that same pattern, with a lot of animal noises in the background, 50s sci-fi movie laser sound effects, and a relaxing soundtrack. The sound design evokes Shadow of the Colossus with tension built up just through what you hear. The soundtrack is a joy to listen to, and combines with the sound effects to create a unique atmosphere.Closing Comments:", "date": "August 20, 2014", "grade": 4.5}