{"name": "Nantucket", "ref": "https://hardcoregamer.com/?post_type=post&p=288074", "text": "There is something that drives everyone, that thing in a persons heart that pushes them forward with whatever may come their way. Even if smashed against the rocks or having those who would steal from the wealth one has accumulated for themselves, theres that passion for a purpose that sees us along in what is the wildest of journeys, the lives we live for ourselves. For some this literal yearning of purpose becomes something greater consuming them to a point of emerging into someone better for themselves and others, for some this higher sense of being never comes, instead crushed beneath the cold waves of what is readily a demise of their own making. Life comes at you fast, especially when its 1820 and youre trying to put together the best whaling crew there is to avenge the late Captain Ahab and claim what is mastery over the sea.Nantucket is a tiny island that sits off the coast of Massachusetts and a place with a known history for one of the most well-known stories in American literature, a story based on real events. Nantucket, a new game from developer Picaresque Studio, captures everything about both the story of The Essex and the feeling of Moby Dick. Nantucket takes one of the most well-known stories in Western Literature and distills it down to its essence, presenting it in the form of a simple economic-management sim with a RPG-dice rolling battle system. Nantucket resembles games like Darkest Dungeon with more freedom of movement in a limited space. If there is one thing Nantucket does well, its combine both its source material with gameplay creating something that is easy to get lost in. Nantucket is a master of illusion in a way that makes the task at hand fun and easy through interactivity on various levels.Nantuckets tale will be familiar to anyone who has even caught a whiff of Moby Dick, beginning appropriately in 1820, the year that the real ship, The Essex, had accounts of being rammed and sunk by a whale. Nantuckets tale takes place in the fictional world of Herman Melville, who happens to be the games narrator. Nantucket opens with a quick tutorial of the basics on seafaring life and the fate of joining up with Captain Ahab, Ishmael (or whatever name) being the sole survivor of the Piquods ill fate. Opening a year later with the player returning to avenge Ahab from his adversary, Moby Dick, the white whale, but this is only the surface dressing for what truly lies in the depths of Nantucket. The entirety of Nantucket takes place looking at a map of the world displayed assumingly in what is the captains cabin. Through this living map everything the game has to offer can be found, with multiple complexities laid out in a steady rhythm as skill and story progress. Nantucket makes sure to ease the player in to the world of the golden age of western whaling. Its both a combination of historical accuracy matched with gameplay that makes it easy to get lost in Nantuckets vast seas.When starting out dont be fooled by Nantuckets many menus, numbers and explanations. It will seem overwhelming at first, but Nantucket does a fantastic job making sure the player is learning at a speed of their choosing, not a speed dictated by the game. Due to not having to navigate multiple menus, instead having them pop in from various points on the screen, Nantucket can keep the players attention on every task at hand. Nantuckets interactivity gives it life, where it might have none. Navigating the world is simple and what starts as completely undiscovered seas quickly becomes filled with whale breeding grounds, migration patterns and various ports throughout the world. The cycle of Nantucket is build a crew, pick up any quest from the port, head out to sea and do whatever the heart desires. While there is the main story thread, its hard not to get lost in exploring this slice out of history to see what every corner of the world has to offer. Much of ones time will be dictated specifically by how they are playing captain. Nantucket having such a balanced learning curve means not feeling overwhelmed with any decisions that might have to be made. Nantucket makes sure to dole out portions appropriately to get the players feet wet with discovering various points of interest in the world. This is also helped by Nantuckets excellent save system. It can be set to monthly, yearly or none, and for the cautious there is always quick save and quick load. Any game that allows for saving on the fly is a plus, because it says to the player that the game should be enjoyed. Nantucket especially wants the player to take it at whatever challenge the deem appropriate. Its this keen eye for detail of simplicity in complexity that elevates Nantucket. Take the different classes for example; the hunter, sailor, scientist and craftsmen. Even though there are only four, the skill trees embedded in them allow for growth of play that will be unique for everyone. The question of, how does one captain? This is important because it will also mean the success of venturing out to sea whether it be for bringing back blubber/oil from a whale haul or trying to find the lost treasure that a crewmate happened to get a map to in some shady bar gambling in the last port set out from. This same system is applied to ship management. Being captain means overseeing consumption of all resources for ship and crew. It is of the utmost urgency that food, water and other equipment be watched at all times. Crew members can grow restless, greedy or learn how to appropriately ration all depending on the decisions being made by the player. Nantucket feels alive in a way most 2D games dont and thats with only two screens. This feeling of presence Nantucket brings is in large part due to it being rooted in both fact and fiction. The narrative of hunting the elusive Moby Dick might not be real, but every news paper headline in the game as well as certain secondary quests are very much grounded in reality.What about the whale hunting? For anyone who hasnt read In the Heart of the Sea, let this be a recommendation. Whale hunting was brutal, dangerous and nothing which should be glamorized like it has been. Nantucket makes sure they player knows this, as when hunting anything or even facing pirates, its asking to play with fire. Taking on one adult sperm whale might not seem like a big deal, but when it dives only to breech with a tale slap that sends all the men in the boat overboard, things quickly become grim. Nantuckets battle system is the dice rolling part of the game. The player deciding who will venture out into the sea to hunt whatever prey at their own risk. Its important to plan accordingly because things can go south so quickly, which is also where quick saving/loading comes in handy. Nantucket understands its battle system can be unforgiving, allowing for leeway with saves to tackle the same problem through an alternative. The only part of the battle system that is slightly off putting is the lack of a fast-forward button, especially when there is one for time at sea. Having to sit through all the animations can drag, especially in longer fights. Closing Comments:Nantucket brings to life the golden age of whaling and the story of Moby Dick in a tight package thats perfect for anyone who is a fan of history, a good management sim or the story of Moby Dick. Unlike other management sims, Nantucket is intuitively easy to understand, helping the player along as much as possible without holding their hand completely. It can be unforgiving, but only if the player wants it to be, as with the use of quick save/load, Nantucket shows that it can be both enjoyed for casual and more serious play. Losing time sailing the seas of the 19th century feels fantastic in this classic epic and the hunt for Moby Dick proves to be as rewarding as it sounds.", "date": "January 31, 2018", "grade": 4.0}