{"name": "McDroid", "ref": "https://hardcoregamer.com/?post_type=post&p=99167", "text": "McDroid is a new take on the tower defense genre thats as hard as they come. The twists on the game could make it more aptly called a McTowerDefense, but this game is more than just a dollar-menu appetizer. The innovation on display, however, acts as a mask for pitfalls in execution, but it is an attractive mask, at that  the kind youd see at a masquerade ball that make people ooo and awe!In McDroid, your beloved, sentient planet has been lobotomized by an evil corporation and its army of evil bugs. Its your duty, as McDroid, to land your ship on different areas of the planet and heal parts of it until its all hunky dory. Heres the first twist: you have to defend youre spaceship, but you also defend yourself, a mobile droid (not to be confused with any iPhone competitor) who must collect strawberries to pay for weapons to defend his ship. Why strawberries? Because random As you can tell, this game has a funny bone that, more often than not, actually feels like your getting hit in the funny bone. Failed comedy aside, the strawberry-gathering mechanic is a refreshing, but tedious experience. Its like a cross between Plants vs Zombies sunflower mechanic and Starcrafts mining. You plant strawberry seeds on patches, and a strawberry pops out every once in a while, but you then have to go to the strawberry patch and retrieve the juicy, seeded currency and bring it back to your ship. Adding to the difficulty, these strawberries are often very far away from your ship, and the McDroid can only carry a limited number of strawberries at a time.Picture it like long-distance mining in Starcraft, if you were the SCV. Only, as McDroid, not only are you collecting strawberries, but you need to use them to pay for weapons, build the weapons, upgrade weapons, repair the weapons when enemies attack them, repair the ship when enemies attack it and also avoid dying along the way, because if you die, its the same as your ship dying: game over. Because of the massive workload, some levels feel downright impossible. One level in particular had me holding out with no strawberries and only one missile launcher, while repairing it and my spaceship, crossing my fingers that I had enough firepower to take the rest of the hoard.I did hold out, but I felt like I did nothing. Those moments take the player out of the gameplay experience even more so than usual tower defenses. Its a flaw in the game design, which tried to be difficult enough to make the player powerless, but succeeded in being gameplay-less. In ultra-unforgiving games like the little-known survival gem Pathologic, the difficulty is welcome, because even when the player is starving to death, you can still crawl your way to the next city in a futile search for sustenance. In the difficult moments in McDroid, it didnt feel like I had any options, so I just took my hands off the keyboard and hoped for the best.Upgrading weapons is another fault. Unlike the strawberries-only method of buying and selling, upgrading weapons takes diamonds, which occasionally drop from dead enemies or successfully built structures, but the diamonds are scarce, at best, and they too need to be gathered and brought back to the ship, thus getting lost in the shuffle of the several things McDroid has on his plate. Upgrades cost sometimes hundreds of diamonds. Once you do finally get enough diamonds to upgrade your weapons (which I was able to do after finding a challenge level where I could grind them) the shiny new weapons never seem worth it when you actually go into the level. For instance, an upgraded missile launcher costs the same number of strawberries as four missile launchers. Even if one upgrade is better than four regular ones, the better weapons still melt like wax paper from attacks by even the smallest enemies.Closing Comments:", "date": "August 18, 2014", "grade": 2.5}