{"name": "Blackbay Asylum", "ref": "https://hardcoregamer.com/?post_type=post&p=98910", "text": "Youd think the award for Ugliest Game Ive Ever Enjoyed would be well secured by now. The early days of 3D had some truly horrendous examples of artists finding their way in a new medium, and that doesnt even take into account the horrible limitations imposed by the original PlayStations architecture. Low-polygon people that lived not so much in the uncanny valley as uncanny Marianas Trench desperately sought out the necessary geometry to alleviate their plastic-faced freakishness through endless monochromatic corridors filled with more crates than a Crate & Barrel thats had a Buy 1, Get 200 Free sale on the barrels. Blackbay Asylum is up there with the worst of them, but looks arent everything or even, sometimes, particularly important. Despite the worst horror the game has to offer being the character modeling, I thoroughly enjoyed walking the halls of Blackbay Asylum and solving the mysteries necessary to pierce its entertainingly twisted, black heart.You walk the asylum halls from an eye-in-the-sky viewpoint as Doug, a serial killer who took out dad, grandma, grandpa, Mr Douglas, Jesse, Chatherine (spelling is frequently accomplished by throwing letters at words until they approach a close enough state) and all the members of her book club. Dougs a likeable psychopath, with something to say about every piece of furniture and decoration in the asylum, but his only real friend is a ragged teddy beadue to the tendency of people to die horribly around him. Although to be fair hes only directly responsible for murdering two people throughout the entire game, so from a percentage viewpoint thats like he hardly killed anyone. The horrible bloody violence thats torn through Blackbay Asylum and left mountains of gore and corpses in its wake has nothing to do with Doug, who only wants to escape. Oddly enough, although Doug is 68 and 352 pounds of blood-encrusted psychopathic muscle, its going to be your brain that sees him through the many puzzles and challenges that make up the world of Blackbay Asylum. The buckets of gore strewn around the asylum are a cover for an adventure game thats stocked with dozens of puzzles. Some are as simple as clicking on the right piece of background and realizing youve picked up the metal detector that will let you search a pit of bodies for a lost item, while others involve translating pictographic text, interpreting the clues in a poem to open a safe, twisting around panels to complete a labyrinth, hitting switches in a certain order defined by runes hidden in a series of rooms, and a whole lot more. Puzzles range from finding the obvious thing to complete a clear course of action, wherever it may be hidden in the environment, to the kind of wonderfully nonsensical contraptions one would only ever find in a video game. A door that unlocks only when youve not only figured out how to collect five coins but also put them in the right order on the pedestal? A minecart that only rolls when youve figured out how to arrange four pieces to connect a series of lines? The elder gods may come from a time endless millenia before mankind and wait only to be awakened to devour us all, but if this is the best security their human servants can enact to protect the inevitable tentacle-faced armageddon then maybe theyre not all that serious about eating us. Its definitely a lot of fun to solve, but maybe a heavy lock would have worked better. Closing Comments:", "date": "August 18, 2014", "grade": 3.0}