{"name": "Akibas Trip: Undead & Undressed", "ref": "https://hardcoregamer.com/?post_type=post&p=98871", "text": "Its difficult to not like Akibas Trip: Undead & Undressed. Sure, its wacky, full of fan-service and host to basic gameplay, but theres something undeniably endearing about its tendency to introduce over-the-top antics without preparing players for them, or apologizing for it all later. Nevertheless, this Yakuza-meets-Otaku-culture adventure game probably isnt for everyone, but may be still worth checking out just the same.Akibas Trip: Undead & Undressed (Akibas Trip 2, in Japan) is about as concerned with telling a serious narrative as Michael Bay is with, well, any movie hes ever helmed. The story is off-the-wall bonkers, throwing folks into ridiculousness from the very first screen. The protagonist Nanashi (who can be renamed) wakes up strapped to a table with a trio of maniacal figures standing over him. It would seem that the employer he interviewed with prior to the whole table-strapping business, somehow drugged him after he signed a contract for the position. While Nanashi just assumed he was applying for a standard part-time job that merely promised high-quality figma in return for his services, he is quickly told that the contract he signed was actually for a job in which he agrees to become a vampire and hunt everyday, unsuspecting citizens. Naturally, our hero begins losing it at the idea of being a vampire; but before he can erupt into a full-on panic attack, he is rescued by a young girl named Shizuku Tokikaze. Ultimately the pair escape; its only a short while afterward, then, that Shizuku allows our man to satiate his thirst with her own blood, effectively curing him of the bloodlust, and tells him of the aforesaid events. From there, the story branches off into one of madness filled with dialogue choices that actually mean something and alter the course of the tale entirely.Clearly, Akibas Trip struggles to take itself seriously. In fact, it never wants to be serious and makes that apparent whenever possible. Because of this, the story here is actually a lot of fun. With the writers not having to work within any sort of narrative constructs, the skys the limit, allowing them to explore bombastic scenarios that almost always result in some kind of debauchery and punch-line that only Otakus will fully appreciate. This is most obvious in the way that Nanashi and his posse dispatch foes  by literally ripping off their clothes and revealing their vampiric bodies to the sun so that they disintegrate. Its certainly not for everyone, and those of the anime and manga influence are very evidently the target audience in all of this, but even those who arent typical fans of the genre will almost surely get a laugh or two out of the unfolding events.Much of the humor has to not only be accredited to the original Japanese storyboards, but to the sharp performance of Xseeds localization team. The writing here is razor sharp, with small nuances, like the effective use of line breaks, comma placement and expert word choices, really showcasing the prowess of the editors and supplementing the voice acting well. Firstly, Undead & Undressed is indeed a dual-audio title, thus appealing to the diehards who demand a native language option, in addition to those who want dubbed dialogue. Xseeds done a nice job at casting English voice actors who understand their characters; they breathe life into the quirks and subtleties of the various personalities, most of the time hitting the right notes to make the dialogue ring true. The mere ability to toggle it on and off, though, is much appreciated and is a marked feature that every other localizing studio needs to recognize and thereby implement. But dialogue and voice acting doesnt mean anything if gameplay fidelity is not up to snuff. Fortunately for Akibas Trip, the gameplay is the shining aspect of the entire experience. Sure, the fan-service that litters practically every nook and cranny may be tough to swallow for players not used to such devices, but the core gameplay is tight in spite of that. Since the adventure takes place in Japans lovingly nerdy Akihabara District, the entire region is open to exploration for the player. Want to peruse the many shops selling ramen, Gunpla, anime and manga? Yeah, you can do that. Want to play a random arcade tucked away in the back corner of a barcade? Yep, go right ahead with that, too. Theres just so much to see and do; between the host of mini-games, secret locations, items, multiple endings, side-quests and various other hidden stuff, Trip is going to keep players busy for a long while  easily 20+ hours, at the very least.The bulk of it, however, is the combat. When scuttling around Akihabara, players are going to run into the Synthisters  those who have essentially become vampires, but are unable to control their animalistic instincts like Nanashi. Thus, on his quest to figure out who transformed him into this beast in the first place, Nanashi will knuckle-up against plenty of baddies  not an extremely diverse collection of baddies, mind you, but baddies nonetheless. When throwing down fisticuffs, players are given a compilation of attack types. Punches and kicks are mapped to the triangle, square and circle buttons, with each representing high, middle and low attacks, respectively. Mixing up the buttons in succession executes unique combos that in turn are used to beat up parts of an enemys body enough so that Nanashi is subsequently able to strip them of their articles of clothing. Despite the very notion of stripping one of their clothes as a way to win a battle sounding absurd, and like typical Otaku-pandering stuff, it never gets in the way of the overall enjoyment. If anything, its actually rather funny because of how outrageous it truly is. This isnt like Monster Monpiece levels of weird/creepy, but sufficient to be strangely intriguing.Also in our heros arsenal is the ability to jump, dodge, block, pick up and wield weapons, as well as perform hard-hitting, special moves. Its a fairly simplistic system, but one that doesnt tire quickly. Taking on multiple opponents and being able to equip weapons does much to help keep things interesting, but its the flow and pacing of the fights that ultimately makes combat so rewarding. It evidently has drawn much inspiration from the Yakuza games, with accessibility that satisfyingly hits hard but is also easy to understand. Were not talking about a series of mechanics that create a nuanced setup analogous to that which was featured in Shenmue; this here is just a fast-paced, immediately engaging system.Outside of that, the other part of Undead & Undresseds allure is in the ability to make ones character their own through the clothing customization choices, and dialogue options given to players in the talking segments. Almost always there are three picks to choose from whilst in a conversation, each one giving off a different vibe. The trifecta of options usually is as follows: serious response, humor-based response and a marriage of the two. This impacts how characters approach and interact with folks going forward, so these decisions feel like they hold meaning. Its actually impressive how the players chosen reactions can modify the surrounding casts personalities; they may be more empathic if they are treated well; they may be more snarky if treated poorly. Occasionally, folks can even work to reverse this by making sure they dont continue to deliver the same types of comebacks, hence creating interactions that feel dynamic, even unpredictable at times, mimicking how real relationships develop. To top off solid core and secondary gameplay, Akibas Trip also sports a powerful soundtrack that is bursting at the seams with J-pop goodness. There are bubbly tunes, vocal-infused idol ballads and darker, more sinister themes that elicit dread. The compositions are perfectly fitting for the light-hearted romp through Japans otaku district.Unfortunately, Akibas Trip: Undead & Undressed suffers in a few key areas. The most obvious part  and this will literally be apparent within the first ten to twenty seconds of taking control of the Nanashi  is the unruly amount of perplexing framerate drops and overall stuttering. It seems inconsistent, to boot, seeing as it was hard to understand why the game was hitting a wall at points. Sometimes it would be understandable, like when there was merely too much happening on-screen. Other times, however, it would trigger when running through the most vacant parts of the city.This could be tolerable by itself, except that the FPS plummets are made worse by constant loading screens. Akiba is an open-world game, but its hard to fully get lost in it because of how many loading screens you run into when traveling from section to section of the city. In actuality, this isnt one, sprawling, flowing world; instead, its a large city broken into smaller levels. When crossing from one area to the other, a loading screen pops before they can enter the next part of the metropolis. The loading typically isnt long at all (a few seconds at best, usually one or two), but the fact that it is triggered so repeatedly becomes frustrating. Closing Comments:Akibas Trip: Undead & Undressed is overflowing with charm. This magical recreation of Japans Akihabara District bolsters a magnitude of content and things to do, while the accessible yet rewarding combat makes traipsing through the cityscape pleasurable, feeling like a blend of a traditional beatem up and something more like what the Yakuza series has to offer. Unfortunately, an unfathomable amount of fan-service and technical hiccups dampen the experience. If its technical limitations and Otaku-stricken everything can be overlooked, however, this is an entertaining frolic through the geeky streets of Japan. Version Reviewed: PS Vita", "date": "August 13, 2014", "grade": 3.5}