{"name": "Disgaea 4: A Promise Revisited", "ref": "https://hardcoregamer.com/?post_type=post&p=97776", "text": "Do you like sardines?Apparently, theyre an agreeable substitute for human blood. For that matter, Lord Valvatorez ( tyrant of the Netherworld turned Prinny instructor extraordinaire) believes they offer all the stalwart benefits of Popeyes trusty can of spinach, refusing to return to his vampiric habits on account of a promise  a seemingly valuable commodity by demon standards. And with his fleshless diet weakening his once powerful self, Valvatorez graduating class  the transmigrated souls of humanities most nefarious folk  are easily abducted before receiving their congratulatory sardine, all while a Special Assassination Task Force stands in the way of his precious pledge with a plot of Prinny population control.Thats the kind of comedy youll find strewn about A Promise Revisited, port of the cult-classic Disgaea 4: A Promise Unforgotten; silly, melodramatic dialogue, hilariously gawky voice-work and ditzy characters that compliment the cavernously deep SRPG, decorating its ridiculous complexity with overtones of charm. Its an entry that, while certainly the most extensive in the series, eases newcomers into its fiddly mechanics by interweaving rules, scenarios and silliness.Sharing more than a whisper of heredity with its predecessors, the latest Disgaeas extracurricular activities are an absolute time-sink. Seriously, if your time is the Titanic, A Promise Rewritten is a massive glacier in the Atlantic Ocean of video games. With every slice of DLC from the PlayStation 3 version available on the cartridge, including the lengthy Desco & Fuuka Show and the Vita-exclusive Nagi Clockwork Time Leap scenario (which follows the story of a young girls mission to prevent a war forgoing the events of Disgaea 4), theres plenty incentive to invest in Nippon Ichis latest small-screen entry.The series, generous with its imagination, has always splashed its sagas with rambunctious characters, crafting its brilliance with intentional cheesiness and vacuous twists. A Promise Revisited is no different, composed of the same memorable cast and quotes, tightly wrapped in a portable package and served with a side of near-endless content. The almost farcical level cap of 9999 only further proves that the game is both jokey and absurdly expansive, sustaining its tradition of carving a niche within a niche.Another interesting addition is the weapon and character editor, which allows for color swapping among other cosmetic modifications. Its a minor (and completely superficial) inclusion that fits comfortably with Disgaeas long-established emphasis on customization.For the most part, though, the games original trimmings remain unchanged. Theres the hub-zone where characters can be healed and upgraded, items can be purchased and Item Worlds  the realm within any selected item  can be explored. The combat system is still a grid-based, top-down battleground of strategy and over-the-top animations, and controlling your cast of characters remains a turn-by-turn affair. Youll still utilize spells, exploit Geo Panels and Blocks, combine attacks and fuse monsters to clear the map  all the more sharper on the Vitas crisp display.Clocking in at over a hundred hours of playtime, Ive cringed, laughed and battled my way across Las Vegas public transportation with nothing but a Vita and a dream (of never having to ride the bus again). The breadth of reasonably fast-paced scenarios lends itself well to the games overall value as a portable experience, and while certain activities  such as the Item World, which on its own is capable of swallowing entire sessions worth of hours  can overwhelm time-conscience busybodies, the pause-and-play mechanics work exceptionally well on the go. In which case, the only thing stopping you from setting the Vita down is the inexorable addiction youre sure to develop.Replaying scenarios with different tactics can be rewarding on its own, with or without a narrative backdrop. For instance, improving your bonus gains is one such advantage, but its just as satisfying to simply improvise with newly acquired spells and evilities. Its a passage of time that isnt aimless, either. With character customization as pricey as it is time-consuming, theres always another weapon to upgrade or combo to learn.Theres something pleasant about Disgaeas particular brand of grind, though. Its never tedious, contradicting every notion regarding the customary genre staple of wriggling through countless samey encounters for countless samey rewards. The battle systems compulsory repetition rarely bogs the fun, with the waltz of battle often demanding a progressive variation of characters, slight adjustment of the Cheat Shop  which allows players to tinker with enemy strength, as well as experience, money and mana gained per battle  or experimental combo (involuntarily tackled in the midst of sleep deprivation, no doubt).Topping an already bloated assortment of content is A Promise Revisiteds online element: Netherbattle. Using the pirate, map and base editor, players can customize a ship, assemble a crew, and tackle user-created content or participate in character invasions. Its a limited addition that wont captivate most players, but its inclusion stretches replayability. On the whole, its worth exploring once youve exhausted every stomachable stage of the Item World and put a respectable dent in the level cap.Aesthetically, the refurbished sprites are beautiful on the Vitas bright screen, complimenting A Promise Revisiteds eccentricities with vibrant maps and smooth animations. The games meat and potatoes; the methodical, turn-based combat and utilitarian menus of heavy customization are hardly ever distorted by the games overall preposterousness, and its only discernible flaw is forcing a playthrough on those interested exclusively in the newest content on offer  a playthrough that, while long, is easily worthy of a second romp.Closing Comments:Ostensibly, A Promise Rewrittens quirkiness is at the core of the experience. Characters spew dialogue as awkward as mistletoe kiss-dodging and interminable cutscene are an incessant reminder of bargain-basement voice acting, yet somehow Disgaea maintains a certain charm throughout, counteracting even its most trenchant kinks, proving time and again that its most enjoyable when off its hinges. Rose-tinted goggles tucked away, however, and the fourth entry in the Disgaea series remains an exemplary SRPG, toting more than enough fresh content to warrant another spin. With enough combat goodness to satisfy even the most truculent warmongers, a variable Marianas Trench of depth in its customization and laughs aplenty, A Promise Rewritten isnt only the Vitas latest proof-of-worth, its also its strongest.", "date": "August 11, 2014", "grade": 4.5}