{"name": "Oddworld: New n Tasty", "ref": "https://hardcoregamer.com/?post_type=post&p=96025", "text": "When we hear the phrase hardcore platformer, we imagine intense, fast-paced gauntlets that test our reflexes and finesse. Oddworld: New n Tasty is a different, more methodical sort of platformer that aims primarily to test your sense of timing and, moreover, your patience. It certainly does a good job of the latter. After seven crashes and a freeze bug that cost me nearly an hour of playtime, mine ran out. Oddworld: Abes Oddysee is often heralded as one of the greatest games to every grace the Playstation. Its slick pre-rendered backgrounds and detailed character models certainly make it one of the best-looking, and its dark, compelling story of an enslaved people trying to escape from oppressors who now plan to eat them captured plenty of imaginations back in the day. The twisted eye candy coupled with slow but highly lethal platforming gameplay create a game feel similar to the works of Eric Chahe  which fans of niche platformers know is high praise indeed. Unfortunately, like a lot of PS1 classics, its begun to show its age, so Just Add Water took it upon themselves to update the game for the HD era.The result is Oddworld: New n Tasty, and on a visual level, hot dang, have they ever pulled it off. This new version accurately recreates the lush worlds of the original in real time at 60FPS, with dynamic shadows and camera movement added to make it look better than the original team could have ever envisioned. The Unity engines come a long way in the last few years, to the point where it can rival the Unreal engine, and New and Tasty takes full advantage of those advancements.These graphical updates allow for updates to the gameplay as well. Abes Oddysee was a platformer, but not a sidescroller. Technology necessitated that the game take on a screen-by-screen design similar to the Mega Man series, Another World, or Heart of Darkness. With New n Tasty, those constraints are no longer in place, and Just Add Water have taken advantage to turn the game into a true sidescroller. Its certainly impressive to have smooth, real-time 3D scrolling, and it makes the Elum runs a blast, but at times it can be detrimental to the game. For example, enemies in the background can take potshots at Abe if they see him out of cover, but the parallax effect can make it difficult to tell what in the foreground is in front of characters in the background.Like the game its based on, New n Tasty is ruthlessly unforgiving. Sometimes, its challenging in the best way possible, with puzzles and platforming sections based around careful planning, solid reflexes, and a good sense of timing. The Elum runs are the best example of this, where youre bolting forward at high speeds on your trusty mount, leaping over pits and mines and dodging gunfire. Other times, youll die over and over again and feel like its all the games fault. The controls feel stiff, slippery, and occasionally unresponsive. At times, youll press x and Abe wont jump, or hell perform the wrong kind of jump because you nudged the analog stick a fraction of a femtometre too far. Its positively infuriating.Theres a heavy emphasis placed on context-sensitive actions using the square button, such as pulling levers or activating ancient tablets. Unfortunately the zones in which these context sensitive actions become available are arbitrary and ill-defined. This can create very fundamental problems with small platforms, as you might want to duck to avoid an obstacle, but Abe will instead hang himself off a nearby ledge and get killed by a swinging spike ball. There are also specific situations that are incredibly frustrating, like trying to deactivate a mine under pressure. Deactivating mines requires careful timing (by the way, the game lies about this. Due to the input lag created by Abes animations, you need to press the Square button well before the mine turns green, as opposed to after), which can be easily thrown off when you press the square button only to discover youre a little to far from or close to the mine, and Abe refuses to touch it.Worse still are the sections when you feel as though your life is in the hands of a random number generator. A lot of combat in Oddworld involves setting traps rather than confronting enemies directly. Some enemy spawns are randomized though, particularly the packs of dogs that chase you down, and depending on how theyre spaced out, some can slip through traps that should be sure-fire and kill you. In these situations your only recourse is to respawn and hope you get lucky. For a game that demands so much precision, these problems feel like a slap in the face.Taken together in conjunction with a decidedly old school checkpoint system, this can all become maddening. Unless you have the prescience to predict what youll need to do before a checkpoint, you may have to do a lot of busywork (mainly setting traps) and repeat long sections of a level over and over before you can get to the part thats actually giving you trouble. Being unable to repeat a particularly tough set of jumps because you first have to spend 30 seconds pulling unrelated levers can really throw your timing off. Generally speaking, its bad design to make players repeat sections that theyve proven time and again that they can beat  especially when those sections are totally disconnected from later challenges. This philosophy has served hardcore platformers like Super Meat Boy well.There are also some context sensitive sections in particular that feel like filler. Abe has a number of gamespeak commands which he can use to communicate with his fellow slaves (called Mudokons). On a basic level, these allow you to order around squads for certain puzzles, and in that respect theyre generally useful. However, far too frequently youll be forced to play a ridiculous game of simon says, repeating whistles and farts made by certain Mudokons so that they stop blocking your path. There are also segments where youre tasked with finding a whistle password, but since there are only two whistle options and every password ends with a fart, its ridiculously easy to guess these passwords and skip the password sections entirely. Theres no challenge in any of this, it just feels like work.All that said, theres a lot to love about this game. The world is beautiful and wonderfully imaginative, and the various enemies and NPCs that populate it have a great deal of personality. Theres a wide variety of creatures that inhabit the Oddworld, and each presents an interesting and varied challenge to overcome. The game is good at teaching you these various mechanics in low-pressure settings and then testing your acumen, but the aforementioned problems hinder it at almost every turn. As I hinted in the beginning of this review, what really hurts New n Tasty is its instability. Time and again the game crashed on me, stalling my progress and totally pulling me out of the zone. Whenever it threatened to really grab me, I found myself staring at the PS4 home screen and wishing I could do something else. Just Add Water have promised that theyll patch this soon, but for me its too little too late. The real kicker, though, was a bug I encountered in the Scrab temple that rendered the game completely unplayable. Some confluence of events bugged out Abes chant (a vital tool that lets you open doors and possess certain enemies) so that he got permanently stuck in the animation whenever I used it. Worse still, the game autosaved in this bugged state (which carried over when I reset the checkpoint), so my only recourse was to start the entire chapter over again and lose about an hour of playtime. This sort of bug is just plain unacceptable by the standards of any good QA department, and theres no excuse for it being in the finished game.Closing Comments:", "date": "July 27, 2014", "grade": 3.0}