{"name": "Wayward Manor", "ref": "https://hardcoregamer.com/?post_type=post&p=94865", "text": "The Odd Gentlemen is the studio that was behind The Misadventures of P.B. Winterbottom. Winterbottom remains one of the most criminally underrated indie platformers of all time, combining excellent puzzle design and an abundance of charm to make for a truly wonderful experience. Neil Gaiman is the author behind Stardust, one of my favorite fantasy novels, and The Sandman, one of the best comic series of all time. Both of these entities have shown themselves of being truly exceptional in their field in the past. Thus, when Wayward Manor was announced, I got on top of my couch and jumped up and down until the cushions surrendered. I even wrote a little blurb telling you guys to go out and buy the pre-order version of the game. Souhahemwell, this is awkward. I feel like the guy that breathlessly told his friends how awesome the Titanic was and convinced them to buy a couple of ticketsYou start off as a restless spirit trapped in a treasure chest. I have no idea how a chest is capable of holding on to a ghost, but apparently it is some sort of special chest made by the Ghostbusters or something. You spend your existence trapped in it until a young girl from the family living there opens it ever so slightly, giving you the chance you need to escape. Now that you have escaped, you can move around from object to object manipulating them in such a way as to scare away the various members of the current family living there until just you and the house remain. Now, why cant you just manipulate the chest you are trapped in initially so you can get out? Obviously the chest is ghost proof. Duh.It isnt just the set up that is really clumsy here, as overall the story is quite lacking. This is a game written by Neil Gaiman, noted author who is beloved by his fans for the way he can write most goodestly. The credits say Gaiman wrote this brief story and also provides the narration, but honestly I cannot believe this was written by the same individual that wrote The Sandman. It feels like he woke up one morning, realized the entire plot of the game was due in an hour, and hastily scrawled the first handful of thoughts that came to his mind on a sheet of paper before submitting it in a panic. There are flashes of what might be a quirky and fun story here at the start, with Gaiman giving life to a cranky house that is upset with its current mindless, vain occupants, but nothing really ever fleshes out into anything interesting. Things that seem like they are going to be important to the plot just get dropped, and some of the central questions here are never addressed in any detail. There is just no life to the story, and it lacks the creative spark that Gaiman is known for. It just doesnt feel like he was ever interested in the project, and this lifeless tale of a ghosts plan touhdo something feels like it was scrawled as an afterthought by an intern and not the work of an award winning author.Once you get to the gameplay though, it becomes pretty obvious that Gaiman isnt the only person who mailed it in. Each level is essentially one room with a certain number of objects you can possess by clicking on them. Possessing them causes them to wiggle or fall or something, which will usually cause the human characters in the area to react in some way. Perhaps you can possess a little trough of candy, which will tip some over, which will then attract a pair of children. You want to interact with things in the right order or at the right time to scare the person in the room. Once they are scared enough, you can interact with bigger things in the room until you can possess most everything you see. Each room gives you multiple ways to scare its inhabitants, and once you find six you can trigger the big scare. Things in the room will swirl around, the person flees the room, and you are forced to play another level. Truly terrifying stuff.It seems like an interesting idea at first, sort of like a miniature twist on the point-and-click adventure game genre but it quickly becomes obvious they dont really have enough ideas to build a full game out of its one sole trick. The first level has you moving around small rooms in an attic, tricking a burglar into running into plates in what feels like a solid enough introductory level. Unfortunately, the game never progresses beyond this. The whole game is nothing but these simple little tasks that I hesitate to even call puzzles because of how straightforward they all are. With so few things to click on, most of these levels just sort of solve themselves without you even thinking about it. Close your eyes, click around for a minute or so, and you can complete almost every level in the game. And despite how short the game is, it repeats itself endlessly. Get the wifes dress dirty, give a little girl her stuffed toy, make the father dance around, rinse, repeat, try not to doze off. Every level featuring a character has almost identical scares for you to solve and some levels even have you doing the same thing multiple times. There is just no cleverness to any of the gameplay, and while the idea behind this is solid it quickly becomes clear The Odd Gentlemen couldnt think of a good way to implement it in the actual game.Really the only fun I had was going back and trying to find the hidden scares. Each level has a handful of secret tricks that are usually a bit more complex than the initial simple scares you need, and it was the only time I was actually forced to think and try and figure out what to do. I didnt really want to play the game the first time all the way through though, so digging around a second time holds almost no appeal. You dont get any extra points or rewards for doing any of the more complex little tricks, so basically youre just digging around for extra content in a game that wasnt enjoyable your first time through. If more time was spent making the game more challenging or only allowing these more complex combinations of tricks maybe I wouldve enjoyed my time more but if the game really wanted me to go back a second time it shouldve made my first time worthwhile.Beyond that, the game just looks very shoddily made. The visuals are just bad, and looks like they belong in a shovelware title for the PS2. The weirdly proportioned characters might have been interesting if the game had a more distinct or well actualized aesthetic, but as it stands they just look boxy and awkwardly animated. Weird little visual miscues are found throughout the entire game, with poorly timed animations or mistakes so bad they might as well be glitches. Candles light way too early compared with the animation, or a glass will be knocked over and still appear standing up. It just looks like it was put together by amateurs, and not by the same staff that was responsible for some quality indie gaming in the past. Similarly, the musical score is entirely forgettable and even Gaimans narration feels bored and uninterested.Closing Comments:", "date": "July 21, 2014", "grade": 1.5}