{"name": "Muramasa Rebirth: A Spirited Seven Nights Haunting DLC", "ref": "https://hardcoregamer.com/?post_type=post&p=94517", "text": "Six months ago, the first DLC for Muramasa Rebirth hit and offered up a perfect example of how to do DLC right. Five dollars got you a whole new character to play as with a separate campaign and used wacky magical cat transformations to stand out from any action RPG that had come before it. The second was just as strong and now the third DLC for Rebirth has hit PSN and delivers even more fun. The most impressive part about the games DLC isnt just that its exclusive to the portable version of the game, but how much better each new character makes the overall experience. They all play differently than the two default characters as well, which is usually not done in gaming unless its for pure gimmick. As Arashimaru, youre a ninja and while thats normally a good thing, its not so black-and-white here. You accidentally damage a sacred shrine, and are cursed by the spirit inside. As a result, youve only got seven days to live  thus explaining the Seven Nights part of the title.With the title out of the way, lets explore how amazing this character is. While the storyline isnt too compelling, it is great to see an in-canon countdown of sorts for his demise since it makes every action seem so much more important. Time is something we all take for granted, and when youre given a very small amount of it to do something, you begin to realize just what you can accomplish that you normally put off. Thanks to a combination of motivation, getting into a rhythm, and using that rhythm with some kick-ass weapons, you just might be able to save your life in this DLC adventure.Youre armed with a basic sword that does a ton of damage in close range and allows you to juggle enemies if thats your bag. Its the ultimate in hack n slash gaming and provides a visceral thrill that no other weapon in the game provides. However, if you really want to be flashy and kill with a sense of style, use his other weapon of choice. Beyond the sweet sword, hes also armed with a scythe whip. Yes, you get the greatness of the Grim Reapers sickle with the versatility of a Super Castlevania IV-style whip. This puppy goes in eight directions and they all result in quick death. It does less damage per blow than the sword, but your time between attacks is less here than with the sword. If youve got a screen full of enemies that absolutely need to die quickly because youre low on health, then youll want to rely on this to give yourself some distance and pick them off one by one. Switching between the weapons is as simple as pressing Triangle, and it takes less than a second to do it. The diverse in attack types makes Arashimaru the most fun character to play as yet in the game. Its such a thrill to just maul people with him and it never gets old.The rest of the game plays exactly like both Muramasa and Muramasa Rebirth, but this DLC gives you a new section that is spherical at times and reminds me a lot of Odin Sphere  an underrated PS2 gem that you can now get on the PS3 as a PS2 Classic. Youll also gain access to a boss rush mode, and like beating the regular enemies, boss battles play out completely differently using his attacks than they do with anyone elses. He really combines the best elements of a few action-platforming character types into one, and that amalgamation reminds me of Prototype giving you a taste of what it would be like to have a sandbox game where you could alternate between Spider-Man, Venom, Carnage, Wolverine, and the Hulk. Its not a 100% dead-on version, but close enough to still deliver the same thrills.Visually, this DLC gives you some new locales to enjoy and more robust character animation. Theres a lot going on at all times that screens simply cant do justice. The sword slashes are full of life, and the animation of your whip is some of the slickest to date. If Super Castlevania IV is the gold standard for that in a 2D platformer, then the bar has officially been raised. Granted, thats after 20 years, but still  this is some amazing stuff to behold. The only real flaw I found with the look of the game was how it sometimes appears that youre running on a different plane than the object youre running on  the character model doesnt appear to make contact at it should, and appears to almost be floating on the surface. Like the original Muramasa game, the environments come alive thanks to vivid colors. Youve got vivid pinks, reds, blues, and Earth tones amid atmospheric touches like smoke and haze effects in the distance that really make the game seem like a playable painting.Your ears are in for a treat with both the music, sound effects, and voice acting working as they should. The soundtrack continues to use the bamboo flute to great effect. While it seems almost stereotypical to use it in something set in Japan, theres no denying that its a beautiful sound to hear. During battles, the music ramps up when needed and things slow to a crawl when youre just running around. Like a good book, movie, or any form of entertainment, flow is key and the musical flow in this is superb. Sound effects for every attack are satisfying, which isnt a huge shock since they were before as well. The voice work has a newfound intensity that was lacking before. Theres more passion behind the Japanese voice cast here, and the use of subtitles works well since the text is large and easy to read. Some may prefer an English dub, but given that the setting is in feudal Japan, it seems more authentic to have subtitles  kind of like how Yakuzas presentation was improved tenfold by them after ditching the original games English cast.Closing Comments:", "date": "July 20, 2014", "grade": 4.0}