{"name": "Bik", "ref": "https://hardcoregamer.com/?post_type=post&p=93610", "text": "Many adventure games these days are driven by nostalgia, but none quite so heavily as Bik. With its retro art style and simple, voiceless dialogue, Bik does an excellent job of harkening back to the bygone days of SCUMM and AGI. Unfortunately, though it manages to capture the charming essence of those old games, it doesnt seem particularly interested in doing its own thing. A forgettable story and bland design prevent it from living up to the endlessly imaginative titles it holds in such high regard.In the waning days of summer, a young boy named Bik and his best friends go camping out in the woods. Its a carefree evening full of marshmallow roasting, punctuated by a spectacular fireworks display. Unfortunately, the fireworks end up attracting the attention of an alien spacecraft, and the boys are all abducted. Biks captors perform some sort of experiment on him, which allows him to understand their language.Ammut and Tatenen are a pair of alien mercenaries aboard the rickety starship Laterous. After narrowly escaping the pursuit of an evil galactic corporation, they find themselves adrift in a backwater system with a busted warp drive and no fuel. Their only hope is to sneak aboard a ship belonging to the Umarian abductors  one of the oldest and most dangerous species in the known galaxy  and steal supplies from them. Aboard the ship they cross paths with Bik, and together they escape from the sinister aliens. Of course, Bik wants nothing more than to go home, but its a big universe, and without earths coordinates he has no choice but to join the motley crew.From then on, the story kind of loses its way. The trio find themselves hijacked by a group of alien brutes with whom they were supposed to make a trade, then they end up embroiled in a corporate conspiracy to take over a farming planet. Occasionally, the Umarians show up to threaten the crew, but for the most part, very little of Biks story has anything to do with the struggles of its titular hero. We never find out what happened to his friends, or why he was abducted, and we never see him return to earth. In fact, all we see of earth is in a sequel tease at the end of the game  awfully optimistic for the first outing of an unproven indie developer.Of course, a weak plot can be carried by strong characters, but youve seen every archetype in Bik a thousand times before. Ammut is your typical wacky, wise-cracking adventurer (his defining trait being that he really likes sandwiches), Tatenen is a straight man through and through, and Bik is more or less an average child protagonist whose unexpected bravery is anything but. The only character whos particularly entertaining is an AI who ends up trapped in Biks Gameboy, and thats only because he reminds me of Marvin the Paranoid Android.The puzzles arent much to write home about either, though many of them are distressingly mired in adventure game logic. Bik doesnt so much test your capacity for logical inference as it does your ability to guess what the designers want you to do next. At one point you need to gain access to a locked room in an apartment building. To do so, you need to climb into the top floor of an entirely different building. To get into THAT building, you need to ride a cab around the city until you find the corpse of a random criminal, who for some reason has a portable ladder. Puzzle design doesnt get much more convoluted than this.It isnt just nonsensical puzzles you need to deal with, though. Frequently, Bik and co are tossed into annoying minigames. These range from bizarre scrolling shooter segments (which represent hacking for some reason) to ill-advised boss battles. The worst offenders, though, are the forced stealth sections. As is always the case with point-and click stealth segments, these are unwieldy exercises in trial and error. Worse, they waste your time and destroy the games pacing. Theres nothing challenging about waiting for a robot sentry to pass, its just tedious.If you get caught in the stealth sections (or screw up in any number of other ways) youll be killed. This is one of Biks most old-school mechanics  killing players in adventure games is seen as pass these days  but thankfully its handled in a decidedly new-school fashion. Every time you die, the game gives you an autosave from right before you made your fatal mistake. This ensures you never lose much progress, and keeps your deaths light and funny rather than making them overly frustrating. Still, there are a few segments that will tax your patience, where poor timing or an inability to figure out the designers arcane intentions will get you killed over and over and over again. Generally speaking, the deaths are only funny once, and theyre not that funny to begin with.On the bright side, I really dig the games retro look. Character designs are simple and blocky, but Zotnip have still managed to give the little pixel blobs a lot of personality. The bright, colorful character sprites can stand toe-to-toe with the best early adventure game heroes, although the environments are decidedly bland by comparison. Interestingly, this isnt an entirely 2D game. Spaceships are represented by simple 3D models that have an old-school charm all their own, and fit well with the low-res sprites. Its not the prettiest game out there, but it executes on its chosen aesthetic very effectively.Where Bik really shines is in its musical composition, using jazzy synth tunes to underscore its pensive gameplay. It sounds very spacey  appropriate for a game set in space  and is at times reminiscent of Earthbound. While the gameplay and story might drag, Biks eclectic, ethereal soundtrack is an absolute pleasure, and just retro enough to blend perfectly with the enhanced old-school visuals. While their game design chops could use some work, composer/project lead Mike Pinto and artist Neil Numberman make an excellent team.Closing Comments:", "date": "July 12, 2014", "grade": 3.0}