{"name": "Blue Estate", "ref": "https://hardcoregamer.com/?post_type=post&p=91875", "text": "Based on the comic series of the same name, Blue Estate has arrived on PlayStation 4 and is without a doubt the most hilarious game so far on the console. In Blue Estate, you play the role of Tony Luciano, son of an L.A. crime boss. Cherry, a stripper who works in Lucianos club, has been abducted by the Sik brothers so Luciano sets off on a wild adventure to get her back.The motion controls of the DualShock 4 are beautifully used to create the smooth killing spree that is Blue Estate. Surprisingly, the experience is as sexy as it is comical. Blue Estate is full of half naked women and Cherry does not leave much to the imagination. While its clear which demographic its geared towards, it shouldnt stop anyone from playing this entertaining title.Using the DualShock 4s sensors to control the on-screen shooting takes time to get used to, but becomes enjoyable once a comfort level is reached. Excellent use of the DualShock 4s touchpad is also made by utilizing it for numerous in-game gestures. For example, you will have to constantly swipe up on the touchpad to get Tonys long hair out of his eyes while listening to him complain about needing to use more gel. Another amusing gesture takes place when you play as Clarence, an ex-Navy seal who is sent to clean up Tony Lucianos mess. While traversing a mission in the sewers, a chihuahua constantly grabs onto his leg and a simple swipe up on the touchpad kicks the dog up in the air and off of Clarence. Other touchpad gestures include swiping to pick up ammo, opening doors and tossing bombs and grenades back in the direction of the enemies. Suffice it to say, this is the most engaging experience thus far using the DualShock 4 touchpad.Blue Estate comes jam packed with a ton of different weapons to use. You begin the game using a pistol and find other weapons along the way. The shooting is fast and furious. Enemies come in hordes and just keep on coming  more than likely the reason why your pistol has an unlimited supply of ammo. Several missions are included  some taking over an hour to complete  leaving you with a nice feeling of accomplishment following each mission. A point and combo system is included where the combo counter builds each time you shoot an enemy and resets if you are shot. The higher the combo counter, the more earnable points havoc is wrecked throughout the mission.Five lives are supplied to complete a mission. That may sound like large amount, but they go fast. When all are depleted, the entire mission is restarted from the very beginning. If a good portion of the mission has been completed and have to start over, it becomes a painful process. To help compensate for the difficulty, an extra life is granted to help get you through the mission each time the mission has to be restarted. If you started the mission with five lives and died all five times, for example, you will begin with six lives the next time the mission is played. Blue Estate proves to be challenging, especially when raising the difficulty to the hardest level. The familiarity of each mission starts to sink in after a couple playthroughs. Therefore, if you play and you die, keep on playing because it will eventually become second nature as you begin to remember where and when enemies show up on screen. Making Blue Estate a rail shooter was a great idea because the action is so fierce that controlling the character would have drawn away from the action.There are some challenges within missions that grant the opportunity to earn extra points. One will ask you to shoot the enemies in a certain order, while a another will ask you to shoot the enemies and only head shots will kill them. Blue Estate also comes with a coop mode allowing you to play with a friend to find out who the better shooter is and to earn the ever so important bragging rights. The coop mode is a nice experience and a great add-on feature to a game that already offers tons of amusement. Closing Comments:", "date": "June 30, 2014", "grade": 4.0}