{"name": "GRID Autosport", "ref": "https://hardcoregamer.com/?post_type=post&p=91244", "text": "Its a shame that Codemasters doesnt have more funding at their disposal, because as far as pure gameplay goes, they constantly deliver some of the mechanically strongest racing titles. Last year, Grid 2 burst onto the scene to critical acclaim, but seemed to be forgotten until it was made part of the Instant Game Collection of PlayStation Plus in December. Another highly rated release, F1 2013 seemed to receive little to no marketing push, an ever-changing release date and little retail presence (the Xbox 360 version remains scarce and commands a high price on eBay). If these games were given a larger marketing push and budget to rival Forza or Gran Turismo in overall functionality, its amazing to think of the status they could achieve. Thankfully, however, one thing that going after a niche market has cemented is the games commitment to gameplay, something that Codemasters is attempting with their quick follow-up to Grid 2. The career mode of Grid Autosport basically encapsulates the entire experience. Five different disciplines are offered: Touring, Open Wheel, Endurance, Tuner and Street Racing. Touring boasts high contact pack racing with an emphasis on realism and teams. Races feature cars with closely matched specifications and events split into multiple rounds at the same location where grid order is reversed for the second round. Open Wheel is a fast but disciplined mode all about grid mastering in F1 cars. Qualifying order is always retained here. Endurance is the most demanding discipline where players must constantly focus to cope with night time conditions and extended races. Thanks to stresses like rolling starts, keeping tires preserved is crucial. Tuner is the mode best played by those seeking a more traditional experience, placing focus on muscle cars and tuners competing in classic races, time attacks and drift events. Drift are the most difficult events, requiring a a smooth flow to be maintained across courses. Finally, Street Racing is the highest intensity mode and sees players competing on tight city streets while contending with narrow lines of sight and track surface changes. Once a high enough level is reached from completing events, Grid Championships are unlocked. All five main modes bring something different to the table and should be experienced by every player regardless of their main focus.After choosing a discipline, a plethora of settings can be customized including damage level, AI difficulty, number of flashbacks, transmission type, traction control, steering assist, camera position and more. XP is awarded based on how difficult the experience is tweaked. And yes, the in-car view makes its triumpeheth return after being unceremoniously excluded from Grid 2. Before a race in the paddock area, players can practice, install vehicle upgrades, complete time attacks, tweak options and more. Nearly eighty cars are included, each separated into one of the five disciplines. All of the cars are licensed, meaning that you can actually get behind the (virtual) wheel of a Ford Mustang or Aston Martin One and not a pale imitation. 22 tracks are included  a bit on the light side  and range from locals in the US to Malaysia. The racing circuits are perfectly functional (how do you dress up a racetrack?), but the street circuits leave much to be desired, comprised mainly of bland (possibly reused) assets.Autosport, however, is a game purely about racing and greatly succeeds in that respect. Cars handle smoothly and realistically, doing a fine job to mirror their physical counterparts. A simulator, this is not an easy experience and requires constant, well-timed braking to properly master. Once initiated, however, players will find themselves zipping through circuits and raking in sponsorships. Closing Comments:", "date": "June 25, 2014", "grade": 4.0}