{"name": "Tales From Space: Mutant Blobs Attack (360/PS3)", "ref": "https://hardcoregamer.com/?post_type=post&p=90399", "text": "In 1958, an independently produced horror movie called The Blob was released. Featuring an alien monster that grew in size as it devoured things with its gelatinous body, the film became one of the cornerstones of the campy horror films of the 50s. As we watch the people of Downington run and scream from the monster, we cant help but think how The Blob feels. Perhaps hes clingy, perhaps hes lonely, perhaps hes just looking for a friend. Drinkbox let us dive into the mind of an insatiably hungry movie monster with their indie hit Tales From Space: Mutant Blobs Attack. After being reserved for Vita and PC since 2012, PS3 and 360 owners can finally get a chance to see through the eyes of a monster bent on human destruction. Tales From Space: Mutant Blobs Attack is clever and charming, and though it has its share of control and longevity problems, its still a fun way to tear humanity a new one.In Mutant Blobs Attack, you play as a blob that has been contained within a laboratory by scientists, who have captured hundreds of other space blobs as experimental research. After succumbing to a number of experiments, your mutant blob character is able to escape the prison and gradually gain strength and size by absorbing things in the environment. As you slowly move from tiny blob to Blobzilla, you must also find your fellow blobs, whichve been lost during the escape. In classic Drinkbox tradition, the game rarely takes itself seriously, with wacky animations from the humans and plenty of not-so-subtle references to internet memes and other indie games. The game oozes charm with its aesthetic, constantly making you laugh, especially when youre absorbing scientists as they scream in terror. Drinkbox has always capitalized on their sense of humor, and Mutant Blobs Attack is another funny outing from the indie studio.Controlling the blob is pretty easy overall. You can move, jump, and wall jump with ease, even if the physics can feel rather wonky in busier stages. You can also dash downward with the circle button in mid-air. As a mutated alien blob, you also have a few special abilities to use. You can use magnetism to cling to or repel away from metal surfaces, slide into tight spaces with your gelatinous form, and even use special rays to become a floating blob bubble (which opens up a whole new gameplay style more like a side-scrolling shooter). Its nothing too complex, which is good, because many levels require you to be crafty with the jumps. While its certainly not frustratingly difficult, some levels demand more precision than necessary, cutting the pace down a bit and limiting the momentum.The main gist of Mutant Blobs Attack is that by absorbing items, your blob gets bigger. Being bigger means you can absorb bigger items, which make you bigger, so on and so forth. Mutant Blobs Attack is essentially Katamari Damacy, but minus the subtlety of its dark concept. Youre a blob and youre out to devour anything and everything. Like Katamari Damacy, theres a perverse joy in rolling over screaming scientists, smashing up tanks, and absorbing entire buildings. The game prides itself on this steady sense of scope, as you start off the game as a tiny blob on the desk and eventually move up to leveling an army in seconds. The entire game reaches a ridiculous climax by the end, one that takes Drinkboxs quirky humor to new heights.Levels are normally composed of different sections, linked together by passageways or air currents. You might enter an area with a wooden cork blocking your way, and the only way to progress is to become big enough to absorb the cork. Your general room will have random junk lying around for you to absorb, but the junk is usually tucked away in a corner that is only accessible after solving an environmental puzzle. You might need to fling yourself over a chasm of spikes, dodge dangerous lasers, or simply find the single accessible route to the fuel for your gelatinous destruction. The puzzles arent brainteasers, focusing more on platforming reflexes than brain-wracking logic, and a majority of them are very well done. Some tend to bite the bullet too much (especially the ones with one-hit-kill lasers), but Drinkbox use the blobs amorphous design to make the puzzles rather loose and forgiving. The puzzles dont share too much cohesion, however, as the air currents and passageways that move you from room to room break up the levels too much. The transitions between puzzles rarely feel seamless because of them.Tales from Space: Mutant Blobs Attack debuted as a downloadable launch title for the Vita, so its to be expected that some changes were made during the move to PS3. While the original Vita game used the touch screen to move or rotate platforms, the PS3 version requires you to first press the R1 button to choose which platform to move or rotate (sometimes there are more than one) and then use the analog stick to move the platform. This isnt too intrusive, but there are occasions where the game automatically assigns your control to a specific platform, which can make coordinating multiple platforms a real pain. The transition is relatively good, though, and very few levels reach the point of straight-up brokenness. Also, as with the Vita edition, the optional Tilt-a-Blob levels appear, which used the Vitas tilt controls to move your blob around a top-down stage. Thanks to the Sixaxis controls in the Dualshock 3, the PS3 version has all of the original Tilt-a-Blob levels intact. The sensitivity can be frantic at times, though, and some stage hazards like the circular pits can be extremely frustrating. Overall, though, the move from the Vita to the PS3 has been a relatively solid one, with no real compromises during the transition.The game features 24 main levels, which isnt that much for an $8 price tag (though if you already own the Vita version, you can get a PS3 upgrade for half price). Leaderboards do offer some nice competition, rewarding speed and diligence in finding fellow blobs in levels, but dont offer too much extra appeal beyond the main story. The story itself is definitely funny and worth experiencing, but its hard to justify the price with only 24 main levels to check out. Drinkbox couldve added a few more creative levels, as many of the more obscure features of the blob had yet to be fleshed out completely.Drinkbox have always had a knack for style in their games, and Mutant Blobs Attack is no exception. Half flash cartoon, half abstract painting, the graphic design in Mutant Blobs Attack is charming at every turn. Animations are downright adorable, even when youre steamrolling tanks and helicopters, and the blob himself displays occasional bits of personality that, while sparse, are very entertaining. The level design tends to dip in quality in the middle of the game (mostly in parts where youre underground), but overall, this is a great-looking indie game. The soundtrack is a nice bit of goofy, sitcom-y lightheartedness, even when youre murdering a flock of chickens with your gooey body. It picks up in tempo and mood right when it needs to, almost echoing a cheesy crime film. Drinkbox continue their confident stride with indie game aesthetics and Mutant Blobs Attack is another jewel for their crown.Closing Comments:Tales From Space: Mutant Blobs Attack is a brief, but charming, indie game that puts a funny new spin on the scope-based progression of Katamari Damacy, while still making the player feel empowered and destructive. Leveling a city and tearing up an army of tanks, only to see your blob form grow in size is a feeling of undeniable wonder. You feel like youre playing the role of a movie monster. The puzzles follow up on the goofiness, while also providing a nice challenge, even if some tend to suffer at the hands of imprecise control scenarios and a very disjointed design connecting them. Its also quite short, hitting its stride within minutes of reaching its climactic conclusion and leaving the player with a slightly empty feeling. Mutant Blobs Attack is a clever and stylish game, and while its full potential is never entirely displayed, youd be hard-pressed to find a game that makes mass destruction this adorable.", "date": "on June 20, 2014", "grade": 3.5}