{"name": "Ultra Street Fighter IV", "ref": "https://hardcoregamer.com/?post_type=post&p=88887", "text": "Lets get one thing out of way: expanded/enhanced editions of a fighting game is a necessary evil. Accept it and learn to embrace it. If you really think about the context of fighting games, new editions of an existing game are a blessing when done right. Capcom arguably started this trend way back when and has become almost notorious for it. Even though it seemed that things were done and dusted with Street Fighter IV, Capcom eventually announced Ultra Street Fighter IV. They revitalized mainstream interest in fighting games with Street Fighter IV, its popularity and impact almost comparable to what Street Fighter II accomplished back in the day. Even as we usher into the next generation of gaming, the company gives the old dog one last run in the spotlight with Ultra Street Fighter IV.Is this an example of Capcom milking a successful game for all its worth till the very end? Well thats one negative nancy way of looking at it. To say they cashed in on Street Fighter IV over the years with Super, Arcade Edition, and now Ultra is not entirely true. The way I see it, the company actually supported the hell out of the game with huge updates that were timed and priced appropriately. In doing so, it allowed the game to remain genuinely fresh and relevant in an industry that has been moving at an increasingly rapid pace. To put things into perspective, there is a full three year gap between Ultra Street Fighter IV and Super Street Fighter IV: Arcade Edition, and it is priced very generously.Ultra Street Fighter IV adds five new fighters and brings the impressive roster to a whopping 44 combatants. Granted, four of these characters namely Poison, Rolento, Hugo, and Elena are based on their renditions in Street Fighter X Tekken, but that game wasnt very good. Therefore, having these characters in a far superior fighting game is a blessing. While some may moan and accuse Capcom of recycling assets, its anything but. Theyve cleaned up and retooled these four characters to fit comfortably within the excellent design and balance of Street Fighter IV. Joining these returning characters is a brand new face: Decapre. These characters really freshen up a game that many are still struggling to put down for the last five years.Even if youve already experienced playing these characters in Street Fighter X Tekken, they no doubt have a profound sense of newness in Ultra Street Fighter IV. Rolento was simply made for the blistering fast and precise gameplay of the Street Fighter Alpha series, and yet he feels right at home in Ultra Street Fighter IV with his unique mobility fully intact. Elena brings in her distinct capoeira style into the fray with one of her Ultra specials being a healing spell, an interesting rarity in fighting games. Hugo gives Zangief a run for his money with his colossal size, his unparalleled strength compensating for his lack of speed and mobility. Poison a character that has confused and allured many a gamer makes a damn fine addition with a fighting style that feels familiar and yet so very new. Personally, I found Poison the most fun to use. Her (or his depending on which version of the characters history you follow) style just clicks with ease and you can do a lot of cool things.Then there is Decapre. I recall the collective moan from gamers when she was first revealed, complaining that she looked like a lazy Cammy reskin, with PC modders proudly boasting their custom made Decapre mods for Cammy. Mechanically designing a brand new character, and incorporating that into the grand design of a meticulously assembled fighting game, is a work of art. Shame on those who mocked Decapre for she brings a style so unique and interesting, bearing only cursory resemblance to Cammy. Decapre is certainly among the more challenging characters in the roster, definitely one for the advanced players. Her moveset is unusual and doesnt really click immediately, but thats her strength too as shes a nuance heavy fighter who is simply rewarding to use and learn. Her second Ultra special can be executed in two different ways (each with a different command input) which technically means she has three Ultras. Make no mistake, Decapres debut is a memorable one.On top of these new characters the upgrade adds just as many new lavishly vibrant stages, featuring colorful backdrops that are crammed with cool cameo appearances. Street Fighter IV was a beautiful looking game when it was first released and it still holds up just as well. The rich soundtrack expands even further with new tracks and remixes. Visually and musically, Ultra Street Fighter IV gives a rather old game that new game smell. More importantly however, it substantially improves upon the core gameplay in so many ways.The fighting system feels just as tight and responsive as ever, now made even better with important new additions and revisions. All previous characters have been revised and cleaned up in a multitude of ways. Should you be unhappy with the Ultra version of your favorite character, the game allows you to play as the Classic, Super, and Arcade Edition version of a character. Making Ultra Street Fighter IV the ultimate all-in-one edition.In past editions of the game you were forced to choose one of the two available Ultras for a character, but in in this latest edition players can now choose to take both into battle. A worrisome inclusion for seasoned veterans it would seem, as I too enjoyed the strategy that went into picking an Ultra. But the Double Ultra option comes with a catch: while you have the advantage of having both Ultras for your strategies and combos, their damage is substantially reduced. Even the most casual players will immediately sense this trade-off.This showcases how a seemingly fundamental rule breaker ends up complementing, rather than contradicting, the established gameplay foundation so seamlessly.Theres little touches too, such as being able to delay a characters knock-down recovery and the improved Red Focus, and they make a huge difference in a game where every moment and movement is crucial. All of these gameplay changes were done in response to community feedback and requests, so really Ultra Street Fighter IV is a case of giving fans exactly what they want.The online play is just as addictive and active as ever, with the game introducing a useful online training mode, a new team match type, and even adds some new sharing features in the Replay Channel. Despite the excellent netcode of the game, lag and latency issueseven the slightest can cause despair to most players that are accustomed to that perfect input response. While there is no magic wand to make online lag go away, Ultra Street Fighter IV has a rather curious training mode feature that allows you to simulate lag and latency issues by specifying frame delays. With this, players can train to execute their go-to setups and combos in less than perfect online conditions.Closing Comments:", "date": "June 15, 2014", "grade": 4.5}