{"name": "Exo One", "ref": "https://hardcoregamer.com/?post_type=post&p=414647", "text": "Predominantly confined to a move-set governed by a mere three commands  analog stick to move, a trigger to glide, another to descend  theres admiration to share with a game like Exo One in the way it gives way for the spectacle to speak for itself, regardless of how lengthy or inevitably dominant this design approach is. Specifically in the way it continuously strives to find the half-way point in the depiction of a planet-hopping voyage through space. On one end of the spectrum: the romanticism of alien worlds and awe-inspiring stretches of baron emptiness that are admittedly, in their own right, a spectacle to behold. And on the other: that harsh, abrasive acknowledgment that the cruel reality of physics are even more apparent when it comes to ones survival. And the game just so happily places itself slap-bang in the middle.You might mistake Exo Ones brief journey as an altogether simple affair with an even-simpler pitch given the limited scope of gameplay with an objective that remains the same throughout: move forwardthats it. Landscapes too that, outside of occasional topography to interact with  and seemingly-artificial structures that at first hint towards deeper lore eventually subside as miscellaneous irrelevancies  prove little in the way of danger. Even the games own premise describes this as a game without peril, without challenge. Devoid of anything that you would otherwise link to some form of threat to onesshall we saycontinued existence. Exo One wont last long in the mind if what youre seeking are intricate mechanics or a story that in all honesty  much like the shape-shifting object you control throughout  is heading towards a cohesive end point.It wont be remembered if youre looking to engage with (by that I mean fight) alien life-forms of a sort. This is not that type of game; Exo One has an intended tone and youre going to know about it sooner rather than alter. And at the risk of starting out too harsh on the game, developer Exbleatives starry-eyed gazing into the grand yonder can feel like its instead gazing closer towards its own figurative naval than it is anything that can be considered satisfying. Aided in no way by ones reaching the ending credits. Whereupon any and all assumption of some grand tie-in between ones journey and this assumed failed mission to Jupiter the game conjures repeated flashes toward is left at an unsatisfying and frankly confusing cut-off. Garbled dialogue interspersed throughout, of which you cant help but deduce must be playing a critical part in the narrative here, only there you realize, to perpetuate the fallacy. Maybe theres a connection and Exo One inserts it at such an extreme level of subtlety that its impossible not to come away and feel like the game couldve easily ditched any semblance of story.Had it not been for its brief escapades between planets  when youre left to make your way across these varying surroundings of ground, sky, sea and occasional space alike  Exo Ones more frustratingly self-indulgent aspects may have posed an even bigger issue than they bring. Its still a problem, dont get me wrong and one that will drag the overall end product down a significant degree. More so if youre going into this game expecting a full 360 degrees of flying. The reality is that while the game isnt strictly on-rails, player freedom is, for all intents and purposes, restricted to a channel per se of the environment. Stray too far left or right of the desired area and the game will forcibly do a U-turn for you Starfox-style. But for those keen to spend around two to three hours to reach end credits, Exo One does have surprisingly serene moments. Moments that while not the most active or stimulating so far as numerous actions happening on-screen at once, as simple the controls are, Exo Ones beauty is in how elegant the very act of managing your little UFO-like device is.Indeed, the strengths lie in more than just the visual identity. If anything, the alien worlds in of themselves  so far as what colors they are or the actual geometry of the terrain itself  dont factor in. Instead, what Exo One gets right is, to refer back to that previous point, is in its balancing of the general mood of what far-flung, sci-fi exploration musters. There are wide shots of the planets surface and the skyline  of the distant beams of light youre heading towards to make your next jump to light-speed. There are the clouds, the oceanic waves, the sheer spectacle at flying thousand of feet above ground. And thats without including the emergence of floating islands that oh so briefly turn the game into some sort of gravity-less 3D platformer. But then there are the small aesthetic touches that counter that wonderment and amazement. The way the in-game camera glitches and skips from time to time, the rumble of air when soaring through or beneath it back to ground level. Simple, field recording-like sounds that are no more abnormal than what youd hear on Earth. But its that balance that makes ones journey, if not perilous or threatening, that much more palpable.Yet the ease at which one can so quickly settle into the rhythm wouldnt be as effective were the gameplay not be as stripped back as it were. And more importantly, quick to master with what is the second and crucial part to Exo Ones main positives: its controls. Essentially players are required to use physics and the act of momentum so as to jettison their craft across each alien landscape. How this is explained in-game is that your craft can shift between one of two forms: a sphere which causes it to become heavy and thus sink like a stone or something more akin to a UFO which allows it to glide across for a limited time. Said time indicated by a visual cue that aided by an additional double-jump are all the player has in maintaining their aerial position. The only way to keep momentum going is to master being able to swap between a state of being either light or heavy  and in doing so, using terrain features like hills, craters, mountains and simply gravity itself amidst high altitude  so as to harbor that vital motion.It may sound ordinarily simple and while the gameplay process is indeed as basic as this, its that very back-and-forth deducing of when to descend and when to keep flying that keeps the lengthy treks on each planet from feeling stale. While some challenge is sprinkled about via the presence of collectibles to gather in-between structures and at seemingly-impossible heights at a glance, you neednt have to resort to collectibles for the experience alone to conjure its own form of emergent, personally-made achievements to reach for. The only downside unfortunately is that the simple act of getting from A to B is what dominates any semblance of objective throughout Exo One and as eloquent as the spectacle is for large swathes, a few more twists and turns away from the repeated linearity wouldve greatly benefited. Aside from one segment requiring you to gather three items to reactivate a device (to which the game does actually expand to exploring a more fully-3D and open space) and another that has you reaching escape velocity so as to hop from one star-orbiting asteroid to another, but sadly neither of these moments  different they may be  feel as fleshed out as they perhaps should be.Closing Comments:Its a mystery on whether you can deem it a positive or a negative that if you were to take away its meager narrative implications, Exo One would still be the exact same game. Regardless of how much you pay attention to its interspersed, directionless dialogue that goes nowhere and adds little to what is still a low-key but satisfying trip regardless. While not the most complex nor the most demanding of engagements, what the game may lack in thrills or pay-off with its major story beats, it makes up for with a pitch that still invites players to get a grasp of its intentions. Intentions that, thanks to a simple control scheme, makes the act of journeying across these varied environments one to marvel at. Short and sweet but in no way significantly dented by its own strict vision and run-time, Exo Ones picturesque voyage through one far-flung planet to the next, though not without fault, is more engaging and novel than it is mildly indulgent.", "date": "November 18, 2021", "grade": 3.5}