{"name": "Entwined", "ref": "https://hardcoregamer.com/?post_type=post&p=88406", "text": "Video games are an inherently funny thing. While major AAA titles grip us with their showmanship, big budget visuals, and unparalleled realism, small-budget downloadable titles often slip in under the radar and blow us away.Enter Entwined, the game that shocked the world yesterday during Sonys press conference. While the gaming community originally learned earlier this year that Sony had filed a software title trademark for Entwined, nobody had any idea what this mysterious game would end up becoming. After announcing that the beautifully psychedelic action title would be out immediately, the gaming community had no idea what to expect. As it turns out, Entwined is not only a spectacularly heart-warming title with gripping gameplay, but it just might be the PlayStation 4s best game. Entwined tells the story of two souls in love, specifically an orange fish and a blue bird. Racing through nine lifetimes in order to be together, these two stylized creatures evoke emotion in the player through symbolism. You see, though Entwined absolutely tells a wonderful story, there are no cutscenes, dialogue, or text cues to explain what its narrative actually entails. Instead, players use their own feelings, thoughts, and memories to piece together a tale that feels distinctly personal. To one player, this could be a story of heartbreak, to another it might detail the power of fighting for the person he or she loves. This is the true magic of Entwined: its metaphorical storytelling allows players to have completely different, yet equally powerful, reactions to it. Imagine Journey with faster gameplay and a superb love story.Each of the nine lifetimes contains two distinct phases, one where the two souls are apart, and one where they come together. During the first phase, players control the fish with the left analog stick and the bird with the right. The two souls race through a circular tunnel, collecting orbs and passing through gates reflecting their respective colors through simple stick rotation. While controlling two characters at the same time might appear confusing, the mechanic works absolutely flawlessly. Because each soul can only move around one half of the invisible circles circumference, the result is that only half of each analog stick ends up being used. The control scheme adds further depth to the games every inch is a metaphor of some sort feel, as the movement of the players thumbs feels unified the entire time. Put it this way: the ideal relationship is built upon two separate, unique individuals living their lives as one; Entwined turns this concept into an engaging control scheme that never fails to feel intuitive.The aforementioned orbs and gates serve a distinct purpose in Entwined, as they have the power to bring the two souls together, or break them apart. As the player rotates the analog sticks to interact with the tunnels colored objects, he or she will notice two separate bars increase. Collecting respectively colored orbs brings the icons signifying each bars progress closer together, while failing to pass through a gate will cause the icons to drift apart. After each of the bars is completely filled, the player will have the ability to begin a soul-merging process through pressing the L1 and R1 buttons. Once again, this mechanic is a love metaphor: in order to fully commit to one another, both sides must be willing to participate in the process. After the two souls begin to merge, players must pass through a number of gates without failing multiple times in a row to initiate the second phase of each lifetime.Easily the most beautiful part of any of Entwineds lifetimes is the segment where the two souls come together. After merging to form a green dragon, players are able to fly freely around a completely open area. The two progress bars become one, able to be filled with either blue or orange orbs (as each souls power is fully present in the dragon). Once every orb is collected, a white wormhole opens, transporting the player to the next lifetime. These orbs can be collected completely at the players leisure; there is absolutely no rush to split apart and move on. In fact, this freedom speaks to yet another one of Entwineds many heartwarming metaphors: if two individuals are inevitably going to split apart, the speed at which the two sides diverge is largely irrelevant in the grand scheme of things.Lets not forget: Entwined is flat-out gorgeous. The psychedelic tunnels, each featuring various set-pieces, make the game feel like a playable version of the iTunes Visualizer. The lighting effects are wonderful, the framerate is solid (other than a noticeable hiccup when a player fails to merge the souls together, though this could actually be intentional), and the particle effects are impressive. Every inch of Entwined feels completely thought out, which should not come as any surprise given how every inch of the game helps tell its story. Add a mood-setting, serene soundtrack that knows exactly when to speed up or slow down, and you have the makings of a sensory vacation.In addition to its breathtaking campaign, Entwined also sports an addictive, five-stage challenge mode. Players given three lives to use towards surviving for as long as possible during an endless tunnel sequence. Each of these beautiful levels, which are unlocked by achieving a certain score in the preceding stage, is based off of one of five materials or substances: water, wood, fire, earth, and metal. This is not called challenge mode simply for show, as it is incredibly difficult to attain the level of perfection necessary to complete each stage. These challenging levels, in addition to the incredibly replayable campaign, mean that Entwined is a sensational value; this is absolutely not a one and done title.What takes Entwined from a great game to a borderline masterpiece is its ending, which evokes memories of reaching the peak of the mountain in Journey. Without spoiling anything, Entwineds conclusion makes every second of its roughly two-hour long campaign worth experiencing. It is the type of ending that will bring tears to the eyes and smiles to the faces of many, as it is pure, unadulterated beauty in its finest form. In fact, Entwineds ending is so emotionally spectacular that its easy to see it becoming something that thousands of gamers experience over and over again. It will brighten up the darkest days; it will remind you why love is the most important thing in the world. It can easily be said without a shred of hyperbole that this is the best video game ending of 2014.Closing Comments:Its easy to see why Sony chose to give Entwined air-time during its conference, as it is absolutely exceptional. This is one of those games that players will go to time and time again due to its extensive replay value. Entwined has the potential to cheer up the heartbroken, enlighten the lonely, and reinvigorate the jaded. Its incredibly touching metaphor-based story brings tears to ones eyes, while its gameplay is engaging enough to completely stand on its own. The new contender in the race for the title of Flagship PlayStation 4 Game, Entwined validates Sonys commitment to both creativity and the indie movement. Dont be surprised to see this small, yet emotionally giant, title competing against the big boys for Game of the Year 2014.", "date": "June 10, 2014", "grade": 4.5}