{"name": "Dark Raid", "ref": "https://hardcoregamer.com/?post_type=post&p=87674", "text": "Like most genres of games, first-person shooters have evolved and changed quite a bit over the course of their existence. From the secret filled arenas of the genres progenitors to the linear corridor crawls with over-the-top set pieces of today and everywhere in between, games classified as first-person shooters have varied quite a bit over the years. Dark Raid is an indie FPS from developer Vector Games that aims to return to the design and gameplay of more classic shooters and get away from the tropes of the modern FPS landscape. Though in theory Dark Raid does successfully evoke many of the elements one would associate with older shooters, the results are not exactly what you might be hoping for.Across the wide range of design concepts that encompass the idea of classic shooter, Dark Raid most closely resembles single player shooters from the late 90s like Quake, Half Life, and Unreal. The game is a linear journey through a series of levels as opposed to the combat arena-like approach of earlier games like Wolfenstein and Doom. The game does have a multiplayer component, but considering there is no one online playing it, its really only worth talking about the single player. While on a surface level Dark Raid does share some similarities to classics life Half Life, it all falls apart in the execution.When you strip away everything else and look at the core of what makes a shooter enjoyable to play, the key fundamentals are really weapons, level design, and enemy encounters, and unfortunately Dark Raid comes up far short in each of these areas. The feel of the weapons in a first person shooter is always a very hard thing to describe, though its probably the most important aspect of any shooter. Looking closely at what defines the feel of guns, the key contributing factors are usually visual feedback, audio quality, and the effect the weapon has. Every single gun in Dark Raids very standard FPS arsenal is fundamentally unsatisfying to fire.The weapon sound effects sound simply terrible, even worse than what youd find in the 15+ year old games this one is aping. These sound effects make the weapons feel weak and ineffectual, which is certainly not helped by the complete lack of recoil. The cross-hair doesnt move at all when you fire, allowing you to simply hold your aim on a target and never let off the trigger, which once again contributes to a feeling of weakness. Finally, enemies dont react to your weapons fire at all, with the only animation being the dropping corpses when youve damaged them enough. The enemies themselves consist pretty much entirely of a handful of robot types, and if you compare the satisfaction of shooting them in this game to something like Binary Domain with its dynamic chassis damage and deformation, its clear Dark Raid comes up way short.In terms of the enemy encounters themselves, they arent as terrible as the weapon handling but theyre still not great. There are only a handful of different robot types which dont really behave all that differently, and that behavior doesnt make for very compelling combat. The enemies mostly run around randomly, jumping like lunatics and firing constantly. There are a couple of other types of enemies, one being a stationary turret which seems to be placed in locations as to always allow them to get the jump on you and kill you before you even see them, and hovering drones which do nothing but fly straight at you and explode for instant death. Almost all of your combat deaths are going to come from these two types of enemies and every single one of them will feel cheap and unfair, which is made even more frustrating by the terrible checkpoint system.The classic shooters this game takes inspiration from almost universally used a manual save system that allowed you to quick save at any time, but for some reason Dark Raid has chosen to go with a checkpoint system that is more reminiscent of 16-bit JRPGs than any shooter youve ever played. You can only save the game at specific save points and you have to manually interact with them to save. In practice this makes the game behave much like a checkpoint based shooter of today where you can only restart from specific points, only with the added frustration of being able to accidentally miss a checkpoint if you didnt notice the save point on the wall. Worse still, even if you dont miss any save points they are still quite far away from each other, which means death results in absurd amounts of replaying sections. On the normal difficulty youre pretty much never going to die in actual combat, but instead most of deaths will come from surprise attacks and environmental hazards that come off as incredibly cheap, which brings the frustration levels to new heights. When youre forced to replay lengthy section of the game due to what feel like very cheap deaths, thats a recipe for a very unpleasant gameplay experience.This frustration is absolutely at its maximum when you come upon one the games platforming sections. FPS platforming is something that has largely disappeared from the genre, and considering that outside of some Valve games it was never enjoyable to begin with, that can only be a good thing. Even many of the best shooters of the late 90s were at their worst during the platforming sequences, and considering Dark Raid is nowhere near as good as those games its not very surprising the platforming sequences are downright horrendous. The jumping and movement controls dont allow for the level of precision these sequences demand and the checkpoint system ensures that you only get one attempt every 10 minutes before having to replay long stretches just to try again. These sequences reach rage inducing, keyboard smashing, scream out loud levels of frustration. If only you could simply try again immediately, but the penalty of having to replay an entire level just to make another attempt results in nothing but misery.If theres one small kindness its that the platforming sequences arent too common and not all of them have instant death as a penalty for missing a jump, but that in no way makes up the ones that do. Outside the platforming the level design is neither great nor terrible. The game consists entirely of interior locations within a space station, and though the technical side of the visuals is decent, artistically the entire game is nothing but industrial looking rooms and hallways that are quite boring. You are mostly just moving through these areas shooting enemies, though occasionally youll have to interact with things in the environment; its pretty standard stuff.In addition to shooting, jumping, and frustration, Dark Raid also has a story, though it mostly comes across as an afterthought. You play as a maintenance robot named Muddy who finds himself the sole robot on the station that doesnt lose his mind after some sort of alien virus infiltrates the systems. He makes contact with human survivors via radio and the plot mostly involves returning the station to operational status and figuring out why Muddy is different, though the twists are extremely predictable and the plot points are nothing more than mission objectives. The story delivery is actually quite obtrusive, often making you stand in place in an empty room listening to radio chatter of very bad voice acting. Hilariously the game tells you the radio has broken halfway through the game and the rest of dialogue is text in absolutely horrid English, obviously some issue recording the lines.Closing Comments:", "date": "June 6, 2014", "grade": 2.0}