{"name": "The Fall", "ref": "https://hardcoregamer.com/?post_type=post&p=86697", "text": "The 21st century is no stranger to the rise of artificial intelligence. While were exploring the uncanny valley with robots that can provide facial expressions, we tend to forget that were actually talking to our phones to find the nearest gas station. Heck, were getting self-driving cars soon, arent we? Thats pretty insane, but its also important because were starting to depend on our computer programs for our own safety: were literally trusting our computers with our lives. That relationship drives the story of the new game The Fall, the first episode of a new series by Over the Moon Games that got funded on Kickstarter last year. With its eerie atmosphere, excellent puzzle design, and constantly intriguing story, The Fall manages to overcome its faults with gusto, providing an indie game with some serious guts to spill.The Fall begins with the crash landing of a lone astronaut. Unconscious and in need of medical assistance, the astronaut is unable to man his spacesuit. Enter ARID, an artificial intelligence program who is able to command the suit and guide the explorer to safety. However, ARID is bound by a set of programmed rules which keep her independence in check. Breaking the rules, like intentionally endangering your human pilot or using deception, will mark an AI as faulty and force formatting (the AI equivalent of death). ARID guides her pilot through an abandoned planet, but learns that the location isnt uninhabited. She encounters other AI, some friendly and some not. Ultimately, ARID must explore the location and find a way to restore her pilot to health. The Fall is the first part in a serial story and it definitely offers a lot to chew on within this first episode. While the journey to save her pilot is the main goal, ARID herself addresses the best part of The Falls story: the depth of AI will. The boundaries by which an AI can act are constantly wavering, as she must sometimes break a rule in order to provide her pilots safety in the long-run. Its an incredibly fascinating concept that not only brings out the best aspects from classic sci-fi like Philip K. Dicks Do Androids Dream of Electric Sheep? or Isaac Asimovs I, Robot, but provides plenty of twists and turns in its own right. By the episodes conclusion, The Fall is sure to leave a lasting impression on you and itll keep you eagerly awaiting the next installment.Though The Fall does share perspectives of games like Super Metroid, it cant really be called a Metroidvania game. The action and platforming are not the prime focus here; instead, most of the gameplay in The Fall stems from puzzle-solving, not unlike those found in classic point-and-click PC games like The Secret of Monkey Island. ARID can collect different items in the world and use them to solve different puzzles to progress. Your flashlight is used with the mouse and it can be used to shine light on items, also showing their descriptions and how to use inventory items with them. In addition to movement with the WASD keys, you can open your inventory with the Shift key and select items with the movement keys. This allows all inventory management to be accomplished with your left hand exclusively and it definitely speeds things up when you need to select an item or action.The puzzle solving is actually quite challenging. Most require some sort of item use with an environmental object, but some of the puzzles can be too obtuse. Some solutions are downright silly or the environmental items required to solve the puzzles arent too visible. The game doesnt provide you with any real hints aside from general descriptions of items, so youre gonna need a ton of brainstorming to figure out these puzzles. That being said, a majority of the puzzles are actually quite well thought-out and interestingly designed, sometimes reaching Rube Goldberg levels of continuous solutions. Completing a puzzle in The Fall is rewarding and you really feel accomplished when you eventually get to progress. In addition to the design, many puzzles aesthetic elements use the environment in interesting ways, which gives every brain teaser a nice spark of imagination too.However, the puzzles arent the only part of the game. While the platforming is rarely ever present, there is some combat. Your flashlight beam can also be swapped out for a laser sight for your pistol, which can also be aimed with the mouse. You can aim easily enough with the mouse, but you can also take cover behind walls and boxes using the E key or (once you unlock it) use camouflage to blend into the background and hide (kind of like in the SNES game Blackthorne). While the suit has a recharging shield and you can heal instantly by successfully using a stealth attack on an enemy, you cant take too much damage at one time. Also, the enemies rarely put up a real fight, offering large windows where you can headshot them easily. The combat isnt too bad, but it can feel clunky, especially when using boxes and walls as cover. Its clear that its not the big focus of the game, which makes sense, since the combat situations are relatively infrequent.Sadly, The Fall does have a number of annoying bugs that can appear. Sometimes, after reloading a save, youll be able to activate a key solution that youve already accomplished, triggering a cutscene. After the cutscene ends, the game freezes. This freezing issue even appeared when I used an elevator to another level I previously visited. Also, sometimes I would begin reading a log entry, but have no way to exit the log screen. Normally, a back or exit selection would appear, but sometimes it wouldnt, which required me to bring up my task manager to exit the game. While the auto-saves kept me from losing progress, these bugs did make the journey more frustrating than necessary. Theyll probably be resolved with a patch down the line, but they were intrusive enough to be worth noting.The graphics, while good, do lack some inspiration. Aside from having a character design eerily similar to the protagonist from The Swapper, the game stays within the greys and dark blues of the setting. Its very dark in The Fall, even when you see some machines blinking with bright greens and yellows. The environments do tend to spice up with imagination near the games end, but right when you really start seeing some creativity, the game reaches a sudden conclusion. However, the game is fully voice acted and quite well actually. ARID herself sticks within the monotone female voice, while other characters express some very interesting speech patterns depending on their roles. Even the most mundane dialogue has a professional air around it; none of the voice acting in The Fall sounds forced or fake, making each dialogue exchange not just entertaining, but also powerful in driving the stellar story. It might have some dryness in the graphics, but the presentation portrays the games thoughtful vibe well, especially during the dialogue.Closing Comments:The Fall is the beginning of an intelligent and engaging sci-fi story, one thatll keep you on the edge of your seat throughout every tricky brain teaser of a puzzle. With an excellent cast, a visceral, thought-provoking story and some great voice acting, the narrative has plenty of drive and itll keep you guessing all the way to its tease of an ending. The puzzles can be frustratingly difficult at times, but their layered solutions and creative use of environmental objects give them a solid amount of depth, allowing lots of reward once a big solution comes together. Even the combat manages to stay relatively exciting through the frustrating moments. The Fall pushes itself when it comes to providing a story worth sticking around for, but its excellent puzzle design and captivating setting is whatll keep you anticipating the next installment. Over the Moon have begun something very special with The Fall and youll be looking out for ARID again even months after you finish this intriguing opening act.", "date": "on May 30, 2014", "grade": 4.0}