{"name": "Genital Jousting", "ref": "https://hardcoregamer.com/?post_type=post&p=286909", "text": "First things first, if you happen to be one of my relatives who stumbled upon this review by Googling by name or such, then my sincerest apologies. Yes, this is an actual game I ended up reviewing and I know that I can never be invited to any family gathering ever again because of this. In fairness, though, they did have a gun to my head. Still, at least some part of me was also morbidly curious as to what a game about sentient penises with their own anuses fighting it out for the right to make love in their own special way was like. And much like good comedy, it is indeed possible to make a game out of virtually anything. So does Genital Jousting actually succeed in creating a game thats actually better than its insanely juvenile premise suggests?WARNING: Screenshots in this review will be NSFW, rather unsurprisingly.At its core, Genital Jousting is a multiplayer party game where players attempt to penetrate each other (with consent, of course). But since its initial release in Early Access last year, developer Free Lives has actually added a single-player story mode to check out as well. It tells the tale of John, a penis attempting to find love as soon as possible and the whole campaign is ratherodd, to say the least. Yes, the story mode in a game set in a world of giant, living peckers is odd, but not in the way youd think.The story here is that of John, a penis who works a nine to five job and needs to find a date ASAP for his high school reunion so that he can show up his former bullies. Throughout all of his attempts, you guide him through various objectives as he begins to have revelations about his life, trying to figure out just how to achieve true happiness and self-worth. Its a story that can indeed be rather funny at times, especially since it almost feels like parody of the types of dramatic narratives a lot of people tend to expect from various indie games. Gameplay-wise, its a bit like Octodad in that you have to wrestle with physics that cause you to flop around and knock things over, but it never ends up being annoying. So why exactly is all of this odd, you may ask, aside from the obvious? Well, typically most single-player modes in multiplayer games such as these exist to provide a solo challenge and to essentially act as a primer for the rest of the game. And Gential Jousting provides neither in its story, surprisingly. If anything, it actually introduces multiple mechanics that arent used in the multiplayer modes and only features mandatory competition approximately once, towards the end. Its just weird that theres a rather huge disconnect between both halves of the game and it just leaves things feeling awkward.Moving back to multiplayer, though, there are three different modes to check out. The first is the traditional game, where three to eight players take their sausages and attempt to stuff them into the others (so to say). When two are joined up, they have to work in tandem to try and make other connections. The more they succeed, the more points they earn, and the longer their member grows for the next round, making maneuvering a bit trickier for everyone. In terms of gameplay and challenge, it works fairly well. Theres also a party mode, which is basically justwell, your standard party mode with random challenges. Collect all the objects, attempt to race to the finish line, be the first team to complete a certain objective, et cetera. Honestly, it isnt bad, but if youve played pretty much any party game, this is familiar territory that seems a wee bit generic. Probably the one mode that does try to match the story slightly is Date Night, which is a co-op experience for two players as they engage in various activities like bowling, rose picking and having Lady and the Tramp-style pasta dinners. Its surprisingly cute and funny, but unfortunately, it appears to be the exact same set of events each time, in the same order, limiting the replay value. Heck, you dont even get the points from it that go towards unlocking various outfits for online multiplayer games, which the others provide.At this point, let just ask one simple thing: Ignoring the concept that these are huge penises that were playing as, is Genital Jousting any fun to play? Well, the basic gameplay of having to deal with unorthodox physics as you try to join up with other players and eventually work in tandem or fight others is neat, yes, and is fun for at least a moment. Butwell, there really is no looking past the penis thing, actually, because thats the entire hook. Its a novelty and one that sadly fades quickly after the first few matches. Heck, looking back on it, the ninety-minute story mode may have been inserted just to avoid this, but despite its best efforts, it doesnt fully succeed. Closing Comments:At its core, Genital Jousting is a decent and competent multiplayer game, but once you get your initial chuckles out of the way when it comes to its premise, it becomes clear that what you see on display isnt really going to rise above decent and competent. The story mode might be entertaining thanks to a few things to experiment with and some funny writing, but in the end you may find difficulty in trying to keep your attention held, unless a bikini on a penis is your idea of a truly hilarious sight. For others, it may be worth a slight glance, but it may not fully satisfy in the end.", "date": "January 18, 2018", "grade": 3.0}