{"name": "Final Fantasy V Pixel Remaster", "ref": "https://hardcoregamer.com/?post_type=post&p=414382", "text": "Final Fantasy V originally came out in 1992, but western fans didnt get to play an officially-localized version until 1999. Longtime Final Fantasy fans were excited to finally be able to play the missing entry from the 16-bit era. There have been several reasons as to why it took so long to come here, some of which included the translation being an issue and their localization focused on Secret of Mana, while others suspected the job system would keep it from being accessible to a western audience. It was different from the two games that bookend it, but despite not having nostalgia to help forgive its dated qualities, Final Fantasy V was generally well received when it did finally make its way west.Final Fantasy V begins with Bartz hanging out with his chocobo companion Boko. Bartz is in the part of the world that enjoys a meteor season, or at least seems that way as there are a lot of meteors crashing lately. Bartz does the sensible thing which is ride his chocobo over to the smoldering hot giant space rock to investigate and finds Lenna and Galuf. Both of them are independently eager to get to the Wind Shrine, and with no more important pressing matters to attend to, Bartz reluctantly joins them on their adventure. Something about some elemental crystals that sounds vaguely familiar, wind stopping and whatnot. Anyhow, this seems to be shaping up to a classic Final Fantasy adventure where the elemental crystals play a major role in potentially world-ending events.As Final Fantasy games build on concepts previously introduced, Final Fantasy V went back to the job system where none of the characters have set classes and its up to the player to assign their role. The idea of constantly switching jobs of each party member was introduced in Final Fantasy III, which Final Fantasy V expanded and improved. Throughout the game different jobs are unlocked, such as Dragoon, Monk, Summoner, Blue Mage and Ninja to name a few. As the characters continue to use a job it levels up and gains additional abilities that can be equipped when using a different job. The Knights skill to wield a weapon with both hands for additional damage could be useful for a Samurai, or the White Magic ability can add healing to a party composed entirely of warrior types. Some jobs, such as the Red Mage, arent all that useful in later stages of the game due to their limited magic use, but are worth leveling up for the valuable Dualcast ability. Compared to its 16-bit Final Fantasy brethren, Final Fantasy V has a small group of playable party members. Bartz could be considered the main protagonist, but he isnt alone for long. Skip ahead to the next paragraph after the screenshot to avoid minor spoilers, but hes quickly joined by Lenna the princess of Tycoon and an older man named Galuf whos suffering from amnesia. Soon after this they are joined by Faris, and these companions will be with Bartz for the majority of the game. On one hand its nice to have a familiar group of characters throughout the story, but meeting new characters and juggling party lineups added to the experience of some of the other Final Fantasies. But while more characters would help on a narrative level, they arent needed on a practical one. Theres minor attribute differences among characters suggesting that certain job assignments may work better with specific characters, but everyone is a blank slate that can be built to the players desire.In addition to the smaller roster, the characters we do get arent as interesting or nuanced as they are in Final Fantasy IV or Final Fantasy VI. We are treated to some character development but they ultimately arent much more than archetypes. They get the job done as far as being interesting enough to keep the player invested, but nothing on par with Cecils character arc or the family conflict with Tellah and Edward. The story of Final Fantasy V is more about the greater conflict with the crystals and less about the details of the characters, and like the characters the overall story is good but mid tier when compared to the other Final Fantasytitles. There are moments that carry emotional weight and interesting plot twists, but again the series has delivered better. Even the name of the main villain, Exdeath, is one of the most uninspired and generic in RPG history. But a mid tier Final Fantasy isnt exactly a bad thing.Final Fantasy V may not be a standout in the franchise when it comes to character development or story, but makes up for this with its fantastic job system. None of the Pixel Remasters are particularly difficult but if someone is looking for a challenge they can make Final Fantasy V challenging by making up bizarre party line ups with unorthodox job choices. Conversely, with a little thought its also not difficult to break the game by strategizing job paths for everyone to create four demigods. The player can ultimately build whatever party they want. Everyone can max up Red Mage and then Dualcast any combination of White, Black, Blue, Time or Summon magic. Or become an army of dual weapon wielding Berserkers. Maybe thievery or other non-magic special abilities tickle your fancy. Whatever the case, the freedom to swap jobs and equip different learned abilities allows for countless imaginable party configurations. Most players would likely balance a sensible party, but the depth for customization is impressive, especially for its time, and it ultimately makes Final Fantasy V extremely fun. The only real criticism is the baseline challenge isnt high enough to necessitate putting too much thought into assembling the team.Chances are anyone reading this is familiar with the Pixel Remaster series and Final Fantasy V is comparable to the others. The graphics are re-imagined versions of the 16-bit original. Characters, monsters and environments look similar to their original incarnations but have higher resolutions and generally are technical improvements. Other effects, like bodies of water and spell animations, look like theyd be too much for the original 16-bit hardware. This remaster is trying to bring the 29-year-old game into modern hardware while maintaining the original aesthetic which it succeeds. Like the other Pixel Remasters, most of the attention prior to release has been on the graphics, but the remixed music is the highlight. Even going back to the 8-bit games it was always apparent that Final Fantasy soundtracks are filled with great compositions and the improved MIDI brings the music to life. One of the more recognizable tracks is Battle at the Big Bridge, or Gilgameshs theme as it maybe be more commonly known, which is re-imagined with distorted electric guitars and prominent trumpets. Not sure if ska metal or mariachi metal is a more appropriate description, but whatever the adjective it sounds fantastic. Home, Sweet Home was one of the more soulful pieces in the original soundtrack and the new version seems like it would be impossible not to feel anything while hearing it. As with the other four games, a bestiary is included along with an art gallery of Amanos sketches and a music player to enjoy the soundtrack. Also, its worth noting that Pixel Remasters are based on the original games so additional content that was introduced in later releases, such as on Game Boy Advance, are not present in this version. Closing Comments:Final Fantasy V is one of the more overlooked titles in the franchise, but skipping this title would be a mistake. Its story may not reach some of the highs as other entries in the franchise, but its still compelling enough to keep players interested. While it might not have the best Final Fantasy story, however, it has one of the best job systems. Theres grinding involved to get some of the exceptional abilities, but the freedom to customize a party however the player wants offers many opportunities for creative party configurations and encourages multiple playthroughs. Final Fantasy V Pixel Remaster updates a great classic JRPG in a way that respects the original 16-bit title, bringing enough changes to make it feel updated but keeping it familiar enough to appeal to long-time fans.", "date": "November 12, 2021", "grade": 4.0}