{"name": "Monster Monpiece", "ref": "https://hardcoregamer.com/?post_type=post&p=86322", "text": "Monster Monpiece is going to be known and subsequently remembered as the game that makes players stroke their Vita up and down vigorously so that it appears as if they are masturbating. Yep, that actually happens. Its a shame, then, that beneath that horrid gimmick, and the heavy emphasis on gratuitous amounts of fan-service, exists a really solid card game. Because of this, the question becomes: are the mechanics at play strong enough to make players look past all of the incredibly bizarre, very-Japanese conventions?Monster Monpieces tale is one that is devoid of anything overtly offensive, despite those alluded to gameplay trappings; its your typical good-vs-evil narrative, but one that is delivered in a coherent, and at times even compelling, way. This has a lot to do with the fairly decent localization, which seems to know how to balance humor and gravity well, but its also thanks in part to an interesting cast of characters. Essentially the story in Monpiece is as such: a race of monster girls is living side-by-side humans in a world known as Yafanir. These gals derive meaning from their name simply by the fact that they can harness allied monsters powers in the form of cards. The ladies at the forefront of our story are four darlings, Mei, Fia, Elsa and Karen, whom of which are studying to become elite monster girl masters. Unfortunately, it would seem that fate is a cruel mistress, and our heroines plans derail after Elsa becomes cursed by a mysterious affliction, leaving Mei in charge of finding a way to save her friend. From there, our lass is taken on a rollercoaster ride of ups and downs, and plenty of card-battles in-between. See, Mei doesnt settle scores with fisticuffs; no, she takes to resolving conflict through different means  opening packs of playing cards, organizing them into strategic decks and then throwing down in a digital tabletop battle-off, the kind of which would make even the most devout Magic: The Gathering player sit up and take notice. So, as one can see, the game doesnt take itself too seriously. However, thats its appeal  the story feels whimsical and lighthearted, though not entirely lacking any kind of big emotional crescendo, and plays to these narrative devices with sharp writing and a healthy dose of wit. In fact, the story is so innocently delivered, that the juxtaposition of it and the exorbitant fan-service, makes the whole thing perplexingly charming. And weird. Mostly weird.Nevertheless, Monster Monpiece is a game that clearly isnt about its story. Its the gameplay that remains its prime focus at nearly all times. In that regard, the game truly is delightful. For starters, players navigate a world map to find their opponents. Once they have arrived at the intended destination, theres a bit of flavor dialogue, and then a fight breaks out. This is ultimately where the core of Monpieces experience resides. To this end, MM is setup like a traditional card game. Players build decks out of cards obtained, highlighting certain cards around which to build said deck, and then test out their creations in combat. Where the formula strays from tradition, however, is in how these cards are actually played. They arent merely plopped down as they would be in something like Yu-Gi-Oh! No, players have to take their strategy to the next level by summoning cards into tactical positions on a 3-by-7 map. Once they are placed, the monster girls transform into the specific card/power/attack and march across the playfield toward their enemy with the objective being to reduce their opponents base points. Its a simple system, really, but one that grows exponentially deeper with time and with learning how to play cards off of each other to dish out serious hurt. Like any quality TCG, the real enjoyment in Monster Monpiece is found in reading and knowing cards abilities so as to put together a behemoth of an arsenal. Card diversity fortunately is in full effect here, with Compile Hearts giving players a plethora of options and ways to dispatch foes. For instance, there are eight monster types, each of which can be fused with another to improve combat prowess. Take this into consideration along with the fact that each card individually has strengths, weaknesses, skills of their own and ideal situations in which they can be played, and suddenly a seemingly shallow experience has expanded in a big way. Theres also auras that need to be factored in to each situation, as a monster, that possesses the same colored aura as their summoning monster girl, can take advantage of special bonuses. And truthfully, this is just a small buckshot of the types of combinations and customization options available to the player; digging in and really exploring what there is to offer opens up so many more doors than we could possibly cover in this single review.Thankfully, with all of these ways to take out enemies, the AI is no push-over. While computer-rivals will always pale in comparison to human opponents, in Monster Monpiece they do well enough holding their own, so as to keep folks on their toes. We did notice a few times when they would perform some kind of silly, or illogical move, but generally speaking they offered up some memorable scenarios. Fortunately there is an online multiplayer component to boot, so when players are tired of whooping up on the CPU, they can test their mettle against real people. From our few sessions, battles online ran smoothly and were easy to setup. Trying out new decks against other players decks is always an exciting part of the trading card game; hence, its nice to see that same type of enjoyment preserved here in Monster Monpiece.Thus far, we have spoken highly of Compile Hearts card battler But thats because we havent gotten to the crux of what will probably be every critics one glaring problem  the gimmick of rubbing cards to enhance their abilities. On the surface, it all sounds innocent enough; rub certain cards by way of touching the Vita in a rubbing motion, and cards essentially level up. If it were left at just that, then we wouldnt have any issue with it. Sadly, though, the developers seem to be having a little fun at the players expense by forcing them into using this embarrassing system to derive the full experience. Lets break it down further, though, so that everyone is well aware of what were talking about, and also what theyre getting themselves into here.Firstly, Monster Monpiece is a fan-service game. By that I mean, some (read: most, if not all) of the cards are represented by scantily clad monsters, who just so happen to be girls. These gals are in such skimpy clothing, and at times drawn in compromising, seductive positions, that roughly 40 cards have been censored from the game for the North American and European releases. Now, Im not here to debate whether we should or shouldnt have censorship in games  thats an argument that each gamer, on their own, must figure out where they stand  but, given the fact that much of the game is centered around young girls in erotic poses with very little clothing on, means that for some, Monster Monpiece will undoubtedly feel, well, creepy. The very distinct cultural differences between Japan and the US on this matter are on full display here; so figuring out if youre okay with this style will be an important part of the purchasing process. That being said, whether this is your thing or not, one cannot deny that the art itself is spectacular. In fact, MM has pulled together some of the most renown Japanese artists in the biz, and as a result, is home to some fantastic card art throughout. Okay, you made it past the art  youre okay with that. Onto part two: in order to level up cards in the game, they must be stroked. This is done by turning the Vita vertically, touching the front and back of it at the same time, and then stroking up and down rapidly. As one might be able to picture in their minds eye, such movement strikingly resembles the act of  yep, you guessed it  masturbation. Alright, so, yeah, there you have it; youre stroking your Vita as if said Vita is an appendage on a males body, while the image of a barely clothed girl is on-screen. Fair enough. Take from that what you will.The problem with this, isnt necessarily the fact that performing such an action looks like some kind of self-pleasuring activity, but its the fact that such a controversial design decision/obscure way to play the game is forced upon the player and mandated for play. So, if you are in the slightest bit uncomfortable with jerking your Vita around others, or if youre just generally not okay with looking like youre committing an act of public indecency, it means that Monster Monpiece  a game on a mobile system, ideally meant for on-the-go situations and traveling, which usually occurs in a public place and/or around other human beings  cannot be completely or fully enjoyed. Ultimately, making this feature non-optional feels like a massively short-sighted, obtuse and misguided decision that could have been easily dealt with by the inclusion of a simple on-off toggle in the settings menu. If nothing else, as a developer, forcing players down this route both limits your audience and limits how someone can play and subsequently enjoy the game; and any feature put into place, knowing full well that the aforementioned result is likely, is a shining example of bad game design philosophy. Period. Of course, this can be rebuked seeing as Monpiece was designed with a very specific demographic in mind; but it still calls into question why the devs just didnt play it safe, and not strong-arm players into using the feature.Closing Comments:", "date": "May 27, 2014", "grade": 3.5}