{"name": "Into the Dark: Ultimate Trash Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=86228", "text": "Theres certainly something perverse about a piece of media that is so bad, its good. From film like the live-action Super Mario Brothers movie to any song composed by Vanilla Ice, seeing something so unquestionably bad actually has a sense of spectacle. Games are no stranger to this. Weve seen video games that fall under the so bad, theyre good umbrella. Well, good might be the wrong term; perhaps enjoyable. Theres a way to get fun out of a badly designed game. Goat Simulator taught us that earlier this year. Into the Dark: Ultimate Trash Edition wants to be the next so bad, its good game. Its a self-proclaimed parody of schlocky B-movies and mindless first-person shooters, all mixed with intentionally unrepaired bugs and promised game crashes. Into the Dark: Ultimate Trash Edition is proudly marketed as a so bad, its good game.It only gets half of that phrase right. Guess which half.Into the Dark: Ultimate Trash Edition follows ex-soldier and current private eye Peter OBrannon. Peter is employed by the GlobalSecure Inc. company to find some information that the higher-ups would be stupid and/or suicidal to look for. Its up to Peter to find this information and stop whatever bizarre and unsightly horrors lie in wait. Theres really no story to speak of, or at the very least, worthwhile to say. Most of the games narrative is briefly referenced in the communication dialogue between Peter and his superior Samantha, but the game builds most of its initial charm from its humor. The game prides itself on its B-movie influences, from schlocky zombie flicks to dumb sexual jokes that wouldve made more sense twenty years ago. While that kind of self-aware humor does have the potential to be hilarious, most of the humor in Into the Dark is obnoxiously predictable. Zombie hookers arent anything too revolutionary, nor are the ideas of disembodied hands that attack you. While there are a few brief laughs in Into the Dark, the games humor rarely feels honed and frequently falls flat.Into the Dark is your typical first-person shooter, straight ahead. You can equip different weapons to attack enemies and you find a steady variety of monsters to take out. Mutants, possessed soldiers, and the aforementioned zombie hookers are all up for bullets in their head. But Into the Darks controls are finicky and imprecise. The shooting is constantly off-center, making it very hard to know where youre aiming at, and the down-the-sights aiming mode doesnt do anything to fix that. Even targeting an environmental item demands an unnecessarily high amount of finicky precision, even if the movement controls themselves are decent enough. Oh, and you cant remap the controls within the game. Theres no options menu to speak of. To change the control mapping (and you will want to, because using the Enter key as your use command instead of E or F is just ridiculous), you need to access the games INI file and change them there. Lovely.Now that weve got that bit of dysfunction out of the way, lets get to the meat of it all: this is an unfinished game. Its in disrepair. The most immediately apparent problem is how the game looks: its downright abysmal. I understand that the developers are trying to make the games appearance match the intentionally bad B-movie philosophy, but this is not okay at all. It looks like a game that would be released in the late 90s as a beta. The textures are so muddy and poorly rendered, and there are number of graphical glitches like floating environmental objects or enemies not moving even when youre right in their face. The game over screen looks like a five-year-olds fingerpaint project. The audio has similar issues, being constantly muffled and difficult to hear, while some sound effects appear out of nowhere with no nearby object producing them. Its just sickening to experience.And the game itself is no better: its bugged beyond belief. Firstly, despite wanting to capture gameplay footage of this game to make a video, the game doesnt run anywhere near properly with the capture software (or any program, for that matter) running alongside it (the developer even needed to note on the games Steam store page to close all other programs while running the game). But even in isolated and completely accommodational conditions, the game would frequently crash during the absurdly long load times. Theres no way to pick up a save right after you left off either; if you die, its back to the main menu to wait through a one and half minute long load screen (I timed it) before getting back into the game. I would routinely find enemies respawning directly behind me out of thin air, key items wouldnt appear until a mission prompt was shown ten seconds after I triggered the previous missions completion, and I would even find myself in near-death states, but unable to move or die, forcing a reloaded save from a red-screened limbo. Sometimes Id experience a bug that wouldnt let me shoot my gun or switch my weapon, all while zombie hookers swarmed me.But if you are actually able to play the game, its still nothing to write home about. Its a linear shooter with brain-dead AI, uninventive missions (though the multiple side missions arent too bad), and no sense of precision in its action-based design. The most fun I had with Into the Dark: Ultimate Trash Edition was watching scenes from the horror classic Night of the Living Dead, which thanks to becoming part of the public domain, can be watched in its entirety in a bonus theater level of the game. And thats really all you get from Into the Dark: Ultimate Trash Edition thats worthwhile. The only part of this game that is in any way finished is a randomly included film from 1968 that has nothing to do with the game its in.Closing Comments:I understand that the developers of Into the Dark: Ultimate Trash Edition are trying to make an ironically enjoyable game from an intentionally bad game, and trust me, that idea isnt something impossible to achieve. Weve seen games like Surgeon Simulator, games with near-broken controls and near unplayable design, still find ways to provide a ton of joy for players. Into the Dark is nothing like that. Its just bad, and no amount of so good its bad talk is going to distract anyone from its clear state of disrepair. From the rampant glitches to the terrible presentation to the uninteresting levels to the broken controls to the shameless pride that the game is garbage, Into the Dark: Ultimate Trash Edition is such a despicably unfinished project that youd have to be one step from snapping to spend ten bucks on it. Its probably one of the most unenjoyable pieces of software that Ive ever had the displeasure of running on my PC, though considering how much the game crashed, that statements only half true.Into the Dark: Ultimate Trash Edition is not so bad, its good. Its just bad. Very, very bad.", "date": "on May 26, 2014", "grade": 1.0}