{"name": "BattleBlock Theater (PC)", "ref": "https://hardcoregamer.com/?post_type=post&p=84810", "text": "With a history of flash animation/game website Newgrounds.com in their resume, it would make sense that site owner Tom Fulp and artist Dan Paladin would eventually dive into the industry that their childhood loved so much. Teaming up with co-worker John Baez, the two tore the internet a new one and delivered a stylish new take on independently produced video games. After two indie hits in side-scrolling shooter Alien Hominid and co-op brawler Castle Crashers, The Behemoth pushed themselves even further with their third game, BattleBlock Theater. With a heavy emphasis on multiplayer and all the Newgrounds-style humor theyve shown for over a decade, The Behemoths third round hit Xbox Live Arcade last year. Now the gladiatorial obstacle course has hit Steam, and boy, is it a ride.BattleBlock Theater follows the trials and tribulations of Hatty Hattington and all the people who love him. A happy and well-liked guy, Hatty brings his supporters on a boat ride (with you playing as one of the supporters), only to get caught in a storm and shipwrecked on a mysterious island. Turns out the island is run by bizarre cat people who use their central theater as a gladiatorial arena to entertain themselves. You and your companions are imprisoned by the cats and forced to participate in the deadly games for their amusement. Hatty, however, is given a strange top hat and named the leader of the theater. After putting on the hat, Hatty runs the games, though its not certain that Hattys role is completely of his own choice. Its up to the player to blast through each of the games and save Hatty and the other shipwrecked prisoners, all while uncovering the secrets behind the cats and their theater. BattleBlock Theater manages to balance the goofy humor that The Behemoth has used back on Newgrounds with a rather sophisticated narrative. Hatty himself, despite being rather underdeveloped early on, contributes a lot to the games vibe. Youll want to know more, so youll be compelled to tackle whatever comes your way in the theater games.As a prisoner to BattleBlock Theater, you must conquer a series of treacherous obstacle courses, all while collecting loot. Each stage takes place in the typical 2D side-scroller view, with many similarities to classic puzzle-platformers like A Boy and His Blob. Each of the basic actions like running, jumping, double-jumping, attacking and using special items work great. Theyre smooth, even when using environmental items like pipes, conveyor belts, and exploding platforms, and though the collision detection can become a problem at times (especially when cat enemies decide to gang up on you), navigating each death trap of a level rarely becomes an issue.Each level sports a number of gems to collect. In order to make the exit portal active, you must collect three gems; only then can you complete the level. But thats just the bare minimum: each level generally has several more gems to find, as much as seven, along with a hidden yarn ball (which is used as currency to bribe guards for improved weapons). In order to get the coveted A+ ranking, you need to find all of the gems in a level, in addition to the yarn ball (which is hidden much better than the gems). Even more demanding is that you must do this quickly: a final time attack award is required to get that A+ ranking. Fortunately, the A+ rankings are not required to progress in the game, but with extra gem rewards for getting one along with the bragging rights, its tough to shy away and settle for the bare minimum grade.And getting the gems isnt easy. In fact, BattleBlock Theater is a really tricky game. Levels are designed with multiple death traps, from spikes to water to vicious raccoon creatures. There are so many ways to die in BattleBlock Theater, and to make matters tougher, many levels use some Rube Goldberg-esque puzzles, racking your brain as well as your reflexes. But the puzzles are incredibly fluid and demonstrate lots of creativity in how to complete them. Using portals, elevators, and catapults, while avoiding lasers and feline guards can become frantic, but theres a powerful synergy with BattleBlock Theater: nothing in the levels feels wasted. Every little piece has a purpose. This makes completing the puzzles involving; youll keep going to find every gem not by obligation, but by your own accord. BattleBlock Theater demonstrates puzzle and platformer design in pitch-perfect equilibrium, making every stage an exciting one.And thats just the main story. In addition to a great single-player Adventure mode, BattleBlock Theater has an enormous buffet of treats for multiplayer as well. The multiplayer Adventure campaign (which can be played with two players cooperatively, online or local) follows the story as well, but each stage is retooled for multiple players, marking a tight cooperative element. Keeping track of you and your teammates is very simple, and with the accommodating level design, the multiplayer never feels tacked-on. It truly does feel like another full game to complete. Similarly, the arena challenges offer some platformer-style twists on classic multiplayer games like King of the Hill or even basketball. Adopting the same party vibe as Super Smash Bros., BattleBlock Theaters arena mode is a frantic and exciting multiplayer offering perfect for competitive gamers. To top all this off is a level editor (which is surprisingly easy to use) and the ability to share your levels and challenges online through the community portal. If your design is good enough, you can even get it featured and promoted by The Behemoth themselves. There have been a ton of well-crafted levels submitted even before the game is released to the masses on Steam. The amount of content in BattleBlock Theater is absolutely enormous, but even more impressive is how all of this content has appeal, regardless of your preference. If you cant find any mode in BattleBlock Theater to like, then you simply are being far, far too picky.The transition from Xbox Live Arcade to Steam has been rather uneventful for BattleBlock Theater, but that doesnt mean that the game doesnt perform well on PC. The slick, Newgrounds-style flash cartoon aesthetic looks great on an HD monitor, and though there were brief moments of framerate dipping and some rather awkward problems with collision detection on certain level objects, the PC version is just as clean and stylish as its XBLA brother. As far as gameplay changes go, the Steam version doesnt offer too much aside from the ability to quick-swap your weapons. Its a welcome addition, despite its lack of substantiality. The Steam version also brings Steam Workshop support to the table, and in a game with so much customizability in levels and designs, be on the lookout for a ton of fresh ideas from the BattleBlock community. While the Steam version doesnt make too many changes to the formula, its still a strong port, one that can easily stand toe-to-toe with the XBLA version.All of this content is topped off by a fantastic presentation. The graphics are beautiful, perfectly evolving the trademark Newgrounds-y style that The Behemoth have shown as far back as Alien Hominid. Bold outlines and excellent animation are complemented by a superbly diverse color palette. Cutscenes are hilariously presented in a popsicle-stick puppet form, with characters, locations, and items dancing around like Monty Python on a sugar high. Though its not a huge step up from the studios previous game Castle Crashers, BattleBlock Theater doesnt make any missteps in providing a captivatingly charming style.But the star of the show in the presentation is the audio. Hands-down, Stamper is one of the best narrator/commentators ever seen in the video game. I havent laughed this much at in-game commentary since Madworld on Wii. His manic/quirky/whimsical speaking style complements the games aesthetic without any loss in character. With such phenomenal writing like doo-doo casserole with a side of butt salad, youll die on purpose simply to hear what wacky one-liners Stamper says next. The music is a steady evolution of 16-bit wonder, with upbeat tracks and enthusiastic themes. The theme that plays in the finale levels mixes heavy beats with meowing cats and vocals from Stamper, though his performance in the theme that plays when you find a secret area is downright phenomenal. The combination of visual and aural style in BattleBlock Theater turns a great game into an awesome game, and even though the gameplay is still superb, the presentation is what youll remember long after youre done.Closing Comments:The amount of content, style and polish in BattleBlock Theater is incredible and puts the efforts of many AAA developers to shame. The story and writing alone could fill a comedy club, but the accessible, addictive gameplay demonstrates a mastery of platformer fundamentals. The levels dont push any polygons nor do they break the mold of how the genre should be played, but when it comes to tight design and constant creativity, The Behemoth have cracked that code wide open. For $15 US, you will get one of the most comprehensive indie titles ever released, one that will keep you engaged during the tough stages and laughing during every second of downtime. BattleBlock Theater doesnt do anything particularly new, but thats perfectly okay, because everything it does do it does without a hitch to speak of.", "date": "on May 14, 2014", "grade": 4.5}