{"name": "Borderlands 2 (PS Vita)", "ref": "https://hardcoregamer.com/?post_type=post&p=84860", "text": "The PS Vita has long been waiting for its third-party saving grace. Call of Duty: Black Ops Declassified and Assassins Creed III: Liberation sold well on the platform and helped move hardware, but neither Activision nor Ubisoft released games on PS Vita in 2013. Plus the quality of both games ranged from OK to downright abysmal. Now comes Borderlands 2 hoping to prove that not only can third-party games sell well on the platform, but that full console games can be ported onto the handheld. Is Borderlands 2 what PS Vita owners have been waiting for, or is this the nail in the coffin for third-party support? Borderlands 2 takes place five years after the events of Borderlands. Handsome Jack and his Hyperion Corporation have taken over Pandora and are searching for a mysterious Vault. To keep competition away, Jack has all Vault Hunters killed as they arrive on Pandora. Enter Axton, Zer0, Maya, Salvador, Gaige and Krieg, the new Vault Hunters who Handsome Jack attempts to kill. However, the attempt fails and the Vault Hunters survive. Teaming up with the original Vault Hunters, our new heroes seek to liberate Pandora from Handsome Jacks handsome hands.This is the same exact story as the original 2012 release. Iron Galaxy Studios hasnt added any new content to the plot, which is a shame as both Krieg and Gaige are now playable characters from the start. It would have been nice to see them included in the main story in some fashion. PS Vita owners also get Captain Scarlett and Her Pirates Booty, Mr. Torgues Campaign of Carnage, Ultimate Vault Hunter Upgrade Pack 1 and the Collectors Edition Pack. The included DLC is available from the start of the game and adds some serious bang for your buck.The story isnt anything spectacular, nor are the six playable characters. The twists and turns the plot makes are predictable, and the main characters are mostly silent. Its the humor and secondary characters that make playing through the story and DLC worth it. Writer Anthony Burch injects a sense of humor into the cruel world of Pandora and its inhabitants that make playing through the plot enjoyable. The secondary characters are hilarious and are imbued with interesting personalities. Youll continually wish that you were playing as one of them instead of the boring Vault Hunters. When you think about it, Borderlands 2 is a perfect fit for the PS Vita. We didnt know it back in 2012, but after playing the game on PS Vita its easy to see why. The games design is a natural fit for the pick-up-and-play style of a handheld. Being able to pick up the PS Vita, finish a mission and then put it back down helps negate a criticism that has plagued the franchise; repetition. The mission structure and back-tracking made playing for hours on PS3, Xbox 360 and PC feel very repetitive. This is not a problem on PS Vita.This is 90% of the full Borderlands 2 experience. Almost everything that made the console and PC versions so great is here. The entire world map? Yes, its on PS Vita. Billions of different guns? Oh yeah. The entire campaign and side missions? Yes, youre getting hours upon hours of content. Iron Galaxy Studios should be applauded for bringing so much of the Borderlands 2 experience to PS Vita. DLC like Tiny Tinas Assault on Dragons Keep and Sir Hammerlocks Big Game Hunt are not included, a disappointment seeing as there is a Game of the Year Edition on PS3, Xbox 360 and PC that does include all the DLC for $40, thus making that a much better deal.There is one feature that has been diminished on the PS Vita. Four-player Co-Op did not make the cut. Only two-players maximum can partake in Co-Op action. Seeing as Borderlands made its name on four-player Co-Op this is a big disappointment. What we do have is still good. Two-player Co-Op is a fun and engaging way to play through the game, and you can still partake in epic duels with one another. What we get is serviceable, but its still disappointing we didnt get the whole thing. With the PS Vita there are obviously going to be some concessions as the Vita is simply not as powerful as a PS3, Xbox 360 or PC. This is where things start to go awry. As much fun as you can have with Borderlands 2 on PS Vita, you have to be ready to accept that this version does have some problems.Iron Galaxy Studios actually did a good job with the controls considering the fact that the PS Vita is missing R2, L2, R3 and L3 buttons. Throwing grenades has been mapped to the bottom right part of the screen, and activating the characters skill is on the bottom left. This works really well and I never had an issue using the touch screen. Its the back touchpad thats the real issue. Tapping on the left portion activates sprint, the right activates melee. The problem is that it isnt that responsive and can require multiple taps. It is possible to re-map the control scheme, but theres no option to turn up the sensitivity of the touchpad. This will always be a problem no matter what action you map to the touchpad. Its also hard to ignore many of the games technical issues that deeply affect the gameplay. The framerate aims for 30fps, but rarely ever reaches it. It isnt bad when running through the world, fighting a few enemies. However, when the enemy count starts increasing, the bullets begin flying and explosions litter the landscape then youre looking at severe framerate drops. This is evidenced in Sanctuary where there are multiple NPCs walking around. The framerate drops are so severe that its like watching a slideshow.We should probably discuss some of the bugs in the game. Over the weekend we reported finding bugs that caused the game to freeze and crash. Those issues are still in the game, and though it is possible to avoid them it doesnt mean that every player wont encounter these issues. Simply put, there are problems with the game and they cant be ignored.Borderlands 2 also suffers from lag, both input and audio. Interacting with the ECHO communicator and navigating its many tabs can be a tedious experience as you press Select multiple times to bring it up, or L and R to shift tabs. Audio tends to lag behind the characters lip movements. Sometimes it just cuts out altogether. Visuals have obviously been heavily toned down to fit onto the platform, but Borderlands has always been about the art style rather than achieving graphical prowess. With this in mind, Borderlands 2 on the PS Vita looks good, but not great. Theres a good amount of detail in the environment and character models, gun models in particular look amazing. Colors arent as bright or vibrant and details have been toned down. This isnt a Killzone: Mercenary or Uncharted: Golden Abyss, but it also isnt a Call of Duty: Black Ops Declassified.Much like with the gameplay, the visuals have their own issues. Texture pop-in is frequent and jarring. It takes a long time for a blurry, indistinguishable model to become a box, locker, rock or any other object. Its a common problem with the Unreal Engine 3, but its far too noticeable here. Closing Comments:Borderlands 2 on PS Vita is probably the most polarizing game Ive ever played. On one hand, the mission structure is perfect for a handheld, controls are responsive (aside from the touchpad) and it looks good despite the handhelds limitations. On the other hand, the amount of bugs and problems that come with it indicate that it just wasnt ready for release and could have used some extra time in development. Borderlands 2 is serious fun, but has serious problems.", "date": "May 13, 2014", "grade": 3.0}