{"name": "Umineko When They Cry  Answer Arcs", "ref": "https://hardcoregamer.com/?post_type=post&p=285685", "text": "Umineko When They Cry is one of those visual novels with a tremendous worldwide fanbase despite only recently receiving an official English translation. In 2016, MangaGamer released the first four chapters of the game, which are also known as the Question Arcs and got even more people into its tale of murder, mystery and the battle of wits between humans and witches. Anyone who has played Higurashi When They Cry should already be aware of what this segmenting between Question Arcs and Answer Arcs means. Basically, both episodic visual novels present a tremendous amount of mysteries without any clear cut answer, allowing players to play detective and try to piece clues together on their own and via the community. Once the Answer Arcs start get rolling, the reveals peel away the layers of mystery bit by bit. Discovering whether your theories are proved right  or even wrong  prove to be a blast. Of course, its also just plain exciting to see the story that the author intended playing out in bombastic fashion. Although spoilers will be kept to an absolute minimum in this review, it will touch a critical event from the Question Arcs. Therefore, do not read through this review if you have not yet 100% completed the first four chapters. As should also be obvious, one simply cannot play and fully enjoy Umineko When They Cry  Answer Arcs without first having beaten the Question Arcs. It may have been a year since the release of Umineko When They Cry  Question Arcs, but the Answer Arcs spends no time trying to get players reacquainted with the storyline. All that really needs to be remembered is the climax of chapter four. This was the moment of Battler and Beatrices pivotal showdown. There was a ton of spectacle, and in the end, it was left up in the air as to whether the Golden Witch could truly have met her demise. After so many deaths and revivals, it was impossible to predict where the story would go from here. The very beginning of the Answer Arcs shows the somber reality of the situation. While Beatrice appears physically alive, she has lost the venom and spark that made her a formidable adversary. She simply sits, silent and downcast, as if she is nothing more than a human-sized doll. How can the next game possibly proceed without Beatos piercing laughter and witchly talents right from the get go? Two other witches step up to take a shot at Battler  Bernkastel and Lamdadelta. While these two played a role in previous segments, theyre really given a chance to shine here in their own eccentric ways. Of course, this is just the very start. Tons of other characters, both familiar and new, make appearances and become key in the ever-evolving storyline. Witches, demons and humans all clash spectacularly on the island of Rokkenjima. Despite being classified as the Answer Arcs, readers are still treated to yet more mysteries and replays of the pivotal Ushiromiya family conference of 1986. The family is still possessed with the desire to solve the mysterious epitaph which would grant them immeasurable wealth. People are still killed each night in horrible ways as sacrifices. The interplay between greed and sorrow continues in page-turning fashion. Anyone who loved Umineko When They Cry  Question Arcs will find themselves head over heels with these next four chapters. Everything comes together in tremendously exciting, and often unexpected ways. As with the previous release from MangaGamer, Umineko When They Cry  Answer Arcs features both the improved sprites as well as the originals, with the newer art set to default. The default art looks great and professional, though theres still something charming about the original artwork despite its silliness. The PC release also has no voice acting. There is work underway to port the PS3 voice acting and graphics over to PC, but that is purely a fan effort which is still in development. Worldwide fans may be pleased to know the game also includes both English and Japanese text.Theres little to complain about with regards to the game itself. The only issues really pertain to the engine on which the game is built. It is incredibly lacking in features which are now commonplace for visual novels. For example, auto text has no speed selector and is slow at that. Even if this is a big deal to you, its something to simply deal with because the story is so good it makes up for the inconveniences of the engine. Although there are few typos, they are few and far between and are already mostly patched out of the script. The small amount of them is impressive given the massive amount of text in this title.Closing Comments:Grab a comfy chair, snacks and maybe even some tissues to prepare for playing Umineko When They Cry  Answer Arcs. Youll be in for the long haul as the story twists and turns for at least fifty hours. While there were some slower story segments in the Question Arcs, theres none of that here. Every event feels completely Earth-shattering and reveals prove utterly satisfying. Any visual novel fan out there who has not yet read Umineko When They Cry needs to rectify this immediately.", "date": "January 7, 2018", "grade": 4.5}