{"name": "Chronology", "ref": "https://hardcoregamer.com/?post_type=post&p=83910", "text": "Oh, what to do? What to do?Reviewing Chronology is an incredibly perplexing task. osao Games time-bending puzzle-platformer is genuinely enjoyable for the most part. It had a charming world, laugh-out-loud moments, and likable characters. The challenge in writing a review for it comes from its significant bugs, as well as significant lack of the very aspects that make the game shine in the first place. It was a difficult thing to experience; every two steps Chronology took forward was met a step back, or so the cliche goes.Chronology takes place in part-fantasy, part-Steampunk world during a mechanically-induced apocalypse. Players take the role of the Inventor, who wakes up in a daze after the world ends. Armed only with a time-travel device, he sets off to figure out what happened to his world. Along the way, the Inventor meets Snail, who iswell, a snail, and realizes that he has to change the events of the past to fix the future. Dont you fret, time-travel continuity sticklers, there are no illogical paradoxes at play in Chronology.As a whole, Chronologys story is quite charming, though predictable. One can figure out how the story is going to end during the third or fourth of its eight chapters. Every character sounds as if he or she was voiced by a Silly Voice Soundboard, and I mean that in the best way possible. The holier-than-thou tone of the Inventor contrasts brilliantly with the overly innocent, child-like demeanor of Snail. Some characters make bizarre gurgling noises instead of speaking, while others spout out sentences filled with puberty-esque voice cracks. Though Snails tone makes Chronology sound like a childs game, the dark undertones and snappy Inventor comments allow it to reach audiences of all ages. My favorite line came during an early chapter, when Snail asked, That scrap pile is your wagon? The Inventor simply replied, Shut up, Snail. Chronologys adorable humor will bring a smile to anyones face, as it is one of the goofier indie offerings of 2014.There are a ton of 2D time-manipulation games floating around, notably Braid, Full Bore, and May 14ths Super Time Force.While the idea of a puzzle-platformer centered around altering time might lead you to believe that Chronology is simply a clone, I can assure you that its gameplay is unique enough to stand on its own. Whereas Braid allows players to rewind moments, Chronology employs two entirely different methods of time-shifting. The Inventors time-travel device allows him to shift back and forth between the pre-apocalyptic and post-apocalyptic worlds, meaning that nearly every puzzle in the game involves some sort of before-and-after situation. Manipulating the events of the past directly affects those of the future; for instance, destroying a pre-apocalyptic structure may cause its post-apocalyptic remains to decay in a way that allows for safe passage. This mechanic fits in perfectly with the overarching narrative, making the game feel incredibly logical and unified. Snail, on the other hand, possesses the ability to pause time, making daunting, impossible tasks relatively simple. Perhaps a spinning blade is blocking the duos path; simply pause the timeline at the right moment, and youll be able to stroll on by. Every puzzle uses some combination of Snail and the Inventor, with the two characters controlled one at a time. Chronology is not a game that simply has a story tacked on for the sake of entertainment; its mechanics and narrative could not exist properly without each other.Chronologys puzzle design varies from bland to brilliant. To give you an idea of how playtime can vary based on puzzle-solving ability, I played through the game twice. My first playthrough lasted nearly three hours, as I struggled to come up with answers to the more challenging puzzles due to my severe lack of skill in this area. My second lasted just under one hour, so those of you that are especially crafty will find themselves finishing the game in roughly the same amount of time. Some puzzles require you, unfortunately, to move a set of crates in order to progress. Others might have you using Snails powers to pause time while the Inventor steps on a switch to open a gate, allowing the Inventor to progress without the gate slamming in his face. Things got slightly more interesting when a mid-air time shift was required in order to land on a previously unseen platform. These time-warping platforming moments were extremely unique, feeling much different than anything other recent platformers have to offer.Unfortunately, the number of time-shifting platforming sequences can be counted on one hand. In fact, Chronologys biggest disappointment is its inability to expand on its most brilliant moments. In certain levels, there will be large puzzles requiring multiple shifts, creative thinking, and persistence. At one point, the player has to buy a ticket from a preoccupied booth attendant. Figuring out a way to use both the environment and the two timelines to charm her is the key to getting her to vanquish said ticket. This adorable task requires a great deal of thought and experimentation, as the answer is not initially evident. Unfortunately, there are only a handful of these major brain-teasers; these giant, creative puzzles are the highlight of the game, and it is painful that there arent more of them. The developers had some incredible ideas, but they are overshadowed by the more menial tasks scattered throughout each level. The significant number of technical issues in Chronology were not only immersion-breaking, but frustrating as well. Chronology glitched-out four times during my two play-throughs, with three coming during the first run, and one coming during the second. Granted, this could be exclusive to my personal experience, but the majority of these issues came as a result of in-game actions rather than spontaneous, cause-free freezes.The first major bug came after the Inventor fell down one of the games many platforming gaps. Rather than respawning at the original jumping point, the Inventor continued to fall repeatedly from the top of the screen to the bottom of the screen. As this happened, the screen constantly flashed white every time the Inventor died, making navigating back to the main menu impossible (as the in-game font is white, as well). The second major glitch game during a sequence where the Inventor has to fix a gear-based mechanism. Instead of the standard button-prompt appearing, the Inventor became wedged between the two gears. Shifting between worlds and pausing time did nothing to dislodge the perpetually vibrating character. The third bug came while paused; After selecting the Continue option, I was kicked back to the main menu, meaning that the game recognized this choice as Exit rather than Continue. Being that Chronology lacks any sort of checkpoint system within its eight chapters, restarting the entire sequence was the only option. These bugs were both upsetting and game-breaking; standard consumers might give up on Chronology entirely if they experience one of these glitches. Closing Comments:", "date": "May 10, 2014", "grade": 2.5}