{"name": "Kentucky Route Zero Act III", "ref": "https://hardcoregamer.com/?post_type=post&p=84253", "text": "Its closing on midnight as you roll past the old gas station for the fourth time in as many hours. You keep on winding around the back roads of the 65  itself a back road as highways go  searching for a delivery address that may not actually exist. The beat-up truck youre driving is more of an antique than the furniture youre hauling, but you figure it can make it through one last run. Or, well, you figured, but the nights dragging on and this slice of backwoods Kentucky gets stranger by the minute. At this point you cant be sure youre not asleep at the wheel and dreaming the whole thing, but you keep rolling onward anyway, hoping to make sense of the whole mess and get where youre going in one piece.Thats more or less the gist of Kentucky Route Zero. Except that its also not, at all. This game defies description, and for your sake, thats kind of a good thing. Its one of those titles that I recommend experiencing cold  not necessarily because its full of surprises (although it is), but because you shouldnt let anyone else color your interpretation. If you want my recommendation, I say you should buy and play the game tonight, while its on sale. Theres no better use for that 20 bucks.I know Ive made that recommendation before, but look, I know adventure games. Ive played through Broken Sword, Myst, Broken Age, The Longest Journey, Bladerunner, Grim Fandango, every Phoenix Wright and Layton game, every game from Telltale, almost every game from Daedalic (begrudgingly), and just about anything I can get running in ScummVM. So it should carry some weight when I tell you that, in my entire life, I have never pointed at and clicked on anything as beautiful, thought-provoking, or profound as Kentucky Route Zero. I really hope thats enough to convince you to stop reading and play it, but if its notThis a game about people, though its definition of the term is fairly broad. You play as Conway, an antique delivery man who needs to navigate a secret highway, the Zero, to find an address thats not on any map. You also play Shannon, a TV repair lady in search of her lost cousin, Weaver. And then theres Erza, a curious young boy whose brother, Julian, is a giant eagle who carries houses. Act three introduces Junebug and Johnny, a pair of mining robots who struck out on the open road to become musicians.At any moment, the game can put you in control of any one of these strange souls  or anyone who happens to be around at the moment  be it mid-stride or even mid-conversation. In most games, dialogue trees let you choose what you say. Here, you can choose who says it, and how, and even what the topic of conversation is in the first place. In some moments of idle banter, you control both sides simultaneously, dictating the back and the forth.The choices you make are even less conventional than the structure of the dialogue. Instead of trying to sort right from wrong, you decide whether a conversation stays focused or gets derailed by reminiscence and philosophical musings. Even when youre asked a question and given three possible answers in traditional adventure game fashion, your options are anything but traditional. Rather than determining what happens next, more often than not youre filling in whats happened before  the people and experiences that shaped each of your characters. Most games provide fixed context and ask you for a resolution, but here its the other way around.Its easy to liken it to a dream, given the abstract, blocky visuals and the nagging feeling of never being quite sure how you got where you are. The game certainly cultivates a dreamlike atmosphere with its ambient music, a mix of soothing electronic tunes and far-off, tinny country that sounds like its being played on a car radio in another plane of consciousness. Yet, despite the constant weirdness, the people you meet all feel very grounded and real, concerned with their petty squabbles, their back pain, and their mounting debt. One woman works at an underground office tower with a floor dedicated to bears, but she still thinks about advancing in her career, and where shell be taking her next vacation.Getting where youre going is nearly as surreal as talking to the people there. The county is portrayed as a black and white vector map, with Conways truck represented by a single wheel rolling along its twisting roads. You can click anywhere and Conway will drive there, or you can drag the mouse ahead of the truck to pull it along (the same intuitive control scheme is used to navigate environments). Theres always somewhere you have to be, but youre free to roam around. Scattered throughout the county are landmarks  indicated by an eyeball icon  and examining them will often launch you into mini-text-adventures. You might stumble across a reference library and rifle through files on old, obscure adventure games, or give a lift to some folk waiting at a bus-stop, getting their life story along the way (cut off, of course, when you reach their destination).Then, of course, you have your destinations, though you often have to find them first. Frequently youll be given vague directions  the sort youd expect from rural folk helping out a lost trucker  and have to navigate using landmarks and route numbers. It gets even more bewildering when you reach the Zero, an endless looping tunnel where turning back when you reach a landmark magically changes the road behind you to a new loop. When you enter a location, a white-on-black title card marks the start of the next numbered scene in the act, but dont take that to mean youre locked into a linear progression. Sometimes you have more than one destination, and whichever one you pick first is, naturally, numbered ahead of the next one. You also have the option to go back to previous locations  catch up with the old gas station attendant or the secretary at the Bureau of Reclaimed Spaces  and those little diversions are counted too.Each location is a sight to behold. A lot of indie games use pixel art for a retro feel, but theres not nearly as much nostalgia for old polygonal art (a lot of people would call it straight-up ugly). Cardboard computer have really embraced that aesthetic, using expertly-crafted low-poly models with crisp but simple textures to create a stunningly atmospheric (and oddly nostalgic) game world. Obviously the game takes advantage of modern computing power with its shaders, but it makes you think about what could have been done by more inventive artists with the 3D hardware of yesteryear. The world could have done with more games as pretty as this, Ghost Trick, or Mega Man Legends.We often talk about games in terms of that moment that takes your breath away; the giraffes in The Last of Us, the duet with Elizabeth in Bioshock Infinite, or the white phosphorous scene in Spec Ops: The Line. Kentucky Route Zero is packed with such moments  from the ghostly figures that haunt the mine when you turn off your light to Johnny and Junebug literally blowing the roof off the Lower Depths bar with their performance  each more strange and striking than the last. You would think that this would get tiring, that the individual moments would lose their impact, but each scene is so imaginative and well-executed that it still takes you by surprise. The pacing is truly remarkable, and while a lot of games like this would be hurt by an episodic model, the long wait between acts only serves to heighten it.Closing Comments:", "date": "May 9, 2014", "grade": 5.0}