{"name": "We Are Doomed", "ref": "https://hardcoregamer.com/?post_type=post&p=82719", "text": "Its hard to go wrong with a good twin-stick shooter. Run around an arena with an overpowered gun, shoot lots of baddies, survive to do it again until the war of attrition blows through your life stock. We Are Doomed follows this pattern to a T, but does it in a perfectly-paced arcade challenge that imprints its own unique style on the well-used formula.You fly through an arena of vibrant colors in the usual top-down view, with the playing field extending a reasonable distance outside the monitors edge. Rather than the usual Geometry Wars-style pseudo-vector graphics or even something more polygonal, the art style is rendered in a lovely geometric 2D that makes no attempt to fake a 3D look, with bold shapes flying across the screen in shards of color. The player ship is a little square with a jagged white glow, firing a laser with limited reach but immense power. The shot looks more like a flame than an actual laser, wider in the middle than the ends, and it makes quick work of anything it touches. The beam is either on or off, constantly extending from the ship to its full extent or cut short when it makes momentary contact with an enemy before tearing through them. Momentary isnt the same as immediate, though, so the waves of geometrically simple critters will blow through the lasers defensive barrage sooner or later, and even the SuperBeam isnt enough to ensure safety. It does great things for scoring, though.There are two keys to scoring in We Are Doomed, with the first being the obvious dont get hit. Each hit halves the score multiplier, which builds up in the usual way by shooting as many things as possible. The SuperBeam, however, not only doubles the points of any enemies killed but also counts them as double towards building the score multiplier. The beam meter builds as you collect the gently pulsing purple squares and cubes that pop up throughout the level, both randomly and sometimes dropped by destroyed enemies, and using the beam with proper timing can eviscerate an entire level in a matter of seconds. Power isnt invulnerability, though, and the SuperBeam doesnt protect your butt. Theres a good risk/reward mechanic in both building up the meter by diving into swarms of enemies to pick up cubes before they disappear off the board and finding the right time to use it for maximum payoff. Closing Comments:", "date": "April 30, 2014", "grade": 4.0}