{"name": "Mario Golf: World Tour", "ref": "https://hardcoregamer.com/?post_type=post&p=82797", "text": "Mario knows his way around a few sports. He and his pals have spent time on the basketball and tennis courts, baseball diamond and soccer field, but to many gamers Marios always been best at golf. Despite this, we havent seen the plumber on the green since his foray on the Game Boy Advance in Mario Golf: Advance Tour. Is the mustachioed hero still up to par?I wasnt quite sure what to expect in my first moments with Mario Golf: World Tour, but an impressively streamlined tutorial brought me up to speed on the basic controls and let me loose on the links in under a minute. Toad, the games resident golf expert, explained everything I needed to know and nothing more, leaving me free to learn at my own pace as I explored the games first few courses. The difficulty slowly increased as I progressed through each set of holes, as new elements like wind and sand traps were introduced along with obstacles like trees and cacti. The pacing was brilliant, helping me learn as I went along and giving me opportunities to experiment with more difficult techniques like curved shots and putting on slopes. However, when you get caught in the occasional sand trap or water hazard and have to chip your way out, the camera isnt always a great help. It can be tough to see where your ball will land, and despite clever implementation of the 3DS gyrosensor to move the camera you can often be left with a serious blind spot. Its a frustrating blemish on an otherwise polished gameplay experience, and acts as added incentive to learn to avoid those crippling areas on the courses.That said, those technical shots are far from mandatory. Sticking with the default Easy stroke setting takes out a lot of the guess work, but youll need to be more flexible in your shooting to succeed in the later courses. Once you finally get a handle on it though, putting spin on the ball with the circle pad feels absolutely fantastic, and watching a rainbow-tailed shot bend around a tree before nestling comfortably inches from the pin is a terrific feeling. While the early courses are well designed and increasingly challenging, its the Mario-themed courses that really shine. Each one has its own unique elements, like boost pads in Peachs Gardens, cannon barrels in DK Jungle, and the underwater locale of Cheep Cheep Lagoon, and theyre all a blast to play. New courses are unlocked by completing a variety of challenges; some have you shooting through rings or collecting coins, while others ask you to complete a set of holes under a range of conditions. Best of all is the introduction of powerups, which completely alter the gameplay and add an entirely different degree of difficulty even after you think youve mastered the games mechanics. Theres a nice collection of themed courses, but I do wish there were a few more included. However, Nintendo has announced plans to release DLC course packs periodically, with the first, the Mushroom Pack, available at launch. Its slightly disappointing to have to pay for more content, but its also comforting to know that theres more if you want it.The games learning curve is well calculated, but designated practice courses are also offered for those looking for a more focused venue to hone their skills. The lessons are brief and intuitive, and do well to prepare you for the more difficult courses. Youll find them in the Castle Club, where players can compete for championships in pursuit of the triple crown and also receive their initial handicap. The club itself is a surprisingly substantial overworld, home to the golf boutique and all sorts of familiar faces, along with the aforementioned golf competitions. The only problem is that due to the lower screen maps utter lack of any defining features, finding anything the first time around requires a lot of needless exploration.But once you learn your way around, youll find a generous amount of content throughout Mario Golf: World Tour. Single player options come in several different forms, from traditional 9-hole games to timed matches and all sorts of options to change things up. Completing a course unlocks new gear you can purchase for your Mii, and although many of the outfits and accessories offer similar stat boots the novelty of dressing your character in Nintendo-themed attire never really loses its charm.Its in your best interest to look sharp, too; your Mii represents you in online matches, and with golfers from all over the world competing for the best score, youll want to be dressed for success. There are all sorts of weekly tournaments to compete in, including domestic and worldwide competitions, and participation nets you exclusive gear. You can also create and engage in private tournaments with custom rules, or play with friends locally. The best part is that everyone plays at once, which means theres no waiting around for other players. You can even see other golfers shots as they happen, giving you a clear visual of your opponents progress. Theres more than enough options and competitions to have you coming back for a long, long time.Closing Comments:Nintendo and Camelot have created an extremely accessible game that pulls you in early and doesnt let go. Its a great experience for golf lovers and novices alike and, despite small issues, one of the best sports games on the console. With a wealth of single player options and a well tuned online experience, not to mention the impending DLC packs, Mario Golf: World Tour is a game that begs for a permanent spot in your 3DS.", "date": "April 28, 2014", "grade": 4.0}