{"name": "Putty Squad", "ref": "https://hardcoregamer.com/?post_type=post&p=80963", "text": "Putty Squad is a name that, until now, has mostly been forgotten. System 3 released Putty Squad on SNES in 1994 and that seemed to be it for the blue putty hero. That is, until a few years ago when the developer announced a remake would be coming to Sony and mobile platformers. The games finally here on PS4, PS3, and Vita. One things for sure  it definitely hearkens back to an earlier age of platforming.As the name implies, you play as a round bit of putty in Putty Squad. Not only are you a blob, but you must also collect the other blobs that are trapped on a wide variety of stages. Its a very simple concept and is complicated (perhaps unnecessarily) by a host of special abilities. The putty can squish down to collect items, inflate and float around, and fight with fists or a variety of other weapons. Special attacks include arrows, bombs, electric fists, and even a rocket that rains bombs down on enemies.This is a lot more than most platforming heroes can do, and theres actually good reason for it. Every stage of Putty Squad is filled to the brim with enemies. Creatures bustle about on the ground, in the air, and basically anywhere else. Theres practically no spot to rest as constantly respawning birds make it their mission to fly at the exact height you find yourself perched at. As such, running, jumping, and floating are basically a constant process.Most platformer games arent nearly as frantic right from the get go, and maybe with good reason. Theres something to be said for easing the player into more difficult situations. Putty Squad doesnt really do that beyond a few easy tutorial sequences. After that, youre thrown off into the big leagues to hopefully survive through a ton of stages. Its great to see there was so much effort in creating an expansive game, but even on easy difficulty it is a pain to see through to completion.Every section of stages is themed in some way. The earliest stages are based around Middle Eastern locations and cultures. For the most part, this doesnt seem problematic except for a few stereotypical character depictions along the way. Its quite frankly weird considering most of the cast includes animals, robots, birds, and other goofy stuff. After all, youre a blue ball of putty so how serious can any of this be?There are multiple modes to Putty Squad although they all basically boil down to the same thing. Playing through the main mode unlocks new levels and charts your high scores. Another mode grants the player seven tasks per stage and hopes for their successful completion. These tasks include things like beating a level under a time, not healing, defeating all enemies, and the like. The challenges are always the same but some are much harder to complete on certain stages than others. So, gameplay works but it is not particularly endearing.The strangest thing about this game is not the characters or control scheme but the fact that it is on PS4 at all. Visually, it could have been perfectly at home on PS3 or Vita and does not need the capabilities of a next gen system. Although the graphics are colorful and bold, the 3D models look fairly amateurish rather than cartoony. Graphics in no way hinder playing the game itself but they do stand out for the wrong reasons. Thankfully the music is great as bad music can readily detract from otherwise fun experiences.Closing Comments:", "date": "April 9, 2014", "grade": 2.0}