{"name": "SanctuaryRPG", "ref": "https://hardcoregamer.com/?post_type=post&p=80518", "text": "Long before days of CG cinematic sequences and five minute special attack animations, role playing games had a far more primitive and less grandeur presentation. During the early beginnings of computer and console role playing games, there was a time when visuals were built and designed using nothing but the alphabets, numbers, punctuation marks and symbols on your keyboard. A more formal term for this is ASCII Games. Long before pixels, polygons, or even the most basic animation, role playing games had a rather static presentation designed using the most elementary inputs to create models and depictions of fantasy worlds and characters.Even with technology as advanced as it is today with plenty of indie developers being able to produce some beautiful looking works utilizing the most modest of budgets, developer Black Shell Games chose to turn the clock back and ambitiously craft an ASCII role playing game called SanctuaryRPG. It is a fully realized epic that not only pays homage to the roots and beginnings of video games and the RPG genre, but also offers an experience that warmly welcomes both nostalgic fans and young newcomers alike.Despite the highly primitive visuals, you cant help but admire just how much creativity and imagination they were able to exercise under so many constraints. The world presented is an interesting one, it appears to be your typical medieval fantasy themed world but early on one of the first bosses you go up against is a computer terminal. Its a surreal game world that is really all over the place, it references a lot of contemporary RPGs and parodies them too.The writing is really off the wall, so bizarre and off-beat that you cant help but smirk at its dry attempt at humor. It never takes itself seriously, the characters you meet are sad stereotypes with the dialogue choices almost forcing you to make fun of them. The writing is both clever and downright silly at times. Still, it is a fully realized world with a multitude of locations and a huge cast of monsters that are all lovingly crafted using ASCII. While the plot may not take itself seriously the game itself is the exact opposite.SanctuaryRPG is a thoroughly designed and mind boggling deep role playing epic, as every inch of it has a purpose and every inch of it is crucial to the whole experience. Its almost shocking how it can reel you in and immerse you into its binary world. Back in their heyday these games were strongly captivating gamers, and SanctuaryRPG manages to do just that in 2014. It really goes to show that there are certain intangibles in gaming that simply transcend technology, intangibles that tap into your imagination and make you invest yourself into a game world and its well thought-out systems. Thats the beauty of SanctuaryRPG as a video game, it has all the right elements to engage any gamer that is a serious fan of the genre.SanctuaryRPG is a text based adventure where all choices and commands require you to type in the relevant option, and theyre all single key strokes and prompts, so its easy to get comfortable with the controls and mechanics. The main quest comes in three flavours: Classic, Softcore, and Survival. In Classic mode you play like the RPG veterans of old, where death in the game is as consequential as it is in the real world: permanent no ifs and buts your character and save file is wiped from existence. Chances are, most of you will probably run away from the idea of building a character, making a ton of progress, only to have it all end the very moment a boss slays you. It makes the experience that more intense with so much to lose, and is certainly worth trying once at least.If youre like me, then youre going to want to take up the more modern variant that is Softcore mode. It isnt as soft as the name would suggest sure it allows you to continue should you die in battle but with every defeat you lose all experience and gold on hand which is a pretty major setback (almost akin to how Dragon Quest games work). Survival mode is an unusual mode to have for a RPG, but once you get accustomed to the games engrossing battle system then youll be glad its in there. Its a fun experience going through a gauntlet of consecutive enemies and bosses in order to rack up a streak of wins.SanctuaryRPG has a fast paced and truly engaging turn based battle system, and you find yourself so swept away by the flow of it that its easy to have a split second slip-up and immediately taste defeat after. You sometimes forget how its supposed to be turn-based affair and that you can take your time during your turn, because you cant help but react impulsively out of instinct. Such is its design, and theres so much going. Spells, combo attacks, character re-positioning, and extravagantly named ultra special attacks, SanctuaryRPG literally has it all.The quest is immensely deep and unpredictable too. With the myriad of locations, creatures, and characters. Theres optional dungeons too, an arena where you work your way through the ranks, and you can even run your own tavern for that extra gold if you like. Theres some unusual aspects in the world design, such as the Blacksmith discarding any weapon you decide not to buy. Still, its a captivating game world designed to make you work hard for all the gold and experience.Speaking of experience, theres such a intricate and deep character class and stat building system that long time veterans of the genre are guaranteed to get all giddy with excitement. Fans of dice and paper role playing games will be pleased with the amount of creativity and imagination that goes into meticulously building your character. I cant stress enough just how thorough and complete SanctuaryRPG feels.The soundtrack deserves so much praise passionately composed by Rafael Longoni Smith its easily just as strong as the game itself, and I guarantee most if not all of the highly catchy tracks will etch into your memory. Its a rich and varied soundtrack with several really cool battle themes. The brooding background music really contributes to the ambiance. The soundtrack is so good that you may even be inclined to purchase it within moments of listening to it during the game.Closing Comments:SanctuaryRPG takes away all the glitz and glamour that define current RPGs and focuses on the core principles and foundations of a pure role playing experience. It goes to show that beauty is only skin deep, as the game feels far more thorough, immense and fully-realized than most RPGs today. SanctuaryRPG absolutely shines in its gameplay and ingenious design, reeling you in and making you relish the challenge and depth. The comedic and nonsensical writing is perhaps the only thing stopping it from achieving true epic greatness, but the excellent soundtrack compensates admirably. Quite simply, SanctuaryRPG is a thoroughly designed role-playing adventure that reminds us of the true endearing qualities of the genre.", "date": "April 8, 2014", "grade": 4.0}