{"name": "Depths of Fear  Knossos", "ref": "https://hardcoregamer.com/?post_type=post&p=80794", "text": "The Greek myth of the labyrinth on Crete seems like it would make fantastic game fodder. It comes pre-packaged with an iconic boss and a dungeon that absolutely begs to be filled with arbitrary, confusing puzzles. Surprisingly, it hasnt inspired much outside of Persona 4 Arena. Depths of Fear: Knossos aims to change that, but falls flat due to several perplexing missteps.Knossos combines the terrifying first-person stealth gameplay of Amnesia with the tense unpredictability of a Roguelike, ensuring that the maze is always threatening and confusing. At first glance its a great idea. Both of these subgenres thrive on tension and careful planning, so combining them seems natural. However, Roguelikes are built heavily on combat, whereas evasive horror games like Amnesia and Outlast are built around avoiding it. The inability to resolve this schizophrenic dichotomy is what brings Knossos down.The opening moments of the game are solid. As Theseus, youre lead from a jail cell into a sun-drenched amphitheater surrounding a gaping pit. King Minos looms above you as you enter, and orders his guards to push you in. You plunge into a pool at the center of the maze, the light disappearing above you, and your trial begins The animation is a little stiff and the guards are buggy, but its more than you get from most roguelikes in terms of context and dramatic weight. A bit of pageantry is much appreciated.As you exit the pool you find yourself in a small level hub, a dimly-lit ruin, growing over with grass and chock-full of atmosphere. At the very center is a sword encased in stone, surrounded by emblems of eight mythical beasts. A helpful note from Minos daughter Ariadne informs you that its the only way to slay the minotaur. As you grab a torch and explore, you find doors with carvings of those same beasts. You enter one to progress and then the whole game falls apart.Going through one of the doorways drops you into a small maze with the creature carved into the frame. Each boss monster is set up like a creature in Amnesia, able to kill you nearly instantly if youre not prepared. Your first time in, youll wander around for a bit looking for weapons, then the gorgon or griffon or centaur will spot your lit torch and murder you. The second go-round, youll be a little wiser. Youll use your torch sparingly, and only when the enemy is out of sight. Then, when your lights out, youll be swarmed by goblins or spiders or zombies and murdered a bit more slowly. You read that right  while you sneak around avoiding a boss who can kill you instantly, Knossos expects you to fight tiny, skittish enemies. With janky first-person melee controls. In the dark.To make matters worse, you start the game with no weapons. If youre lucky, youll find a sword or spear lying around the maze before you run into any enemies, but if you dont youre pretty much boned from the get-go. The game lets you purchase weapons to use from the start of each level, but finding gold inside the maze and getting it out is a total crapshoot (especially without a weapon), and the only affordable weapons are garbage. You can do more damage by swinging your torch around than by using the club I picked at the start.What really kills it is that none of the enemies are any fun to deal with. Bosses are entirely insurmountable until youve leveled up enough, and even when you fight them they just repeat the same few attack and movement patterns. The mobs just swarm around you and chip away at your health, with the only variation between them being the size of their hitbox and how much damage they deal. When theyre not attacking, they just scamper around the small, flat maze floors aimlessly. Compare that to Eldritch, where every foe presents both a threat and a puzzle to solve, and every floor of the maze is an expansive, multi-level complex with various paths for navigation. Even in its own tiny subgenre, Knossos is outclassed.Beyond the myriad problems with its execution, this gameplay just does not fit the source material. When he entered the Minotaurs maze, Theseus was a total badass whod conquered enemies from the underworld. He also managed to sneak a sword in (though some versions of the myth see him strangling the Minotaur with his bare hands). He didnt have to wander around the labyrinth for hours on end collecting random weapons and powerups just so that he could fight. Obviously, concessions need to be made for the sake of gameplay, but Theseus is supposed to be a classic hero, and Depths of Fear gets the tone of his story completely wrong.Even the most iconic part of the myth, Ariadnes thread, is handled wrong. In the original story, it was an invaluable tool in aiding Theseus escape, and an emblem of Ariadnes affection for him. In Knossos, its an almost useless pickup that leaves a glowing white vector trail behind you. The thread doesnt even act like a proper thread, as it hovers in the air wherever you jump instead of trailing on the ground below. It might have been useful as a way to instantly escape a level with your gold and weapons, but as it stands it just looks sloppy, and has no real function. Its clearly just in the game because it was in the story.Knossos makes some interesting aesthetic decisions. It has an adaptive, 70s synth soundtrack that generates atmospheric tunes on the fly. The music is actually quite good at getting your heart pumping when the action kicks up, but I cant help feeling its out of place. This is the sort of music you associate with Blade Runner and Tron, not epic historical fantasy. It makes the whole experience feel very videogamey, which isnt exactly what you want in whats ostensibly an immersive horror title.The visuals are okay when you can see them, which isnt often. Models are a little low-poly, and the creature designs are as generic as they come, but the lighting is nice (when there is any) and the environments do a decent job evoking Greek architecture. You can also see your full body if you look down, which is always a nice touch in first person games. Unfortunately, everything is animated in a jerky, unnatural way, and thats when it works right. Its common for enemies to get stuck on geometry or otherwise bug out, including the bosses, which can lead to you being trapped in a dead end while they effectively camp at the only exit.Closing Comments:", "date": "April 8, 2014", "grade": 1.5}