{"name": "The Elder Scrolls Online", "ref": "https://hardcoregamer.com/?post_type=post&p=80465", "text": "Simply because of what it is, The Elder Scrolls Online seemed to have attracted a very strong response from those that have played it or even just seen video of it. Moving a long running franchise into another genre always brings with it the risk of upsetting fans, but The Elder Scrolls Online has prompted a somewhat different reaction than what we saw with things like Syndicate or The Bureau. Just looking at The Elder Scrolls Online, it certainly bears a strong resemblance to other games that share the Elder Scrolls name, but just being an MMO means much of it is fundamentally different. Appearing on its surface to be a genuine Elder Scrolls experience, only to reveal its true identity in the finer details, has led many to view it as a pretender to the throne, a game failing to capture the heart of the series. In truth, The Elder Scrolls Online is something entirely different, and while it may appear to come up short when judged against the likes of Skyrim and Oblivion, there is a lot to enjoy about The Elder Scrolls Online taken as what it is. Since its earliest incarnations, The Elder Scrolls has always been a series about player freedom. With each new entry in the series the player was given more freedom than the last, and it has become one of the core elements that keeps people coming back. By the time the series got to Skyrim, your ability to develop your character, explore the environment, experience the story, and leave your mark on the world was extremely open ended and contributed to a great sense of freedom. The Elder Scrolls Online does an admirable job of infusing as many of these concepts into a massively multiplayer game as possible, but in the end there is really only so far it could ever hope to go as an MMO.One of the biggest departures from the traditional MMO format in the spirit of freedom is the character building. MMOs are all about class roles, which almost always means there are predefined character classes that offer paths for the various roles. While ESO does have four character classes, unlike the classless nature of Skyrim, you have a ton of flexibility in the way you build them. Each class has specific skill lines which often fall squarely into class roles, but beyond that every class has access to the same weapons and corresponding abilities. If you were so inclined, you could play as a mace wielding sorcerer that specializes in blacksmithing or any other crazy combination of class and loadout.Another plus is that you dont simply have to rely on finding weapons and armor, but you can utilize the games numerous crafting systems. Like youd expect you can craft in a variety of disciplines, and each has a ton of depth. The crafting gives you the ability to use the different means of crafting in tandem to create some very powerful items, and it once again gives a sense of freedom by freeing you from the whims of the loot system. Being able to use any weapons, armor, or items you find or create brings much of that classic Elder Scrolls freedom into the game, though there are certainly drawbacks. Due to the sheer number of option, the risk of spending your skill points in a way that renders your character ineffective is much greater, especially if you plan to engage in group dungeons and end game content. Luckily there are ways of respeccing your character, which sort of negates that issue.The Elder Scrolls Online may do great job of bringing the freedom to develop your character into the game, but other areas are less impressive. The hard truth is that there is really no way an MMO could have the freedom of exploration that the series is known for without fundamentally changing what the game is, and ESO certainly doesnt attempt to do that. The world is massive, but not open in the way youd expect from the series. Despite what some may have been hoping for, Tamriel is not a contiguous world in ESO. If you were hoping to be able to simply walk from Skyrim to Valenwood or from Morrowind to the Hammerfell, that is unfortunately not possible.The regions you find yourself in are basically small open worlds unto themselves, but even here there is much less room for exploration. You really have no choice other than to move through world as the game decides, from one end of a region to the other and then onto the next. Straying from where the game wants you to be results in mobs and quests far beyond your current level. What little room for exploration there is amounts to side quests or dungeons just off the beaten path, but its a far cry from what the series is known for. This lack of exploration will likely rub many Elder Scrolls fans the wrong way, but if you can get past it there is still a lot to like in ESO.If theres one thing about most MMOs that often puts off players that might otherwise enjoy playing a multiplayer role playing game, its definitely the quest design. Most MMOs are designed to deliberately and artificially soak up as much time from the player as possible, usually via drawn out quests full of repetitive tasks with no interesting story or lore component. In this regard, The Elder Scrolls Online stands above the majority of MMOs, and is an area it most resembles its single player cousins. Every quest is fully voice acted and has at least some sort of plot, and the game never resorts to the tired old collect x number of items which drop one out of every 15 enemies you kill. Better still, the game doesnt overburden you with quests, with your quest log never getting too full and each quest feeling meaningful and substantial. If theres one thing youll be doing more than anything else in most MMOs, its questing, so the fact that The Elder Scrolls Online consistently presents you with quests far better than than is typical for the genre is among the games biggest selling points.Even with the solid quest design, the game is still an RPG, so obviously most of the quests involve lots of combat. The combat is the area of the game that most exemplifies its dual nature, being both an MMO and an Elder Scrolls game. On its surface, with the first person perspective and real time action, the game looks much like a typical Elder Scrolls game. Its only after you really get a feel for it that it reveals itself to be an imitator. Of course, lets not overstate the quality of Elder Scrolls combat, it certainly has its problems, but ESO feels like something else entirely. The combat isnt nearly as responsive or tactile as Skyrim, and the presence of an ability bar gives it a much different feel. The combat certainly has its shining moments, but the lack of any sort of interesting AI, enemies that leash (and refill health) far too easily, and a general lack of precision hampers the experience. In the end, the combat feels like a standard MMO dressed up as an Elder Scrolls game, and while that facade works at times, youre likely to wish it would just be one or the other.Taken back to a conceptual level, much about what an Elder Scrolls game consists of has at least some sort of MMO analogue, but one thing that isnt shared is PvP. With no legacy or established design to adhere to, the PvP in The Elder Scrolls Online is able to simply be its own thing, and the result is one of the most interesting aspects of the game. Taking place in Cyrodiil, the setting of The Elder Scrolls IV: Oblivion, the PvP sets the games three factions against each other. Taking many cues from Planetside, the PvP is a persistent war between these three sides set in one big world. Across Cyrodiil there are many bases and points of contention, which are constantly being captured and re-captured. Whichever faction holds the Imperial City appoints the emperor, though the state of the world is constantly in flux. The PvP has enough meat to be an entire game, with player controlled siege weapons and structures giving a real sense of scale.Closing Comments:Whether or not The Elder Scrolls Online is for you will depend entirely on what youre looking for out of it. If you want a true Elder Scrolls experience, with all the freedom, exploration, and immersion that comes with it, youre likely to be disappointed. With a fairly restricted journey through the game world and tons of immersion breaking elements, like dozens of players huddled around NPCs and merchants or enemies (including bosses) that respawn mere seconds after you kill them, its just not going to provide what many look for out of an Elder Scrolls game. However, its got enough Elder Scrolls in its lore, story, and quest design to make it a worthwhile experience, even for hardcore TES fans, as long you can enjoy for it is. With its wide array of diverse locations, nice visuals, engaging quests and interesting PvP, The Elder Scrolls Online has a lot to offer despite its lack of freedom and exploration; with an absurd amount content, youll be occupied for a long time.", "date": "April 3, 2014", "grade": 4.0}