{"name": "Dynasty Warriors 8: Xtreme Legends Complete Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=80025", "text": "It has been eight months since Dynasty Warriors 8 hit the PlayStation 3 and Xbox 360, and in that time, Omega Force has been hard at work developing their scheduled expansion. Xtreme Legends marks the first mainline installment of the series for next generation platforms, setting stage the future of the series. Of course well more than likely witness an Empires spin-off next year, but this is a bridging point for what is to be expected in the coming years. While not developed specifically for the PlayStation 4, whenever we can get our hands on a better looking and smoother running Dynasty Warriors game, well take it.Dont be confused with the Xtreme Legends subtitle; this is mainly Dynasty Warriors 8 repackaged with a couple of additions and various adjustments. The main new content comes in form of characters and new scenarios. In standard Omega Force fashion, they have installed each warrior with their own move sets, ensuring no one will ever feel exactly the same. Lu Bus daughter, Lu Lingqi has a crossed pike she can toss around, Cheng Gong can summon soldiers through a scroll, Zhu Ran has a fire bow he can let loose, Yu Jin wields a war trident he demolishes his enemies with, and Fa Zheng swings around magical woven cloth. While not the most traditional weaponry, they definitely add to the experience by offering unique and interesting ways to play the war infested hack and slash.The biggest new addition by far is a campaign centered on fan favorite Lu Bu. Here, we are taken on a lengthy journey that follows the devious man who goes through various battles and performs multiple counts of betrayal. He wasnt a force to reckon with before, but playing as him in his own story is a whole other ball game. Outside of that, a challenge mode has been added, giving players five different events to compete in. These range from speed runs to defeating as many enemies as you can before the time runs out. Its definitely a nice distraction from the massive battlefields we have become used to, but they definitely arent as addicting or rewarding as the story and ambition modes are. Overall, what has been improved is smaller statistical aspects such as raising stats, and adjusting gameplay mechanics ever so subtly that should please the most diehard fans.If you played Dynasty Warriors 8 back in July last year, know that your progress wasnt for naught. Players will be able to transfer their save files onto Tecmo Koeis servers and bring it into the Complete Edition. This means that if you have maxed out characters  which has now been increased by fifty levels, that progress will be moved to the PS4 version for you to continue where you left off. It does take some understanding how to do it, as the upload button is somewhat hidden on the PS3 version, but its a quick process otherwise. Better yet, Xtreme Legends features cross-save and cross-play capabilities, allowing those who decide to spend the extra forty dollars on the Vita versions to have an added experience.As a port to a new and powerful console, there are some expectations on visual quality. For the most part, Xtreme Legends transitions very well on to the PlayStation 4 by offering higher resolution textures, softer shadows and a higher resolution. The skin of characters also looks fleshier and really stands out during cutscenes. Unfortunately, its not all positive news as theres some downsides to the next generation port. For one, a lot of the lighting effects seem to be missing, or at least not as prominent, causing areas and most characters to look a bit bland at times. There also seems to be an additional effects such as depth of field and sun glare techniques that make the game a little hard to look at. The frame rate will also occasionally take hits, but oddly enough its not during hectic battles, but in the middle of cutscenes. Thankfully these arent all that frequent and doesnt hinder the immersion. Looking past the visual upgrade, the plentiful cast of voices will come through the controllers speakers, but I do wish there was an option to mute the television track as theres a bit of an echo.Closing Comments:", "date": "March 30, 2014", "grade": 3.5}