{"name": "Luftrausers", "ref": "https://hardcoregamer.com/?post_type=post&p=79060", "text": "Back in the days when arcade games were king, developers did their best to create purely addictive experiences. They didnt have the best graphics or music, but as long as the core gameplay was entertaining, quarters would keep flowing in. Vlambeers latest game, Luftrausers, perfectly channels that style of play. Although it might seem a simple dogfighting sim, the act of playing proves it to be tremendously fun.Luftrausers key is it total simplicity to understand. You pilot a rauser through 2D skies, shooting down any enemies in your path and (hopefully) dodge incoming fire. There are a handle of enemies to come across from fighter pilots, battleships, missiles, blimps, and more. Some are much stronger than others and may require more firepower to take down. In any case, as long as you can skillfully wield the controls then stopping them shouldnt be a huge issue.With a game like this there is a strong dependence on controls. If they arent up to snuff then the whole experience will suffer. Thankfully, they work marvelously well. Supporting both keyboard and gamepad controls, most gamers are catered to with their preferred playstyle. Once in game it takes only moments to get a feel for a planes performance. The turning speed and boosts perform admirably and feel attuned perfectly to button presses.Dont allow yourself to get complacent with the way the current rauser performs, though. One way that Luftrausers injects more strategy into the game is via a trio of modifiable parts to the plane via weapons, plane bodies, and propulsion. Each can be switched out independently, leading to a great deal of variety to choose from. Some ship builds are incredibly slow but powerful while others are light and quick but very vulnerable to bullets. Playing around with many different types is fun to see which works best for your playstyle.Customizing your ship isnt something you can do right at the start as every item is locked by default. So, how do you go about unlocking them? Every time you take flight there is a list of possible missions to complete that round. After completing a few of their requirements ship parts begin to show up in your inventory. Some of these challenges simply task players with small tasks such as destroying a few weak enemies. Others pit you against far more monolithic entities such as blimps. You might find yourself stuck on blimp missions for a while, but all the attempts in the meantime will prove very useful for honing skills.Hopefully you do enjoy the addictive dogfighting gameplay as is because beyond ship customization theres not much more to it. The game mainly focuses on a single, wraparound layout with sea and clouds as bottom and top screen barriers. Planes, ships, and bullets will be varied each time but theres little else to experience before completing the games 100 missions. Although Luftrausers isnt a visual powerhouse either, at least it is always fun to watch yourself weave through bullet sprays and exploding enemies.Theres a similar amount of minimalism where the soundtrack is concerned. Upon playing, you might think that there is barely any songs at all. However, one quickly realizes that each different rauser build has its own varied music. Its really cool  at least until you finally settle on one plane and have to hear the same song every time. Sound effects sound like theyre taken straight from the Atari era, which goes great with the retro pixelated design. Its just plain fun to hear sounds like that in the modern era.Closing Comments:", "date": "March 22, 2014", "grade": 4.0}