{"name": "Monster Energy Supercross  The Official Videogame 6", "ref": "https://hardcoregamer.com/?post_type=post&p=438336", "text": "Milestone has released its sixth iteration of its Monster Energy Supercross title, as listed in the extremely long title of the game. Based on the AMA Supercross Championship, the series has given fans a licensed game for quite a few years, albeit with caveats. Once again, this years game features 80 official riders, 29 unique bikes and 17 licensed tracks from the previous season. No other licensed sports or racing series does this especially when the current 2023 season is halfway over. Some of the legacy issues do remain and not a lot has changed from last year, but theres enjoyment to be found in the latest release.Most of the modes remain in tact (for better or worse) with players having a slew of rider and bike customization options that can be unlocked with in-game progression. This doesnt include the Helmet Editor which adds even more options for players creativity. The Track Editor returns and while it can still be tricky to complete a course, this does add more replay value. Unfortunately, it seems that tracks created in previous games dont seem to be available, but courses can be shared as they have in the past. The changes to the Career Mode continue over from last year as players will need to keep an eye on a riders health. The more the rider goes down during a race, the more damage there is to a limb. The way to combat this is by completing Training in the Supercross Park, which is this years free roam compound. In the Career this year, players are forced to start in the Supercross Futures league, then move to 250SX before getting to 450SX.For those looking to jump strictly into the top class, a Championship Mode is available that also removes the deeper element. The Career also offers skill trees that seem to bump up skills a little bit at a time. Players can also track their skill accomplishments in the Journal, which will grant even more points towards purchasing new skills. The Supercross Park is the best version of a compound that Milestone has offered in the series. Its structured well and offers five different areas with different tracks and activities. The elevation changes and the designed areas allow for good usage of the bike. Milestone has offered one new mode thats brand new to the series and its the Rhythm Attack. Imagine drag racing with dirt bikes but there are jumps to clear and thats what this mode is. There are only two areas available, despite the game displaying them in the menu multiple times like there are multiple options. This also happens with other menus including contracts, sponsors and more. As for the Rhythm Attack, this 1v1 battle doesnt require the need to turn as learning the rhythm of approaching jumps can also translate into other modes. While Milestone presented a list of what the latest game has that the other doesnt, its a bit misleading. In this, it mentions the likes of the Rhythm Attack, the inclusion of Jeremy McGrath voiceovers for training and the ability to do a full bike setup. Not much has changed in the Career and the previous had bike setups, but unless the player knows the ins-and-outs of setting up a bike, the entire premise remains the same. Milestone has included cross-play and online rankings, but the fact this is on two separate generations ultimately is beginning to hold back the current-generation version.The series is beginning to show its age on an older Unreal Engine design. Both rider and bike models look too glossy to the point that the riders look like toy figures and frankly a bit weird. The developers have instilled an overabundance of lighting to help the game look more vibrant and while the colors stick out, this is beginning to swing towards mobile game territory. The dirt detail looks solid, especially in the wet, and the terrain does change visually with usage. Other aspects such as the pre-race and post-race cutscenes are identical and while the in-race and menu presentations got a much improved visual boost, having this game as still a cross-generation release is holding things back. The current generation is a buttery smooth experience, but it could be more with a 120hz option since these visuals dont push the system. Milestone has stated that changes have been made to the physics and the AI, which may be partially true. The AI does a much better job of catering to the players skill set in the game, but it still seems to be bland. I have seen the AI wreck and wrecking doesnt amount to much. Not having the ability to go chase down your bike or have the ability to create a bigger accident due to avoidance takes away from the true punishment of wrecking. There are no DNFs in races, and if injuries are tracked in the Career, injuries happen during races in real life. The physics are still wonky and not confidence inspiring, but updated rider aids may help with this. Strangely, I seem to do better in races with everything set to realistic than with rider aids on. Bumping into other riders feels more like hitting an invisible wall. Theres no real depth to it as sometimes riders will fall off their bikes, but it feels no different than nudging another rider in the games response. Ive seen a few new animations with legs flailing off of the bikes pegs, but there are still a good bit of times where the rider and the bike seem as one and physical result doesnt make sense.The greatest Supercross rider of all-time is included in Monster Energy Supercross 6 with Jeremy McGrath offering voiceovers. The Supercross Academy still offers the beginning basics to riding, but it still isnt enough in the grand scheme of learning the game. Something akin to the Circuit Experience seen in the Gran Turismo series would be nice to have. Going around a generic track doesnt translate to approaching certain sections on a real course. McGrath is involved with having guidance in all the modes, but Milestone seemed to miss the mark of having him as a selectable rider. He literally just does voiceovers in the game and that isnt much of a selling point. Closing Comments:With The Official Videogame 6, The Monster Energy Supercross series from Milestone continues to feel like the pot on the back burner of all the racing series they develop and publish. They have the license and claim a bunch of updates every year, but the core racing experience remains troubled and inconsistent, especially in comparison to the MotoGP series of games. Having said that, I still feel this is the most fun Ive had out of all the games in this series and that may be thanks to the AI changes and removing any assists. Still, each game comes out a year behind in its roster and track updates and it just doesnt do the best job of replicating the sport. The Rhythm Attack and new Supercross Park are both welcome additions and cross-play will allow for bigger racing rooms online, but the fact that Milestone still sells the game for $10 less than normal retail wont help justify it in the current generation as that price is now $60. They need to take a year off and develop specifically for current generation hardware and catch up its calendar year to the same year that its released.", "date": "March 9, 2023", "grade": 3.0}