{"name": "Mario Party Superstars", "ref": "https://hardcoregamer.com/?post_type=post&p=413619", "text": "Its only been a few short months since Mario Party Superstars was first announced, and yet the wait has felt a lot longer than that. Maybe the prospect of a classically-styled Mario Party was simply appealing or perhaps the idea that the original games were being brought into the modern era was just that exciting. At any rate, Mario Party Superstars is here at last, and it mightve actually managed to live up to the hype.One of the first things players will notice about Mario Party Superstars is that it both looks and sounds excellent. Its one of those games that makes the Switch look more powerful than it really is. Everything is vibrant and bright, and its all just plain fun to look at. Its probably not that much better than Super Mario Party in this regard, but its still noticeable. Every location and board has been lovingly updated for the modern day. Veteran players will recognize everything almost immediately and find themselves able to see much of the old in the new boards and Mushroom village. These arent one-to-one remakes, though. Rather, its more like each location was remade as if it were new today. The boards all flow better than the originals, and they involve more special events, special spaces and so on. This has an unfortunate effect of slowing games down, but it all contributes to the fun.As for minigames, Mario Party Superstars has a solid line-up. Just about every iconic game from the Mario Party series is here, even some of the more infamous ones like the palm-destroying Tug O War from Mario Party 1. In the normal party mode, all these games are kind of all thrown into the same pot. Theres no distinction between normal games and battle games, which kind of makes sense since battle games are much more rare in Mario Party Superstars. Still, its disappointing to see a normal four-player game come up when someone does finally trigger a battle game. If Nintendo does any updates in the future, an option to increase battle game frequency would be much appreciated. Going back to minigames, players can also enjoy them via Mt. Minigame. Its s mode that can be enjoyed solo, online or locally with friends. Within Mt. Minigame, players have the option of seven modes: Free Play, Trio Challenge, Sports and Puzzles, Coin Battle, Daily Challenge and Survival. Each offers a different twist or selection of games to play, so minigame lovers should be able to get a lot of mileage out of it.The star of Mario Party Superstars is still the board game, though, and thats been handled well for the most part. Again, each board works better than its predecessor in terms of flow, but there are some changes that older players might not like. The rarity of battle games is one of these changes, and the extra helping of time-wasting events is another. There are so many lucky spaces on every board that its hard to go more than two turns without landing on one, and the same holds true for many of the other event spaces. In short, theres a lot more going on in a given turn in Mario Party Superstars, making it play much more slowly than most of the others. A standard fifteen-turn game can take 45 minutes, while a thirty-turn game can run for over 2.5 hours. Items on the whole are much more available too, and there are no restrictions on purchases at Item Shops. The first-place player can buy Golden Pipes (these take players right to Toadette) just like everyone else, which creates a situation where its difficult for other players to catch up once someone has built up a bit of a lead. It may be that the lucky spaces are supposed to help deal with this, but they tend to have the opposite effect. Its easy to wind up with a rich get richer, poor get poorer dynamic without implementing some house rules. Newer players may also miss Super Mario Partys partner and character dice systems, as neither are present here.There are also curious issue regarding online play in Mario Party Superstars. The first thing players do when they start the game is choose from Online, Local or Solo play. If one of the first two options is selected, a player room will be created for other players to join. Its strange because Mushroom Village has the Friend House, which facilitates online play too. Was it necessary to make players choose a mode on the first screen? Its actually kind of a problem since because of Nintendos shaky online network, getting disconnected from a game is not uncommon. In another game, this wouldnt be a big deal itd just be a simple matter of rejoining the game; not so in Mario Party Superstars. In order to bring a dropped player back in, the host has to stop the game, exit back to the first screen and remake the room. That, along with noticeable lag making its presence known in most sessions, is perhaps the biggest issue with the game as it currently stands. Its not that lag and dropped players are a constant problem, but both do happen more than one would like. Its not so often that itll ruin a game though, thankfully.This problem is made up for with Mario Party Superstars last big features: unlockables and achievements. As one plays through the game, they earn coins, Mario Party ranks and titles. Coins are used to acquire new music, player cards, encyclopedia entries and stickers. The stickers in particular are rather fun to unlock as theyre all fun to look at, are easy to use and most are situational enough to add fun accents onto events like getting a star or visiting Boo. They make for great reactions in online play, and an extra layer of silliness when playing locally. The rest is all just icing on the cake. Player cards are ones place to tell the world their favorite Mario Party and minigames, as well as show-off their greatest achievement via a cool title under their name. Beyond that, the unlockable music adds classic flair, while the encyclopedia does a good job of providing some extra info on all things Mario Party. Taken together, all these little add-ons do end up adding a lot to the experience. Closing Comments:Mario Party Superstars is a worthy compilation of all of the series greatest hits. It has a great selection of minigames with plenty of different ways to enjoy them. The core board game works well for the most part, albeit somewhat hampered by Nintendos online infrastructure and some imbalanced design decisions. Online itself is functional enough, but expect to experience lag and the occasional dropped player. Rounding out the whole experience are the various unlockables on offer; all of which enhance the player experience in some way and give fans reasons to keep playing beyond just enjoying the occasional round with their friends. Indeed, Superstars is every bit the game Mario Party fans were hoping it would be, even if it does suffer from minor issues.", "date": "November 1, 2021", "grade": 4.0}