{"name": "SteamWorld Dig (PS4)", "ref": "https://hardcoregamer.com/?post_type=post&p=78570", "text": "Im not a miner and I really dont want to be one. I dont want to break my back looking for coal, gold or jewels. I dont want to be deprived of precious Vitamin D from the sun by digging in dark caves all day. I dont want to be attacked by robotic turtles that shoot spikes or insane cave dwellers who throw dynamite at each other. I dont like any of that, but with SteamWorld Dig, I wanted to do it. I wanted to dig, dig, dig, completely clueless as to what Id find. I was completely conscious to the crafts redundancy, but I enjoyed it. SteamWorld Dig showed me that digging is awesome, that mindlessly chipping at rocks and soil can be interesting, regardless of what you find within. SteamWorld Dig is the antithesis of its own core mechanic; its a game that manages to take the routine monotony of mining and trading, and makes it captivating in all the right ways.Taking the role of desperado cowboy robot (cow-bot?) Rusty, the player must explore the abandoned mine in the wild west town of Tumbleton to discover the secrets left behind by Rustys Uncle Joe. However, the secrets arent so easily attainable. SteamWorld Digs entire premise is based around mining for resources, traveling back to the surface, trading in the resources for cash to buy stronger tools, which allows for deeper mining to find more valuable resources to trade in towellyou get the idea. However, elements like health and the strength of your lanterns fire do their part to make going too deep beneath the surface a risky endeavor. Losing all of your health causes you to drop any loot youve kept in your inventory (though it can be re-obtained by returning to where you died, Dark Souls style), while losing your lantern light can make the mines darkness nearly impossible to navigate. To make matters harder, your inventory is very restricting, especially at the start, so you cant mine too much before having to head topside and trade in your finds just to make space in your pack. When all this comes together, you have an assembly line gameplay model, built by a repetitive gameplay structure.But the repetitive nature of SteamWorld Dig doesnt reach that exasperating moment of tedium and monotony. Image & Form have performed a phenomenal task of taking this seemingly repetitious gameplay model and making it both appealing and fun. Despite having a sluggish pace early on, SteamWorld Dig steadily evolves its gameplay with encouraging rewards. Trading in minerals for cash allows Rusty to spend that income on new upgrades to his pickaxe or personal stats, which allows for things like faster digging or higher defense against subterranean monsters. In addition, the money traded in goes straight to the towns bank (experience, in a way), which increases the number of things to purchase in the store. The more you trade in, the more you unlock to buy, which allows for deeper digging and rarer minerals to mine. The amount of purchasable items is plentiful; many items increase a specific skill or statistic, so you can always tune Rustys abilities to your liking. Even better are new abilities left behind by Rustys uncle in the mine, like a running dash, a handheld drill, and even a double jump. The stream of new abilities is steady enough to keep you engaged, just to see how much easier mining can get and what new areas in the mine can be accessed.One big strength that SteamWorld Dig possesses is the mobility. Taking cues from Super Metroid, SteamWorld Dig offers a very flexible and easy-to-use exploration system. Getting around the mine is a breeze. Initial skills like the wall-jump, which allows for scaling mine shafts, are fundamentally sound, especially with the tight Dualshock 4 controls. Performing acrobatic leaps around rocks and soil clusters isnt perfectly precise, but getting from the bottom to the top of the mine is shockingly fast. Later abilities like the Steam Jump (which rockets Rusty upward at the expense of water) definitely make getting around easy, keeping a fast-paced platformer vibe alive and the tedium of digging at a solid low. And if youre exhausted from scaling back up the mine to Tumbleton every time your inventorys full, the game even has convenient teleporters and pneumatic pods to warp back quickly.The mine itself is, for the most part, freely destructible. Youre pretty much carving your own way through Tumbletons soil. Ore and cave locations are randomized, aside from the key order to gain new abilities, so playing the game multiple times still offers a sense of discovery. The caves themselves offer some very clever puzzles to gain new abilities or rare gems, all of which encourage experimentation with your toolset and reward finding hidden secrets. The mine can get a bit convoluted at times, and there are potential instances where you are unable to climb back out (with which Image & Form have conveniently offered a self-destruct option, just in case), but for a game whose premise involves the dark and crowded depths of a mine, theres a lot of fluidity in how you play and explore.SteamWorld Dig originated as a Nintendo eShop game for 3DS, which has made its bite-sized mining adventures a perfect fit for a portable console. However, on the PS4, the games pacing is a bit stretched, encouraging longer journeys instead of small excavations. The Dualshock 4 controls are solid and responsive, though the Dualshock 4s touchpad is simply another command for inventory management. On a home console, SteamWorld Dig lacks a bit of its digestibility in its appeal. On the bright side, the game is available for cross-buy on PSN, so you get a copy of SteamWorld Dig for your Vita in addition to the PS4 purchase, allowing for the same amount of portable accessibility that the game delivers on the 3DS.From its charming robot characters to its buttery smooth animations, SteamWorld Dig makes a great visual impression. Despite a heavy emphasis on brown soil, the games presentation is striking with personality, with animated enemies, shimmering gems, and a number of environmental changes as the story progresses. The music echoes dusty western films, but tends to take a backseat when the excavations begin, instead focusing on ambient tracks and significant use of sound effects. Its a cleverly designed aesthetic, contributing immensely to removing tedium.Closing Comments:SteamWorld Dig is an amazing achievement, a rewarding and addictive adventure built around a mechanic that would be unbearably repetitive and monotonous in practically any other game. The steady amount of exciting abilities and open-ended exploration give players incentive to dig deeper and deeper, with whole new worlds appearing from the soil. The controls are fluid and accessible, always making navigation around the depths of Tumbleton easy and frustration-free. The PS4 eliminates much of the great pacing and accessibility of digestible mining journeys, so its difficult to call it the definitive version of this indie gem (though cross-buy allows for the Vita version as well). And to be fair, since this is a rather formulaically constructed game about mining, there are a few moments of tedium sprinkled throughout. But even with that in mind, SteamWorld Dig manages to stay exciting and fun for the entire playthrough. If youve already explored Tumbletons depths, the PSN version wont give you many new or better reasons to buy it again, but if youve yet to grab your pickaxe and start digging, SteamWorld Dig has a lot of fun and well-designed ideas buried within.", "date": "on March 19, 2014", "grade": 4.5}