{"name": "Titanfall", "ref": "https://hardcoregamer.com/?post_type=post&p=77765", "text": "We at Hardcore Gamer have spent a lot of time with Titanfall over the past month. The beta provided dozens of hours of enjoyment over the course of a few days, and showcased just how fun an FPS can be. Unlike many of its ilk, the barrier for new players isnt high enough that it becomes intimating to jump into or fall behind in later on. After almost a year of hype, Respawn Entertainment  headed up by former CoD devs,  is finally making their debut. An FPS/parkour/mech battle game may seem odd in theory, but winds up delivering one of the most entertaining multiplayer experiences on the market.The multiplayer campaign mode is something that wasnt really talked about much before the release, or even hinted at in the beta. While there was some brief text describing a war, it wasnt explained with any depth. Now, you get between-mission and in-gameplay audio updates along with minimal visual updates before a match. Youve got two campaigns to play through with nine matches each  the Militia and the IMC. The Militia are more fight for the greater cause, and are out to get as much fuel for the world, complete with a guy whos just too gosh-darned old for this anymore, but wants to do one last thing before retirement! The IMC has the fuel, and your goal with them is to take out the Militia.In theory, the story shows you two sides of the same coin, but neither is all that compelling. The Militia side is superior to the IMC one since it focuses on a few characters, but none of them are fleshed out much  even by FPS standards. Luckily, each campaign will only take about an hour or so to conquer, and whether your team wins the battle or not, youll win the campaign as a whole regardless. Beating each campaign gives you a new titan type, giving you three titan types in total. The first is called the Atlas and was seen in the beta, while the second is called the Stryder. Its faster and can charge three times instead of two, but does less damage. The third is a giant hulk called the Ogre that can deal and absorb a ton of damage, but is also very slow. Titanfalls core gameplay is the same as it was in the limited beta with a couple of key differences. You control a pilot who can either choose to handle combat on-foot or in a mechanical titan. Each method of attack has its own pros and cons. Being on-foot means youre more vulnerable to a single-hit kill from a titan, but also allows you to move around with far more freedom. Parkour is used to allow wall-running, wall-hanging, and enables you to get from building-to-building much faster than a typical FPS. Being in a titan means that youll have access to a ton of armor and firepower, but will be more limited in speed and maneuverability. It may seem like being outside of a titan is a recipe for instant death, but its not. The key to survival is to pay attention to your surroundings and make smart use of what you have available to you.A few things werent shown in the beta that are both cool and allow you to gain the upper-hand in battle. You can hack not only the opponents spectre teammates to help you, but also their massive turrets. Zip lines werent shown in any beta maps, but allow you to quickly zoom through areas either shooting away at a handful of enemies crowded on a ledge, or just kicking as many of them as possible before succumbing to your fate. Wall-hanging was also not explained in the beta, but can be done by clicking the left trigger for a limited time. This allows you to make pretty much any part of an environment a perch, and is a godsend for effective sniping in weird areas that people would otherwise feel safe in.Weapon-wise, youll always have at least one anti-titan weapon, with some regular weapons also doubling as that. You may not be able to do as much damage to a titan with a primary weapon, but having the option can mean the difference between life and death, as its often faster to switch weapons than reload  especially since anti-titan weapons take far more time to reload than regular ones. Cover is key as well. Unlike a Gears of War-style game, you wont just dart from cover to cover seamlessly. Instead, youll have bits of the environment to utilize, moving quickly to get in some damage. You can also shoot in such a way that it seems like the fire is coming from another side and then swoop in on a blind side and attempt to rodeo the titan. Like the name implies, youll be mounting the titan and doing your best to subdue it. Instead of a rope and an eight second ride limiting you, youll have a variety of firearms and the ability to take as much time as you need as long as you can survive. Successfully toppling a titan like this is dangerous, but thrilling and allows you to give your team a huge advantage over the opposition. You can accomplish the same goal by having a titan follow you through troublesome patches or having it stand guard  especially if its a heavily-armored Ogre. While you can do this with any titan type, either of these methods leave them open for attack, so youll want to ensure their survival because the more titans you have on the battlefield versus your opposition, the better your chances of survival are in either an attrition, hardpoint, or pilot hunter match.As the beta showcased, attrition is basically team deathmatch, while last titan standing is more limiting, and hardpoint is a territory-capturing mode. Pilot hunter is essentially the same as attrition, only with pilot kills counting and nothing else. Capture the flag is exactly what it sounds like, but with some variety to it. Either a pilot or a titan can capture the flag, and if you grab a flag as a pilot, you can hop on the back of a friendly titan to make it back to the base with some security. Every mode type can be played on the games 15 default maps, and as someone who got a lot of use out of the two showcased in the beta, its almost too daunting to think of having that many options for gameplay.It does help that a few of the modes are just minor variants of one another though. The six-on-six combat works fairly well, and beyond launch day problems, the game has performed perfectly in the vast majority of our online play sessions. There are instances where players will fly around the screen due to lag, and if you get a retrying connection to server message, prepare for at least a death or two since the screen will be greyed out and youll be unable to see whats going on. The always-online nature of the game makes it a tough game to predict the future on. Until the successor comes out, it should have plenty of people to play against and DLC support, but since you cant even access the training mode offline, online issues over the long haul can be worrisome since youll be unable to do anything with the game once its no longer supported. Visually, the full game definitely looks better than the beta. There, muddy-looking textures hurt the overall presentation, and for a next-gen game, they didnt seem to make the most of the new hardware. Now, the textures as a whole look better, but still dont quite feel like what you would expect a next-gens textures to look like. Crysis 2 and 3 had dazzling textures for last-gen games, and Titanfall still features too many things that should have some depth to them, but simply dont. When youre rodeoing a titan, you expect some depth to the metal and all you get is a muddy view that you can see in your minds eye could look better, but doesnt appear as such on-screen. Fortunately, things do move at a really smooth clip and the animations for running around and getting into the titan are smooth. There are some stunning views to behold as well, with many coming as the result of some well-crafted parkour.Titanfall is a non-stop barrage of sound. Youll hear bullets whizzing by at all angles, teammates yelling to either save them or thanking you for saving them along with instruction being barked at you by your team about the status of your titan and the overall flow of things. If youre in the lead, youll be told the degree of it  and the same goes for when youre on the losing side. The campaign features a smattering of dialogue, but not a ton, and while its all reasonably well-acted, the cast wasnt really given much to work with. The world youre in feels like one youre plopped into and need an expansive guide to really make sense out of beyond a ton of bad stuff has happened, and now were just gonna shoot each other a bunch. There are some epic songs to be heard, but not during combat  which is probably a good thing as they stand out far more there and would risk being lost in the shuffle during heated battles. Closing Comments: Titanfall is a flawed game that winds up being greater than the sum of its parts. Even counting both sides of the campaign together, its quite short. Fortunately, the main draw is multiplayer gameplay and theres a lot of that to go around. Titanfall offers up a lot of variety and the execution feels fresh and exciting. The massive difference in how the game plays either on-foot or in a titan is impressive since both feel equally well-done  just like theyre different sides of the same coin. One gets across the David vs. Goliath role nicely, while the other feels like being a powerful 20 foot tall entity with a massive target on your back. Titanfall is the next-gens biggest game so far, and sadly doesnt quite look the part. Muddy textures have been improved from the beta, but you cant help but look at them in-game and feel underwhelmed. Titanfall has some noteworthy shortcomings, and yet the accessible gameplay makes it an easy recommendation not only for FPS veterans, but those who normally avoid the genre as well. As a result, Titanfall is the best gateway FPS ever created and is a must-buy for anybody with an Xbox One.", "date": "March 14, 2014", "grade": 4.0}