{"name": "Hoshizora no Memoria -Wish upon a Shooting Star-", "ref": "https://hardcoregamer.com/?post_type=post&p=284577", "text": "Visual novel fans have an interesting predicament with regards to new titles they can play. Not one but two games dealing with struggling high school astronomy clubs have come out recently. First was A Sky Full of Stars by Pulltop, which focused on multiple schools coming together to create a far grander astronomy group. Now comes the much-anticipated English release of Hoshizora no Memoria -Wish upon a Shooting Star- by Favorite. Its Kickstarter campaign launched earlier this year and saw no trouble raising nearly $90,000 in funding. The short time frame between Kickstarter and release is due to the fact that the campaign was not funding a translation; one had already been completed. Instead it was to offer up physical goods such as a limited edition and to also fund the still upcoming fan disc. In either case, this visual novel is a title which many were eager to support. Hoshizora no Memoria -Wish upon a Shooting Star- follows the story of Kogasaka You. He used to live in a small, quaint town named Hibarigasaki before being forced to move away due to his mothers work. As is often the case in visual novels, moving away forced You to lose contact with someone incredibly important to him. Although You didnt really have many friends, there was one girl he would always meet up with after school and stargaze with. They promised, as children often do, to meet again and even get married. Unfortunately, Yous return to Hibarigasaki isnt a pleasant one. Both he and his sister Chinami end up coming to live with their aunt in the town after their mother passes away. The bittersweet return to their hometown leaves You cautious about making friends, but still immensely interested in finding his old stargazing pal.From there the story proceeds along a lot of beats which should be familiar to visual novel fans. You quickly meets up with a host of high school girls with colorful hair that become his friends. Theres the peppy class representative, obstinate student council member, tsundere neighbor and the like alongside Yous own brother-obsessed sister. The drama in Hoshizora no Memoria -Wish upon a Shooting Star- is twofold. On one hand, You desperately wants to find his friend again. On the other hand, he also wants to help save the schools Astro Circle (astronomy club) from almost certain demise. They dont have enough members to continue being a group  so he decides to shoulder the burden of finding new members himself. Eventually, all this interaction with classmates eventually leads to a relationship with someone. Theres a bit of mystery in the storyline as well as some mystical elements. Even so, in many ways this still feels like a standard high school slice of life tale. Thats not great news considering there are already so many of those available. Some of the initial routes also come across as really uninteresting. The drama in one route specifically is eye-roll inducing rather than likely to make anyone cry. Other, later paths lead to more emotional finalies. In total there are seven different routes to go down. None are particularly surprising and relate to most of the female characters You befriends. One route in particular might not be to some players tastes, but it must be seen in order to work toward 100% completion. An initial playthrough of Hoshizora no Memoria -Wish upon a Shooting Star- should take folks anywhere from ten to twenty hours depending on their reading speed. After that, other routes can be picked up with anywhere from two to five additional hours each. As such, youre in for the long haul with this game. The unfortunate thing is that so much time is spent on filler events that do very little to enhance the story. Because the characters are pretty much tropes incarnate, at least until their specific character route, theres no reason to provide hours of meandering dialogue. Why not focus more time on the mysterious elements? At least the humor is decent, if repetitive at times. There are two versions of Hoshizora no Memoria -Wish upon a Shooting Star- available: one from Steam and one from Denpasoft. As this is not nukige, all-ages players will get a fleshed out experience that does not feel totally chopped up. Unlike some of Sekai Projects earlier attempts at cutting out adult content, this title gracefully handles transitioning from before and after a sex scene with dialogue that makes sense and clear fade out. Of course, those who want the full experience can still get that directly from Denpasoft or grab a patch to apply to the Steam version. There may not be a huge reason to get the Steam patch, though, as so many of Steams features are missing with this release. You will find there are currently no achievements, trading cards or even Steam cloud support. For me, Steam also failed to track gameplay time. Its also a bit surprising how much the text quality of Hoshizora no Memoria -Wish upon a Shooting Star- is lacking. The translation/localization itself is fine. Sure, the liberal use of the word literally might be questionable, but folks can live with it. The real trouble is in the surprising amount of typos spread throughout the game. Within the first five minutes of the common route youll already see one. As the game goes on there are more and more, many of which are shockingly bad. It almost feels like the first draft was turned in and then used for the final build. Sometimes dialogue is left totally untranslated. Other times the word wrapping gets messed up as text trails off the screen. This is definitely not the way to present a finished product to readers, especially when it has a large publisher behind it.Closing Comments:Hoshizora no Memoria -Wish upon a Shooting Star- provides slice of life fun for those who enjoy it, with a bit extra in the form of its mysterious elements and plenty of routes, but it can often become a slog to read between key moments. While the localization provided is acceptable, the multiple issues with the text typos and formatting are not. Patches will resolve these issues, but theres so many to resolve that it will likely take a while before theyre all finally smoothed out. Most can probably wait on this release until then to get the best experience.", "date": "December 26, 2017", "grade": 2.0}