{"name": "Voice of Cards: The Isle Dragon Roars", "ref": "https://hardcoregamer.com/?post_type=post&p=413506", "text": "The elevator pitch for Voice of Cards: The Isle Dragon Roars would probably sound generic and uninspired under most circumstances. Its a turn-based JRPG set in a world of sword and sorcery where a swordsman and his companion hunt a dragon at the queens behest in hopes of being rewarded with a bounty of riches. Throw in a kidnapped princess and you have the most generic fantasy storyline imaginable, but the gimmick to distinguish it from other games that follow this familiar plotline is that everything unfolds through the medium of cards. But this particular game has Yoko Taro as one of the writers and directors, which is a name that can spark intrigue among those familiar with his work.The main protagonist can be named whatever the player wishes, though the default name is Ash. This seems fitting since he has a monstrous companion named Mar who is unable to speak the humans language, even though she and Ash seem to understand each other well. The Queen has issued a hefty bounty for slaying an ancient dragon that has awakened, and theres little in the world that Ash desires more than money. While he and Mar are not as seasoned or battle hardened as their competitors in the Ivory Order, they set out to slay the beast with images of gold coins dancing in their head. Fortunately the two wont be alone on their journey as a witch named Melanie joins their small party. She hates monsters, so adjusting Mar is a small issue, but her hatred for the dragon overpowers her prejudice.Voice of Cards: The Isle Dragon Roars using cards for everything but its not a traditional deck-building or card-collecting game. It plays more like a traditional JRPG and cards are simply a design choice. And we mean everything is a card. Items, characters, weapons, enemies, environments and everything else that appears in Voice of Cards is represented by a card. Because the game plays like a traditional turn-based RPG the design choice of using cards is interesting but irrelevant to most of the overall gameplay. Its an interesting and unique design choice for sure, and while the artwork on the cards looks great there are particular times where it can hinder the gameplay as it plays like the design choice slows down certain aspects of the game. Theres an optional minigame that can be played in the towns Ash visits, but well let you guess what that entails. The use of cards for everything provides the opportunity for some interesting takes on familiar RPG concepts. The overworld and dungeon maps are composed of face down cards until Ash and company explore the area. The cards are flipped over to reveal mountains, forests, treasure boxes and so on. This approach allows players to uncover the map while sticking with the card motif. The downside is the player can only move one card at a time which makes traveling anywhere slow paced, which is only exacerbated by the rather high encounter rate. Thankfully theres a shortcut where the player can jump across any previously-uncovered area on the map which is a great time saver. But while jumping to save time is recommended, there are other random encounters besides monster fights so exploring the old-fashioned way has its perks. Sometimes Ash will be able to get the jump on an situation for some extra gold or items, but other times he may be the victim of a surprise tornado or falling nuts. Voice of Cards is designed to emulate the feel of playing a tabletop game. Everything is narrated by the Game Master, an unseen voice who guides Ash and company on their journey. The cards are not animated, and all dialogue from every character is spoken by the game master. Most likely this is done to work around a limited budget, but this actually works in creating a sense of playing a tabletop game. Like everything else, dialogue choices and action decisions are done by drawing cards. Like a good tabletop game, sometimes its fun to choose poorly to get entertaining dialogue. But also like good tabletop games sometimes poor choices can lead to the game over screen, though in order for that to happen the player would practically have to deliberately choose the worst possible choice. Despite being composed entirely of cards, Voice of Cards plays like a typical RPG. The player walks around an overworld map and goes into towns and dungeons. During the travels there are random encounters, filled with many hostile monster cards. Battle is traditional turn-based combat. There can be three party members at any time, each of which can have four skill cards equipped. Each turn generates a gem, and aside from basic attacks each action costs a set number of gems. Some attacks can inflict status afflictions, such as a cold attack freezing an enemy for a couple turns if the die roll is high enough. Each character brings something different to table, so the player is encouraged to experiment with different party configurations.Voice of Cards is possibly the easiest JRPG I ever ever played in my life. When trying to think of a game to compare the challenge of Voice of Cards I would say the difficulty is slightly more challenging than watching TV. The combat system has good ideas with how one can strategize different attacks, like freezing a heavy hitting enemy with a lot of health while taking out some pesky cannon fodder grade enemies, but its so easy using any advanced strategy isnt necessary. Curative and buffing items are plentiful but its possible to make it through the game without having to use any of these items and with random treasures to be found its likely to reach the 30 item capacity early on. Theres a difficulty spike at the final boss, but even this fight is comparable at best to a mid-game boss in most other JRPGs. Theres a post game superboss, and while that is the hardest fight in Voice of Cards, its only difficult relative to the rest of this game. Theres potential for strategy, but most battles are so easy there isnt a need to do much experimenting. Voice of Cards: The Isle Dragon Roars is a unique and memorable experience, but the level of enjoyment is based on what someone is looking for. Those looking for a traditional JRPG with a complex combat system, mind-bending puzzles and deep character development would be best served looking elsewhere. Voice of Cards is one of those games where its strength lies in the atmosphere and story. The story begins basic enough but does have enough twists to keep things interesting, with nice moments of depressing terribleness thrown in for good measure. As stated earlier, the basic premise is about as generic as fantasy games come but later turns into something more original and memorable. This is a short game by RPG standards that depending on how thorough one wants to explore can be completed in 10-12 hours. It doesnt overstay its welcome, but the flipside is the characters are interesting and the time with them seems short. As soon as we start to get invested in their situations the game has reached its conclusion, but its better to end wanting more than feeling like it dragged on excessively. Despite offering no challenge, the time with Voice of Cards was enjoyable, so an interesting game world and story can compensate for overly simplistic gameplay.The art direction is one of the strong points of this title, and even though the characters are all presented as static images, they still have lifelike qualities to them. Exploring towns and talking to people unlocks more information in their card collections, so while the game world is small a lot of attention was given to its inhabitants. Keiiche Okabe is among the composers and delivers another memorable soundtrack. The music of Voice of Cards has some distinct Irish flavor to it, but there are a few pieces that are reminiscent of the music in NieR and Drakengard games. On the topic of those games, despite speculation based on some dragon lore, Voice of Cards is not connected to their world. But despite being disconnected, there are DLC packs that include NieR-themed cosmetic items and music. Closing Comments:Voice of Cards: The Isle Dragon Roars isnt truly a card game, but a traditional RPG that uses cards for everything. The aesthetic choice doesnt effect too much outside of the visuals but does give the title a unique identity. The gameplay of Voice of Cards is among the simplest and most straightforward to be seen in RPGs. It may be too simple, as battles end up feeling more like time -consuming chores due to the high encounter rate and lack of challenge or required strategy. But while the simple gameplay may not offer any challenge to RPG vets, the story and fantastic soundtrack help keep the game an enjoyable experience. The relatively short completion time is an asset in this case, making Voice of Cards a great choice when looking for a relaxing game to spend a weekend playing.", "date": "November 1, 2021", "grade": 3.5}