{"name": "The Walking Dead Season 2: Episode 2  A House Divided", "ref": "https://hardcoregamer.com/?post_type=post&p=76961", "text": "The story of Clementine was not yet finished by the end of the first season of The Walking Dead, as the young girl now has to trek through the horribly wrecked world once more, but this time making her own decisions. While the first episode was light on narrative and gameplay mechanics, Telltale is looking to reverse that by introducing far more characters into the story and even bringing back older cast members. As per usual, the episodic nature the San-Rafael studio is well known for has found a home with The Walking Dead franchise, but can Clementine bounce back from a rather disappointing start to a seemingly exciting adventure?The major two issues with the first episode was pacing and keeping a coherent interactive narrative interesting. Its no doubt a difficult task to follow up on one of the best stories of 2012, but the initial take felt more like a simple setup that didnt take many risks than a compelling start to a new story. Portraying Clementine as a young fragile girl who was seemingly alone in the world was done with mixed success, but it was the emotional connections of the other characters that didnt bloom. Thankfully, thats not a problem in the second episode as from start to finish, the story takes you on some of the most incredibly tense and exciting events while digging deeper in the psyches of many of the survivors. While its a relatively short experience, spanning an hour and a half in length, every minute had me on pins and needles, opening up intriguing plot choices and potentially altered conclusions.What the season desperately needed was an antagonist outside of the Walkers, and it would seem weve finally got one. This new individual feels reminiscent of The Governor as the way he takes control of the room and the sheer nonchalant manner he will take a life is disturbing but at the same time somewhat reasonable. The very first scene he appears in is probably one of the most gripping moments the series has seen, making sure you feel uneasy and uncontrollably tense throughout the situation. In addition to his arrival, fans of the series will be happy to know that at the very least one character from 400 Days, the supposed bridge between seasons, makes a debut, along with an unsuspecting appearance by a familiar face. It was a concern that was brought up in the first episode as there wasnt even a hint of that story carrying over, but it would seem now its slowly becoming integrated into Clementines new story.If youre familiar with the gameplay mechanics of the series, not a lot has changed here. In fact, this episode in particular lacks much gameplay interaction at all. The first episode showcased various techniques and quick thinking moments, but unfortunately theyre absent in A House Divided. It almost feels forced the way Telltale has included zombies into the game, as if each episode requires at least one or two short instances of running or fighting with the undead. Normally this isnt a negative notion because zombies do roam the wilderness and are what caused the world to go into disarray, but each instance feels less impactful than the last. It mainly consists of avoiding walkers by pressing a direction or aiming a weapon at their head. There just isnt much thought put into it and feels tacked on, as if they needed to include them just to remind you that zombies are still there.Closing Comments:", "date": "March 4, 2014", "grade": 4.0}