{"name": "Shadowrun: Dragonfall", "ref": "https://hardcoregamer.com/?post_type=post&p=76435", "text": "Last summer, Harebrained Schemes released Shadowrun Returns, an RPG set within the dark, gritty cyberpunk world that tabletop gamers have been enjoying for decades. While many Shadowrun games have come and gone over the years, Returns was the first since the early-90s Super Nintendo/Genesis adaptation to really nail the franchises style, feel and atmosphere. So here we are, some seven months later, and the game is getting its first DLC entitled Dragonfall. Since we raved about Returns upon its launch, our hopes were extremely high going into this expansion. But with great optimism can sometimes come great disappointment. Thus, were left with a simple question: how does Dragonfall ultimately stack up when compared to its predecessor; does it surmount the odds, or get crushed under the weight of heavy expectations?Shadowrun Returns took place in a futuristic Seattle where cloak and dagger were but truth and matter. Pulling on that tried and true granular, dubious atmosphere that epitomizes Shadowrun as a whole, the Seattle setting was no doubt a fun one. Dragonfall, however, takes things east; far east actually, to Berlin. Berlin is much like Seattle in that its moody and, for all intents and purposes, a rundown hellhole of a city. In other words, its the ideal setting for a campaign such as this. Therefore, its Dragonfalls ability to create this kind of entrancing backdrop that is chief among its most commendable accolades. From the opening mission right on till the very end, DF never stops drawing players in with the promise of shady dealings and capital crime. Best still is its capacity to deliver on those promises in spades, giving players a narrative that is every bit as compelling as Returns, effectively enveloping them in a world that is pungent with important choices to make and baddies to trounce. In essence, the game scrupulously builds a world that feels slimy and unpredictable, which translate to an experience that keeps players on their toes yet fully immersed in the expertly fleshed out universe for the length of its 10-15 hour campaign. Certainly if were keeping count, Harebrained is two-for-two when it comes to forging interesting worlds filled with daring-do and the like. To that end, Dragonfall capitalizes on its fascinating, Blade Runner-inspired setting with a story that is equally as appealing, and perhaps even better than the one found in its immediate predecessor. This feat is prominently due to razor-sharp writing and varied characters that feel somehow real despite the very unreal, science-fiction ambiance. It doesnt take long to recognize just how hypnotizing these characters are either, as the opening segment is enough to capture attentions in and of itself. In fact, the introductory hook is even better than SRRs, somehow making folks almost instantly care about the Runners laid out before them. This is significant in that Dragonfall is willing to take narrative turns that many other games arent brazen enough to even try. Meaning to say, the tale being told is one that feels hard to totally foresee and fully unafraid to pull the rug out from underneath players, killing off cast members in a manner that even George R. R. Martin would have to respect. Thats ultimately why the plot is so mesmerizing; players have to decide how much theyre willing to invest in getting to know a particular personality, for it could mean heartbreak later on down the road once the proverbial, and seemingly inevitable, storytelling-axe comes down on them.Speaking of decisions, Dragonfall follows in its older brothers footsteps by presenting players with dialogue choices around practically every corner of the plot. The developers clearly learned that we wanted more decisions than what was given to us in Returns  which was still an impressive amount, mind you  allowing this to feel like an even more tailor-made game. Sometimes those choices dont have a meaningful implication, which is disappointing; however, many decisions made either have prompt or long-term effects, though the former seems more abundant, we should note. While we would have liked our choices to mean something in terms of the big-picture, we were okay with our actions at least showing some kind instant result. There seem to be more choices overall to be made too, many of which feel morally ambiguous in nature. Dialogue trees at large can easily fall into the trinity system of morally sound, grey-area neutral and chaotically evil, yet the options here never feel that cut and dry. This is partly due to the fact that we usually get more than just three scenarios from which to choose, but also due to the nature of Shadowruns world, where staunch morals often lead to a swift and untimely death. Sadly, however, some of the story is given away through these very dialogue trees, as when the box of options is presented to players in the midst of a conversation, choices that arent open to them based off their character archetype and skills are shown nevertheless. Occasionally, these unavailable alternatives indicate what will happen next in the interaction, which can clearly spoil some of the unfolding events and subsequent entertainment. We would have enjoyed it more had those options only been visible to the player if they indeed had the equipped necessary skills to utilize that particular conversation selection.Outside of the story, not much has changed since Shadowrun Returns. We say that optimism, though, as what was given to us in Returns regarding gameplay was rock-solid. Taking that into consideration, then, Dragonfall is a combination of free-form exploration and team-oriented, turn-based tactical-RPG combat. So what that is tantamount to is more of the small, skirmished-based battling of last years game that feels particularly balanced and perfectly challenging. Although the combat encounters are not on par with the depth found in the latest XCOM games, they still offer just enough tactical diversity to keep encounters from ever falling into a slog of a rhythm. The truth is, what made Returns so successful, and now Dragonfall, is the accessibility of the gameplay at large. For specifics, battles go down by way of grid-less maps on which players and the enemy take turns positioning characters. Spending action points will grant movement opportunities as well as attack options, with the bulk of the core strategy existing in how to use the limited number of points in order to maximize combat effectiveness. The battling is fairly straightforward, but rewarding all the same, seemingly less focused on nuanced components and instead emphasizing overall tactics and how to maneuver cleverly. Knowing when to stay low in cover, when to spend a point to reload in the place of attacking and when to perform an all-out blitzkrieg is of the highest importance. This macro-management lends to exciting battles that dont get bogged down in numbers and systems. Certainly, those who thrive off micro-organization will be turned off by this approach, but for the rest of us, the streamlined nature of combat will be a breath of fresh air, enabling us to simply enjoy the game rather than making the whole ordeal feel like a chore to play.Its worth mentioning that, although the core gameplay remains unchanged, there is new content to be seen in Dragonfall. Painting with broad strokes, the new features include weapons, items, enemies, characters and over 60 avatar portraits. But when diving in further, we see that we now have access to a long-range sniper rifle, grenade launcher, or stun-inducing taser for battle purposes, new cyberware as well as new enemies such as gargoyles and fire drakes. Considering the brand new setting and story, this new content is easily enough to make the purchase well feel worth its price tag. Folks can now save anywhere as well, something that wasnt available in Returns upon its launch. Also new is the soundtrack, from composer Sam Powell, who also created the SNES games OST, along with SRRs. In terms of what hasnt changed, the graphics at large are fairly similar to the last game. While the engine is the same, and is hardly capable of producing mouth-watering visuals, the environments really do look great. Character models still leave something to be desired, but at least the color palette overall is yet again bombastically neon and sure to please the eye.Where we have to penalize Dragonfall most, however, is in the technical department. There were times when we would encounter bugs that were at best an inconvenience and at worst maddeningly confusing; maps and quest trackers not updating appropriately, in addition to side-quest completion issues due to key events not triggering at all, just to name a few. There were some other hitches here and there as well, though none of which were profoundly game-breaking, more so just mere nuisances. Still, the encountering of one of these hiccups was frustrating nevertheless. Closing Comments:", "date": "March 2, 2014", "grade": 4.5}