{"name": "Earth Defense Force 2025", "ref": "https://hardcoregamer.com/?post_type=post&p=75992", "text": "It never fails. You just finish rebuilding the planet after a massive B-movie giant robot and insect attack, and a few years later, its Armageddon all over again. Eight years after their near-total eradication at the hands (and epic arsenal) of the EDF, the bugs are back for another run at turning Earth into their newest breeding ground. The EDF hasnt been sitting around luxuriating in a peaceful reverie, though, so while the invaders are swarming thicker than ever and have a number of new forces at their disposal, Earths defenders have tons of new weapons and warrior types to fill out their ranks. Earth Defense Force 2025 is pure third-person shooting action at its finest, bursting at the seams with enemies, weapons, levels, and plenty of room to develop and apply your own personal play style to the carnage.The basics are simple enough- you choose a character class, a couple of weapons to tackle the mission with, get plopped into the middle of a highly destructible city, and go to work cleaning up the overwhelming mass of swarming enemies. Kill all the giant ants, spiders, wasps, robots, and aircraft, dodging enemy fire the entire time, then collect the items they drop to improve your armor and weapon selection. Repeat for the next level, season liberally with pure unfiltered Awesome, and thats 99% of the game. Like all the best arcade action, it only sounds simple. At the missions start youre faced with several choices- character class, weapon loadout, and difficulty, and each option feeds into the other two. The first and most obvious upgrade in EDF 2025 is the character class, bumped to four from EDF 2017s single fighter, Storm 1. His class is the Ranger in EDF 2025, and its the most balanced of the group in terms of mobility and offense. The next returning class is the Wing Diver, which is the updated version of Pale Wing from EDF2 and the Vita version of EDF3. Shes the fastest of the lot with the lowest armor, the only one who can fly, and her weapons and abilities tend to draw from an energy reserve rather than regular ammo. On the one hand this means short reloading times, but if you drain all her energy shes defenseless until it completely regenerates. The Air Raider is a support class, and while hes not designed to wade into the thick of things like the other classes he plays the most tactical game of the bunch with the ability to summon vehicles and defensive turrets. Finally, the Fencer is giant, slow, and brutal, capable of dealing more damage before breakfast than most space marines do in a trilogy. He can equip four items at once, including shields and deadly melee weapons, but the walking speed of the unit means you need to work some tricks on his dash ability (which isnt supposed to be used quite like that) in order to cover ground at anything resembling a decent speed.Once youve chosen your character its time to pick some weapons, and there are eventually so many to choose from that every new level is an opportunity to experiment with the loadout and try new tactics. Most of my time was spent with the Wing Diver, because flying is so much fun its impossible to resist, and her weapons come in short, medium, long, and sniper range, plus explosive, homing, and special. In one level you might experiment with a lightning shotgun and balance its power with a low-damage, high-speed homing laser. Its great for clearing out swarms of bugs in close tunnels, while the explosive impact of the laser (I know!) cleans up in the open caverns. Next level could be a plasma ball that does heavy damage but its explosive radius will kill you in a single shot if youre not careful to keep your distance from the target, balanced with an ultra-short range multi-pronged laser that does only a little damage per hit but it accumulates multiple times per second per laser prong. Not all weapons are equally useful, of course, and many may seem just this side of completely useless, but one mans useless is anothers tactical limitation to compensate for. Even when you find a favorite pair of guns, though, its hard to stick with them, because new weapons come along almost every level and who can resist taking the new toys out for a spin? Eventually the temptation to dip into the high end of the weapon spectrum will be too much to resist, and this is where the difficulty level comes in. Playing on Normal is pretty safe, with death being unlikely early on and relatively easy to avoid with a bit of care in the later levels, so long as youre diligent about picking up the Armor drops to increase your maximum health. New weapons come along at a decent speed, giving deadlier firepower at a pace to match the increased enemy count, but why wait when you can jump the gun, so to speak? The difficulty levels determine which weapons might drop in a level, so replaying level 1 on Hard can do nice things for your armory, if you can survive. Getting bitten by a giant ant in Normal is no big deal. Getting bitten by one in Hard without the benefits of vastly increased health? Thats less likely to be shaken off, so play has to be either much more conservative or you need to team up with friends. EDF 2025 finally brings the series into the internet age, and has full online support for up to four players at once, while also retaining the split-screen action for a nice round of couch co-op. The action, of course, is the heart of the game, and if youve played EDF 2017 youll be right at home.An average mission doesnt tend to take too long. A series of enemy swarms requires you to zip from place to place on an open-world battlefield, usually set in the middle of a city but sometimes in the countryside, at the ocean, or in underground tunnels. The popcorn enemies that swarm by the dozens are about the size of an average 18-wheeler, and thats just the starting point for things getting out of hand. Giant ants swarm buildings, spiders cast webs between skyscrapers, enormous gleaming silver spacecraft open their hatches to drop dozens of insects onto the battlefield, and the giant Hector robots stomp through town flattening anything in their way while their cannon-arms rain plasma death onto the battlefield. The reason the weapon selection is so important is because the enemy is so utterly overwhelming in numbers, size, and power. The right gun is the difference between frantically dodging while hoping you can make due, and distributing hot laser judgement into a Hector and seeing its explosive death throes blanket the sky in fire. Closing Comments:", "date": "February 26, 2014", "grade": 4.5}