{"name": "Inazuma Eleven", "ref": "https://hardcoregamer.com/?post_type=post&p=75215", "text": "Soccer has never been the most popular sport in North America. Now that were starting to give the beautiful game the attention it deserves, however, and the 2014 World Cup set to kick off in Brazil this June, Nintendo has finally given us a taste of Inazuma Eleven, Level-5s soccer RPG series that has flourished in Europe and Japan. Released as a 3DS eShop exclusive, the game is a port of the original DS title released in Europe in 2011.Inazuma Eleven puts you in the boots of goalkeeper Mark Evans as he captains the Raimon Junior High School soccer club on their journey to the National Championships. Its a fairly typical tale of hard work and accomplishment, but even though the plot is largely predictable, it retains a potent sense of charm that wont be lost on players of any age. That said, the game is clearly geared towards the younger crowd, from its junior high school premise to the bubbly dialogue and voice acting.It may be an RPG, but Inazuma Eleven replaces typical combat with a unique interpretation of the glorious game of soccer. Using your stylus to position and move your players, you draw paths for passing and intercepting with the kind of precision that simply wouldnt be possible with button controls, and it feels intuitive if not completely polished. The schools you compete against each have their own theme or quirk, like the ghostly Occult Junior High School or the feral Wild Junior High School, and it really contributes to the exaggerated anime vibe seen throughout the game.Head to head battles are where things get interesting. Contact with an opposing player pauses the action and produces a set of situation-specific options, such as slidetackle, block, chip shot, or feint. One move is more likely to succeed during each situation, so its up to you to decide what the proper course of action is. Choosing wrong will result in a loss of possession, and send your players running back on defense, but the right choice will leave your opponent reeling and you with a significant advantage as you sprint towards goal.But those are all moves youd find in any soccer game, and Inazuma Eleven isnt about being normal. Thats why youre also given the option of using a Special Move, the most over-the-top and brilliantly unrealistic soccer techniques youll ever see. Many involve great feats of acrobatics, while others utilize magic or the elements, but they all add a wonderfully outrageous variety to the already spectacular game of soccer, emphasizing Inazuma Elevens anime style superbly. Using a move costs Technical Points, which can only be replenished after each game, so you have to be strategic in your implementation. From early on, however, Special Moves seem to be the only way to actually score a goal against decent teams, which became slightly frustrating after I saw my perfectly placed normal shots saved repeatedly by out of position goalkeepers. That said, the emphasis is obviously on exaggerated and satisfying blasts at goal, so its only a small complaint. Besides, regardless of how you do it, seeing the ball bulge the net is a terrific feeling, especially after a particularly graceful buildup.Off the pitch, its basic RPG fare; players are guided around school and various locations in town, acquiring items and randomly encountering rival teams, who you play in a smaller 4v4 setup. These games are designed to be quick affairs, with a short time limit and a specific challenge such as score the first goal or win the ball from the other team. Winning these scrimmages gains you both Prestige and Friendship points, which can be used throughout the game. You also gain experience for the players you sent on the pitch, and every few levels a new special move is unlocked. Players attributes grow with their levels, but there are also dedicated areas throughout the game that raise specific attributes in exchange for Prestige points. But instead of a training minigames, all were given in these areas is a short cutscene of the player practicing some drills, and it feels like a real missed opportunity. Overall, the exploration aspect doesnt do anything groundbreaking, but its streamlined and solid enough where it doesnt hamper the overall experience too much.Where Inazuma Eleven shines, however, is in its potential for customization. The game features over 1000 unique players, so theres plenty of room for constructing a team perfectly suited to your play style and preferences. Scouting is handled by your team manager, who provides a handy Connection Map detailing the friendships you must forge before more powerful players become available. You can spend your Friendship points to open up paths to a certain point, but prior connections are needed before the best players are accessible. Collecting the most skilled athletes and building an unbeatable team is made even more important by the addition of local multiplayer battles, which pit you against a friend in an 11v11 match. But its not all competitive; you can also trade players with friends over local wireless, but with every game containing the same players this isnt a crucial feature. However, its worth noting that this is the first game in the series, and that subsequent European entries have utilized Pokemon-style version variety, emphasizing the collection and trading of players.Closing CommentsInazuma Eleven is an accessible RPG that does a nice job of explaining its nuances and tactics early on. It offers a unique blend of addictive collectivity and anime-style soccer action that culminates in an enjoyable and decently long experience. This is a solid debut for the franchise in North America and, at $19.99, an easy recommendation for RPG and soccer fans alike.", "date": "February 20, 2014", "grade": 4.0}