{"name": "Line of Defense Tactics: Tactical Advantage", "ref": "https://hardcoregamer.com/?post_type=post&p=74706", "text": "Theres been a growing trend of porting mobile games to more traditional gaming platforms and severely inflating the price. One of the worst examples was Angry Birds Star Wars, which was $50 on Xbox One and PS4 despite being $0.99 on phones, but there are certainly others. Steam is filled with ports of mobile games priced 2x higher or more than their phone and tablet based counterparts. A recent example of this business strategy is Line of Defense Tactics: Tactical Advantage, a game which is free on iOS and Android (with in-app purchases), but is currently listed at a price of $25 on Steam. Of course, if a game is good enough price sort of becomes irrelevant, and gamers are usually willing to pay a premium for a high quality experience. The problem here is that Line of Defense Tactics is far from good enough to justify pretty much any asking price.Line of Defense Tactics is a squad based real time strategy game that heavily evokes XCOM: Enemy Unknown. Though differing from that games turn based gameplay, the reliance on a handful of soldiers rather than large armies put it much more in line with the scale of that game than a typical real time strategy title. The game consists of 16 missions which your squad of four soldiers must undertake. Once you get into the game, the first problem youll come across is the way it controls. Its very clear that this game was originally designed for touch devices, and the transition to keyboard and mouse hasnt been kind.When youre dealing with a real time game that involves controlling multiple units, its essential to be able to easily select and command the units you want on the fly, and in this regard LOD Tactics utterly fails. You can basically only select a single unit or all at once, with no room in between. Youd think itd be as simple as clicking and dragging to paint the units you want to control, but clicking and dragging pans the camera, almost like you were swiping the screen. The game is also extremely finicky about when youre selecting a character and when youre targeting them, and its wildly inconsistent. Sometimes clicking a character selects them, while other time it wants you to have the character that was previously selected interact with them. Sometimes clicking their portraits gives you a command menu, and sometimes it doesnt. Nothing is consistent, and giving commands to specific characters is far more trouble than its worth, so more often than not youll find yourself just giving commands to everyone at once.If the missions and levels were smartly designed, just sending all your units together all the time would likely result in quick deaths, but of course the missions and levels arent smartly designed. No, you can pretty much get through any mission by simply clicking on enemies and attacking with your entire squad. There is some depth, like a cover mechanic, secondary and primary weapons, and multiple types of equipment and character specialization, but most of it seems entirely unnecessary. The ability to level your squad members and outfit them as you choose is a nice feature, it just doesnt feel very meaningful to the gameplay. Despite ostensibly being a strategy game, the gameplay more closely resembles something like Diablo when really all you find yourself doing is clicking on enemies until they die.There are some times when things are mixed up a bit, like missions that give you control of a space ship or ground vehicle, but they too just amount to clicking on enemies. Though with the ground vehicle in particular, for some reason it doesnt respond to your move all command, so you have to select it separately from the rest of your units to command it, adding yet another layer of annoyance to the already cumbersome squad commands. The actual objectives you find yourself being tasked with during missions can vary somewhat on the surface, but in essence every mission simply amounts to moving your squad through a linear environment and killing anything that gets in your way. This wouldnt be an issue if there was some deep strategic gameplay here, but the whole thing feels mindless. Closing Comments", "date": "February 17, 2014", "grade": 1.5}