{"name": "NaissanceE", "ref": "https://hardcoregamer.com/?post_type=post&p=74625", "text": "Naissance is a French word for birth, or to be born. NaissanceE is a game by Limasse Five which explores the concept of beginning in an unique way. Although the gameplay is a familiar dose of platforming and puzzles, there seems to be much more lurking under the surface. Players will likely find the four or five hours they spend with the game more of an experience than anything else. But is it worth undertaking? Thats not an answer that I can provide, as NaissanceE is the type of title that will enrapture some and annoy others. With that said, members of the latter group may benefit from playing things outside their comfort zone.The game begins quite suddenly. Lucy is Lost is the only text on screen which quickly fades away. Beyond the chapter titles, there is no other written or verbal language to push players along. Lucy may be lost, but the players are equally so. It may not be a birth in typical terms but it sure feels like the player has been brought into a brand new, and sometimes frightening, world. It almost seems familiar at times, but at other times it becomes completely alien. Perhaps the otherworldly vibe stems from the art style.Everything in NaissanceE is devoid of textures. Instead, the world is comprised of flat colored geometric shapes which are organized in such a way to be architecturally sound. For most of the game, everything also comes in shades of white or black, sometimes with touches of other colors. Shadows strobe over white floors and walls while pinpoints of light shine through the darkness. Eventually, a smidge of color is added but there still arent textures to speak of. Visually, the developer has created a stark, minimalist landscape ripe for exploration.Without any obvious quests to complete, youre free to venture into the weird territory and have goals reveal themselves to you. For example, you may not know where to go next until stumbling upon a nearly hidden stairwell. Other times you can simply see glowing objects in the distance which practically begs one to inspect them up close. There are many moments where the player must make their way through platforming sections to get somewhere new. Platforming feels downright frightening as you often do so high above the ground. Its quite a rare emotion for platformers to pull out of players. Usually, platformers are better paired with rage.Unfortunately, NaissanceE falls into this category at times as well. A big part of the experience is exploration and sometimes that leads to death, or getting yourself stuck somewhere with no way out. This wouldnt be such a big deal if the games checkpoint system were friendlier. As it stands, the checkpoints feel too spaced out. Imagine hating a certain platforming section but finally beating it only to die in some silly way a little bit afterwards. Youll likely have to do the section all over again because of poor checkpointing. There is no manual save option which means you are entirely dependent on checkpoints.A less annoying (usually) aspect of the game is its puzzles. This isnt Myst or even Antichamber, which are both games with fairly well thought out and sometimes elaborate puzzles. Thats not to say the puzzles here are completely simplistic, but theyre easier to comprehend. If you cant figure out what to do then simply employ the classic method of guess and check. Itll work eventually! Just be aware that the game also enjoys messing with people. There are a handful of occasions where objects and areas serve purely as red herrings.What may be the greatest aspect of this game is the act of exploring the unusual environment. Simply looking at the world reveals astonishing architecture. Symmetrically, geometric buildings and hallways all have a beauty to them. Although a playthrough can take as little as two or three hours if you are aware of what to do, a sightseeing gamer might spend seven or more hours playing. Its rare to see games that make smart use of architecture and NaissanceE definitely nails it. The music also plays a big role of fleshing out the games feel. Sometimes non-exist and other times ambient, the soundtrack almost perfectly mimics the world it inhabits.The main problem with the adventure might just be its attempts to become more of a standard game. Puzzles and platforming can both annoy due to mistakes. The precision sometimes required of the latter segments make each death crueler, as there is no need for the game to oppose player progression. When the strength of the experience lies specifically with exploration it feels wrong the penalize the player for doing exactly that. Of course, the infrequent checkpoints add insult to injury.Closing Comments:NaissanceE was a game that I fell in and out of love with while playing. When first introduced to the industrial architecture, it seemed like such a cool landscape. It was only once more standard gameplay elements wedged themselves in that my excitement faltered or turned sour. Great moments simply getting to know the world were cut short whenever a new puzzle or platforming bit would rear its cumbersome head. With that said, there is still worth in playing through NaissanceE to see the moments it gets everything absolutely perfect.", "date": "February 16, 2014", "grade": 3.5}