{"name": "Strike Vector", "ref": "https://hardcoregamer.com/?post_type=post&p=73834", "text": "I dont want to talk about Strike Vector, in much the same way Im not inclined to talk about half the years I was in high school. Most of the stories I can tell you are all brutal, one-sided, and thoroughly embarrassing. I like to think of myself as a decent gamer, but Strike Vector has done its best to obliterate that self-image. Half the time I could barely manage a single kill in a game, and thats when I was doing well. Yet somehow, I always found myself in the middle of the scoreboard, simply by virtue of not being wholly incompetent.Strike Vector might well be the fastest shooter Ive ever played. Thats to be expected given that the game straps you into a transforming jet, but beyond the general speed of movement (and all the challenges of aiming at high-speed targets), Im referring to the pace of the game. With almost no health to speak of you can die within seconds of spawning, and without any respawn cooldowns, you can be back in the match just as quickly. This presents players with plenty of opportunities to learn and improve, or, in my case, to die, and then die, and then die some more.The first way any player is likely to die is by crashing (or, as the game mockingly puts it, CRAAAAAAAAAAASHing). Thats the sort of thing that happens when youre rocketing around a maze of industrial crap at sub-sonic speeds. When you crash or get shot down, you burn out and start spiraling out of control. You can still steer your ship like this, into an enemy pilot if youre lucky. The game penalizes you heavily for crashing into the scenery (or high-fiving other pilots, for that matter), as each crash is deducted from your kill count (if you manage to get any kills at all) and takes 75 points off your score. In team death match, this counts against your entire team, meaning that sufficiently bad players can drag your entire team down beyond simply acting as cannon fodder. With so many scores in the negative, my middle-of-the-board zero looked comparatively respectable.In order to avoid crashing, you need to learn to use your hovering harrier mode effectively. This can be triggered at any point using the spacebar. Harrier mode allows you to make a hard stop and quickly course correct, or turn around and face any enemies who might be in pursuit. When hovering, you can take aim far more easily, and use a zoom function to snipe enemies from afar. Of course, youre something of a sitting duck when you do that, so you have to strike a balance between staying mobile and actually being able to aim. On the whole, the movement mechanics are quite satisfying once you get the hang of them.The game allows you to customize your ship at any time youre not flying it. You can outfit your Vector with two weapons at a time, choosing from a range of missiles and guns. You also have a choice of special equipment, ranging from mines to cloaking devices to booster rockets. On top of that, youre granted a single augmentation that enhances your movement speed or zoom function. And naturally, you can also customize the look of your ship with different aesthetic parts and color schemes. All of these combinations seem to be reasonably balanced, in the sense that I couldnt find a single one that allowed me to reliably rack up kills.Like any good multiplayer game, Strike Vector has a cavernous skill ceiling. The trouble is that it also has a very high skill floor, and you will crash into that floor A LOT. Just flying around long enough to get killed can take practice, and while a few bad players can drag down a match, a single good one can utterly dominate it. I found it was the rule, rather than the exception, to see a one or two players with a massive score while everyone else in the game was sitting at 2 or less. And youre forced into matches with that kind of skill gulf because oftentimes theyre the only people playing.If you can actually manage to break through the skill floor, youll find yourself faced with a decent variety of maps and match types. Deathmatch modes are self-explanatory, whereas Domination essentially amounts to your standard capture the hill. The most interesting mode is Bounty Hunter, a sort of free-for-all where killing enemies and grabbing cash puts a bounty on your head, and the player with the most money at the end of the round wins. Bounty Hunter is fun because its not purely based on your K/D ratio, and matches can turn around quickly with a well-timed kill.The maps have a nice variety to them, with a good balance of horizontal and vertical layouts. Pretty much all of the architecture is industrial, and the game overall has a sort of redneck vibe going. The music is all guitar-heavy rock and roll, and most paint patterns for ships are some variation of camo or zebra stripes. Strike Vector seems to be trying its hardest to look garish, but while its a mostly sin-ugly game, theres no denying the striking nature of a gargantuan industrial complex looming through thick smog, or a sunset glinting off the rim of an orbital platform.Closing Comments:", "date": "February 11, 2014", "grade": 3.0}