{"name": "Neptunia x Senran Kagura: Ninja Wars", "ref": "https://hardcoregamer.com/?post_type=post&p=413359", "text": "The Hyperdimension Neptunia games have delivered some of the funniest action RPG action in many years, while the Senran Kagura series has gained fame via both its anime and multitude of gaming formats  from action-heavy games to pinball. Despite each being highly-regarded in their own way, they never crossed over until now  when the universes of both worlds come together and some robot ninjas invade the world too. With the multitude of genres weve seen both franchises in, from tactical and action RPGs to shooters, it was probably wise to go with a third-person action game mixed with a visual novel.This blend allows the strong writing of the Neptunia series to shine as it always does for story and character moments while still showcasing the cast of Senran Kagura thats likely more well-known from the anime adaptation than the games themselves. Its interesting to see both franchises come together as theyre completely different in tone, with Senran being more serious and the Neptunia world being goofier. The two franchises casts come together to deal with The Steeme Legions invasion and its impressive to see how well each franchise fits in with the other. In execution, the tone fits together as well as peanut butter and jelly, resulting in amusing dialogue most of the time.The mix of fast action and slower-paced visual novel is something that may not work for everyone, but winds up working out thanks to each genre being done so well. The action RPG aspect of things is a lot of fun and enables players to pick two characters to bring into battle for a dungeon. This essentially gives the player two lives to work with through the entire dungeon  not factoring in being able to use healing items throughout and grab from chests throughout the dungeon. While it can be tricky to get items in some action RPGs due to convoluted maps, Neptunia x Senran Kagura makes it easy with an efficient overhead map design and a basic structure to the dungeon layouts. Exclamation points show the player the next major battle on the map and that helps make it easy to figure out where you are in relation to item boxes or major battles. Some major battles showcase single large enemies and several lower-tier enemies and others are just a large horde mode-style battle. Each has their own strategy because just tackling a slew of goons is easy. Combat allows players to lock-on or you can just slice and shoot through foes that are close together and take out several enemies at once. Short-range combat meshes well with long-range combat, although players will be largely using melee combat as thats unlimited while longer-range attacks are meter-limited. This can come in handy, though, as it prevents combat from getting stale by mixing up the two combat types and blending them in with elemental attacks. Short-range attacks lead to combos that can either be started off with long-range attacks or using the long-range attack to start a daisy chain of short-range attacks.Each character has their own weapons, but generally players want to stay close and then dart around with the right trigger to run around the battlefield or just dart out of attack paths with a quick trigger press. Bumpers let players choose between meter-limited elemental attacks that deal out a ton of damage and can be fantastic for clearing out a sea of foes in a smaller area. One downside to battle areas being small is that the right stick-controlled camera can get stuck from time to time and while its no big issue against smaller foes that do little damage, it can be troublesome during boss battles. Those battles feature foes that can deal out a ton of damage in short order and losing track of where bosses are, let alone their goons, can result in either taking on too much damage before you can heal up or the death of a character.Thankfully, the camera works well 95% of the time and as long as the player avoids walls and corner areas, it shouldnt be an issue. The core combat loop is fun, but the game does lean too heavily on just throwing more enemies at the player in a way that comes off as filler. Players can take out three or four waves of a single enemy type to unlock the next area and theres no good reason that couldnt be done in just one wave beyond just padding out the runtime. Its a shame that this is done because it then takes longer than it should to get to the story portions of things, which are hilarious. The sharp writing allows those parts of the game to work well and players can skip through them if they want, have auto-playback or view the images without any text at all  so theres a lot of variety with how one consumes the story-based content. Visually, Neptunia x Senran Kagura looks about on-par with most other modern-day Neptunia games. It has solid-looking character models and lush animation when needed, but does suffer when it comes to environments. Theres a feeling of sameness in many of them due to the usage of similar-looking assets throughout and if it wasnt for the excellent overhead map, it would be easy to get lost if the dungeons were bigger. The core visual novel artwork is excellent and on-par with whats used in the anime productions for both franchises and despite each having different tones, the art style is consistent between the two.Audio-wise, the soundtrack is peppy and the Japanese voice work paired with subtitled text works well. The text is large and moves along at a clip in-pace with the voice acting and can be skipped or sped up as needed. I wouldnt recommend skipping the text, but skipping until the end of a characters statement is usually okay as these sections can go on for over ten minutes at a time and wont be for everyone. The soundtracks rock-heavy nature works well and its got a lot of energy to it, which is right in line with how it should be for something using two anime franchises in it. Closing Comments:Neptunia x Senran Kagura: Ninja Wars is a good action RPG when it comes to delivering fun, but is lacking in overall depth. While combat has short and long-range attacks alongside dashing and even elemental attacks, every battle largely plays out in a similar way. There isnt enough of a combo system at play to truly make things feel rewarding when you string things together and it can lead to the game getting longer in the tooth earlier than it should. The visual novel portions are good and offer a change in pace, but feature limited animation and come off as low-rent as a result. That holds true for the similar texture work in a lot of environments, which doesnt do justice to the impressive character models used and the solid animation across the board. For fans of either franchise, theres a good amount of content here to enjoy, but this isnt the kind of game that is likely to make new fans of either series on its own.", "date": "October 29, 2021", "grade": 3.0}