{"name": "Outlast (PS4)", "ref": "https://hardcoregamer.com/?post_type=post&p=73203", "text": "In recent years, the survival horror genre has taken two very distinct paths. The big budget AAA industry has largely moved away from the genre, but the games that remain are more or less action games with horror themes. Games like Resident Evil 6 and the Dead Space games are action through and through, featuring little to no actual survival elements, and the same can be said for most AAA horror titles. The indie horror scene, however, has gone in pretty much the exact opposite direction. The majority of indie horror games dont have any combat at all, instead focusing squarely on survival and providing the player with frightening imagery and genuine scares. Among these indie horror games is Outlast, which was a minor phenomenon on PC last fall and now makes it way to the PlayStation 4.Outlast stars Miles Upshur, a journalist investigating a psychiatric institution being run by a corrupt organization he has been looking into. Upon arriving at the facility late at night, he ventures in to find out why an organization like this would be interested in a mental institution and what unethical things may be going on inside. Once inside, he immediately discovers far more than he bargained for, and finding answers soon becomes secondary to getting out alive. As Miles you must make your way through the asylum and avoid the many disturbed individuals that want you dead.Like many indie horror games, Outlast doesnt have any combat mechanics. You have no means of defending yourself, but instead must either avoid or evade any enemies you happen to come across. Most sequences give you some room to sneak by enemies and avoid detection, while other times youre forced to run away from pursuers. While the game does encourage sneaking and going unnoticed, it doesnt have a whole of what youd typically think of as stealth mechanics. It simply boils down to not being seen, and other than crawling or hiding under beds and in lockers, the game doesnt give you many tools to facilitate this. All the stealth sort of feels half baked, not nearly as in depth as youd find in games that revolve around stealth but more like what youd find in action games that have a stealth mission or two. The stealth can certainly be very tense, but more often than not it gets boring as you study enemy patrol patterns and crawl slowly from cover to cover.When not sneaking by enemies, youre running from them. Whether this means youve been detected or youre in one of the many scripted chase sequences, your only option here is to run until you break line of sight and then hide in a locker or under a bed. There are certainly times when these sequences are thrilling, but quite often they devolve into trial and error. The problem with the chase sequences is that any mistake results in your death, so unless you know the exact path to take and which doors are locked and which are open, youre likely going to mess up and be killed. This keeps the stakes high, but dying because you didnt randomly guess which of the six doors in the hallway was unlocked feels more than a little cheap. Whether youre sneaking or fleeing, Outlast is at its weakest when enemies are involved, but luckily the other aspects of the game fare much betterWhile actual encounters with enemies are rarely very engaging, the threat of enemies combined with your characters lack of offensive capabilities creates a great feeling of tension and unease as you explore the asylum. Outlast is actually more frightening when you arent dealing with enemies directly, as the lingering threat of death is much more tense than directly facing it. As is often the case, worrying and stressing over when the next threat may emerge is much more terrifying than actually dealing with the threat, and that is just one of the ways Outlast creates a fantastic atmosphere. The constant threat of death combined with great art direction, evocative music, and a strong commitment to the first person perspective give Outlast an incredibly realized creepy atmosphere for you to inhabit.Playing from a first person perspective is something most gamers are intimately familiar with, but very few games truly commit to this perspective. In most games you may as well be controlling a floating gun or sword, but Outlast does a fantastic job of making you truly feel like you are inhabiting Miles Upshur. Miles doesnt have a gun or sword, but a camera, which is used to help you see in the dark. The way the camera subtly moves as you make your way through the asylum in addition to some very convincing animations and small touches like the character reaching out to touch walls when you get close all contribute to the feeling that you really are seeing through the eyes of this character. The video camera represents the most game-y aspect of Outlast as you have to find batteries to power the cameras night-vision mode, but its not so absurd that it takes you out of the experience.Whether or not a game is scary usually depends on the person, and Outlast is no exception. If youre someone that is never scared by games, this wont be any different, but it does some interesting things. Many games lean on jump scares as the main means of fright, but Outlast doesnt actually have all that many jump scares. There is one excellent example early in the game and a few scattered throughout, but other than that the game mostly aims to create a feeling of unease rather than big scares. This is probably to the games benefit, and the disturbing imagery, creepy dialogue, and feeling of fragility create an atmosphere of horror that doesnt feel as cheap as constant jump scares.Performance wise, the PlayStation 4 version of Outlast is a great port. The game runs at 1080p and keeps a consistently high frame rate with only occasional and very brief dips. It looks quite good, with the lighting in particular standing out as a high point of the visuals. In terms of Playstation 4 features, the touchpad is used to zoom the camera in and out, which works fine, but no better than d-pad. One minor gripe is that the light bar on DualShock 4 can sort of undermine the atmosphere if its lighting up an otherwise dark playing environment, but thats more an issue with there still being no way to turn it off rather than a problem with this port.Closing Comments:", "date": "February 6, 2014", "grade": 3.5}