{"name": "Dragon Ball Z: Battle of Z", "ref": "https://hardcoregamer.com/?post_type=post&p=72970", "text": "Theres a scene in the Dragon Ball Z anime where villain-turned-hero Vegeta is about to fight baddie Majin Buu, only to be stopped by his young son Trunks and his friend Goten. Trunks encourages Vegeta not to go into the battle alone, and to instead let him and Goten help in the fight. He says to Vegeta well gang up on him. Vegeta pauses before knocking both young boys unconscious and telling onlooker Piccolo to get himself and the boys to safety. Vegeta wants to fight solo with no holds barred, all without having to worry about seeing Trunks and Goten hurt in the fight. This one scene from the anime illustrates everything that is wrong with the most recent DBZ video game, Battle of Z, a team-based fighter that ignores the exciting appeal of Dragon Ball Z, while also being one of the worst games to use the franchise in years.Dragon Ball Z: Battle of Z follows the long-tread, Akira Toriyama-penned story of Son Goku, a Saiyan warrior who is out to protect Earth from aliens, androids and giant monsters. Along the way, he earns himself his trademark group of rivals and allies, like fellow Saiyan Vegeta, son Gohan, long-time friend Krillin and so on. Its one of the pioneers of the shonen manga genre and one of the most iconic anime properties of all time. Its exciting martial arts theme mixed with an action-packed style of energy bursts and melee combos show a game thats destined to revel in the over-the-top nature of the video game medium, but despite the series best efforts, it hasnt reached as functional a level in gaming since 2004s DBZ: Budokai 3.Battle of Z tries to mix up the DBZ fighting game formula by focusing on a team mechanic. Every battle features more than a single fighter, with the most common team being that of four warriors. The four characters fight another team of four characters and the battles on. As the first DBZ game to have this much of a focus on team play, this is certainly admirable, but practically every issue that Battle of Z has is related to this completely unneeded team mechanic.The combat uses a lock-on system, very similar to the Budokai Tenkaichi games on PS2 and Wii. You can hone your attacks in on an enemy and focus all of your energy toward a single target. While thats a respectable inclusion in a one-on-one fight, Battle of Zs massive fights simply do not function under these conditions. Right when youre focusing your stamina on one fighter, a massive energy blast will come out of nowhere, wrecking your combo without any notice. Due to how the camera functions, you cannot see the entire arena (aside from a paltry radar), so theres no way to see when youre about to be blasted from across the stage before its too late.This frantic free-for-all vibe has more in common with Super Smash Bros. than any traditional fighter, but the difference there is that, in Smash Bros.,you always know where every character is on the battlefield. You can get a clear view at all times, while in Battle of Z, the camera comes in so incredibly close that any battle is game of praying that you wont be Kamehamehad to the other side of the map by some sniping jerk hovering above you. The lock-on doesnt make things any easier, since the camera jerks around like its glued to a tilt-a-whirl, while getting stuck on objects and obscuring your target. The entire battle system is flawed from beginning to end, and its really all thanks to this unneeded multi-fighter mechanic.The team mechanic is also wrecked due to how each battle is structured, especially in the terrible single-player. Beyond navigating some of the most convoluted menus youll ever see in a fighting game, the single-player mode follows the main sagas of the anime, but with a number of twists. Many of the one-on-one battles in the anime are now re-scripted to accommodate for team battles (such as Krillin now being Gokus wingman instead of Piccolo against the first fight with Raditz), with some being downright warped beyond legitimacy, like the battle with Frieza, where everyone is still on Planet Namek five minutes before the planets explosion.This story change isnt necessarily an issue, but having to babysit your AI teammates is. Each mission has a number of retries, where if a fighter falls before another combatant revives them, they get to retry for another go. When all the retries are gone and a combatant dies, the mission is failed. The problem is that your allies count toward the retries too. If they die too many times, its over, which means that in order to keep the fight going, you must revive them whenever possible. This problem is exacerbated with the deficient camera and multi-fighter arena, where youre likely to be smacked out of the sky by an energy blast while dashing over to your opponent to revive them (fun fact: your allies rarely revive you when youre down).And while this battle system is certainly bad, to make matters even worse, the combat is downright repetitive. Many single-player missions give you a marathon of cookie-cutter enemies to defeat. Thats bad enough, but the combat itself is extremely bland. Basic, one-button melee combos and very few special attacks make every battle completely uninteresting. Teammates can juggle enemies back and forth for extra damage with Meteor Chains or unleash powerful barrages of attacks with Synchro Rush, but these attacks are so devoid of personality, especially when compared to the neutered movelists for characters. Sure, you get a ton of characters and transformed fighters to choose from, but its downright laughable to see such barren movelists compared to games like Soul Calibur or even DBZ: Budokai 3 on PS2. Its so bland and so monotonous that you might as well skip the single-player.But you cant, because you need to unlock the characters for multiplayer, which quite frankly, shouldve been the golden moment for this games concept. CPU partners are idiots, but actual human beings shouldnt be. Battle of Z brings co-op and battle modes for online matches only. While its disappointing to see a lack of local play, considering this games already bad camera and controls, youre bound to have a better time with a screen all to yourself. The online play is competent with human beings on board, but that cant be said for the network infrastructure. There is lag everywhere. Each battle will feature frequent lockups for at least five seconds before getting its act together, while some battles will abruptly end for no reason at all. Combined with the amount of time it takes to even get into a match, this is a mess of catastrophic proportions. The online play in Battle of Z is broken. It simply doesnt work.And all of these gameplay problems intrude upon a game that actually looks and sounds really good. This is how you design the art and sound in a DBZ game. The cel-shaded graphic style returns, better than ever, with touches of high-definition effects in all the right places. Even the scenery has some effects of manga-style art, making the whole game pop. Battle of Zs art style can be considered a mix of the cel-manga design in Budokai 3 for PS2 with the vibrant lighting and energy effects seen in Burst Limit on PS3.Animations are a little goofy at times, but they certainly capture the feel of the anime. The sound is even better with both English and Japanese voice tracks. Sean Schemmel reprises his role as Goku with the typical Funimation crowd keeping pace, and while its certainly different from Gokus Japanese VA Masako Nozawa, both are still great to hear. The music stays enthusiastic with rock guitars and a nice Japanese intro theme at startup.Closing Comments:Dragon Ball Z: Battle of Zs team-based mechanic is what ruins nearly every bit of it. From the unmanageable combat views to the constant babysitting of AI companions, every promising aspect is soured by this forced and unnecessary gameplay inclusion. Missions are repetitive, combat is monotonous, story is confusing, online play doesnt work, and every promising bit of DBZ fan service is buried under hours of tedious character unlocking. The game is gorgeous and the level of commitment to evolution of the DBZ fighting standard is respectable, but like that anime scene with Vegeta fighting alone, its apparent that DBZ was never about that mob identity where four characters wail on an enemy. Dragon Ball Z is at its best when its a one-on-one showdown, good vs. evil, rival vs. rival. It shows that intensity of squaring off against a long-time adversary, not some crowd of spiky haired goofballs sniping at each other with energy blasts from the air. Not even the inclusion of Super Saiyan God Form Goku from the newest DBZ movie makes any difference. Dragon Ball Z: Battle of Z couldve been a decent DBZ game, but that shoehorned team mechanic instead makes it one of the worst. Avoid this game like you would a Galick Gun to the face.", "date": "on February 5, 2014", "grade": 1.5}