{"name": "GhostControl Inc.", "ref": "https://hardcoregamer.com/?post_type=post&p=72830", "text": "There is a part of me that wants, desperately, to love GhostControl Inc. without reservation. Its the Ghostbusters game that always needed to happen  one part ghost catching action, one part business simulation. Of course, that doesnt sell to publishers quite as easily as Gears of War clone with ghosts, so it was left to fans to make it. German indie studio Bumblebee Games have brought some great ideas to the fore in making their off-brand paranormal pest-control simulator, but its held back by some baffling design choices and painfully obvious budget constraints.The basic setup of GhostControl Inc. is fairly straightforward. You manage a team of controllers out of a small garage in central London, taking ghost-catching jobs around the city (really just the area immediately surrounding Westminster Abbey and the London Eye). Doing jobs earns you money, which you can use to buy better gear, hire more teammates, and eventually upgrade your office and car. Ghost hunting is a lucrative trade  enough to support several competing manufacturers of guns and ghost traps  so youll need those upgrades to compete with business rivals on top of the specters, ghouls, and poltergeists.Combat is likewise easy to grasp, as its essentially just a pared down version of XCOM. Your hunters and the ghosts take turns moving around the grid-based environments and attacking each other. Each of your hunters gets two action points per turn which can be used to move around, take shots, lay traps, or change out equipment. Different enemies have special abilities that can affect the flow of battle, such as teleporting, or stunning your hunters. Its mostly standard turn-based strategy fare, although the developers have added a few interesting thematic twists.Rather than your standard outdoor arenas, most of GhostControls missions take place inside apartments and homes. As such, doors and light switches play a key role in governing combat visibility. With the lights out, you wont see ghosts until theyre right in front of you. Instead of assaulting your stamina, the ghosts try to break down your sanity. The result is pretty much the same  when a character runs out theyre gone for good  but theres a percentage chance with each attack that your character will freak out and run away. Most beams either push ghosts or pull them toward you, but of course its not enough just to shoot them. You need to trap them or theyll keep fighting forever.Like XCOM, your success or failure is determined by percentage chances based on your equipment and stats. Unfortunately, the only percentage thats actually transparent is the base efficacy of a trap or gun. Theres no way of telling how your stats affect your weapons, if at all. This makes it difficult to plan effectively, and if the odds arent in your favor, ghosts can sit on traps turn after turn with 0 health, whittling away at your sanity. There are also random elements to the business side of gameplay, so a job might spawn on the other side of the map, giving you no chance to reach it before one of your rivals. On top of that, rewards for combat seem entirely arbitrary. A tough gig might not give you enough quid to pay your gas and hospital bills, but one thats a (literal) walk in the park can pay out almost a grand.More frustrating and arbitrary still is the UI. Just sorting through your inventory requires opening up a new window for each hunter, while actually figuring out what any given item does requires hovering over it until a separate popup appears. The trouble is, these popups dont work half the time, they disappear if you give the mouse even the slightest nudge, and if you want to look at the stats for a trap that a ghost is standing on, tough luck, youre only seeing the stats for that ghost. Its very easy for walls or obstacles to cover up objects entirely, meaning you can miss an enemy that should be in plain sight, or forget a trap thats hiding behind a tree.Without a doubt, though, the most baffling element is the smartphone menu on the main screen, which is used to take jobs, read news articles, change the options, and look at the credits for some reason. Theres also an option in the menu to save the game, but you can only use that at your HQ, which has a save point in it anyway. On top of all that, the button to bring up the menu is at the bottom right corner of the screen, exactly where Skype and Steam notifications pop up. If you happen to have an alert when you try to click it, youll be taken out of the game.Another thing liable to take you out of the game is the writing. Put bluntly, its atrocious. The games script is littered with innumerable typos and grammatical errors, and almost every sentence sounds awkward and unnatural. If that doesnt bother you, the 4 lines of voiced dialogue certainly will. Youll feel your own sanity start to slip after the 80th time you hear Theres smoke in your eye! or Controlling makes me feel good! On the bright side, the game is packed with references in its weapon names, like the Spookeball or the Captcha 2300. These arent exactly high comedy, but theyre certainly worth a chuckle.Ghostcontrol has a nicely cohesive retro aesthetic thats apparent in both the music and the graphics. With its 16 bit isometric style, the game certainly captures the look of the strategy titles that inspired it, and the soundtrack is full of funky 80s-style chiptunes with a spooky edge. Though its clearly off-brand, this is by and large what youd expect the perfect Ghostbusters game to look and sound like if it came out when the film was relevant. Unfortunately, while the art looks nice, there simply isnt much of it. Environments repeat frequently, and while the gameplay is shown in a window the size of a postage stamp, the only thing behind it is a dull grey gradiant.Closing Comments:", "date": "February 4, 2014", "grade": 3.0}