{"name": "Fallout 4 VR", "ref": "https://hardcoregamer.com/?post_type=post&p=283812", "text": "This year, and more specifically the past month or so, Bethesda has been looking to the past in order to move forward, as not only did Skyrim get ported to two new formats but we have had three major Bethesda titles enter the world of VR with Skyrim, Doom and now Fallout 4, granting the wish for everyone that who hoped they could live in Fallouts nuclear wasteland. Transferring these titles to VR is a bit more than just a standard port since this involves tweaking of the game mechanics and also presenting it in a completely different medium. By taking an established game and putting it in this format, it allows a chance to see how something more familiar might translate and show what potential VR has for gaming along with what areas need to be addressed for optimization.Taking place in Boston in the year 2287, Fallout 4 is the latest entry in the post-apocalyptic RPG franchise that can easily whittle away hundreds of hours of anyones life exploring the wasteland while trying to stay under the radar of the relentless Preston Garvey, whose settlements probably exceed the world population from before the Great War. The base game of Fallout 4 VR is the same one that came out a couple years ago, so please refer to our review of its initial release for more in-depth information on the actual game as this will be focusing more on the VR aspects. Fallout 4 does have some issues in VR, but nothing that ruins the journey to the wasteland.A quick overview of the plot is the game begins on October 23, 2077, the day bombs fell. The character along with their spouse and child go to the Vault 111 and are forced into cryogenic chambers where they spend the next 210 years. The player wakes up to witness the kidnapping of their spawn and murder of their spouse, because why couldnt they wake up to anything nice after that happening? The player eventually finds their robot butler Codsworth who informs them of what has happened and advises they travel to Concord, where he meets characters like Piper, Preston Garvey, Detective Valentine and Dogmeat. The player learns about settlements that need help, artificial people known as synths and wants to learn about who took their son. Like regular consoles, the greater variety of available games the better but Fallout 4 VR is a prime example of the type of game that should exist in this format. Of the hallmarks of the franchise is just how massive and open ended the world is, where the player is free to travel the world on their own path and interact with the world and its inhabitants on their own choosing. The level of immersion in Fallout 4 was amazing in standard format, but actually moving about the world and having these conversations with its inhabitants seems so much more real when the magic of VR has the player walking through the settlement, at least in some regards. The downside is Preston Garvey and his startling appearances are that much more nerve wracking and this may result in him being shot in the face once or twice.The downside with this port is Fallout 4 was not originally designed for virtual reality, and while this is an impressive and ambitious title for both traditional and VR formats, concessions had to be made in order to translate the experience. The visuals were always good, but Fallout 4 never boasted the best visuals due to most of the resources being put into making an enormous and enthralling  though not overly pretty  game. The visuals were downgraded a bit, textures on buildings look fake and visual glitches are fairly common. Lower quality graphics in a later port is never a good thing, but the visual hiccups are not a major deterrent to enjoying the game. Where the visuals hurt the level of immersion is not so much based on graphic quality but just on how it was designed. The UI for Fallout 4 was a thing of a utilitarian beauty, at least on a flat screen for which it was designed. In VR the countless menu screens required to manage everything floating in the air just seem odd. A few minor tweaks were done to address this but nothing substantial, though despite the weirdness factor they probably went the best route here. Lastly, and Fallout 4 is not the only guilty offender here, certain things like raising your arm to access the Pip Boy is a great feature to put the player in the world. Having the Pip Boy being a floating disembodied object when the player has no visual arm is a bit disconcerting, however, which can also be said for the guns that kind of float in midair. The shooting mechanics of Fallout 4 VR are actually one of the stronger points. The VATS targeting slows down enemy movement to a crawl so the player can pull off some precision shots, which is useful when taking on a deathclaw which in the world of VR is quite the imposing figure.A big question mark that loomed of Fallout 4s transition to VR was about the platforms that support it, namely the HTC Vive and the Oculus Rift. The control layout is designed and optimized for the Vive, so its a no brainer to use that hardware for Fallout 4 VR. Technically, this can be played on the Rift though its not highly recommended. Fallout 4 VR does not support standard controller input for the whole game. The Oculus Touch controls do work alright for most of the gameplay but are abysmal at navigating through the menus. For some reason the controller does function for menu navigation and does a better job than the Touch, but playing with the Touch controllers and having a regular controller handy for menus is a bit cumbersome. A positive is no motion sickness or headset discomfort was experienced during the review, meaning that Fallout 4 VR can be played comfortably for hours at a time like any open-world RPG should. Closing Comments:As cool as VR Fallout sounds, Fallout 4 is simply more enjoyable on the flat screen. Despite the issues that came with the port to VR, experiencing Fallout 4 in VR is great, not so much because of how amazing it is but because of the potential thats shown. Fallout 4 was not built from the ground up for VR, and considering its size made porting it to VR no minor task, its still a worthwhile title even with its shortcomings and arguably essentially for any Vive owner. Fallout 4 VR shows that a game of this magnitude can exist in VR format and if a Fallout game was built from the ground up for VR and used this as a reference point for what to improve the results could be truly astounding. As it stands, its clear that VR games have come a long way in the past couple of years but still have a way to go before their potential is fully realized.", "date": "December 21, 2017", "grade": 4.0}