{"name": "Heroes of a Broken Land", "ref": "https://hardcoregamer.com/?post_type=post&p=71007", "text": "Heroes of a Broken Land is an incredibly unique game, in spite of its insert generic-fantasy title. The story, too, isnt especially thrilling, with a Council of immortal Wizards, a Crystal Heart and a broken world, all painting its fantasy setting appropriately. Naturally, youre one such wizard, and your goal is to collect enough Crystal Heart fragments to restore the world to its once powerful glory. Its an archetypal roleplaying premise involving powerful magic and corruption that serves its purpose of shifting the exploration from near pointless to somewhere in between classically-simple and engaging. But that isnt what makes Heroes of A Broken Land unique.The presentation, which is reminiscent of the earliest Might and Magic entries isnt what stands out, either, despite serving its dose of nostalgia across the grid-based shard of terrain. Its the sheer ambition; the melding of genres and superb execution of every attempted feature that makes Heroes of a Broken Land a singular experience  not its appearance or narrative. Its not just another turn-based RPG, nor is it a dungeon crawler or town management simulation. Its all of the above, packaged neatly in a world of countless dungeons, endless possibilities and a boundless supply of treasure. Oh, the treasure.Starting a new game places you in the boots of a developer of sorts; presumably whichever one is in charge of deciding on everything from world size and difficulty, to item quality, monster level and even the rate at which treasure is uncovered. Since the world and its contents are also procedurally generated, theres quite literally an endless supply of gameplay for those that wish to never purchase another RPG again. However, for my playthrough I chose the tiniest sliver of land, which conveniently quoted the play-hours at a few. I did tinker with the silly large option, though, and that presented me with two options. 1) never leave the house again and vow to uncover every hexagon, or b) go back to a smaller option because f*** that. Yeah, its that big.The second step is choosing a wizard that suits your playstyle. The options are mostly minor increases to stats such as MP, HP and ATK, but can help determine your position early on if youre as obsessive compulsive as I am, and like to have every possibility calculated before rushing into a game. Nevertheless, shortly after the story bits run their course, a prompt informs you of the team of heroes youve gathered, and the stat rolling begins. As expected, the classes available are quintessential Dungeons & Dragons, and can be mixed and matched according to personal taste. My crew consisted of a priest, two fighters and a rogue; the perfect team for sneaking up on an unsuspecting beast, kicking its ass and saying a prayer  or you know, healing the party after the encounter.Once your first team has been properly gauged, adjusted and humiliatingly gawked at for 45 minutes, a single chunk of island appears within a void of darkness. This is your town; the place where youll recruit heroes, construct various buildings such as shops, guilds and Arenas and form a base of operations in your image. Although before jumping in, its wise to think over every available option carefully, since all decisions are final and there are only six plots on which to build. Beginners should consider an Alchemist for potions and  eventually  elixirs, which can heal as well as increase stats permanently, and an Armorsmith or Enchnater for upgrades and improvements. Other options include a guard tower for protecting your town from monsters, a farm for increased income and a temple for you religious types.While the town is your main spawn-point throughout the adventure, its the hero recruiting that youll be focusing on. Once word spreads of your new-found prowess, heroes from across the land will travel to your town. Recruiting them is as simple as selecting an icon and confirming with a mouse click, but no two heroes are the same, adding a bit of consequence to decision making. The teams assembled arent for show, however. Youll be able to control multiple groups across the map. For example, one team can be utilized for dungeon crawling while the other defends your town from dangers. Alternatively, two can dive into dungeons while a third searches the map for treasure, and a fourth exists strictly for moral support. The possibilities arent as expansive as they could be, but they make for an interesting mesh of ideas when explored in depth.Exploring the overworld is also an easy affair. You select your party, click on the hexagon you wish to move towards, and repeat as necessary. Its turn-based, which does slow things down a bit, but wheres the rush? Clicking about the island slowly replaces the blackness with a brightly colored hex-grid, littered with treasures, quests and dungeons to traverse. And since each world is unique upon beginning a new game  which takes minutes at best  the layout can be tinkered with to your hearts content. Want a beachfront town? Itll cost you  about 5 minutes of starting and quitting games. But while the town-management meets turn-based overworld is great, the real beef is in the dungeon crawling aspect of Heroes of A Broken Land. Thankfully, the world is infested with assorted caves and towers to explore  even my tiny piece of floating earth had more than enough to do.Entering a dungeon is quite the turn of events, too. Immediately the perspective switches from top-down overworld to first-person, and the game leaps from early 90s to late 90s in visuals. While exploring a dungeon wasnt at all a new experience for me, the traps, hidden treasures and secret doors made delving deep into the unknown as fun as realizing that death in Heroes is inconsequential upon encountering a badass group of bats. Unlike in real life  Patrick Swayze in Ghost withstanding  dying only made me eager to hop back into that dungeon with my slightly improved stats and cocky attitude, and attempt battling those pompous bats a second time. Which I did. Well, it looked like them. Either way, I was killed again. And then three more times before I finally gave up and chose another dungeon to claim as my bitch.Closing Comments:Heroes of A Broken Land can be short and easy, or a test of patience and faith. It can be huge, chock-full of quests and glorious gold, or small and intimate. It seems the only thing each randomized adventure has in common is that theyre equal in fun. Lots, and lots of fun. Its good, then, that my work involves playing games and my fiance has long-ago realized that  because there will be a lot of dungeon crawling, town-managing, grid traversing and household chores ignoring over the next few weeks. There are too few experiences worth experiencing again and again. Heroes of A Broken Land is one such experience, and its one youll be glad is blanketed in ambition.", "date": "January 27, 2014", "grade": 4.0}