{"name": "Detective Grimoire", "ref": "https://hardcoregamer.com/?post_type=post&p=69287", "text": "Tom and Adam Vian (known collectively as The Super Flash Brothers or SFB Games) have been in the flash production game for a long time now. They got their start on Newgrounds at the turn of the century, alongside the likes of Happy Harry, Egoraptor, and Team Meat, but unlike their contemporaries, they never went on to conquer the internet or make enemies of PETA. In the summer of 2012, the Brothers Vian ran a quiet little Kickstarter campaign for a tablet adventure game called Detective Grimoire. The game was basically finished, they said, and they just needed money to pay their stable of voice actors and get everything squared away for an august launch. Technical problems pushed that launch to September, and then into 2013, and now, a year and a half later, this little game that was basically done has finally been released. I wish I could say it was worth the wait.Detective Grimoire was designed to be played on portable devices, which basically means that its an Ace Attorney knockoff with some Layton mixed in for flavor. You poke around the gorgeous game environments looking for clues, interview witnesses, and once youve pieced everything together, you report your findings to your boss and confront the culprit. Along the way, youll encounter locked doors that can only be opened by solving ludicrously easy and nonsensical puzzles. Also sometimes youll have to move around garbage to find clues underneath. Thats about the long and short of the gameplay, give or take some gimmicks.And you know what? Im fine with that, at least conceptually. I love Ace Attorney. But the thing the Ace Attorney series consistently has  and that Detective Grimoire is sorely missing  is a good mystery plot. It starts off with an original enough premise  theres a murder in a swamp-creature-themed tourist trap, and the chief suspect is the creature itself  but does nothing with it. Its obvious from the word go that the creatures been framed, and as soon as you meet them the real culprit may as well be holding up a sign declaring their guilt. Every twist and revelation is telegraphed from a mile away, so rather than challenging your deductive reasoning, the questions the game asks you merely check your reading comprehension.As straightforward and predictable as it is, Grimoire still manages to make some fundamental mistakes in telling its story. Theres this mysterious little girl who follows Grimoire around who has no bearing on the plot and whose presence is never explained (I assume they plan on exploring it in the sequel). Her sole purpose seems to be providing cryptic (and unneeded) hints and, on two separate occasions, just straight up giving Grimoire items he needs to progress. Its as though Adam Vian is coming up to me and saying here, I couldnt think of an organic way for you to find this key, so just take it.The little girl is only the most egregious example of the generally incongruous and illogical design and writing that plague the game. Several characters seem only to exist to provide a single piece of evidence, and even then, much of the evidence you collect is redundant in some way. Other characters, particularly the true killer, act in an entirely illogical fashion. Why would someone run around the entire swamp hiding pieces of a costume when you leave the murder weapon right at the crime scene? Why would someone tear up a photo into perfect squares and then leave them all right under the frame? Why would someone have a lock on their house that requires they place gears to turn the handle? The answer to all these, of course, is because the designer wanted the puzzle to work that way, but it leaves the game world feeling hollow and fake.Despite these complaints, when I play the game, I cant bring myself to dislike it. The characters all have a certain goofy charm about them that makes it difficult to resist smiling, and theyre voiced by a cast of the internets best and brightest. This includes The Announcer and Ms. Fortune (my main!) from Skullgirls, Lulu from League of Legends, and Arin Egoraptor Hanson. These people have great voices and phenomenal comedic timing, with one notable exception  Edwyn Tiong as the titular Detective. I couldnt get past the thick, barely-disguised accents in Heavy Rain, and its just as distracting here. His delivery just rubs me the wrong way, and the way hes written doesnt make it much better. You can often respond to dialogue with your choice of smarmy remark, but other characters dont seem to react to what he says, so all of his one-liners fall flat.No matter what you think of how they sound, its impossible not to be enthralled by how the characters move. Though his design and writing skills are shaky, Adam Vian is without doubt one of the most eminently talented flash animators in the world. For Detective Grimoire hes developed a positively arresting art style thats quite unlike anything else Ive seen, one that works perfectly with adobes vector graphics. The style allows characters a wide range of expression while facilitating incredibly smooth motion. Couple that with the beautiful backdrops painted by Catherine Unger, and you have a game world thats an absolute joy to behold.Likewise, the music is phenomenal. German composer Raphael B. Meyer seems to be just starting out, but after listening to this game I expect him to go very far indeed. The games tracks strike a careful balance of whimsy, mystery, and spookiness, using an eclectic mix of instruments. Its not often that you hear flutes, a harpsichord, and bongos playing in concert, but Ill be damned if they dont mix well, and it allows the game to be as distinctive aurally as it is visually. Moreover, the styles of the music and art blend perfectly into a cohesive whole. Meyer has a knack for catchy melodies as well, so dont be surprised if you end up humming or whistling along with the game.Closing Comments:", "date": "January 10, 2014", "grade": 2.5}