{"name": "Life Is Strange Episodes 1-3 (iOS)", "ref": "https://hardcoregamer.com/?post_type=post&p=283960", "text": "Editors note: Hardcore Gamer has decided to review the iOS port for Life Is Strange. Its worth mentioning that this review will not look into certain aspects previously covered in our individual episode reviews, specifically in relation to how the story unfolds and the different themes explored. For those interested in finding out more about the aforementioned points, check out Hardcore Gamers reviews for Episode 1: Chrysalis, Episode 2: Out of Time, Episode 3: Chaos Theory, Episode 4: Dark Room and Episode 5: Polarized. Additionally, theres our review for the whole season of Life Is Strange thats worth reading.There are some people that would have hardly expected Life Is Strange to emerge as one of the standout titles of 2015. When Dontnod Entertainment decided to dabble in the episodic gaming format for Life Is Strange, it was a risky move outside of the tried and tested formula that was synonymous with developer Telltale Games. Dontnod, however, showed that it was onto something special with Life Is Strange. It was a runaway success for the studio, eventually moving from its digital-only distribution to physical release and receiving critical acclaim and awards. In fact, after all five Life Is Strange episodes were released, Hardcore Gamer reviewed the season in its entirety and called it the sleeper hit of 2015. With success, Life Is Strange has been able to reach new audiences with its prequel, Life Is Strange: Before the Storm, and continues to captivate its ever-growing, influential fan base. Now, Life Is Strange has finally made its debut on iOS  an Android version is expected in early 2018  and its never felt more at home on the platform.Life Is Strange was built for console and PC, though it seamlessly transitions its engaging experience to iOS. The controls are straightforward to use, with the right side of the screen allowing players to move the camera and the left side controlling the direction that Life Is Strange protagonist Max Caulfield walks in. For the more console-oriented players, however, Black Wing Foundation and Turn Me Up Games have included a controller layout that can be accessed in the settings. The left and right sticks instantly change the experience for non-mobile players, making it easier to maneuver both Max and the camera. The port relishes in Life Is Stranges point-and-click mechanics, too, as one of its new  and most beneficial  features allows players to tap on a certain location and Max will automatically run towards it. As excellent as Life Is Strange feels on an iPhone, its equally frustrating when it comes to interacting with the world of Arcadia Bay. For example, there was more than one occasion where two objects (or people) would be too close together and the wrong one would be mistakenly clicked on. Furthermore, the cameras awkward angles occasionally made it difficult to speak with a certain character, mainly for how it would not recognize that theyre in the frame of the screen. Whether its Episode 1: Chrysalis, Episode 2: Out of Time or Episode 3: Chaos Theory, Life Is Strange benefits from its clear, well-organized interface. Maxs Journal, which keeps information relating to different characters, collectibles and text messages, is placed in the top right corner for quick, easy access at all times. In staying true to its console counterpart, the iOS port encourages players, both old and new, to keep track of new entries in Maxs Journal.The rewind mechanic was at the heart of Life Is Stranges experience and story, and its clear that careful consideration has been taken to make Maxs time-bending powers at the center of the port, too. As soon as the rewind icon is tapped (placed neatly in the left-hand corner of the screen), it provides players with the option to manually rewind time or fast rewind to an important point in an event. The addition of Photo Mode to Life Is Strange changes the way players can experience each episode. Its a fantastic opportunity for players to unleash their inner Max, turning the average screenshot into an artistic, unique portrait that an amateur student photographer would aim to achieve. From the various filters that can be applied to photos to the ability to enter into first-person mode for a shot, it makes the device that Life Is Strange is being experienced on effectively the lens of Maxs camera. The best part about Photo Mode, above anything else, is that it spotlights how brilliant of a feature it would have been in the original Life Is Strange  something that sets the mobile experience apart from the console and PC version. Dontnods unique art direction for Life Is Strange was impressive when it debuted in 2015. It is, in many ways, unsurprising how it translated in the visual presentation, with both characters and the environment sharing equal status throughout all five episodes. When it comes to the iOS port, its a testament to how sharp and wonderful Life Is Strange looked on console and PC. Black Wing and Turn Me Up must be commended for putting meticulous effort into making the port as visually moving as its console counterpart. However, Life Is Strange does suffer from occasional frame rate drops, which is unfortunate to experience in an interactive story. It could be a short-term issue, though, depending on whether the development team introduces a new patch to remedy it. Equally as important to the visuals is the sound, with the port perfectly capturing composer Jonathan Moralis music in Life Is Strange. Whether its experienced with headphones or without them, and whether its the original sound or one of the many licensed tracks, Black Wing and Turn Me Up doesnt cut any corners to bring the definitive sound that fans and critics lauded in Dontnods title.Releasing only the first three episodes of Life Is Strange is a questionable move on the part of Square Enix. Unlike Before the Storms three-episode narrative, Life Is Strange feels out of pace in its current state. Episode 1: Chrysalis is a slow burner for setting the story; Episode 2: Out of Time picks up the story with some serious momentum; and Episode 3: Chaos Theory kicks the story into full force with its twists and turns. The natural wait for Life Is Strange episodes in 2015 were built with an anticipation and desire to know more, but this time around, it will make newcomers question why theres a wait for the final two episodes  Episode 4: Dark Room and Episode 5: Polarized  when the titles been on the market for two years. If anything, this port would have been a truly different experience if Square Enix had taken a page out of Netflixs book and released all episodes in Life Is Strange at once. Similar to its console counterpart, Life Is Strange is priced accordingly on iOS. For the first-time players, theyre able to experience the phenomenon that is Life Is Strange at the cost of $2.99 (2.99/3.49) for Episode 1: Chrysalis. However, its the Life Is Strange Season Pass where the investment should (and must) be made, especially as ten percent can be saved on buying all four episodes together rather than individually purchasing them. Its price is fair, but theres also added incentives for Life Is Strange fans to reach into their pockets and splash money on it again.The iMessage stickers, exclusive to the port, are a bonus item, providing even more Life Is Strange-themed content for fans to use outside of the game. The stickers are filled to the brim with several different references to Life Is Strange, each of which is as cute, amusing as the last. While Life Is Strange wont have the same impact on fans with its twists and cliffhangers, the port is a fantastic opportunity to re-enter Arcadia Bay and choose scenarios or make decisions they might not have experienced in their first playthroughs. Closing Comments:Life Is Stranges arrival on the mobile market is surely a statement of intent from Square Enix. The iOS version, which excels in several different aspects, has allowed the publisher to tap into a market that Life Is Strange thrives on, with it holding its own against the console and PC version. Furthermore, Square Enix could  and should  follow a similar style to Telltale Games with getting episodic titles on iOS and Android devices straight away. Above anything else, Life Is Strange might be the springboard needed for its highly anticipated sequel to be released on mobile and also Before the Storm to potentially make its mark on the platform in 2018. Life Is Strange does suffer from different technical issues  much like its console counterpart in 2015  but its not enough to detract newcomers from experiencing its riveting narrative in full effect. With the addition of features like Photo Mode and bonuses like the iMessage stickers, Life Is Strange reiterates why fans need to rewind time and once again step into the shoes of Max.", "date": "December 20, 2017", "grade": 4.0}