{"name": "The Room Two", "ref": "https://hardcoregamer.com/?post_type=post&p=68475", "text": "The iPad has come a long way as a gaming device. When it launched in 2010, most saw it as a simplistic, casuals-only machine, but that has changed. Housing exclusives like Layton Brothers, The Dark Meadow and Republique alongside definitive versions of games from the likes of Square Enix and Capcom, the tablet has proven itself a solid travel companion for serious gamers. But which game is the best? With such a phenomenal selection, answering that would be ludicrous. At least, it would be if The Room werent a thing. The Room is, without reservation, the best game ever put on the app store, and one of the finest adventure games ever crafted; an honor it now shares with its sequel.I tell you this up front because, if at all possible, you should go into this thing cold. Its a 5/5, and thats all you really need to know. Ill try to keep light on the spoilers in justifying that score, but anything I tell you is something you cant discover for yourself. If youve played the original, know that this entry is just as good. If you havent, then you absolutely need to before you even think of playing this one. These games are like Myst, only more concise, more atmospheric, and more immersive. If thats got you at all interested, then do yourself a favor: stop reading now, download the app (or apps), grab some headphones, turn out the lights, and just play, preferably in a single sitting.For those of you still here, or those returning after finishing your play sessions, allow me to explain:On its App store page, The Room Two is described as a physical puzzler. You might mistake that for physics puzzlers like Angry Birds and Cut the Rope, and you wouldnt be entirely wrong. The series takes the touch and drag interface that makes those games feel so immediate and tangible and applies it to a Myst-style adventure. Instead of simply clicking on hotspots, you actually need to flick switches, pull out drawers, and turn keys in order to solve puzzles. It lends the game world a great deal of physicality, as though youre handling real objects in a real space.The first game saw you pulling and prodding at single intricate puzzle box, armed only with a red lens that let you see hidden markings. The box was a fantastic, ever-unfolding mechanical marvel, made nearly real with detailed modeling and texture work, hundreds of moveable pieces, and sound design that made each interaction feel correct. By putting this marvelous thing in front of you and focusing all your attention on it, the game could subtly build a room around you and immerse you entirely. Once you were snared in its carefully constructed reality, it began to just as carefully peel it away. The air slowly filled discordant music and sinister, incoherent whispers. Through the lens, you began to see impossible geometry within the box, glimpses of a world outside our own. With each layer of the box you opened, there was a mounting sense that the knowable world was slipping away. And then, when at last the box was open, you found yourself standing before an unearthly portal, drawn irresistibly to step through.The Room 2 begins on the other side of that door. Rather than getting into a box, youre tasked with getting out, which means that you need to explore a series of increasingly strange rooms and find the doors in each. This shift in dynamic worried me at first  Fireproof Studios proved their mettle at making a single intricate object feel tangible, and expanding that focus to entire rooms threatens to dilute the games immersive qualities. As I began to explore, though, my fears were quickly put aside, and a sense of mounting dread settled in their place.The objects strewn about these rooms are nearly as believable as the box from the original. Though obviously theyre not interactive the same extent, Fireproof have made up for it by somehow improving on the last games already unparalleled graphics. The sound work, as before, is entirely excellent. Everything in the game world sounds exactly as it should, except for the ambiance of the world itself, which sounds exactly as it should not. The Room built up a sense that you were headed for something profoundly unnatural, but the sequel starts there. The whispers and unearthly noises are ever-present on this side of the door, and you can hear distant footsteps circling you as you explore.This shift in tone and game dynamics gives The Room Two its own identity, allowing it to exist as an essential companion to the first game, rather than a simple expansion. The puzzles feel fresh and interesting, expanding on concepts introduced in the first game while taking full advantage of the more open design of the puzzle room format. The horror elements are also closer to the fore in this game, and they even break through into the puzzles. There are mirrors that reflect different realities, haunted objects that move on their own, and even a few human remains that you need to desecrate in order to progress.The writing, too, has taken on a different slant, although the story is no less compelling. In The Room, you were working to unravel the truth behind the Null Element and the disappearance of your friend. The sequel opens with all of those secrets uncovered, and instead of contriving some new mystery, it tells a much more straightforward story. You explore a labyrinth of rooms haunted by the ghosts of others who peeked into the void, seeing glimpses of their stories, but always following the trail of notes left by your friend, hoping to escape. This is a classic weird horror tale about the struggle to maintain ones sanity in the face of the unknowable.Closing Comments:", "date": "January 5, 2014", "grade": 5.0}