{"name": "Rpublique (Episode 1)", "ref": "https://hardcoregamer.com/?post_type=post&p=68173", "text": "Rpublique is nothing if not ambitious. Its kickstarter campaign promised a triple-A-quality game for tablets, with top-grade voice talent (including David Hayter and Jennifer Hale), stunning graphics, and a big, Metroidvania-style world to explore. It also aimed to create a new sort of stealth gameplay purpose-built for touch screens, and to tell a deep, poignant story with a strong female lead. Astoundingly, if this first episode is any indication, Camoflaj + Logan seem to have delivered on all fronts.The titular Rpublique is the manifesto of a dystopian state known as Metamorphosis. The complex is entirely closed to the outside world, until a young, frightened girl named Hope calls you from inside. Hope is in a lot of trouble. Shes somehow come into possession of a poisoned manifesto  a copy of Rpublique with footnotes added by a dead revolutionary named Zager  and as a result she needs to be recalibrated. Youll note that the state seems to be fond of euphemisms, but no matter how you slice it, recalibration doesnt sound like something within the normal, comfortable range of human experiences.Metamorphosis bears all the trappings of an Orwellian police state. Prizrak  former criminals forced to work security as part of their rehabilitation  patrol the halls, ready to lock up and pepper-spray anyone who steps out of line. Sections of the complex are separated by TSA-style body scanner checkpoints (that totally dont give you cancer, we swear). Cameras watch every nook and cranny, an ever-present reminder of the control the Headmaster exerts over his pupils. Ironically, that very surveillance system might be the states undoing. Using Hopes phone, you are able to patch into the network and take control of the cameras.This being a stealth game, the ability to peer through the lens of any security camera is a massive advantage. You can observe Prizrak patrol patterns and scout safe routes with ease. The trade-off is that you have no direct control over Hope  you can merely guide her. You point to a spot, and she will go somewhere in the general vicinity, hopefully crouching behind some sort of cover. She will peek out around corners to spot enemies, and make inexpert attempts to stay hidden if they come too close. If someone grabs her, she will automatically use up one of her limited supply of pepper-spray canisters to get away, and you can do naught but watch. This makes her character feel more alive and distinct from the player, but it can be (to put it lightly) a little frustrating.Once you get used to these mechanics, though, the frustration gives way to moments of genuine tension. A Prizrak will be inches from Hopes hiding place, practically breathing down her neck, with another one about to round the corner and spot her. Sometimes, she will be seen, and theyll give chase. Fortunately, youre not limited to merely being Hopes eyes. Since you have control of the security system, its easy for you to lock doors around pursuing guards, allowing Hope to escape. As you earn currency (appropriately gained by gathering information) you can buy various upgrades from a mysterious hacker, one of which lets you distract Prizrak.The other upgrades available in the first episode allow you to hack emails and tap into phone lines. They dont help much with the stealth, but they do increase the amount of information you can gather, and thus, your spending power. Of course, these emails and recordings  along with tapes, newspapers, and other stray bits of info strewn throughout the facility  also help a lot in the way of world-building. By the very nature of the world most everything you find is propaganda, so it helps that everything has an insightful (and often contradictory) commentary track attached. From a newspaper reporter ranting to herself about the lies shes forced to tell, to high officials muttering seditious notions to themselves, you can tell that the control exerted by the Headmaster is firm but fragile.The actual ideology that forms the foundation of Metamorphosis is interesting and topical. Books are banned, citizens are closely monitored, and propaganda paints the halls, but the motivation behind it isnt the fascistic, jingoistic, or hyper-religious sensibilities typical of this sort of fiction. Rather, the Rpublique seem to be rooted in a fanatically progressive ideology that preaches absolute racial and gender equality at the expense of free speech. We tend to see these ideals as absolute goods so its intriguing (and Id argue necessary) to explore them from a more morally grey perspective. It also feels more believable that modern people would submit to a regime based on progressive politics, rather than the more old-fashioned underpinnings found in similar works.That believability is hampered, however, by the games frequent and inexpert attempts at breaking the fourth wall. Each Prizrak has the name and face of a real person  kickstarter backers who paid over a certain threshold  which is minimally distracting until you run into Tycho from Penny Arcade in a bathroom stall. There are also cartridges for various iOS and kickstarter-backed games scattered throughout the facility that belong to a friendly guard named Cooper (who also has posters for the Double Fine Adventure project and Kentucky Root Zero in his office). The game tries to pass these off as playful references, but over half of them come with links to the App store, and its hard to see them as anything other than shameless advertisements.Closing Comments:", "date": "January 1, 2014", "grade": 4.0}