{"name": "Total Extreme Wrestling 2013", "ref": "https://hardcoregamer.com/?post_type=post&p=67867", "text": "There are hardcore simulation games, and then theres Total Extreme Wrestling. Dont let the lack of true aesthetics fool you; this is a full-bodied experience that will suck in any gamer who has the urge to run a wrestling company from the ground up. Let it be known now that this game isnt for the faint of heart; this is truly a niche title that lays on choice after choice to the point of almost drowning the player in menus. But if the prospect of being your own Vince McMahon has ever even been in the slightest bit interesting to you, then Total Extreme Wrestling 2013 is the game to play.As one may infer from the title, this isnt Total Extreme Wrestlings first rodeo. In actuality, this is the series fifth mainline installment (thats not counting the four Total Extreme Warfare games that essentially spawned the TE Wrestling series), and as such is a refined beast of a simulation experience. See, TEW is all about running ones own wrestling organization. What that actually means is handling aspects of the business such as signing talent, scripting storylines and matches, as well as dealing with backstage drama that can spillover into how successful the company is, in an effort to reign supreme within the pro rasslin world. This truly takes the WWE Universe mode from the 2K franchise and ratchets it up to 11.In truth, the name of the proverbial game is options. Options, options, options; Total Extreme Wrestling 2013 has more choices to make than one can shake a stick at, almost to a fault, if players are not totally aware of what they are getting into when they first fire up the game. To that end, newbies of the series or genre will almost certainly be overwhelmed by the complete control players are given. While there is a functional tutorial that hits on many of the titles high points and most important inner workings, its hardly enough to acclimate someone to what all is needed to play the game successfully. But then again, the level of depth provided in an experience such as this should require time to get comfortable with. Its in the sheer amount of details that TEW shines brightly. Nevertheless, lets talk further about those choices I mentioned earlier. For starters, the player (in this case, the booker) must sign wrestlers as well as sustain those already provided to them at the beginning of the game. This means that financial planning is of importance, along with how to negotiate with the many personalities one would encounter in a high-profile sports entertainment industry. Thus, knowing how to handle Prima donnas and larger-than-life egos is a skill that must be sharpened to a deadly point if the player is to make it to the big dance. From there, its time to make matches, which includes writing overarching storylines, promos and various other wrestler interactions that impact the flow of a show. Of course, on that topic, its up to the booker to create the weekly and/or monthly shows, which includes naming them, giving each a theme if necessary, and of course setting which titles will be on the line at the bigger events.Even the titles can be created and modified to compel players to make a company and all its facets their own. Thats truly what TEW is about: making a product feel exactly like the players own. That philosophy is cemented even further by way of the actual matches. On that note, we found ourselves really favoring certain superstars, which in turn gave us the incentive to involve them in high-stakes angles that resulted in their winning titles. By doing this, we were able to build drawing wrestlers that made the promotion a pretty penny, and allowed us to sign even bigger talent. Its this kind of cycle that is the very crux of what Total Extreme Wrestling has to offer.And deciding which talent is worthy of a creative push is a process, but an exciting one if players love poring over statistics. Each wrestler is rated in over 30 categories, from mat wrestling capacity to charisma to how well they can cut a promo. They also are categorized in terms of popularity in addition to the relationships they have on and off-screen. Its a robust system that requires some serious micromanaging; after all, its not uncommon to have several dozen wrestlers under contract at the same time. Thus, folks can lose hours upon hours reading through menus and trying to best figure out how to utilize their talent given their strengths and limitations, instead of getting hung up on cumbersome menu navigation.But as we mentioned earlier, this isnt developer Adam Rylands first foray into the pro wrestling simulator realm. Ergo its important to talk about if 2013 improves the formula and groundwork laid back in 2005 when the franchise first began. Up first, the screen in which players will spend the most time has seen a sizable update, with headlines and pertinent news stories emphasized instead of irrelevant ones that plagued the previous installments of TEW. That being said, nearly all of the features of past entries remain a part of the gameplay, with these new features simply refining the experience rather than changing it radically. For example, the aforesaid action of signing talent is exponentially easier and less confusing, as contract negations go over with more clarity and succinctness. This is just an example of the small tweaks returning players will notice.But thats not all that is new. The interface and icons used to navigate menus have been overhauled  sure to throw returning players off their game, but nevertheless a welcome addition that clearly gives the game a more verbose visual quality. While the game still isnt a feast for the eyes, the truth is, it probably wont ever be  as thats not its focus  which means the reformed interface simply makes the process a little more appealing and a lot more streamlined. In fact, there seems to have been a big developmental push to make the game more seamless at large, as critical information on talent and the promotion in general can be accessed with fewer mouse clicks and understood with less need to wade through countless text blocks.Booking venues and shows has also seen enhancements. If a promoter/booker gains notoriety in a certain geographical region, they can now easily choose the venue that suits their popularity in that specific region. This wont mean much to newcomers, but for franchise vets, theyll know that this new modification removes the mind-numbing process of having to figure out which individual venue will yield the best turnout based off statistics that are only misleading and less than reliable. Shows are also easier to book now, too, thanks to a superior Assistant Booker mode.One of TEWs biggest barriers to entry, though, is its lack of graphical fidelity. This is a text-based simulator, and as such, uses aesthetics sparingly. Wrestlers have portraits, and there are some random use of images to portray certain venues, promotion logos and the like, but thats where the visuals stop. Due to this approach, the games graphics department can really only be evaluated by the interface it employs. On that front, its a clean looking game, though unremarkable all the same. Sure, its a breeze to page through the text and menus as a result of this, but it does not serve the experience in terms of creating an eye-catching game.Closing Comments:", "date": "December 29, 2013", "grade": 4.0}