{"name": "Dementium II HD", "ref": "https://hardcoregamer.com/?post_type=post&p=66611", "text": "A well-made game can stick with you for years to come. I still look back fondly on certain titles from the SNES or Sega Genesis and can recall vivid memories of my time spent with the games. It took me twenty minutes into Dementium II HD to realize I had played this game before. Ive played many games, both good and bad, over the years that leave some sort of mark on me, so it is a special kind of achievement to be so forgettable that it takes me a while to realize that nagging sense of deja vu is not because the game is like so many other Ive played before, but because it actually is a game Ive played before. Im not even saying Dementium II is bad, and while it lasts, it is a fairly competent FPS horror game that is capable of providing an occasional thrill. It is essentially the video game equivalent of fast food. Fine while it lasts, but not complete enough to satisfy you for long periods of time and immediately forgotten about once its over.Dementium II was originally a game released for the Nintendo DS around two and a half years ago, and those that played the original might be wondering what sets the new PC version apart. The answer is unfortunately eh, not much and beyond a handful of brief cutscenes that appear throughout the game I honestly had a hard time telling the difference between the two versions. This goes for nearly every aspect of the game, all the way down to the same lackluster visuals that were only passable before because of the hardware limitations of the DS. While Im not one to usually nitpick on graphical shortcomings, when you throw HD into the title like this I expect a little more. I didnt notice much of an upgrade over the DS original, and even on the highest settings it looks a bit like things were put together by paper mache. If there is any genre where the art style and visuals really matter to me, it is horror. A well designed, well animated monstrosity can give me nightmares for weeks, but I always have a hard time being frightened if it looks like Im being attacked by some seventh graders art project.When the game starts, you awaken in a mental hospital and a nurse informs you that you are still recovering from brain surgery, but apparently your HMO sucks because you are being forced back into your cell despite the fact your vision is blurring and you lack the ability to speak. Minor concerns, I guess. Im not exactly sure what sort of brain surgery you were scheduled for, but apparently your doctor must have lost a Junior Mint up there somewhere because you are suffering from some pretty terrible side effects, including reality warping itself into some dark nightmare world where you are attacked by shambling monstrosities with giant jaws coming out of their chests and seeing the wall bleed at times, something walls are most assuredly not supposed to do. You warp between scary, spooky world populated by monsters and less scary real world, where guards with stun batons run after you and try to subdue the crazy man wielding a prison shank and a machine gun. You must navigate your way through the two worlds, defeating all foes that cross you anduhescaping? Maybe?Im honestly not sure, because the game does a poor job explaining the details of what is going on. The game grants you occasional bit and pieces, and you learn of a religious cult nearby and the fact your character suffered a mental breakdown after the death of a loved one. This plot should sound familiar to you if you played the DS original, or if you ever played Silent Hill 2 because the authors are ripping that title off so hard here I was half expecting the credit scroll at the end to be the same as they seemed content to keep just about everything else. The game relies heavily on you having played the first title for the required background knowledge for what is going on, but even if you did the game tells the story quite clumsily, giving you bits and pieces of the plot at random intervals. There is subtlety in storytelling and leaving portions open to audience interpretation, and then there is just not writing half of your plot and hoping no one notices, and Dementium II seems content to take the later route. There are flashes of an interesting, creepy narrative here (mostly the pieces they borrowed from Silent Hill 2), but too much is left out laving the end result jumbled and unsatisfying.The emphasis on this game is clearly meant to be on horror, and at times it does a nice job setting up a creepy atmosphere with just the right kind of ghoulish creature to weird you out. Monsters move around unnaturally, and some creatures laugh or scream with just the perfect amount of distortion to unnerve you. There arent any legitimately terrifying moments, but the general unease the game establishes is well maintained throughout for the most part. The game undermines itself a bit by making your character a bit too deadly by the end, a mistake I find to be increasingly common in many horror titles. Sometime after you find the sledgehammer, shotgun, machine gun, flamethrower, and actual sticks of dynamite just laying around you stop being scarred of the creepy crawlies slowly moving their way toward you. What the hell do you have to be afraid of when you have enough firepower to take down most small countries? If anything, the monsters should be running from you, and later on in my game when a single well thrown stick of dynamite wiped out four enemies at once, I legitimately expected the lone survivor to run and hide under whatever the equivalent of a bed is in the monster world.Impressive weaponry and a certain competency to your combat are generally added to survival horror games to make the experience more fun, but often are added to the detriment of the actual horror aspect of the game. It isnt that the gameplay here is bad, and the mechanics are fine and give you a fairly competent first person shooter with a decent variety of weapons. Unfortunately, if I wanted to play a fairly competent first person shooter with a decent variety of weapons, I could choose from hundreds of other games on the market that do a better job at it than Dementium II. All my favorite survival horror games give me something to dread, something to be afraid of, and pin me down and whisper in my ear that if I dont slide against that wall checking in every direction something will pop up behind me and suck out my eyes through my ears. They do not give me a shotgun and a militias amount of ammo, slap me on the back, and yell happy huntin! Even with all the weapons and competent shooting mechanics, the combat here is not nearly polished or innovative enough to be a factor that draws individuals into the game, and it seems like a bit of the horror was sacrificed to add in something you can find in hundreds of other games.Outside of killing weirdly shaped creatures, the game does not offer a whole lot in the way of fun things to do. There is a minimal amount of exploring, as the game leads you through a predictable set of locales with some items to find and some simple puzzles to solve. There are a couple that require a slight semblance of a thought, but for the most part all you need to do is find the oddly shaped key to jam in the oddly shaped keyhole to move to the next area. The whole game lasts only around four hours for your first playthrough, and for some reason the survival mode that was in the DS version seems to be absent from this PC counterpart, meaning you have even less content here than you did in the original release of the game.Closing Comments:", "date": "December 22, 2013", "grade": 3.0}