{"name": "Ring Runner  Flight of the Sages", "ref": "https://hardcoregamer.com/?post_type=post&p=66201", "text": "In the tradition of classic 90s RPGs, Ring Runner: Flight of the Sages kicks off with an ugly, slightly bloody pre-rendered image and a bit of dialogue explaining that you have amnesia. In stark contrast to that tradition, this is not followed by a character creation screen or any sort of dialogue choices. Rather, the abandoned space-ship on which youve apparently undergone elective surgery begins to explode, and you and your newly-implanted AI guide need to grab the nearest space-ship and get the hell out of dodge.It becomes apparent immediately that Ring Runner is not like other top-down space shooters. Rather than fly wherever you point the analog stick (the game lets you play with a keyboard, but Id advise using a controller), your ship accelerates forward with a squeeze of the right trigger, and must be steered left and right with tank controls similar to the original Grand Theft Auto. You can only fire at whats directly in front of you, but keep in mind these are space-ships, not fighter jets. You only have to accelerate when you want to change course. You need to use your inertia to slip past enemies, turn your guns on them as you pass, and blast them out of the sky. It takes a lot of getting used to, but the games piloting system is robust and satisfying. The overall dynamic reminds me of the battle room from Enders Game, which is definitely a good impression to leave.After blowing up the overpowered starting ship, the game gives you access to an array of different ship classes, each with their own unique capabilities. You have Arsenals, which tend to be good at turtling and unleashing firepower, Fighters, which have great forward mobility and solid all-around stats, Rogues, which have stealth capabilities and powerful weapons, Grapplers, which are good at close range and able to push and pull enemies around, and Casters, which tend to play around with the physics engine and have the ability to revive themselves if theyre blown up under certain conditions. Each class has its own distinct playstyle, so you should have no trouble finding a ship that suits your tastes. And we havent even gotten to customization.The options you have when it comes to building your perfect ship are frankly obscene. You have scores of different ships at your disposal, and a massive range of equipment with which to kit them out. Different ships have varying numbers of slots for upgrades, and you generally have a lot of options for each and every slot. Its possible to spend hours tweaking builds and creating an army of perfect ships. If youre not content merely using them in the campaign, youre free to take them for a spin online in a variety of co-operative and competitive game modes, including a horde survival gametype and a fun MOBA-lite.Ring Runner was developed by a pair of brothers whod never made a game before, and the inexperience shows. The core gameplay is tight and amazingly varied, and the levels and arenas are well-designed, but the pacing of the campaign is all out of whack. Theres a lengthy (Im talking several hours) tutorial section that shunts you from mission to mission without giving you any choice of ship or customization options. This does give you a chance to try every class out and see what suits you best, but it also means youll be spending a lot of time using ships that may not suit you at all.As you can probably imagine, this wrecks the difficulty curve pretty fiercely, and its not in great shape to begin with. Stupidly easy missions frequently run back-to-back with ones that feel near-impossible, and even in-mission you can find yourself unexpectedly overwhelmed. If youre in the wrong spot, your shields and hull can be drained in a matter of seconds. This isnt so bad in short missions, but the game offers no checkpoints, and in longer levels it can be downright infuriating. There is an element of self-imposed challenge in the form of bonus objectives, which is something I always appreciate. Its immensely satisfying to finish a mission without getting hit, or to win a supposed to lose fight.Once you do get to the campaign proper and the game opens up, you run into an entirely different problem. You start with 16 ships and more weapons and equipment than youll know what to do with, and the game offers no guidance. Its entirely possible to make a ship unplayable by building it wrong, and the UI does the game no favors in terms of user-friendliness. Just finding out what a part does is needlessly complicated, when theres plenty of space on the screen to display part info as you scroll through. Once youre done setting up your weapons, you need to bind them to buttons, which can easily lead to the controls feeling inconsistent. On the bright side, having lots of options does help to smooth over difficulty spikes.The story guiding you through all this is pretty weak. Its mired in RPG tropes from the getgo, and it has an awful tendency toward getting lost in tangents. Within the first hour youll find yourself captured and forced to be a space-gladiator in a space-coliseum, and the hours after that mainly involve doing random busywork for opposing sides in a war that has nothing to do with the main plot. Attempts are made to build an interesting sci-fi universe (some successful even), but it amounts to little more than some nifty backdrops for firefights. Theres plenty of backstory for the space-rats and space-hillbillies and space-rangers, but none of it is particularly captivating or engaging.The backdrops sure are nifty though, ranging from asteroid fields to space-trailer-parks to space-beaches. None of it makes a heck of a lot of sense, but it looks cool and gives you plenty of visual variety while youre darting around asteroids shooting things. All of the ships are also modeled nicely, and each has its own distinct look. Unlike certain other space games, this isnt something youll get bored looking at, which is good considering that it clocks in at over 30 hours. And oh man, do things ever look pretty when they go boom.They also sound great. Ring Runner takes immense liberties with the whole no sound in space thing, but its hard to complain when guns go pew-pew and blam-blam in such a satisfying fashion. Not to mention, sometimes when you kill a guy you get to hear a Wilhelm Scream. Its a nice touch. The game also has a kick-ass electronic soundtrack, with intense battle themes and some nicely laid-back exploration music reminiscent of Mass Effect.Closing Comments:", "date": "December 16, 2013", "grade": 4.0}