{"name": "Farming Simulator 2013", "ref": "https://hardcoregamer.com/?post_type=post&p=64511", "text": "Old McDonald had a farm, E-I-E-I-O. And on his farm he took a loan, E-I-E-I-O. For a new field here, and a new field there. Here a crop, there a crop, everywhere a crop-crop, Old McDonald lost his farm; partly due to his inability to correct multiple contaminated soil violations per the Department of Agriculture, but also due to an insurmountable debt as a result of a recent harvester purchase, E-I-E-I-O. Sure, my take on the song may not be as well-received as the classic approach, but if theres one thing I learned from Farming Simulator 2013, its that farming isnt as fun as those rhyming lies would have you believe. While the backbreaking labor has been replaced with its digital equivalent, at times it feels as if your fingers had touched the greasy hood of a rumbling tractor. I walked away from my 15 hour experience with virtual calices aplenty, but unfortunately not much else.Welcome to the wild world of farming. In this game, your goal isnt to kill your friends or slay a dragon. Shoot, you wont even be building a customized farm or making outrageous financial gambles with your crop earnings. Truthfully, you wont be doing anything inherently fun or outlandish in Farming Simulator 2013, because as the name suggests, Farming Simulator is a game in which you simulate a farm. You see, farms arent typically a fun thing. After all, this isnt Harvest Moon and you wont be socializing with the townsfolk. Off-season price gouging? Maybe.If youre a veteran of the PC version of Farming Simulator, you should expect much of the same, albeit without the multiplayer functionality and surprisingly active Mod community. If youre new to the experience, you should probably consider yourself a true agriculture enthusiast before jumping aboard the Grimme Tectron. If youre confused about how such a thing is determined, simply take a look around your room. Do you see a poster of a Schlter Super Trac 2500? How about a graph showcasing the USDA vegetable crop sales across key states in 2012? Go ahead and check outdoors if youre more of a closet-harvester. Any budding root vegetables or muddy gloves? Do you have a storage shack full of seeds and soil?For the sake of this review, lets just assume that youre an aspiring agriculturist. Before you start selling your milk, eggs, vegetables and perhaps offer some sacrificial livestock to Ceres, the Roman Goddess of agriculture, youll want to follow the eleven tutorials provided, as these basic lessons cover most of what youll need to get started. In addition to the training missions, there are hint icons littered throughout the farm to help as you progress through the introductory hours. Unfortunately, the information provided is scarce, and more advanced options such as raising livestock arent explained in any detail. Fortunately, simply purchasing animals sends them to their respected area of the map  a fact that infuriated me due to in part to its simplicity as well as lack of explanation.While the beginning tutorials can take anywhere from thirty minutes to an hour depending on your level of comprehension, it will be much longer before youre comfortably acquainted with every aspect of the game. The lack of certain particulars is quite frustrating, and it seems as if Giants Software figured that a person willing to navigate a threshing machine through a virtual field for six hours would also be willing to study the game mechanics without any provided assistance. I found it best to simply start a tutorial farm and spend several hours messing around with the many available options before jumping into the real farm. Its also important to note that theres no real way to go on any sort of rampage in Farming Simulator, and crashing into incoming traffic or assorted buildings does absolutely nothing. Unfortunate, since being able to simulate a suicide every few hours would have made the experience more tolerable.However, once the tutorials have been conquered, your job will be to tackle some agricultural activities. Youll cultivate the provided fields, fertilize your crops and eventually harvest the goods for selling purposes. While the work is exhausting, boring, and mostly unrewarding it somehow manages to rob you of precious hours as you slowly profit towards a new farm expansion or tractor. And thats essentially the only goal in Farming Simulator: earn money, purchase fields, livestock, and better equipment in order to earn even more money. Youre free to achieve this goal in any way you see fit, and starting with a massive bank-debt ensures that whatever your approach may be, youll still find yourself earning only enough to scrape by several hours into your quest for farm superiority. Thankfully, there are no leaderboards. I dont think I could handle competitive farming.Eventually youll reach a stable financial condition, and like most folks on the precipices of success, youll be ready to hire others to do your dirty work. Assorted hired farmhands will allow you to micromanage your farm into a more systematically productive piece of land, which will allow you time to read about the trials of Kunta Kinte before demanding too much of your employees  since theyre essentially androids that require no food or sleep. Although after many invested hours of tedious labor, its comforting to speed through the day as the hired help sow, cultivate and harvest a field simultaneously. Its perhaps the saddest accomplishment in video game history, despite it bringing tears of joy to my eyes. Tears that, perhaps, were of relief, as I was free from the chains of driving up and down a field until all I could hear was the groaning engines of boredom.The problem is that the illusion of running a successful business is shattered as side-quests involve trivial activities such as mowing the golf course greens, which despite offering a much-needed break in routine doesnt really feel like something an owner of a successful farm would be doing. Though the true downside is in the simulation itself, which once mastered beyond its humble beginnings offers limited challenge. There are no dangers such as frozen rain or rough winter conditions to overcome, and the default season seems to be quite ideal for both the crops and animals.The in-game map provides no clear indication of landmark locations, and the day and night cycle provide little more than aesthetic flare. In addition to the inconsistencies of the simulation itself, the game is also fairly unattractive. Textures throughout are blurry and ugly, while the pop-in, draw-distance and stiff animations make for an uncomfortable display last seen two generations of consoles ago. The vehicles in game perform like banana peels with engines as they swiftly drift across fields, and AI cars drive as carelessly as Heather Locklear, slowing down for no man, stop-sign, parked police unit, machinery or danger.Closing Comments:Farming Simulator 2013 is a very basic simulation. Youll repeat the same actions enough times to make you wish you could dive in front of a thresher, and once youre able to abandon tedious labor for micromanagement, youll be tired of staring at your lifeless cows and pixelated fields. Theres no option to violate the livestock, which immediately diminishes any semblance of realism, and everything looks like it was produced for the GameCube. At the end of the day, unless youre an agriculture fanatic that is interested in the rush of cultivating and harvesting fields for hours on end, youre likely to feel cheated by a lack of content, boring gameplay and unimpressive visuals. Ultimately, the farm life is exactly what I expected  a lot of hard work for very little pay off.", "date": "December 5, 2013", "grade": 2.5}