{"name": "NBA Live 14", "ref": "https://hardcoregamer.com/?post_type=post&p=64212", "text": "NBA Live 14 has had a rough few weeks. Since being released on November 19, the game has been under intense scrutiny for a perceived lack of quality for a next-gen release, especially when compared to rival NBA 2K14. The controversy heated up enough that the Executive Producer of the game, Sean OBrien, basically apologized for its release admitting that the visuals and animations of the game were lacking and needed improvement. While its impressive that a studio would admit a games faults so swiftly, its also disappointing that it was allowed to be released in an imperfect state in the first place. Suffice it to say, the long-awaited revival of a fan-favorite series has been a mess. Well be ignoring the brouhaha, however, to focus on what really matters: if its fun.Its been four years since NBA Live last existed, during which time NBA 2K has changed quite a few intricacies of the game. In an attempt to play a bit of catch up, EA has added a few new features to Live 14. Perhaps the most interesting one is the sort-of-hilariously named bounceTek (which seems like a pretentious name for literally making a ball bounce), which reworks dribbling. This fixes a few problems including the ball getting stuck to the players hands and floating above them in mid-air. Basketball games have long suffered from these issues which although dont fundamentally hurt gameplay, take away from the authenticity that is so crucial to sport simulators. With bounceTek, the ball has been completely separated from the animation to give it its own mechanics and make movement more fluid. Combined with authentic dribble packages for fifty top NBA players, this makes ball handling look more realistic than ever in the series. Unfortunately, the same cant be same for player animation which hampers this new addition.During the course of regular play, players move and dribble naturally, but there are frequent occurrences of unnatural moves. This particularly happens when the area under the net becomes crowded with traffic, with players defensive players jumping up and down in weird movements attempting to block shots from being taken. In fact, its pretty common to be able to be sitting under a net dribbling for at least five seconds and still easily maintain control of the ball. In an actual basketball game, doing so would result in the ball being stolen and you getting kicked out of the league for being an awful basketball player. The other time funky animations pop up is during more unique plays like attempting to stop a ball from going out of bounds or passing from an awkward position. Even in movement, the players simply dont seem real.Besides free play or multiplayer, a few additional game modes are offered including Dynasty, Rising Star and Ultimate Team. Dynasty basically allows you to run a basketball team from either current roster, a fantasy draft or a redone 2013 draft. You have to both win on the court and the front office as you scout the next legend. Staff Points (STP) are earned by completing objectives, which can be used for better rookie scouting, quicker injury recovery or increased training benefits. Games can either be played live or simulated throughout the teams season. Fleshing out the mode is the ability to upgrade staff  scouts, team doctor, defensive coach, offensive coach or athletics coach  on the team, and the ability to trade players or sign free agents. Rising Star, on the other hand, allows you to take control of a single players NBA career from being drafted to (hopefully) competing for the championship title. You can customize the player from appearance to position, but visual upgrades are fairly limited. But hey, theres faux hawks, so thats something. Finally, Ultimate Team allows for multiple fantasy showdowns to take place. All three modes are enjoyable and deep, if not all that innovative or different from other EA Sports titles.Of course, its impossible to review NBA Live 14 without touching on the visuals, which are disappointing to say the least. Simply put, this is the first next-gen sports game to not look like one. While Madden 25 didnt exactly dazzle on PS4 or Xbox One, it looked noticeably better than its current gen counterparts and was clear that it was running on a superior engine and hardware upon first glance. Outside of the visual clarity that being rendered in 1080p brings, the game looks and plays like a PS3 title. Character animations are clumsy, close up facial shots dont look realistic and fans and coaches have a very noticeable flatness and artificial shine to them that makes even Maddens fans look impressive by comparison. Even the menus and general interface is uninspired. For a game developed from the ground-up on next-gen, its simply a failed effort in terms of graphics.Closing Comments:", "date": "November 30, 2013", "grade": 2.5}