{"name": "Ys: Memories of Celceta", "ref": "https://hardcoregamer.com/?post_type=post&p=64006", "text": "Theres a reason why Falcom have been around for 33 years and Ys: Memories of Celceta is a testament to that. The Ys series is one of those franchises that has never really seen a weak entry. Fortunately, this extensive PS Vita reimagining of the series fourth installment continues that trend by delivering a high-quality experience that rarely loses sight of its mission and whats important in a roleplaying game. But enough of the hyperbole, its time to find out why this is such a solid RPG.Ys: Memories of Celceta sounds cliche up front. It tells the tale of Adol Christin, a red-headed, amnesic adventurer who, after having ventured into the Great Forest  a place where many warriors enter, but rarely exit  finds himself in a town he cant remember. Upon his reorientation of the village into which he stumbled after leaving the forest, Adol meets up with his friend Duren. Its only following some attempts at jarring the fledgling champions memory, that Duren and Adol help defend the towns denizens from an attack by mysterious monsters. From here, a plot unfolds that sends the duo into the Great Forest once again, but this time at the request of the towns governor, whom is tasking any and all able-bodied men with mapping out the enigmatic forest. Naturally, theres an incentive to the tune of 30 million gold driving the warriors to charting the dense expanse of greenery, and Adol and Duren want in on it. Of course, a more involved narrative unfolds over time, but for the sake of spoilers, well cut our premise off here. Nevertheless, what needs to be known is that this basis merely serves as a backdrop to the action-oriented combat and deep RPG mechanics that are very much so at the heart of Memories experience.Even still, Celceta is a game that actually has an interesting story to tell. While it may lack the seriousness of other JRPGs, and at times doesnt feel as grand in scope as some of the genres biggest hitters, its an entertaining narrative all the same that is filled with a wild cast of diverse personalities. In fact, we were often reminded of the Grandia games when playing through Memories simply because of how light-hearted its tone is, yet how compelling and eclectic its characters are. While its always a gamble to cast a games main protagonist as a silent hero, Ys is a series that has had decades of practice in refining the technique. Because of this, its actually a more personal experience, as Adols decision are often given to the player. And while the choices are usually limited to two or three options at most, with the actual choices not ever impacting the games overall plot, its still nice seeing cast members provide unique reactions depending on Adols handpicked responses.Whats most impressive in all of this is Ys ability to create consistently humorous moments. Due to the rock-solid localization, the dialogue is succinct and tight, able to deliver tender moments when necessary, and also able to cut players with witty lines and clever jokes at the drop of a hat. If anything, the game may not take itself seriously enough at times, underselling the gravity of certain situations which, if they were superimposed into other similar titles, would appear quite dire. At times, the game almost felt like an old Working Designs title, over-doing the humor to the point of becoming irritating.Nevertheless, Celcetas world is strikingly fleshed out, and that much cant be critiqued in any negative manner. There are nooks and crannies that beg exploring due to how the game builds the mystique of its setting. This level of captivation with exploration permeates nearly all of the actual gameplay. Whether its the caverns tucked away deep in the Great Forest or each of the towns that come complete with their host of shops and busy occupants, theres always something pushing players to find and take in just one more sight. In the end, the game does an exceptional job at imploring its players to investigate every corner of an area, which does wonders in breaking up the core element of the experience: the hack-and-slash combat.Much like those before it, Memories of Celceta is an intensely-paced action roleplaying game. The sword-swinging goes down in real-time, giving the game a distinct Kingdom Hearts feel (for thsoe who havent played previous Ys games for a point of reference). Players can mash on the square button to string together combos, use the R-trigger in conjunction with any of the four face buttons to land special moves, as well as dash, guard and parry along the way. But its deeper than what presents itself initially on the surface. The games combat actually has a number of nuances to keep the action engaging. for instance, timing ones defensive guard will trigger a moment to parry, while dashing out of the way of an incoming attack at just the right/last moment, gives players a boost to their next attack. But the biggest strategy to make use of in Celceta is the elemental system. Each enemy has a weakness to some kind of element. The three elements are linked to the three attack types: slashing, striking and piercing attacks. Using the right attack type to capitalize on a foes vulnerability nets extra rewards upon the vanquishing of that assailant.But, its not like a single character can just cycle through the attack types to quickly dispose of a combatant. In Memories of Celceta, players plunge into the fray with a party of three characters. Each of the six characters from which to choose specializes in one of these attack types, and can be switched to on the fly with the press of the circle button. Thus, in combat it becomes a game of analyzing an enemy by pressing on them via the touch screen to gather what their weakness is, then swapping to the right character to deliver optimal damage and earn special bonuses. Whats most intriguing about Ys combat, however, is how exhilarating it truly is. Enemies come in droves, boss battles require a sound mind and thoughtful tactics and the overall difficulty level pushes its players, but not to the brink of repeated annihilation or hair-pulling frustration. In fact, the difficulty is managed quite well thanks to actually competent AI partners who got us out of a tight spot on several occasions. To put it rather plainly, Ys combat is just downright fun  and thats not something all RPGs can say these days.Memories of Celceta really would be nothing if it werent for tight, responsive controls. As an action-RPG, its imperative that movements and attacks are quick to react to the press of a button. Thus, its with great satisfaction that we can say that Ys controls like a dream. Due to the fast-paced nature of the battling, we were worried that it would come off as cumbersome and unable to keep up with the action, but it never once faltered or failed our efforts.Its not all about the combat in Celceta, though; this is a fully-featured RPG that comes with item-crafting, weapon and armor upgrading in addition to a slew of other systems meant to increase characterization output. Its the small details that really add up in this department, such as pieces of armor reflecting a change in an avatars appearance. Essentially by granting this level of customization, the title feels like a personalized experience, an RPG built upon a foundation that is sturdy, providing to its players needs. While the games story will only take roughly 20 hours to complete, theres still just a lot to do here, especially when folks take into consideration the vast amount of side-quests doled out by each towns quest board. These missions are the usual kill creature A to get item B and the like, but its still a nice break from the main plot. Really, Ys is just a game about giving players options. To that end, the games replayability is commendably high. Sadly, theres a lot of backtracking that has to be done in Memories to make any kind of narrative headway. No matter what town players are in, or how far their exploits have taken them, they must always return to the very first town in order to turn in their field reports. Traveling between locations is handled well enough, however, with being able to fast-travel via a larger overworld map, but the simple fact that this was present at all did sully the otherwise buttery smooth story progress. The presentation in Celceta is beyond impressive. Although the graphical fidelity is a bit of a mixed bag, it nonetheless uses wildly vibrant colors and includes a variety of environments that practically jump out of the screen due to the amount of vivacity. Character models are also fairly detailed, though decidedly polygonal at times. Moreover, movements occasionally appear stiff, with characters walking as if they are more so robots rather than human beings. On the other hand, the menu interface is downright astonishing in appearance. Its easy to navigate, clean in aesthetic and uses colors in a way that catches the eye. Sure, Ys: Memories of Celceta isnt the prettiest game on the Vita, but it utilizes the technology well at times  the fully animated cutscenes are especially a treat. That being said, we did notice some slowdown throughout our play time, however, this mostly happened during panoramic shots, or camera approaches that showcased a lot of movement on-screen, such as a birds-eye-view of a bustling, sprawling cityscape. It happened intermittently, rarely able to be predicted, which we chalked up to happening not enough to be excessively significant or game-breaking in the slightest. Nevertheless, its presence will be noticed, and therefore must be talked about.The soundtrack is also equally as verbose. It uses an assortment of instruments to highlight its dramatic crescendos, with blasting drums, sweeping strings and catchy melodies that attach to the fanciful tone expertly, laying the groundwork for incredible atmospheric integrity. With its expansive track list and excellent use of instruments overall, the aural presentation is strong and confident to say the very least. The audio at large is made all the better by some excellent dub work from the voice actors. Oft are dub-casts cringe-inducing, but here they deliver resonate performances and, by proxy, may even show some players that English dubbing isnt always such an awful idea.Closing Comments:", "date": "November 27, 2013", "grade": 4.5}