{"name": "Fighter Within", "ref": "https://hardcoregamer.com/?post_type=post&p=63590", "text": "Its ridiculous that the Kinect has been out for three years and still doesnt have a decent fighting game. This is a device that was thought to finally make the lifelong dream of a virtual reality fighting game come true, yet its 2013 and motion gaming fighting doesnt seem that evolved from the Activator. Weve long known the concept is awesome. I remember visiting the Tempe GameWorks in the 90s and trying out this giant virtual reality ring hooked up to Tekken 2. Yet walking away from this type of fighting game in 1998 and 2013 virtually has the same reaction of well, that was terrible. With both the improved Kinect and benefits of a next-gen gaming, it was hoped that Ubisoft would finally nail the concept with Fighter Within. Unfortunately, the only thing they nailed was a nomination for worst Kinect game of the year.Fighter Within has to be the first game thats ever combined its story and tutorial modes together. Instead of learning the ropes and heading into a string of battles, moves are learned and unlocked as the story progresses. Dubbed Initiation, the mode takes you through twenty one battles on your quest to something. Honestly, I have no idea what was going on during the story. You play as a fighter named Matt who looks suspiciously similar to DmCs Dante and must defeat other fighters to get a book or something and protect your clan. Its nonsensical, doesnt flow well and is hampered by awful scripting and mediocre voice acting. The captions dont even always match the dialogue and the lines fluctuate between evoking eye-rolling and unintentional laughter. Making matters worse are the character designs themselves. Theyre all either horribly generic or slightly derivative, with the female roster consisting of four woman from different ethnicities with large, partially-exposed breasts (besides one  for the exposed part, at least).Clocking in at under two hours, the mode is devastatingly short. While fighting game story modes arent exactly known for their lasting appeal, having just one character and storyline means that its literally under two hours long with little reason to ever replay it again considering over half of it doesnt have the full array of moves. Yet it manages to overstay its welcome even in its brevity and is a chore to finish. Im honestly proud I beat it as its one of the few games Ive completed that I doubt most others could get through  not because of its difficulty, but because its horribly dull. There are twenty-one bouts, but only twelve characters in the game, which means that about half of them are repeats.Of course, as this is a fighting game, the single fights and multiplayer is the heart of it. Unfortunately, none of this fares any better as the mechanics of the game are inherently flawed. You can punch low and high, hook punch, round kick, lean, guard, throw, duck, block and dodge. While that may sound like a lot, its not considering this is a fighting game. There are no special moves or anything like that, instead sticking to practically the same basic move set for every character. Punching works almost flawlessly on offense, but thats about where seamless move recognition ends. Throwing a hook is near-impossible, kicking doesnt always register on the first movement and throwing is basically a Hail Mary. On the defense side of things, blocking works so theres that. For a motion controlled fighting game to be fun, it needs to recognize every move a player makes perfectly, instantly translating it on the screen with little to no errors. Even when the game works, it doesnt do it frequently enough to make it seem like youre actually fighting or, you know, having fun.Eventually (or instantly for those who forego Initiation), Ki is unlocked, which makes matters worse by basically making actual melee combat a complete waste. Ki is a special magical ability of sorts that is charged by holding your hands in the air, allowing one of three special moves to be executed. Theres push kicks, back moves, high round kicks, swaps, slams and a few variations if youre long range. These moves are quite powerful, taking up to a fifth of a players life and surprisingly easy to execute. This means that the easiest path to victory is to simply hold up your arms for two seconds and then lift your leg. Repeat it enough times and youre guaranteed a win when playing AI. Once I realized this, I never lost a fight including the final boss. This makes single player a complete waste unless you adhere to the honor system and dont utilize it.This is certainly a game thats more enjoyable in multiplayer, it still carries all of the flaws of going it solo. Everybody I played with tired of the game within a few matches and didnt want to continue playing, which is devastating and prevents it from even being a game that can be pulled out when company is over. Frankly, I cant blame them as I would never want to experience it again after plowing through the entire Initiation and playing hours of matches for this review. Worse yet, the interface is a complete mess and simply selecting an option is an exercise in frustration. Its bad enough that I just began to have my Xbox One gamepad nearby at all times, which is practically a crime for motion based games. Even Zumba Fitness: World Party has better Kinect functionality, which is sad considering its a multi-platform fitness game.Closing Comments:", "date": "November 24, 2013", "grade": 1.5}