{"name": "BlackSoul", "ref": "https://hardcoregamer.com/?post_type=post&p=63506", "text": "Although it might be hard to believe, there was actually a time before horror games existed. There were attempts here and there, but it was with 1992s Alone in the Dark that the survival horror genre finally made it into the mainstream. Over the years, the genre has had many makeovers and is only now beginning to return to its roots with truly scary tales. BlackSoul is one independent developers attempt to create something along the lines of the original Silent Hill. The question is, does PS1-era horror still stand up today?The story certainly starts off in a way you might expect from classic horror games. A reporter named Ava has been tipped off to very strange happenings in a small town. Of course, she goes to investigate, unaware of the dangers that lie in wait. Her brother Sean becomes nervous after seeing the increasingly odd news trickling from the town and decides to bring her back. This manifests itself in the defining feature of BlackSoul  character switching between chapters. Chapters are about an hour or two each, depending on your skill with puzzles.Yes, there are a handful of puzzles that must be solved to proceed. Hints are usually scrawled somewhere nearby, but that doesnt mean the puzzles are easy. Deciphering what the pictorial explanations are supposed to mean can take a lot of work. If nothing else, it causes the player to view the problem from multiple angles until it makes sense. Unfortunately, brute forcing solutions isnt really an option because puzzles tend to have a ton of possible moves. Youll definitely need a taste for puzzle-solving to make it through.BlackSoul falls into many of the trappings that progenitors of the genre dealt with. However, not all of these can be looked upon with positivity. The controls are effectively the same tank controls of the original Resident Evil. Although certainly not unplayable, it becomes incredibly annoying to continually bump into walls beside doors, or get stuck on chairs because the controls are slow and finicky. This is worsened by the dynamic camera angles the game so readily employs. A few of the angles are actually great at inducing dread, but most just cause further screw-ups for the player. The problem is compounded when zombies are nearby.With walking controls so problematic, its easy to guess how weapon control is handled. It too is incredibly unwieldy. For most of the first chapter, youre armed with a melee weapon instead of a firearm. Getting in close to strike enemies is practically a game of chance, especially when the camera angle gives a poor view of the enemy. Guns make the process slightly easier because at least it allows for long range zombie killing. Just dont try to turn and run as turning around happens at a snails pace too. In most cases, the zombie will have sidled up to you by then and started gnawing away.In the early 90s, tank controls were the expected method of gameplay. After all, no one had really designed anything better so horror fans just learned how to work with them. It has been years since then though which is why there is little explanation for such poor control in a modern title. BlackSoul is certainly trying to hearken back to the genres past, but that does not require frustrating character control. Instead, it does well at spoiling tense moments and causing near constant frustration. This is only worsened once more enemies come into the picture, making the game over screen a nearly constant companion.The issue with controls cannot be understated because of the damage it deals to a game that could have been good. Visually, each area looks creepy, dark and lonely. The graphics arent up to snuff with the latest crop of horror adventures but theyre not horrendous either. Walking into new areas is a tense situation as is exploring darkened rooms that the camera slyly points the player toward. Its obvious that developer XeniosVision had great ideas in mind but sabotaged most of it by frustrating rather than terrifying the player.Closing Comments:", "date": "November 23, 2013", "grade": 1.0}