{"name": "Injustice: Gods Among Us  Ultimate Edition (PS4)", "ref": "https://hardcoregamer.com/?post_type=post&p=63369", "text": "Following the reboot of Mortal Kombat, NetherRealm Studios was hard at work making a proper DC fighting game. This went on to be Injustice: Gods Among Us, which proved to be an extremely successful title. Several costumes and six DLC characters later, NetherRealm Studios decided to re-release Injustice with all the DLC. This new version, known as Injustice: Gods Among Us Ultimate Edition, brings the fight to previous consoles (save the Wii U and PS Vita) and an enhanced version for the PlayStation 4. With this being the first next gen fighter for the PlayStation 4, is Injustice a good sign of things to come or a quick port you should quickly ignore?While superhero fighting games are nothing new, Injustice has great attention to detail and acceptable balancing. Every character, even the DLC, have many unique elements that make them stand out. For instance, the Martian Manhunter can stretch his limbs a bit, which opens up new combo possibilities. This is one thing that really stands out in Injustice, since it feels like its more than just a fighting game with some super hero flare. However, this also results in some balancing issues. Many of the issues were resolved with the latest patch, though dont be surprised if a someone exploits an annoying skill for victory.One of the biggest changes in Injustice: Gods Among Us Ultimate Edition is how alternate costumes are handled. Unlike the original game, where some costumes had absurd tasks and required a lot of skill to unlock, almost every costume is unlocked from the start. The only exception is the WBID skins, which are unlocked by doing various tasks in the iOS game or using the account of someone who did those things. This means you can jump right into the action and use whatever skin you want. Keep in mind, however, that the character selection screen has not be updated and will not show you what a skin looks like before the match.Since the PlayStation 4 currently lacks fight sticks, youre stuck using the DualShock 4. Before you groan in frustration, it isnt that bad. Part of the reason is due to the simpler controls found in Injustice. Unlike Street Fighter or BlazBlue, Injustice relies on direction plus attack inputs or simplified quarter turns and the like for those used to the aforementioned games. This makes inputs a lot easier, though dont think that will make the game quick to master either. The d-pad on the DualShock 4 feels less abrasive and the firmness makes the inputs easier to enter. The same is also true for the thumbstick, which isnt loose like the DualShock 3, making it a lot easier to execute a precise move with. To help you get use to the DualShock 4, dont forget to check out the S.T.A.R missions. These missions require you to master characters and do so while completing a wide range of challenges. Some of these are easy, such as jumping 20 times before reaching the end, where as others require you to get a 10+ hit combo. Every character has about 20 missions total, though this version includes 60 additional missions. These include missions for the DLC characters, plus some missions set in the Red Son story line, so there is ample training if you need it.Speaking of improvements, the PlayStation 4 version is noticeably better looking than the PlayStation 3 version. The environment is far more crisp and clear, with the characters looking better than ever. The 60 FPS also helps with inputs and timing, since everything is a lot more fluid this time around. Mind you, these arent huge differences, but more than enough to tell the difference between versions.All of this comes together in the online portion, which does support streaming. The only problem is, Injustice doesnt have a big online community. Due to its age, lack of availability, smaller user base, age of the port and a number of other factors, there are not a lot of people playing online. On average, it took me about seven minutes to match up with someone, which is quite the wait. Thankfully, every match I played was without lag and quite stable throughout. Not much can be done about this, though the community will likely grow over time.Closing Comments:", "date": "November 22, 2013", "grade": 4.0}