{"name": "AquaPazza", "ref": "https://hardcoregamer.com/?post_type=post&p=62882", "text": "Upon first glance, some people will jump to conclusions about AquaPazza: AquaPlus Dream Match. After all, its a 2D fighter with a heavy anime influence that bears a striking resemblance to countless other games of its kind. Moreover, its budget-priced at $29.99, which some will scoff at, immediately writing it off as less-than when put up against fighting giants such as Street Fighter, Blazblue and King of Fighters. But making such hasty assumptions about this humble brawler would be simply unwise.Yes, the genre fad continues with Aquapazza; and what do we mean by that exactly? Well, much like Marvel vs. Capcom, Street Fighter x Tekken and even the old-school fan-favorite Fighters Megamix, Dream Match is a crossover fighting game that features characters from across various AquaPlus and Leaf-developed franchises. Now, for the general Western gamer, that may not mean a whole lot. After all, if youre not into niche Japanese gaming and/or visual novels, then series such as Utawarerumono, Tears of Tiara, To Heart, Kizuato, Routes, Comic Party, and White Album wont ring a bell. But even without knowledge of those IPs, the fun and overall madness isnt stifled in the slightest, because really the characters merely serve as a backdrop to a deeply nuanced fighter that is every bit rewarding as it is challenging. Despite the candy-coating, anime aesthetic, AquaPazza is in fact a tournament fighter. To that end, it employs many of the conventions weve come to expect from a game of its caliber. Two fighters duke it out until one is left bloodied, beaten and without their health bar. Its that last aspect thats different in Dream Match. Combatants dont just have one life bar, they have two; essentially, once one has been depleted, they then have a second. What this ultimately means is that rounds are longer and, by proxy, more tactical. Deciding when a punishing barrage is worth possibly losing some health is always on the mind of the consummate fighting fan  here, however, that dilemma is on full display due to the aforementioned health system that is most akin to something like Killer Instinct or Vampire Savior.At its heart, AquaPazza is a four-button fighter. This equates to weak, medium, strong and assist attacks, of which the latter type are carried out by a sidekick that is chosen at the character selection screen. Interestingly enough, though, players dont choose from the existing roster of faces when picking out their assistant; no, these characters are given their own separate pool. And just like the basic attacks, assist flurries can be delivered with the press of a face-button by itself, or in conjunction with a direction. On that front, Dream Matchs moves are pulled off in all of the typical manners: quarter rolls, charges, specials and combos chained into super moves  its all here. So when folks sit down with the game for the first time, they will immediately know how to play. From there, its all about mastery over the thirteen available characters. On the topic of roster, some people will swiftly balk at the rather limited number of fighters from which to choose. While doing that may be justified, the fact that each of the combatants play so radically differently means that AquaPazza is truly a case of quality over quantity. In fact, the game sports some of the most unique characters in any fighting game thanks to how distinctive each plays. The champions feel more analogous to those found in Guilty Gear than they do Mortal Kombat, meaning that it takes time to learn how to play due to how different each one controls. Movesets are particularly eclectic and utterly differentiated, making learning how to play each person, in addition to understanding the defense meta, a feat as well as integral to competitive survival. Furthermore, how a character traverses the screen is also a vital key to making it through each round alive. Ultimately, movement itself is not standardized across the roster. So again, specific characters are going to get around in very unique ways: some can jump, others can super-jump. Some run, while others dash, hop and unleash all manners of movements exclusive just to that character.Speaking of the subtleties, Aqauapazza wouldnt a fighter worth its salt if there wasnt a bevy of complex mechanics underlying the seemingly accessible gameplay. What does that mean, youre screaming in your head. Well, in essence, its to say that this isnt a shallow fighter at all  quite the opposite, really. And if folks are thinking they will be able to get by simply via shotoing it up (read: throwing out a hadoken- and shoryuken-esque moves, along with a few other fancy analog inputs), then they have a rude-awakening waiting for them online. Move cancels are a regular thing here, thus turning a weak attack into medium one, which can then cancel into strong attack, likens this experience to that of any other combo-intensive fighting game on the market. It doesnt stop there, however: normal attacks can cancel into specials, which can in turn cancel into supers. This is typical stuff, really, for anyone whos kept abrest of 2D fighting systems over the past generation. Theres also a five-stock meter which can be depleted one at a time via supers, or drained three meters at a time by a mega powerful super move. Common stuff at this point in the proverbial game, but nevertheless sound, solid and gripping for anyone who gets a high off stringing together massive combo-breaking bombardments. And pulling off enormous combinations is easy thanks to responsive controls. Perhaps whats makes AquaPazza stand out among a very crowded genre are two particular components: the universal health-damage system, and the active emotion mechanic. The former makes it so that health and damage are uniform across all the fighters. So, each person requires the same amount of hits to die, and each normal attack deals out the exact same amount of damage. Therefore, the flow of combat comes down to move-output potential. Thus, how one utilizes their characters particulars and combo capacity means more than anything else. This is used as a means of balancing gameplay, and in that regard, it mostly succeeds. It may take some getting used to for those who are familiar with certain characters in fighting games being inherently stronger than others, but once its understood, it actually makes matches all the more competitive, and as a result, meaningful.The second factor that Dream Match stirs into the pot is the aforesaid active emotion system. This convention grants characters the capability to hulk up or lose power as the fight goes on. Players who are ruthlessly aggressive, constantly pushing an opponent, will become more powerful through an emotionally-heightened state. While in this condition, they will inflict bonus damage with all of their attacks and take less damage consequently. Enhanced attacks of this kind also carry with them the opportunity to stun, making it more possible to deliver new types combos not otherwise available. Conversely, turtling and just generally playing like a scrub will lower ones emotional state, which opens folks up to taking increased damage and the like. Truly, its a sleek system that adds yet another layer of depth to the axiomatic cake.What would a fighting game be without an obligatory online mode? In our time with AquaPazza, the netcode was strong, and we rarely encountered noticeable lag. That being said, the number of options for internet play is far from robust. Theres ranked matches and player matches, both of which include very little customization options. Naturally, theres a replay feature, in addition to player data storage which crunches numbers and statistics for ones performance, as well as global rankings. Outside of that, and along the lines of available offline modes, theres a handful to check out. Theres a story mode (although the tale being told is about as interesting as watching paint dry), an alternate story mode (which gives each character an additional plot, which is equally as ho-hum), versus, a solid training feature and a gallery. Its a decent suite of options, and enough to keep the hardcore busy. The enemy AI is a bit of a mixed bag. For instance, playing through the story on normal mode will be a cake walk until the final boss. The final act will be sure to blindside folks, especially those who are still learning the systems at play, as without having a decent grasp on combos, players will get worked like a part-time job in the last fight. On higher difficulties, the AI puts up a good fight in general. They rely on combos just as heavily as is asked of players, and thus provide a good back and forth. Of course, theres nothing like a true human opponent, so spending time online or via local play is highly encouraged.Some folks may not find the anime aesthetic easy to get past. All of the usual suspects are on parade here: lots of gals, pronounced female attributes and shrieking voices that come off as nothing short of annoying at times (and we tend to dig that sort of thing). Now, if people can get over archetypal anime window-dressing, the sprite work is fluid and expressive, crisp and vibrant. Truly, the sprites and the colorful backgrounds are impressively clean and wonderfully assorted. This all offsets the excellent aural presentation, as well. The audio is divergent throughout, giving each character and stage specific themes that bring the action to life like marionettes on a string. On the downside, the menu interface leaves something to be desired, as its decidedly bare-bones and lacking any kind of remarkable pizzazz.Closing Comments:", "date": "November 19, 2013", "grade": 4.0}