{"name": "Resogun", "ref": "https://hardcoregamer.com/?post_type=post&p=62688", "text": "After the delay of some of the major launch titles for the PlayStation 4, all eyes have turned toward the few remaining marquee titles available at the consoles release. Among these are the download only exclusive Resogun, from the developers responsible for Super Stardust HD, Housemarque. Being free for PlayStation Plus members, Resogun stands to be one of the most played games of the PS4 launch, but is it worth your time?While Super Stardust was basically a modern homage to Asteroids, Resogun is the same concept applied to Defender. Like Defender, Resogun take place on a horizontal plane that infinitely scrolls from side to side. It is technically a dual joystick shooter, but unlike most you can only fire horizontally as opposed to the 360 degree aiming control of Super Stardust. While those accustomed to traditional dual joystick control in these types of shooters may be disappointed, the game doesnt suffer because of its controls.When you get right down to it, Resogun is immensely fun to play. The game is comprised of five levels and the challenge increases with each, resulting in many deaths even on the normal difficulty. In each level you start with two lives and two screen clearing bombs and are tasked with surviving until the boss arrives. The game is as simple as shooting enemies without getting hit, but the core action is extremely tense and incredibly enjoyable. This is the kind of game where relaxing your mind and just trusting your instincts and reflexes may actually be more effective, and theres nothing quite like that feeling of being unstoppable when you are totally locked in and reacting faster than you knew you could.In addition to main goal of simply surviving through to the boss, there are also ten humans to rescue on each level, though doing so isnt essential to progress. Rescuing humans is important, however, because you are rewarded with points, items (bombs, lives) or weapon upgrades every time you save one. Unfortunately, the game doesnt really explain how rescuing humans works, so its likely to take most players a while before they realize that defeating special enemies which appear at predetermined times is the only way to create opportunities to save humans. This information is in the digital manual, but its never actually explained in the game.Arcade mode is the standard mode of play for Resogun, which is simply a journey through each of the five levels in order. You can start on the level you left off once you run out of lives, but your score is reset. You can also choose to play a single level you have unlocked or play online co-op with another player. Each of these modes has their own leaderboards, which is essential for the replayability of a score focused game like this. The game also has three different ships to choose from, with each having their own statistics and characteristics. While all off these elements lend to great replayability, one thing that hurts that aspect of the game is the level variety. Because of the nature of the game, the differences between levels are mostly just cosmetic. Also, because your focus is on the action and each level has a very similar color palette, its often hard to even tell them apart in the heat of the game. Of course, each level has different enemies and bosses, its only aesthetically that they are very similar, which is still somewhat disappointing.The first thing that will stand out about Resogun for most people are the visuals. The game is soaked in neon and is supremely flashy. The question on many minds whenever a new console generation begins is whether or not a particular game looks next gen. From a visual fidelity standpoint, Resogun doesnt really jump out as something that couldnt have been done on the PS3, but other aspects of it definitely make use of the extra processing power. The game is just stuffed to the brim with particle effects and it runs at a silky smooth frame rate in 1080p. Adding to the high presentation quality is the fantastic sound design, with upbeat techno music and impactful sound effects.Closing Comments:", "date": "November 17, 2013", "grade": 4.0}