{"name": "Baldurs Gate II: Enhanced Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=62572", "text": "Role playing games have come and gone over the years, some fade soon after their launch, some may manage to gain a fair bit of notoriety and then fade from gamers collective memories, but a select few manage to put together a package that serves as a testament to their genre demonstrating to later generations just how its done. Baldurs Gate II: Shadows of Amn is undoubtedly in the latter category and Baldurs Gate II: Enhanced Edition is here to make sure that the current generation of gamers knows that, while giving old school gamers a fresh perspective on an old classic. Many RPGs claim to be epic, but Baldurs Gate II: and thus its Enhanced Edition is truly the epitome of the word.If somehow you didnt know Baldurs Gate II, it is an isometric view CRPG released all the way back in 2000. It is based on the Advanced Dungeons & Dragons 2nd edition ruleset, and when released it was hailed by many as the pinnacle of its genre garnering itself high scores across the board from professional gaming media and players alike. And while the years have brought newer games with updated engines and 3D graphics, like any good 2D game, Baldurs Gate II has stood the test of time aged very well. But that doesnt mean that it couldnt use a visual facelift. Thats where Baldurs Gate II: Enhanced Edition comes in.The amount of content of Baldurs Gate II: Enhanced Edition is absolutely staggering. Not only do you get the main Baldurs Gate II: Shadows of Amn, but also the expansion packs, Throne of Bhaal and combat centric Black Pits 2: Gladiators of Thay along with four new NPC characters that you can recruit to your party. Just the main game alone has hours upon hours of real actual gameplay, with a meaty and epic main quest and side quests that seem to never end. The story is as epic and memorable, with NPC driven dialogue filling in the lulls with either humorous banter or serious relationship building inquiries. The inner party dialogue is of course dependent on who you have in your party, which can vary quite a bit because there are so many to choose from giving Baldurs Gate II a ridiculous level of replay value.Of course this variety does not end with the party NPCs. Baldurs Gate II of course allows players to build their own hero, from the ground up and the level of character customization in Baldurs Gate is great (and necessary for a game bearing the D&D brand). But it can also be a problem as it lends itself to a lack of accessibility. Players new to Baldurs Gate style of mechanics will find themselves faced with an intimidating amount of options of which to build either a useful character, or a not so useful character that may have too many stats in unnecessary attributes for their class. The game does offer pre-built characters for this though, and its suggested that new players use them. Of course if you really want to build your own there are a lot of places an enterprising new Baldurs Gate II player can go to get general advice on how to build a character and what classes you would want to have in their party. The user interface and general party management is also something that many new players will have to take the time to really get to know, but once you get the hang of it the adventuring is a blast, and due to the enormous amount of content, feels like it will never end (in a good way). The lore is all there, the items, the dungeons, the enemies, the expansive cities and numerous locations to explore. Its all there, and thanks to the enhancement of the Enhanced Edition it has a nice new coat of polish on it.While Baldurs Gate II: Enhanced Edition boasts gamplay tweaks and other gameplay enhancing features that smooth out the experience, perhaps the most outstanding feature of the Enhanced Editon is the visuals. They arent exactly PS4 quality, but Overhaul Games managed to take the 2D visuals of the Infinity Engine and make them look good on a high resolution widescreen monitor. The look of Baldurs Gate II is of course timeless. The already high quality art was remastered and the enhancements actually manage to make it feel like a game that belongs in 2013. The sprites are sharp and crisp (unless you zoom in, but this is understandable), the backdrops are gorgeous and expansive, and the game as a whole greatly benefits from this visual polish. Having the expanded view and crisp visuals gives more of a birds eye view and helps the game to feel a lot more open. The user interface is also nicely updated, giving the game an overall nice feel of visual polish.Closing Comments:Baldurs Gate II is not a game to be missed. With an epic story, memorable characters, hundreds of hours of dungeon crawling, questing and adventuring, Baldurs Gate stands tall among the classics. The Enhanced Edition takes all that (and then some) and wraps it in a much more visually pleasing package that will be more acceptable to modern gamers. Old fans of the game have good reason to come back, and new players may find themselves overwhelmed at first, but taking the time to learn the ins and outs of this classic CRPG will pay dividends.", "date": "November 17, 2013", "grade": 4.5}