{"name": "Gorogoa", "ref": "https://hardcoregamer.com/?post_type=post&p=283236", "text": "Well, this was a long time coming. It may be easy to forget since it was quickly dwarfed by other games, but Jason Roberts Gorogoa first debuted over five years ago, with the lone designer having been working on it ever since. A puzzle/adventure game with a unique four-panel approach to storytelling, it made a lot of terrific first impressions and did well on the indie circuit. But now, with the help of publishers Annapurna Interactive, the finished product is finally ready for release. And naturally, this leaves us to ask the obvious question: was this fantastical comic adventure worth the wait?The setup for Gorogoa isodd, to say the least. At its most basic, its about a kid attempting to collect five various fruits. Of course, why hes collecting this fruit involves the presence of a large dragon-like figure, then events get presented in a non-linear fashion, and things quickly turn into a tale about spirituality and religion. It is indeed one of those stories that you really need to check out in person, full of several clever scenes and twists. Its also a purely visual trip, with everything being dialogue-free, relying only on the city settings and ruins, occasional word bubbles, and character actions to tell everything, which it all does incredibly well.But one could almost argue that this is a case where the story, incredible as it is, actually gets outshined by the gameplay. It seems simple at first. You have four spaces, two by two, that you place various panels on, with the goal being to have them intersect in the correct ways so that you can advance. You click and drag panels, and click on the panels themselves to move around and zoom in and out when the options becomes available. Simple as that. And you begin with equally simple examples, like getting three panels to zoom in on a branch with a bird and fruit on it to get the bird to rustle the branch and drop the fruit into a bowl. Reach a dead end for our main character? Look around one of the panels for a connecting path that leads onward. Of course, like any good puzzle game, things never stay that easy. Gorogoa easily has some of the best puzzle design among this years games, always remaining just challenging enough while still being fair. Experimentation is the key here, as well as being able to recognize patterns that may match up. The best moments are the ones where you truly have to think outside the box and essentially warp reality. For example, one puzzle has you turning a simple small stone in a study into a massive boulder when it falls down and goes into the next panel, which you then have to switch into a stone again to break a jar, all which requires proper timing as you swamp the two panels back and forth. Another sees you overlaying a panel of a man climbing a staircase over a sun-like design to create a massive gear, powering a rotating mural in what is essentially another world to get to another scene that you need in a different panel to create a path.Actually, trying to explain Gorogoas puzzles isnt really doing them justice. Its the type of trippy, experimental art that needs to be checked out. There are even some particularly cool touches such as still being able to move around panels while a cinematic plays in one of them, meaning that you can briefly explore other surroundings, puzzles, and even other parts of the story as it goes on. And unsurprisingly, said cinematics and artwork are absolutely drop dead gorgeous, with Jasons artwork being nicely detailed and perfectly blending realistic cities with fantasy elements (and even seemingly evoking pop-up books with the puzzle where you overlay panels, to great effect), full of unique architecture where all the parts are designed in such a way that they connect perfectly, even when one is in a completely different timeline and location. Simply stunning. So to recap, Gorogoa is a beautiful, hand-drawn game with a intriguing narrative that it emphasizes, along with unique, even complex mechanics that make for great puzzles, all designed by a one-person team andokay, lets not beat around the bush any more. Like a lot of other games that boast similar pros, Gorogoa does have one notable flaw in that its short. Like, really short. Seventy-eight minutes, in fact. I know this because as the shortest game Ive played this year, the games page in my Steam library was actually able to give me the exact time instead of rounding it up. It kind of take some of the wind out of the sails when you realize that the demo you played at PAX was one whole quarter of the game.Now yes, Ive gone on again and again and again about how being a short game isnt necessarily a major flaw. And of course, its understandable that a one-person team is going to be limited when it comes to how much they create in a game such as this. But the question one should always ask when it comes to a games length is Did this game do everything it could possibly do in the time it had? And with Gorogoa, there is this nagging feeling that it could have done at least a little bit more. It does sadly reach its finale just as its puzzles are becoming their most creative. Maybe if there was more to the climax (or even a sixth fruit), it could be an absolute classic. Closing Comments:While Gorogoa is one of this years shortest experiences, its still one thats worth checking out, as it turns a relatively simple idea into one of the years most compelling and innovative puzzle games. Its eye-popping artwork may draw you in, but its the superb brain-teasers where you warp around entire worlds and a narrative that leads to some surreal visuals which will keep you hooked until it ends. You may never look at a mere four comic panels and the storytelling that can potentially occur in them in the same way again.", "date": "December 13, 2017", "grade": 4.0}