{"name": "Creepy Brawlers (NES)", "ref": "https://hardcoregamer.com/?post_type=post&p=282751", "text": "Gaming has changed and evolved quite a bit over the past few decades. For instance, purchasing a new game nowadays requires impatiently waiting for the game to install and download any updates and patches, which can range anywhere from just a couple minutes to several hours. This inconvenience was not always the case as it used to be whenever a new game is purchased it was ready to go into the console with no installation or updating required, just some blowing into the game cart that could range anywhere from just a couple minutes to several hours. Hardcore Gamer isnt the only company bit by the nostalgia bug, which is evident in Creepy Brawlers, the new game for the 8-bit Nintendo Entertainment System released by Mega Cat Studios.Creepy Brawlers is the tale of an individual who has a unique experience when he goes to the movies. A movie theater is screening classic horror movies, which are met with boos and shouts of boring, not scary from a heckler in the audience. During this heckling, a spectral hand reaches from beyond, plucks the trash-talking moviegoer and deposits him beyond the veil of the silver screen. Normally a situation like this occurring in a horror movie would be indicative of eminent evisceration but something even stranger happens: our hooded protagonist laces up some gloves and steps into the ring with a zombie. The story progresses through some tongue in cheek dialog cutscenes in between matches.This zombie were matched up against is a bit tougher than the average glass Joe, but not by much. He may have been part of the Olympic track team zombies from the Dawn of the Dead remake with Sarah Polley and Ving Rhames since he is pretty spry (for a dead guy). Nevertheless, he isnt a tough opponent and his mean function is a tutorial opponent for the more difficult fights to happen down the road such as the Bride, the Alien and other ghoulish greats from the silver screen of decades past. There are some great boxing games that have been made over the years, but the championship belt goes to Mike Tysons Punch-Out!!, later retitled Punch-Out!! when Nintendos contract with Kid Dynamite expired and his star was no longer shining as bright to justify renewing it. Creepy Brawlers wears its Punch-Out!! influence proudly on its trunks. The influence is so apparent that if this title fighter was released thirty years ago it would be called a rip off instead of homage. As it stands, Creepy Brawlers is seemingly a tribute to the NES classic, and while it doesnt take the belt from the champion it is a worthwhile contender.The premise of Creepy Brawlers is to bring back the game mechanics of Punch-Out!! Each of the classic horror themed opponents have their own fighting style, and like its main influence the player will need to learn how each of these monsters approaches the sweet science and develop a strategy of attacking, dodging and counter attacking in order to win the match. The mechanics themselves are quite simple, moving left and right dodges and one button punches with the right the other punches with the left. The only way Creepy Brawlers could be anymore like Punch-Out!! would be if this was simply a reskinning job of the original. Thankfully this is not the case, and while this follows the NES classics formula to a T this is an original game and these monsters have their own fighting styles so while Punch-Out!! proficiency carries over the memorized strategies of the boxers will do the player absolutely no good. A few opponents will be fought more than once, and during the rematch theyve naturally done some training and gotten tougher with a slightly different approach. The challenge for Creepy Brawlers lies in that the player will lose a fight if they approach it the same way they handled the previous fight. The Werewolf, Frankenstein, Dracula and everyone else all have different styles and beating them requires the player to master the timing in responding to the clues they give before the move and learning each of their patterns. Its challenging, but challenging in a way where when the player finally bests their opponent there is a certain satisfaction and sense of accomplishment.Unlike other modern 8-bit titles like Shovel Knight and Axiom Verge that look like relics from the Paleozoic era but actually take some advantage of modern hardware, this is a legit NES cart, so all NES limitations are in full effect. This includes the limited color palette, chiptune soundtrack and controls that dont feel quite as tight as what weve seen on more recent games though for NES standards the technical areas are up to par. To make the title feel more contemporary there is an achievement system for accomplishing certain feats within the game, though this being an NES title these achievements are forever confined only to this title and no online play to brag to ones friends. Closing Comments:Creepy Brawlers is a blatant Punch-Out!! clone and mainly exists for people who find the novelty in owning an NES game released in 2017. It doesnt surpass its main influence but is actually enjoyable in its own right. While there is fun to be had, this would primarily function as a collectors item or conversation piece outside of the most hardcore retro gamer. As a nostalgia-driven game, it serves a dual purpose of reminding us how fun games with simplistic yet skill-based mechanics can be but also makes us appreciate how far games have come.", "date": "December 12, 2017", "grade": 3.5}