{"name": "The Good Life", "ref": "https://hardcoregamer.com/?post_type=post&p=412636", "text": "Two of my favorite films of all time  Hot Fuzz and Groundhog Day  share a hefty chunk of their premise with that of The Good Life. A apathetic  bordering on anti-social  main character of city dwelling finding themselves (involuntarily) in unfamiliar, small-town surroundings. Trying their best to grit their teeth, get on with their job and bear the sudden culture shock its inhabitants  traits and all  brings. Eventually, possibly as a consequence of the abnormal circumstances that take hold, they warm up to the citizens and the locale alike. Its no coincidence that appreciation for these kinds of story pitches also revolve around small-town, seemingly-unspectacular settings. A result, admittedly, of ones own living in small-town/village surroundings alike. But gravitating towards a game like The Good Life is a result of more than just an appealing aesthetic.It also helps that this is also the latest title from Hidetaka Swery Suehiro and his recently-established White Owls studio. A director and writer that has tended to focus in on the eccentricities and subtle attractions in the most mundane and subdued of locales. Finding ways to have those same uncanny methods translate into gameplay terms; flawed a debut outing for the team it may have been, The Missings odd requiring players to voluntarily decapitate (or at the very least injure) themselves so as to solve puzzle-platforming segments spoke fittingly to Swerys career as a writer and director whose games, divisive they may, were never shy of getting unashamedly weird. That weirdness may not speak to everyone  think of examples of extremely-polarizing games and 2010s Deadly Premonition is sure to be one of the first names people raise. But as someone having respected Swerys past work  be that directly or even at a distance  and as noted, holding such a precise real-life background in so far as living surroundings are concerned, The Good Life on paper seems more than a ideal trip to venture through. Meagerly appealing to a niche-within-a-niche that prospect may inevitably sound to everyone else.So then, its up to another one of the games pre-release angles to potentially back up its aesthetical focus. The premise that the citizens of Rainy Woods  this seemingly humble, isolated village in the middle of nowhere-England  transform into cats at night. A fate that quickly lands at the heels of the protagonist, photo-journalist and New Yorker Naomi Hayward. A peculiar turn of events, you might assume. One that perhaps if not dictates, then plays a pivotal role in gameplay terms, given how focally-central to its marketing that concept has been  both inside and outside the somewhat-turbulent crowd-funded period. It may surprise you to hear that the notion of transforming into a cat (added to later on by a dog counterpart) in the end plays a severely lesser role than previously suspected. So too a similar assumption that a supernatural phenomenon such as this will come to define the tone and overall progression of the narrative. A narrative that come the end of its prologue separates into three stand-alone cases to solve in order to reach the true ending conclusion. Nope: thats strike two on ones assumptions on what direction this game is going for. So then, a game all about moseying on through a village and its surrounding environment will surely lead to those same absurd-though-delightful spots of world-building. That in some way, stitch your overall play-time into a coherently-incoherent series of Twin Peaks-esque scenarios, right? Can you guess where Im going with this.Even with its attempted authenticity of English countryside living and its admittedly-novel replicating of typical, day-to-day village-life normality, The Good Life is generally not a game youre going to find much enjoyment in actually playing. And as charitable my own perception may be given the aforementioned experiences with such a setting, all the cobbled walls and locally-owned shops and hotels of Rainy Woods cant counter a game whose, shall we say, constrained budget makes itself be known in numerous ways. Flat, polygonal walls whose stone textures still proceed to pop in at a close distance; environmental detail limited to but the most randomly-dotted of grass-blades. Pre-rendered, transitionary cutscenes that (awkwardly reminiscent of last years dire XIII remake) give the impression of having been produced at a much lower resolution/bit-rate than necessary. Even character/object models you cant help but offer dismissive comparisons to that which youd see as standard in a N64 game. Its so off-putting that the intended low-poly stylings of the characters feel less like a committed artistic choice, or at least one that isnt committed to any worthwhile way. Walking/running animations limited to but a handful of awkward move-sets only reaffirming the questionable, unpolished state.But hey, maybe theres an intriguing gameplay loop or assembly of systems to salvage such underbaked visuals? Sadly not and while there are sprinklings here and there that are at least odd and novel, its here specifically where The Good Lifes end delivery falls apart in disappointing circumstances. For most of the time spent with the game, players are required to keep an eye on the in-world time which, much like real-life, revolves around a 24-hour, seven-day cycle of schedules and periods with which Rainy Woods citizens all abide to. Meeting characters at certain times, taking into consideration the opening/closing times of pubs. Even the necessity to return to your temporary accommodation once the sun sets to catch up on some much-needed sleep. Theres attraction with this lite simulation-esque loop and when the game leaves you to your own devices, the scenes you discover are nice in their own brief way. The fact some characters gather by the church on Sunday mornings, fleeting it might be, works. And it isnt long before you reflect, with slight bizarre realization, youre playing a game that at times revolves around waking up, keeping to a schedule, going home to prepare a meal and check your PC before heading off to bed.When it leaves room for these life-reflecting quirks to naturally emerge during play, The Good Life does harbor something reminiscent of appeal with its ordinarily-tempered presentation. Its when everything else gets in the way, where player charity quickly wanes, leaving only frustration in its former spot. A lot of this has to do with the survival-like mechanics. Keeping ones health, stamina, hunger and mental state topped up sufficiently sadly feels too invasive. Not just on the basis that itll mean youre scrambling/fast-traveling to a nearby restaurant or unlocked camp-site to keep the numbers topped up, but currency in The Good Life is surprisingly scarce with the jacked-up buy-in requirements only adding to the feeling of uncertainty on just how much you can spend in the game at one time. Sure there are side-quests to involve yourself with and optional check-lists to complete, but outside of a continuing longing for photos to snap (especially those that pertain to desired key-words and hashtags that reset every few days), the survival aspects of the game quickly begin to weigh against what semblance of joy one can have in simply exploring the environment put before you.It doesnt help either that the game is riddled with one too many road-blocks or blatant attempts to stretch the run-time. One example requiring you to fork out hundreds of pound sterling all for a mere camera lens. Another requires you purchasing a pick-axe to mine for resources, all while the game makes no attempt to explain beforehand its an objective-pivotal resource, resulting in a wasted trip to one corner of the map. It wouldnt be as frustrating had the game world provided anything beyond the occasional landmark punctuating field after field of baron emptiness. The attempt at replicating the authentic experience of traveling amidst English countryside is appreciated, but that doesnt mean the general loop is any less laborious. A loop defined sadly by overdrawn fetch quests and spots of exposition where characters are given too little opportunity to flex their barely fleshed-out personalities. And no, repeating the same lines over and over does not result in a memorable, let alone likeable, character.Some puzzle-solving is required in the briefest of spots  the point where your cat-or-dog transformation skills factor in  but these spots are not all that deep. Worse, something as simple as jumping between ledges or over a wall in animal form is cumbersome and brings to light on occasion the games unique interpretation on what constitutes as an invisible wall. Even at its most crucial, when attacking wildlife for food/materials comes into play, the lackluster animations only exasperate the unpolished state. Eventually one gets tired of even putting in the effort, for example, to compile a varied amount of food to cook and youre left to binge Jacket Potatoes  one of the most basic of recipes  because it provides a sufficient enough solution with minimal time wasted. Theres simply little incentive or leeway the game provides to make any of its survival aspects all that interesting or vital to deal with. And thats without mentioning the annoyance of having to stock up on something like Cold Medicine because you know full well that ailment is only going to come back ten minutes after remedying it.As noted, the only real highlight to remark with The Good Life is the perpetual loop of snapping photos. As presented in its story pitch, Naomis ridiculously-large debt to pay off (why, the game barely explains nor cares to elaborate on) narratively-wise,presents the opportunity for her to make money by taking shots of objects and people that pertain to trending topics online. In terms of gameplay, this simply means players taking note of the trending terms and going out, hunting for the desired photos. While the game does sadly caption every object/person  making the notion of personal deduction entirely irrelevant  theres novelty to the idea of gathering items together in one spot in order to maximize the possible monetary return. The idea of carrying a potted flower from someones front yard to have it in the same frame as a shop window is one example of the kind of emergent absurdity that in brief spells gives The Good Life much-needed attraction but sadly, is confined to that of an optional distraction. Closing Comments:While the daily ongoings of Rainy Woods and its surrounding environment can rustle up a brief oddity or two, Swery and cos latest round of eccentric antics with The Good Life sadly doesnt go far enough in its set-up to feel all that compelling. Let alone, excuse or perhaps mask the otherwise unpolished and mechanically-rough controls and design alike. But where the primarily-marketed pitch of cat-and-dog transformation seldom goes anywhere beyond the briefest of requirements, its the reliance on overdrawn fetch-quests  not to mention the ill-measured cost to access resources and landmarks  that signal the biggest culprit in fundamentally turning a lot of people off progressing. Squint hard enough and you may latch onto some modicum of intrigue with the mechanics it offers and the objectives it poses. But for anyone inexperienced with Swerys past work  let alone those who simply dont take well to ample busywork  The Good Life is unfortunately equal parts unappealing and unsure on just what kind of game it wants to be.", "date": "October 18, 2021", "grade": 2.5}