{"name": "Journey of a Roach", "ref": "https://hardcoregamer.com/?post_type=post&p=61364", "text": "German developer Daedalic Entertainments point and click adventures are notable for being visually arresting and well, not much else. Their game worlds are brought to life with striking, colorful visuals and detailed (if not particularly good) animations, then beaten back to death with god-awful voice acting and writing. They highlight the folly of allowing developers for whom English is a second language to localize their own content. I call this the David Cage effect.Daedalics newest game, Journey of a Roach, attempts to sidestep these problems by abandoning dialogue altogether. Instead, the game takes an approach similar to Amanita Designs Machinarium and Samorost, using simple pictograms, animation and audio cues to convey its story of man-sized mutant bugs journeying beneath a nuclear wasteland to find a flower. In abandoning their weaknesses, however, the studio has also cast aside their greatest strength, trading gorgeous 2D art for a cel-shaded 3D look. In short, this feels very different from their previous output, which is always a huge gamble for a studio to take.Does the gamble pay off? In a word no. The 3D graphics are stiff and basic, with engine-default shaders and simple, flat textures used to evoke a rough, sketchy style that doesnt quite work in motion. This carries through to the games hand-scrawled cutscenes,  which look more like storyboard slideshows than finished work (half the drawings dont even have backgrounds). The game looks more like student work than a commercial product, but that brings with it some benefits as well.Like the vast majority of student game projects, Journey of a Roach takes a standard, predictable genre and mixes things up with a neat gimmick. In this case its the very bug-like ability to walk on walls and ceilings, which allows our roach protagonist, Jim, to tackle puzzles from a more vertical and three-dimensional perspective. The challenge of remembering which way is up while navigating twisting air vents and cavernous rooms certainly adds a wrinkle to the standard adventure game formula, and allows for some clever level design.Unfortunately, that cleverness doesnt extend to the puzzles. Though there are a few cool moments scattered throughout (mostly built around the unique movement mechanics), this journey is largely mired in adventure game logic. Making progress feels less like solving a logical puzzle and more like figuring out what the designers wanted you to do. On occasions when the pictograms are too obtuse and unhelpful for that, you have to resort to the tried and true method of rubbing everything on everything else until it works.As if that werent the height of tedium already, the stiff controls manage to exacerbate it. The game was clearly built around a gamepad, but it was built about as poorly as anyone could conceivably manage. Movement is fairly straightforward, but making use of the inventory (which needs to be done frequently) is a proper headache, requiring that your thumb jump between the right stick and face buttons in order to navigate and select items. Why the left stick, d-pad, or bumpers couldnt be used instead is beyond me, but whats here is unwieldy and unpleasant to use.Tedious as the game can be, it almost feels like a blessing that its so short. Clocking in at little over 2 hours when played at a leisurely pace, Journey of a Roach offers half as much content as your average Telltale episode at three times the price. Now, Ive always been an ardent believer that quality trumps quantity when it comes to the value of a game, but when youre lacking in both, thats kind of a huge problem.Short and simple though it is, the games story still manages to meander and get entirely lost by the end. After a few diversions waylay the journey to the flower, the focus of the plot shifts entirely to Jim trying to rescue his friend Bud from an army of fascistic, bomb-worshipping ants, and then to stealing a nuke so the pair can ride it to the moon, because of reasons. They do find the flower in the end, but its entirely by accident. The plot is in essence just one giant, painful attempt at being random and wacky, and while it manages to evoke the occasional chuckle, it mostly just succeeds at being bland.Bland is just about the perfect word to sum up Journey of a Roach. Its simple, inoffensive and uninspired. The character designs are a hodgepodge of adventure game NPC tropes filtered through an insectoid lens, and the environments could have been stripped from the early concept art of almost any post-apocalyptic game. The music is repetitive and mildly irritating at best, and the sound effects are just kind of there. This whole game is just kind of there.Closing Comments:", "date": "November 8, 2013", "grade": 2.0}