{"name": "Batman: Arkham Origins", "ref": "https://hardcoregamer.com/?post_type=post&p=60055", "text": "Licensed products have always struggled experimenting within the confines of an existing universe. The number of titles that have been successful in their transition to the video game market is minimal, but at the top of the list is the Batman Arkham series. Warner Bros. is looking to capitalize on Rocksteadys hard work as they have assigned the origin story of our masked hero to their Montreal studio. Given the solid framework, can the new developer do Batman justice, or has the hero fallen into the wrong hands?While the title may suggest this to be the origin of how Bruce Wayne became who he is, its more of a prequel to Arkham Asylum than anything else. The game takes place a little while after Batman came into the picture as hes still considered an urban legend by most. The story is by far the most intriguing and captivating part of the package as it tells how the relationship between our hero and a number of villains came to be, most especially The Joker. The Black Mask, also known as Roman Sionis, puts a fifty-million dollar bounty on Batmans head and it sparks the attention of a number of high level assassinations, ultimately populating the world full of dangerous foes.Origins is a love letter to all Batman fans as it includes some of the longest running villains from the DC Universe such as Deadshot, Deathstroke and a female version of Copperhead just to name a few. The only problem is that because there are so many antagonists in Gotham City, their part in the story is spread out too thin. Most of the antagonists play insignificant roles, specifically involving a cutscene, a boss fight and then their capture. About half of the roster is assigned to side missions that mainly consist of a single, unfulfilling scenario. With that said, though, there are some incredibly memorable moments spread throughout the campaign, and a single surprising twist early on. I just wish Jokers part wasnt as significant as it is, because its as if Warner Bros. is banking solely on that character alone to drive each game. He is once again the key pillar behind the story, and while there are some interesting tidbits that develop his character immensely near the end of the game, surely there are more arch rivals than just the wide-mouthed psychopath that are deserving of attention.Those familiar with the past two games will feel right at home with the mechanics of Arkham Origins as it doesnt stray too far from its roots. The freeflow combo system is back and is pretty much the same with some minor alterations here and there, but thats an issue. While its still as good as ever, the way its implemented throughout the campaign is rather tiresome and will leave existing fans wanting something more. You can only beat on the same four or five types of thugs before gameplay becomes tedious. The formula doesnt change no matter where you go as its either engaging a group of enemies or stalking them in a specific room. There is a new MMA enemy class that will test your countering abilities, something that should have been applied to Ras al Ghuls ninja minions last go around, but other than that, most of the enemies are rehashed skins. You have your traditional gangsters, your heavies, gun toting psychopaths, and others that will feel very familiar and dont offer any more variety.The core problem is that the cutscenes are what drive Arkham Origins. There are barely any cinematic moments during combat, and instead are implemented into the CG rendered videos. This makes the skirmishes become a bit dull after a while, considering its the same basic encounters over and over again: either stalking thugs from above, or throwing down in a large group. Thats basically what you can expect when you approach the next area and it becomes an exhausting process quickly. Rather than trying to do something different, the way Batman is put to the test is by throwing more enemies at him. Its an unimaginative and rudimentary system that has been stripped from past games and given minimal additions such as the late-story shock gloves. Its the assassins boss battles that attempt to change things up by generally offering different mechanical systems.Outside of beating enemies to a pulp, Batman is also an ace detective, so there instances where he has to solve crimes through various clues in an environment. This generally involves solving a murder of someone important, and finding their killer. This feature has been completely overhauled into a slightly more interactive, thought provoking encounter, but its still holding your hand throughout each case. Rewinding through the timeline and putting the events that occurred together creates a strong mystery, but only when it occurs during the main plot and not some off the beaten path random event. This is something hopefully Warner Bros. or Rocksteady will experiment more with as it has exponential potential.Played out like an open world game, Arkham Origins is better when you arent traversing Gotham City, but rather within the linearity of corridors or open areas. The problem here is that there are numerous occasions where Batman cannot grapple onto architecture or a higher platform for no apparent reason. It feels like a limited open world experience and while a number of the side missions that involve villains are entertaining, I wish they were longer in length and expanded upon. With that said, the date that the game takes place, Christmas Eve, really shows the beautiful terrain of Gotham City.Like most modern games now, you cant have just a single player campaign to fuel the entire experience. Batman: Arkham Origins includes a multiplayer component thats developed by Splash Damage, the team who made Brink, and puts three teams up against each other. Instead of matching wannabe Batmans and Jokers, players will instead take the roles of thugs on a specific allegiance or heroes such as The Dark Knight and his sidekick Robin quietly hiding out in the shadows. Its an interesting concept that isnt fully developed or executed well enough to be a memorable or noteworthy portion of Origins. It feels like something that artificially extends the value of the product rather than gives it any true life.Closing Comments:", "date": "October 27, 2013", "grade": 3.5}