{"name": "Defense Technica", "ref": "https://hardcoregamer.com/?post_type=post&p=59390", "text": "Defense Technica is a tower defense game. Unfortunately, that is about as passionate as I get about it. It is a snack food kind of experience; something you go through quickly, fails to fill you up, and doesnt leave much of an impression. If your ears perk up whenever you hear tower defense, you will probably enjoy Defense Technica, but others are going to be left unimpressed. This is about as standardized as tower defense games get, and it does enough right that fans of the genre should feel right at home. However, with so many other (and better) tower defense games out there on the market, those that dont have an insatiable appetite for tower defense games will have better options to choose from.There is a story here, but honestly you can just click straight through to the missions and you will miss absolutely nothing. There were these two alien races that were totally nice and friendly to Earth, but then one race started being lame and murdered nearly everyone while the second one fiddled with their iPhone and pretended not to notice what was going on. Now humanitys only hope rests in a small group of survivors as they flee Earth and try to find help while the mean alien race sends foes out in straight lines to try and finish the job. The story is told through a series of screens containing text which you just read, with a little advancement of the plot before you begin each level. It just isnt interesting enough to spent the ten seconds to catch up on the story after each mission, especially because the text is dull to read and like half of them are basically some version of hey these guys are still trying to kill you.Luckily, there is some fun to be had when you actually get in and start playing the game. Defense Technica never really veers too far from what is expected out of a tower defense game these days, and even without playing the game you can probably guess exactly what the game is like. Each levels plays out on a little map and on each map you have designated spots where you can build towers of your choice. You unlock more towers as you go along, and each tower has different advantages and disadvantages based on the enemies you face. Building a tower requires a certain amount of resources, and you begin each day with a handful to use to build your first towers. Enemies drop some as they are defeated (they are luckily made out of walking tower parts, apparently) and you can use these resources to build more towers to prepare for the larger waves ahead.It is the standard tower defense formula, but everything works just fine and the minor tweaks they make to the standard formula are small enough that most fans of the genre shouldnt have much to complain about. They probably wont have much to celebrate, either, but this is a perfectly adequate tower defense game that doesnt have any delusions of greatness. It is pretty entertaining to set up your defenses to defend your core from attack, and you do have some options as to how to best lay out your course of attack. You can focus on building barricades at strategic locations to block the advance and lengthen the journey the lines of enemies have to take to the core, or you can buff up around your core immediately and kill anyone that gets close to it. There is something about this basic formula that just works, and while youve most likely seen this same game a dozen times by now, it doesnt mean you cant have some fun along the way.Something that I do like about Defense Technica is just how brutal the difficulty can get. If you want to get the highest score and earn all the medals, you have to do an excellent job defending your core. Waves get increasingly tough, and the later maps are particularly mean about sending several of them at you at once. Levels start having multiple entry locations, air based fighters that requires specific towers to defend against, and you will need to balance where and when to place your towers to stop the assault from all sides. Strategy and good tower placement really comes into play by the halfway point of the game, and just randomly plopping down towers is a good way to get eviscerated. You can either play on normal or hard mode, and while this game might not do a lot to set it apart, people looking for a real challenge in their tower defense games have found a good match here.It isnt like the game doesnt try to add some new stuff along the way, though. Its just that the stuff it does add really doesnt have the impact the game seems to think it will. You can upgrade your towers along the way, using medals you earn in missions to purchase upgrades that allow your towers to do more damage or to shoot further or look cooler. These cost extra resources and you need to build them on top of your lower level towers, but the result is worth it and careful placement can turn the tide of battle. There are also these weird weather effects which pop up every once in a while just to tell you that youve chosen the wrong towers. Different weather patterns affect the range of different kinds of weapons, so if a storm roles in and you were counting on the wrong towers then oopsie, looks like youre starting the level over again. The terrain can change and you can throw out ether bombs wherever you want to slow the onslaught of enemies, but for the most part a lot of this stuff is just really minor garnish that has no substantive difference on the way the game plays.The visuals are about as generic as it comes, with nothing particularly remarkable or noteworthy. A lot of the maps end up feeling really similar, and are dont really have the aesthetic appeal that will cause you to notice anything other than where you can place your towers. Even the towers and the enemies, though they build up in size over time, dont do much to draw attention to them and youll probably be too busy frantically placing towers and checking out your defenses to spend much time admiring the view anyway. The music is similarly forgettable, and presentation as a whole for the game is clearly not one of its strong suits.Closing Comments:", "date": "October 24, 2013", "grade": 3.5}