{"name": "Lets Sing and Dance", "ref": "https://hardcoregamer.com/?post_type=post&p=58442", "text": "I consider myself a music game aficionado. Been there, done that. Since theres a dearth of great music games currently, however, I mainly stick to karaoke or Rock Band. Dance Central, Dance Dance Revolution, and Dance Masters lost their luster long ago, and thats about all there is. Lets Sing and Dance is a curiosity that should have been released back when Kinect was a thing, a peripheral with potential rather than the washed-up has-been were used to these days. But I still like to check these things out now and then because I have to experience every video game somehow related to music. It was exactly what I expected, track list and all. Thats not necessarily a bad thing, but it does represent the state of music games today, which is a bit saddening.Lets Sing and Dance has you using the Kinect to do just what the title suggests: sing and dance. With a setup exactly like that of the bizarrely popular Just Dance games, it lets you pretend to be a pop star. You know, in your crowded living room with less than optimal lighting conditions. All jokes aside, its a pretty functional game. You simply follow the movements of the dancers on-screen, who perform choreographed dance moves to each of the twelve tracks. The actual music video is displayed at the top left so you can see what the dancers are mirroring, and the movement you are to perform can be seen at the lower left. Lyrics display at the bottom to help you sing along to the song, though if youre anything like me, youre not so hot at doing both at the same time. Like Just Dance, even though your image is displayed at the top right of the screen, youre stuck guessing if youre using the correct posture or performing the dance moves satisfactorily. It can happen where you completely foul up a move, but youre graded positively. It ultimately seems like a crapshoot, unlike Dance Central, and wild flailing can rack up more points than anything else. At least youre burning calories. Two dancers can play simultaneously, however, which makes it all the more fun. You can always point and laugh at (or be laughed at by) your friend while playing, which may or may not have happened over the course of this review session. Its not always accurate, and it always feels a little ridiculous, but it does the job about as well as those its trying to imitate do.I came for the singing, but I ended up staying for the dancing. Theres the potential, as the trailer suggests, for unlimited singers, because the Kinect is going to pick up the audio. Anyone in the room who wants to sing can, and it renders the singing portion essentially useless. For a game billed as the first game to incorporate both singing and dancing, it really should have considered doing a little more with it to make it feel like a more comprehensive package, especially with some of the licensed songs included here. You know they had to break the bank for Lady Gagas Born This Way and LMFAOs Party Rock Anthem.Closing Comments:", "date": "October 12, 2013", "grade": 3.0}