{"name": "Back 4 Blood", "ref": "https://hardcoregamer.com/?post_type=post&p=412548", "text": "Back in 2008, Turtle Rock Studios (a.k.a. Valve South at the time) released a game called Left 4 Dead. A four-player co-op zombie shooter, Left 4 Dead cemented itself as a top-shelf title thanks to great mechanics, a suite of excellent co-op options and innovations in AI that led to high replayability. Afterward, Turtle Rock Studios would do their own thing, developing the mediocre Evolve and several Oculus games. Now, the studio has gone back to its roots, developing another four-player co-op zombie shooter. That game is Back 4 Blood, which borrows much of its foundation from Left 4 Dead while making innovations itself. Is Back 4 Blood a worthy successor to its forebear or is this blood not worth coming back for?Back 4 Blood takes place following an outbreak of a parasite that infects the majority of humanity and turns them into monsters dubbed the Ridden. After months of low Ridden activity, a horde of the monsters suddenly appears, threatening the uneasy peace of a small town. Worried about an upcoming war, General Phillips enlists the Cleaners, a group of 8 immune individuals, to help push back the looming threat. Despite marketing that suggested story would play a role in Back 4 Blood, the game features little narrative content. Outside of a few beautifully-produced cutscenes and banter in safe houses, Back 4 Blood is light on story. Mysteries such as the viruss origin, what happened to Moms son and others are either not touched upon or only discoverable via intel found throughout the levels.The characters themselves are personable, if not predictable. Each of the eight playable characters fits a common stereotype seen in most zombie media. Mom is the tough-as-nails leader who doesnt take crap from anyone; Walker is the grizzled soldier; Doc is the nerdy scientist, and so forth. Each of them has some lively banter during missions, but the storys structure prevents them from becoming anything more than the players avatar during missions. Its clear that Back 4 Bloods campaign is mostly here to facilitate the main pillars: co-op, gameplay and replayability. The story merely serves as a backdrop to get players into the world to take down the Ridden. While it would have been nice to have a stronger narrative or a focus on the characters, the campaign does at least serve its purpose and gets out of the way quick enough for the games other elements. In this way, Back 4 Blood is a lot like Left 4 Dead.Back 4 Blood further shares its DNA with Left 4 Dead regarding the core gameplay loop. A team of four people spawns into a safe house, prep for the upcoming level, exit the safe house, do battle with the Ridden, maybe complete an objective, and then make it to the next safe room. Its a proven formula that has kept both Left 4 Dead games popular a decade later. In total, 33 missions of varying length add up to anywhere between 8-10 hours your first go around. Some are short and sweet, others can take some serious time, but all-in-all, Back 4 Blood is an easy game to pick up and play in short bursts.Back 4 Blood separates itself from Left 4 Dead by creating replayability through its deck-building system. In Back 4 Blood, youll earn cards that provide different bonuses and can be configured into a deck. Before every mission, the game draws five cards and allows you to pick one to add to the list of already played cards and stack its bonus on top of the others. These bonuses range from simple upgrades like health increases and faster reloading to more specialty-focused ones like gaining health for each melee kill. Its an intelligent, robust and unique system that allows players to craft and tailor the experience to their favorite playstyles. Additional cards can be unlocked by acquiring Supply Points and spending them at Fort Hope, the games social space. Getting points is as simple as completing missions in the campaign or participating in the PvP Swarm mode, though you dont earn a lot for each mission. Its still a sound system that provides freedom to the player, but the game doesnt completely let you get overpowered.Like Left 4 Dead, Back 4 Blood has an AI Director that dynamically scales difficulty and enemy count. What makes this AI Director so different, however, is that he can play Corruption Cards to counter your cards. In the early game, these might be simple things like populating the map with birds that alert the horde when disturbed or spawning additional Snitches. As the game progresses, though, youre likely to see more advanced cards like Mist, which drops a thick fog on the area, or Mutations that spawn special infected. Theres a lot of replayability baked into Back 4 Blood, thanks to the combined power of the player cards and AI Director. The AI Director could use some more tweaking as it currently scales difficulty too harshly. Its common to go from an easy level into a new level where the AI is throwing five Tall Boys at you at a single time. The game should offer a good challenge, and it does, but it should be fair all the time. Right now, the Director goes overboard.Back 4 Blood does break away from Left 4 Dead with its gameplay, which has been updated to control like modern shooters. Back 4 Bloods weapons feel punchy and satisfying, thanks to strong feedback and audio every time you nail a Ridden. Theres a good selection of weapons to choose from and attachments to equip. The game actively wants you to switch up your weapons, offering a good amount lying about in the world. Unfortunately, since you cant remove attachments and put them on other guns, sometimes its hard to justify switching weapons. Its a weird oversight in a game that prizes replayability and experimentation. As replayable as the game is meant to be, it does stumble in the variety department. There are many modifiers, but they cant hide the fact that the game reuses a lot of levels. They may have different objectives or a Corruption Card that visually changes some aspects, but theres no hiding the fact that youll be exploring the same parts of town a lot. The same goes for enemies, which a majority can be encountered in the first mission. Back 4 Bloods gameplay is fun and satisfying, but the game does get tedious when youre fighting the same hordes in many of the same locations time after time.Back 4 Blood is at its best when playing with friends. Like Left 4 Dead, this game hits its peak when an entire squad of people team up and communicate to get the job done. Thanks to somewhat helpful AI, its not even bad with only one or two other players. Want to play solo, though? Back 4 Blood does offer a solo mode, but Turtle Rock Studios has made it anything but an attractive option. Restrictive, solo play prevents players from making any meaningful progression, unlocking all the Cleaners, or even earning Trophies/Achievements. The mode does unlock all cards by default, but its a poor consolation prize considering that the core experience is tied to progression. Adding insult to injury is the fact that the game is always online. Turtle Rock Studios has acknowledged the issue and intends on fixing it, but its disappointing the game has launched this way. Even if co-op is the focus, its not right to see an available mode done so terribly.Rounding out the content is the PvP Swarm mode, which pits a team of Cleaners against a team of Ridden in a best-of-three rounds battle. Its not terrible, but the Ridden controls are an acquired taste. Its not as engrossing as the campaign and co-op content and lacks the same fun factor as Left 4 Deads take on PvP. This is one case where Back 4 Blood should have stuck closer to its roots. Back 4 Bloods presentation may not scream current-gen at first glance, but it still delivers where it matters. The game consistently delivers large hordes of enemies at a nearly-locked 60fps on current-gen consoles. It also sports impressive effects work and lighting. Back 4 Blood looks truly impressive in moments where you see the light piercing through heavy fog, the red lighting of an emergency room creating dynamics shadows or a horde of Ridden clambering over fences trying to rush you. The audio is also top-notch, with satisfying sounds when landing headshots or watching a heavily-mutated Ridden explode. Back 4 Blood delivers a well-performing presentation thanks to its stable frame rate, impressive effects and audio effects. Closing Comments:Back 4 Blood manages to recapture much of the magic Turtle Rock Studios crafted more than a decade ago. In short bursts, Back 4 Blood is a fantastic co-op shooter filled with tight gameplay, a robust card-building system that lends itself to replayability, and a buttery-smooth performance that manages to capture that frenetic, zombie-slaying action of its forebearer. The game does have its fair share of issues, though, some of them copied over from Left 4 Dead, including a paper-thin plot and characters. The AI Director can be brutal, bordering on unfair at times. Level and enemy variety also take a hit, making some of the later levels feel like a slog. While the game is obviously built for co-op, the fact that the advertised solo mode is so botched at launch is a significant disappointment. PvP is here, but this is one area where Back 4 Blood should have stuck more to its roots. Back 4 Blood delivers the joy of zombie slaying in small bursts, but can become a slog the more prolonged the play session. This is blood youll want to return for because its fun to slay zombies with friends, just dont stay too long.", "date": "October 13, 2021", "grade": 3.5}