{"name": "A.R.E.S. Extinction Agenda EX", "ref": "https://hardcoregamer.com/?post_type=post&p=57687", "text": "Take Mega Man, Metriod, and Castlevania, throw them all in a blender hit puree and out would pop A.R.E.S Extinction Agenda EX. Not only does A.R.E.S. manage to combine those three influences, but it does it in a way that is fun while maintaining its own unique identity. While there are a few small flaws, the gameplay is top notch and manages to more than make up for any weak spots the game has.A.R.E.S. Extinction Agenda EX for the Xbox 360 is a fleshing out of a game by the same name (minus the EX) that has been released on PC for some time. The 360 version expands upon the story and adds multiple features that give returning PC players a good reason to make the leap the the new platform and have another go at it. A.R.E.S takes place in a space station positioned near Earth where Zytron infected robots have gone berserk and its up to you to rescue the survivors trapped within the space station. The storyline expands during the course of the game to saving the earth, and while its not the most original, it does the job well enough. The dialogue is well written and the animated cut scenes look good and have a nice level of polish to them, giving players just enough of a narrative to chew on while running and gunning through the stage. Although chances are youre not here for a deep and engaging storyline, but for the 2D shooter action, which A.R.E.S. has in spades.As A.R.E.S is 2D action platformer with obvious influences from the greats of the genre, the gameplay is where this game truly shines. The controls have a bit of a stiff feel at first, but once you get used to them they work great and are pinpoint accurate, which is an absolute necessity in this game. The player gets the option to control one of two different robots: ARES or TARUS. Each has their own variation of the same story, and each has their own mostly similar but distinct characteristics, abilities and weapons. ARES for example gets a crouching dash, while TARUS gets a forward roll, or ARES will get an air dash while TARUS gets the ability to hover for a short period of time. While the abilities sound and act similarly, they are different enough in practice to give a unique feel to each robot, so that they dont just feel like carbon copies of each other.This is a good thing because you will play through the same levels regardless of which robot you choose and while their abilities achieve the same end result, they are varied enough to offer two very different experiences and helps to give a level you already played through a new feel to it. With both robots, you begin the game with only a basic gun and the ability to jump and dash/roll. As the game progresses, you pick up new armor, weapons and abilities to use. There are four different weapons to pick up, each with their own characteristics and A.R.E.S. does a great job of making sure you will make regular use of each one and does so in a way that doesnt feel gimmicky.A.R.E.S. also adds another layer onto the character enhancement mechanic with the ability to upgrade your weapons, abilities and armor. Interspersed around the levels (and also gained from defeated bosses) are upgrade chips which when collected allow you to upgrade the weapon or ability provided you have enough materials to buy them. Materials are dropped by baddies in varying amounts with stronger enemies generally dropping higher amounts than weaker ones. Upgrades are very helpful, and while collecting some of them may seem optional, the difficulty curve of the game makes taking the time to find them very much worth it. Upgrades can raise the damage your weapon or ability does to enemies, increase the rate of fire for weapons, shorten the cooldown time of abilities, or enable you to continuously use some abilities like the roll/dash. There is also a score given at the end of each chapter, which grades your performance and assigns a score, which matters in that it adds to a total score and is treated similar to experience points by leveling up your character and adding to their total health. Again while upgrading your tech is not absolutely mandatory, investing into upgrades will greatly enhance your survivability especially against bosses.Speaking of bosses, you better be prepared because the bosses are tough in A.R.E.S.. The early bosses ease you in, but the difficulty quickly ramps up after that. Old school is definitely an apt description for the boss battles in A.R.E.S. as they will absolutely put your 2D platforming skills to the test. Just about every boss is a unique experience and requires you to fully understand and use each of the capabilities that you have unlocked in the game by that point. A.R.E.S gives you three levels of difficulty to chose from: casual, normal, and hardcore, and even at the normal difficulty the bosses are no walk in the park. Even with the ability to repair yourself on the fly (which is balanced with a long cooldown and costing materials which can run out) these bosses will give you pause and likely require multiple attempts. Pattern memorization and precision movement is key, especially with each boss having more than one phase of patterns to memorize. The action is very hectic but fair, and manages to avoid being overly frustrating because every attempt at the boss gives you more and more of an understanding of how it operates and how to beat it, motivating you give it just one more go every time.Unfortunately, the game is very short with only seven levels. The levels themselves are a decent length and have very good layouts to them, there just arent enough of them and a single playthrough probably wont take very long. The music is high quality with appropriate Metriod style tunes mixed with a more prevalent rock motif that will likely have you rocking out to the tunes as you navigate through the levels taking out wave after wave of enemies. A.R.E.S. somewhat makes up for its lack of length with a new game+ style mechanic where after beating the game you can do another run through with all the gear you have collected and upgrades you purchased in your first play through. You also unlock the option to select a level from a menu and hop around the levels (chapters) collecting any upgrade chips or data cubes (these contain information on a specific character or enemy) you may have missed or were unable to retrieve the first time through.In case you havent noticed from the screenshots, A.R.E.S. is a good looking game, but on some aspects of the aesthetics it falters just a bit. The character design for the main characters and bosses is top notch, and so is the animation for the cut scenes, but the enemy design, while obviously polished, is a little lackluster. Theyre not bad, just a little generic; especially for a game that has such solid gameplay. The levels, while having great layouts, could have also been infused with a bit more visual character. Yes its a space station and that setting doesnt exactly have a lot to work with as far as environments go, but there could have been just a bit more TLC put into their art design. The game doesnt look like it lacks visual polish, but touch ups in those areas would have pushed the quality of a good game even higher.Closing Comments:", "date": "October 6, 2013", "grade": 4.0}