{"name": "Card Hunter", "ref": "https://hardcoregamer.com/?post_type=post&p=57470", "text": "Many gamers have board game nights. Hanging out with friends, surrounded by junk food, huddled around a board trying to grasp the rules. Yelling at a friend because he has been holding on to a trump card the whole time and of course decides to play it on you. Swearing loudly because the calculations you spent dont hold up in actual practice harkens back to many geeky Saturday nights. Card Hunter attempts to emulate this feeling and for the most part it succeeds. Despite a few hiccups, its a unique game that melds what we love about card games and video games into one.The problem with most board games that end up on computers is they lack something special that can only be done on a PC. Usually these are games would work perfectly fine under normal printed circumstances, but Card Hunter takes an interesting twist on the table top genre that only PC games can do. The game is simple. Eliminate all of your opponents on the battlefield with your three units before they eliminate you. The three pieces can be controlled with cards that are shuffled out each turn. Each of these cards are determined by the armor and weapons equipped to each character that drop after each round.It limits the amount of deck building in a game, but makes it a fun mix between a RPG and a traditional tabletop game. Progressions is never limited to just putting the best cards in the deck, its about trade offs. For example, a new legendary piece of armor may drop complete with amazing block cards, but it has terrible movement speed. Is it worth it? This balance also keeps the game more grounded as super overpowered characters dont just have the best armor without drawbacks.A fair amount of the game is up to luck of the draw, but nevertheless the aspect of keeping a clean set of gear is more enticing than frustrating. On top of that, keeping everyone balanced with the right variety of equipment gives time to be prepared for any encounter that comes up. This also makes deckbuilding a little less enticing though, as there isnt as much customization as would hope to be had, but still more than say Magics Duel of the Planeswalker series.The aesthetics of the game are gorgeous. Its hard to believe this game is built in flash and runs in a browser. Everything from the animations to the sound effects are absolutely top notch and coherently comes together in a fantastic style. Every little detail, even the card art and the descriptions of each area, are colorful and lively with character.Even the story is entertaining. Sure its about you and two brothers playing the game and has nothing to do with saving the world, but having the banter between the two brothers about rules and proper tactics is both funny and reflective on how humans play games together. There is also a story thats being told as the game where your characters are the stars, but that one is less interesting and less relatable than the meta story.The actual gameplay is simple, but grows deeper as more powers and mechanics are introduced into the game. Each player starts with a hand filled with ability cards and two movement cards. When all abilities have been used and players skip their turns, the next round begins with a new hand. Figuring out what abilities to use and predicting the opponents is half the fun. The other half is simply inventory management. Is it worth it to save the teleportation until next round when my other units will be in place? Tough choices add a lot of tension to the game and kept me coming back for more.While the game is free to play, it absolutely does it in favor of the player. Everything a player can buy is either cosmetic or a chance at a random item. Its never that in your face about it, except after every battle it asks if you want to pay money for an extra item. It was never needed on my playthrough, though, and I never felt like I had to grind past levels to progress.Closing Comments:", "date": "October 2, 2013", "grade": 4.0}