{"name": "Metroid Dread", "ref": "https://hardcoregamer.com/?post_type=post&p=412270", "text": "What can a new Metroid game bring to the table? For as long as its namesake sub-genre, the beloved Metroidvania, has been around over the last decade, theres been a usurping with whom many first think when that tag is called up. Through no fault of its own, one of the two originators of one of contemporary video games most enjoyable and fascinating philosophies to game design has found itself overshadowed by one fantastic outing after another. At a time when the likes of Ori, Hollow Knight, Axiom Verge  all of whom now adorned with sequels or sequels to soon be  have laid claim to remarkable visual and artistic directions. So too titles like SteamWorld Dig 2 and The Messenger have, by comparison, broadened the sub-genres mechanical and narrative potential  in the latter case, the idea of a Metroidvania in disguise is praise in of itself. No one can deny the legacy Nintendos famed and beloved series of non-linear, explorative action-adventures has left doesnt still to this day define a vast chunk of new releases.So can a new 2D, mainline Metroid game  albeit one that has existed solely in online whispers and as feeble scan log Easter eggs in past releases for well over a decade  be that intriguing or necessary? Not least if youre including (or in this case, excluding) 2010s bizarre, divisive take on the series with Other M. Not to mention, to drive home the scarcity of 2D iterations, having to go back as far as 2004 with Zero Mission, or even further back as 2002 with Fusion to get a hold of the last original, 2D, non-remake outing. This may sound like a selective and somewhat exaggerated perspective to take, but with everything pertaining to the marketing, its original pre-2010 on/off/on again/off again development, its chronological placement and the claim of it signalling the end of this particular saga of story-telling, 2021s Metroid Dread should seem like a game having missed its opportune release by a hefty margin.Metroid Dread decides against much semblance of radical reinvention, either for itself or the genre it birthed. This is no Breath of the Wild; if anything Dread is more a kin to something like Three Houses or Odyssey with its intended proposition. A briefly retrospective look-back on what it is that made this series as coveted and as special as it is, but also building in a way that makes both old and new alike work effortlessly in tandem. While it helps that its developer MercurySteam have already established a foot-hold with the series with 2017s remake of Metroid II, in the form of Samus Returns, Dread is naturally a clean slate. More so, its unchartered waters with which they themselves and Nintendo have the massive task of steering through, attempting to make a case for the very continuation of a tale left previously left off by Fusion. In a way that does feel conclusive but more importantly, ties events together in a way that is worth the investment. Its a high-bar to meet  in a series defined by its lofty achievements  so how great it is to say that Metroid Dread has no less than delivered in brilliant fashion.That internalizing of the series strengths is primarily the reason why playing through Dread is as engaging to work out as it is. Its no exaggeration to stake the claim Dread comes off an amalgamation of 2D Metroids biggest, stand-alone strengths. The core combat and move-set of Samus Returns  with its ever-present counter move  is an obvious start, but nods to Zero Missions kinetic finesse and Fusions tension of encounters quickly reveals itself. The latter case no stronger than in the momentary sneaking around the patrolling EMMI units that have been a pivotal part of the marketing prior to release. While these moments can occasionally fall into the trap of relying too much on good luck, thats not to say that the rampant desperation to move and survive is no less enjoyable. Especially when the alert phase is triggered and youre attempting to navigate a region you havent yet got the layout and bearings of, resulting of course in those virtually impossible (as the game itself describes) opportunities to prevent another Game Over from occurring.But rarely are these individual components at odds with one another in a game that so deliberately shifts gears between exploration and lite-stealth manoeuvring through EMMI-patrolled sectors. Metroid Dreads improvements from a gameplay and technical standpoint may seem minimal  not least when a less-flattering texture or aliasing character model shines a coarse light on the Switchs limited capabilities. But all these minor additions combine to make a satisfying whole. Samus fast and frantic movements are improved from that of Zero Mission; encounters and spectacles of such are built upon with even more tension and health-watching anxiety to that of Fusion; Samus Returns confidence with its combat is allowed even more room in carving out what are easily some of the best boss fights this series has produced.At points you almost get the impression that even the Prime trilogy is getting a nod, albeit in as subtle a fashion as one can get away with. Call it wishful thinking or simply looking too deeply into things, its hard not to see just how far and wide MercurySteam have pulled from Metroids history in carving a world thats curious, but perilous in what it ends up putting in the players way. Better still, the way the game ratchets up the difficulty and the requirements for success around the half-way mark  without going into spoiler territory  is not only nostalgically-pleasing, but mechanically feels like a deserved evolution on what came before in terms of how hostiles behave and are presented. So far as Dreads very world itself is concerned, again the game manages to strike a fair balance that is neither restrictively linear in nudging players to the next objective, but at the same time said nudges are subtle enough that it wont take long to work out where best to use that newly-acquired abilities.Abilities themselves come quickly in Dread and sometimes can revolve around players navigating a new biome or environment, just to quickly return to the previous region. This specific approach to navigation and progression may have stirred up an issue were Dreads backgrounds and environmental detail not been as curious as speculative as they are. Eventual bosses prowling in the backdrop, laboratory equipment revealing potentially-privy information. The supposed corpse of a creature that doesnt seem entirely gone in the sentience department. MercurySteam did a great job at breathing new life into SR388 with Samus Returns and with an entirely new setting that is planet ZDR, Dread fulfills the promise of environmental storytelling whilst also doing its best to disguise the two-dimensional structure of the design.Its even more surprising that whilst navigating the series of organic, synthetic, hot, cold and revelatory locales alike, Dread fortunately decides against holding its players hand. And not even in the data received-esque transmission way found in the Prime trilogy of games. As a consequence players are of course likely to get lost on more than one occasion, but the maps detailing of specific categories of door and obstacle manage to side-step the risk that the game is coming off as too opaque for its own good. At the very least, theres plenty of time and space left in-between the story-critical pick-ups for players to investigate and experiment with what their new-fangled gadgets bring to the table. And while newcomers may not hold as much the same relieved satisfaction as long-time fans offer, its pleasing to see the optional hunt for collectibles in the form of utilizing Samus Shinespark ability are once again present. Like so much in Dread, these challenges are built upon the foundation that pushed games like Zero Mission & Fusion in better appeasing the completionist in us. Here, expanding even the way Samus expanded move-set is applied, resulting in the same quintessential aggravating-come-liberating moments of eventual success.But as noted, its the major boss fights of Metroid Dread that rightfully stand as one of the key pillars of excellence, whether thats returning faces (fortunately tweaked in just the right way to feel tense and challenging all over) or new ones. Its no hesitation to say the final encounter of Dread is easily top three of any fight orchestrated throughout Metroids entire history  owing much to both its design but also its story implication. That doesnt mean Dreads other encounters are no slouches either, with fights that are likely to have players just scrape through on the last energy tank. But never do these fights feel hard for the sake of being hard, nor are the variety of attack patterns and enemy tells to instigate a counter move on impossible to spot. Players will likely suffer a plentiful amount of Game Over screens  some of which the result of a solution being not as upfront as one may like  but MercurySteams trust in player willingness and revealing just enough of an environmental indicator in the end pay off time after time.Yet any talk of boss fights will naturally revert back to the climax. And for fans of the series, talk of its being aided by the delivery of a plot-twist (whose wider revelation upon reveal admittedly fooled me) will inevitably mark it down as a series highlight. A gradual increase in stakes that, by the end of the tale, cements Dread as that deserved fifth-and-final chapter in the saga revolving around Samus Aran and her relation not with the titular menace, but the Chozo themselves. As minor a positive this may sound to those looking in, its an immense sense of relief on a personal level that Dread ends this supposed saga of five mainline entries with care and respect for what has made this series  its world, its mythos  as mysterious but as exciting to theorize over as it always has been. But more rewardingly, now making key events canon in the series timeline, how its succeeded in continuing that speculation for years to come on where the series can go post-Dread (no longer post-Fusion).All that said, Dread still doesnt have it in itself to even warrant a discussion on whether it dethrones something as monumental as Super Metroid as the series best. Part of this lies in the technical side of things, notably in the frame-rate department. While Dread does manage to maintain a solid 60FPS for most of its run-time  and as such, combat gains a huge boost from how smooth everything feels  there are spots where the amount of action and effects on display can be too much for the Switch to handle. Dropping into the 50s and in brief spots, the mid-40s for those split-second instances. But the biggest absence in Metroid Dread  a surprising and ultimately minor low for the game in general  is the inclusion of notable music to compliment its engaging gameplay and story alike. While the more ambient, mood-setting approach to the soundtrack does its job, excluding a couple of boss themes that stand out only on the basis of their unexpected tone and motif, Dread falls short at delivering music as iconic as series stand-outs like Phendrana Drifts, Brinstar (Red Soil) or even the main theme of SR388.Closing Comments:For as long as the Metroid series has existed in both 2D and 3D planes, it has long been held that Retro Studios are the only team outside of Nintendo to have approached Metroid with such admirable care and passion for the series, while at the same time understanding how best to build on the foundation. Suffice it to say, MercurySteam have reaffirmed their place as coveted developer number two in that small list with what is easily one of the best entries in the Metroid series to date. Comprised of not just one of the best control systems of any entry, but undeniably some of the best-designed boss battles to date. But the over-delivering on the prospect of a fully-realized Metroid 5 owes much to the story told. Of Samus Aran at her most delightfully-stoic and confident best and of the world-building that here only grows more interesting, alongside the grander implications its narrative garner. Metroid Prime 4 may still be years away, but make no mistake that MercurySteam and Nintendos latest incarnation of Metroid has made the strain of such a wait not just more bearable, but potentially no longer existent. Sure to please longtime fans and general Switch owners/newcomers alike, Metroid Dread more than delivers on a climax two decades in the making.", "date": "October 11, 2021", "grade": 4.5}