{"name": "SpellForce 3", "ref": "https://hardcoregamer.com/?post_type=post&p=282184", "text": "Thanks to the likes of Dragon Warrior and Castlevania, making the third entry in a given series a prequel has become something of a normal convention in gaming. The SpellForce series has chosen to follow this path, which is not inherently bad by any stretch of the imagination since Dragon Warrior III and Castlevania III: Draculas Curse were both triumphant entries in their respective franchises and even hold up well today if one can forgive the 8-bit presentation of the Paleozoic era. Those familiar with SpellForce know that a ritual involving some magic users led to a cataclysmic event known as the Convocation, with the first game taking place recently after this event tore the world asunder and its sequel taking place a few centuries in the future. Those who wondered what Eo was like prior to this event will get their wish granted as SpellForce 3 takes place about 500 years before this event took place.The story begins in the events leading up to what will eventually be known as the Mage Wars and the creation of The Circle of Mages, sheding more light in what led to the disaster that set the stage for the original SpellForce. The game contains a couple prequels to itself in its own right; one is mandatory and one is an optional scenario. Both have the player control Sentenza Noria, commander of the Wolf Guard. When beginning the main campaign, Noria is pursuing a traitorous mage by the name of Isamo Tahar. This introductory/tutorial portion lasts maybe an hour or two depending on the difficulty level and how much the player wants to explore. When this section ends the player will be able to create their main character eight years in the future and the game starts to find its stride. The optional scenario is called Old Haalayash, which takes place before the main story where Noria is charged with dealing with some rebel mages and an ancient relic. This scenario is short and serves as a good tutorial for several different aspects of the game.In the eight year time period between the tutorial and beginning of the game proper, its learned that the son/daughter of Tahar (aka the player) was spared from execution by Noria during the wars and fights against the rebelling mages on the side of the Crown. The people of Nortander are in the process of rebuilding from the war, the player is trying to atone for the sins of the father while the cult known as The Purity of Light is leading the witch hunt against mages who are already feeling the scorn of low popular opinion. This cult, like most cults, tends to have bizarre and extreme viewpoints. They do not believe possessing the ability to use magic itself is a sin, but choosing to use it is an act of defilement, which is bad regardless of whether the intent behind the magic use is for good or evil. They believe that Aonir, the God of Gods, is going to return to Eo only after the people have proven themselves worthy and that is after there are no more Defilers (aka mages) or followers of the old gods in the land. So in order to bring about their benevolent deity they have to commit genocide against all magic using people. On top of this, there is a new plague making its rounds called Bloodburn that is wiping out large chunks of the population. Taking all this into perspective, its starting to make sense why The Circle of Mages got created and brought about the Convocation. SpellForce 3 is an ambitious game, attempting to blend a traditional RPG with a RTS. Frankensteining different game genres usually results in creating something great that plays to the strength of both worlds or an abomination that would bring disgrace to young Victor. After approaching this title with some skepticism, the end result is something along the lines of the former category. RPGs and RTSs do share similar resource and personnel management tasks, and the way SpellForce 3 allows the player to control their townspeople makes the blending of genres come together smoothly.SpellForce 3 is kind enough to hold the players hand in the beginning, giving clear instructions on how to manage the different structures upon arriving at the first outpost. Logging facilities send people out to gather wood to build materials and the fishery catches fish to provide a source of food for the encampment, to give a couple examples. The player just assigns so many citizens and they gather resources on their own. After that gets going, the player needs more than the starting party of four to defend this area and needs to construct barracks to train soldiers. Early on only the most basic units are available like recruits and arsonists, but none of these games ever start off granting unbridled access to everything. New buildings and soldier types are unlocked by acquiring blueprints, which will naturally open up more construction and defense options as the story progresses.An interesting aspect of the community management portion is the resources are actually harvested from the area. Trees are cut down to make lumber, and animals and fish are depleted from the area in order to get their resources, making this simulation play out like how one would have to manage a real outpost where there are a finite amount of natural resources, where all those trees that the greedy player chops down to expand their base of operations arent going to grow back overnight. Thankfully the regions in the game are covered with enough trees and other raw materials that running out of everything completely isnt going to be an immediate concern. Shifting back to the RPG side of things, this is an isometric real time affair that shouldnt seem too far out of anyones comfort zone whos played Baldurs Gate or any of the zillions of PC RPGs that use the isometric view with a party management system. The player will create their own character, spawn of the betrayer and will be able to design their appearance and select three different skill trees, which can range from archery, defensive, physical offense or various schools of magic. For the review I went with my standard design for this type of game, which is a battlemage. Teamwork is emphasized, but its good to have a character that can excel in physical and magical combat. As the characters level up they can learn new abilities on their respective skill trees and the freedom to do this can lead to a powerful party if done properly.Powerful individuals are much more devastating in groups and learning the intricacies of every available skill tree is recommended before plotting out everyones projected growth path. Finding abilities that can inflict certain status ailments and pairing them with anther characters ability to cause additional damage to the said ailment is a good basic strategy to employ. Also, early on in the exploration the party encountered a much larger hostile party not too far from their encampment, but instead of rushing to engage them this was used as an opportunity to test out the harmonious coexistence of the RPG and RTS game style. The main party members were joined by about a dozen arsonists and soldiers, which resulted in an isometric slaughter where the game reviewer suffered no casualties. This becomes a bigger point in gameplay later on, where the main party of player characters is augmented by having an actual army accompany them into battle. The developers did their due diligence to blend these different styles as well as they could and make the game accessible to as many people as possible and their efforts are apparent in the end product. There are four different difficulty levels that range from being able to plow through the game on autopilot to creating a daunting challenge for seasoned RPG/RTS veterans. Assigning skills for quick access in battle and for the AI characters to use in autopilot makes combat management easy, but switching manual control of characters and inputting commands is easily done as well. Controlling units and sending them to different areas of the battlefield for large scale battles is easy  just highlight the group you want to move and send them in the right direction. Overseeing the growth of the outposts is just as simple  the player needs to assign how many of their citizens to a specific task in the different buildings and they get to work gathering resources. There are two available control schemes that can be used based on player preference and swapped at point. One is based on a more traditional mouse and keyboard setup, while the other is nothing but hotkeys. The game is designed with the latter scheme in mind, but players may be more comfortable with the more traditional, familiar set up. Neither is inherently better, just figure out which one is more comfortable for you.RPGs have generally been focused on being a single player, story-driven experience. SpellForce 3 has a campaign that is roughly thirty hours, but it can be extended well beyond that with the numerous side quests and ability to dive deep into outpost management. This game can be an enjoyable and rewarding experience solo, but as gamers seem to be becoming a more social group of people, there are a couple multiplayer options. Cooperative play in the campaign mode is available and up to six players can face off against each other in a skirmish. The skirmish modes do include the RPG tactical combat along with having to manage resources and outposts so these matches can get intense with the right group of people facing off against each other. Closing Comments:SpellForce 3 has delivered on the potential it showed while still in development. Enjoying the layered gameplay and story requires a decent time commitment, but for an experience of this type and scope, diving right into it proves surprisingly easy. It might not be the deepest individual RTS or RPG experience ever created, but its no slouch in either department and the successful merger of the two game styles creates a rather unique experience. Hardcore CRPG or RTS fans might find the game systems for the respective genres less complex than some of their favorites, but as far as complexity is concerned, less is more was the way to go. A good analogy of the playstyle for SpellForce 3 for RPG fans is to think of it as a dual class; it may not reach pinnacle of either genre, but does good at both where the combination is greater than the sum of its parts. The idea of magic users being used as a scapegoat for the worlds problems and being hunted isnt the most original idea, but the development team put enough of their own spin on this concept where it doesnt just tread over the same familiar themes. 2017 was already a great year for RPGs and SpellForce 3 adds another entry on an already impressive list as the year comes to a close.", "date": "December 6, 2017", "grade": 4.0}