{"name": "Grand Theft Auto V", "ref": "https://hardcoregamer.com/?post_type=post&p=55696", "text": "Is there a modern game series thats more engrained in our cultural lexicon than Grand Theft Auto? While retro properties like Mario and Pac-Man have evolved into symbols of the industry at large, theres hardly any other post 80s series that is not only universally recognized, but so frequently discussed. This is a gaming franchise that has been the focal point of the argument against video game violence, with multiple lawsuits and constant discussions surrounding it throughout the first half of the aughts. This is a series that is known enough to make its title into a verb, with going Grand Theft Auto on ___ a phrase thats seeped its way into many a gamers vernacular. And, of course, this is a series thats given new meaning to hot coffee. Yet through all of the criticism and controversy, its managed to not only be one of the best selling franchises of all time, but one of the most critically acclaimed. Its the game that represents the generational gap, uniting Millennials from all walks of life whove found an aspect to latch onto, while almost everybody else has a hard time understanding why wed want to commit virtual vehicular homicide. Yet for all the violence of the game (and there is plenty), thats not what makes us return to Grand Theft Auto; its the fact that its a virtual world that lets us do what we want  a mantra the fifth entry into the series takes to heart.The world of Grand Theft Auto V is so big that it requires three characters to explore it. While that line may sound ripped straight from a PR-laden interview, its quite accurate considering telling a story from the eyes of just one man would lead to new areas not being discovered for tens of hours into the game. The game stars three protagonists: Michael, Franklin and Trevor. After a prologue that sets the events of the game in motion, Franklin is the first playable character. Similar to CJ in San Andreas, Franklin is well-meaning gangster who lives with his aunt in the ghetto and is trying to make a better life for himself. Clearly more intelligent than his known associates, Franklin is confined to being a repo man for a shady car dealer who plays the race car to get customers into vehicles they cant afford, only to have Franklin repo them weeks later thanks to ludicrous financing. After one of the customers father, Michael, gets a whiff of this little scam, he comes down to pay the dealer a little visit. Impressed by his attitude, Franklin decides to reach out to Michael to see if they could work together.A former two-bit criminal, Michael has retired into a witness protection program. Thanks to his previous life, hes absolutely loaded and lives in a mansion with two kids and a wife. His kids are spoiled brats, with the son spending all day smoking pot and playing video games (no offensive, readers) and the daughter a fame-obsessed promiscuous teenager who will do anything to become a celebrity. His wife, on the other hand, resents him even though he gives her anything she could possibly want (including some surgical enhancements) and is having an affair with likely multiple suitors. Depressed and not challenged in his current country club life, Michael decides to team with Franklin for some excitement. Unfortunately, coming out of retirement made former partner and current psychopath, Trevor, take notice.After Michael went into retirement, Trevor relocated to Sandy Shores and decided to do what he does best  be a redneck. He lives in a trailer, has terrible hygiene, is promiscuous with all the wrong people and associates withlets just say the the wrong crowd. Even though he has delusions of grandeur thanks to his shell company Trevor Phillips Industries, hes a broke loser with little to show in life. After finding out that former accomplice Michael is alive and well under a different name, he decides to drive down to Los Santos to pay him a visit. Soon all three characters are thrust into the plans of a crooked FiB agent (guess what initialism thats a play on) and some notorious gangsters in the city and have to work together to survive and bring in a handsome payday while theyre at it.The first game in the series to offer more than one protagonist, things play a bit differently than before. As each character is introduced, youll play only as them for a few hours to get acquainted with their backstory and style of play. After all three characters are firmly established (about ten hours in), however, the rest of the narrative shifts between them. Theres missions unique to each character, some of which focus solely on their story (like Michael keeping his awful family at bay) and others that combine all three characters together. One mission, for instance, has Trevor flying a helicopter, Michael repelling from it and scaling a building and Franklin providing cover via a sniper rifle from a neighboring building. While some parts of the mission must be done as a certain character (like Michael repelling), others let you play as you want to. For instance, after fleeing, you can choose to either pilot the helicopter, shoot from inside or provide cover from a building with a sniper rifle. This swap happens on the fly via holding down on the d-pad, which allows any one of the three of the characters to be chosen. You can complete these mission parts as just one of the characters, but its generally best to cycle between all three to be most efficient. In-between missions, characters can almost always be swapped to at will by the same d-pad method. This is effective for both doing individual missions and covering different parts of the city. As the characters safehouses are generally spread apart, its a nice feature as the character closest to the desired destination can instantly be swapped to, saving commuting time.Another benefit to the multi-protagonist setup and also one of the biggest new features to mission portion of the game are heists. While the majority of missions are either driven by a single character or are like the aforementioned one, theres a handful of heists sprinkled throughout. Heists are basically multi-tiered missions that contain multiple small missions to set them up and require an higher level of planning to correctly execute. The first heist in the game, for instance, concerns knocking off a high-end jewelry store. There are two methods available to tackle the job: quiet or loud (smart or dumb). Going in loud is what youd imagine, simply rushing into the store with heavy artillery and running out with the merchandise. Going in quiet, however, requires more planning and stealth tactics. In a jewel heist, for instance, chemicals and an exterminator truck must be stolen. Using the exterminator gig as cover, you head up on the roof with a gas mask and uniform and drop some gas into the vents of the store. Meanwhile, the rest of the crew bursts into the store with similar outfits and cleans it out while the customers and clerks are unconscious. One great feature of these heists is that the crew itself must be individually selected. Youll generally need a gunner, driver and hacker, who are selected via a pool of known associates and characters encountered throughout missions. These criminals vary in expertise, with those highly experienced demanding more of the cut. Going with a low experienced crew member means that more could go wrong (for example, having a bad driver could mean they get captured and lose whatever loot they were carrying), but the more they are used, the better they get with the same cut. Heists add a fantastic dynamic to the game and make the scope of the universe seem larger than ever.Combat itself has been overhauled in GTAV. Instead of blindly cycling through weapons, theres now a weapons wheel that is brought up by holding the left bumper, allowing available weapons to be seen and selected easier. Additionally, getting busted or killed no longer forfeits your weapons, which makes spending money on weapons upgrades much more realistic. Actual combat is more customizable, allowing players to choose how much they want to be assisted with automatic locking. By default, its a bit of a mix between free-aim and full-lock, with targets in clear view automatically locked on and those hidden or at weird angles left to free-aiming. The cover system has also been improved, allowing smoother transitions. On the driving side of things, vehicle handling has been updated, with vechicles feeling better than ever before. While this is still the sort of game that lets you bounce around after landing a jump, handling feels more realistic and tailored to specific vehicles, instead of cars simply being fast or slow. Even supercars feel distinct from one another. Realism has also been visually improved, with cars mirroring their real-life counterparts like never before. Its clear whats a Mustang or whats an Audi and even though the brands cant be used, its better than simply looking for a fast car.The world of Grand Theft Auto V is the biggest ever. Although some were concerned when the game map was recently leaked (which has turned out to be accurate) due to the fact that the majority of it was rural, know that its not that theyve taken away from the city, but simply added hundreds of miles of land outside it just for good fun. The city itself is huge and rivals the entire world of GTA IV. Outside of it, theres mountains, rivers, beaches, desert and more. Surprisingly, however, hardly any of it is empty. Theres small towns, unique buildings, military bases and more sprinkled throughout. The incredible thing is how alive it all seems. Off one of the back roads, for instance, I noticed a car pull over at a fruit stand and decided to see if it was a coincidence, but nope  a woman got out, walked up to it and examined the produce. Thats level of detail to expect in the world, from the boardwalks with interactive rides to trains carving through mountain passes. To add some spice for players who like to drive around exploring the world, random events have been added that unfold during a day. Represented by a flashing blue blip on the map that appears when nearby, these range from a thief snatching a purse to a carjacking. After stopping the miscreant in one of these robberies, you can either keep the stolen item for yourself or return it to the victim. Doing the latter results in good karma that might just come back to you later in the game.Of course, one of the aspects this series is most renowned for is its music. Vice City sparked a minor resurgence in New Wave, while Grand Theft Auto IV perfectly captured the burgeoning indie scene in Brooklyn at the time. Building off of the presentation and quality of the latters soundtrack, V boasts one of the series best collections of music. For indie lovers, Radio Broker is replaced by Radio Mirror Park, which features tracks from Twin Shadow, Yeasayer, Health, Neon Indian, The Chain Gang of 1974 and more. The incredible thing is that all of the aforementioned artists are contributing new music to the game. At this point, its unclear which were specifically written for the game (ala The Raptures No Sex for Ben in IV) and which are simply making their debut via the game, but the fact that theres so many critically revered artists with new music on one channel is astounding. For electronic lovers, theres Soulwax FM, named after and featuring many remixes from electronic band Soulwax. On the pop side of things, theres Non-Stop Pop FM which features an excellent blend between current top ten artists like Rhianna, lesser-known ones like Robyn and classic acts like Hall & Oats. Of course, theres something for everyone with other stations focusing on rap, country, classic rock and more. The amount of care put into curating this soundtrack that could have simply been a collection of random songs is more evidence of how much work goes into even the smallest features of the game.Closing Comments:", "date": "September 16, 2013", "grade": 5.0}