{"name": "NHL 14", "ref": "https://hardcoregamer.com/?post_type=post&p=55251", "text": "It speaks to the appeal of classic sports games that NHL 14s Anniversary Mode mode has become its most talked about feature. After twenty years of refinements, tweaks and complete overhauls, nothing can beat simply skating around ice with no more than three commands available. Of course, taking time to learn and practice the nuances of a modern hockey game rewards players with a level of depth and realism that makes the game seem like a sport itself, but much like a race in Burnout can be more exhilarating than one in Gran Turismo, sometimes we simply want to pretend were an elite hockey player within seconds of picking up a controller. NHL 14 rewards both this mindset and that of the hardened virtual hockey fan and allows players to choose their poison  a fine-tuned game of realistic hockey or skating around blue ice kicking the crap out of each other.While hockey may be one of the least popular sports in America, NHL 14 ironically proves to be the most accessible sports game of the year. Upon booting it up, users are greeted with Hospitality Settings that allow the game to be fine tuned to their skill level. After asking how often you play the series, youll be able to select from one of three game styles: High Impact, Simulation and Hardcore Simulation. High Impact boasts big hits, hard shots and more speed, Simulation presents a realistic and well-balanced game, while Hardcore Simulation is for those who demand absolute realism, offering manual passing and more stick on stick/skate collisions. All but the most casual players or those looking for the Anniversary Mode should select Simulation, as even though theres a bit of a learning curve, its not too hard to pick-up after a few games.Interestingly enough, NHL 14 picks up a few features from other sports game to present a more well-rounded experience, including FIFAs Player Impact Engine and Fight Nights boxing engine. The new Impact Engine allows for bigger and more realistic hits, and the control scheme has been simplified to allow hits to be delivered with the left-stick instead of the right one. Fight Nights influenced Enforcer Engine allows fights to happen on ice in third person, with variables introduced based on player size as well as the ability to dodge more realistically. Additionally, the AI will start fights more frequently, ensuring that you wont be able to get away with slamming into the goalie or star player. As hockey is a extremely physical sport, these new in-game engines make games seem much more realistic and brutal, heating up games in ways not seen before.As previously mentioned, the biggest draw to NHL 14 for the uninitiated is the NHL 94 Anniversary Mode. To celebrate the series twentieth anniversary, the developers have taken the NHL 14 engine and modified it to play like the 94 one. In this mode, the ice is blue, player indicators are star-shaped and even the organ music pumps out classic 8-bit hockey tunes. The basic visuals outside of the aforementioned tweaks look practically the same as NHL, so this really isnt a nostalgic throwback as much as it is a way to experience the game with the simplified controls of the SNES/Genesis entries. The left stick is used solely for movement and theres only three commands on offense (shoot, pass and hustle) and two on defense (pass and switch). Its incredibly simple, but a ton of fun. While the simulation controls of NHL 14 are rich and rewarding upon learning, simply skating around trying to hit players/score goals captures the essence of what makes virtual hockey so fun. Thanks to this mode, NHL 14 will now be the default sports game thats pulled out when I want to play a quick match-up with friends.Be a Pro has been replaced this year with Live the Life, which expands on the mode by introducing multiple new features. One of the coolest features is interviews, which gives players a question to answer pre and post game. Theres four possible answers to every question, pertaining to the opposing team, the players performance, the games outcome, milestones and more. Answers chosen will affect family, teammate, management and fan relationships, influencing your progression and likeablility. Likeability meters control how youre perceived by the aforementioned parties, increasing your chances of endorsements and off-ice events with teammates. Off-ice events puts you in a scenario and allow you to control how things occur, such as joining your squad for a night out at the risk of showing up late to practice the next morning. This mode can be entered with either a custom or pre-existing player and with all of the above mentioned features and many more, is a great way to truly step into the shoes of an NHL player.Visually, the game looks better than ever, with players showing in-game damage from games. Thanks to the Enforcer Engine, if a player will now display bruises, black eyes, redness or swelling when hit. Player models themselves look more realistic as detail has been improved, eyelashes added and players with noticeably missing teeth (like Vernon Fiddler or Alexander Ovechkin) now mirror their in-game counterparts. Thankfully, unlike Madden and NCAA, EA Trax remains in NHL 14. The soundtrack contains thirteen songs, which is a bit light, but features some gems amongst some horrendous hard rock and metal. Standouts include Black Rebel Motorcycle Club, Hanni El Khatib, New Politics and Wolfmother. I would have preferred more BRMC and less BFMV, but after a few years of annoying orchestrated tracks in EAs football games, just having any sort of licensed music is refreshing.Closing Comments:", "date": "September 11, 2013", "grade": 4.0}