{"name": "Diablo III (Console Edition)", "ref": "https://hardcoregamer.com/?post_type=post&p=55007", "text": "Get ready to draw some pentagrams and light those peach & pomegranate scented candles you bought on sale at Kohls. Get some ritual plasma from your local churchs Red Cross blood drive and prepare to recite Anima Christi repeatedly for the next fifteen to twenty hours. No, were not calling on Taylor Momsen. This is Diablo, and lets be honest, unless your sister is Regan McNeil, banishing demons isnt likely something youre attempting nightly.You can put your bottles of holy water down, guys. Diablo III hasnt changed much since its 2012 release on PC, but even those with a mortgage in New Tristram should find a reason to revisit the Sanctuary on the PlayStation 3 or Xbox 360. The story takes place twenty years after the events of Diablo II, when a mysterious star falling from the sky strikes the Tristram Cathedral, causing the disappearance of Deckard Cain. Your chosen character arrives in the town of New Tristram to investigate the falling star, which is now birthing risen dead like a zombie Nadya Suleman. Yes, its the same corpse-exploding, obsessive loot-gathering, monster-slaying adventure. Yes, youll still be following a rather linear path through demon-filled dungeons, leveling ever-closer to the same disappointing conclusion as you carefully manage your equipment stats. The experience is far from different, but it is a better one. Before you ready your fireballs, let me explain. Sure, exploring dark cemeteries and collapsing cathedrals isnt quite as good-looking on consoles, but if the polygon count isnt your main concern, nearly every other aspect of the game has been enhanced.Those intimidated by PC gaming should consider this an open-invitation to defeat the Lord of Darkness once and for all. Its a familiar experience, but this time around Blizzard has lathered the entire thing with a nice, thick layer of refinement, tweaking every facet of the gameplay mechanics and removing the always-online nonsense, ultimately resulting in Diablo III feeling superior to its PC counterpart. A mouse and keyboard have always been the perfect companions for the destruction of wave, after wave of evil, but something about the joypad feels more arcade-like, welcoming the repetitious slaughter like those coin-operated time killers of the late eighties that I miss so dearly.The dark-fantasy world of Diablo III, however, is just as beautifully designed as you may remember. From the crumbling statues and dilapidated stone structures, to the menacing beasts and fantastic spell effects, everything in Diablo III pops with prepossessing glory. Cutscenes, while lacking in meaningful content, are well animated, illustrating mostly confusing and vague story-sequences across artfully crafted environments. The world is as beautiful as a hellish, demon-infested one can be, and locations are full of interesting landmarks to spot, fiendish creatures to encounter  and destroy, of course  and secret treasures to discover. Its unfortunate that the story is a patchwork of meaningless hogwash, but thankfully, it manages to play its part in pushing the monster massacre forward at an agreeable pace. While its surly not the worst tale told in gaming, it thoroughly feels rushed, uninteresting, pieced-together and silly. Some games benefit from campy dialog, but it doesnt quite fit in contrast to the serious nature of the Diablo series.While the world you explore has largely remained the same, the menus have been been given a much needed facelift. Gone are the boring lists, making way for a modern equipment-wheel. While it functions with few flaws, its clunky, uncomfortable design makes exchanging or comparing equipment a minor hassle. It works, and its superior to the PC alternative, but what it does best is make me realize what it could do better.The series has always been known for its thrilling, intense action; pitting you against hordes of demonic beings, hurling monsters your way as you slash and spell-cast through a wall of bloody abominations, joyously watching your rewards explode in a fountain of gore, gold and gear. Its a tried and true formula that has never really demanded an overhaul, but I must admit, the God of War style control scheme is far more intuitive, making the point-and-click action seem impossible to return to. The entire gameplay experience is smoother, more fluid and most importantly, funner to play. Theres less strategy involved with the streamlined controls, but that minor sacrifice bequeathed upon us an engaging, genre-defining experience. The same five classes are available to choose from: Barbarian, Demon Hunter, Monk, Witch Doctor, and Wizard. Each class plays differently and has its own primary attribute, nine skill slots and an emphasis on class-specific abilities. As you level, new skills become available and can be mapped to the controller accordingly. Its a basic system that feels both fresh and familiar, making movement and combat more entertaining.Unlike my parents, Diablo III believes that you have friends, and co-op is the best way to experience (or re-experience) the hellish adventure with up to 3 of those aforementioned buddies. Arguments about loot drops are bound to incite fist-fights between life-long mates, and level grinding to even the character balance is likely to annoy everyone but the lowliest of the group. However, the Online play runs as smoothly as possible, and despite some minor inconsistencies  such as one persons visit to the inventory pausing the game for the lot  Diablo III delivers where it counts.The major disappointment that accompanies the renovated Diablo III is that nearly the entirety of the game can be button-mashed through on most difficulty settings. Even the most challenging battles are rarely more than reminders of useful but forgotten spells. The repetitive nature of the game is its biggest strength, as loot-lust advancement is a core selling point, but also the weakness that can occasionally weigh on the overall enjoyment factor. I found myself taking lengthy breaks between dungeons to avoid burning-out on the combat.Closing Comments:If you and up to three friends are in the mood for a finely crafted, loot-driven, hack-and-slash RPG, look no further than Diablo III. The story may not be as exciting as a name like Diablo would suggest, but it hardly takes away from the overall experience. With fluid combat, huge areas to explore, dungeons to conquer, loot to lust over and friendships to be strengthened or destroyed by an able co-op mode, its surely the best of its kind on consoles. Diablo III was good when it launched in 2012. Now, its great.", "date": "September 9, 2013", "grade": 4.0}