{"name": "JETT: The Far Shore", "ref": "https://hardcoregamer.com/?post_type=post&p=411981", "text": "Over a decade ago, Canadian developers Superbrothers released Superbrothers: Sword & Sorcery EP, one of those landmark titles that helped bring indie gaming into the spotlight even further. A gorgeous and unique adventure, and one that would be hard to top. But here Superbrothers finally are at it again with fellow developers Pine Scented Software, bringing us JETT: The Far Shore, their first true follow-up and one that looked impressive in its initial previews, a space-faring adventure perfect for this new generation.Unfortunately theres no getting around it: JETT: The Far Shore wound up being dull, which youd think wouldnt be the case. The game sees you playing as Mei, one of several scouts who have arrived at the mythical Far Shore on another planet after traveling for a millennia, seemingly invited there by the mysterious hymnwave sent by one of the first scouts, in a sort of world where science and religion have basically merged in intriguing ways. The lore can be dense at times, especially when youre bombarded with a lot of alternate terminology (like scheme being used regularly in place of plan), but it does make you want to know more, especially after an accident seems to give Mei and another scout these weird visions.So heading out onto the planet in their ship (known as a Jett) with their co-pilot Isao, Mei quickly begins to help try to see if the planet is suitable for their people in order to help them thrive, but quickly runs into a lot of hazards with their team, including hostile creatures and a mysterious set of damaging waves known as the Gloaming. This involves traversing the planets various lands, all of which look impressive and stylistic, even from a distance. A lot of work clearly went into crafting both this world and Meis world, and it shows. Throw in a killer score by Scntfc, and you have a ton of majesty to behold. And JETT really wants to make sure you spend as much time as possible beholding it all, for better or (mainly) for worse. Possibly the biggest flaw in JETT is that the pacing can be downright glacial. Despite clocking in at around twelve hours, the game seems to find ways to drag things out in every way possible. Sudden bursts of slow motion as a character instructs you to look around at a point of interest that may or may not be in view. Several missions that just have you following other scouts around as they lay down lines and lines of exposition. Loads and loads of dialogue, either in the field or what feel like unnecessary first-person segments at shelters or Ground Control, where characters spew more purple prose and repeat what we already know. Dialogue here can drag on for so long that by the time you already complete one obvious objective, Isao can finally give instructions about it now that hes done with his previous discussion.And its not like part of this is due to getting lost in the massive world of JETT. Despite what the premise and gameplay footage may lead you to believe concerning exploration, this is a linear adventure. Theres one section in the opening where you get all of twenty minutes to explore and interact with the land (even through youll see everything you need by the ten-minute mark and have no way to end things early, in a another example of dragging things out), and another where you get a few minutes, but its not long before the dialogue is back, goading you into proceeding. The sad part is that interactions with the environment via pops that the Jett can do along with other tools and taking note of the reactions in the environment to them and your Scramjets can be fun, like in figuring out how to lure a Shock Serpent to an electrified area, but the parts where it doesnt hold your hand feel few and far between. The controls, however, are where JETT also screws things up mightily. Once you start surfing across the land, it quickly becomes clear that your ship only has two speeds: slippery bar of soap stuck in a pinball machine and tortoise with molasses stuck to their feet (thats also stuck in a pinball machine). With the Scramjets on, the Jett moves faster, but it makes more wider turns and can become hard to control, and without them the Jett basically just putters along in spurts.The goal is supposedly to have you use the Scramjets for long distances and lose them for slower, up-close exploration, especially since they can disturb aggressive creatures, but both speeds seem awkward to work with regardless of your approach. Several times it feels like bumping into the slightest tree, rock or any bit of terrain can cause you ship to flip out and spin around, killing whatever momentum you have. It doesnt help that depending one the camera angle, it can be a major hassle to determine where your ship is in relation to any areas with hills and the like. Some of the controls and mechanics are downright perplexing, for that matter. For one, there are the aforementioned camera angles. You can change them, but to do so on a controller, you need to hold down the L1 button  which is used to show your current objective and markers for nearby areas  and then use the directional pad to zoom in and out, instead of just having a dedicated button. Not that it matters, because the game seems to change the angles whenever it feels like it. And while R2 is used to accelerate per the norm, there isnt a dedicated brake buttonat least not for the Scramjets. No, instead you need to switch them off with the Triangle button. And while they can be turned off with a single push, you need to hold the button to turn them on again. The dialogue options are busted when it comes to selecting them with the left stick, so the right stick needs to be used instead, one menu still has a cursor in it, and only that menujust so many baffling choices.It doesnt help that the PS4 version we had felt like a downgrade. The framerate notably chugged at times, even freezing up a for a few brief moments in a few spots. And its not like these were the only technical problems, including a few moments where the Jett actually just flew straight into the ground or a mountain and inside of a map. It all just feels so unpolished in the gameplay area, as if the developers solely wanted to tell a great sci-fi story and reluctantly had to insert actual interactivity. Theres potential here, and even a couple of fun spots, but overall the journey isnt worth it. Closing Comments:JETT: The Far Shore has an impressive world with well-crafted lore, an intriguing story and eye-catching visuals. Unfortunately, you actually have to play through the game to experience any of it, and that ends up being a slow, plodding mess in more ways than one. Maybe those with more patience will enjoy the trip more, but everyone else can rightfully skip JETT: The Far Shore and just remain grounded with better games instead.", "date": "October 5, 2021", "grade": 2.5}