{"name": "FootLOL: The Epic Fail League", "ref": "https://hardcoregamer.com/?post_type=post&p=54819", "text": "Understanding the intricacies and passion for socceror futbol for those who find the term to be politically correctis something that a lot of non-FIFA fans have trouble grasping. Thankfully, these woes were easily sought out by the game creators at Herocraft, who took the third world beloved sport and turned it into an arcade journey that offers whacky tactics for your opponents and a troll-like atmosphere thats sure to bring on the giggles.Aside from the lengthy title name, FootLOL: The Epic Fail League has the aesthetic of a flash game that one might find on Newsgroundsbut thats only at a moments glance. Players who delve a bit deeper in the game find that there are a lot of pointers that the developers of Herocraft took from games like the NBA Jam franchise and FIFA Street and meshed them with rock, paper, scissors parameters for game balance. The real pull of the game, however, lies in its ability to be fun by using silly, tongue-and-cheek tactics that players can use against opponents.At the start, players will be immediately thrown into Championship mode, a season setting that spans across the universe. Players will guide six of their target practice shaped Smurfs through an assortment of planets, each with more than 20 games to compete in. After choosing a nationality for their team, players will start off with their first weaponlandmines. Surely enough, the mines increase the likelihood of scoring more goals than an actual soccer game, as players could place them underneath opponents on the outer field and even underneath the goalie as well.As more matches are won, players earn more money for their team and unlock more weapons. The money can be used towards unlocking a number of skill tree slots, increasing the accuracy of the shots, adding new hats and eyes for your teammates and extra edges that players can use to hasten the level up process.The artillery in this game holds the yummy filling in the donut. Utilized within the rock, papers, scissors set up, a players team can use meteorites, fireball and have the option to slow the time down on the field. Dont be surprised, however, when your opponents equip armor, block spheres and speed as countermeasures to your teams tactics. These attacks and counterattacks can also hold a huge sense of humor. The Cows and Spartan abilities, for example, are a great add to the FootLOLs amusing traits, because who honestly doesnt want to trample their opponents with a large, black and white mammal that happens to bear milk?Despite starting out with a certain number of skill slots and very few weapons, the tides and turn of every game in Championship mode can change rather quickly as you progress to net your team higher levels and better weapons. Despite this quick pace in between matches, the game can be too easy at times by not allowing individual teammates on the field to be controlled. Indeed, none of your teammates can be controlled; rather they can be guided to victory provided that you have enough tricks up your sleeves that would allow it to happen. Even when youre both sleeveless and without much to offer, however, players turn into spectators as they watch a game happen all on its own, and win the match without any effort at all.To some degree, your team will snag up more Ws than it should. The creators did a good job in swerving a players ability to focus on whats happening and it does well to help them keep an eye out for open opportunities to strike, but theyre often too open; almost to the point where its near effortless. Had FootLOL provided some way to let your individual blue men be at the guise of your controls, the game would have picked up a decent challenge factor. A boost in AI wouldnt have hurt either, and nodifficulty settings in the option menu is non-existent.There are some challenges for each match that you partake in. Whether youre facing off against Mexico or England, the game throws some curve balls to keep things interestingsuch as having two goalies on one side of the field or for an on fire ball to always make net regardless of the shooter. Challenges that require you to score certain match points, or even score X points higher than the other team is not only a little boring, but it can also drag on if youre not completely careful. It makes no sense to tell the player to let the enemy score 6 and you score 7, but FootLOL unfortunately tells you to do so. While the appeal in using your skills against your own teammates is hilarious and genius at times, this sort of innovation can get a little annoying and frustrating. Seriously, why would I want to let a team score against me?Closing Comments:", "date": "September 8, 2013", "grade": 3.0}