{"name": "Chaos Code", "ref": "https://hardcoregamer.com/?post_type=post&p=54338", "text": "The first thing that players will notice about Chaos Code is that it bears a striking resemblance to King of Fighters. From the aesthetic, to the bare bones presentation, to the movesets themselves, this feels like as much a KOF clone as the countless other Street Fighter mimics that cropped up during the 90s. The sad part about Chaos Code is that beneath all of the glaring port issues, theres actually a competent fighter to be found.Chaos Code comes to us from the little known Taiwanese studio FK Digital. And much like its unheard-of developer, this fighter is a bit of an enigma overall. Firing up the game for the first time will immediately make folks question what year Chaos Code was made. The opening cinematic is presented in a 4:3 aspect ratio with a style that feels heavily entrenched in a bygone era of gaming. This is further seen once the main menu hits, as the presentation and overall lack of modes feels something like a fighter from 20 years ago rather than one being released in 2013. For interested parties, Chaos Code consists of only a few gameplay options. Theres story, arcade, versus, survival and training modes, and while this doesnt look all that horrible on paper, what is actually included is not all that impressive. The story mode is a typical gauntlet of matches with some poorly translated and terribly boring talking segments sparsely thrown between matches. Not only is the tale a complete throwaway, but the translation that ranges from mediocre to embarrassingly clumsy does not help matters.Of course, the fighting itself is the most important aspect, so lets chat about the actual mechanics for a minute. Theres fourteen fighters that each feel unique and interesting in terms of both physical appearance and play style. The handful of combatants feel more akin to KOF brawlers than their Street Fighter counterparts, and to that end, are a blast to play. Move lists are eclectic and truly different from what most gamers are used to. Whats perhaps most excellent about this engine is how holistic it is: players will have to constantly stay on their toes to take down their opponents. That means being vigilant of not only the usual front attacks, but also ground, air and back assaults. While those kinds of attacks arent all that unusual for a game such as this, how they are used in tandem makes Chaos Code one of those fighters that keeps players guessing and on-guard at all times. Because certain foes can toss out a bevy of attacks from multiple directions, its difficult to settle into a predictable rhythm. This is both welcoming and frustrating, as sometimes the best part of a title such as this is the ability to find ones groove and exploit it for all its worth.But still, the game is deeper than just its reliance on full battlefield awareness. The actual combat mechanics themselves are sound as can be, really. This is a four-button fighter, and as such each character will be able to pull off weak and strong punches and kicks, each of which are mapped to a face button. Naturally, these can be chained together for ground and aerial combos, made all the more intricate by the integration of run and dash moves, which can be combod into super moves and EX attacks. Theres guard crushing to open up opponents for said combos, tactical guards, Chaos Shifts, Exceed Chaos attacks in addition to fancy nuances like Special into Super cancels. Like in Street Fighter III, Chaos Code also adds into the mix a stun meter which can leave foes dizzied if their gauge is filled from taking damage. On top of that, theres also the option of choosing extra moves at the character select screen, which allows players to take two additional attacks into battle; the kicker is, these can either be two Super moves, two Special moves or one of each. This mechanic alone can drastically influential on a characters fighting style. So needless to say, and as one can clearly see, theres just a host of elements to factor in when starting up a match of Chaos Code.The good news is, like a Guilty Gear title, practically anyone can pick up the game and play it. It can be as tactical or as accessible and button-mashy as one wants  its up to the player to decide which approach they want to take. Naturally, its not the type of fighter where a button-masher can best a studied expert, but the mere fact that someone, who isnt a genre-fanatic, can enjoy the game without dedicating hours of their life to mastering it is an accomplishment in and of itself. Nevertheless, we suspect the folks that will be picking up the title will be the type to get into the gnitty gritty, and to that end, theres plenty to delve into.Unfortunately, all that practice at learning the mechanics wont go far as Chaos Code does not feature any type of online component at the time of this review. Thats right, in the year 2013 a fighting game does not allow folks to test their skills online against players from around the globe. I can already feel readers closing out of this review after reading that sentence, and I dont necessarily blame them because this kind of treatment, to this kind of game, is simply inexcusable. This is one of the only genres that almost requires online play to ascertain the full enjoyment of what the game offers therefore, not including it is at best, a giant missed opportunity, and at worst, downright criminal.The woes do not stop at the lack of an integral game mode, though. Its good to remember that this version of Chaos Code is in fact a port of the original arcade game released in Japan not too long ago. As with many ports, the transition to consoles has not been a kind one. In fact, in the midst of the process many elements have seemingly been lost in translation. In a way, we mean that literally as the localization efforts are really quite bad. We see this primarily in the dialogue during the story mode. The chatter among brawlers and between bouts is laughable, existing somewhere between mediocre and less than coherent. Not that any of us are playing Chaos Code for its spectacular story, but its still disappointing to see such a poor translation no matter the game genre. Worse still is the fact that load times are outrageously long, theres no option to skip pre- and post-fight discussions and the menus are not only archaic in aesthetic design, but also ridiculously slow to respond.Theres a saving grace in all this: the soundtrack. Chaos Codes OST is one part 90s metal and one part Japanese rock, making for series of compositions that are nothing short of head-rocking. It really fits and accentuates the core fighting well. The graphics are a bit of a mixed bag, but generally solid, too. They are a bit pixelated, though that seems to be the style; still, if you prefer your fighting games with crisp visuals and slick, limit-pushing character models, then you will need to look elsewhere to get your fix.Closing Comments:", "date": "September 7, 2013", "grade": 3.0}