{"name": "Dead or Alive 5 Ultimate", "ref": "https://hardcoregamer.com/?post_type=post&p=54614", "text": "Note: Portions of this review appeared in our Xbox 360 Review of Dead or Alive 5.After a successful launch in 2012 and an enhanced portable version earlier this year, Team Ninja is continuing to give what their fans want the most: more Dead or Alive. While the Japanese company has been developing upgraded re-releases of Ninja Gaiden, this is the first time the treatment has been applied to the fighting game series since Dead or Alive 2. It doesnt come without reason as Ultimate happens to be the most complete and expansive Dead or Alive title to date, offering better online play, more characters and a slew of new features.The basic formula to previous DOA games remains the same, and being a fighting game, thats generally not a bad thing  especially when the system is as solid as this. Dead or Alive 5 Ultimate uses the Triangle System (also known as Rock Paper Scissors), where certain moves defeat others. The four basic movies are punches, kicks, throws and holds  each mapped to a different face button. Punches take priority over throws, holds take priority over punches and throws take priority over holds. While there are a ton of intricacies, such as holding at different heights or guarding, the formula remains the same. Its an easy-to-grasp system that makes DOA not only less-frustrating than other titles to master, but accessible for the unconverted.While the fundamentals remain the same, the presentation has received a graphical overhaul. Stages have been refined to better take advantage of the settings. Pinning opponents against walls occurs more frequently and level-specific Danger Zones have been updated with Cliffhangers, allowing the downed combatant to make one desperate grab before falling. Cosmetically, the most noticeable change is the addition of perspiration. As the match goes on, fighters begin to sweat depending on the effort put forth. Characters eventually become drenched in sweat that, yes, makes clothing see-through. While seemingly irrelevant, it adds a lair of realism to the game that makes it seem more immediate.While on the subject of translucent tops, itd be foolish not to bring up the breast physics. While bouncing breasts have always been a staple of the fighting series, theyve been completely shaken up  literally. Female assets moved based on the costume worn and traced movement, but it reached the point where it was just silly. Jiggle. Any tiny movement will elicit breast movement. Extend an arm? Jiggle. Take a step forward? Jiggle. Smile? Jiggle. While the new physics were intended to add realism to character models, it ironically made the game less genuine. Lets be honest, though; ridiculous as it may be, its doubtful Tecmo will be receiving any complaints from male fans any time soon.Unfortunately, the game doesnt sound as good as it looks. Throughout the entire campaign is an atrocious English dub that makes the story more unintentionally funny than it already is. With over-expressive reactions and voices that dont match the characters, it hardly seems like any effort was put forth. Thankfully, the language can be changed to Japanese with subtitles from the main menu, displaying the emotion the English dub should have carried. While its a nice option and certainly recommended, players shouldnt have to be forced to play a game in another language to avoid poor voice acting.For the most part, Dead or Alive 5 Ultimate maintains the same core gameplay mechanics that the original version had, but theres now a slew of new additions to enhance the experience. For example, complementing the Power Blow is the Power Launcher which, as the name suggests, sends an opponent flying into the air ever so comically, opening up a potential short juggle. All the training modes found in DOA5+ are available as well, including even more extensive Tutorials, Combo Challenges and Command Training sessions. New to this section is Team Fight which allows players to choose any seven characters to cycle through as they battle another group of equivalent strength. Once one character falls, the next steps up to take his or her place. Its a nice distraction, but is heavily overshadowed by the new online enhancements that will ensure continuous play for many months.New to the online component is the inclusion of tag mode, allowing players to team up for two-on-two battles. I dont know why this wasnt included in Dead or Alive 5 to begin with considering its predecessor contained it, but regardless, were getting it now. The max ranking has also been increased from S+ to U, which should open up a new level of skill, most of which will be exclusive to a very select few individuals. Finally, while grade points are still accumulated through continuous online play, each fighter will also earn their own set of character points. Theres not much functionality here as its only really there to show off against your opponent at the beginning of a match, which is unfortunate as something like this would be prime for unlocking costumes or various other aesthetics.As for new characters, five familiar faces that span across multiple properties from both Team Ninja and Sega make an appearance. From Ninja Gaiden we have Momiji and Rachel, Dead or Alives Leon and Ein (whos just Hayate with amnesia) make a return, and Jacky Bryant from Virtua Fighter rejoins his sister. Each individual has a unique fighting style that blends perfectly with the game, although its strange seeing Rachel battling with her fists rather than her trusty War Hammer. Additionally, there are five new stages that should peek fan interest. Unfortunately, the only one that pops out is the Sky City Tokyo which throws in the giant Buddha statue from Ninja Gaiden Sigma 2 that will interrupt the match. While the rest are well designed and look visually pleasing, the layouts arent anything to gawk over.Closing Comments:", "date": "September 6, 2013", "grade": 4.0}