{"name": "Sweet Fuse: At Your Side", "ref": "https://hardcoregamer.com/?post_type=post&p=53975", "text": "We feel badly for visual novels that come after Sweet Fuse: At Your Side, because developer Idea Factory has shown what it takes to make this very niche genre mainstream. While other games have come up short in accomplishing this seemingly impossible feat, Sweet Fuse is about as close as one can get to presenting an accessible visual novel experience thats genuinely enjoyable from start to finish. While it can be a bit more interactive than most standard VNs, the core of Fuse is still very much so grounded in the foundation laid by those that came before it. As such, Sweet Fuse feels both akin to its predecessor and a jump forward for the entirety of the genre. But does being a great visual novel equate to being a great video game?At its center, Idea Factorys latest PSP endeavor is a visual novel through and through. What that means for the uninitiated is that its a game thats heavily entrenched in screen after screen of dialog text and in-depth character development. In fact, reading makes up the majority of Fuses experience. In typical VN fashion, then, that means players will be privy to a narrative-heavy adventure that emphasizes story and characters over anything else including gameplay. In the way of a plot, Sweet Fuse is equal parts awesome and out-and-out insane. We use the latter term interchangeably with the word hilarious, though, as the premise of this excursion is enough to drop a few jaws purely due to the unexpected nature of its utter wackiness. As an otome game, players will assume the role of Saki Inafune  yes, you read that name correctly: shes the niece to infamous game developer Keiji Inafune, at least in the game anyhow. When the story begins, we see Saki getting ready to visit her uncles new theme park. Shes been invited to the opening ceremonies, and is excited to partake in a day full of fun and games. However, shortly after she shows up things start to go awry. After only a few minutes at the park, the lightheartedness of the festivities come to a swift end when Count Hogstein  a hideous pig villain whos as diabolically evil as he is fantastic  blows up the parks Ferris wheel and subsequently takes the entire park management team, along with the VIP visitors, hostage. It is only then that he reveals his true intentions: he has plans to unleash a bevy of heinous puzzles that carry with them the consequence of death to those who undertake the task of solving them in an effort to stop the dastardly fiend from blowing up the entire estate.Saki, determined to save her uncle, volunteers herself to be one of the participants in scoundrels games, but quickly finds herself in over her head as shes tossed headlong into the middle of the unadulterated madness. However, Saki isnt the only one taking on the pigs series of ghastly games. She is joined by an ensemble cast of males who come in all shapes and sizes. As an otome title, this means that ultimately Saki must work together with these characters all the while making choices that bring her closer to one guy in particular. In essence, Sweet Fuse is part zany thriller and part romance novel, which makes for one heck of a joy-filled romp through a host of wild scenarios. Therefore, the bulk of Sweet Fuse is experienced by watching the relationships develop between Saki and the intrepid men that take on the puzzles with her. Each one has their own distinct personality, making for unique interactions between all the group members, especially between the men and Saki herself. At times, the cast falls into the typical troupes and trappings found far too frequently in this genre, however, what makes Fuse so special is its tendency to highlight these archetypes with tongue-in-cheek humor  the game is never afraid to poke fun at itself, or put on display the eye-rolling stereotypes and situations so known to these titles.As an ensemble cast, each character gets an adequate amount of screen time, but sometimes thats not a good thing. While the group is solid for the most part, there are certain guys that simply arent as likable as the others. This essentially means that players will identify their favorites and consequently let out an ugh when the less-than-desirable character shows up on-screen. Fortunately, out of the six guys theres only one that really isnt all that sympathetic. This naturally lends itself well to a fun-filled narrative as the cast plays off each other well, creating more than just a few laugh-out-loud moments for the player.By the by, the story in Sweet Fuse is bonkers  and we mean that in the greatest of ways. Despite the bleak implications of the setup, the game never takes itself too seriously. To this end, it knocks it out of the park as the humor is clever, witty and full-on funny. This all is accentuated by one of the best localization jobs to ever grace the visual novel community. In other words, the writing here is stronger than any VN in recent memory, and never once presents a clumsy translation or grammatical error. Considering this is a game where the experience is wholly derived from the act of reading, its important that the dialog is succinct and clear. Thankfully, Sweet Fuse delivers in spades on that front.But as mentioned before, At Your Side isnt just a visual novel; it has some interactive elements to it, as well. For starters, there will be choices that the player will have to make throughout the story. These decisions will either influence the relationship between Saki and a favored suitor, or will impact how one of the games puzzles unfolds. Secondly, there are sequences referred to as explosive insight, where Saki has to choose a key option that assists the characters in solving a particular puzzle. There are also break time segments at the end of each day, which sees Saki spending some added time with a man of the players choosing. Overall, the gameplay features arent extensive by any stretch of the word, but the mechanics incorporated do just enough to break up the waves of text. They simply make the experience feel all the more fulfilling and full-bodied.Outside of the strong story and characters, however, the games art style and graphics are vibrant for what they are. While most of the title will take place against static backdrops, characters are given a number of animated portraits to appropriately convey the emotion needed to for a specific circumstance. Although almost all visual novels could probably benefit from having more portraits, the ones present here are enough to provide a captivating tale. On the topic of presentation, the game also comes complete with a bubbly soundtrack that is catchy as all get-out. In fact, this is one of the better soundtracks to be found in a visual novel, making this a game that is absolutely delightful to listen to. Sweet Fuse is fully voice-acted too, but those looking for English dubs will be left out in the cold as the only option here is Japanese audio. Still, the acting is superb, never obnoxious or over-zealous, which is something of an accomplishment for Japanese voice-acting. Closing Comments:", "date": "September 3, 2013", "grade": 4.0}