{"name": "Death Stranding Directors Cut", "ref": "https://hardcoregamer.com/?post_type=post&p=412009", "text": "Back in 2019, there were few games more anticipated than Kojima Productions Death Stranding. A new title from the famed director of the Metal Gear series (not to mention his work with Zone of the Enders, Policenauts and others) was something to be celebrated. The aggressively, almost confrontationally weird marketing videos and snippets of information provided pre-release served to solidify interest. This was a title that was going to be something fresh, something special. What finally landed was a divisive, bizarre title that could best be described as a sarcastic retort to the folks who complain about walking simulators. It did well enough, but it wasnt what fans truly wanted at the time. Thus, the announcement of the PlayStation 5 exclusive Death Stranding Directors Cut was met with bewilderment, at least by this reviewer. Certainly, the last thing this game needed was more. At the time, the original title felt ponderous, to put it lightly. Having played this new edition, however, I can say that time and the extra effort have both done this game a massive amount of favors, even if the points raised in our review of the original version still hold true.For those who are completely unfamiliar with the original release, the game puts players in the well-worn shoes of Sam Porter Bridges, played by Norman Reedus, deliveryman extraordinaire. The world has been torn apart by a metaphysical disaster known as the Death Stranding, an occurrence that severed all communication and killed the vast majority of humanity. Rain falls from the sky that rapidly ages most everything it touches. A dead body becomes a timebomb that will effectively obliterate everything in a wide radius. America is still struggling, and the government has decided that the best hope is to unify everyone using an internet that basically passes all data through the afterlife. Since Sam is a delivery person known to be reliable, and since hes family to the President (among other reasons), he is tasked with using his superhuman drop stuff off abilities to convince hold outs to connect to the dead net and get them hooked up with 5G (hosts) service. As this is a Kojima game, this synopsis is grossly oversimplified. If the player is someone who can get on board with some overwrought nonsense, though, theres plenty of meat to accept the teeth.The Directors Cut features two major improvements over the original. The graphical facelift shows effort as well as showcasing what the PlayStation 5 can do, even in its early days. While the original wasnt ugly, there were noticeable drops in texture quality in parts that even the games branded PlayStation Pro couldnt paper over. It was common to see the texture quality improve while approaching various objects and the sharpness of the visuals couldnt match what the actual art direction needed. The new edition fixes that with aplomb. At no point did I notice any graphical hiccups. Climbing to the top of a mountain will reward the player with a beautifully-realized landscape just begging to be explored. The gooey monsters, known as BTs, move through their tar-like glob believably and disgustingly. The character models, never a terrible sticking point in the original, also take advantage of the new detail. Subtle expressions and various scars come across in a more clear, human fashion. For the folks that enjoyed the original release, this bump alone is worth the revisit. The other impressive, additive update for this new edition utilizes the consoles controller. Much of Sams time is spent carrying around a comically over-stacked pack filled with cargo, supplies and vials of various bodily fluids to fling at the BTs to defeat or at least chase off. He will lose his balance on uneven ground, and steadying himself requires the player to pull the two shoulder triggers. Originally, this felt like a good analogue to straightening a pack. With the tension displayed in the haptic feedback of the new triggers, my mind was immediately flooded with the memory of lugging six periods worth of textbooks in my freshman year of high school. The feeling of raindrops pitter-pattering on Sams raincoat, the rumble of an electric bike and the feel as it bites into the traction of a road are convincing and immersive.Not to say that this is all this new edition adds. A relatively-early feature is a new autonomous bot that can handle some of the deliveries for Sam. If theres a settlement that hasnt reached the top level of happiness with Sam, the robot can be sent with a delivery that can convince the denizens to feel more charitable towards our hero, cutting down on some of the busy work. It would be nice if players could dump on lost cargo heading for the same place, but the ability to raise some of Sams rankings without trekking through a monster-riddled wasteland is nice. It might be thematically discordant, as the theme of machines replacing humans is one of the many facets the game explores, but this addition helps with the gameplay.New toys have been added to the mix, w admittedly, some are better than others. Some things, like a racetrack, can prove to be nice distractions. New dialogue and scenes are added as well. Of course, theres the new music. In the original release, there were moments such as cresting a tall hill and making a final trudge to a destination when a music track will start playing giving these times a poignant feel that underscores the world Sam is in and his place in it. The new tracks mean more of these moments. While one can be concerned that doing this more often would wear out the tracks welcome, it works better in practice. It feels more rewarding to unlock a new song for the music player, and the moments are still sparse enough to feel special.While the Directors Cut does so much to improve upon a game, there are some things that one wishes would have seen another pass over the original. The emails and interviews are a prime example. This is a strange world to explore. Its recognizable as Earth, but its filled with many unfamiliar concepts and things. Plenty of explanation for these things can be found in emails sent to Sam, as well as a collection of interviews with the worlds various characters. It makes sense to keep the technobabble and superfluous lore pushed off to the side. Reading text documents on a TV screen while being eager to get tromping to the next settlement, however, makes digging through this stuff a chore. In an ideal world with unlimited budget and technical resources, it would be nice if there were an app or something that would allow the player to peruse these documents at another time. It would keep the player plugged into the game while not playing, and bolster an appreciation for the universe Kojima Productions designed. Theres also the lack of trust that some of the writing has for the player. It doesnt need to be literally announced by a character that something is symbolism. The writing is many things, but subtle isnt one of them, especially in the specific instance that comes to mind when typing this up. The story could also use trimming. It feels as if basic concepts, like building a structure in the world, are repeated a few times over when once is plenty. If something needs to be explained again, the person at the controls could just replay the briefing or view one of the expository documents in the menu system.In the end, though, this is a game thats worth a second chance. It does have quite a bit to say, and say again, about humanitys intrinsic needs for bonds. This is a theme that its perfectly happy to expound upon during its cutscenes. Gameplay moments are when the theme comes into focus, though. During play, there was a previously PC-exclusive mission that tasked Sam with retrieving a chip thats laying in a deep crevice. Upon arriving at the edge, I found another player, in their own instance of the game, using a rope to climb down to grab it. Due to the asymmetrical nature of the game, the rope managed to find its way into my instance, allowing me to climb down and grab it for myself. Players can do things like that, work together to build roads without meeting each other, leave tools in opportune places, and myriad other ways to inadvertently assist. The meaning is clear: were all trying to make our own way through life, but that doesnt mean that we cannot help each other in the process. Closing Comments:When playing the original version of Death Stranding, I would have described it as lethargic with some horror elements when dealing the monsters. With Death Stranding Directors Cut, this opinion was reevaluated. Its a game about many things. Its about society and the role each person plays in it. Its about overcoming depression. Its about confusing and/or boring friends when they watch me play it. This is a chill game punctuated with tense moments, with a pacing that I didnt appreciate until this edition. As an unexpectedly-improved release, Death Stranding: Directors Cut is well worth the time for the curious or the existing fans, proving that Kojima still knows how to surprise.", "date": "Bohn on October 5, 2021", "grade": 4.0}