{"name": "Dead Rising 4: Franks Big Package", "ref": "https://hardcoregamer.com/?post_type=post&p=282006", "text": "Last year, Xbox One and Windows 10 players got to spend Christmas in Willamette, CO with Frank West and a horde of the undead. Dead Rising 4 brought the joy of slaughtering thousands of zombies to millions of gamers in 2016, but PS4 owners were left out in the cold. This December, however, PS4 owners are being let into the warmth of the Willamette Memorial Megaplex to experience Dead Rising 4. Dubbed Dead Rising 4: Franks Big Package, this re-release packages the base game with all previously released DLC and an exciting new bonus. Is Dead Rising 4: Franks Big Package the right size to fit under the tree or more of a stocking stuffer?In our review of Dead Rising 4, we felt that the game was a zombie slaying experience unlike anything else on the market, and while the co-op was disappointing, the game retained what made the series so appealing in the first place. The same holds true for Dead Rising 4: Franks Big Package. PS4 players are getting the exact same story, combat and online co-op that Xbox One and Windows 10 players got to enjoy a year ago. Of course, Capcom bundled in all previously released DLC, which means PS4 players are also getting all the extra skins, modes and story content up front.Bundling in the additional content ends up benefiting the story by giving it a proper conclusion. The base game that launched over a year ago left the story on a cliffhanger that would later be wrapped up months later in Frank Rising. The fact that PS4 owners can play the campaign and then jump immediately into the real final chapter of the game is excellent, especially since they dont have to pay an extra fee just to access the true ending of the game. Aside from the addition of Frank Rising, the plot remains the same. You still play as Frank West, photojournalist and zombie-killer, who is sent into Willamette to uncover the truth behind a new zombie outbreak. The story is just as comedic as it was a year ago, but its still the same story. While first-time players will get a kick out of it, those that have already played the game wont find any exciting new revelations here. The same can be said for the rest of the game. Players will still use Franks camera to complete investigations, utilize a crafting system to build insane weapons, drive an assortment of vehicles through hordes of zombies and hunt down maniacs. Melee combat is still the best way to play the game and theres no shortage of enjoyment that can be had by using one of your homemade creations to dismember the walking dead. Theres also the exo-suits, which really pack a punch and deal devastating damage to any enemy unlucky enough to get in your way. Unfortunately, ranged combat is still a drag, but youll be having so much fun with the melee combat that its easy to forget there even are ranged weapons. What really makes Dead Rising 4: Franks Big Package feel new and exciting is the Capcom Heroes mode. Also available on Xbox One and PC as a free update, this mode allows players to experience the entire Dead Rising 4 campaign with a huge twist; Frank West can dress up as famous Capcom heroes and utilize their unique powers. From Devil May Crys Dante to Resident Evils Jill Valentine to Classic Frank West, West can don the appearance of various characters for a set period and use their unique weapons and skills in combat. For example, when Dantes skin is equipped, Frank can utilize Rebellion and Ebony. Capcom Heroes can be collected a variety of different ways. Some are earned through advancing the story, collecting Stars in the environment, or clearing out safe zones and getting them through vendors. Players can then swap between costumes at arcade machines placed copiously throughout Willamette.Capcom Heroes does more than just add new ways to play the campaign; it adds plenty of new items to collect. Capcom Treasures are littered throughout the city, and eighteen Capcom game posters are intricately hidden in key locations. These add fun new objectives to go after and its always cool seeing a familiar looking game poster in the weirdest location. The only downside to Capcom Heroes is that it restricts gameplay options. Weapons, crafting, exo-suits and skill points are all turned off with all your weaponry and abilities determined by what costume Frank is wearing. Its a small price to pay to see Frank West turning foes into Jill sandwiches and the variety in the costumes keeps the mode fresh from start to finish. Besides, theres always the standard story mode to enjoy crafting and exo-suits.Dead Rising 4: Franks Big Package is excellent at filling the screen with hundreds of zombies and plenty of explosions. The presentation holds up well on PS4 despite having so many zombies and effects on screen at once, and the Christmas aesthetic remains as charming as ever. There just isnt another game out there that lets you slay zombies while listening to classic Christmas tunes. This isnt the most amazing looking game ever, but it accomplishes what it has to to get as many zombies in front of you as possible. Closing Comments:Dead Rising 4: Franks Big Package does what a proper re-release should, packaging the base game together with all DLC and a smidgen of exciting new content. The inclusion of Frank Rising from the get-go gives the comedic story a proper ending. While combat, side activities and the world remain unchanged, Dead Rising 4 remains a joy to play even a year later. What really makes this such a great package is the new Capcom Heroes modes. Dressing up as some of Capcoms greatest characters and utilizing their weapons and abilities to destroy hundreds of zombies is a thrilling new way to experience the campaign. Its unfortunate that PS4 players had to wait a whole year to experience this zombie-slaying adventure, but at least theyre getting a big package filled with plenty of comfort and joy.", "date": "December 5, 2017", "grade": 4.0}