{"name": "Rayman Legends", "ref": "https://hardcoregamer.com/?post_type=post&p=53985", "text": "Who would have thought Rayman would become one of the most respected gaming franchises? Thats not to say that Rayman isnt good  far from it in fact, as our precocious limbless rabbitbearmystery thing has been in his fair share of fantastic adventures. Until the release of Rayman Origins in 2011, however, it was considered a decidedly second-tier video game franchise, just below Earthworm Jim (and still very above Glover). Bringing back the original development team, Ubisoft Montpellier, and overhauling the game with beautiful hand drawn graphics breathed new life into the series and proved that a great classic platformer experience was still possible in the aughts. Unfortunately, Origins didnt exactly light the world on fire, but Ubisoft was impressed enough with the game that they thankfully decided to move forward and expand on the series with Rayman Legends, a game so deep that it includes most of its predecessor as an unlockable.Rayman Legends picks up where Rayman Origins left off. Exhausted from quashing the great uprising of Granny of the Land of the Livid dead, our heroes did what any true heroes do  take a giant nap. Unfortunately, the old proverb of you snooze you lose is proven accurate, as the nightmares from Bubble Dreamer take over the Glade of Dreams as they slumber. Now its up to Rayman and company to once again defeat the evil that has awoken and save the Glade of Dreams. Besides the ending, thats about the entire story of the game, as the characters that do talk only say a few words and any cinematic is there for humorous purposes or to expand on the level. Rayman is joined on his quest by Globox, King Teensy and, making her franchise debut, the viking Barbara. There are also multiple heroes that can be unlocked by collecting lums throughout the game, all of which are variants of the original four. While not drastically different, all of the heroes have their own special charm and quite a few are hilarious. Besides some minor tweaks, the base gameplay of Legends is identical to Origins. In Origins, stems could be pulled out of the ground that shot out lums trapped in bubbles, quickly rising off the screen. This has been replaced in Legends by enemies who are easily whacked for some lums. As it could be annoying for completionists to have a few lums float off screen, its a welcome change. Another tweak is that the hidden creatures in cages in Origins were Electoons, but are Teensies in Legends. The only other noticeable change is that levels in Origins were usually separated into multiple areas blocked by an eyeball, but are now one huge area in Legends. While its a tiny list of changes, Origins played exceptionally enough that there really isnt much to improve. Y jumps, B hits, ZR runs and theres a few other moves that can be done with those buttons in combination with the control stick. While simple, the controls harkens back to the days of classic platformers where there wasnt more than two face buttons on a controller. What makes the game so fun is the environments that those few moves must be utilized in to survive. Level design is nearly flawless and makes jumping around and bopping enemies rewarding and challenging in all the right ways.The most notable addition in Rayman Legends is that of the touch-based levels. These levels, which probably account for around twenty percent of the new stages, are entirely controlled on the Wii U GamePad with the help of Murfy in his most prominent role since Rayman 2: The Great Escape. These levels are essentially endless runners and similar to the recent mobile title, Rayman Jungle Run. While putting endless runner mechanics into a major console game would usually be cause for alarm, they mesh perfectly with the Wii U GamePad and help break up the (still glorious) monotony of the standard levels. The stages are generally solved by cutting ropes, creating passage ways and subduing enemies as Rayman does his thing. Theyre a bit simplistic at first, but eventually grow to be fiendishly difficult, requiring absolute precision, memorization and concentration to complete. As good as these are, theyre not as fulfilling as the standard levels, but their presence can be looked at like this: with eighty new levels, taking them away completely would have left around the sixty six levels Origins offered. Theres still a massive amount of platforming without their inclusion, so they should be thought as s a very entertaining bonus.While the gameplay is near pitch perfect, what makes this reimagined series so endearing are the stunning visuals and outstanding level design. Running off the same Ubiart Framework that Origins did, the game looks just as beautiful but even more eye-popping. Its looks as if Origins was a standard definition single ran through an HD cable box, so crisp that it no longer looks hand drawn, but now like a beautiful modern cartoon come to life. Playing the game on a high end 60 plasma revealed one of the most artistic and eye-popping games this reviewer has seen, with the game looking like a beautiful paining any time the controller was put down. Not only is everything bursting with colors, but its imaginative. Fiesta De Los Muertos, for instance, is full of pink centipedes, spanish-inspired skeletons and gigantic luchadores. Theres parachuting toads that hum Rise of the Valkyries, gigantic dragons and jacked gorillas just to name a few. One of the best sequences involves an evil clan of Teensies who when individually defeated, get shot up into space, landing in a planets crater, only to be played like a musical instrument by its inhabitants. By far the most inspired addition is that of the music-based levels. Every world ends with a special stage that is synced to a different song. Running, jumping on an enemy, zipling and everything else in the stage is a different note of the song. Completing it in one go gives an almost euphoric feeling of art, music and games coming together perfectly. My favorite of these stages is actually the first one, Castle Rock, which is set to Ram Jams Black Betty. Throughout the stage, enemies pop out from the screen and yell (in a cartoony voice) BAM BA LAM! in such an adorably awesome way that it deserves to be experienced by anybody remotely interested in rhythm games.The most incredible thing about Rayman Legends is how robust the package is. Its simply jam-packed with content, including eighty new stages, forty stages from Rayman Origins (nearly the entire game), daily challenges, daily extreme challenges, weekly challenges, weekly extreme challenges, unique multiplayer, the Kung Foot soccer mode, a creatures gallery, tons of heroes, timed Invasion stages and an enormous amount of collectibles. Going into detail about these would likely double the length of the review, so just know that youll get your moneys worth even at the $59.99 launch price. Its the sort of game that one could play on a daily basis for at least a year and always find something new to do. Closing Comments:Doing the impossible by topping its predecessor, Rayman Legends is one of the best gaming experiences this year. It takes everything fun about classic platforming and puts it in a visually stunning environment. Its a product of minds who understand the fundamentals of game design, humor and art. It never aspires to be anything more than a beautiful platformer and succeeds at practically every turn. With eighty new stages, the majority of Rayman Origins, multiplayer modes and a new online challenge daily, its the sort of classic experience that one could spend numerous months exclusively playing, unlocking every secret it has to offer. The endless runner stages dont live up to the excellence of the platforming, but its hard to complain about their inclusion when their absence wouldnt have dramatically impacted the amount of content. Clearly designed for and best experienced on the Wii U, its a rare non-exclusive killer app that should be purchased immediately to ensure its franchise lives a long and productive life.", "date": "August 30, 2013", "grade": 4.5}