{"name": "Europa Universalis IV", "ref": "https://hardcoregamer.com/?post_type=post&p=53087", "text": "Europa Universalis IV is a rare true RTS game. By that, I mean that most games billed as RTS games are focused primarily on tactics rather than strategy. In games like Starcraft 2, being excellent at the micromanagement of units is usually far more important than any sort of strategic thinking. The Total War series uses a combination of turn based strategy and real time tactical battles. In EU4, by contrast, the player has no control over battles, only over the campaign map; they can pause the game to issue a series of orders to armies, navies, diplomats, merchants, etc., but those orders arent executed until the game is unpaused, at which point they are executed simultaneously along with everyone elses. Things take time, not turns, which means the player often has to watch nervously as his troops march to put down a revolt, hoping his city can withstand the siege just a little longer. The other important difference between this game and others in the genre is the use of probabilities; things dont happen in a deterministic fashion. Random events, uprisings, and battle outcomes each proceed in a probabilistic fashion with probabilities determined by a myriad of factors. This adds to the realistic and historical feel of the game, in which unlikely events do occur and can catch you off guard. There are no guarantees but there are a lot of different things you can do to nudge the odds more in your favor. This becomes a fun study in managing large numbers of low probability events. An interesting side effect is that reloading a previous save game will end up being very different from the last time you played it. Balance is key in EU4, as a purely military strategy will result in grand alliances against you which you will be unable to deal with. One must balance religion, economics, war, diplomacy, stability, technology, and competing interests as well as cultural and racial politics in a delicate dance on the road to power and control. This effectively creates a set of mechanics that challenge the player to constantly come up with new and ever more sophisticated strategies in a game one could spend years mastering.Figuring out this game was one of the toughest challenges in my gaming life. There are a relatively large number of concepts to master and each one of them is a challenge on its own. International relations, for example, are hugely complex. Webs of alliances form between states such that what was intended as a small war against a small neighbor might result in a world war that catches the player completely unprepared. At first this is completely overwhelming, like most of the games mechanics, but after some experimentation, seems natural, correct and, frankly, historically accurate. Trade is the same way; at first you wont know what to do with your merchants and what any of it actually means, but with a little time and maybe a Google search or two, you will have a good enough handle on it to begin to experiment with and optimize your trade income. I had a hard time figuring out the interface at first and felt that it could have been far more intuitive, but like everything else, it eventually made sense and became smooth and natural. EU4 is full of opportunities for learning about history, geography, politics, religion, military science, empire building, and managing power and prestige in a highly competitive atmosphere. Furthermore, the better the player understands these concepts, the better he will do and the more fun he will have. The game offers plenty of opportunities to experiment with and learn about each concept while playing (such as several paragraph long tool tips which explain the historical context of units, ideas and technologies), but you could also consult Wikipedia and use information you learned in school.As such, I would highly recommend this game for anyone old enough to play it, although it does have quite a learning curve which might put off a lot of people (both young and old). On the other hand, as you get more familiar with the game it can become quite addictive, so do not be surprised to find yourself or your child/boyfriend/spouse/roommate, with baggy eyes that still reflect the monitors glow, rambling about wars of succession to everyone around when you wake up in the morning. Better yet, if youre into LAN parties, it has a hugely intriguing multiplayer mode where you, your friends and your friends friends can pick a country and go at it in whats sure to be a fun and crazy time. Closing Comments:", "date": "August 20, 2013", "grade": 4.5}