{"name": "Castlevania Advance Collection", "ref": "https://hardcoregamer.com/?post_type=post&p=411650", "text": "Castlevania has taken on many forms on many platforms over the past 35 years. Some of the more celebrated entries have been the Game Boy Advance titles that were released in the early 2000s: Castlevania: Circle of the Moon, Castevania: Harmony of Dissonance and Castlevania: Aria of Sorrow. A couple years ago Konami released the Castlevania Anniversary Collection and while that was a great collection for fans of the franchise, many lamented about the lack of the GBA titles, but it appears those anguished cries did not fall on deaf ears as Castlevania Advance Collection contains those three games along with Castlevania: Dracula X.Retro collections such as these tend to include bonus content. Castlevania Advance Collection has a decent amount of stuff for fans to check out, but its nothing too extravagant. Theres an art gallery to look at concept artwork and box art from different regions,a music player that has the full soundtrack for each game, as well as the option to play the American, European and Japanese version of each game.In addition to that content each of the GBA games includes an Encyclopedia menu in the pause menu. This includes a list of in-game items, equipment and bestiary. In addition to that information there are specific lists for each game. Circle of the Moon includes information about Dual Set-Up System (DSS), Harmony of Dissonance has information about Spell Fusion, while Aria of Sorrow has a list of souls. All games include a story overview. In ancient times when these titles were originally released, games came with instruction booklets that had this type of information included. The three GBA games are what are colloquially known as Igavanias after the success of Castlevania: Symphony of the Night taking the franchise in a metroidvania direction. You know, big non-linear maps to explore with branching pathways and areas blocked off until new abilities are found that grant new forms of traveling. Oddly enough, Circle of the Moon is not a true Igavania in that Koji Igarashi was not in his typical role of producer or scenario writer, but it shamelessly wears its Symphony of the Night influence on its cape. Dracula X is a weird inclusion with this collection as its not only not a GBA title, but a linear title comparatively speaking. It would have made more sense in the Castlevania Anniversary Collection, but all that aside its a nice inclusion if viewed as a bonus title.Castlevania: Circle of the Moon is considered non canon in the Castlevania timeline. Circle of the Moon takes place in the year 1830, with the vampire hunter being Nathan Graves with no real connection to the Belmont family, though his weapon of choice is the Hunter Whip. This entry uses the unique DSS system, where Nathan collects different cards and combines them to create magic attacks. Despite existing outside of canon, this is actually a great Castlevania game. The music selection features a few remixed tunes from prior Castlevania games, which gives it a nice feeling of familiarity. It was the first 2D follow up to Symphony of the Night, and despite a lack of Igas hands-on involvement it does well as a follow up. It recreates the gameplay and exploration elements that made its predecessor a masterpiece, but has its own style. Diehard Igrashi fans might sleep on this title, but doing so would be a mistake as this is a top tier Castlevania. Castlevania: Harmony of Dissonance was released roughly a year after Circle of the Moon. It brings Iga back in a writer and producer role, and the art direction looks similar to Symphony of the Night. Even though the player is back to controlling a Belmont in the year 1748, this time its Juste Belmont, the grandson of Simon Belmont. Juste may be a Belmont but looking at the character design Alucard may need to make an appearance on the Maury Povich show. In addition to the long white hair, shadowy traces follow behind Juste in his travels, and we can all think of another one of Draculas enemies who does that. Castlevania: Harmony of Dissonance is overall a great game and anyone who enjoys Igavanias will enjoy this one. It does suffer from two notable flaws, though. Maybe in a reaction to Circle of the Moon, Harmonys overall look is basically pocket-sized Symphony of the Night. Obviously any Igavania is going to draw comparisons to Symphony, thats a huge part of why fans like them, but this one doesnt do much to distinguish itself as having its own identity. The other flaw is Castlevania games are known for great soundtracks, even if the scale needs to account for hardware limitations on sound quality. Harmony of Dissonance is the most appropriate name for this title as the soundtrack is a contender for worst within the franchise. But those criticisms aside, Harmony of Dissonance is a great game.Castlevania: Aria of Sorrow is arguably the best game in the collection. Symphony of the Night is considered by many to be the best Castlevania, but Aria is the strongest contender to the crown. Aria of Sorrow takes place in the year 2035, with Soma Cruz awaking in Draculas castle during a solar eclipse. The basic gameplay is the same as the other two, but what sets Aria apart is the soul system. Soma can absorb souls from the enemies he kills and wield their powers. While there are many different types of souls that offer different powers, throwing cats as deadly weapons is still one of the more enjoyable means of dispatching enemies. This title combines the best tried and true gameplay elements from Symphony of the Night while adding its own unique mechanics with the soul system. Also even though the box art is stylistically similar, Aria clearly has its own identity with a strong story. Its actually fun to play a second time and look for all the foreshadowing that may have been missed the first time around. This title alone is worth the collections price of admission. Castlevania: Dracula X is the black sheep of the collection and while it doesnt fit in with the rest, its a welcome bonus game. Dracula X is kind of a port of Castlevania: Rondo of Blood. Its not a port or remake but something kind of in between. It follows the same story as Rondo and uses many of the same character assets. The progression is much more linear than Rondo with the stages having completely different layouts and changes to boss fights. Its a rather maligned title by fans, but may be more maligned than necessary. If someone is expecting Rondo of Blood and is given Dracula X the natural response is disappointment. Rondo of Blood is the superior game, and if were going to compare it to a linear 16-bit title, Super Castlevania IV is also the superior game. Its the weakest overall game in this collection, and mid tier within the entire Castlevania franchise. This one is also great for people looking for the punishing difficulty of classic Castlevania.Castlevania Advance Collection has a few viewing options depending on if players wish to keep everything pixel perfect or stretch it out for the full screen experience. Dracula X also has CRT filters for the complete 90s gaming experience. Theres an option to turn on high-quality audio which improves the sound slightly above the original hardware limitations, but this is more noticeable when using a headset. The button mapping for the the GBA games is odd, with using the PlayStation controller as a reference point X is jump and circle is attack/cancel. It can be remapped to a more familiar layout, but in these type of games Im used to square attacking and circle canceling, but this is a minor gripe. All of the included games are great ports of the original and some of the best Castlevania games produced. Now if only Konami could mod the games to eliminate the stylus requirement and release a DS Castlevania collection on modern platforms. Closing Comments:Castlevania Advance Collection is a must play for Castlevania fans and metroidvania fans in general. The three GBA games may have their graphics and sound quality limited by their original hardware, but theyre prime examples as to why these are the best type of Castlevania games. The biggest visual drawback with this collection is when a game designed for a three-inch screen is displayed on a much larger screen, the magnification doesnt do any favors to the graphics. Nevertheless, exploring the different incarnations of Draculas castle is just as enjoyable now as it was twenty years ago when these games first started appearing in handheld format. Out of all the games Aria of Sorrow has aged the best and is the star of this collection. Circle of the Moon and Harmony of Dissonance dont shine as bright, but are still great titles. Dracula X is worth playing, but it can be described as good but not great and seems like it would be more at home in the Anniversary Collection. Overall, Castlevania Advance Collection is a dream collection for Castlevania fans.", "date": "October 1, 2021", "grade": 4.0}