{"name": "Worms: Clan Wars", "ref": "https://hardcoregamer.com/?post_type=post&p=51721", "text": "The Worms series is a long-running, and storied one. For the past eighteen years, the games starring cutely-rendered invertebrates have been released at an almost annual rate. But over the years, the games formula hasnt evolved dramatically. That is, until last years Worms: Revolution. Revolution added real-time liquid simulation and four different classes of worm to the already hectic sprawl. Its also largely known as the most evolutionary entry in the series, adding new life to what some might call a stagnant property; but can this years Worms: Clan Wars stand up to it?The most noteworthy addition to the series is a fully-voiced narrative. It opens up with a quick briefing from your employer, a woman with an English accent who is clearly doing her best Lara Croft imitation. You discover she is trying to obtain a valuable artifact, and fully intends to sell it for some quick money. So you, of course, agree to help out. The story doesnt really take any interesting turns, and has an annoying amount of recurring beats. That said, the English womans dialog can be pretty funny at times, and although the game never made me burst out laughing, there would sometimes be a clever play on words that would cause me to just smile dumbly. The dialog may have never made me guffaw, but at least it was never cringe-inducing. Go in expecting writing about on-par with most childrens cartoons in the early ninetys and your expectations will likely be met.The only true downside to the Story Mode is that its pretty difficult, even for someone who has a history with Worms games. Some levels almost took me a full hour to beat, mostly because the games checkpoint system is less than generous. In addition to that, some sections of the game expected me to just figure out certain mechanics that hadnt previously been implemented, or presented. For instance  there was one point in the story where to solve a puzzle I had had to preform a double-jump and use the games Shoryuken move consecutively to hit something that was higher than my worm could normally reach. That might seem simple, but to use most every other weapon in the game you have to be standing completely still. Finding out you could jump and Shoryuken at the same time was quite a surprise to me. Question my ineptitude if youd like, but I feel like the move should have been taught in an earlier part in the game, rather than just thrown-in half-way through. There are several occurrences like this where I became stuck because of a lack of direction; luckily, no other parts left me stumped for quite as long as the one described.Thankfully, thats pretty much where the bad stops in Worms: Clan Wars, assuming you have enjoyed prior entries in the series. Along with some paltry tweaks to each class abilities, a clan system has been added to the games multiplayer offering. I didnt get much of a chance to toy around with it, as there is no one to play the game with at this time, but there are some nifty features like a clan emblem editor.Even though there have been some small tweaks and additions, the best news is really that all of the greatest things from Worms: Revolution have successfully made their way into Clan Wars. The real-time liquid still adds a great bit of fun to the mix, being able to wash away an enemy who clearly has the advantage with a well-placed shot at a container full of water has never been more satisfying. Also, the 3D engine that was introduced in Revolution looks better than ever, and the multiplayer, is, of course, stellar. Also, if the main story wasnt hard enough for you, theres a brand new Worm Ops mode that features increasingly difficult missions. On top of that, youre given a star-rating for each one of these missions you complete. The mode also has its own leaderboards, so you look how poor you are at the game when compared to the best in the world. Closing Comments:", "date": "August 8, 2013", "grade": 4.0}