{"name": "Sword of the Stars: The Pit  Mind Games", "ref": "https://hardcoregamer.com/?post_type=post&p=49319", "text": "Video games and difficulty have always gone hand-in-hand. Heck, offering players a challenge is one of the main reasons they survived for so long before the emergence of storytelling in the medium. Its human nature to feel a need to overcome incredible challenges  to win when all of the cards are stacked against you. Sword of the Stars: The Pit  Mind Games laughs at your foolish human desires, and beats you to a pulp comprised primarily of disappointment, dreams, and your salty human tears.Simply calling The Pit hard would be colossal understatement. Its a member of the notoriously difficult sub-genre of RPGs, Roguelike (to which I am a newcomer), and definitely earns its label. For those unfamiliar with this subset of RPGs, Roguelikes combine the fairly-common dice rolls, and randomly generated environments of RPGs and mixes them with permanent-death and soul-crushing difficulty. In The Pit  Mind Games your goal is to descend into The Pit,, which is comprised of floors of increasing difficulty (and scale) that are all randomly generated. The traps, enemies, loot, everything that shapes your experience is decided by the roll of the games digital dice.While the randomness of everything makes the game almost highly replayable (an important boon, as you will most definitely be playing through the early parts of the game a lot), I cant kick the feeling that the game rests on dice-rolls a bit too much, and not enough on skill. As I said earlier, I am a newcomer to the genre, so blame my issues with the game on my incompetency if youre so inclined, but I felt that I was playing the game to the best of my abilities, and could never catch a break. It seemed like I was always either never getting any health packs, or never getting any food, ammo, etc. I would always have an abundance of one thing and be scurrying around desperately to find the other.This leads my into a bit of a quibble I have specifically with the expansion Mind Games. This expansion offers ten new floors, several new room-types (more on those in a bit), new abilities and two new characters. And the two new characters can only be played on the normal (or higher) difficulty. While Normal for most games is a completely manageable difficulty setting, I would equate The Pits Normal to another games very hard. Anyways, the characters only being available for difficulties above easy means that, unless the games dice are in the players favor, they wont be able to experience those new characters very thoroughly.I should state that I am fully aware that the draw to this game is its merciless difficulty, but having a fighting chance every time you attempt a run is a pretty important attribute. That said, the game is incredibly addicting. I think it was about eight days ago I was assigned the game, and since then Ive logged a bit over 47 hours into it, and was still having a grand time with it even though for a good long while I hadnt really been making progress. Call me a glutton for punishment, but theres something incredibly appealing about the game. It must be that human need to rise above challenges driving me, but I legitimately had fun with it, despite its insane difficulty. It also helps that, despite how difficult it is, it shows its sense of humor on choice occasions.The game is made up of randomly generated floors and, like a regular building or house, each floor has several rooms to explore. These rooms doorways often have two different markings. One marking will be a symbol that shows what kind of room it is (kitchen, crafting room, etc) and on occasion a door will be a certain color. This color is a sign that the door has a Trap fixed to it, and that it will either transmit a sometimes positive but usually negative condition to your character (+50 hm, blindness, disease, etc) or destroy some of your items. Going through these trap-doors is often a risk you have to take, as theres always a possibility that the room it permits entrance to has that one rare resource youre aching for. While it is good to note what affect each color has on you, youll have to do it for each respective playthrough, as the colors that mark the affects are different for every run.Now onto some more expansion-specific talk. One of the most interesting (and helpful) additions made in Mind Games is Psionic powers: the games answer to magic. Psionic abilities range from the all-important offensive moves to disease-curing lifesavers. They offer an incredible amount of help, but cant really be used until late in the game, unless of course youre playing one of the games new classes The Psion, who has a pretty good amount of the powers from the get-go. In addition to The Psion, the expansion offers The Rogue, a new class that in addition to having fairly strong attacks can move three times in a turn instead of the regularly allotted two.The expansion also offers a special room every five floors that acts as a checkpoint and bank where players can store items and experience points for future characters. Roguelike purists will likely scoff at this feature, and that isnt entirely without warrant. Starting a new character off on a higher floor is sort of silly, as his/her weakness will get him/her killed almost immediately  even if you do have a bit of XP stored in the bank.The Psion and The Rogue are the only characters that come with the expansion, but the core-game comes with three. Since this is a sort of kill two birds with one stone kind of review, Ill go ahead and describe those really quick: The Marine is a good character for players who are just trying to figure out how the game works. Hes powerful, and is just a bit more likely to find weapons than other classes. The scout can move further than the other classes but is weak. And last but not least, The Engineer is a great class for your first serious run. The reason for that being that he is able to hack into computers with relative ease. And computers hold recipes for use in the games crafting system. An incredibly convenient feature is that all characters can access your catalog of recipes across playthroughs. The game also features a wide range of enemy-types, from invisible robo-wolves to armor-destroy blobby things. Youll have to be playing at your best, and be prepared for anything to have even the smallest chance of survival.Closing Comments:Sword of the Stars: The Pit  Mind Games is incredibly difficult  sometimes unfairly so  but most importantly, its fun. Each run feels like a reasonably unique experience, even if is ends with complete and utter failure just like the your past attempts. And after that failure? I was always excited to start my next run. It manages to be fun despite its sometimes arbitrary difficulty. The game has kept me more than occupied for forty-seven hours, and will probably keep me busy for many more hours to come. If you need a relatively cheap and remarkably replayable game to get you through the dog days of summer, you could do quite a bit worse than pick up The Pit and its expansion Mind Games. With its wildly different character-classes and completely randomized nature, The Pit is almost infinitely replayable  even if it does cross the line from hard to unfair on occasion.", "date": "July 24, 2013", "grade": 4.0}