{"name": "No. 6 (Volume 1)", "ref": "https://hardcoregamer.com/?post_type=post&p=48924", "text": "No. 6 is the manga adaptation of Japanese writer Atsuko Asanos acclaimed nine-part novel series under the same name. Although the original manga was released back in 2011, this is the first time North American readers are getting a chance to catch up on the story thats captivated countless readers as a result of its distinct level of intrigue and thematic poignancy. Sometimes, however, no matter how wonderfully-crafted a story is, making the jump from one medium to another, while being translated between languages, isnt an easy task. No. 6 seems to understand this concept a little too well at times, and although this first volume is filled with plenty to like, it comes up short in the end.ContentReaders will almost immediately notice how fast-paced No. 6 is. Right from the start, the manga isnt afraid to throw folks into the narrative without much explanation of whats going on  thats for better or for worse, mind you. Nevertheless, we do get a quick synopsis up front that sets the stage for the tale, or at least provides us with some kind of explanatory backdrop of the books setting. Our story takes place in the utopian-like city aptly dubbed No. 6. This is a confined cityscape that has employed a strict class system, placing a strong emphasis on social prestige and moral elitism, giving way to a society that looks after its top tier and neglects all the others. The star of our story, Shion, just so happens to be part of that upper class, and as such, has been raised in a privileged environment devoid of any kind of true real-life hardship. Our 12-year-old heros life, however, abruptly changes just a few pages in when a mysterious boy presents himself in Shions window on the night of a fateful storm. Hes tattered and exhausted, broken and desperate for some kind of refuge from whatever it is thats obviously pursuing him. Our young protagonist takes the boy in without hesitation, but is unaware of how serious this act is.While the consequences of his actions arent immediately felt, they are when the manga jumps ahead in time four years and the real plot begins. Its at this instant that a mid-teen Shion begins to realize just how serious the ramifications of his previous actions are, as he is accused of murder as well as harboring a fugitive of the law (the boy from four years ago) and then subsequently captured by government agents. Might we add that all political and authority figures in No. 6 seem explicitly corrupt, so Shion falling into their grasps spells bad news for the adolescent. Fortunately, the boy Shion saved all those years ago comes to the rescue and springs our hero from the clutches of his assailants. From there its page upon page of Shion and his rescuer, Rat, fleeing the city and leaving behind everything Shion once knew and loved.The story in the first issue of No. 6 is clearly more concerned with capturing the attention of its audience than providing a coherent narrative experience. Because of this, and as already mentioned, the action is front and center here. This is great for luring readers in, as theres plenty of eye candy and mysterious hooks that sincerely try to elicit a kind of addictive, cant-put-the-book-down response. But while this approach may resonate with some, most of No. 6s readers will be left confused and frustrated by the mangas quick moving scenes, lack of story and character development, and misleadingly drawn panels.CharactersUltimately this is the mangas primary issue: it simply sacrifices story for alluring action. Shions character in specific is developed with the depth of a kiddy pool, with the writing only intermittently exploring more than the fundamentals of his privileged life. We do get to bear witness to Shions struggle with leaving behind the only life hes ever known, which is wonderful, but this particular struggle isnt extrapolated upon with any great detail until the last pages. By the end of the first volume, readers will almost be no closer to understanding the two leads, than they were when they first started the book. While things no doubt get better towards the end, the idea of too-little-too-late seems to be in full effect. In fact, that very notion plagues much of No. 6 in general; theres a respectable amount of mystery to be found in the tale at large, but its never realized due to consistently taking a backseat to action scenarios and confusing character segments.VisualsWhat can make certain scenes so aggravating are the panel layouts. Although No. 6 tries its best to accentuate its high-octane encounters with hard edges and concise, simplistic panels that bleed over into the next to give the flow of events a smooth transition, it all ultimately ends up coming across as disjointed. Given the fact that the story isnt designed to fill in all the story gaps for readers  leaving many questions either unanswered completely, or doling them out at a much later point in the book  the puzzling use of misleading panels and poor angle perspectives makes following the narrative all the harder.That being said, the artwork overall is a bit of a mixed bag. At times its crisp, impressive with its attention to detail and ability to capture kinetic passages with clean lines and succinctness. In other instances, however, it lacks focus, particularly so in segments where theres a lot going on. On a more personal note, it would seem that artist Hinoki Kino has drawn the eyes of all characters just slightly larger than they should be. Some may not notice or care about this, but we found it strikingly interfering to the reading process, as the facial portions are off because of those gaping peepers. All in all, its not the strongest style around, but also hardly the worst. In fact, the art is pretty standard  interpret that however you wish.Closing Comments:", "date": "July 21, 2013", "grade": 3.0}