{"name": "Time and Eternity", "ref": "https://hardcoregamer.com/?post_type=post&p=46375", "text": "Time and Eternity is a game that looks like it should be wonderful. It has an attractive art style, some unique combat mechanics and an alluring premise about a split-personalityd princess falling in love with a knight who gets turned into a dragon by some fancy, interloping, time-traveling magic spell. With those qualities strongly intact then one would assume that Time and Eternity is a sure-fire win. But in this case, making such an assumption would distort time and space itself, ripping a hole in the world of all things rational and true, as this one-of-a-kind JRPG is unique for all the wrong reasons, and quite plainly, one of the genres worst.Time and Eternity starts off strong enough. When the adventure kicks off, players are treated to a hand-drawn, animated cutscene that radiates style and charm. From here, it looks like it will be smooth sailing for the rest of the endeavor. And in truth, if Time and Eternity wasnt a game, and were only a visual novel, it might have something to offer. Its story is quirky with some truly outrageous and lovable moments along with undeniably likable characters. That being said, the narrative starts off with our main heroine, Toki, the princess of Kamza, marrying her one true love, Zack. While disclosing their marriage vowels, the ceremony is attacked by an unknown group of assailants. In the barrage, our red-headed lady of royalty is attacked, but saved thanks to the gallant efforts of her husband-to-be. In the process of saving her, however, he is stabbed and on the brink of death. While taking his last breath, suddenly the area around him and our lady of light begins to warp and the two jump back in time. Now, six months before the wedding, Toki and her fiance must set out to find answers of who is behind the attack. There are a few caveats, however.For starters, our lovely groom is no longer human. His soul has been transplanted into the body of Tokis pet dragon, Drake. Initially, Drake/Zack cant talk, though we as the audience are privy to his thoughts and reactions to the debauchery that unfolds. Another thing is amiss in all of this, though: Tokis alter-ego, Towa, begins to show herself. See, there are two souls trapped inside our lovely princesss body: one is Toki, the crimson-haired damsel who is a shy and humble little thing, while the other, Towa, is a blond bombshell with an attitude and propensity for violence. This ultimately sets the stage for a wacky combination of a half-crazy princess and a talking dragon. The duo undoubtedly has some fun chemistry and interactions throughout the game, but that doesnt mean the tale is a hit. The plot at large is fairly predictable and simply lame at times, riddled with nonsense and parts that feel extraneous to the core story, thrown in just to make the adventure longer. Thankfully most of the games script is fully voice-acted, making for an enjoyable experience merely as a result of the quality of voice acting  though even it is inconsistent depending on the character in question.This all sort of puts the game in a weird spot. Because its story isnt very strong, one would assume the meat of its experience is found in some kind of stellar gameplay. Well, were here to tell you that said gameplay rests somewhere between broken and trash. It all begins innocently enough, with players given limited options as to what to do. We emphasize that limited part due to the fact that the game is quite linear by design, so much so that town exploration isnt really a thing in Time and Eternity considering it all unfolds by just placing ones cursor over a certain part of the town, clicking a button and watching a dot traverse the map before plopping players out into a scene that supposedly takes place in whatever part of the city they chose. This whole system holistically feels constricting and makes for an experience thats devoid of any kind of autonomy.But when folks arent exploring towns, they are off taking quests. These segments come in the form of story missions and the obligatory side-quest. The bonus missions offer very little in the way of fleshing out the characters of TEs world, so they really only serve as loosely-narrated grind-fests. Then there are the story quests themselves which will take players to a variety of locales across the games world. While this should in theory be the best part of the game, its simply not because enemy and location assets are used over and over again. Seriously, within the first few hours of the game, players will see bland set piece after bland set piece and forced to fight the same handful of monsters in a repetitious way that mere words could never fully describe. This is one of Time and Eternitys most appalling drawbacks: throughout its 15-20 hour adventure, it will throw the same enemies at players constantly but with just a different color scheme, as if we arent supposed to be able to distinguish between the fluorescent orange, snarling beast fighting us now from the same one we fought two hours prior, who just so happened to be blue instead of apricot-colored. The same goes for the locations in the game; players will walk through a number of forests that all bear a striking resemblance to one another. This is at best, just sheer laziness on the part of developer Imageepoch, and at worst, insulting the players intelligence.Then theres the combat to discuss. This is probably the most disappointing aspect of the experience. At its center, and in theory, TEs battling system is awesome. In practice, its garbage. So the game heavily relies upon understanding enemy weaknesses and exploiting them with powerful ranged, melee or magic attacks. That part is fine, and even well-integrated. Its during battle that things go awry. During combat, assailants will rush players. At these moments, the combat will go into melee portions that require good use of dodging, which can be performed by pressing left or right on the analog stick. This mechanic is the most promising part of the whole ordeal, as when everything goes off the way its meant to, the combat becomes a game of timing and a clever ability to memorize and then recognize enemy patterns in order to know when dodging would be beneficial. Suffice to say, this part is extremely fun, and in truth, the whole of it is a good time when the technical limitations dont flare up  too bad they do, and they do often.See, theres heinous lag throughout the entire game, but particularly so during combat scenarios. This makes for awful input lag. And as a game that relies on the player making quick maneuvers, having to fight the actual enemy and lag is a dastardly tag team that makes things unnecessarily difficult. Consequently, anything good about the battling is null and void as nearly 75 percent of the time youll fight lag in these situations. Its alarming, then, that so much of the gameplay is relegated to these encounters. Seriously, this game takes grinding to a whole new height. Fortunately theres a reward for slaying baddies, and thats using the games Gifts system, a mechanic akin to the sphere grid of Final Fantasy X. Its not hugely robust, but it offers enough options to customize ones playing style, and make the grinding almost seem like not such a miserable experience.But the technical flaws dont just end with the battling  there are moments of audio dropout and unstable framerates galore. Theres also animation issues, such as Tokis running thats only few frames long in nature, making for a looping animation that genuinely looks so miserable that I felt embarrassed for the games developers. Too bad players will run a lot, thus be subjected to this horrid stuff. Of course, because Time and Eternity wants to make it feel like players are playing an anime, they put beautiful (when not in motion, mind you) sprites against 3D backdrops. Yet again, great idea on paper, dreadful when implemented: when the two come together and interact, they look horrendous to the point of wondering if anyone ever even looked at the game before shipping it out. But, hey, if the game does have a redeeming quality, its the soundtrack. From the masterful mind of composer Yuzo Koshiro (Shenmue, Etrian Odyssey, Kid Icarus: Uprising), the tunes here are really quite wonderful  upbeat anthems rock out during combat and light-hearted fluffiness sets the mood for the games few touching scenes. Its a disappointment, though, that Yuzos work has to be marred by everything else wrong with the game.Closing Comments:", "date": "July 11, 2013", "grade": 1.5}