{"name": "Rogue Legacy", "ref": "https://hardcoregamer.com/?post_type=post&p=47667", "text": "There is something seriously wrong with the family in Rogue Legacy. Ive killed over 300 of its descendants and still they offer up their best and strongest to face off against the castle, and theyve got to have figured out by now its going to end with a dead body and a portrait on the wall. Each generation is a little bit stronger, with better weaponry and armor to go with the upgraded stats, but eventually a monster, trap, or boss fight is going to annihilate the current unlucky fighter. But still they keep coming.Rogue Legacy is easily one of the best action platformers of the last several years. A family is determined to conquer an ever-changing castle and eliminate the evil within, and the experience from every failed attempt can be used to permanently upgrade your descendants so the next generation has a better chance at survival. The only reliable thing in the castle is the entryway, which features a giant door thats locked by the crests of the four bosses found somewhere in each area of the castle. The problem is that, because the room layout is randomized each time, you cant memorize the route. Monsters are randomized too, so a room with a few simple baddies in one game might be loaded for bear the next. All the randomization is within reasonable parameters, thankfully, so youll never get stuck in an impossible situation, but its still smart to be prepared for anything once you move on to the next room.As you fight through the castle, killing monsters, breaking furniture, and popping open chests, youll accumulate a fair amount of gold. Gold is actually Rogue Legacys experience, used to buy stat upgrades and all the other goodies that allow the descendants of the initial Level 1 fighter to become a near-unstoppable death machine. Initially the only items available are health and magic, but once you start spending gold the house in the background of the level-up screen starts sprouting new wings and additions that contain all sorts of new features. Character classes and NPC shopkeepers are one-time purchases, expensive and worth every penny, while stat upgrades can have dozens of levels available for purchase. Each time an upgrade is bought everything else on the screen gets a bit pricier, because the players level goes up as well and the castle gets a little bit harder to compensate. A harder castle has more and tougher monsters, and its chests drop more gold, leading to a fantastically-balanced upgrade treadmill that makes it very difficult to resist chasing after every single coin you can grab.There are three NPCs available in the upgrade shop, the most normal of which is the blacksmith. He sells new swords and armor, but youll need to find the blueprints that show up randomly in the castles chests. The Enchantress is a bit more complicated, though, because she sells runes that give new abilities like a double-jump, dash, limited flight, magic and/or life leech, and other perks. Each of the five piece of equipment can hold one rune, and you can mix abilities to your hearts content. Want a sextuple-jump at the expense of all other abilities? Once youve found the runes in the dungeons fairy chests youre free to have it, although its probably not a great use of resources. There is a small problem in getting the runes, though, and thats that the fairy chests require certain conditions to be met to unlock. No jumping, for example, or take no damage. The requirement of killing all enemies in a room isnt so hard when the layout is wide open, but some rooms require a specific spell to target enemies shielded behind the walls. Getting all the runes necessary to set up your hero with the proper mix of abilities takes a while, but feels great when finally accomplished.The last NPC is the Architect, and while he doesnt sell anything hes as useful in his way as the other two. The Architect can lock down the castle in exchange for a percentage of all gold found, preserving the most recent layout and everything in it. Any chests previously found will be opened, but any failed fairy chests get a second chance to unlock. More importantly, the map and all its teleporters are available from the second you walk in the front door, which is practically required to practice boss fights. Theres a world of tough monsters between front door and boss rooms, and re-exploring the castle while desperately trying to keep your health up would be maddening. Picking from one of the three characters available at the start of the next generation, tweaking equipment and runes, and teleporting straight there with full health is absolutely worth the lesser payout, assuming the boss fight doesnt stomp you flat.It probably will, the first few times. Choosing the right character for the job can be tricky, especially with the randomization in terms of character class and secondary traits. The incredibly high hitpoints and decent attack strength of the Barbarian King/Queen, or the well-balanced Paladin, arent always available. Sometime youll need to make to with the weak stats but enhanced critical attack of the Assassin, or play as defensively as possible with the Archmage. It can be a tough choice, and the addition of traits doesnt make it any easier. A hyperoided mage whose hits send enemies flying can be pretty useful, giving you the space to throw out some spells, but a Spellsword with OCD, which awards magic for every piece of furniture broken, is also handy. Some traits are obvious in their effects while others can take a while to figure out, and they come in varying degrees of usefulness as well. Youll rarely play the same hero twice, and figuring out how to make use of whos available is a major part of progressing.Eventually, though, the final boss will fall, at which point Legacy+ opens up. Same randomized castle, all new ultra-brutal difficulty. Its not as balanced as the first play-through, seeing as certain character classes are utterly useless for it, but your stats will be nowhere near maxed out after the first encounter with the final boss so its nice to have something to spend all that gold on. The surprising thing about Rogue Legacy is that, even after all the effort put in to completing the first play-through, its just as much fun if not moreso the second time around. Bigger, tougher enemies will easily take you apart, but the hours of experience learning the characters and traits make make the expert challenge of Legacy+ nearly irresistible. The enhanced gold payoff for accelerated leveling up is pretty satisfying too.Closing Comments:", "date": "July 11, 2013", "grade": 4.5}