{"name": "Super Monkey Ball Banana Mania", "ref": "https://hardcoregamer.com/?post_type=post&p=411582", "text": "The crazy cast of monkeys trapped in their transparent balls came back in a triumphant revival in Super Monkey Ball Banana Blitz. At the time this generally received a mixed reception from fans, but it was nice to see the series gain attention and it was nice to jump back into more Monkey Ball. Then came the big one, the announcement of Super Monkey Ball Banana Mania, a walk down memory lane to the first two GameCube titles that started it all and made the series as popular as it was.Story in Monkey Ball takes a back seat in favor of gameplay, but theres still lore going on that players might enjoy because its a simple, yet effective and adorable way to set up the crazy premise that all the characters will be going through. It revolves around AiAi and his many friends enjoying an everyday activity, when the nefarious Dr. Bad-Boon threatens their livelihood by whisking away all the bananas for himself. Not wanting to give into his threats, AiAi and his friends set off to challenge various levels and stages that await them in order to claim the bananas that belong to everyone, and put an end to his evil plot before its too late.Once AiAi or one of his friends jump into their first stage is where the fun begins. Monkey Ball has a wonderfully-unique play style that makes it so darn endearing. Tilting a direction on the control stick leads the character trapped in a ball to also lean that direction. At first this is a simple mechanic, letting them traverse pathways to reach the goal at the end and collect any bananas they wish along the way. As it progresses though things get significantly more challenging with ramps that require a lot of built up momentum to stay on or bumpers that will bounce them off if going too fast. The best part is many stages have many ways they could be solved based on each players own skill and understanding of the controls. Many maps offer multiple paths that can be taken with the riskier ones offering higher rewards, while the safer ones tend to be slower but better for first timers. Outside of story mode, theres a good variety of side activities players can take on alone, against AI challenges or locally with friends and family. Thats the Party Games mode where a variety of mini-games such as bowling, golf, fighting, racing and more can be found. These are mostly a distraction from the main story, but offer cool ways to use different mechanics to take on new challenges. Alone these are more like a high score task, but when playing with other people they create absolute chaos in the best kind of way. Some of the controls for certain ones can take getting used to, but each one is explained before it starts so thats the best time to try and familiarize yourself before it finally begins. These are also unlocked right from the beginning, unlike many others which require a new type of point system to purchase special modes, skins and more.Earning points to spend in the shop isnt difficult, as nearly everything rewards them in some way or another. The most simple can be completing a level in story mode as it rewards for completion, banana collected, speed and a few other elements. The second is missions which offer harder challenges in order to earn much larger amounts of points. The point shop is where these can all be spent on addition characters, cosmetics and of course the new special modes. Characters vary in cost, but offer players a chance to take on their favorite of the bunch. Cosmetics are also cheap, although the downside is only the main cast of monkeys is capable of being customized so keep in mind no one else is able to wear the unique clothing. Theres also borders, emotions and color changes that can be used in photo mode for those wanting to take unique snappy moments of a victory or perhaps a painful loss.After purchasing any of the special modes from the point shop, theyre available to play at any point. These are by far the most difficult challenges, but some offer rewards for completion for those willing to take on the fierce challenges that stand before them. These are also where players can enjoy the maps from the original Super Monkey Ball, as the main story covers the second in its entirety instead. Two of the standout stages in special mode are dark and golden banana. Dark banana requires players to touch no bananas while trying to make their way through a stage, with golden asking that every single one be collected. These are fantastic challenges that are polar opposites and make the player pay attention more so than just steamrolling through a stage. Reverse mode is also brilliantly fun and unique as it has players going through stages the reverse direction just to mix things up.The visuals are drop-dead gorgeous in this remake and make the characters and stages a surprising delight to look at even when theyre more linear built. Theres an entirely new soundtrack for stages that may cause those who have listened a lot to the original to pause, but its an delight on the ears the entire time especially the brand new menu theme which is so catchy its almost alarming. It is, however, a shame that the original soundtracks are locked behind paid DLC instead of just another unlockable that anyone is able to obtain. The framerate is smooth as one would hope, although the load times can occasionally feel long when going in and out of stages. For the tougher stages that have players falling off a lot it would also be nice if there was a faster way to reset, but its still relatively quick all things considered. A huge change is the ability to skip stages at the cost of some points. This counts them as technically cleared, but with a silver icon instead of gold, and allows players to progress without being stuck on a stage. This is a genuinely nice way to allow players to keep from getting stuck or frustrated at the cost of a currency that isnt too hard to build up. Accessibility options like these are welcome, especially when Monkey Ball starts to get difficult, or for those who just struggle on that one stage that wont let up.Closing Comments: Super Monkey Ball Banana Mania is way too much fun. Its painfully hard to stop at any point, even when it comes to the more difficult stages. The satisfaction from completing a stage is something thats hard to perfectly replicate in any other title out there. Great new accessibility options allow it to be more easily played for any type of person and those who want to master the mechanics will be able to take on stages like no one else. It couldnt be tested at length for the review, but there are of course online leaderboards and time trials for those wanting to compete to be the fastest monkey around. Anyone who has played these Monkey Ball titles before will be satisfied with this new available version. Those who have never touched the series before and are looking for a challenging physics-based platforming adventure should try out Super Monkey Ball Banana Mania.", "date": "September 29, 2021", "grade": 4.0}