{"name": "Scourge: Outbreak", "ref": "https://hardcoregamer.com/?post_type=post&p=47128", "text": "The phrase imitation is the best form of flattery often gets thrown around whenever there happens to be knock-offs or copycats within distance, but what happens when those imitations exceed a bit beyond whats expected? The developers at Tragnarion Studios may have an answer for that with their recently released futuristic shooter, Scourge: Outbreak.Playing as one of the four teammates of Echo Squad, gamers will be thrown face first into enemy territory with the objective of extracting Ambrosia energy source from an evil entity known as the Nogari Corporation. Compounded with the issue of receiving a blindsided attack from now former teammates of the Alpha Squad, the objective becomes even more critical. In addition to the Campaign Modes main plotline, Echo Squad members Stonewall, Amp, Mass and Shade all have backstories and secrets to unveil. The entire story and method used to uncover it isnt groundbreaking, but does provide some sense of reason for playing.The game doesnt sugar coat its immediately noticeable shortcomings and gamers wont have to wait long to find thatyestheres a plethora of similarities between this 4-player co-op adventure and nearly every other shooting game that has been released. Scourge takes a lot of gameplay tips from Binary Domain and the Gears of War series, with its aesthetic attributing to slight resemblance to Crysis and Dead Space. Overall, the melting pot has a few sweet and sour spots.Even with the Unreal Engine, the game mechanics are extremely clunky once youre toe deep into the game. Even after rousing around through the tutorial mode, small movements such as sprinting, dodging and hiding behind cover still pose a problem and its partially due to how all are regulated by only one button. In order to dodge and run from oncoming fire, players will be forced to switch from tapping to holding down A, but the result of these inputs can be very frustratinginstead of sprinting from one place to another, youll often find an Echo Squad teammate doing a forward roll instead. Taking cover, which is also ran by the same button, is a hassle too. At times when youre trying to shield yourself away from fire, youll often pop out of place and there are times where running alongside the walls while in sprinting can land you up against the wall in cover position. The fight between the two disrupts the games flow and accessibility.Aside from the small nitpicks of moving around, the actual combat and the skill level system in the game are implemented perfectly well. With shotguns, sniper rifles, semi-automatics and machine guns appearing at every corner, the hip fire and zoom in shooting for all of these weapons feel genuine despite the subpar sounds of fired shots. Automatic lock-on when switching between targets are seamless and the fact that the game allows you to turn friendly fire on or off is a welcome idea to heighten the difficulty of gameplay.Depending on the conditions met, players can unlock new skill levels for all these guns, alongside skill levels for themselves. Leveling up a certain skill of a character is rewarded with a few perks that can be used to get the upper hand while out in combat. You upped your Barricuda shotgun to level 5? Have more rounds! Shade just reached passed another level? Longer life!This third person shooter also implements a follow the leader system, similar to the one that Binary Domain and other games have used. While its a neat looking feature on paper, players will find that other Echo Squad members will seldom follow through with your orders during the heavy heat of combat. Assigning a team member to do anything at all is useless as members will reply with an enthusiastic Okay followed by remaining stationary while staring at you. Throughout the game, your team will operate on their terms and shoot at their own pace. Ordering them to do so will just make acquiring the target take much longer than needed.What is odd about the leader system is that your teammates will still care about you enough to heal you from being in a downed stateand theyre quite quick about it. Even on normal, some of the AI in the game can be unforgiving at times, and when a players Echo member is down and out, their time will usually be spent praying that the AI of other team member will come to their rescue. 99 percent of the time, this usually happens. However, itll be much harder to obtain that attention during boss battles.Aside from mouths not matching in-game dialogue, the character models themselves are pretty well done. Theyre not on the level of some of the major game titles within the genre, but its paramount to note that underneath the obvious ripoff of Crysis, Mass, Amp, Shade and Stonewall emit a really futuristic, yet badass look about them. The maps and stages throughout the game get some decent shine as well. Its evident that the developers took a little time to make the planet of Nagori a captivating one and it has that aspect attributed to some easy-on-the-eyes textures and overall brightness in-game. The creepy, crawly alien and soldier enemies could have taken a few hints from the Echo Squad, but unfortunately havent. While they certainly pop out at you with the intent to kill, their entire attire is lacking. The color and sleekness that were reinforced in the main characters doesnt seem to translate too well in the enemies that they face.The major downside about the game is the lack of community behind it. There seems to be a trend going on for arcade titles that are released this late in the generation to seldom receive people who desire to play the game online. Its a shame to see such a decent shooting game harbor a small amount of players gearing for the deathmatch, team deathmatch and capture the flag modes. Either that or the servers behind this title are pure dog poop. There is still the option to assess the local 4-payer co-op mode, but all of that seems like more of the same content that you receive when playing through the Campaign mode alone. It would have helped to see some extra challenges or stages implemented for groups who want to conquer the Nagari Corporation together.Closing Comments:", "date": "July 6, 2013", "grade": 3.0}