{"name": "Motorbike", "ref": "https://hardcoregamer.com/?post_type=post&p=46040", "text": "Trials HD hit XBLA years ago and took console gamers by surprise with its blend of Excitebike and precision platforming. The games rider and bike physics also raised the bar, and its extra modes added a ton of content to go through. The sequel improved on that with a user-generated content system so rich that you could play an FPS crafted by someone, or even a game of foosball. Earlier this year, Urban Trial Freestyle hit the PS3 and Vita and gave those without a 360 a chance to see what the fuss was about with the Trials series. While it replicated the gameplay well, it suffered from a lack of analog buttons on the Vita, and feeling like a blatant copycat product on each platform, and didnt do much to help differentiate it from its inspiration outside of some unique course locations. Now, months after that, Motorbike is out to further fill that void and falls a bit short in some major areas.The yellow and black-heavy menus get things off to a bad start as their caution tape appearance seems bland, and that feeling is driven home when you notice the lack of an actual background  everything is set against pure black. Then you get onto a track and things fare quite a bit betteruntil you get the urge to check out a different one. The core mechanics are a lot like Trials, with careful throttling of the accelerator and brake combining with your bike and riders position allowing you to navigate the obstacles placed before you on each track.When those mechanics are executed flawlessly, you get a game like Trials that has a bit of a learning curve to it, but can be figured out through trial and error. You start to learn the subtle movements and pay attention to just how hard to accelerate, brake, go backwards quickly, and do mid-air spins. Pat of that is due to the rider having a sense of weight  something that always feels a bit off here. Sure, theyll move around, but those movements rarely look very natural and lack the fluidity in Trials that helped you judge your positioning. The crashes arent even very spectacular, and not even sending your rider hurdling towards either the sky or some kind of hard object brings about a visceral joy due to how lifeless it feels.The controls have a tendency to feel too sensitive as well, which means that a fairly small tap can send you into a fairly major direction when you just wanted to tilt slightly. The feeling of control over your bike and rider present in Trials and even UTF is absent here. It makes playing the game needlessly frustrating, and if you get to a point where youd like to change tracks, its tricky to do so. Theres no main menu option, but the settings lets you change tracks between the in-game default ones, their variants, and make use of online-only tracks placed there by the devs and other players. Even at this early stage, there are dozens of extra tracks and theyre usually quite challenging. The toolset to craft them isnt the most user-friendly, but can clearly used to make good stuff in the right hands.That particular feature is one thing this game has going for it that no other game like it has. Its a theoretically simple change, but does manage to give each track a different feel every time you go through it. It also comes in handy to hide muddy-looking textures, such as a rock formation-heavy area that looks quite awful during the day. However, at night, with just lamp posts to show you the way, all of the bad texture work is hidden and it leaves you with a rather stunning sky backdrop that is full of color and a striking light/dark mash-up that catches your eye.Moments like those are definitely the visual highlight of the game and help make up for Motorbikes other visual shortcomings. When things arent obscured by lighting effects, you can really see the flaws in the environments and character models. On the rider select screen, its impossible to not see how low-end the character models are. The bikes look decent enough though  not mind-blowing, but certainly okay. Muddy textures litter most environments are a huge eyesore and bring things down to about a mid-range phones level. Fortunately, any areas that are full of metal you can ride on, like pipe or steel, have a nice shine to them and look quite good. The forest stages also look fine, but dont quite match up to the greatness of metal-heavy areas.Many aspects of the game are a mixed bag, except for the music  it is absolutely terrible. Its just a lot of loud, obnoxious rock music that might as well be from a band called Random Noise. Thankfully, you can turn it off and make a custom soundtrack and ride to whatever music you so desire. Strangely enough, the Flower soundtrack fit the game fairly well since its so relaxing and makes it easier to focus on the tougher courses. For basic courses, harder stuff from Kid Rock or Metallica work just fine. The sound effects are fairly good, with the rider screams sounding painful and crunches sounding okay, but not quite as bone-crunching as Trials. There, it seemed like every crash shattered at least a dozen bones. Here, its a bit more subdued and most crashes sound like something you could at least hobble away from.Closing Comments:", "date": "June 26, 2013", "grade": 2.0}