{"name": "Fist Puncher", "ref": "https://hardcoregamer.com/?post_type=post&p=44989", "text": "Adult Swim Games has carved a niche for themselves using a well-known brand name to give retro-themed indie games a chance to shine. This Kickstarter-backed brawler comes to us from team2bit and brings River City Ransom-style gameplay to the PC. If youre a console-centric gamer and loved that or the Scott Pilgrim vs. the World game a few years ago that was heavily influenced by it, youll love this. As one of 15 possible characters, youll go through a bunch of stages killing baddies, finding keys, and even doing some motorcycle combat to save a bunch of international cuties  those are the in-game mayors words, not mine. Hes a horny old man who wants the group of upskirt-providing beauty pageant contestants back and its your job to get them.Each character plays a bit differently, but since these kinds of games are pure testosterone, I initially enjoyed playing as Steroid Jackson. Hes an ex-baseball player who was banned forsomethingand now hes out to stop crime. Then I got tired of the dudebro-ness of his character and switched to the disgraced cop you fight early on and unlock. He sees the error of his ways and decides to turn his taser on those who deserve it  hottie thieves. The core gameplay is the same as pretty much every beat-em-up for 20 years, only with more characters to help keep things feeling somewhat fresh.Some have longer-range attacks, while others are great with throwing enemies around. Theres a different enough feel to them to where they dont just feel like re-skins and that adds a lot of replay value to it beyond the fun of playing as a scrubs-clad Chuck Norris or an ex-cop with an unfriendly disposition and a lust for tasing dudes. Fist Puncher exceeds expectations when it comes to mission variety, as youve got interesting variations on the core gameplay  like beating a level without hitting a lawyer while they litter the screen, or having to protect an aging librarian from a group of baddies on a train. Bomb defusing is another sub-mission, and theres even a motorcycle racing area that has you ram over folks off the road. For a retro-style game in an old genre, it would be easy to just stick with conventions, but team2bit went above and beyond by offering up so much variety.Fist Punchers 360 controller setup is logical and easy to use. Jumping and both punching and kicking are responsive, while side-to-side movement is a breeze and can be sped up with double-tap running and right stick rolling. Where navigation falls apart is when youre trying to move up or down the screen, as that movement always feels really jerky. Its almost to the point of being unresponsive, and is easily the games biggest downfall. Due to it, youll take some needless damage and probably die more than a few times in big boss battles.Big boss battles are meant literally here, by the way. You will face absolutely enormous foes and the difference between you and them, and even their henchmen compared to them is astounding. They fill the screen and while enemies like that are expected for a shoot-em-up, you dont usually have such gargantuan enemies in this kind of game  its refreshing and each one actually requires a different strategy to beat. An early boss is largely unharmed by physical attacks, so youll need to use things like trash bags and garbage cans from the surrounding area to beat him. The bosses are challenging, but rewarding to beat and will have you quite thankful that a stat-boosting system is in the game.Like RCR and Scott Pilgrim, theres a stat system for health and strength, but its based on leveling up like an RPG instead of just buying items. There are still item drops from enemies though, and you can use some of your upgrades to increase them  something youll want to do if youve got a boss battle that stumps you. Other than the issues with going up and down in the world, Fist Puncher is a very fun beat-em-up and grinding with numerous characters is actually somewhat fun since the large cast of characters plays so differently. Trying out a few characters before settling down to a favorite takes some time, but lets you learn the games mechanics and get used to the leveling up system in the process.The games sense of humor may take some getting used to as well. There arent really a ton of jokes present, but if youre a fan of picking apart gaming tropes or games that do that for you, youll enjoy this. Its also a must-play for fans of absurdist humor, who will at least get a few laughs out of fighting a giant Absolutely Not Mr. T character. And then theres the nude beach level  complete with crotch-covering baddies with Jersey Shore-level spray tans. The absurd visuals that bombard the screen work in the games favor though, as it winds up delivering a solid retro look with the blockiness of an 8-bit game mixed with a richer 16-bit color palette. The animation is somewhat limited, but is still smooth enough to look good without looking so slick that it betrays the retro vibe theyre going for.Character design for the playable cast is pretty awesome and revels in absurdity whenever possible. Fans of the Chuck Norris meme from years ago will love Doctor Karate, while The Beekeeper plays to lovers of the bizarre. The strange character roster didnt remind me of any RPGs, but instead of 3D Dot Game Heroes, which let you go through a classic Zelda-style game as a freaking dragon or even Santa by default. Some form of character creation tool wouldve been nice here, but the game doesnt feel any less complete without that functionality.The soundtrack falls a bit short of what fans of the genre might expect, as Streets of Rage had incredible music that has held up well, and Scott Pilgrims OST was full of amazing tunes. Fist Puncher has a few standout songs, like a crazy country-Western song for the biker bar that would also work for a modern club as well, but a lot of the music is instantly forgettable. The sound effects are far more impressive than the music. Weapon shots sound brutal and punches have that 16-bit style oomph to them where they strike a balance between realistic and cartoonish.Closing Comments:", "date": "June 20, 2013", "grade": 3.5}