{"name": "Class of Heroes 2", "ref": "https://hardcoregamer.com/?post_type=post&p=42942", "text": "Class of Heroes 2 is the sequel to the 2009 PSP dungeon-crawler that was best compared to the likes of Etrian Odyssey. With that juxtaposition still firmly in place here with this entry, its easy to see where Class of Heroes 2 draws its inspiration. But make no mistake, while its mechanics may mirror those found in like-games such as Etrian Odyssey, Unchained Blades or even the old-school fan favorite, Shining the Holy Ark, this is a game that manages to stand on its own two feet. Its also a title that employs one of the steepest difficulty curves around, making it a truly challenging, yet wholly rewarding experience for any gamer willing to put in the time, energy and tears needed to make it out of this JRPG alive.Class of Heroes 2 is, in truth, the epitome of JRPG. What this means for MonkeyPaw and Gainjinworks partnership endeavor is that the game is thick with all the traditions, conventions and, for better or worse, stereotypes that weve come to expect from this sub-genre of roleplaying games. Oh, and on top of that, its also a title that is hard as hell  but more on that later. The journey starts off unsuspecting enough, though. Players are introduced to the games primary setting, which in this case is a boarding school by the name of Crostini Academy. Its here that were told of the institutions primary purpose: to prepare would-be adventurers for actual, well, adventure. After a fun primer to the games school and its lead NPCs, players are just dropped into the adventure without any sort of linearity or direction. This decision could have been overwhelming, but in fact, the game is laid out so well, that just a bit of poking around starts opening doors to the point that, before folks know it, they will be five quests deep and slashing away at baddies. Prior to jumping into combat, however, its important to note that players are given the option to totally customize their heroes and heroines. They can recruit any of the six default personalities that are given to the player without fee, but then they are able to create their own, which is where the joy truly begins.These warriors can be tailored to the gamers individual style, allowing them to choose a characters name, gender, race, alignment and stats. The statistics are totally customizable, meaning that folks will distribute points to eight key areas; and how these points are allocated ultimately decides what kind of class is assigned to that character. Its too bad that classes are somewhat race dependent, which detracts from the customization a bit, as its not possible to make entirely the exact character desired. Although, it might not be an awful thing to not have the opportunity to create the ideal character, for getting attached to ones party is a bit of a double-edged sword.Its great to level up an arrangement of solid heroes, and its even more fulfilling to develop the adventurers in whatever way the player sees fit. Its unfortunate, then, that perma-death is a thing in Class of Heroes 2. Thats right, while the game makes some serious strides in being a more accessible installment than the original title, the fact that when a character dies, theyre gone for good, is a scary, scary consequence. This feature will surely entice the most devout fans out there, but for the casual audience this could be too much. Its rough to put in so much time to growing a character, only to have them cut down by one of the many merciless enemies that will waylay folks at every turn. Had there been an option to turn this feature on or off, a la Fire Emblem: Awakening, it would have made the game far more approachable for some. Despite whether this turns players away, or entices them, its nigh impossible to deny the sheer amount of satisfaction derived from toppling some of the games toughest adversaries. The sense of victory in Class of Heroes 2 is unlike most others because of how much work and strategy is needed to walk out of a fight with ones pride, and better yet, life.Nevertheless, once its been decided which characters will be taken on the road, its off to take on quests and explore enormous labyrinths  and this is where the fun begins. Ultimately, dungeon diving in the first-person perspective will be the majority of the games experience. So theres the promise of searching every nook and cranny of one of the games many, many dungeons in hopes of treasure and danger, in addition to actual combat. For returning players, know that dungeons are not randomized this time around, cutting out a piece of that rogue-like pie. Outside of that, the games core elements go off just as they did before. So when traversing these dungeons, random fights will break out.Here, players will use their six character party to lay the smackdown. With the diversity in classes  there are almost 20 of them  battles play out in a different way depending on the party composition. Thus, knowing each class strengths and weaknesses will be critical in understanding the combat tactics at play in every battle, ranging from the most seemingly insignificant to the largest of bosses. Regardless of the foe, though, and trust us when we say theres a horde of enemy types, battles play out in a turn-based fashion. While this may not sit well with more action-oriented gamers, the combat is well-balanced and fluid, making each foray an exciting duel. This is made all the more compelling due to the notion that each fight could very well be the players last. Thats true tension, right there.So let it be made FULLY aware: Class of Heroes 2 is tough as nails. Seriously, this game, and everything it throws at players, is unafraid to incite tears and full-on feelings of rage, occasionally even tempting the most patient gamers to toss their portable across the room. Now, for folks coming from the first title, the difficulty will not feel as cut-throat, but everyone else should adjust their expectations to simply assume that your ass will be handed to you on more than one occasion. Thankfully, however, whenever players get vanquished, its usually not because the game is unfair. It merely means its time to grind more.Like most other JRPGs, Class of Heroes 2 is a grind-heavy experience. In fact, grinding is pretty much the bulk of the adventure. Yes, theres a storyline that involves becoming the most illustrious troupe of adventures in the land, but really, the flimsy plot takes an obvious backseat to the front-and-center gameplay. But when items arent being sought out and baddies arent being trounced, there are chances to partake in the academys specific festivities. Between visiting towns and investigating the nearest dungeon, theres plenty to do around school. Theres the buying, selling and dispelling of items, on top of crafting, character interactions and so much more. These segments serve to break up the seemingly constant fighting well, and are a welcome change up.In essence, Class of Heroes 2 is ripe with features and tasks to undertake. In truth, theres a lot to do here. And fortunately, the sights and sounds along this lengthy journey only serve to make the whole ordeal more enjoyable. Characters are given life with wonderful sprite work and environments are drawn to imagination. Regrettably, the resolution of the game appears slightly off, making for some fuzzy portraits, backgrounds and menus. This issue seems out of place when taking into consideration the overall level of polish throughout the rest of game and is offset by the soundtrack that doles out bouncy jams and pulsating rock anthems. And a quick point to make about the teams effort in bringing this title to North America: the localization here is spot-on. Its well-written, witty and just all-around solid.Closing Comments:", "date": "June 5, 2013", "grade": 4.0}