{"name": "The Night of the Rabbit", "ref": "https://hardcoregamer.com/?post_type=post&p=42134", "text": "Im sure that most people have at one point, if not quite often, dreamed about being transported to a fantasy world and interacting with abnormal inhabitants. The Night of the Rabbit will fulfill that wish, at least for little Jerry Hazelnut as his dream of being a famed magician is finally coming to life. Its time to leave everything behind and pull that rabbit out of your hat to start this magical adventure into the unknown.If youve played an adventure game before, or more specifically a Daedalic title, then this will most likely feel very familiar. This is a slow and methodical experience that will take time, patience and skill to get through. Each action has been properly adapted to the mouse so playing the game one-handed is completely acceptable and accessible, not to mention making things a lot easier. The goal is to solve puzzles by combining specific items with something in the environment, and by doing so, Jerry will unlock new sections of the world and additional quests to go on. This is a traditional point-and-click adventure that doesnt go too far outside its comfort zone and has incredibly simplistic controls. Additionally, theres a ton of extras to be found, from stickers to collectible cards, testing how well your eyes really are.The story begins with our lead character going off to collect blackberries for his mother. After receiving a mystery letter that could prove useful in his ambitions to be a magician, young Jerry Hazelnut finds himself in a fantasy world filled with anthropomorphic mice, frogs, squirrels and so many other wildlife critters. The newly found land is magical and full of life, offering a wide cast of comical characters, each with their own unique personality and backstories. This is by far the games strongest point as the world has been finely crafted and is truly influential. Not only does the story have similar connections to something like Alice in Wonderland or The Secret of NIMH, but so does the overall atmosphere. It may be a bit lighter and more joyful than the two, especially NIMH, but you can see the similarities. Regardless, you rarely see games expressing and truly embracing the wild in such a different take.Theres a certain level beauty to The Night of the Rabbit that will just wow you. The hand drawn characters and environments are astonishing to say the least as it really brings the fantasy world to life. Animations are also well done, even though characters generally dont move too much other than simple talking and idle motions. Outside the graphics, the soundtrack is mesmerizing, offering some of the best orchestrated tracks I havent heard since a game such as Nier. Suffice to say, the presentation values are a pleasant treat for both your eyes and your ears and will go a long way on this adventure.As far as puzzle solving goes, The Night of the Rabbit has some strong elements, but at the same time, can be a bit confusing. There were multiple puzzles that had me scratching my head and banging on my mouse trying to understand what I was supposed to do next. There were items in my inventory I knew what they were going to be used for later on, but getting there felt like a struggle most of the time. There was never a sense of satisfaction after completing a complex puzzle, either; only disappointment in how it was overcome.At times, it does things intelligently by subtly throwing in hints, but the problem is that its hard to differentiate clues from mindless chatter. For example, you have to give Anja the Mouse a piece of paper thats credited to violin lessons so that she can get an annoying little kid to move. The problem here is that its done so discreetly by Hazelnut rhetorically asking himself why the brat doesnt have any hobbies, that I was left going around in circles, despite knowing who I was supposed to be interacting with. There were also times where the game doesnt really give a good reason to do things, such as tapping a giant beet and giving the juices to (once again) Anja. I would like to consider my puzzle solving abilities to be decent, especially considering I have got through many Daedalic Entertainment titles without much help before, but there were times I found myself struggling with what is needed to advance.Another significant issue is that the games lead hero isnt all that entertaining to play as. While the rest of the cast of characters is filled with witty and comical dialogue, most of Jerrys side of the conversation ends up being a bit dry and lacks laughter. You can tell they made him out to express rather direct humor, commenting on whats around him, but it ends up being rather boring. The character himself is done fairly well in the sense that hes a joyful young boy who loves adventure, so you cant discredit his performance too much, but when the hero of a story isnt all that enjoyable to listen to, then you have a serious issue.Closing Comments:", "date": "May 27, 2013", "grade": 3.5}