{"name": "Fuse", "ref": "https://hardcoregamer.com/?post_type=post&p=42132", "text": "Sony is being heralded as the savior of video games after a single bad Xbox press conference, while meanwhile people are critical of the new IP from the studio behind Ratchet & Clank and Resistance. Its quite possible the world did indeed end in December and weve slipped into some odd incomprehensible bizzaro purgatory. Theres really no other way to explain the chronically cold reception Fuse has been receiving, regardless of the glowing previews and solid demo. Instead of welcoming the chance to play in Insominiacs weapon-filled playground once more, many gamers (aka forum posters) have taken any opportunity they can to criticize whatever they can about Fuse. First its the lack of a cartoony aspect, then its the name change from Overstrike, then its that the game is not serious enough. No matter how many positive things are said about the game (including poor Ted Price seemingly doing interviews every waking moment of his life), it doesnt seem to make a difference. So before you disregard this review and drift off wishing for the days of Lombax and robots, lets state what the next twelve hundred words are going to try to finally convince you: Fuse is great. Fuse takes place in the non-so-distant future where a alien substance called Fuse (explaining the name) is discovered. While the original goal is to use the titular alien substance for good, more sinister minds catch wind of it and want to use it for less noble purposes (like the destruction of the world). Mega rogue paramilitary company Raven decide to steal it, so infiltrate the base where its being housed. To combat the situation, the government calls in a clandestine organization known as Overstrike 9 (explaining the original name), who soon becomes the last line of defense for humanity. The plot is interesting, though a bit sparse throughout, but it works as a way to propel the game forward and give rise to plenty of nice characterization amongst the four protagonists.Fuse is comprised of four core characters: Dalton Brooks, Jacob Kimble, Izzy Sinclair and Naya Deveraux. Each character has their own personality and specialties, both with weapons and inherent skills. More backstory is revealed as the game progresses, such as Nayas daddy issues and Daltons irrational fear of cats. Suffice to say, this isnt an overly-serious military shooter, but playful like the tone of the Mission: Impossible films. As interesting as each character is, their weapon is what makes them. Near the start, each character picks up a Fuse-enhanced weapon known as Xenotech that gives them other-wordly, Ratchet & Clank style, powers. Naya gets the Warp Rifle, Jacob picks the Arcshot, Izzy nabs the Shattergun and Dalton is left with the Magshield. The Arcshot fires high velocity bolts armed with mercury, the Magshield is a giant impenetrable shield that can make infrequent blasts, the Shattergun cryzlies enemies by nailing them with several rounds and the Warp Rifle fires antimatter that sucks enemies into wormholes. All weapons have their advantages and disadvantages, but my personal favorite was the Warp Rifle, both for its ease of use and devastating effects when used correctly. While its cool enough to simply see an enemy combatant sucked into nothingness, tagging multiple enemies with it and then killing one sets off a chain reaction that can suck multiple soldiers into oblivion. Being outnumbered and suddenly seeing a bunch of enemies panicking as they are removed from the world is quite a rewarding feeling that simply doesnt happen in other shooters.Of course, different people will find different aspects that speak to them with each weapon, which is certainly what I experienced in co-op. After thinking that Naya was the player everybody would want to jump to, I was surprised to find that many naturally went to the other players (although the two girls were seemingly the most popular). While none of the characters are drastically different besides Dalton, they play uniquely enough to make it worthwhile playing the game a few times on co-op to experience different styles of play. As his main gun is defensive, Dalton indeed offers gameplay quite separated from the rest. A good player using Dalton will focus his energy on using the Magshield to constantly protect other players, creating cover in otherwise dangerous situations. Granted, the Magshot does shoot off a blast, but its weak and infrequent enough that some may not even bother with it. As Dalton levels up, however, hell be able to deploy the Maghshield instead of constantly having to use it as his weapon. While this frees him up to use different guns, he still wont be able to eliminate baddies with a Xenotech weapon like the others. As such, players would be advised not to play as Dalton their first go-through to better experience the melee weapons  but once youve become a seasoned player, having a character intended for defense really helps promote teamwork and selflessness in a co-op game.While Dalton unlocks the ability to remotely deploy his Magshield, other characters unlock equally crucial skills in the Skill Tree. XP is earned by completing objectives, finding hidden Fuse packs and by killing enemies. Once a certain amount of XP is accrued per player, they gain a level. Gaining a level unlocks a skill point in the Skill Tree. Theres a multitude of things to unlock, ranging from health bonuses to upgraded grenades, but theres various plateaus reached that give players important secondary Fuse abilities. Naya gains the helpful ability to cloak, for instance, while Izzy gets a deployable Med Beacon that revives fallen teammates and heals them. These skills help define the roles of squad, with Dalton becoming the tank, Izzy the healer, Naya specializing in stealth and Jacob the wildcard (keep him away from vans full of gasoline). Theres also Fuse Credits scattered about that unlock team perks, with each team member allowed to have one activated. These include things like team-wide health bumps or increased ammo capacity. One thing that doesnt work well is the Stealth element. If youre thinking its odd that theres stealth in a game where theres a black hole gun and a boss the size of a high rise, youre not alone. When areas are first ventured into, enemy soldiers typically arent aware of your presence. Youre encouraged to exploit this by silently executing as many of them as you can. While in theory this isnt the worst idea, its execution is wholly inadequate. All the stealth element consists of is getting near an enemy and pressing the Y button if hes facing away from you. Theres no way to crouch, no way to tip toe and no silent weapons. Because of this, theres practically no way to take down more than a couple enemies before youre spotted. In a game so heavy on balls to the wall action, it simply feels tacked on.In addition to a campaign that takes players to multiple compounds  from under the sea to above the earth  theres a more combat-heavy mode called Echelon. Sort of like Horde mode in Gears of War, players face wave after wave of enemies in multiple rounds. Theres six different maps with twelve rounds in each. Every map has random elements including enemies, weaponry drops and more, with rounds growing more difficult as things progress. Round objectives consist of things like escorting a volatile container of Fuse, defeating multiple enemies, controlling a zone and more. Its all pretty basic stuff, but for experienced players who have completed the campaign multiple times and simply want to kill enemies with their teammates like a well oiled machine, it could be the mode that ends up reaping the most hours of hardcore players.Closing Comments:", "date": "May 27, 2013", "grade": 4.0}