{"name": "Kena: Bridge of Spirits", "ref": "https://hardcoregamer.com/?post_type=post&p=411645", "text": "In 2016, Ember Lab was a studio that just consisted of fourteen people releasing a Majoras Mask fan film known as Terrible Fate. Back then, they didnt know that their next project would become a key player in the reveal of the PlayStation 5, a nominee for the first Tribeca Games Award and arguably one of the years most anticipated games in general. Its impressive to see someone go from such humble beginnings to something mighty, but this may only be just the start as Ember Labs inaugural title, Kena: Bridge of Spirits, could easily serve as the beginning of what could be a legendary action/adventure franchise down the road.Our protagonist, Kena, is a Spirit Guide that helps free trapped, wandering spirits in order to help them pass on. And at the start of Bridge of Spirits, they come across the actual star of the game, the Rot. A group of unbelievably cute beings that help maintain balance, the two team up to help get behind the cause of some trapped spirits and mysterious growths in a village they come across. More than a few folks have already compared the presentations and setup to a Disney or Pixar film, and the main reason for that would likely be the stylish visuals, with Kena and the Rot being fluid and expressive, making sure the photo mode will get used often.If were being more specific, though, Bridge of Spirits probably has the most in common with the more recent Raya and the Last Dragon, thanks its heavy use of East Asian influences, from Balinese music to symbols inspired by Southeast Asian cultures and structures similar to Japanese Torii gates. The graphics in general are outright astounding, with lush greenery and detailed monster designs nearly everywhere, but its all of the little details and influence that help make Kenas world a promising one, including a heavy use of symbolic masks and the unique implications when it comes to how technology in this world operates. Of course, players shouldnt expect an entirely peaceful time when exploring this world, as Deadzones are abound. These are the main source of corruption plaguing the lands, being devoid of any life or activity due to an imbalance in nature, and filled instead with monsters. And while Bridge of Spirits may look lighthearted on the surface, its combat requires a good amount of skill to master, with enemies that require a successful blend of parries and dodges in order to avoid being killed, and a minimal amount of healing spots per Deadzone. Luckily, Kena has access to their trusty staff, an unlockable bow and bombs, a decent chunk of upgrades, and even the Rot that can bind enemies or gain a more powerful form on certain occasions, but the game will still put up a challenge, even with a larger arsenal of moves.While Bridge of Spirits is challenging, its still fair (save for some bosses that can deliver cheap hits due to annoyingly larger reaches), and the combat still comes across as satisfying and intense, with a nice variety of enemies to battle. Combat isnt the games only forte, though, as there are also a lot of Zelda-style environmental puzzles that are fun to figure out, and nifty platforming sections that can also be tricky yet enjoyable to maneuver, especially later ones that require the use of bombs and arrows in order to manipulate timed floating platforms.All in all, its the type of solid and satisfying gameplay that shows promise when it comes to more complex challenges in other adventures. Kenas world is ripe for adventure, but even as is, it still has a lot to hunt for, be it Spirit Mail to deliver to the main village hub, meditation spots that extend Kenas life bar, additional bits of Rot that can join your little party, and even hats that you equip each individual Rot you find with. A lot of these require a good amount of exploration and skill in order to find and can be a treat to find. Between its visuals, gameplay and open world filled with secrets, Kena: Bridge of Spirits seems a superb game. Youll notice that throughout this review, however, terms such as start, promising, jumping off point, etc have been used to describe the game. Thats because while Kena: Bridge of Spirits is still an incredibly good game in general and still worth checking out, therea no ignoring the fact that this still comes off as a first attempt. This may be a tribute to Zelda, but it still has trouble coming up with its own unique identity outside of a general action/adventure game. From the combat to the puzzles and platforming right down to the painted climbable ledges, everything here has been done somewhere else, even if its still done well. Even the Rot merely serve as a way to upgrade skills or an additional attack method. Well, that and justifying all of the currency found in the game, which can only be spent on the aforementioned hats for the little buggers. And while I do love seeing them in tiny hats, the numerous treasure pots and chests with nothing but currency feel like padding after a while.Maybe all of this could be elevated if Bridge of Spirits at least had a compelling story to leave players hooked until the very end, but that is not the case here. As mentioned before, Kena has a grand and interesting world, but our main heroine doesnt exactly have the most meaningful adventure in it. Its still a decent story, mind you, but one that feels basic and sparse. Kena just shows up to a deserted village one day as players are thrust in without any setup, they help free three spirits and uncover what happened to the village, and thats it.Theres some stuff about Kena dealing with the loss of their own father, and themes of death, balance, and acceptance, but it never makes any big impact. In contrast, Deaths Door covered much of the same ground earlier this year (down to the little forest critters that can follow you around) in a similar ten-to-twelve-hour-long length, but it made the most of its setting and characters. So yes, Bridge of Spirits may still be a good game in general, but it feels like its walking so that future entires can run. Closing Comments:While we might have to arguably wait for future games to unlock the series true potential, Kena: Bridge of Spirits is still a great first outing for Ember Lab. If the breathtaking visuals dont suck you in, then theres the satisfying and challenging combat as well, or the wide world to explore. Or maybe you just want to find all the teeny hats for the Rot in order to make them as ridiculously adorable as possible. Whatever the case, theres going to be something satisfying for everyone here in Kenas debut.", "date": "September 28, 2021", "grade": 4.0}