{"name": "DUST 514", "ref": "https://hardcoregamer.com/?post_type=post&p=41319", "text": "DUST 514 is a big game with big implications. For starters, its a companion piece to the outrageously successful MMORPG EVE Online, which has something of a hardcore, cult-like following at this point. Secondly, its a persistent online shooter that does quite a bit you havent seen before, or at least much of, in the FPS market on consoles. Third, its free to play. And fourth, it offers cross-connectivity that makes for a truly unrivaled experience for fans of both games and the EVE universe at large. But does all of this potential get overshadowed by technical hiccups?The most important aspect of DUST 514 is its connectivity with EVE Online. And like in EVE, its DUSTs community features that really matters here. In fact, its integral to the entire ordeal. Meaning to say, Corporations (guilds) in EVE can now host a 514 division which grants players on the PS3 side of the EVE universe the opportunity to fight for territory and resources that can then be used by the folks in the MMORPG counterpart. Its this cross-link that makes DUST feel important, especially if players are familiar with EVE and are in a corporation that is playing both games. Essentially, what happens in 514 ultimately affects what happens in, and how others experience, EVE, as battles in DUST can change the tide of war between clans in the MMO. This is a first for gaming, and something that needs to be taken note of and commended. Therefore, in this regard DUST probably provides one of the most comprehensive experiences of any game around simply because of how the two titles interact with one another.For those unfamiliar with the games universe, however, it may appear to be yet another first-person shooter with a fresh coat of paint on it. In some regards, that assumption wouldnt be too far off base. At its core, the game controls and feels like most other FPS titles out there; theres an assortment of guns to fire, a handful of classes to choose from and specialize in and plenty of dudes to shoot along the way. So its most fundamental mechanics are very tried and true to say the least. Thats not necessarily a terrible quality to possess, though, especially considering how solid the actual shooting is. In fact, the game plays quite well overall, outside of the overly nuanced control setup. This is mostly due to how close it sticks to the aforementioned principles of FPS gaming, but aside from the conventional approach it takes to its most basic mechanics, theres a side of DUST that feels quite unique and compelling  but well get to that more later on.Its critical to note that this is a multiplayer-only extravaganza. As such, DUST relies heavily upon its offering of modes. Regrettably theres a distinct lack of variety in them that essentially means players will be stuck playing four basic ones over and over  all of which, might we add, can be found in almost every other contemporary shooter. Theres team deathmatch, team deathmatch with powerups and two capture-and-hold modes. This may not bother someone if they havent played an FPS in the past decade, but for all of us who have, the fact that a game that wants to be so different isnt very different at all, feels especially frustrating. If players are invested in the EVE universe, and are taking advantage of the cross-play aspect, then theres plenty reason to engage in these run-of-the-mill options. But for folks who are only playing DUST without the EVE strings attached, this comes off a missed opportunity; and when catering to a shooter audience, who seem particularly impatient and unwilling to wait around for a game to get good through a series of patches and DLC, its important to deliver right out of the gates. Sadly in this regard, DUST hasnt done that, not for the casual gamer at least. It hasnt dropped the ball completely, but it certainly hasnt given players a lot to get excited about with regards to experiential diversity.If the generic modes arent enough to deter casual players, then the truly uninspired maps and environments just might be. In DUST, theres a lot of sand and giant structures to see  actually, most of the maps backdrops are comprised of dull browns, reds and blacks. Sure, these muted hues and sandy environments illustrate a nice picture of desolate planets resting on the outskirts of space, but when the bullets start flying and the appreciation for the lore and setting goes out the window, it all becomes quite mundane. The map layout doesnt help matters either, with some maps devoid of any type of design that requires intricate strategies or tactical forethought. The occasional interior structure or chokepoint that allow for intense firefights feel under-utilized, making most maps daunting to traverse. Even with spawn points all around, some maps are so sprawling that they actually hinder the ability to be in a combat situation more times than not.So barring the gameplay that feels been-there-done-that, and the general lackluster environments, its onto the customization. Actually, this is DUSTs strong suit, and is what sets it apart from the competition. Characters can be loaded out with all the usual trinkets, but in hundreds of arrangements. Armor, weapons, vehicles, items and much, much more are all at ones disposal in terms of creating a character that feels like their own. This level of deep customization is a welcome addition to a genre that is so cookie-cutter and typically lacking any type of substantive depth. But then theres the skill point system on top of those choices, which takes the place of the standard XP mechanic available in most other shooters of todays day and age. DUSTs system allows for players to improve certain stats, unlock new equipment and level up specific skills as they engage in combat and wrack up kills. As mentioned, this part of 514 is astounding. Its so well-conceived and implemented that it alone gives the player a sense of creating the kind of character they want to play, rather than simply being funneled into certain archetypes that may not fit into their wheelhouse.Sadly, much of the great strides developer CCP makes in this area are almost entirely negated by the integration and heavy, heavy emphasis on microtransactions. Thats right, just like all of those obnoxious F2P MMOs available on PC  you know, the ones riddled and ruined by real-world cash options  DUST makes use of the same system, and as a result becomes a disappointing money-sink for those wanting to buy equipment. Sure, items and the like can be earned by acquiring in-game currency (ISK), but these microtransactions are so apparently encouraged that merely visiting the games player-run market for a new weapon means sifting through actual popups that seemingly want folks to forgo hard work, and instead purchasing goods with real life, hard-earned cash.Worst still is how CCP seems to make it impossible to achieve the games best content without spending a buck. To get the highest level weapons and vehicles, some of which are one-time use items, it takes a ridiculous amount of ISK  so much that players will spend literally hours upon hours grinding just to get enough. This has clearly been designed as a way to urge folks to become frustrated with the time-sink to the point of finally caving and just buying what they need. Oh, and simply buying these items, whether with real world cash or ISK, is something of a nightmare. Doing this requires fumbling through the unresponsive marketplace that employs a confusing and overly difficult to navigate interface with small font and a poor resolution. Considering how often players will need to use the market, they will surely begin to cringe or simply turn off the game at the mere thought of doing so.Then theres the games poor performance and graphical presentation. Framerate drops, texture pop-in, server issues and general latency makes certain matches, at best, unenjoyable and, at worse, unplayable. Its a bit of a crap-shoot as to whether players will have a smooth experience or a choppy mess of one when they log into a server. When things go off without a hitch, the gameplay is smooth and firefights are frenetic. But when the wheels start to come off, the proverbial machine breaks down. These issues were present in the beta, and we were certain they would be ironed out for the actual launch; unfortunately that doesnt appear to be the case. We assumed that the final product would not have gone live with frame rates dropping into the teens, but alas they have. The games art style and sound design are top notch, however. So if folks appreciate those sorts of things, then theres plenty to like in DUST from a presentation angle.Closing Comments:", "date": "May 24, 2013", "grade": 2.5}