{"name": "Metro: Last Light", "ref": "https://hardcoregamer.com/?post_type=post&p=40120", "text": "After a lot of drama due to THQs turmoil, Metro: Last Light has finally been released. In a way, its timing is perfect since so many have been able to enjoy the original game due to its super-cheap Humble Bundle offering, allowing anticipation to build for many in a fairly organic way. Last Light follows up on 2033 by using its bleakest ending and continuing from there. Its a bit of a downer to start with the world essentially destroyed and have folks struggle to survive in train tunnels, but its kind of hard to have a post-apocalyptic story without something like that happening.The opening sets the mood marvelously by showing Artyoms journey from childhood to now, and how his most important goal is just to be able to remember what his mothers face looks like. Its a very simple, but profound, motivation and one that should really drive the story home to anyone whos ever lost a parent. Last Light continues the dark and disturbing tone and look of the first game, with the same kind of morally ambiguous characters and turns. For an FPS franchise, its very story-driven, and this kind of approach is perfect for those who dont just crave more mature plots in games, but also want to see games use the first person perspective to envelop the player more into the game.In very little time, youll be able to not only care about each character, but also have fun at some of the sillier moments  like being given a ton of exposition early on, and you and your comrade being scared of spiders. Granted, theyre fairly large, but still  the sight of a battle-hardened warrior becoming scared around them is hilarious. Theres also some comedy in the form of enemies occasionally not spotting you despite you not being right next to them, but also standingand brandishing a variety of weapons.Those moments are few in number, and for the most part, Last Light requires a bit more strategy than most FPSes out there. Theres a fairly notable stealth mechanic at play where darkness and the shadows in general are your friend. There arent many lights in the metro, but those that are there should probably be taken out whenever possible if you have plenty of ammo. Bright light makes you easy to spot and leaves you open to attacks. However, against those giant spiders, its useful because theyre afraid of it. The AI is fairly smart, which makes stealth tougher since you wont have much time to take out a foe with a quick stab or throat slash. The faster you kill an enemy, the more ammo theyll have left to drop, which means youll be better equipped for the larger setpieces that pit you against at least half a dozen enemies in a confined space.Weapons can be modded, although not quite to the degree of the Borderlands series. Being able to swap between three guns at any one time helps keep the action fresh since some guns are better for a situation than others. If youre in a big battle, automatic weapons may be your best bet since you can take out a few people quickly, while one-on-one battles are better suited for lower-powered guns or a blast from a shotgun to get through. Pre-apocalyptic bullets can be used in an emergency to dole out a lot more damage, but are better served being held onto since they work as currency and can get you some better mods and weapons.Theres a careful checks and balances system throughout every part of the gameplay and it kind of weaves itself into the narrative too. Everythings a shade of grey and no one is exactly how they appear on the surface  much like real life. Theres a nice flow to everything with slower story-driven sections leading to faster-paced ones before slowing down again to something relaxing, and the few moments you have to explore can yield more ammo, weapons, or notes from enemies about their motives. The notes are a nice idea, but would be more engrossing if they were all written by hand rather than appearing as purely typed documents to further suck you into the world. Its a minor issue, but one that stuck out while playing through the campaign.Unlike most FPSes out there, Last Light doesnt have a multiplayer campaign or multiplayer of any kind. There hasnt been much of a controversy around it, which is good. The game relies so much on tone and really isnt about mayhem and carnage even though theres plenty of it on display. The developers clearly wanted to tell a good story here, and unlike Tomb Raider, or other games that have them but water down the overall package by tacking on an outsourced multiplayer game, they just decided to deliver the best overall single-player product possible. Its a case of addition by subtraction, and by not including a superfluous feature, the game is better for it.Visually, Last Light is impressive on the whole even if it is really held back by faces looking rather poor. Beards look tacked on, hair has a strangely plastic sheen to it at times that is just bizarre given the setting, and bare flesh doesnt look so hot in general. Things look better when intricate designs are needed  like super-short haircuts that show off each blade of hair in a convincing enough manner close-up. Scars also look pretty awesome, with a good intent for major ones on both faces and hands  as youll at one point with an enemys hand going through a grate, where you can slice it with your knife to mess it up a bit. The environments are the star of the show, with a ton of detail in each one and most of them looking great. There are a few muddy textures, but not too many, and for a game set either in the depths of an underground train station or a fairly destroyed area above-ground, theres an impressive amount of variety in the terrain and it helps avoid the sameness seen in many other games even with darkness permeating so many areas.Last Lights soundtrack is full of somewhat creepy-sounding slow music. Its bleak, a bit distressing, and very awesome. Everything has a dark classical music sound, and it fits not only the Russian setting, but the tone as well. It depresses you a bit hearing it and that works hand in hand with the narrative to keep you sucked in. There isnt constant music though since its a very dialogue-heavy game, and that largely sounds good. While the lip syncing is pretty bad, the voice acting isnt. Pretty much everyone plays their roles with conviction and takes the subject matter seriously  the only exceptions to the great VO work are some of the side characters, who just say some things, and they fit fine with generic character #1, but dont hold up as well as the main roles that are all acted very well.Closing Comments:", "date": "May 15, 2013", "grade": 4.0}