{"name": "Destiny 2: Forsaken", "ref": "https://hardcoregamer.com/?post_type=post&p=312144", "text": "Its no secret that Destiny 2s year of existence hasnt been a joyride. From a disappointing launch that lacked vital features present in Destiny by the end of its lifecycle to several controversies, both Bungie and fans have been put through the ringer. Destiny 2 needs a reset and Bungie hopes to recapture the magic with Destiny 2: Forsaken, a true expansion built to give players exactly what they want. With a new campaign, weapons, locations and quality of life improvements, does Forsaken successfully press the reset button?Destiny 2: Forsaken takes place sometime after the events of the base game. You and Cayde-6 fly to the Prison of Elders to help an old friend, Petra Venj, put down a prison riot, but the trio quickly learns that the riot was orchestrated to cover up the breakout of eight Scorn barons. Rescued by the long-missing Prince Uldren Sov, the nine successfully escape the prison, but not before killing Cayde-6. Fleeing into the Reef, you pursue them to exact your revenge.Forsakens plot is a refreshing break from the consistent save the world plots of Destiny games, and expansions tend to throw at us. The tale is more personal and adds additional depth to the generic light vs. dark struggle that has permeated the series to this point. Forsaken represents a leap forward for storytelling in Destiny, surpassing the benchmark set by The Taken King. Uldren Sov serves as a passable antagonist but ultimately suffers from a lack of interaction with your Guardian. Outside of a handful of cutscenes from Destiny and a brief interaction at the start of Forsaken, Uldren hasnt had much impact on your story. Much of the animus youll hold for him lies solely on whether you like Cayde-6. It doesnt help that a random final boss appears out of nowhere to rob Uldren of his spotlight.Though short at 5-6 hours, the campaign provides enough thrills and excitement thanks to the great barons. Each of the eight barons offers a unique boss fight that keeps players on their toes. The Rider forces you to fight from aboard a Pike, the Trickster rigs ammo to explode and the Rifleman summons decoys to trip you up. Not all were created equal, like the Machinist whose single identifiable trait is firing a few missiles. Then, there are some like the Fanatic who make up for lack of personality by throwing hordes of enemies at you. Still, the boss design is a huge step up from previous Destiny experiences.Likewise, its nice that we finally got a new race of enemies to battle. The Scorn may have some relation to the Fallen, but they look and fight differently. The Scorn brings enemies that rush the player, swing fire-infused maces, attack mid-range and snipe from a distance. Theyre not wholly unique from the current crop of enemies, but they provide a good change in pace. What shines are the two new locations players visit throughout the journey. The Tangled Shore presents as a lawless chunk of rocks held together by anchors. The area presents plenty of variety with Skorn, Fallen and Cabal vying for dominance. As a playground to wander about and complete bounties, the Tangled Shore provides more exciting encounters than the majority of Destiny 2s worlds. More impressive is the Dreaming City, the ultimate end-game location built for Guardians looking for a real challenge. Filled with powerful enemies, bounties and activities, the Dreaming City aims to prepare players for the upcoming raid, The Last Wish.If theres one problem with the Dreaming City, its the Blind Well. Working like the Court of Oryx and Archon Forge, players make sacrifices to draw out powerful enemies and, hopefully, earn powerful rewards. As in The Taken King, its an excellent idea for a mode thats unfortunately executed poorly. As Fireteams can only hold three players outside of Crucible and Raids, who else youll get, if anyone else, is up to chance. Its possible six other players with high-level gear will show up. Its also possible for under-leveled players to hop in or even no extra players at all. The problem started with The Taken King and its disappointing Bungie hasnt addressed all these years later. Crucible remains mostly intact outside of quality-of-life improvements. Bringing the player count back up to 6v6 was the right move and the lower time-to-kill vastly improves the experience. The significant multiplayer addition in Forsaken lies with Gambit, a new mode that blends PvE and PvP elements. The 4v4 mode tasks players with killing AI-controlled enemies and collecting and banking motes of light. After accumulating 75 motes, a Primeval enemy appears and the first team to defeat their Primeval wins. Of course, its not that simple thanks to the PvP elements. Players can spend motes to summon Blockers on the enemys map. Collect enough motes and a player can invade the enemys map for a short period.Gambit is an excellent game mode when working with a functional team. It provides plenty of tension and excitement as both teams race to the finish and pulse-pounding action during an invasion. Like all team-based modes, Gambit is best when played with a group of friends. A team that fails to work together will quickly lose. Considering Gambit is a best of five game mode, keeping a solid squad together is vital.Bows join the large staple of weapon types available in Destiny 2: Forsaken. While silly on paper, the bows of Forsaken are surprisingly powerful and feel great to use. Players receive a bow early in the campaign and its hard to remove it after finding more powerful weaponry. While not the most practical weapon to take to a gunfight, bows make landing headshots so satisfying, especially when it causes a mini-explosion. Outside of the new story, locations, enemies and Gambit, most of Forsakens changes lie in its quality-of-life improvements. From the addition of in-game lore to random rolls for weapons and gear to an in-game accomplishment tracker, Bungie has done an excellent job bringing back popular features they nixed when jumping from Destiny to Destiny 2. The good news is that all players can enjoy these improvements whether or not they own Forsaken.Microtransactions were a considerable problem in Destiny 2 with end-game items like Sparrows, ships and shaders tied to the games version of Loot Boxes. While not as invasive in Destiny 2: Forsaken, it still feels like large amounts of items are held hostage behind the system. Ships, Sparrows, weapon ornaments and shaders are found in the wild, but many remain tied to Eververse. Considering Destiny 2s costs add upwards of $140 at this point, its annoying that the microtransactions remain (the abysmal Curse of Osiris and Warmind DLCs are required to play Forsaken). Closing Comments:Theres no beating around the bush that Destiny 2 was a disaster. Bungie has owned up to their mistakes and the result is Destiny 2: Forsaken. While its not cool that its taken $140 to get here (and more if you splurge on microtransactions), Destiny 2: Forsaken presents Destiny 2 with its much-needed reset. The campaign is compelling enough thanks to its excellent boss design, though Uldren lacks the history to be a strong antagonist. The new locales are a joy to explore and provide a nice change in pace compared to the vanilla worlds. Gambit is an exciting new mode, but, like the Blind Well, is heavily dependent on what kind of teammates you have. Destiny 2 needed something to save it and Forsaken bought it a new lease on life.", "date": "September 13, 2018", "grade": 4.0}