{"name": "Monster Hunter 3 Ultimate (3DS)", "ref": "https://hardcoregamer.com/?post_type=post&p=36120", "text": "Few titles describe their game as succinctly as Monster Hunter 3 Ultimate. You hunt monsters, this is the third(ish) entrant in the series, and truly is the ultimate version of the game. Originally released on the Wii as Monster Hunter Tri, the core game was supplemented with so much new stuff that this enhanced version is bursting at the seams with content. There is an absolute insane number of quests, monsters, and items to forge, and I cannot urge completionists to stay away strongly enough as this is the kind of game that will get you fired from your job and ruin your marriage. You can play for over a hundred hours and still not be close to doing everything in this behemoth of a game. While the game has a ton of content, however, Im not entirely sure I would classify all of it as good content and at times it feels more like youre completing a shopping list than actually embarking on an epic adventure. This is the sort of game that a small niche of gamers will go absolutely crazy over, but the repetition and reliance on grinding and farming as a means to extend gameplay will likely sour the experience for some people.There is a story here, but it is utterly forgettable as the game is too worried about sending you out on your next quest to waste time trying to justify why youre supposed to do it. Basically, people in the village need help killing monsters or gathering berries, so you will serve the role of their surrogate ungrateful child and do all of their chores for them. There are quests that actually advance the story and other supplemental quests you can go on to get better items or more cash, but they all boil down to essentially the same thing. As weird as it sounds, the genre that Monster Hunter 3 Ultimate reminds me most of is an MMORPG despite the fact that it isnt massively multiplayer and it is only barely online. It has all the hallmarks of a MMORPG, with the reliance on villager quests and farming for items, but for some reason the 3DS version omits the MMO part of the MMORPG.The quests themselves are enjoyable in short doses, and Monster Hunter 3 Ultimate does about as good of a job as Ive encountered at capturing the spirit of an adventure. While searching for items and scavenging the remains of monsters to find key components of weapons most likely doesnt sound like the most enjoyable way to spend an afternoon, there is something intrinsically rewarding about crafting the perfect hammer, or axe, or whatever weapon it is youve decided to smash monsters with. You start the game off gathering some basic plants and beating up some harmless herbivores, but before you realize it youre fighting against things that feel like a mix between a T-Rex and a tank and you find yourself missing the days when the most difficult thing you had to grapple with was your conscience after slaying a baby dinosaur in front of both of its parents. This game has an abysmally slow start and a learning curve that is basically a huge brick wall, but if you can get past both of these things then this game offers some of the best exploration you can have on your 3DS.While the focus on exploration and completing quests does a nice job creating a true sense of adventure and making you feel like an actual monster hunter, the formula does grow repetitive after a while. Make no mistake, the quests arent here to supplement the main game or serve as a means to show off a deep and impressive combat system. The quests are the game. If you hate the idea of farming for items, this game is absolutely not for you. You end up completing quests and farming for items to get better weapons and armor, and you use this equipment to go out and fight stronger monsters so you can get better items for even better weapons and armor. It is a vicious cycle that is at the heart of most MMORPGs, but this is almost entirely a single player experience so apparently the target demographic is people who really, really like to farm for items.The game also doesnt do a great job delineating exactly what it is youre supposed to do at times, and some quests dont really give enough clues as to what youre supposed to do. Kill some epioths! an early quest commands. So I grabbed my gear, went out to the field, and then scratched my head wondering what the hell an epioth was. There are little guidebooks you can buy at one of the stores that tell you some of the behaviors of each of the monsters, and one of the ones I purchased did have a fuzzy little picture of what a cave painting of an epioth would look like, but it was like trying to identify a person using only a portrait hand painted by a five year old. It isnt like the vagueness of the quests make them impossible to complete, and it does impart a greater sense of exploration to the game, but I would have preferred it more if the game had just told me what to do and where to go so I wasnt wasting time wandering around the wilderness trying to find some made up creature that Ive never encountered before.Of all the monsters youll have to wrangle, the most ornery varmint you end up facing off against will be the camera. In normal combat it is a mild annoyance, but once you dive into the water youll find it far more frustrating than it should be. The left should button whips the camera immediately behind you, which is useful for the entire second your target will be in front of you before it moves off to the side. You could theoretically control the camera with the d-pad, a feature that is only useful if you happen to have a second thumb on your left hand. A second d-pad on the screen itself also works , but it is awkwardly positioned and serves as a poor substitute for the second analog stick this game so desperately needs. The Circle Pad Pro is really the only way to get an experience that doesnt leave you grappling with the camera, but that requires an extra $20 or so to purchase the peripheral.The controls arent the only area of inferiority for the 3DS version, and it becomes obvious early on that the WiiU edition is the version to own. The visuals are fairly ugly, and Monster Hunter 3 Ultimate is one of the worst looking games Ive played for the 3DS. This is a clear step down from the WiiU counterpart and both the character models and on screen text looks somewhat blurry. The 3D effects themselves are a mess and end up blurring the text even further, and I ended up turning them off within the first twenty minutes of playing the game. The feature that really separates the two, however, is the fact that the 3DS version lacks an easily accessible online multiplayer mode. You can still connect with friends locally or transfer data saved on the 3DS game to your WiiU game, but this is the sort of game that basically cries out for some online multiplayer and connecting with others if far more difficult than it should be. Completing quests with friends is far more enjoyable than doing these by yourself, but Monster Hunter 3 Ultimate for the 3DS lacks any easy way to connect with others unless you can convince a group of friends to purchase the game as well.Closing Comments:I found myself going back for one more quest or trying to farm specific items for just ten more minutes far too often, and the game is as tremendously addictive as any of the other titles in the series. Still, its difficult to classify this addiction as a particularly entertaining one and while the game kind of took over my life, I wouldnt classify what I was feeling as fun. I was a Monster Hunter junkie, going back to the woods for my latest fix, blacking out, and waking up three hours later with a pile of bones and pelts next to me but only the faintest recollection of how they got there. While fans of the series and aficionados of farming or grinding are definitely going to want to check out Monster Hunter 3 Ultimate, the the frustrating camera and lack of easily accessible multiplayer on the 3DS make the WiiU version the superior option. People who want a portable experience are going to absolute require the Circle Pad Pro, in addition to a suitable explanation for your friends and family as to where you were for the month you disappeared and couldnt be found.", "date": "April 9, 2013", "grade": 3.5}