{"name": "BattleBlock Theater", "ref": "https://hardcoregamer.com/?post_type=post&p=35892", "text": "BattleBlock Theater comes from the madmen behind Alien Hominid and Castle Crashers, and like those, has a twisted sense of humor. Instead of playing out as either a shooter or beat em up, however, The Behemoths latest game is a platforming adventure with tons of gameplay to offer up. Its basically three kinds of games rolled into one downloadable $15 package, as youve got a side-scrolling-platformer in single player, a co-op multiplayer, as well as a ton of arena matches that pit you against other people or bots in over a dozen kinds of modes to keep things interesting.The basic premise of the game is that your character and Hatty Hattington are shipwrecked and thrown in jail  Hatty has been given AN EVIL HAT, while youre able to roam the grounds provided you can beat stages. Between groups of them, you can shop to save other prisoners using gems found in levels, and trade in balls of yarn for goodies. Why yarn? Because the a bunch of cats run the joint  as a cat owner, I dig this. The more prisoners you unlock, the more customization options youll have for your character, which makes multiplayer easier since you can find yourself faster, and it gives you the only single-player platforming experience where you can play as a walking character with a propeller for a face.The core game is a traditional 2D platformer with some action elements in the form of punching and secondary item throwing. You can change your secondary items around, but the most amusing item is always the land mine/Frisbee hybrid since it blows up whatever it connects with. Jumping is easy and responsive, as are item grabs for things like pipes and ladders. Punching is also a breeze, and is something youll do a lot of to avoid being overrun by cats and their ever-sharp claws. There are some puzzle elements in play as well that keep things interesting. Youll frequently go from areas with regular platforming, to some kind of item helping you  like a jetpack with unwieldy controls letting you grab an out of reach jewel, to then having to solve a puzzle to progress. Theyre usually a matter of moving blocks around to either press a button or prevent them from impeding your path. Other times, youll need to figure out how to press a button in a weird location, which sometimes also ties into items like the angels wings that allow far more precise flight movement.The multiplayer game is quite similar to the single player, but every stage has been changed up to make use of having two players. This means there are a lot more simple puzzles to solve, which can be challenging, but are a lot easier when you have someone else there to bounce solutions off of. Unlike pretty much every 2D platformer since the 16-bit era, there are no issues with having two players and one getting stuck  the screen zooms out a lot and makes great use of modern HD screens to give you a wide viewing area. This means that you can see nearly the whole level layout if need be, but theres a huge loss of detail in the process, which can make seeing things like climbable pipes impossible. Its a minor issue in the grand scheme of things, and the mutliplayer gameplay is so addictive that youll definitely want to play through the game once in both single and multiplayer.While BattleBlock delivers the goods more often than not, there is a lack of polish with some things. During a multiplayer session, Steve and I got stuck respawning at an area that caused instant death. We had to restart the stage, which meant no checkpoint saves. Sure, it was easier to get past the areas because wed done them before, but something like that should never happen. Fortunately, there are some happy accidents with the lack of QA work as you can sometimes go halfway through an object and then use that to solve a tricky puzzle easier  so it isnt all bad or annoying in that regard.Beyond tremendous single player and multiplayer gameplay for the story modes, the arena battles are outstanding as well. There are about a dozen options to choose from here, with things going from normal  like a team deathmatch-style mode where you collect souls instead of kills, to far more bizarre things like a game of basketball in a platformer. You get the ball, run, jump, and shoot. Its simplistic, but works really well. These are great diversions during extended story mode play sessions, and being able to play them with bots is nice since you dont really see them in many games nowadays, and theyre a great way to play a unique experience without having to go through the trouble of waiting in a lobby to find other players to play with. If all of this isnt enough to satiate you, theres even a level creator, which has resulted in some fantastic stuff already even though the game is fairly new.Visually, BattleBlock Theater has a simplistic art style, but the clean black lines for characters really pop and the environments themselves are varied and incredibly colorful. The world has a lot of life and personality to it, and a lot of that comes from the little things  like a crowd of cats in the foreground, or being given well-wishes from a guard hoping you do better than the last prisoner. Its dark humor with a light-hearted look, and it works really well. Character animation is fine, but not spectacular, while the cutscenes look incredible with limited animation, but really broad expressions and actions that leap off the screen and make you chuckle.The narration during cutscenes helps that as well, and youll be laughing a lot in this game. Beyond just hearing narrator Stamper in cinematics, youll hear him bellow out silly and sometimes disgusting things in a way that makes everything funny. Even stuff that doesnt really work on the page, like a lot of the toilet humor, winds up working out in execution due to how wackily its spoken. When you hear it, you cant help but laugh because of how its being said and it makes nearly every line written funny. The music is also outstanding, with a mix of regular, catchy platforming tunes with some chiptune stuff and a silly song that can only be described as a bunch of meowing noises in a melody that wind up being way funnier than they should be.Closing Comments:", "date": "April 7, 2013", "grade": 4.5}