{"name": "Ninja Gaiden 3: Razors Edge", "ref": "https://hardcoregamer.com/?post_type=post&p=35716", "text": "Its been an excellent six months for the Ninja Gaiden franchise. After years of missteps with censored PS3 versions and a flawed Ninja Gaiden 3 release that was knocked for being too easy and taking away some of the combat systems depth and violence, the beloved series is back on track. Team Ninja listened to fans about NG3s problems and Razors Edge on the Wii U remedied issues with the original release of NG3 on the PS3 and 360. That momentum was followed up on nicely by making the Vita version of Ninja Gaiden Sigma+ a PS+ freebie, and then the release of the Vita version of NG II Sigma+ that, like with the first game, took away the PS3s censorship and restored the bloodshed series fans have grown accustomed to over the past decade.Its been five months since the Wii U version was released, but now 360 and PS3 owners who mightve been turned off by NG3 can give it another go-around if they dont own Nintendos system. To those who skipped the initial release due to low scores, the third installment stripped the combat down and took away dismemberment. It did bring with it blood on bone attacks, which are essentially one-hit kills involving parries, but that alone didnt replicate the depth seen in the first two games. Theyre rewarding and gory, and are a must to learn when youve got waves of enemies coming after you with gunfire and missiles at the same time. This is a surprisingly common occurrence for Hayabusa, who has to put up with all of this while his arm is all diseased from a curse stating that he will feel the pain of the many he has killed  and his right arm looks a thousand kinds of nasty as a result.NG 3: RZ feels like a natural extension of NG II, with a lot of depth brought back into it, the usual skill trees and upgrades, and the general feeling that youre a ninja and can do pretty much anything you want as long as your arm isnt in searing pain. You also cant really aim for far-off foes easily with the bow and arrow due to the camera going back and forth between them and closer enemies, which is quite annoying. The camera remains an issue throughout many parts of the game, but doesnt make it impossible to win  just common to retry some areas.That also must be done for the QTEs that pop up without a button or action prompt. They rely on a mix of logic given the situation and hope that youve memorized everything to that point because failure sucks and while youll never be set too far back, its still annoying to have QTEs and not be shown clearly what youre supposed to do. Its almost worth it for the gorgeous shots that result, though, which would be obscured by button prompts if they were used. The core single player game is a lot of fun and features everything that folks loved about the first two entries in the modern trilogy from a gameplay perspective, with a crazy storyline. Outside of the main game, youve got ninja trial challenge missions to do, and online play to partake in.The former gives you short missions to complete and helps sharpen your skills in specific areas. The latter allows for co-op action and a deathmatch-style mode that pits you against other ninjas. This mode is particularly crazy since its got a really fast pace to it and the camera often cant keep up, resulting in a lot of instances of the camera getting stuck behind a corner, or not being in an ideal position to let you see where your opposition is in relation to you. Its a bit frustrating, but it winds up feeling worth it when you succeed in spite of the problem because of how good it feels to not only earn a kill, but level up as a result. Doing that lets you unlock new skills and attire, and with every upgrade, feels like youre improving as a player. In some ways, that could be an artificial boost due to the new skills, but realistically, the more time you spend with a game, the better youll get at it. Its probably a good idea to spend some time online if youre rusty, however, since its a total trial by fire and youll have to learn quickly in order to survive for any length of time.Visually, Razors Edge is quite impressive. Character models look solid with a ton of detail, and seeing blood splatter accumulate on your attire never gets old. Animation is smooth and yet not so smooth that it takes forever for one to finish up. Ground and environmental textures can be a bit suspect at times, but its never distracting for very long  youll spend too much time dodging attacks to really focus on the scenery much outside of cutscenes. On the audio side of things, the music is as good as its ever been with a lot more diversity than before due to there being more kinds of stages here than in past games. The voiceover work is shockingly decent given how ridiculous the plot gets at times, and having everything played straight by the cast helps you take it seriously instead of it being a complete farce.Closing Comments:", "date": "April 5, 2013", "grade": 4.0}