{"name": "Alien Spidy", "ref": "https://hardcoregamer.com/?post_type=post&p=33323", "text": "During our hands-on preview of the PC version back in October, we noted that Alien Spidy was quite good even in its unfinished form. Its bright graphical style stood out and the initially odd control setup eliminating the d-pad for movement took some getting used to, but made for a better-controlling experience. While much of our praise from the preview remains, the final version has some issues we didnt notice in our preview build that hamper the experience and make it less fun than it otherwise would be.The biggest problem in Alien Spidy is somewhat unresponsive jumping. Youll hit A perfectly and wont jump in the air  as a result, youll sometimes go flying down a thorny hill instead of jumping on a mushroom springboard to reach a new area. The respawn system is also problematic as it can put you right next to an area where death can come quite easily. One such section involves you being brought back to life while rocks roll down a hill youre revived on, resulting in either being hit instantly or having very little time to react and jump over them, while hoping that the jump mechanic actually works the way it should.Another cause for concern comes in the form of web shooting. While the X buttons quick shot works well in most situations, there are times when youll want to use the more precise right stick controls to shoot exactly where you want since precisely hitting something like a spinning flower at the right angle and with the right momentum behind you can send you where you need to go very quickly. However, the right stick controls cause problems by not quite shooting the web where you theoretically want it to go with the right stick. Youll intend to aim for a top right shot only to have it shoot either up or to the right  neither being what you want, and in tricky spots, this is another instant death and another source of needless frustration.Fortunately, the graphics are a major highlight and help make the game fun to play even during its most annoying moments. Theyre as bright as they were before and have a lot of character due to that and the incredibly odd, but gorgeous color choices made. The console versions look the same as the PC version, and its tough to notice any difference in clarity between the two which is definitely a good thing. Unfortunately, while the soundtracks cheery nature worked in a short preview version, in the full game, it gets old quickly. There isnt much variety to the tracks, and none of the songs are good enough to warrant listening to outside of the game. Fortunately, listening to a custom soundtrack is easy enough and you can mute the in-game music but keep the sound effects in the options menu to help avoid this problem.Closing Comments:", "date": "March 19, 2013", "grade": 3.0}