{"name": "Pokmon Ultra Sun & Ultra Moon", "ref": "https://hardcoregamer.com/?post_type=post&p=280161", "text": "The Pokmon series of video games have always been big sellers. They come in twos, but a third or sequel is added after a bit. Pokmon Ultra Sun and Ultra Moon have now been made as part of the lineup, releasing only a year after the Sun and Moon versions which were great and a fresh, fun way to experience the latest generation. Can these Ultras enhance the experience and bring the game to a new level?Sun and Moon open up in the Alola region, a tropical paradise filled with new Pokmon to encounter. There are thugs around town, strong trainers to battle and mysterious creatures threatening the land. Ultra Sun and Ultra Moon have a similar set-up. Slight changes have been made to the sequence, but youre essentially playing the same game as last year. Instead of choosing a starter Pokmon from Iki Town, trainers get to pick after an ambush by a wild Yungoos. Thats not a big deal but it sets a precedent that little differences will be noticeable. It offers players a lot more to look forward to as they experience this journey. Small features also include interacting and playing with Pokmon in the overworld. Side quests, which are usually absent from Pokmon titles, give players more to enjoy around the region along with multiple responsibilities. If this is ones first time playing a Pokmon title, its a good pick. It has the best graphics of any entry and the most enhancements or features. Have fun with Pokmon by dressing them up for photoshoots or take on some challenges at the Battle Agency. Fans have different goals from one another and there is a little something here for everyone to enjoy. Explore Alola to encounter fresh and familiar faces while taking in the sights and sounds of all the Pokmon you encounter. Rookies and veterans alike will find plenty to keep them occupied.Those are all fun, but its not the main reason these games have been released. That comes in the form of added plot lines for the story. Ultra Beasts played a huge role in Sun and Moon, however, it has sort of upped the ante when it comes to Ultra. Odd visitors, seemingly from a different time and place, have revealed a Pokmon that drains light from the world. Necrozma did not serve a purpose in the previous games, but is now the main focus. It will be up to trainers to uncover all the mysteries surrounding this awakened threat. Overall, the story is more focused and enjoyable versus the previous game. Even though many of the vital moments throughout are the same in both, Ultra just gives it something more to look forward to. The inclusion of the little wormhole mini-game is confusing at first and switching to circle pad controls isnt explained. But that portion is even overly unnecessary since it only transports you to the final battle. At least its used to find Legendary Pokmon after all is said and done. I still feels more complete and compact when comparing the two titles, though. There are a few areas which are welcomed by trainers. I felt the challenge and difficulty was upped. Pokmon games have been holding players hands for a while, but not this time. Perhaps it was the Pokmon I chose to have as a party that failed me but Ive made it through some tough spots in previous titles. I found myself needing to tap into the diversity of partners and go looking for something that will give me a type advantage. My earliest memory of doing so was restarting Pokmon Red when I was ten years old because choosing Charmander to face Brock is the worst idea. Ever since then, Ive never had a need to switch up team members. After the main storyline is over comes a fun addition of facing some of the series greatest villains. While it still panders to the nostalgic side, its just one of those things you didnt know you wanted. Theyve assembled an all-star cast of bad guys to run through. Its not like theyve just been dropped in there with no explanation; theres a little story involved and even interaction among the members. Though it will prove to be challenging, many longtime fans are going to welcome both the difficulty and idea.Of course, the main draw of Pokmon is the creatures themselves. There are over 800 Pokmon in existence, but Sun and Moon were criticized for including little to their region as well as Pokdex. The inclusion of Alolan forms helped a little but it was all severely lacking. The addition of new Pokmon was teased leading up to the release of Ultra Sun and Ultra Moon. A couple new Ultra Beasts are cool, a different form for Lycanroc is nice, but that was all we got. The Pokdex expanded as well to include more Pokmon from previous generation. Everything seemed old and repetitive, like a weve already had those on teams before kind of feeling. Closing Comments:Theres a couple of fun new features implemented in Pokmon Ultra Sun and Ultra Moon, and its the definitive edition for newcomers, but overall theres not enough to make it worth playing through again for veterans. During the entire build-up to release, it seemed like we were getting a sequel of sorts with in-depth content, but what we actually got was a re-telling of what weve already been through. Perhaps I didnt pay enough attention to the promotional materials, but I was under the impression this was going to be more than a simple remake. Regardless of how I personally feel, however, Ultra Sun and Ultra Moon are the ultimate versions of the games and a whole lot of fun. This being the final 3DS title in the series, as far as we know, is a fine send off. Hopefully, everything is amplified to extreme levels once Pokmon makes the leap to the Switch.", "date": "November 24, 2017", "grade": 4.0}