{"name": "SimCity", "ref": "https://hardcoregamer.com/?post_type=post&p=32565", "text": "Its hard to believe that its been over ten years since weve last seen a full-fledged SimCity title from Maxis. While the Emeryville-based studio has been hard at work in building other franchises, SimCity has been shoved in the corner with spin-offs serving as the only way to get your fix. No longer will fans have to wait, though, as the next iteration has hit and looks to improve on the initial concept of world building. Can SimCity rekindle what fans have come to love from the series, or has the god game king fallen from its throne?SimCity can be straight up addictive as the building tools help gamers manage a city in order for it to grow into a flourishing community. A game starts off with a finite amount of simoleons (money) along with the ability to throw down different zones, such as industrial, commercial and residential. There are different bonds that are accessible, allowing for a quick start, but its paid off by hourly fees, ultimately eating away at profit. The world goes round as the sims who inhabit the players city need jobs, electricity, water, and so much more. As the city grows, so does the demand for additional services, such as more fire trucks to put out increasing fires, or more cops to handle crime. Theres a textbook amount of features, and while it can seem overwhelming at first, its relatively easy to pick up and play without much trouble. Some may have issues at first and may have to restart all together; but when you get the basics down, it becomes a breeze to move forward.If players want to expand outside their comfort zone into new territories, additional cities can be created in order to help maintain other aspects, such as handling the garbage disposal. This is a nice addition, especially considering friends can join the world, but its just unappealing to manage multiple cities. Transitioning back and forth between any number of city projects becomes nothing but a chore as the lengthy load times hinder the immersion and flow of the rapidly evolving territory. On a positive note, each area can be completely different from one another; maybe some generating more pollution while others are cleaner, more eco-friendly. It ensures each city can have a unique trait if the player develops it right. Unfortunately, this all ties into the biggest negative point by far: the open areas.The most significant downfall to SimCity is the amount of space youre given. When setting up one location, youre given a box to fill, but its very easy to populate that box in quick session, ultimately cluttering things up. Its absolutely amazing how microscopic each area is considering there can be hundreds of thousands of people at any given time. This does have something to do with the strong focus on online play as Maxis wants this to be a social experience, but these dont feel like cities. They can grow to skyscrapers, but in geographic size, they feel like towns in comparison to past games. It might be a technical issue generating so many 3D assets, clogging up graphical and processing power, but it limits the players creative ability significantly.The big push with SimCity is asynchronous multiplayer where gamers are able to join a region and work together, or completely ignore each other if they want. You can certainly play the game by yourself through private sessions, but the big new feature is communicating and trying to work with others asynchronously to build the best region possible. When players populate ten or more cities, it becomes an intriguing factor in how to structure the city, but it feels as if the game is built primarily for this. Theres certainly nothing wrong with having multiplayer options in your game, but when it disrupts the flow of the simulation, it can lead to some frustration and major limitations (in this case being the size of each area, as explained above).Its hard not to talk about one of the larger issues that has come our attention: always-online DRM. The infrastructure and server capabilities EA Games has integrated into SimCity is not only imperfect, but so infrequent that it becomes one of the most annoying experiences Ive encounter with any video game. If the servers are down or having trouble to connect, you wont be able to play at all  even if you want to play in solitude. On multiple occasions we werent able to create cities, join regions or even continue playing where we left off. Additionally, trying to load up the launcher through Origin takes us multiple tries before telling us we couldnt log-on. Its the most irritating feeling to come home and just want to build, only to become so frustrated to give up whatsoever. This could change in the future, but this is a significant issue that comes with the game at launch, so its difficult to ignore.Closing Comments:", "date": "March 6, 2013", "grade": 3.5}