{"name": "MLB 13: The Show", "ref": "https://hardcoregamer.com/?post_type=post&p=32228", "text": "Oh, how it must feel to have the best version of a major sports game exclusive to your console. While Madden, FIFA and NHL series games sell millions of copies every year on multiple consoles, Sony has the privilege of having the premiere baseball game exclusively on their hardware. Its well deserved, however, with the series continually innovating since its inception in 2006 on PS2. Seven years into its lifespan, MLB 13 is looking to yet again innovate this renowned series with the addition of multiple features, modes and a totally refined namesake in its The Show mode.Of course, even the most ingenuity in a year-to-year sports games will still likely leave basic gameplay the same and such is the case in MLB 13. Thankfully, the series has long found its sweet spot, so here this is a welcome rule of thumb. In the Play Now mode, players take to the field as one of any MLBs thirty teams or numerous minor league affiliates and can either play against A.I. in an exhibition game, online opponents or a friend on the same couch. As this is the most basic mode of the game, its incredible how many customization options are available here. Being able to play as the Tucson Padres or Frisco RoughRiders is novel enough, but with multiple selectable uniforms ranging from away/home to throwback, perfectly-recreated stadiums and the ability to change the batting order or starting pitcher, Exhibition could easily pass as the only mode of the game  incredible as there are several others.New to the series this year is The Postseason mode, which fast-tracks players into the postseason and eventual World Series to take their shot at the title. Gameplay remains the same in this mode, but up to ten teams can be controlled in multiple scenarios from wild card rounds to championships. Allowing players to quickly take their shot at the title, this mode is perfect for fair-weather fans who prefer the action of the postseason to the 162-game regular season. Another neat new addition is The Show Live, which is the standard exhibition mode with matchup and roster feeds from MLB.com, allowing the game to be played in a simulated real-world environment. Commentators even reference future or previous events, making this a perfect way for committed fans to feel like theyre part of the action with no gear but a DualShock 3.As the games title suggests, the premiere mode remains The Show, allowing a player to be created and their career followed from a spot on a Triple-A roster to (hopefully) one of the major forces in Major League Baseball. After choosing a position and play style ranging from starting pitcher to shortstop, players can then be customized. The amount of options here are astonishing, allowing you to customize things like age, number, height, weight, skin tone, forehead wrinkles, cheek bone fulness, eye color, blemishes, facial hair and head size. If the appropriate amount of time and honesty is taken, anybody can create a player that mimics their real world appearance. Players can then be drafted or choose a team, with the latter being the preferable option as the former is practically a random team assignment, and begin their career. Throughout it, training points are earned and advancement goals can be completed that improve skill. With multiple games and training sessions, the mode can last months if played with discipline, and is both the perfect primer for a beginner and someone going it solo that aspires for more than a basic baseball game.Making the game look and play as realistic as ever are over two hundred and fifty new fielding and running animations, ninety new batting stances, fifty new pitching motions and sixty new HR swings that, although not immediately apparent, make the game smoother when compared to last years outing. Additionally, the hitting engine and ball physics have been refined and theres a wider timing window. Of course, theres hundreds of other tweaks and additions, but none as apparent as the evolution of the commentary, with the Road to the Show mode receiving thousands of new lines and the welcome addition of former MLB player and current television sportscaster, Steve Lyons, joining the booth.Closing Comments:", "date": "March 5, 2013", "grade": 4.0}