{"name": "Castlevania: Lords of Shadow  Mirror of Fate", "ref": "https://hardcoregamer.com/?post_type=post&p=32331", "text": "Although Castlevania has had its ups and downs in the twenty seven years since its inception, its continual existence feels like a warm blanket. In a world with modern video game dynamics and themes dominating the marketplace, sometimes its nice to revisit the gameplay and tone of these classic franchises, which is exactly what Castlevania: Lords of Shadow  Mirror of Fate sets out to accomplish  albeit with a modern twist. MercurySteam, who developed the original Lords of Shadow under guidance from Kojima Productions, is back at the helm and hoping to make Castlevanias first 2.5D sidescroller and 3D game worth checking out amidst the current onslaught of releases on major consoles. Attempting to juggle the multiple characters from Lords of Shadow, Mirror of Fates convoluted plot sees players begin as Gabriel Belmont in a quick prologue/tutorial where he, after having relations with a woman named Marie, soon becomes Dracula and holes himself up in a castle. Unknown to Gabriel, Marie became pregnant with his son and soon gave birth to Trevor. A prophecy from the Brotherhood of Light foretold that Trevor would be mankinds last hope, so they raised him in safety until he grows up and sets out for revenge against his father. While this may seem like a logical jumping-off point, players instead take the role of Trevors son, Simon Belmont, who is also seeking revenge after Trevor was apparently murdered. Most of the quest is from his point of view, but things do come full circle with his father and Alucard becoming playable characters later in the game. Still, its all quite confusing and barely flushed out in the games few cel-shaded style cutscenes. Theres even an important character named Lost Soul who doesnt utter a word. Safe to say, this isnt a revelation in storytelling.Luckily, the gameplay fares quite a bit better. Rendered in 3D, but designed as a sidescroller, Mirror of Fate mixes Lords of Shadows combat and aesthetics with classic Metroidvania-style platforming. Combat is handled predominantly with two buttons, with Y delivering a direct blow to an enemy and X a more general sweeping attack to the area around you. Combining these together allows for more deadly combos, but in reality, it simply means that youll randomly alternate mashing them. On the defensive side of things, holding LB blocks enemies attacks, while tapping it and pushing away with the analog slider initiates a backwards roll. Its simple stuff, but fits well with the flow of combat. The only glaring issue in combat design are the persistent quick time actions that tend to pop up during boss fights. While normally not a huge distraction, including them on a handheld in 3D with a hinge in the middle is a terrible idea, as having to repeatedly spam a button leads to distortion of the image and the top half of the console violently waving around (especially on an XL). When the console isnt being jerked around, however, the 3D does look nice. The game was designed with the gimmick in mind and there are multiple environments that show depth and help the claustrophobic parts breathe. Wide-open areas benefit most from the effect, with rows of an abandoned theatre feeling endless or the multiple shelves in a library being instantly apparent. Of course, as this is a Castlevania sidescroller, the bulk of the game takes place in gothic corridors and hallways, with only basic design elements to differentiate the areas you are in. Even for a Castlevania game, design is often dull and enemies, ranging from werewolves to skeletons, are quite generic. Graphically the game looks fine, but its lacking the understated beauty and colors of the handdrawn artwork of the classic and previous handheld entries. The inherent blandness of the game combined with the limits of the handheld make it come off visually as a second-rate interpretation of its console predecessor.Even though the game may look modern at first glance, it thankfully plays like a classic Castlevania. When the quest begins, the only weapon available is Simons trusty whip, with more weapons unlocked as the game progresses, including throwing axes and oil flasks. One of the most notable additions is that of the Spirit of Belnades, which protects you from any damage upon activation until drained by incurring damage. While theres a basic route thats accessible from the beginning, many areas can not be reached until the Combat Cross is unlocked. Until then, blocked locations can be denoted on the map by dragging a marker onto it via the touch screen, a helpful feature that comes in handy when previous areas are inevitably backtracked to. Even after three decades, the classic Castlevania gameplay mechanics remain enjoyable, challenging you to learn every facet of the map and giving an unparalleled sense of power when new abilities are unlocked.Closing Comments:", "date": "March 5, 2013", "grade": 3.5}