{"name": "March of the Eagles", "ref": "https://hardcoregamer.com/?post_type=post&p=30670", "text": "The grand strategy genre is one of the most unapproachable in the entire industry. Aside from their very minimalistic visual approach, they often concentrate on the minutest details of what it takes to run and build an empire. As a result, many a hour are spent poring over text menus and screens, engaging in what sometimes feels like directionless diplomacy, managing ones kingdoms economic state, courting damsels in order to produce children to further ones bloodline and, of course, reading into the back stories of a lengthy list of battlefield commanders, all of whom have their own histories and set of attributes, to ensure military prowess. Along with these facets comes a slow, meticulous pacing and a generally overwhelming sandbox feel to the whole experience. But with the plodding speed comes some kind of fulfillment, so long as the player knows that they cant necessarily win the game since, well, in these games there really isnt a goal or end per se. In other words, this genre simply isnt newcomer, and definitely not casual gamer, friendly. Paradox Interactives latest installment in their grand strategy library, March of the Eagles, remedies many of these issues though, but at the cost of others that make these types of games so enjoyable.March of the Eagles starts off in a way that throw players right into the thick of conflict, with a number of tutorials to plow through. Fortunately, given the games limited scope, the tutorials, that can drone on for what feels like years in other games of this ilk, are over quickly and players are promptly thrust headlong into the meat and potatoes of the experience. In the beginning, not much will be asked of folks: theyll start off by picking one of eight major powers during the Napoleonic Wars, read each nations strengths and limitations by way of an easy to interpret screen of parameters and then start their campaign for dominance on a fully 3D-rendered map. Unlike many of Paradoxs other titles, like Crusader Kings or Europa, players are given a very clear objective right out of the gates: dominate all other nations by conquering and holding a specified percentage of the map, and victory will be claimed. For the first time in a while, this grand strategy title can actually be won  its not just an endless and constant string of empire ruling. How players accomplish this mission is ultimately left up to each person, which is an empowering feeling if weve ever felt one.Up front, theres an immediate option available for players to reign triumphant: rule through military force. Perhaps more than most other grand strategy titles, March of the Eagles places a heavy emphasis on warfare. Better yet, this mechanic is presented and executed in an easy to understand and as rewarding as commanding an army essentially through a series of prompts and then watching them unfold by way of little graphical pizzazz can be. In essence, players will need to employ generals to lead brigades on three flanks of their nation. To do this, folks are given roughly ten tactical options to choose from, in order to have their armies carry out their will. All options are outlined in a brief, written tutorial, and selected by a simple click on whichever icon represents the desired military approach. This summarizes March of the Eagles entire style to everything it does: make it simple to comprehend and implement. It doesnt ever concern itself with bogging players down in morale-crushing amounts of text; instead it tries to maintain a certain level of accessibility.But while the philosophy of might makes right is a far more applicable one than in most other grand strategy games, there are several other viable means to working through the game. For instance, coalitions can be formed through clever diplomacy and well-appointed leaders, all of which is intuitive and not misleading and even engaging to a point. A warring nation can be dealt with in this way, but also through other methods such as establishing strangleholds on trade routes. Court a neutral nation that allows an opposing force to use their supply roads, and suddenly that enemy is left scrambling to figure out another way to import and export goods. The best part about this economical starvation strategy is the fact that it can be almost as effective as just steamrolling fools with an enormous army. In the end, these are just some of the many alternatives to military force, and ultimately the reason why March of the Eagles is a game that is tailored to fit multiple styles.That being said, it does feel like March of the Eagles was designed for a more casual, pick-up-and-play experience, which means war certain feels like it cant be avoided. In fact, while there are other ways to reaching ones campaign goal, players would be hard-pressed to go through the game without ever firing a shot. Since this is the case, much attention has been paid to how players go to war. There are naval battles, artillery barrages and good old soldier-on-soldier action. All of these, among other, what are called, Ideas can be researched and made better through March of the Eagles take on teching up.Since the game takes place during a specific time period - a short one at that - it would be inplausible to implement a research mechanic that provides users with advanced technology outside of the Napoleonic years. So, in order to fit the time period, Eagles uses an Ideas system that enables research and development into systems that already exist. This component is essentially just used to upgrade existing skills, but having the option to enhance economic conventionalities, artillery efficiency as well as overall nation production makes the game feel well-rounded, and still heavily rooted in a grand strategy framework, despite the emphasis on brute strength and military expeditionary.If theres one area that a game like this must excel, however, its in the department of artificial intelligence. Without solid AI, a grand strategy title can be far too easy or far too difficult. In March of the Eagles, it strikes a delicate balance between the two, giving players challenging AI opponents, but not to the point that fists will be slammed into keyboards out of unrestrained rage.Regrettably, the localization isnt as glowing. Translations here can be especially shoddy, with a plethora of grammatical mistakes, missing words and incorrect spellings. This wouldnt normally be as big a problem, if this wasnt a game based around reading a shedload of text. The production values, especially the interface, can also feel hastily put together, though not necessarily bad, just lacking a bit of polish. In fact, while this is one of the better looking grand strategy titles, its still not much of a looker of a game  even with the limited visual flare that is present. The soundtrack is pretty stellar however, with all its brass and percussive ballads, so soundtrack aficionados wont be easily disappointed.Closing Comments:", "date": "February 22, 2013", "grade": 3.5}