{"name": "Hob", "ref": "https://hardcoregamer.com/?post_type=post&p=280326", "text": "2017 has been a year of many things, good and bad, but for some  those willing to put headlines and popular discussion to one side (were talking just video games here)  the return of the 3D platformer has seen many an attempt at rekindling a once-lost and seemingly-forgotten enjoyment. While the results have been mixed across the board  new faces, returning faces and old masters alike having a fair crack of the whip  reigniting a passion for many who grew up in the mid-to-late 90s is not as easy as it once was. Ignoring the natural advances in technology and the opportunities this leaves for developers to either take advantage of, the turn of the 21st century saw platforming evolve beyond its simple movement-based, collectible avidness. Branching out into sub-categories and sub-divisions, studios like Naughty Dog, Insomniac and even Team Ico helped shape and later pioneer.Platformers would find themselves separated into two distinct forms: the adventure-platformer whose key formula still retained that youthful wonder of scope, exploration and liberty of movementand the action-platformer wherein key, distinct, story-led moments became prominent  the very platforming segments a means rather than an overall end. Runic Games (or formerly Runic Games I should say, sad as it is to denote this as a now-closed studio) Hob undoubtedly falls into the latter category. Its tight, constrained routes and occasionally precarious situations, pitted less on the free-flowing nature of platforming and more on the narrative, as much the world, its trying to convey. And try it most certainly does with its overhead transitioning of one compartmented environment to the next, that is when its not trying its best to dazzle us with a clear focus on scope and spectacle.In some capacity  a capacity that shows Runic as a studio whom collectively share admiration for the world-building, epic spectacle Team Ico notably made their name for  Hob actually does well at fitting the bill of being both action and adventure. Its high-ascending platforming precariously tense when it wants to be; its need to discover and explore with its adventure aspects a keen fuel for those longing to know more of this strange alien world that is neither organic nor synthetic. Nor is it a perfect hybrid of such, never quite deciding on what it is thats considered man-made or is in fact a natural part or order to the surroundings. And at its best, the unravelling, almost clockwork-like rotary to its geological aesthetic  as much its puzzle-solving  certainly gives Hob plenty to accredit itself as standing out in a genre often attempting a more emotively-recognizeable art-style or color palette. As a result, the first few hours of Hob are an intriguing if not totally flawless experience wherein your player-character, simply referred to as Hero, must make his way through the locked-away and seemingly labyrinth-structured world that is without name nor any real degree of explanation. Sure there are cutscenes and there are distinct objectives one has to follow  not to mention equipment and power-ups to scout out in order to naturally progress in the first place  but as far as narrative, reason for what youre doing, Hob is surprisingly thin on crucial detail. Or any detail in fact. Initially, this lack of purpose and bound direction can be dismissed as the journey from one overhead surrounding to the next is intriguing enough. Theres little hesitation at the very name-drop of something as grand and as bold as Metroid Prime with how well, at points, Hob fuses its visual presentation and mechanical-like stature to make the puzzle-solving and platform-fumbling a bit more of a reasonable journey.But its roughly around the half-way mark  when an otherwise lack of significance or concrete story-telling as well as the inevitably repetitive use of simple button-pressing sequences  where Hobs true, unfortunate limitations kick in. This is without mentioning the rather basic combat the game tries to pass off as something critical to ones play-through but simply comes and goes in brief periods  shoe-horned in moreso with its simple sword-swipes, dodge-roll and melee hits. The combat mechanics even have their own means of upgrading ones abilities and adding new skill-sets to those you naturally acquire throughout your travels, but such is the passiveness and backseat presence it takes, the added incentive just feels like wasted space. The experience thereon only doubles-down with this same regurgitated process sadly. Continuing to hammer down the necessity to activate switches and follow particular paths, leading to even more switches to activate and buttons to press. Wherein one might mistake the game as eventually leading you to some pinnacle reveal or a crucial point in the story, but alas is but mere naval-gazing. Not quite pretentious, yet sadly a game that seems almost too pleased with itself  and seemingly its ability to replicate the awe and wonder of games past. There is a temporary charm and intrigue to be had when an activated machine has a particular section of platforming wind, skew and reconfigure itself to form a completely different shape or path to follow, but regardless of how elaborate the set-pieces may be  giant swathes of ground opening up or closing to reveal entirely new regions to explore  the process, as stated, nearly always remains the same.But if the utter lack of diversity with its puzzles is quick to grate once the former majesty of the games setting dwindles, the frustrating controls during such tight platforming sections, resurfaces at a near-lightning pace. On numerous occasions, therell be a perilous jump or timed reaction to get right that comes under heavy burden due in large parts to the games stiff sense of movement and odd juxtaposing of depth and distance. Even such simple means as a run-and-jump attempt are afflicted by Hobs control scheme; pushing a block becomes a wrestling match between yourself and the back-end automations that may assume you want to climb a block, when in fact you dont. Closing Comments:Though it pains to proclaim such a promising title as this  given how obviously ambitious its world-building stands, how undeniably strange-but-enticing its organic-mechanical aesthetic is or how inviting the otherwise isolating ambience of its sound design is  Hob may well be one of the more disappointing showings for the genre this year when all is said and done. What starts off in its first half as a platformer rife with engaging mystery and many an incentive to know more quickly devolves into a rehashed and seemingly never-ending loop of puzzles unlocking puzzles unlocking more similarly-deprived puzzles without fruitful meaning or purpose. Though it tries to maintain the facade and continually promise greater things to come, it soon becomes apparent that Hob is somewhat deprived of an end goal  interested solely in the long-distant allure than it is the up-close-and-personal meaning and value behind it all.", "date": "November 22, 2017", "grade": 3.0}