{"name": "Skulls of the Shogun", "ref": "https://hardcoregamer.com/?post_type=post&p=27642", "text": "There are very few games that start off with the main character dying, but Skulls of the Shogun does it honorably. This highly anticipated title from 17-BIT has been down a lengthy road, but its finally time for the next shogun to rise from the grave and take whats rightfully his. Snack on the skulls of the undead as this pre-modern Japanese influenced game looks to invade your console, phone and even tablet devices.Lets get this out of the way: Skulls of the Shogun can be difficult and discouraging early on. It seems heavily inspired by board games such as chess and checkers where, if you make one small mistake, you could be out on your ass starting from scratch. The main goal is to protect the General at all costs while strategically placing troops all around the field. It sounds easy enough, but once you realize how undermanned your team really is and how few turns are given each round, it becomes a battle of wits and definitely not something you can play erratically.When looking at what sort of experience this is, the most apt comparison would be a game such as Phantom Brave or the most recent XCOM: Enemy Unknown. The only difference between the two and Skulls of the Shogun, though, is that Skulls lacks any use of RPG elements. Each stage is set up with specific allies and parameters to work around from the very beginning. That isnt to say there arent any leveling mechanics at play, as there are other aspects in each battle that makes this far from your traditional strategy game. These include eating the skulls of your deceased enemies to become stronger, obtaining rice to buy more soldiers, and haunting grounds to recruit special classes that can, for example, revive a fallen ally. Its a fresh idea that is played out fairly well, although a concentrated mindset is needed going into each fight.The story is relatively straightforward: General Akamoto is stabbed in the back (literally) at the end of a ferocious battle and is sent to the afterlife where hes essentially treated like dirt. Here, he recruits a bumbling bunch of soldiers to help him reestablish his name as one of the greatest shoguns in the history of Japan  even though hes already dead. The single player campaign is one meaty adventure as each mission will generally take ten to twenty minutes to complete. Even when finishing a stage, there will be incentives and challenges to go back and try to win in a certain fashion. Who doesnt want a collection of golden skulls on your shelf?Besides the challenging gameplay, what really carries Skulls of the Shogun is its well-written and charming dialogue that brings each characters comical behavior to light. This adds to the lively and charismatic artwork as seeing undead samurai warriors beat the crap out of each other somehow never gets old. The visual sparkle is without doubt another strong aspect as the cardboard cutout characters and world brightens up a rather grim outlook on death.Its also the subtle visual aesthetics you dont realize, such as the rips in a soldiers flag helping indicate their health, that makes this a gripping graphical journey, whether you know it or not. Unfortunately, a lot of the enemies and even different classes can look too alike, especially in the early goings of the single player campaign. Its mainly only the monks who stand out the most, but even they sometimes can blend into the battlefield. The same can be said about the stages to a much lesser degree. While theres a strong variety, spanning from luscious cherry blossom forests to the frigid snowy plains, most of the levels tend to reuse many assets, no matter how varied their placement may be. Thankfully, the linear progression helps keep the players attention as once an abundance of environmental elements are seen, something new is moved onto.Another large aspect to Skulls of the Shogun is its online multiplayer. While it may not be bursting at the seams with a variety of modes, it does have interesting cross-compatibility with Windows 8-based phones and tablets. We have your standard deathmatch and team deathmatch supporting up to four players locally and online, but its the commonly small options, such as how much time you set for each turn that makes a battle either a chaotic or strategic event. One of the more intriguing features packed into the game is the Skulls Anywhere mode, which grants the ability to play multiple games at once through asynchronous networking. This allows gamers anywhere to upload their moves, turn by turn, during an extended match and come back to it whenever they please.Closing Comments", "date": "January 30, 2013", "grade": 4.0}