{"name": "Labyrinth Legends", "ref": "https://hardcoregamer.com/?post_type=post&p=24052", "text": "Theres only two things dungeons really need to be worth exploring- monsters and puzzles. Throw plenty of each in, making sure each has equal time and are equally fun to deal with, and youve got an irresistible bundle of pure gaming satisfaction. Labyrinth Legends pulls off this formula perfectly, and is so fantastically playable its was worth putting up with the persistent control bugs that popped up from the very first level.The story is as basic as gaming stories get, in that your bride has been whisked away by a nameless evil wizard Im going to refer to as Bowser from here on. Theres no reason given for this abduction, or why Bowser dumps her in various dungeons throughout the land, but thats fine. Any excuse to go spelunking in the dungeon depths is welcome, and rescuing your (strangely bald) bride is as good as any.So, with true love as your goal and endless obstacles in its path, its time to take out the undead legions and solve the many puzzles each labyrinth holds. You start off with all abilities available, although initially decked out in your wedding tuxedo and wielding a club, and upgrades come in the form of armor and a better weapon that are instantly visible on our hero as theyre collected. Combat is pretty simple, consisting of a single attack you can either spam repeatedly or charge for a mega-hit, and a spin strike that sends enemies flying. Theres also a dashing charge useful in a large number of combat and puzzle situations, plus a block button. Its a little bit more complicated than Gauntlet, but not by much. The enemies initially come at you two or three at a time and eventually descend in huge swarms, but a little bit of care plus attention to environmental hazards clear them out with a minimum of lost health, leaving an empty room behind with a puzzle or two to solve as your reward.Each dungeon has five stars to find, and the first three are, basically, free. The last two are hidden, and the puzzles to uncover them range from tricky to fiendish. Hidden doors are all over the place, usually leading to a pile or two of gold but sometimes hiding a key or even a puzzle room, because the reward for discovering a secret should be the opportunity to uncover another one. Puzzles come in as many varieties as possible, from block-pushing to timed mazes, light beams and hidden triggers, traps that require clever use of the dash move to avoid, and many, many more. For every couple monsters you take out theres another secret to uncover, and while earning enough stars to unlock the final boss fight is easy enough, opening up the bonus dungeons is going to take some obsessive searching.What would have made the game more fun, and earned a full extra point on this review, would have been if the controls hadnt been so glitchy. Basically, The Hero wanders off even when the joystick isnt being touched, as if the dead zone is incorrectly configured. Its beyond aggravating when all you want to do is stand still on a moving platform and Hero decides suicide is a better option. Standing still and doing nothing isnt a lot to ask, but apparently this requires holding down the Block button at all times, except when Hero decides to ignore this request as well. The downside is that sometimes the block animation gets stuck, leaving you wondering why you cant move until remembering that, oh right, the controls are busted. Fortunately the workaround for that problem is hitting the block button again, which jolts the Hero out of the stance and back into action.", "date": "January 4, 2013", "grade": 3.0}