{"name": "Under Defeat HD", "ref": "https://hardcoregamer.com/?post_type=post&p=19790", "text": "Its been years since Under Defeat first came out, and the zero percent chance of a US release is finally a thing of the past. Under Defeat HD finally brings the lost shooter to our side of the Pacific, updating it with full 16:9 support and a shiny new coat of paint. Aside from the graphic upgrade, however, this is still the same excellent shooter its always been, and easily deserves its place alongside the best of whats available today.Under Defeat HDs story has something to do with war, nation versus nation, and a last desperate push by both sides of the conflict in the face of a coming cease-fire. This fictional world doesnt have Israel and Palestine around to teach them that a cease-fire is more of a war-time mini vacation than any real end to hostilities, apparently. Still, other than a paragraph games start, none of this matters. The real story is much simpler- Once upon a time a helicopter laid waste to everything in its path with a combination of slick flying and heavy firepower.The advantage of an attack chopper is that it doesnt need to fly in a straight line. While the action is the standard vertical scroll, with the occasional diagonal for variety, the chopper itself has limited rotation. When youre not holding down the fire button, moving the chopper left or right causes it to rotate, and then holding fire locks the angle in place. It takes a bit of practice, but once youve got the hang of rotation it becomes much easier to target enemies on the other side of the screen than it would be having to fly through a stream of bullets while shooting straight up. The gameplay rhythm quickly becomes one of carefully directed streams of fire, maybe making due with a slightly bad angle rather than stopping firing due to the volume of destructible clutter on screen. Those enemy tanks and helicopters are shooting back, and therefore of primary importance, but you cant really let all those harmless ground targets just go by un-destroyed, can you?Fortunately, you dont have to do this alone. Your helicopter comes equipped with a drone that will automatically target enemies for a brief while before disappearing, waiting to be summoned again. Once the cool-down time is reached, in a reasonably short period of time, you can charge by not firing while a green bar quickly fills, and then start shooting again with a helper. One wrinkle in using the drone is that it materialized at the angle you started shooting, adding another small layer of complexity in dealing with the choppers rotation. The other thing to remember is that power-ups dont directly effect you, but rather indicate the kind of support drone youll get. Finally, anything killed by a drone gives 2x score, so youll want to use them both well and often.Once you get used to managing the various abilities, its time to stop dying and start laying down some heavy destruction. Under Defeat is not an easy shooter, and even level 1 can hand you your head the first several times through, until you get used to the helicopters handling. While the hit box is relatively small in relation to the choppers size, its still much bigger than the single pixel that the average bullet-hell protagonist has as a vulnerable point. Enemies are also not shy about sending back a heavy volley of return fire, and rather than waste bullets on pretty patterns they zone you in and aim for the kill. Under Defeat wants you dead, and if you clear a level of all enemies and targets its because you earned it, rather than the game making you feel awesome just for showing upAs fun as it is to shoot through the levels and learn the patterns of various epic set-pieces, there is one non-game related issue that does need to be mentioned, and thats the menu system. The top menu lets you choose New Order ( the 16:9 version) or Arcade (the original) plus practice modes, and also select your ship. There are four ships to choose from, two identical in all but color and the other two being unique. You select your ship in the top menu, back out, and then choose game mode, and if you want to switch ships, its back to the top menu you go. Additionally, theres no indication either in the manual or in-game as to what sets one helicopter apart from another. One of the ships doesnt use drones, but rather equips power-ups directly. Which one? Theres no way to tell until you experiment. On the plus side, thats more of an early-game issue, and it will go away with experience.Closing Comments:", "date": "December 3, 2012", "grade": 4.0}