{"name": "Aero Porter", "ref": "https://hardcoregamer.com/?post_type=post&p=19495", "text": "The second part of the Guild01 compilation has arrived on the eShop. Instead of Suda51 providing shooting action with Liberation Maiden, you get AIRPORT SIM ACTION courtesy of Yoot Saito, Seamans creator. Airport sims may seem a bit odd, but they arent entirely foreign to gaming  Aerobiz and its Supersonic sequel hit the 16-bit systems to critical acclaim but few sales. Luckily, Aero Porter only costs $5 instead of $60, and is far more appealing as an impulse buy at that price point.Aero Porter is structured around a luggage-sorting game that is tough to explain, but very easy to enjoyfor the most part. Your goal is to move color-coded luggage to the correct lane of a variety of possible ones  starting with three and moving to seven. L moves the left ramp up and R moves the right one down. If bags are close to each other, you have to have precise timing in order to only move one of the two pieces of luggage or else have to wait until it comes around again, hurting your score. After a while, youll hit a certain level of luggage entering the plane for each color, and then move onto the next wave. Along the way, youll have a variety of extra challenges thrown at you. Easy ones involve using lights to make the job easier to see, but run down the fuel levels faster.Then, youll run low on fuel and have to move a container of it from the top of the screen to the bottom while also sorting luggage. Things like VIP luggage taking priority and bombs enter the picture one after the other and complicate matters greatly.The pace ratchets up quickly, so avoiding mistakes is paramount. I like the idea of every task adding to the challenge, but a gentler curve wouldve been nice. Youre just thrown into the deep end after very little play time, and simply have too much to keep track of at any one time. It becomes a herculean task to sort out just the new problem, let alone that and all the luggage. Having the action take place on both screens only adds to the insanity, and the experience can quickly go from fun to frustrating due to the sheer amount of things happening.Youll yell, curse, and want to quit, but after a few hours , get the hang of things  perhaps not perfectly, but at least well enough to slowly sort out the colors amid the craziness. Doing just that can enable you to rack up combos that will allow you to progress in lieu of harder tasks like pleasing a VIP, which means you can move on and expand your operation. Getting to that point means you can get bigger (and busier) aircrafts and best of all  CUSTOMIZE THEM. If you want to make something that would look right at home at a modern airport, you can, or something can be crafted with a bit more life to it, like a camo-covered plane or better yet, THE SOUL PLANE.Other than designing the soul plane, there isnt much to get excited about with APs graphics. The menus are simplistic, as are all of the in-game graphics, which resemble charts and graphs given their circular design and bright color schemes. Simple isnt always bad though, and if things looked fancier, it would be even harder to tell whats going on. Similarly, there isnt a whole lot going on with the audio, but the largely airport sound effect-filled soundtrack fits the theme, and what little music is used is enjoyable to hear.Closing Comments:Since Aero Porter only resembles a traditional airport sim, its hard to recommend for Aerobiz fans, but those with an affinity for fast-paced puzzlers will probably like it. Its certainly not a graphical showcase, but theres a lot of enjoyment to be had once you get past the crippling difficulty spikes. Its a lot more fun than a baggage-sorting game sounds, so If youve got the patience, give it a shot.", "date": "December 1, 2012", "grade": 3.0}