{"name": "Chasing Aurora", "ref": "https://hardcoregamer.com/?post_type=post&p=19422", "text": "While the current Wii U eShop is a mess to navigate, its worth suffering through for Chasing Aurora. Reminiscent of Flower, its the most relaxing experience Ive had with the system. Instead of playing as a gust of wind going into flowers, though, youre a bird partially propelled by gusts of wind. Youll also get around by flapping your wings, but unlike something like Balloon Fight, where you want to do that as much as possible, here, you need to do it carefully. Theres a rhythm to the flaps and just hammering the A button wont help you. The whole flap must play out and let the wind carry you when its gusts shoot through the level.At first, its a little weird because your natural gaming instinct tells you to just hit a button a bunch to do well, but then you get a low score and realize hey, thats not working  try something else. Luckily, since the solo game is just racing laps around a point-to-point track, it doesnt take long to realize that slowing down and thinking a bit will actually speed things up. It also helps a lot that the left stick on the Gamepad is so comfortable that it makes moving your bird around incredibly easy. Hell go exactly where you want him to when the wind isnt involved, and the controls feel very fluid and natural. The lap structure and use of a multiplier for the gates makes it feel like an odd, but fun hybrid of racing and shooting games. Each stage has a very distinct look and feel to it with some giving you no obstacles, but featuring a lot of turns requiring you to pay attention, while others give you longer straightaways, but will have things like rocks cascade down from the heavens to block you. Later levels add in things like water and dirt that youll need to carefully get through to avoid losing too much time. If you dilly-dally, youll go threw fewer gates, which results in a lower score. If you just want to play through the stages, youll be done in relatively little time, and also be missing the whole point of a score attack game. The fun here comes from finding that perfect groove, building up your multiplier, and hitting as many gates as possible so you dont nearly reset the thing. The thrill comes from seeing your star ranking go up from one to two, before (hopefully) reaching the elusive third star. Its a shame that this score-centric experience doesnt have online leaderboards or multiplayer. Also, while the game itself is a lot of fun, the presentation it is hurt by long loading times between stages and an incredibly long 30 second or so boot-up sequence.That issue is compounded in multi-player sessions, especially if youve got some impatient players in your group. There are a variety of multiplayer modes available, but due to a Wii remote shortage, the only one we were able to try out was the two-player hide and seek game. Given that only one player can use the Gamepad, the other person will have to use a Wii remote, or a remote/nunchuk combo. Neither are quite as comfortable as the Gamepad, but get the job done. In hide and seek, the Gamepad player takes control of a golden bird and the remote user(s) have to find it. Doing so is difficult without an on-screen map, and you arent given much of a clue as to their location unless youre really close to them. If you happen to be right next to the Gamepad user, the best method is to just quickly sneak a peak at their screen and try to figure out where they are that way  the similar-looking parts of the environment mean that it wont automatically guide you, but will still give you some assistance.With an art style reminiscent of the Pixeljunk seires, CA is a massive treat for the eyes. The graphics are incredibly colorful and have a beautiful cartoon style to them without a black outline. Little touches like all of the gradation in the clouds are impressive as well. As stunning as it looks in screens, it manages to look even better in motion, with beautifully flowing gusts of wind and bird flaps. There isnt a lot of animation, but whats here is done really well. The levels have distinct color schemes, and little flourishes like lightning in the background changing the lighting stand out. The best term to describe the music is subdued. Its usually slow-paced and melodic, while some stages have drum thumps throughout them, and others have no music whatsoever and just let the sound of the wind carry the audio. Its almost impossible to think of a modern-day game not having some music, but on occasion, it works wonderfully here. Closing Comments:", "date": "November 30, 2012", "grade": 4.0}