{"name": "Far Cry 3", "ref": "https://hardcoregamer.com/?post_type=post&p=18825", "text": "Its a lovely sunny day on the island, and the soldiers at the enemy outpost seem to be enjoying the nice weather. As they lazily stroll back and forth, keeping a half-interested eye on the surroundings, Im circling the base to get an idea of how many enemies Im going to have to kill. Ive got my camera out, so that when an enemy is spotted it gets a target over its head and I can permanently track him even through walls, and after a bit of careful recon I can tell the place is lightly staffed. Two sets of two guards are on each entrance, plus a single scout on a raised platform. While its a tiny outpost, if they see me theyll be rushing to pull the alarm and bring in a world of well-armed backup. As Im scouting the perimeter for cover, though, I notice the tiger.The tiger is in a cage off to the side, most likely to be sold off to the highest bidder. These people are involved in the slave trade, and a bit of oversized pet supply makes for a nice sideline business. It also means dangerous creatures are not their friends. Pulling out my silenced sniper rifle, I put a round in the cage door, instantly opening it and letting loose the striped fury. The guards spring to awareness instantly, but this isnt the kind of threat requiring an alarm. It is, however, the kind of threat that kills them dead with a minimum of fuss, except for the scout on the platform. He takes a second bullet from my sniper rifle, and with that, the base is mine. Not every victory will be that easy, of course, but it does show off the flexibility Far Cry 3 gives the player to handle situations. I could have ignored the outpost and let its goons control the area. I could have put a bullet in the alarm box, then charged in full Rambo. I could have distracted them one by one, leading them outside the observation range of their allies to silently dispatch them with a knife strike, which also has the advantage of offering triple experience for the kill. Alternately, I could have tried to be sneaky, failed, had the alarm go off as I dealt with the threat in front of me, and then had my face shot off. That last option has happened more than a few times, actually.Far Cry 3 is a game thats happy to let you make the decisions. While the missions tend toward scripted scenarios, the time between them is yours to play with as you will on the islands wide-open terrain. Slavers have your friends and will be ransoming them to their parents, keeping the money, and selling them to the highest bidder? Thats all very important, but upgrading your weapons carrier so you can lug around a few extra guns is going to take a couple in-game days worth of hunting. Theres enemy outposts to capture to both break the enemys hold on the area and provide a convenient base of your own, treasure to hunt, caves to explore, and items to craft. Your friends will understand, probably. The island is distracting, and theres dozens of tasks available at any given time. Its hard to make a beeline to the next plot point when it goes past a hunting ground of an animal whose skin you could use to craft a larger backpack, which leads to finding a hang glider sitting at the top of a cliff, and then you land in the ocean and go deep diving for relics.Thats not to say the plot isnt engaging, though. Jason and his friends are captured by friendly neighborhood psychopath Vaas, who shoots Jasons brother dead during their escape. Now Jason is going to have to learn the islands secrets and work with its people in order to rescue his friends, and its a well-rounded cast of locals, and crazies, and mystics. The narrative does suffer a disconnect with the player actions in the early going, though.Basically, once youre set free from the first few tutorial missions, you can either rocket straight into the next plot point or explore the island to your hearts content. While there may be a player or two who needs to know whats going to happen next, most people will want to poke around a bit to see what they can get away with. At this stage of the game, though, Jason has just killed his first enemy and is still queasy about the idea of taking human life. So what do you do when left to your own devices? Kill a couple dozen bad guys to practice the combat, either long distance with a gun or close and personal with a knife to the throat. Next cut scene and Jason is still a little iffy on the whole killing thing. Its a moment that turns Jason into a him instead of me. It makes narrative sense, of course, but until Jason is toughened up in the story, the character in the cut-scenes is very different from the one you play.The story is the driving force of the game, though, but the percentage of time following it will probably be fairly small compared to that of screwing around. Far Cry 3 is an open world game that just happens to be set in first-person perspective, and while the story is a decent one, it primarily serves to ration out Jasons abilities so you dont become God-Tank before taking on the first non-railroaded mission. Wandering the island and finding everything it has to offer is just fun to do, not only because its a very pretty section of the world but also due to how much entertaining it is to screw with enemies. Throw a rock to distract them and knife them from the back, or set a fire on one side of a compound and sprint to the other while theyre dealing with it to shoot them in the back with a silent series of arrow strikes. Theyre just smart enough to be fun to play with, while being dangerous enough that you have to take them seriously.Dangerous as the enemy can be, though, Jason has one advantage over them that can be very hard to overcome, and thats the function Ive come to think of as the I dont wanna die! button. Jasons health bar is divided into sections, and if youre wounded it will auto-heal back to the top of the section unless you use a healing syringe. The basic syringe restores two bars of health, but if you run out of syringes thats ok too. When your health is depleted, a quick press of the triangle button allows Jason to self-medicate, restoring a couple of health bars instead of dying. Its a small window of opportunity, and if your hands arent free due to reloading or being on the ground with at tiger eating your face youll miss it, but in the average firefight its going to save your skin more than a few times. Its also eventually going to feel very cheap, and rob sloppy play of its consequences. Why bother to play well when you can just hit a button to not die?Closing Comments:", "date": "November 21, 2012", "grade": 4.0}