{"name": "Call of Duty: Black Ops II", "ref": "https://hardcoregamer.com/?post_type=post&p=18269", "text": "The annual franchise thats sending Activision to the bank upon every release is back once again, but instead of creating a modern epic, Treyarch has decided to chop the campaign up in telling two interconnected storylines during two time periods. Its a series that hasnt gone through many changes in its lifetime, but theres certainly something to be said for creating a good formula and building on it over the years.Black Ops II takes place in multiple eras, but the central story is set in the near future of 2025 where gamers take control of David Mason, Alex Masons son. While theres political conflict and chaos occurring in the world, as Chinas monopoly on 95% of Earths rare minerals hasnt boded well with the rest of the planet, David is hunting down a terrorist who is causing a ruckus and threatening the world as we know it. There are significant enhancements to the story in Black Ops II that, while mainly require running and gunning, are a step up from what weve come to expect from the Call of Duty franchise. Thats not to say past games havent had compelling conflicts, but the single-player campaign here has fantastic story beats that brings more of a revenge tale to the masses over traditional kill a man because hes bad ideas.With that said, the 1980s sections where you play as Alex Mason are probably the least interesting parts of the game. It does contain some intriguing factors that dive into the psyche of a broken man, on both sides of the fence, but most of the action scenes and scenarios lack excitement until the last few missions. Sure, there are explosions going off every which way and bullets whizzing by your head, but its the beautiful environments and toys you get to play with in the 2025 sections that make this a standout title. When you go into a luscious city filled with beautifully constructed futuristic architecture, it becomes interesting to see what Treyarchs perspective is on how the world will change in the next thirteen years.While this is still very much a Call of Duty title, as you will find yourself aiming down the sights and shooting at anything that moves, important changes have been implemented thatll shape how the series will move forward. Probably the biggest new addition to the brand name is player agency. While previous games have had narrow storylines as an excuse to go from point A to point B, Black Ops II to mixes it up a little, adding multiple ways the campaign can play out. Little things such as not shooting someone in time or eavesdropping on an hidden conversation will actually matter, as events later in the game will change based on those instances. It`s a surprising new feature to see in any first person shooter, let along this one, and for the first time ever in any Call of Duty game, I`ve had the urge to go back and play the story again in order to see what the consequences are from different decisions.Replacing Modern Warfares Spec Ops is Strike Force missions, which essentially put players into a Full Spectrum Warrior type mode with full control over infantry and machinery, plus the ability to jump into able bodies to play in first-person. Its a nice change of pace, but isnt particularly stellar compared to the rest of the game. It would have benefited greatly with cooperative multiplayer, as most of the missions mainly require securing a position, destroying something or killing someone. The biggest problem here is that the teammate AI is just dreadful. Watching from above is a great concept at first, but isnt implemented very well, as the squad of soldiers you have control over may as well be mindless zombies. They wont always go to the spot theyre told to and generally die incredibly quickly, which shouldnt happen when youre in control of someone. The concept is interesting as it does tie into the main story with different characters, but it would have been better suited as main mission objectives with a lot more polish.Most gamers that buy Call of Duty isnt doing so for the single-player campaign, and theres a reason for it: it features a well constructed multiplayer experience. One of the biggest reasons the multiplayer modes work as well they do is because of the established user base where gamers will have access to a number of matches instantaneously. While this mainly remains the same, there have been tweaks to the overall leveling up and equipment systems that should be create a number intriguing custom matches. Its an incredibly addictive and explosive experience that will give fans months  even years  of entertaining combat before switching to the next great thing.Zombie mode, the other multiplayer mode that Treyarch first introduced in World at War, is back and same as ever. It may not have Michael Rooker (which the single player campaign has instead), but it retains its arena based combat that doesnt really do much outside the box. Its round-based combat that, while does include a number of areas, is only fun when a bunch of people are playing together who havent played a game such as Left 4 Dead or Dead Island before. Even then, it feels unnecessary and distracts from the real meat of the product.Closing Comments", "date": "November 14, 2012", "grade": 4.0}