{"name": "F1 Race Stars", "ref": "https://hardcoregamer.com/?post_type=post&p=18134", "text": "In an age where near photo-realistic graphics and lifelike car handling have been achieved, its ironic that the most casual form of racing possible (outside of maybe potato sacks) still moves product. Developers can add all the body detail and engine tuning they want, but its hard to beat the simple thrill of driving around in circles lopping turtle shells at go-karts. While the genre has primarily been reserved as a way of bringing pre-established gaming franchises into the racing fold, F1 Race Stars is grounded entirely in reality. Instead of a serious take on the genre, however, the game transforms real racers into the kind of characters you would expect to see driving a go-kart. Its certainly a risk to put F1 racing bobbleheads up against outings from Sackboy and Sonic (both of which came out within the same week), but its one Codemasters seems confident in taking.F1 Race Stars features a whopping twenty-eight characters to select from, all but four of which are real-life Formula 1 racers. Four characters arent real due to the fact that female F1 racers are largely nonexistent and Codemasters wanted to ensure some girl power by adding three females; why the fourth made-up racer is a male named Josh Merit is a mystery. Fans of the sport will instantly recognize names like Nico Hulkenberg, Mark Webber and Timo Glock, all of which are adorably rendered in a cartoon style with giant heads and tiny torsos. Every current F1 driver is represented in the game ensuring that fans can race as their favorite teams.The game uses a basic formula that anyone whos played Mario Kart will instantly recognize. After selecting a racer, players take to the track to battle it out in go-karts. There are 1-3 laps in each race and power-ups can be collected along the way by rolling over color-changing stars in the middle of the track. Power-ups mainly consist of different color bubbles like Trap (blue) that are dropped behind the kart, Ricochet (yellow) launched forward or backwards and Seeker (red) that hone in on the next racer ahead. If a racer gets hit by a bubble, they get stuck in it for a few seconds before being able to move forward. While the system works well, its completely derivative of Mario Karts Koopa shell system and a lame way to do it at that. Out of all the projectiles that could have been chosen, its strange that bubbles  possibly the single most harmless thing in the world  were decided upon. There are other power-ups included, such as balloons that throw confetti on the screen when run over (again, not very menacing), but nothing unique enough to set F1 Race Stars apart from its counterparts.The driving mechanics are very similar to other kart racing titles and handle well. Steering feels responsive and karts move at a brisk pace. The only issue is cornering, where karts need to be nearly stopped in order to take tight turns. Having to break constantly in tough tracks takes a lot of intensity out of the races. There are eleven tracks to choose from that boast surprisingly inspired course design for a budget racer. A track in Italy, for instance, features rushing through city streets while another course runs straight through a castle. The graphics and sound are serviceable for a budget title, but dont come close to matching the best the genre has to offer. Multiple race modes are included, the highlights of which are Elimination and Refuel. Elimination is a standard race where whoever is in last place gets eliminated every 10-20 seconds until only one racer is left. Refuel gives karts a limited amount of gas that must be refilled before the kart stalls. There are multiple gas icons that fill up the tank when rolled over, but the more fuel accumulated, the slower the kart goes, encouraging pushing on empty as far as possible. With multiple modes and online multiplayer to boot, theres an impressive amount of lasting appeal for those who dont tire of the gameplay.Closing Comments:", "date": "November 13, 2012", "grade": 3.0}