{"name": "Okami HD", "ref": "https://hardcoregamer.com/?post_type=post&p=18097", "text": "Despite Clover Studio, arguably one of the best developers last generation, being shut down over five years ago, Capcom isnt going let their properties collect any dust. Okami was one of the most beautiful and adventurous games not called Zelda that contained an incredibly ambitious storyline with a comical set of characters. Capcom has decided to bring the prestigious title into the high definition era, ensuring that love for the game doesnt go forgotten.Those who played the game when it hit in 2006 will be right at home. Okami is about the goddess of the sun Amaterasu who saved the world from Orochi, an eight-headed demon, and has been resurrected to once again take the creature down. In order to do this, he must team up with a hot tempered bug and traverse the world to blossom all of the dark and tainted areas. Using her thick skull and calligraphy abilities, Amaterasu will headbutt and cut her way to save the world once more from an ancient evil.What Okami does great is incorporating Japanese Shinto lore and myths into the story that most western players will most likely not pick up on. Slight references from Torii gates at sacred locations to specific characters in The Kojiki come into play and if you know about the religion it gives a sense of enjoyment seeing a new (fake) myth created before your eyes  or at least modified. It also uses a lot of Japanese aesthetics such as calligraphy, traditional clothing and architecture, classical music, and so much more. I have great respect for what Okami brings in its fiction as its very much in its roots a Japanese story.Combat is essential to Okami as Amaterasu will find herself in constant battle with Oni demons and unknown creatures. There are a number of mechanics that come into play, but for the first half of the game, the square and R1 buttons will become your best friends. There are a handful of hidden and not particularly well explained abilities that can be bought or found, but it mainly comes down to smacking your opponent around until they put up their guard or become off balance, and then slicing them into tiny bits. Its a fun formula that works well, and it progresses more as the story pushes forward, with relatively difficult boss fights and ugly new monsters.Unfortunately, while the game has aged well overall, there are some spots that have not. Im aware its difficult to go back and change the code, but the biggest downfall to Okami is the inability to skip or quicken conversations. The opening may turn a lot of people off only because its a ten to twenty minute long cutscene that cannot be skipped or progressed any faster than its set to. It would have been nice to have an option to skip a number of scenes in the game as, even if its beautiful to look at, it can drag at times.While its a slow burn, after you get past the hurdle thats the beginning of the game, the pacing is surprisingly well done. It ensures gamers will not become bored, offering new and easy to understand mechanics all the way through the campaign. The world is also massive, creating a sense of awe and exploration thatll have you adventuring through many different terrains, dungeons and towns. It may seem small in scale at first, but once it opens up a bit, its a massive game thatll take most players anywhere between thirty and forty hours to complete. Very few games have you playing as an animal, especially one on four legs, so Okami is a breath of fresh air.Six years since it first hit the Playstation 2, Okami is still drop dead gorgeous. Converting the game into 1080p has never looked better as the cartoon cel-shading visuals bring beautiful colors to your HD setup. Its a bright and vibrant experience thatll make you question why there hasnt been many games this artistically astonishing this generation. It also helps that the framerate is smooth as butter, creating a game that feels as fluid as a stroke of the brush. It may not be the most technically savvy game, but it certainly is the most charming in aesthetics.Closing Comments", "date": "November 12, 2012", "grade": 4.5}