{"name": "Smart Girls Playhouse Mini", "ref": "https://hardcoregamer.com/?post_type=post&p=17718", "text": "To say that I was surprised when I realized Id be getting something created for little girls for review would be an understatement. Once the initial shock wore off, I remembered that I was given a Bratz GBA game to review as a gag many years ago and figured I might as well give this a chance. After all, UFO Interactives put out some good stuff on the eShop and while I dont expect this to be up my alley quite as much as Johnny Hotshot, it does at least deserve as fair a shake as I can give it.Having mini in the title threw me off a bit, and I originally thought it was just called that because its so small. Its easily the smallest game I have on my 3DS except for some NES games. However, that would be a weird thing to name a game after. It turns out, its named that due to it having six activities to take part in. Im not quite sure if they can all be categorized as mini-games, though. You can draw using a primitive, but very easy to use touch screen drawing program. Its sub-MS Paint, but for something in a kiddy title, its fine. It could certainly come in handy if youve got a bored kid on a long road trip that wants to draw. This prevents any ink or markers from spilling all over a car, and is one of the only things in here that anyone can enjoy regardless of age or gender. The same can kind of be said about the coloring book pictures, although to a lesser extent since youre just coloring something and not creating it. The color palette is fairly robust and allows anything in the picture to be painted whatever wacky color is desired. If youre in the mood to have a giant orange and red dog against a purple sky with black and blue clouds, go for it. These are easily the best parts of the game, which has four more mini-games of varying quality.The best of the rest is a counting game where youre shown an object and need to count how many of Item X there are. Since there are ten squares with something in them, sometimes another item and sometimes a question mark, you can just count how many times the item does or doesnt appear and tap the correct multiple choice answer on the bottom screen. It reminded me of a very rudimentary Brain Age test, and thats not really a bad thing. Theres a spot the differences in the pictures game that makes use of the dual screens perfectly. The photos arent really all that good, but its a functional version of something youve no doubt played either on a phone, a tablet, or in your web browser by now.Things take a turn for the slightly odd with the lunch box-packing mini-game. Here, you can pick a design (Im partial towards the silly monkey one), a lunchbox color (gotta go with yellow for banana-munchers), and fill its four compartments with food. Youve got the option to pack some junk food or a healthy alternative and then see your little girl avatar walk with it thanks to the miracle of limited animation. Hanna-Barbera would be proud; the food pyramid, perhaps not as much. The final game involves playing dress-up with a little blonde girl. You can pick her hair and clothing. There arent a lot of options, and youre basically just changing her from one generic-looking blonde girl into another. This was kinda weird to partake in. I can see this being enjoyed by either little blonde girls or brunette girls who hate little blonde girls and want to make her look ugly, or at least make it so her outfit doesnt match.There isnt a lot to talk about with the graphics that hasnt already been said. Everything about it reeks budget game, nothing looks all that polished, and some of the art could easily pass for something made by the games target audience. Musically, the soundtrack is full of cheery music that sounds fine, but like the graphics, seems to have been done on the cheap. This point is driven home by the use of public domain music like This Old Man and Old MacDonald Had a Farm that I honestly never expected to hear in a video game.Closing Comments:", "date": "November 8, 2012", "grade": 2.5}