{"name": "School Girl/Zombie Hunter", "ref": "https://hardcoregamer.com/?post_type=post&p=279780", "text": "Sometimes we immediately know something is bad but explore it anyway hoping that it crosses into the realm of so bad its good. This can happen, as was the case with the cinematic triumph of The Running Man, but more often than not bad things are just so bad they remain bad, like any video game related Uwe Boll film, though we have discussed doing a retrospective of his work in a series of articles called the Summer of Boll$#*!. Naturally, when one takes a game set in the same universe as Onechanbara that features adolescent girls in school uniforms packing heat and fighting zombies, there is no expectation of goodness, especially with a title as generic as School Girl/Zombie Hunter, though the homage to some up and coming band called AC/DC in their logo is a nice touch. The question is does SG/ZH cross into the realm of campy guilty pleasures or is this something that should be cremated, buried and forgotten?The basic premise is the world is in some state of zombie apocalypse, and the player is at a school where five girls have survived and they are the only hope at thwarting the shambling undead. There are a few odd things right off the bat that are noticed. One is that in the options menu the color of blood can be changed from red to black, green, white or pink. The default weapon is the school issued handgun, which seems odd since SG/ZH seems like it takes place in Japan and I thought only Chicago issued handguns to its public school students. For a game set in the Onechanbara universe it seemed our female gunslingers were dressed quite modestly, that is until a random button was pressed and her uniform was thrown at the walking dead to use as bait and she continued to run around the scenario in her underwear with a flashlight strapped to her midsection, which seemed like an especially peculiar choice for an under garment. It also seems oddly fetishistic of the zombies to go after the school uniforms and ignore the half naked young women. This theme continues throughout the games progression. The different girls gain experience levels by killing zombies, and after a stage is beaten it can be replayed with any unlocked character to level grind. Different types of weapons and outfits get unlocked, and the characters are able to equip multiple guns at once and cycle through them such as assault rifles, submachine guns, rocket launchers, shotguns and sniper rifles. The outfits dont really effect anything besides the appearance, and to coincide with the horror themed fan service clothing shows visible signs of falling apart as the characters receive damage. Special items are acquired during gameplay such as AED devices, health packs, hand grenades and about midway through the game the players gets the underwear trap item. Basically if a girl has been wearing a pair of underwear for 10 minutes game time, she can take a shower and the underwear becomes a powerful piece of bait for the zombies. Ill let your imagination figure out the logic behind how that works (Editors note: ew).From the previous paragraphs, if the title didnt give it away, SG/ZH is not a high brow AAA title, but does show the potential of being enjoyable on a risque B-movie type of level. The problem is it only shows potential to do this. Depending on the type of stage there is anywhere from a three to fifteen minute time limit, and there are cutscenes of dialog before each stage. These sequences are all far too long for the lack of entertainment they provide, and the stages are either find so many keycards where one is usually hidden on each floor of stage, kill so many zombies, find a destination or defend the base. The stages are short, but in order to artificially extend the game length they require multiple playthroughs to collect all the items and get the girls to an appropriate level to progress through the next stage and level grinding is done at a lethargic snails pace. SG/ZH could actually be fun if the gameplay mechanics werent completely janky. The control layout is awkward, with the left shoulder buttons being used to jump and run, the gun is zoomed in the X button and aimed with the right thumbstick. The camera hates you and everyone you love and stops at nothing to obscure the most logical part of the screen to focus on. The actual controls are very loose and wonky sounds like the best word to describe them. Boss fights are frustrating because dodging their attacks, aiming and actually fighting them is done with the grace of a drunken elephant while the zombie clones or C rate Nemesis knock offs have the grace of Russian ballerinas. The frustration of the combat incompetence of a karate black belt and top student of the kendo club continues outside of boss fights. The spinning melee attacks have the accuracy one would expect of Stevie Wonder trying his hand at trap shooting. Plus two or three attacks will drain the stamina bar, so one has to question how much training they actually had with these weapons. When a guns ammo is depleted the girl will not reload unless the player hits the fire button, which causes a refill bar to appear that restarts if she is attacked. The stamina limitation and time to reload would be fine if the controls and mechanics were good to begin with, but when the struggle to hit a target one foot directly in front of you is real any other restriction is utterly annoying.Visually the graphics look like a budget title for the middle of the PlayStation 3s life cycle, and while the music doesnt cause ones ear to bleed it sounds like elevator muzak remixes of Onechanbara Z2s soundtrack. The dialog is simply boring, and while it is voiced in Japanese with English subtitles this is actually a positive factor since the quality of the rest of game indicates that an attempt at localized voice acting would only make things worse. Loading times are also ridiculously long, which makes having to retry a mission due to failure or leveling grinding that much more of a chore. A lot of the loading screens are just pure black, so during the review there were a few times I had to wonder if the game had crashed. On the plus side, the download file size is only 1.7 GB, so it doesnt take up too much space on the PlayStation 4s storage, but maybe if they crammed a few more gigs of betterness into SG/ZH it may have been a worthwhile game. Closing Comments:School Girl/Zombie Hunter had the potential to be a B-movie style good time that unfortunately is so bad that its bad. There are tiny bits of fun to be found among the numerous flaws, but the bad vastly outnumbers the good. Die hard fans of this type of thing could maybe give this a look if theres a heavily discounted sale, but even then the bad gameplay will overshadow any camp value to be found. Onechanbara Z2 is actually a better alternative to this title, if that tells you anything, since it provides the same level of fan service but with better visuals, music and combat. School Girl/Zombie Hunter is basically Lollipop Chainsaw without the fun or any of latters redeeming qualities.", "date": "November 20, 2017", "grade": 2.0}