{"name": "Retro City Rampage", "ref": "https://hardcoregamer.com/?post_type=post&p=15362", "text": "Beginning life as Grandtheftendo, a GTA III port to the NES about a decade ago, Retro City Rampage has gone from being an 8-bit rendition of a then-modern game, to a parody of NES-era games and pop culture. The game as a whole is probably much better for the change, and has come out at a perfect time given that Double Dragon Neon also spoofs that same time period  making this the second game in about a month that references Bimmy and Jimmy Lee. Its a recipe for success, as 90s kids eat up references from the period (while also having to eat a balanced breakfast and balancing checkbooks because they arent children anymore).It begins with the Player coming into contact with Doc Choc, whos in dire need of a Flax Combobulator (and other parts) for his redesigned silver-ish vehicle and turns into a series of fun fetch-quests for things like Game Dini codes and side-missions that involve a low-speed chance with the vigilante Biffman as he excitedlyobeys traffic laws and you need to down as much coffee as possible to stay awake. Youll also need to take on the responsibility of paperboy  only instead of newspapers, youre throwing nudie mags into boxes. RCR is even more full of references than one can imagine even if youve seen every trailer and have seen all the shop names in them, youre in for some treats. My favorite shop name is probably Bundys Wedding Chapel, but Skate or Buy is up there too.Beyond the references being amusing on a surface level, they also allowed me to realize how much better a job RCR does at delivering a satisfying experience for fans of some licenses that were given absolutely terrible releases on the NES. RCR does a far better job at delivering a fun, silly Back to the Future game than the actual BTTF NES game did. Its also much easier to drive around the open world here than it was in TMNT (which also has one of its most infamous stages recreated here) or Dick Tracy thanks to a far more logical control scheme for both the PS3 pad and the Vita and making use of the modern twin stick design makes it super-easy to shoot wherever you want to. It is pretty strange at first to play a GTA-style game as a twin stick shooter, but it works really well  and that becomes immediately apparent when you take part in the Smash TV-esque shooter rooms.A lot of open world games try to deliver a lot of things, and dont do them all that well. One advantage of this game taking a long time to come out and being a labor of love is that everything is executed as it should be. The Paperboy-style mini-game controls well, as do the in-game arcade versions of Super Meat Boy (as a Virtual Boy-style game with optional headache-inducing faux-3D), and bit.trip Runner. The in-game casino gives you SMB 3-styled match-two memory game and line-up/slot machine games for cash, health, shields and weapons. Theres a lot to do in the main game, and if you ever feel like taking a break from it, you can, and either focus on side-missions that dont count towards the story and take part in things like street races, take part in specific challenge missions you find throughout the main game where you run amok for X amount of time or take part in the free-roaming mode with either the Player character or any of the unlocked ones. Its kind of like playing 3D Dot Game Heroes as either the main Not-Link guy, or a dragon  either option is fine, but one ups the wackiness level. Although there, you cant arm Mr. Destructoid with a flamethrower or a bazooka, so RCR wins out easily there.Unfortunately, it falls short when youre trying to navigate the open-world environment due to a relatively poor map system. While giant guide arrows will point you in the general direction of missions, the on-screen map during the game doesnt show much and the pause screen menus version doesnt allow you to zoom in and find exactly what you want. If youd like to take a break and play some arcade games, youd better remember where it is on the map because it isnt marked. Theres also no waypoint system in place, which means theres some GTA III-style trial and error when it comes to finding your locations with the giant arrows. One good thing that comes from this is exploring the world and finding new locations that give you a chuckle, but it is frustrating to not be able to easily find locations.Visually, Retro City Rampage delivers the goods in every way imaginable. That may sound like hyperbole, but vBlank did an amazing job at creating NES-style visuals, from the art style to the limited, but not too limited animation and then giving you many ways to view them. Youve got the regular game that can be played with full widescreen support, or you can choose to play it with scanlines, with many kinds of screen borders (including an arcade cabinet with helpful hints on the side, a tube TV, Game Boy, or even a Super Game Boy-style overlay). These are all worth trying out for at least a little while just to either go back in time briefly or if youre younger, experience what it was like to play a game on something other than a flat screen. Beyond the borders, youve got even more visual customization choices with the color schemes. Beyond the regular one, youve got also two NES-styled options, another that makes great use of blurst processing, another takes you back to the See64 days, while others give RCR a black and white look, a ZX Spectrum one, variety of DOS looks, including a freaky black and green one, another green-and-white portable look or a blinding black and red virtual design. Everything about the graphics is a love letter to the 8-bit era, and while there isnt quite the color depth of something like Batman: Return of the Joker, Im still largely satisfied by the graphics.The chiptune soundtrack has got a fair amount of variety and is very fun to hear on the in-game radio stations when youre driving around and either running into vehicles or mowing over as many rows of civilians as possible. However, it isnt so good that I can see myself listening to it outside of the game since so little of the music stuck with me after playing. The 60s Batman parody song did, but nothing else was hummable, or had me wishing I could listen to it during a walk. The sound effect work is also pretty good, although again, very few of them stick with you unless theyre parodies of existing well-known sound effects.The cross-buy enabled PSN version gives you the most for the money as $15 nets you not only the PS3 version, but the Vita version as well. The short mission structure makes this a surprisingly good fit for a portable since as long as you dont have to retry missions a lot, you probably wont spend more than a few minutes on many of them. The redone control scheme translates well to the Vita even with the system having fewer buttons, and the systems inclusion of twin sticks for shooting helps greatly in that regard. It also looks amazing on the OLED screen and makes me wish that there were more 8-bit style games on the system because that visual style manages to look impressive despite being archaic  largely due to how sharp and crisp everything is. Its so clear that you can still make out small details like hairstyle changes and boxes on heads, and it looks better when you use the zoom-in feature that furthers this being a portable-friendly experience.Closing Comments:", "date": "October 15, 2012", "grade": 4.0}