{"name": "Borderlands 2", "ref": "https://hardcoregamer.com/?post_type=post&p=14252", "text": "Gearbox Softwares biggest success outside the Halo: Combat Evolved PC port is 2009s Borderlands. While early impressions made it look like a serious post-apocalyptic Mad Max shooter, it couldnt be farther from that. Gearbox has a wild sense of humor and they bring it even further in Borderlands 2, offering a much richer story that is filled with an arsenal of new weapons. Can Gearbox follow-up on their surprise hit, or has the well gone dry?If youre familiar with the first game, combat remains largely the same. This is a role playing first-person shooter that has a variety of variables tied into the 87 bazillion weapons that can be found. Thats a whole lot of guns, despite using a fake number. The idea is that each weapon has different elements and traits to them, allowing for more than just this gun is better than that one. There are weapons that can corrode armor, set a blaze to opponents and disrupt shields. Unfortunately, while there may be more guns added to the fray, theres a lack of change in how theyre used. Its primarily a new skin overlaying the same weapon customization from what weve played before. Regardless, though, combat is still incredibly addictive as strategically planning a situation in the midst of battle can be quite frantic. Do you choose the slightly weaker weapon that has the chance to gradually melt their skin, or do you pick the highest damage count you can find?Quite possibly the biggest knock with Borderlands 2 is that its much too designed for cooperative play. Theres no comparison to how much fun it is to team up with three friends and go through the vast campaign together, but if the game is played solo, it can be a bore. It feels like Borderlands 2 was designed with cooperative play in mind first and solo second as, while the game isnt unbearable, it becomes overly difficult and not all that fun to play. Having to find cover, pop out to land a couple shots, run around another corner to reload, and repeat the process isnt something I want to do for fifty hours. Thankfully, Gearbox allows for constant matchmaking if you dont have any friends who own the game, but even then you have to worry about a complete stranger coming into your world.Borderlands never really had much of a story outside find the vault, but the sequel improves upon it significantly as its all about big events and character development this time around. The playable characters from the first game make grand appearances in their own ways that have crucial consequences to the overall story. It brings a smile to your face when someone youve become attached to has such a flirtatious personality when it wasnt even close to being originally apparent. Every single significant NPC is unique in the sense that their personality is something else. For example, Tiny Tina is a thirteen year old girl who loves explosives, but has a few loose screws in her head, and the returning Mordecai is apparently an obsessive drunk who has a better shot when he has a bottle in his hand. Its these kinds of characters that make Borderlands what it is, offering a world thats in complete chaos but doesnt affect these wacky individuals.It also helps that the dialogue and overall writing is, for the most part, fantastic. There are a couple severely childish moments, such as deciding to call enemies Buttfarts just because, but most of the dialogue distributed to each character suits them perfectly and ensures that even the most dire situation can be turned into a comical one. The voice acting is some of the best youll hear this generation. Jokes are plentiful and give Borderlands 2 its own identity, offering more than just a shooter, but a funny one at that. Gearbox has also given tribute to a number of properties, such as Dark Souls and Teenage Mutant Ninja Turtles, that either have missions dedicated to them or references that are secretly placed within Pandora. Even with jokes, it doesnt mean the entire story is a constant laugh as there are sometime morbid situations that, while they add their own sense of humor, can be rather grim.Closing Comments:The problem with Borderlands 2 is that its just more Borderlands. Normally I dont criticize something because it didnt go out of its safe zone, but having played close to 100 hours of the first game and with very few changes outside some AI behaviours and environments, it makes the sequel feel less special than it should be. That said, I do love Borderlands, and if youre looking for more of the same, youve come to the right place. The characters are more charming than before and develop as the polished story progresses. In the end, Borderlands 2 is a charming follow-up that will suck tens, if not hundreds, of enjoyable hours from your life  especially if you play it cooperatively.", "date": "September 25, 2012", "grade": 4.0}