{"name": "Jet Set Radio HD", "ref": "https://hardcoregamer.com/?post_type=post&p=13965", "text": "Its hard to believe its been 12 years since the original Jet Set Radio hit the Dreamcast (with a slight name change to Jet Grind Radio). It seems like just yesterday that I fired up the Dreamcast and plowed through the streets of a vibrant Tokyo-to tagging anything that stood in my way with the incredible soundtrack blaring as loud as possible. It was definitely a great time to be a gamer, and JSR is one of the handful of games that define the system. That list is even shorter when you narrow it down to games that are still fun to play now, and thankfully, JSR has held up really well  with a few caveats. This gorgeous HD remake brings with it some major enhancements and even some bonus features to hook those who thought they had their fill a decade ago.With this being an HD remake, the biggest change on the surface are the graphics. Many of the games assets have been reworked so the game is now in widescreen and major things like the characters and some parts of the environment are all crystal-clear. The biggest issue is that not everything has been redone and boy does it show. When the game begins and you see a pristine Professor K next to a blurry thing that you know is a JSR logo, you cant help but be a little bit disappointed. Its clear that a lot of work went into this and it was a labor of love, but the existing art being re-used sticks out badly here and hurts the presentation a bit. Dont get me wrong  the reworked graphics are outstanding, and the overall visuals are still quite bold and appealing, but their flaws stick out more now than they did before due to the improvements not being spread across every area.The basic concept of riding around on inline skates tagging walls, street corners, cars, rival gang members, and occasionally the evil graffitti-hating cop Onimisha is still fun. Unlike the original game, you no longer have to tag and center the camera using the left trigger, and can now use the right stick to move the camera around as needed. At least in theory  the default camera is still pretty jittery, and the right stick controls helps you out a little bit, but dont quite make up for getting in one of the games many tight spaces and getting stuck there due to the camera not moving with you. It will result in some needless deaths as cops and/or helicopters SHOOTING MISSILES gang up on you.Outside the camera, the controls are great. The modern-day analog sticks are worlds better than the DCs, although I found the 360s was easier to use than the PS3s. Even after playing the PS3 version for a week longer, I still found moving the stick for tagging much easier on the 360, and character movement is a bit easier with the 360 stick. The biggest difference to me was the left trigger. The 360s is just a lot easier to use than the PS3s weirdly-curved one. The shape makes it easy for your finger to slide off, and having a shape like the 360 and DCs that ensures a firm hold on the button really helps out. While each version is identical otherwise, the controls make this a must for the 360 if youve got both systems.While there are some issues with the remakes controls and graphics, the gameplay and soundtrack have held up marvelously. All but one of the original games songs has been re-licensed, and you can still listen to the music as much as you want to outside the main game with the in-game radio. The diverse rock, J-pop, and rap soundtrack was mind-blowing in 2000 and is the same way now  largely due to no game since, including JSRF, featuring as diverse a soundtrack as JSR. Its full of instantly-catchy music that sticks with you long after you play, and is one reason why its OST is on my MP3 player at all times. The voiceovers have held up well too  theyre just as broad and fun to listen now as they were when the game was first released.Closing Comments:", "date": "September 24, 2012", "grade": 4.0}