{"name": "Fractured Soul", "ref": "https://hardcoregamer.com/?post_type=post&p=13668", "text": "Theres a huge difference between an interesting idea and a fun game. For every lets make a world of blocks that you can arrange any way you like theres going to be a few dozen how about a WWII FPS where youre a werewolf, fly up the screen and shoot stuff but youre a scantily clad anime chick with giant boobs, or, in the case of Fractured Soul, run left to right and shoot things, but the top and bottom screens have almost identical versions of the levels you need to switch between in order to overcome obstacles. The idea isnt necessarily bad, but its going to take skilled execution in order to make it work. Fractured Soul tries, but gets bogged down by an amazing number unfortunate design choices.The basic gist is that youre two different robo-guys, one on the top screen and one on the bottom. Theyre both controlled at the same time, but differences in the level layout mean youre constantly switching between one and the other. A platform on the lower screen may not be on the top, but the top screen has a ladder you can reach from that platform if it was there, so you jump to the platform on the bottom, jump again and quickly switch to the top screen, and then grab the ladder and keep on going. The rough layout of the levels is identical, but the enemies, obstacles, and other pieces of set dressing make you pay close attention to both at the same time. Its the kind of thing that makes your head split clean in two, but in a good way.The problems are in the execution, though. Robo-guy moves at a sedate pace, but it feels refreshingly brisk when you get to the levels where one half is set in water. The water version of the level moves slower but jumps higher, leading to some interesting puzzle design, but it still feels like youre trudging along. The slow speed is probably for the best, though, because the camera is always zoomed in a bit closer than is comfortable. Why graphics this bland need a closeup is a mystery, but at least you get a good look at them. Eventually Fractured Soul opens up into greater variety, with vertical shooter levels and even ones where the gravity is reversed between the two screens, but Im going to have to admit to never having seen them. Level 8 showed up like a brick wall, and after losing several dozen lives I gave up.Closing Comments:", "date": "September 20, 2012", "grade": 2.0}