{"name": "Dark Souls: Prepare to Die Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=12672", "text": "How many games started as an internet petition and ended up a consumer product? Dark Souls: Prepare to Die Edition is the result of hardcore fans across the world rallying together to express their interest in a PC version of arguably the best game of 2011. Namco Bandai and From Software have put effort into bringing this multi-million seller to the desktop, but will inexperience with the platform prevent it from becoming the definitive version?Just as the title suggests, its best to be prepared to die as Dark Souls is no cakewalk. Charging in gung-ho is ill-advised as itll just end with you in a pool of your own blood, forced to try again. Its a trial and error game that becomes incredibly rewarding when you get the mechanics down perfectly. Its about watching an enemys movements and learning their patterns in order to setup an attack, relying heavily on split-second openings. Due to this, Dark Souls isnt exactly a game anyone can pick up and play as players will need patience, strategy and more than anything, skill  a rare trait among games today. Its not a sigh of frustration when killing a boss after the tenth try; its a sigh of satisfaction.The world in Dark Souls is massive, spanning across many open terrains and closed dungeons. One moment youre in a luscious forest with ents scuttling around, the next youre climbing to the top of a fortress with anthropomorphic snakes ready to dig their fangs into your skull. With its open world setting and lack of handholding, there isnt a definitive path to the end goal. There are enough alternate possibilities to make it nearly impossible to see everything in one playthrough. The sheer amount of content Dark Souls offers is overwhelming, allowing the player complete control over their own experience.From Software builds a fantastic narrative that isnt fed to you with a spoon. Players must take the time to read the descriptions of weapons and items, while picking up on small things NPCs have to say, to fully understand the story. The main storyline works hand in hand with these small details scattered across to create something engrossing. It isnt just a random coincidence that an NPC is placed in the world; they have a plot and purpose that can be uncovered if effort is put forth. Its this type of storytelling and depth that games today lack, expanding upon content that most gamers wont even realize its there. It creates lore and fiction that goes beyond Dark Souls itself, allowing for players to connect the dots and picture how everything is connected.The PC version isnt a direct port, though, as theres new content available thats more than worth the time and effort. It will run most gamers around 10 hours, maybe a little more for adventuring and caution, and offers extra knowledge packed into an already crammed fiction. As expected, the new additions are as difficult as the main game. Bosses, and even some of the new enemies, will contribute heavily to the death count if a character isnt built in a specific way. The plot involves traveling back into time to Oolacile, a nation lost many moons ago, with the goal of saving the beautiful princess from a mysterious abysmal creature. During the journey, lightly touched upon figures are run into, such as Artorias, the knight corrupted by the abyss.The newly introduced areas mesmerize while demonstrating a sense of fear that isnt felt since exploring the game the first time. The new figures are vile, causing a sense of fright by not knowing how they will approach or whether or not a shield will even come in handy. One aspect that seems toned down, though, is traps. Holding up a shield around every corner has come natural, but there were no instances where I was put in an inescapable situation. While that sounds like a positive note, it makes the difficulty feel less impactful when it comes to combat and adventure. Thankfully, the new opponents and creatures scattered about will still give you a shock when they pop out of nowhere.Now lets get down to the brass tacks: PC features. The PC version isnt quite up to snuff with most PC ports today, but it isnt necessarily all that bad. It does have anti-aliasing (which some games, such as Darksiders II, dont include), and resolution options up to 19201080. Unfortunately, because the internal buffer resolution is stuck at 1024720 (something that, without mods, isnt possible to increase), the game can look a little washed out. That isnt to say the game looks ugly, as the artistic direction is fantastic, creating a dark and depressing world to venture through; it just doesnt look as crisp as it should. Dark Souls Prepare to Die Edition is also locked at 30 frames-per-second, which youd think would be a major deal, but seeing Blighttown and Lost Izalith running at a solid frame rate is something to be joyful about. Overall, in terms of a PC game, Dark Souls is just an acceptable port that needs some work.Closing Comments:Dark Souls: Prepare to Die Edition is a fantastic experience, and one of the best games Ive played this generation. Even with some graphical hiccups, it remains superior to the console counterparts, offering more content, better graphical options and a frame rate that is steady throughout. Dark Souls: Prepare to Die Edition is an experience like no other that will invoke a multitude of emotions while keeping you planted on the edge of your seat.", "date": "September 1, 2012", "grade": 4.5}