{"name": "Legasista", "ref": "https://hardcoregamer.com/?post_type=post&p=12473", "text": "Dungeon crawling can be a simple thing, but that doesnt mean it has to be. Sure, you can equip a few items and use them to smack monsters around, and maybe throw some magic blasts while youre at it. Legasista, on the other hand, layers on a few dozen systems and sub-systems to add as much complexity as possible, turning the basic act of sweeping monsters out of a dungeon into a process thats just as heavy on prep-work as it is on hitting the attack button.If a game is going for complexity, however, it had better have clear instructions as well. Legasistas super-talky 10 level tutorial dungeon does a nice job of pointing the player in the general direction of basic competency, and theres a Help menu with even more details broken down by category and sub-category, but this is a game in desperate need of a far heftier instruction manual than the one buried in NISs web site.Alto is an adventurer on a quest to turn his sister human again after she was transformed into a crystal. He quickly joins up with Melize, an ancient weapon in the form of a teenage girl (of course) who could fix this problem if only she hadnt lost her memory the second she tried to access her Sister DeCrystallization feature. These two are eventually joined by more teammates, and you can create your own as well, but when it comes to equipping your horde with decent weapons, armor, and accessories, things get very complicated, very quickly.Alto starts as an Explorer, a class with thief and magic skills. He can equip a sword or bow as a weapon, and armor plus a few accessories as well. His initial hitpoint gauge is laid out with health at the start and end, and the physical durability of the equipped items fills in the middle. When an item, such as boots that add to Altos overall speed, eventually runs out of Durability, it breaks, and all stat boosts and skills associated with it go away until you leave the dungeon. The primary purpose of the boots from this example is, of course, to increase speed, but items can have titles and other Abilities associated with them as well. Abilities are simple enough, they get slotted into the list of available magic, but titles can do all sorts of things and require significantly more explanation than they get. Main titles apply their description to the subtitles, but the level of information given is minimal at best.For example, Ive got a Bone Sword +3 I found in one of the random dungeons you can go exploring for rare loot. Its got a main title of Rare Title Ratio +1, which gets added to the two subtitles Mana Bonus (mana use -1, lowering the requirements to equip the sword) and Ability Up (Equipment Ability + 2 for 6 mana, which probably gives a bonus to the Sword Trance ability the weapon grants while increasing the overall skill cost to equip). Theres hundreds of items in the game with endless possibilities for how the titles and subtitles can mix & match, but when the descriptions make no sense at all, and the complete lack of clarity in explaining how even a low-level item like this sword is improved by its skills, its simply not worth trying to decipher. Eventually its easier hope for the best and grab a weapon with a strong attack and a whole load of titles.Closing Comments:As for the bit where you run around dungeons and hit monsters, thats where the fun kicks in. Inventory management is a bit of a pain and the menu system is a nightmare in usability, but once you get past that theres a whole world of critters just waiting for a beatdown. Experimenting with jobs and the various equipment loadouts they offer makes for huge variety in combat styles, and even when one isnt working out you can make the trap tiles in the dungeon do the bulk of your dirty work by turning them against the monsters. Theres always a new way to tinker with the process of monster elimination, whether by changing jobs, working the environment, or trying out new toys wrested from the inhospitable recesses of the deepest dungeons. Theres a lot to explore and a huge amount of potential stat tweaking, but it would have been nice to get a proper explanation on how Legasistas systems fit together.", "date": "August 30, 2012", "grade": 3.5}