{"name": "Unmechanical", "ref": "https://hardcoregamer.com/?post_type=post&p=11762", "text": "The balance between quality and quantity is a tough one. Nobody wants to slog through hour after hour of average-ness inserted for the sole purpose of padding between the awesome bits, but is a bit over three hours of quality gaming really enough to be satisfying? Unmechanical is an unbroken string of quality action puzzling, with a lovely visual design made all the prettier by the Unreal Engine, but it ends almost as soon as the really clever puzzles appear.A little robot is trailing along after his little robot swarm when it gets sucked into an underground complex of some sort. The unnamed robot can fly, has a tractor beam, and is apparently indestructible, and while that seems like a limited set of skills they get used in dozens of different and creative ways. Most puzzles center around moving things and activating switches, and the one button plus joystick controls work perfectly for this. It doesnt take a lot of control complexity to pick up and move things, but it allows endless ways to interact with the world.One of the early puzzles, for example, has a switch in a hole blocked by rocks. The hole is too small for the rocks to drop through, much less the robot, but its still pretty clear they need to be moved out of the way. A little ways back there was another switch that caused a small orange ball to shoot through a broken pipe, out one shattered end and into the other. Its an early obstacle, not meant to be super-complicated, but the same kind of logic used to clear this will be needed later to solve the huge number of puzzles that activate a giant mechanical heart. For a while it looks like the level design is going to take a page from the Metroid school of design, zipping from one level to another and earning a new skill to enable further exploration in previous area, but then the final level shows up, relatively linear, and all of a sudden the credits are rolling. Sure, theres two different endings, but a single choice at the end means you can reload and see both.Closing Comments:", "date": "August 22, 2012", "grade": 4.0}