{"name": "Darksiders II", "ref": "https://hardcoregamer.com/?post_type=post&p=11373", "text": "Darksiders is the perfect example of a new studio and IP coming together to form an instant hit. While the first title was well-received both critically and commercially, the anticipation for Darksiders II has grown to rival the biggest franchises in gaming. Can lighting strike twice for Vigil?Instead of continuing Wars story, Darksiders II shifts protagonists to focus on brother Death. Though experienced through a new set of eyes, the story takes place concurrently with the original. After War is imprisoned by the charred council, Death sets out to prove his brothers innocence. While the lore is interesting, the plot is largely as incoherent as the first. Those not actively trying to fill in the blanks should prepare to be lost most of the time. With so much potential to weave a riveting tale, its a shame more effort wasnt put into improving pacing and fleshing out details.Of course, Darksiders has never been about the story; so as long as you know youre pissed off and killing everything in your path, youll do fine. And Death does kill everything. Combat is faster and more fluid than the original, letting you chop baddies in bliss. While much of it still consists of pounding the X or Y button, skills have become more crucial (and fun) than ever.When a new level is reached, a skill point used to unlock a new Wrath Ability is awarded. Abilities are separated into two trees: Harbinger and Necromancer. The Harbinger Tree is essentially a warrior tree, featuring skills to assist you in combat. The Necromancer Tree features supernatural abilities that range from summoning crows to ripping death apart into a a tornado of deadly bone fragments. While both are immensely helpful, the Necromancer Tree certainly has the cool factor going for it. Nothing beats exhuming ravenous ghouls to fight alongside. There are 8 abilities in all (doubling the amount of the first game), each of which can be further upgraded to increase capability.As fun as the combat is, the most enjoyable aspect of Darksiders remains the Zelda-esque platforming. The exploration/combat ratio has been improved, with long stretches of dungeons featuring multiple puzzles to solve and rooms to explore before enemies make an appearance. Traversing through areas has been vastly improved, allowing Death to leap from multiple beams and ledges to reach desired areas. Movement is smooth and works flawlessly most of the time. If you want to jump to your left, you jump to your left. If you want to jump to the right, you jump to the right. Controls dont have to be perfectly executed to avoid random falls. The approach is a revelation in a genre that is so often plagued with this dynamic. One of the biggest improvements Darksiders II boasts is equippable armor. Throughout your travels, armor can now be acquired from enemy drops, treasure chests or vendors. There are hundreds of different pieces, each with their own speciality. Armor can be easily equipped by simply holding down select when you find it or swapped out in the menu. The way its been implemented doesnt slow down action for a second, yet makes the whole affair that much deeper.The most valuable asset of Darksiders II may be its ability to spare frustration. While open-world exploration games tend to be a blast, they can just as easily become overwhelming. Even though the world of Darksiders II is large and features tons of objectives, its rare to ever feel lost. Not only is the well-labeled map always at your disposal, but the friendly crow Dust is there to guide your way. Simply hold down L3 when you become confused and hell fly near where you need to go. The great navigating combined with smooth controls never make the game feel like a chore.Closing Comments: With Darksiders II, the franchise has cemented itself as an essential property among the likes of Devil May Cry and God of War. Even with the scale increasing in practically every area, the game manages to be less intimidating than its predecessor. The story certainly needs improvement, but the gameplay will always remain the main draw. A testament to a talented development team who takes pride in their craft, Darksiders II has revolutionized a series that debuted just two years ago.", "date": "August 15, 2012", "grade": 4.5}