{"name": "Persona 4 Arena", "ref": "https://hardcoregamer.com/?post_type=post&p=11345", "text": "Its been over four years since Persona 4 graced the Playstation 2, but Im sure its still fresh in the minds of fans. All of your favorite characters back, but no longer tasked to do battle in a slow turn-based situation. Atlus and Arc System Works, best known for their Guilty Gear and BlazBlue franchises, have teamed up to create a fighting game experience like no other. Fast and chaotic gameplay mixed with a well told story through the eyes of each character  what more can you ask for?First things first; Persona 4 Arena is complete unadulterated fan service to anyone who has played Persona 4. Arc System fans will definitely get a kick out of this, but the amount of effort and understanding that was put into each fighter shows that they know the universe, and they expect you to know it, too. References to specific attacks, titles and characters are scattered throughout the game and fighting mechanics, making this an experience that relies heavily on prior knowledge. Even without having played the last game in the franchise, though, a newcomer can still have fun, but his or her time will be hampered in the story mode.The story mode is by far the best and most significant piece in Persona 4 Arena, other than the online multiplayer. Its what makes the game accessible even to Persona 4 fans who might not be interested in fighting games. For actual fighting fans, while accessibility sounds great, it may delude the actual combat a bit. Because it seems to be aimed more at telling a story than actually fighting, there are only a few battles that occur during each characters campaign, most of which will take you less than a minute to finish as theyre only one round a piece. That said, this isnt a quick experience you can just pickup and get through in one sitting, as completing each characters story stacks up abnormally fast. By making progress in one story, you will constantly be opening up new campaigns, all of which you will need to complete to arrive at the end of the tale. Each character has their own perspective on things and many of them are placed in different settings, so you will experience new paths and events in each playthrough.The story itself is good for some characters but trivial for others. The dialogue is well written and is expressed perfectly. Chie is still her wild and tomboyish self while Kanji is still an unleashed beast. This is essentially a visual novel in the sense that about seventy percent of the dialogue is unrecorded inner monologue, while the remaining thirty percent is voiced conversations between other individuals. It does drag on a bit, but if youre a fan of the character youre playing as, it definitely becomes interesting to read their perspective on the situation. The story mode is completely optional to anyone who just wants to fight. With no unlockable characters, jumping in is not a problem; you just wont understand who some of the characters are and why they are there.Theres a massive amount of content packed in here other than the story mode, though. Not only are there twelve unique characters, balanced differently based on their abilities, strengths and weaknesses, but theres a wide selection of modes to play. If you dont like story mode, you can go through the arcade mode which pretty much spins the same yarn, just through less dialogue and a lot more fighting. If you dont like that, you can try your hand at the different challenges, learn the actual moves through lessons, rack up the highest score you can, practice against a dummy or go head to head with someone on the couch or across the ocean. Either way, Persona 4 Arena is bulging with a variety of tasks to complete.Now finally, lets get to whats important: the battle system. The fighting mechanics are top notch, offering fast and fluid gameplay that will require a good amount of skill to succeed. Newcomers to the genre wont be scared away so quickly as there are ways to get around this, especially in single-player mode, but when you enter the online arena, hours in the training mode wont be enough as hitting on X (or A, depending on your system) repeatedly wont suffice. This is very much like BlazBlue, offering bursts, super attacks and even instant kills in which can be incredibly difficult to pull off (for good reason). The game is played on a 2D plane and offers upwards of thirty different types of combos and attacks, unique to each fighter. Its a satisfying system that seems to be developed for even the more unskilled player, but has an incredible amount of depth for anyone who wants to dig deep.Closing Comments:Persona 4 Arena is a perfect mash-up of fighting game finesse and the compelling characters from the last two Persona games. It takes everything you loved in Persona 4 and expands upon it greatly, telling a story that seems to be cannon for future iterations in the franchise. With an absolutely stellar presentation, some of the most memorable tracks picked from the last game, an arsenal of modes to play, and one of the lengthiest stories in a fighting game, Persona 4 Arena has everything a fighter should have, plus more.", "date": "August 15, 2012", "grade": 4.5}