{"name": "Life is Strange: True Colors", "ref": "https://hardcoregamer.com/?post_type=post&p=410264", "text": "Its either a blessing or a curse that Life is Strange: True Colors just happened to be released after Psychonauts 2, a game that set a high bar when it comes to stories about empathy, trauma and more via special people with extraordinary powers, which is exactly what developers Deck Nine are dealing with the latest entry in the narrative-focused graphic adventure series started by Dontnod. They already had a high bar to clear when it came to living up to the series legacy, but now theres an even higher bar in play that they have to clear.To illustrate just how high Psychonauts 2 set that bar and how True Colors is sort of in its shadow, lets start with the main hook of the game: our latest protagonist, Alex Chen, is a teenage heroine with a troubled past who turns out to also be an empath. She can view the auras of people with strong emotions, but if those emotions are too strong, Alex gets overtaken by them herself, and it isnt pretty when emotions like anger and sadness are into play. Once moving to the small town of Haven Springs to finally be reunited with their estranged brother Gabe, however, Alex begins to see how they can use their skill to actually read peoples thoughts and emotions and even help them with it.When the last game youve played has you help a person towards solving their mental health issues by flinging sentient food around in order to stop giant sock puppet goats on a deranged game show, coming back to something like True Colors feels like a bit of whiplash as you try to help people by, well, actually talking to them. And when theres a decision to either absorb a persons negative emotions in opposition to making things worse for everyone in different ways, it brings to mind that one of Psychonauts 2s messages is how you cant just quickly solve everyones problems by messing with their heads. True Colors even has its own version of Mental Worlds, where Alex can view little, warped versions of the normal world seen through the eyes of different characters. I dont bring this up these comparisons to condemn True Colors. Quite the opposite, in fact, as in addition to showing how the series isnt afraid of new angles and gameplay wrinkles, it draws attention to how mature and at times even complex the choices you make in the game are, and how well-crafted its story is (for the most part). The main story surrounding Gabes eventual tragic death is the meat of things, and it is nice and twisty, but it also leads to a bunch of individual tales involving the supporting cast, including Gabes girlfriend Charlotte and their fantasy-loving son Ethan, eccentric former entrepreneur Duckie, and local disc jockey and record store employee Steph, returning from Before the Storm and serving as the only link to the others games. Theyre a highly-enjoyable, colorful and fun lot of characters, the kind one wants to learn more and more about as things progress.While all of the main characters are nice, and their voice actors turn in solid performances, the real star of True Colors is Haven Springs itself. One of the complaints some people have had about the second game is that unlike the first, its road trip nature meant it lacked a permanent setting and supporting cast to get to know further. True Colors fixes that with Haven, and while its a small town  basically one big main street with some parks on the side  Deck Nine does everything possible to make it seem like a massive, evolving world. NPCs can go from lamenting the recent failures of their ice cream shop to being struck with inspiration over time. Local miners discuss the ramifications of recent events. Theres color everywhere (the graphics are amazing in these parts) and you get a feeling of how the community influences every nook and cranny. One of the themes is that of a home, and Haven Springs truly does feel like a home.Speaking of Havens citizens, though, Alex has the ability to assist them in various ways, be it talking to them or using her empath powers to find out what they need, leading to a lot of cute little side quests along the way (and some literal side quests during a LARPing session, which is an incredible delight that may be the games highlight) that further showcase the personalities of everyone in town and how Alex begins to bond with them even further. The empath powers also make up the biggest gameplay change (with the rest being the same dialogue-based third-person standard as before), and theyre welcome, allowing for a good chunk of detective work as you piece together clues from everyone or even certain objects hiding memories (some of which serve as the games collectibles). The puzzle difficulty isnt exactly high, but it does still deliver a lot of enjoyable emotional sleuthing. All of this, however, is harmed by one hefty flaw with True Colors: its relatively short length. Maybe its just the fact that this is the first non-episodic game in the series, but True Colors only clocked in at about ten to eleven hours or so, and thats even if one goes around and examines everything they can, making it feel like the shortest LiS game yet. And while theres nothing wrong with a short game, here the best and most promising parts dont get their appropriate breathing time. For example, since the first chapter is basically a prologue and the last chapter goes in a completely different direction, it means theres only three good  albeit lengthy  moments where you truly get to explore Haven. Furthermore, the previous dilemma mentioned about having to choose whether to absorb a persons emotions makes for nice, dramatic moments where you have to ponder the ethics involved and how it can even harm Alex. Shame there are only two of them.Not helping the issue with length, though, is that without spoiling anything, the final chapter comes across as a letdown. It essentially begins with only a couple of questions left to be answered, and then due to way its set up, proceeds to go off the rails. And yes, the original game did this as well in its finale, but here it just feels like padding. It tries to provide a lot of insights into Alexs background and such, but its nothing that wasnt already implied or stated. It feels likw a slog where youre begging for the game to just get to its big revelation already (and even then, the thing the big bad of the game was trying to cover up elicited little more than a relative really? from this writer, and it arguably raises more questions instead), and then its just basically a huge cinematic that uses little of the emotion-based gameplay in clever ways, all followed by the traditional binary final choice at the end. Up until the end, True Colors is almost a contender for the best game in the series, but alas, it has difficulty finding the right note to end on. Closing Comments:Life is Strange: True Colors may sadly dim towards the end, but its worth checking out alone just to experience Haven Springs, with its gorgeous scenery, terrific cast of characters both major and minor, and an intriguing mystery that requires quite a bit of fun gameplay. Alexs emotion-based powers are best used for exploring everything around her, and theres a lot of amazing little stories to find. It may not be the revelation the series could use, but Life is Strange: True Colors is still a sweet, heartfelt journey to a quaint neck of the woods thats worth taking.", "date": "September 8, 2021", "grade": 4.0}