{"name": "Uurnog Uurnlimited", "ref": "https://hardcoregamer.com/?post_type=post&p=279504", "text": "Theres no shortage of platformers walking that tightest of lines between quirky and obnoxious. Particularly when the chosen art-style is minimalist or looks hand-crafted in its illustrative ways. Clearly hearkening for those of us attracted by something that is objectively unique to start off with; the end product likely flying off in a number of divisive directions. Not all efforts are as seemingly pompous as indies most gritted critics would want you to believe. Notably 2D platformers like VVVVVV or Hue or BoxBoy for example  very polarized titles, visually and thematically  can reel you in with their distinct aesthetic, but keep you playing on because of the unique twist they bring on platforming, let alone the accessibility of such interesting gimmicks.On its own, a game like Uurnog Uurnlimited  easy-to-grasp its mechanics might be  shouldnt be immediately dismissed for taking a peculiarly tangent approach to the way it presents itself. Yes its bright, vivid neon-lit visuals, with many a bright pink and humming blue contrasted against fluorescent greens and yellows, are nothing new. Fairly obvious a sight it is that developer tip their hat to that late-80s/arcade cabinet-era catalog of games, with games like Bubble Bobble and [mandatory] Pac-Man symbolic of that period of video games where light and dark colors were so often used as a means to captivate, rather than a figurative end culminating in the limitations of 80s hardware.Uurnog wants to portray itself as this silly little adventure through a bright and bold world of color. Taking even more obvious inspiration from Super Mario Bros 2 with its primary gameplay in the form of picking up objects and having one of two options thereafter as to how one disposes of said object. Put it back down gently, or incorporate numerous abilities and effects that these objects either possess or will inevitably possess with a little persuasion, in order to solve puzzles and naturally progress through. And by progress, in SMB2 fashion, this usually means finding a key that will unlock a specific letter-coded door, by which more of the games non-linear world opens up. One of the catches Uurnog states (though doesnt really explain in-game) is that the games save-room, a sort of go-to hub where all the games locked doors are located and wherein the player branches out to tackle its many platforming and item-gathering segments, will automatically save any and all decisions you make. No matter how much you regret doing so. Again, similar to a thing like permadeath, the idea of a game taking note of your every move  requiring you to think carefully on, for example, which items you take back with you or which objects you decide to warp (using one of many devices scattered about the world) back into the save hub  on paper, should appeal to those who are looking for a platformer that is more than just a linear assortment of levels to tackle. One that, more importantly, aims to reassert and justify Uurnogs deliberately goofy premise and sense of instability whereby objects can interact with each other in such a way it gives the gameplay a little bit of a frenzied uncertainty to it.Sadly a lot of Uurnogs light-hearted approach to puzzle-platforming one minute and undisciplined chaos the next, is exactly that: on paper, a game whose environments and obstacles are a little more anarchic, sounds like fun. But the result is anything but. Uurnog Uurnlimited is by far one of the most frustrating and annoying platformers to release this year with its irks and groans manifesting many-fold. Firstly is its severe lack of direction and engrossing sense of progression. Sure the more keys you find and doors you unlock, the more whacky and visually-varied the geometric environments getbut in the end, as easy as it is to return to and come back to these regions, the irony is that it feels even more disjointed and hurriedly put together than a conventional A-to-B title. Outside of the starting tutorial area  bizarrely enough, the closest it gets to feeling coherent  Uurnog offers next-to-no subtle guidance on where to go and what best an order its challenges should be completed in. Sure theres nothing wrong with a game offering the liberty in deciding which order you tackle set objectives in, but there are far too many instances where an environment seems crammed with objects and items that the underlining direction and aim ends up lost in the senseless hilarity the game tries to dish out. Secondly, though there are some minor assists that make movement feel a little easier to adapt to  notably the fact that your player-character is immediately placed on top of dropped items  the combination of physics-based momentum as well as how unruly some objects and environmental hazards can be, makes even the simplest of actions (like stacking boxes in order to reach a high platform) feel like even more laborious an action than what it should actually be. Thats discounting the fact that youll have random objects and items crop up as if to intentionally bug you, without providing any meaningful incentive other thanyou can pick that up too yknow. Yesand?Thirdly the games excuse for a soundtrack  which again it talks up as being generative and algorithm-based, reacting to your involvement and your accomplishing set feats  is little more than a random assortment of beeps and blips and burps and purely inadequate and minuscule sounds that offer no sense of emotional or melodic personality to a game whose own attitude and persona seems to be to just act daft and leave it at that. Such is Uurnog Uurnlimiteds miscalculation in putting this perceived quirkiness to the forefront; it quickly loses most of its appeal. The only remaining drive on the players part is figuring out how certain objects and items interact with one another and while admittedly there is some minor comical actions to discover, and more importantly, key mechanics to use when solving puzzles, the unrequited difficulty in working out what one has to do and where to go far outweighs the possible discovery. Closing Comments: Uurnog Uurnlimited is a great example of poor execution. A game that tries to ride the crest through its quirky visuals, but in fact takes its eye off the more fundamental basics in keeping its players intrigue lasting through to the climax. Though its influences are clear to see, the distinct sense of direction and purpose for such a boldly colorful design is seldom merited beyond the frustration and patience-waning structure of both its physics and its environments. Uurnog Uurnlimited does grant some brief pleasantries and satisfaction in working out the right order and correct manner of interacting with specific objects, but in the end, the accomplishment always feels like dumb luck rather than investigative deduction. Put pure-and-simply, its a game that tries to win you over solely on its distorted aesthetic, but ends up losing you (and annoying you) moreso.", "date": "November 18, 2017", "grade": 2.5}