{"name": "Tales of Arise", "ref": "https://hardcoregamer.com/?post_type=post&p=410251", "text": "One of the longest-running JRPG franchises out there, Bandai Namcos Tales is still going strong but has been in need of a major upgrade for quite some time now. It has seen a gradual increase in quality, with only a couple of questionable entries since its 1995 debut, but there hasnt been a major evolution on the formula to set it apart from the competition. It has been over four years since Tales of Berseria, and while it was a refreshing take, having such a brooding and surprisingly deep storyline, the dungeon designs and graphical inconsistencies have shined a light on the glaring issues, especially coming off three entries that were less than ideal. Thankfully, Bandai Namco have listened to the feedback and have created a familiar yet different Tales game than weve come to expect. Fast paced, emotionally charged and filled with a new sense of life, Tales of Arise is a fresh and monumental step in the right direction, even if it comes with a few missteps in the process.Tales of Arise takes place on the world of Dahna, where another close planets more advanced inhabitants have decided to go down the path of enslavement instead of sharing their vast knowledge and technology. The story follows Alphen and Shionne, two drastically different individuals: one wants to do as much as possible to save others, while the other only looks out for her best interests (or at least if her thorny exterior is to be believed). Sadly, our protagonist is a dull and ill-written character. He evolves as events transpire, but never to a truly likeable individual, so much so I essentially forgot his name whilst writing this review. Hes your typical overly-kind protagonist who seems to have a difficult time seeing the bigger picture and acts on emotions rather than logic. There can be a certain charm to this, but not when it comes to Alphen and the scenarios he goes through. Fortunately, its the well-varied companions you meet on your adventures that help drive the plot further, and even some of the lesser-involved individuals have an impact. Sadly, the story also delves into a lot of JRPG tropes, such as amnesia, overly-dramatized emotions over characters youve just met, and of course events that somehow divulge into saving the world and mankind from extinction. The core story takes around fifty hours, with most of the additional content being able to complete in another fifteen. There are multiple moments that felt like the story was coming to a close, only for it to continue forward into a much longer and fleshed-out adventure. Its never as simple as it seems, and there are multiple twists and turns to be found, maybe to its detriment. The plot itself delves deep into themes of racism, segregation, oppression and of course slavery; it can be preachy at times, but in general they use these components well. There are various side quests, but the majority of them are broken down into a specific formula of fight a powerful enemy  which comes with one of the most awkward names for any monster type: zeugle. Of course there are some that involve cooking and finding certain items (theres even one that only gives you clues to where an item may be in the world), but the majority involves taking down a powerful monster thats troubling residents. In the end, despite hiccups such as a forgettable protagonist and villain, and maybe one too many twists, the story is filled with properly-used themes and a solid cast of likable characters.The Tales games have always had an engaging, fast-paced active combat system, and Tales of Arise not only preserves that, but enhances it. As weve come to expect from the series, we have standard combos each characters able to run through, but also Artes which use up gauge thats replenished over time, or if you have the right skills, when you land critical strikes. The flow of combat is overly gratifying, with some of the spectacular combos going into the 100s. Each of the six playable characters have their own unique playstyles, such as your standard melee, magic users and even one thats a bit of both. Because of the varying character capabilities, each come with a Boost Strike that afflicts the opponent a specific attribute. For example, Rinwell is able to interrupt all casters on the field while Law can break through shield users with ease. This is what weve come to expect from the franchise with plenty of different playstyles to choose from, but whether its gun-slinging or magic-dealing, the developers give players an exceeding amount of tools at their disposal to experiment with. The core concept of combat is to drain an opponents health while maintaining your own, but theres a ton of different ways to do just that. Theres breaking an opponents guard to land significant blows on them, exploiting their weakness and filling up essentially a combo bar that unleashes a devastating duo-attack. On top of this, instead of using up your own individual healing resources, the characters share a pool of Cure Points which can be replenished with items or resting at a campfire/inn. I was initially unsure if this was a mechanic I could get behind, but the more I played with it, the more I realized it allows for less micromanaging healing and MP, and instead ensures you can go all out with minimal concern with the chaos thats unfolding around you. There are too many different mechanics to discuss, but theyre all well designed and mesh perfectly with one another to create a complex combat system thats one of the best in industry.With that said, there are only two aspects of combat that need improvement: action queueing and targeting. Starting with the latter, targeting an enemy can be a chore. Youd think itd be as easy as pressing and holding L1 to swap between them, but your characters seem to have the attention span of a puppy. Depending on the placement, the game will frequently swap between enemies on its own, presumably to the closest opponent, but even that isnt a consistent theory. Weve also had it where we swapped to another enemy only for the game to immediately tell us nope, youre actually going after this enemy instead multiple times. Its a frustrating system that gets in the way more than it should. In addition, the action queueing can be a pain as youll be repeating multiple Artes without the intention to. Theres an option to adjust this, but it didnt seem to help the plight. There were even instances where we were stunned just as we pressed an Arte, only for the Arte to go off three seconds later after the debuff wore off. All of this throws off the balance and pace of the engaging combat to be a mess at times. By far the biggest complaint weve had with past Tales games has been the dungeons. While the older titles have had more open designs with a focus on exploration and alternate paths, the Tales series has gradually moved away from this to linear, narrow locations that take little-to-no thought traversing. There are obviously a couple standouts, but for the most part, it went down a rather disappointing direction. Fortunately, Bandai Namco has listened to their fans and have improved upon this significantly, with some caveats. The dungeons are now more varied than ever before, having larger fields to explore and on some occasions, multiple areas. You can find little secrets scattered through almost every location, and it makes us so happy to see this shift from the uninspired hallways weve become used to over the past decade. Unfortunately, while this is an excellent change, the dungeons in Arise are short. For the most part, everything is stretched into a singular area with a couple of alternating paths, and only a couple of dungeons having to require load screens. It says something when the final dungeon feels like its larger than every dungeon in the game combined. Fortunately, this is still a major step in the right direction for the franchise, having a freer form design that encourages exploration and discovery.The presentation in Tales of Arise is above anything weve seen from the series before, quite possibly the equivalent of, if not more impressive than Tales of Destiny 2 (Eternia)s transition to Symphonia. Weve had an issue with the visuals in the Tales games of recent, with the last decade not doing much to improve the environmental detail. The focus was clearly on the character models, which made the quality of the products inconsistent. The beautiful art style was still there, but from a technical point of view, the past two games in particular felt held back. The move to the Unreal Engine has done Tales of Arise wonders, with not only the character models and animations looking spectacular, but the environments and special effects holding up to the same quality. Theres a massive level of variety in this world, from the snowy plains to the most elegant castle settings to the overgrown forests. It helps that theres both a Framerate and Graphics options on the PlayStation 5 version, but the latter is not worth the dip from 60fps. The audio department hit it out of the park, with some of the most memorable tracks yet on top of solid sound effects. The musical notes hit hard in various locations and scenes that unfold, immersing the player even more. The voice acting is also on point, although there are a couple individuals who stand out as being a little stiff. Regardless, the presentation is one of the most-improved components to Tales of Arise, excelling it to excellence. Closing Comments:Tales of Arise is the best Tales game in over a decade. Its the advancement the series has needed for quite some time now, such as the far more explorative dungeon designs (as small as they are) and the switch to the Unreal Engine. On top of that, the majority of the cast of characters are compelling enough to keep your attention locked on the story, and the combat reinvigorates the tried and true formula into something special. With that said, there are still plenty of nagging issues. Alphen as a protagonist is dry and makes illogical decisions, there are plenty of JRPG tropes used in frustrating ways, and some of the combat flaws rear their head more than they should have. Fortunately, these pale in comparison to the sixty plus hours youll be investing in this newfound adventure. Tales of Arise maintains all the charisma of past Tales games, but wraps it neatly in an inspiring, fresh experience that will leave you wanting more.", "date": "September 8, 2021", "grade": 4.0}