{"name": "Lumines: Electronic Symphony", "ref": "https://hardcoregamer.com/?post_type=post&p=1914", "text": "Why are we still referring to Lumines as a surprise hit? The series has already been proven worthy, with the original Lumines and Lumines Live! among the best puzzle games of the generation. Whenever a new Lumines is announced, it should be heralded as an automatic buy. Case in point, Lumines Electronic Symphony, the best launch title on the PS Vita.Graphically, theres nothing revolutionary about Electronic Symphony. Its still two-dimensional without the wow-factor of most Vita games. Even still, its a beautiful game. Lumines has never looked better and the entire game pops from the Vitas OLED screen. The new design elements from BUILD really makes Lumines feel cutting-edge. Down to the font, the touch-based menus are intuitive and set the mood better than any Lumines before.The gameplay remains largely the same with a few nice additions. Basically, blocks comprised of four smaller blocks varying in color drop from the top of the screen. You can rotate them and place them wherever youd like. If four or more blocks of the same color touch each other, they are wiped out. The goal of the game is to survive as long as possible without a block reaching the top of screen. Its a simple yet genius design that has always anchored the series.New to Electronic Symphony are avatar powers. Formerly purposeless, avatars now have special abilities that can assist you in-game. One of the more helpful abilities gets rid of all same-colored blocks touching each other. Its activated by quickly rubbing the rear touchpad, the best use of this Vita feature yet. Another nice addition is the ability to continue the main game if you fail. Although you lose your score, it takes away the frustration that came from losing your progress after an hour and a half of playing.Featuring fantastic music from LCD Soundsystem, The Chemical Brothers, Goldfrapp and more, Electronic Symphony has the strongest Lumines soundtrack ever compiled. While all electronic, the music varies between genres such as ambient, house, big beat and more. Due to the mix of genres, the game flows very nicely, sometimes being very mellow before breaking into a big song. This really helps the game replicate a club or concert like experience, especially considering there are a whopping 34 songs.Closing Comments:With a pitch-perfect soundtrack, gorgeous visuals and a long single player mode, Electronic Symphony is the the best Lumines yet. If online multiplayer would have been included, this would have been a definitive puzzle experience. Regardless, though, for fans of puzzle games or electronic music, Lumines: Electronic Symphony is a must-own.", "date": "March 11, 2012", "grade": 4.0}