{"name": "Nexuiz", "ref": "https://hardcoregamer.com/?post_type=post&p=1671", "text": "Do you remember the days of Quake and Unreal Tournament? Do you remember when first person shooters focused more on fast and chaotic gameplay instead of strategic and cinematic set pieces? Well reminisce no longer as Illfonic has picked up the license to Nexuiz, AlienTraps 2005 open sourced PC title, and is bringing gamers a modern iteration of the franchise using Cryteks CryEngine 3. Could it this be a blast from the past, or sink back into our memories as something that should be locked away?There isnt a single player campaign to speak of in Nexuiz. Instead, its a fully multiplayer experience with a side option to touch-up your skills against bots offline. The (vague) story is that two races have fought a brutal war and devastated the planets they reside on. After the long and fierce battle, a peace treaty was signed. Those who wanted to continue the fight were granted an option to battle in an arena as spectators watch for entertainment.As the story alludes to, this is an arena shooter where your goal is to decimate the other team. There is no free-for-all; this is strictly a team-based shooter where your goal is either to kill as many of your opponents as possible or capture their flag over and over again. Its a relatively straight forward premise with some combat twists to differentiate it from other games. Controls feel smooth with a 360 controller and blasting someone into oblivion never felt better. There are nine unique weapons, both with regular and alternate fire, allowing a variety ways to dispose of enemies. Each feels different from the next and are properly placed through each map allowing for strategic play. You dont want to take on a rocket launcher with a sub-machine gun.There are nine different maps, but they dont vary as much as I would have liked it. There are three temple/mountain arena levels that, while differ in scope, have incredibly similar art style. The other six are varied enough to keep it interesting as they partake in a mixture of indoor and outdoor environments with a metallic futuristic vibe. More nature-oriented enviroments such as chilling snow plains or vast rain-infested jungles would have been welcome, though. Lastly, each map is tied to a specific mode. The Refinery map, for example, can only be played on team deathmatch whereas Vigor and Overlook are capture the flag maps. Its always best to optimize each map but without the options of playing either mode, it somewhat limits the options of play.The Dynamic Mutators are by far the intriguing elements of the game. Based on how well youre doing in combat you will be granted mutators that are similar to perks but are activated in the midst of battle. So for example, you start off on a killing spree and get a tier 1 mutator that gives you and your allies infinite ammo for a set amount of time. As you do better you will receive higher tier mutators that you can use to your advantage or could also put a hindrance on yourself. One has you randomly throwing all opponents off cliffs or teleporting them to your location. By far the most ridiculous but most entertaining one is the Illfonic mutator that spawns the developers into the game as floating heads that will shoot lasers at anyone they see. It could be end up working in your favour or it could be a serious blow back. In any case, mutators are what make Nexuiz so much more entertaining and helps cause an already chaotic game to be even crazier.Closing Comments: Nexuiz is a charismatic over the top shooter that will have you begging for more. With its limited amount of options and modes, however, more will be an issue. Expect to mainly play team deathmatch or capture the flag. Still, with its energetic gameplay and low price tag, it certainly fits the bill.", "date": "February 26, 2012", "grade": 4.0}