{"name": "Excitebike: World Rally", "ref": "https://hardcoregamer.com/?post_type=post&p=33827", "text": "A month or so back, Nintendo declared in their new weekly news show on the Nintendo Channel that a surprising announcement would soon be made. Speculations ran wild, but hardly anyone expected the return of Excitebike, especially since Excitebots had released not too long ago. Im here to say that Excitebike: World Rally certainly lives up to all the hype Nintendo created.Not much of the classic Excitebike formula has changed and remains extremely simple. Racers speed down a constant straight-way beset with dirt jumps, ramps, and mud pits. There is no turning, so the d-pad is limited to simply controlling which lane your bike is in and, if you choose, to control your bikes pitch. Players only have an accelerate button and a turbo button at their disposal, making the sideways Wiimote position perfect for World Rally. The bikes turbo supply is unlimited, but using it causes the engine to heat up so you must either let off the turbo until the engine cools down, or drive over one of the cooling strips that are found sporadically upon the tracks.To better utilize the Wiimotes capabilities, players have a choice to control the bikes pitch using the Wiimotes tilt sensors. For those who would rather have a more classic experience, the d-pad can be used instead. Either way, bike tilting will be used to generate soft landings off ramps and to perform wheelies which allow you to catch bigger air or run over obstacles and, strangely, opponents. Sadly the tilt sensors dont respond very well as the bikes pitching has fixed animations, removing any sort of accurate motion response. In fact, you have to tilt the Wiimote pretty far to the left just to perform a wheelie and it quickly becomes tedious, so I suggest sticking to the d-pad.Available from the get-go are three modes: a single-player championship mode where new tracks and bike colors are unlocked, an online-only multiplayer mode (sorry offline fans), and a track editor. The four-player online play is surprisingly well-done, lag-free, and includes a cumulative points system that shows off just how good of a motocrossr you are. The points achieved in online races can be used to unlock additional bikes and special bike colors in single-player, which can then be carried over into online play.World Rallys visuals will appeal to both old and new fans alike. The bikes are pixilated but 3D (at least in the isometric camera angle), yielding a nostalgic yet fresh appearance. The terrain also remains faithful to the original as all the familiar ramps and jumps reappear. The isometric camera is the default view, but purists can activate the traditional side view. Also reinvented are the classic Excitebike themes, and it was delightful to hear the memorable tunes once again.Perhaps the greatest thing World Rally has going for it is replayability. There are four championship cups, each with several unique tracks, and a ton of bikes to unlock. Top that off with a flawless online play and youve got a WiiWare release that will provide hours upon hours of enjoyment. Unfortunately, leaving offline multiplayer out was a huge oversight, especially considering how perfect it would fit in.Closing Comments:", "date": "the Hart on November 9, 2009", "grade": 4.5}