{"name": "Fairytale Fights", "ref": "https://hardcoregamer.com/?post_type=post&p=33815", "text": "If you saw a game on store shelves called Fairytale Fights, youd probably assume it was a piece of kiddie shovelware. That, however, is anything but the case. With a hard Mature rating, this is a fairytale not meant for children. It sounds like an interesting concept, but is it possible to successfully turn childhood fairy tales into violent video game characters?Hack n slash games have been making a little bit of a comeback lately with Castle Crashers topping XBLA sales charts and the classic TMNT 2 being remade, but its been awhile since weve seen a new IP. Fairytale Fights hopes to change that with its unique concept. All of the characters in the game are based on classic fairy tales. You can choose to play as either Little Red Riding Hood, Snow White, Beanstalk Jack and, uh, Naked Emperor. The game begins in Fairytale Village, which is your home base for your game. Here, you can wander around and check your stats, see which weapons you use most, choose game modes and more. The village has a lot of characters and buildings, but unfortunately, you arent able to explore these or talk to anyone. Its unfortunate they didnt flesh out this village more, as in most hack n slash games, this is one of the most enjoyable areas. When you decide to start up a game, however, the real fun begins.The first thing youll notice about Fairytale Fights is how unique the graphics and art style are. Built on the unreal engine, youd expect it to be a dark and gritty game, but the game is very cartoony with cool-looking backgrounds and unique character designs. For a hack n slash, the game is quite beautiful. The combat of the game is great. One complaint Ive always had about these types of games is how hard it can be to line up with the enemies you want to kill. The Fairytale Fights combat system, however, is very intuitive. It knows who youre trying to attack, so you dont have to worry about the frustration of being an inch off with your attacks. The game is incredibly bloody. Once you tear apart an enemy, blood splatters across the screen which you can then skate on.Slashing your way through the level isnt the only thing youll do in the game, though. To progress through most of the levels, youll have to navigate your way through traps ready to chop you up into pieces. Some of these traps can be quite fun and challenging, such as trying to successfully jump from one giant circular saw to the next. Unfortunately, though, because the games focus is divided between these two aspects, it seems as if the level design doesnt open up often, preventing all out melees, which are usually one of the most fun parts of hack n slashers.One of the biggest features of Fairytale Fights is how much weapons it boasts. There are over a 100 that range from standard (an axe) to ludicrous (a swordfish). Finding and trying out these weapons are a fun part of the game, even if a lot of them may be similar in gameplay. To acquire weapons, you either bust open treasure chests or pay  from gold youve earned  a weapons well to randomly spit out one.As fun as Fairytale Fights can be, one of its main problems is its difficulty. In the intermediate mode, its impossible to die, which takes some of the fun out of becoming skillful at the game, as you can just keep coming back to life. The game does penalize you for dying by taking away any gold youve earned, but because the gold system is undercooked, this hardly seems like a punishment. The only things you can use your gold for are the aforementioned weapons well or for building a statue in the village squarethat doesnt do anything.Playing with friends cooperatively online can be a whole lot of fun. The multiplayer mode is the same as the single player mode, but up to 4 people can journey through it. A nice touch to it is that the game lets you push other players around (sometimes to their death), fitting with the mood in the game of being friendly with an evil overcast.Closing Comments:", "date": "October 27, 2009", "grade": 3.5}