{"name": "Kitaria Fables", "ref": "https://hardcoregamer.com/?post_type=post&p=410118", "text": "Kitaria Fables is an oddity as it aims to offer a mix of life simulation and combat akin to something like Story of Seasons: Pioneers of Olive Town, but starring a cat. This, as a longtime cat owner, makes it an objectively better premise. Its even cooler because the player gets a neat sidekick that manages to impart information without being annoying and the combat is far more in-depth than most games like that have a bit of combat in them, but dont have much meat on the bone. Kitaria Fables blends farming, action RPG mechanics, and an ongoing story to create a must-have life simulation for those craving more get up and go and less leisure in the genre.Life simulation games tend to be either too close to a slice of life and lack much punch, or they have a wonky mix of life sim and combat that doesnt feel natural. Games like Animal Crossing go heavy in life simulation, but stand out so much thanks to a lively cast that the more theoretically mundane things actually have a lot of personality. One constant whether its Story of Seasons or Animal Crossing is that story takes a backseat to world-building and there arent many efforts made to have an underlying narrative beyond a sea of objectives. Kitaria features a soldier and his ally out to protect a village, but due to the soldier being the chosen one, there are all sorts of twists and turns in the story and with his character that make it an interesting game to play just to see the story unfold.Its rare that a story winds up being a reason to want to complete objectives in a life sim, but thats the case with Kitaria. The overarching tale about protecting the town goes from being simple protection to finding out about magic users, magic itself being banned in the world, and distrust amongst townsfolk in magic users  resulting in the player wanting to avoid using it nearby. The wise old sage is actually quite a crab apple here instead of just offering advice and its nice to see a bit of logical conflict with that role from time to time. He does eventually get won over thanks to how proficient you get at magic in such a short time, but the in-game lore makes your feline avatar out to be quite the multi-faceted savior. Hes able to master swordplay, bows and arrows, and even multiple types of magic alongside being an ace farmer since your grandfather was. This aspect is where the game truly shines because in every regard, it manages to do all of them well. Short-range weapon combat offers up unlimited attacks and no stamina usage, while also offering a rare quality of life feature that isnt seen in action RPGs. Automatic turbo is applied when the player just holds the action button  making longer-term combat in dungeons and extended combat in overworld areas more fun and minimizing the physical grind needed to excel in combat.This allows the player to have a finer blend of short and long-range combat since long-range attacks using magic are more limited in the amount that can be used due to the mana gauge, while allowing them to start doing damage with a short-range shot and then take a foe out from afar with magic. Bladed weapons are higher-risk, but deal out more damage per-blow while bows are lower-risk but deal out less damage per-shot. Theres a risk/reward element at play akin to a Mega Man Zero experience where using a blaster is safer in theory  but it takes longer to take out foes as a result of its reduced damage output.The combat is fun and fluid, while the farming aspects are surprisingly easy to grasp and make great use of the same high-speed controls as the combat does. This makes things like moving around the field and tilling soil a lot faster than one might expect and a more fun experience. The waiting game is key here  so having the patience to farm is a must, but the rewards are great. In-battle health pickups are available just by farming and the player can make far more powerful meals by combining ingredients. The same principle holds true to having work done on your gear. It takes time to build up the items needed to improve and gain new stuff, but its worth it to have more defense and to have the thrill of increasing your own power throughout the adventure. Visually, Kitaria Fables offers up a simple design  but one thats pleasing to the eye and works well for what the game is trying to do. Nothing looks out of place, the characters all stand out and the in-game world has a sense of cohesion to it. Attack animation is also good and having visual indicators for when enemies are not only about to attack, but their attack radius, makes the action RPG portion of things far more visually interesting and accommodating to those who may just want to play this as a life simulator. Its actually something more games should use because it makes that whole genre more fun to play when the player has a better idea of whats coming their way from an enemy.The audio is a mixed bag as the soundtrack is limited, but whats here is good. The mix of stringed instruments alongside woodland instruments is different. The key music track that plays throughout much of the adventure is beautiful, but there just isnt enough musical variety overall. Theres a healthy amount of sound effect work done, though, making it easy to get a sense for how powerful new weapons are just by listening to them. Closing Comments:Outside of iffy sound design, Kitaria Fables is an outstanding game from top to bottom. The combat is easy to get the hang of and the farming aspects are a blast. Its rare to see a game blend life simulation and combat, but this adventure works great for fans for either genre. Action RPG fans will enjoy the fast-paced combat, while life sim fans will love the emphasis on the characters and their story. Kitaria Fables is a fun time and a must-play for fans of either action RPGs, farming or life simulation games. Its also a great gateway game for fans of another genre who want to try out the other given how well-done everything is done here.", "date": "September 8, 2021", "grade": 4.0}