{"name": "Ju-on: The Grudge", "ref": "https://hardcoregamer.com/?post_type=post&p=33776", "text": "The Ju-on movies (called The Grudge in America) are well-known for two things: meowing naked boys and burbling greasy-haired girls. Recently, both of these lovable ghouls were finally given the chance to star in their very own video game, and well, it actually ends up being an interactive movie.Ju-on: The Grudge is a first-person haunted house simulator. Really. It says so on the cover! There is no fighting, and the infrequent action scenes are simply quick-time reaction sequences. The entirety of the game pretty much boils down to scripted jump-scares and find the door key hunts. The problem is that the jump-scares are more annoying than frightening, and far too predictable. Ten minutes into the game I found myself being able to calculate exactly when something is going to happen and nine times out of ten I was right. Sure, there are some genuine frights, but its only a matter of time before the random bangs, falling objects, and gurgles become tiresome.The entire experience is played solely with the Wiimote. Moving the Wiimote controls an on-screen flashlight, while (A) interacts with the environment and (B) moves your character forward. The biggest problem with the controls is the unresponsive motion. The Wiimote must be aimed to the edges of the screen to turn  like most Wii FPSs  but occasionally the game responds erratically and either takes an agonizingly long time to turn or goes ballistic and sends your aim into random directions. Even when it does behave correctly it feels sluggish. On top of that, the characters walk ridiculously slow (god forbid when you have to backtrack), almost as if they are on a leisurely stroll and just taking in the sights. I dont know about them but Id probably be walking pretty briskly, what with the mischievous ghosts trying to rip off my arm and the hand-print blood splatters appearing in front of my very eyes.There are two ways to die in Ju-on. Either have your flashlight run out of batteries (which are coincidentally scattered throughout the levels) or dont react quickly enough during the reaction sequences. Sadly, if you die, you are sent back to the beginning of the level to relive all the scripted scares. The only thing that is different with each play-through is the location of the batteries, and needless to say that isnt exactly reason enough to want to replay levels.The introductory cinematic is a live-action video of someone walking into a house, seeing some really bizarre crap, then going upstairs where a creepy girl starts croaking  the very familiar death rattle heard in the movies. Fast forward to the actual in-game cinematic, and players are treated with a horribly rendered hyperventilating dog who stumbles upon a half-naked catboy before running after it into an abandoned factory. Naturally, the dogs owner decides that she should go investigate.Its a shame the developers didnt keep the live-action cinematics going beyond the introduction, because while it isnt particularly expertly done, it is definitely better than the cinematics using the game engine. Luckily, the engine looks rather nice during gameplay  at least, the parts you can actually see. The flashlight does have a problem penetrating the darkness, so only when youre close to objects and walls will you actually see anything (get ready to look at the floor a lot when walking in larger areas). The environments are well-done though and look appropriately aged, and the characters look decent as well, its just a shame the flashlight sucks so bad. I understand they were trying to make it feel claustrophobic but come on, my dollar store keychain light works better than this.The only other mode available is multiplayer where player 1 goes through previously completed stages while player 2 controls the scares. At any time the second player can press a button to make a ghost suddenly appear, or an object fall out of the sky, and so on, but the buttload of shock moments just ends up becoming humorous.Closing Comments:", "date": "the Hart on October 13, 2009", "grade": 2.5}