{"name": "Scribblenauts", "ref": "https://hardcoregamer.com/?post_type=post&p=33748", "text": "Scribbling its name into DS puzzle history is Scribblenauts, a game that essentially puts you in the shoes of god and has you completing hundreds of tasks. Its the kind of game that will have you enticed by its adorable charm and innovative gameplay offering nothing but an immersive and well designed experience.Players take hold of Maxwell, a kid who is apparently so powerful he has complete control over god himself. The basic premise of Scribblenauts is simple. Using the games immense search engine, youre instructed to find objects or beings and place them within the world in order to overcome puzzles and challenges. While this may sound easy, it will only take a few chapters before your brain begins to go into overdrive. This is probably one of the few titles that will practically require you to have a big imagination and a vast vocabulary. Without one, youll find yourself stuck at the beginning of the game. Thankfully, if you ever get fed up with a challenge, you can always relieve that stress by putting multiple beings up against each other to see who will win in an all out war.There are well over two-hundred challenges to complete throughout the campaign of Scribblenauts. Half of these are relatively simple and easy to understand, whereas the other half caters to hardcore and determined players. As you progress through the game, your objectives will become increasingly more difficult, some of which will press you hard for time and quick thinking. This is where the game shines the most as each puzzle is incredibly creative and offers tens, if not hundreds, of ways to complete. There are obvious paths to take, but there are also alternate ways that you may have never considered before.Scribblenauts levels are varied and balanced quite nicely. You start off with the simple outdoor activities, move onto events in the big city, and eventually find yourself co-mingling with aliens in space. Each chapter will gradually build up its difficulty, forcing you to get a little more creative with your entries. Its impossible to say that anyone can pickup and play through the game with no problems as it is a lot harder than its lead to be, but anyone can certainly get past the first couple of challenges without any issues.There is much to be loved in Scribblenauts, but unfortunately, the controls can be a bit unforgiving at times. For the most part, the creation tools can be handled without any trouble, but it is the movement of your character that can get out of control. It may be just the number of interactive material in the game, but Maxwell can find himself in an endless loop of hopping into an object, or jumping over something hes not supposed to. Closing Comments:", "date": "September 13, 2009", "grade": 4.5}