{"name": "DiRT 2", "ref": "https://hardcoregamer.com/?post_type=post&p=33674", "text": "Back when it was announced that the Colin McRae series of racing games was to have no more sequels and that the Dirt franchise there was some mixed feelings and apprehension. Dirt wasnt a bad game by any stretch, but it did suffer as a franchise that didnt seem to know its identity. There is none of that suffering in Dirt 2, or really anything that would even near unpleasant, as the game shows that the franchise now has a clear direction locked in for itself. A delicious mix of various racing disciplines from rally racing to raids, Dirt 2 represents the successful marriage of technical racing skill with a presentation straight out of extreme sports.In Dirt 2 you start off by naming your racer and picking one of the many nicknames available that the various voiceovers will address you with. You start off with a relatively small amount of cash and just one vehicle to call your own, but as you compete in events and complete them you gain both money and experience. Gain enough experience and you level up, which unlocks additional events to compete in as well as new goodies such as liveries, hula girls, and fuzzy dice for your car. The toys are obviously humor based, though it is pretty funny to see how much you can get those dice rocking in a Baja race.There are quite a few different racing events that you can tackle to help get some scratch. Raid races pit buggies and trucks against each other in hilly and branching tracks, while rally and trailblazer races are more or less single participant races to see who can get the fastest time through a track. Rally cross races blend off-road with pavement for some interesting transitions, and last man standing races systematically remove whoever is in last place every few seconds until only one racer remains. Rounding out the pack is race types such as gatecrasher which pits you with the task of busting through small foam obstacles to keep your timer going and domination which splits the track up and awards points based on the drivers who complete each section the fastest.There is a decent-sized stable of vehicles that you can purchase and use, and though some vehicles can be upgraded for various racing disciplines you wont ever see a buggy in a rally race. Vehicles definitely have their own handling characteristics and feel, and upon purchasing a new vehicle it usually takes a race or two to really suss out how it handles differently from your other rides. Vehicle control makes extensive use of your abilities to use the stick and triggers as analog controls and not just small on them to guide your car, as doing so at high speed will usually have disastrous results. Properly guiding your land rocket around the cliffs of Utah will often require dainty adjustments to your steering and throttle, not to mention compensating for the terrain type and how your car is shifting. It is rewarding when you get it right however, coming off of a crest and sliding around a gravel bend like a pro.Of course, there is also some degree of satisfaction when you completely lose control and slam into an embankment that sends you spiraling through the air, or land from a ramp in a rollover. The way the cars react to the changes in elevation and terrain type of the track is impressive, as are the models themselves and how they get dirty and take damage. The damage modeling in Dirt 2 is fairly limited, classifying damage based on categories of severity, but hit a boulder at full speed and rest assured that your car will no longer be able to run, let alone participate in the race. Depending on the difficultly level however this doesnt necessarily mean that your race is over, as you have the option to flashback to a recent part of the race and a chance to avoid making the same mistake twice.Flashbacks are limited based on the difficulty level, with the lower difficulty levels letting you use the feature between one and five times in a single race and only the highest difficulty level removes the feature from use. If you hit the Back button and view the instant replay you can use the replay controls to rewind back up to fifteen seconds or so. At any point in this reply you can press the X button to rewind the race back to that exact point in time, with the camera snapping into a couple different angles before setting itself just as it was at that point in time. There is no penalty for using the feature, and while this can be viewed as cheapening the experience it also means that you can use it in the event that you make one silly mistake at the end of a long rally and dont want to redo the whole thing because of it.The presentation of the game is based heavily on that of the X Games, but not to the point that it becomes over the top. The menu design has your viewpoint moving around the interior of an old RV filled with tour maps and magazines that serve as your menus of selecting your next race event and settings for it, moving outside the RV into the cordoned off area around it when you are looking at Polaroids of your cars to choose one for the race. Even the loading screens are interesting, as they show a 3d layout of details of the upcoming race as well as post-it notes showing your current progress towards some of the games many achievements.Closing Comments:", "date": "September 8, 2009", "grade": 4.5}