{"name": "inFAMOUS", "ref": "https://hardcoregamer.com/?post_type=post&p=33640", "text": "PS3 owners rejoice! Infamous will make your Xbox playing cohorts green with envy. Like Naughty Dog with Uncharted: Drakes Fortune, Sucker Punch really shows it can transcend the kid-friendly reputation of the Sly Cooper series and give us a high-action thrill ride for the adult gamer. Infamous is a beautiful and challenging game that will make you go back for seconds.The game opens up with a man named Cole receiving a package. Within it is the ray sphere, a weapon of mass destruction that can give people super powers. After a massive explosion, Cole is left as the sole survivor and is tasked with putting the pieces together with his new-found electric powers.Infamous is beautiful. The particle effects for the lighting, explosions, and fire are amazing. With that said, graphics are Infamouss weakest area overall. Buildings are reused throughout the city and its easy to confuse one borough for another. The saving grace for this is the map and that each of the three boroughs has its own enemies. The character models also look a bit rubbery and fake when you see them up close. Thankfully you hardly ever do, except at the beginning of missions.The gameplay is where Infamous really rises above the rest. Progressing through the story earns Cole various powers that can be upgraded with experience points. These powers range from methods of transportation to combat technique and not one is useless. Often during some of the larger-scale fights you will find yourself using everything at your disposal, from the explosive Thunder Drop to the lightning rocket known as the Megawatt Hammer. Even with all the power in Coles electric fingertips, you will still be challenged throughout the game. While going into a fight with guns blazing is one option, falling back and taking to the rooftops leads to a slew of different ways to take out the enemies. The only real problem with the gameplay is that a lot of the missions get reused excessively.Infamous gives you choices when it comes to Coles morality. Some of them are gray but most are clear-cut. Those who like to stay in the middle wiill not be rewarded as well as those who go fully good or evil. The games good and evil routes lead to different powers and even change how some powers work. Each route changes the gameplay a lot and the story a little, so Infamous has a lot of replay value.Infamous only has a few technical issues. The camera is a bit wonky outside of aiming, but is something that you can get used to after a bit of playing. During the review, a few glitches did crop up that are worth mentioning. During two different missions, Cole fell through the worlds geometry. It was impossible to progress without hitting the reset button. There was also a random freeze during another point in the game where the entire system had to be rebooted in order to continue play.Closing Comments:", "date": "May 26, 2009", "grade": 4.5}