{"name": "Excitebots: Trick Racing", "ref": "https://hardcoregamer.com/?post_type=post&p=32915", "text": "When the Wii launched, Excite Truck was one of those games that gamers everywhere were eager to play. It was the first game that showed off the Wii remotes ability to function as a steering wheel. It was also the spiritual successor to the 1984 cult classic Excitebike. However, the game fell victim to a less than ideal control scheme. Nevertheless, Excite Truck was a good enough product to warrant a sequel, enter Excitebots: Trick Racing.Excitebots: Trick Racing does not improve the general control flaws that were present in Excitetruck but instead opts to add some fun distractions to the general racing formula. The distractions revolve around the fact that instead of trucks or bikes, players control bots. Each bot is designed after an animal including frogs, beetles, bats, and turtles. As a result players are able to glide with wings, grab onto poles or even stand upright and dash. Each of these features are controlled by context sensitive Wii motion controls which breaks up the monotony of a simple arcade style racer. Excitebots also offers up to six player multiplayer over Nintendos Wi-Fi Connection, so those wanting to challenge other human controlled bots will be able to do so.While the standard racing is fun, the real fun of Excitebots comes in the form of the various mini-games. There are sports modes where players can try their hands at bowling, scoring soccer goals, kicking field goals, or even throwing darts. Each one is fun and challenging and posting high scores provides a special sense of satisfaction.Another standout mode is Poker. In it players compete to create the best possible five-card Poker hands. Each hand banks a certain amount of points depending on the strength. However, it is also important to complete each track quickly as bonus points are awarded to the top finishers. Ultimately the winner is the player with the most total points. As such the mode is an interesting blend of strategy and downright speed.Excitebots also has plenty of unlockables. During each race players accumulate stars which can be exchanged at the store for new paint jobs new bots, and new cups a la Mario Kart. These unlockables add to the longevity of a game which already has plenty of replay value.Closing Comments:", "date": "April 20, 2009", "grade": 3.0}