{"name": "Ready 2 Rumble Revolution", "ref": "https://hardcoregamer.com/?post_type=post&p=32893", "text": "There was just something downright fun about playing the original Ready to Rumble. Im not sure whether it was the pick-up-and-play arcade-style controls or the over-the-top cast of characters that filled out the roster. I am sure, however, that the latest entry in the series, Ready 2 Rumble Revolution, has neither.At first, everything in Ready 2 Rumble seemed to be going along smoothly. The create-a-player, while not as robust as other games, was good enough to make some funny looking boxers that fit within the overall aesthetic of the series and there seemed to be a fair share of unlockable outfits and accessories. There were also plenty of modes to explore including training, exhibition, and championship modes. After creating a character and taking him through the paces, receiving some monstrous beat downs along the way, it was obvious that there was just something not right with the game, the control scheme.Punching is handled with a flick of the Wii Remote or Nunchuk and dodging is handled by swaying the controllers to the sides. To throw some more powerful blows requires a wind up and then a final flick to deliver the blow. The developers managed to throw in quite a few moves, blocks, and counter moves. However, none of the controls respond the way they are supposed to making any sort of strategy or tactics a moot point. Every match inevitably devolves into random Wii Remote flailing contests that are entirely dependent on luck. Its a shame because if the controls were not so unresponsive, there may have been a fun game of arcade style boxing to enjoy.Unfortunately the poor controls extend beyond the ring. The training mode, where created boxers can improve their stats, is a collection of mini-games each geared towards a specific stat. The controls for these mini-games range from highly irritating to downright broken. Some attributes just simply cannot be raised because the mini-games are impossible to complete with the given controls. Its a tough break because without leveling up, the computer controlled characters are practically unbeatable.The stock characters are the only other option, but instead of classically inspired characters based on stereotypes, Ready 2 Rumble Revolution features some pale knock offs of real world celebrities. The Flying Tomato (Shaun Whites nickname) has been changed to the Red Dermato, a terribly unimaginative sound alike. Brad Pitt, David Hasslehoff, and David Beckham also get to see thinly failed lame recreations of themselves.Closing Comments:", "date": "March 18, 2009", "grade": 1.5}