{"name": "Race Pro", "ref": "https://hardcoregamer.com/?post_type=post&p=32786", "text": "It can be easy to think you are supremely good at racing games when you have help like stability assist, anti-lock brakes, and traction control to keep your expensive race car glued to the track. RACE Pro has these options for budding racers, sure, but with them turned off the racing gameplay takes on an addicting if not masochistic feel where steady hands and smooth motions prevail. There is much to love here from the standpoint of a racing purist who loves their realism, but off the track where this game lacks a coherent direction.The premise of RACE Pro is straightforward. You are a racer starting your career, intent on proving your worth to increasingly competitive race teams. When applying to get a contract with a race team, you can either go the expensive and easy route of just buying into one, or you can choose to try and race a lap on a certain track within a set time limit to qualify for a hefty discount. Once you have a contract with a team you end up racing using their vehicles in a tournament, and depending on your final standings you gain a certain amount of credits and often a new car for use online or in the single race modes. As for your career you can continue it onwards by taking that tidy sum of credits to get a new contract with a new team, either in the same tier or in the progressively harder tiers that have higher costs of entry and much higher performance cars.While the parts on the cars themselves can be tweaked in areas too numerable to list, you wont find yourself swapping out parts of vehicles or changing their cosmetics. Credits are only used for progressing your career and gaining contracts, rather than using them to also buy new cars or upgrade existing ones. With the purpose of credits limited only to this progression, it does hamper their inherent worth, as they are essentially just a measure of your racing reputation. This makes any gameplay not related to racing essentially meaningless. You are simply racing in tournaments to gain enough credits to enter other tournaments, repeating until there are no more tournaments to enter.The racing physics are quite solid, which is very apparent when you turn off all of the assists and let things boil down to sheer driving skill. Of course this means spinning wildly off of the track often at first, but once you get a feel for the subtleties of easing into turns, softly applying the brakes, and smoothly accelerating back onto the raceway you begin to appreciate the difficulty as a benefit. There are some caveats however, as there is no real reason to adjust the difficulty level in either direction. Whatever setting you use, youll still earn the same amount of credits and tournament standing points at the end of the race. On any difficulty setting the opponent AI is often questionable, almost robotic, with only a few ways at its disposal to attempt to avoid collisions.Closing Comments:", "date": "February 17, 2009", "grade": 2.5}