{"name": "Left 4 Dead", "ref": "https://hardcoregamer.com/?post_type=post&p=32739", "text": "I should probably get this out of the way right now: I truly believe Left 4 Dead is the greatest cooperative multiplayer experience to date. This game is getting the full monty, the legendary 5 out of 5, one hundred percent, as perfect as a game can possibly get in this day and age. Im saying this here in the first paragraph so that you can stop looking at reviews and just go get the game already.Now, it should be said that if you are looking for a zombie game with a strong narrative or a compelling storyline you might be in for a disappointment. Left 4 Dead is made up of four campaigns containing five maps each. The campaigns are mostly self-contained and are presented as four individual movies. The stylistic choices the developers made help add to the feel that you are playing through a top new-school zombie flick. There really isnt a storyline to be had, and there is no real explanation about why you are being attacked, but that is part of the fun. Using little bits of easter eggs and your own imagination, you can piece together some backstory for yourself if need be, or just shut up and shoot something.Each of the campaigns and any of the maps can be played cooperatively with four players in online or LAN mode, or with two players in offscreen splitscreen mode. If youre playing solo you can get by with AI partners, but skip this and play online if at all possible. It isnt that your team AI is bad, it is just that you miss out on some of the biggest social aspects that help make this such a fantastic experience.Playing Left 4 Dead with three other people really is like watching a good horror movie with your friends. The difference is this time you are the one blasting the ghouls instead of just being a passive observer. Left 4 Dead certainly gives you a huge amount of expletive laced exclamations and part of the fun is sharing those holy shit moments with other people. Playing on harder difficulties and organizing tactics and strategies with your team is what makes everything feel so rewarding when it works out, and what makes replaying difficult parts over and over again a good experience instead of a repetitive one.Not enough can be said about how well the AI director actually works. Part of the reason you dont feel limited by the relatively limited number of campaigns is because every single time you play through the game is different. At no point can you or your teammates just stick to the same strategy over and over again. Weapons, health packs, and enemies all spawn at different times and in different locations than times before. Amazingly enough, it does this without ever feeling cheap. Those who have played the game know well enough that the AI likes to blitz you with as many special enemies as possible at the worst times, but this just makes the times you get through it more rewarding instead of making the times you dont more frustrating. This is a game that has infinite replayability even before you factor in what the modding community is going to end up doing. With mods that turn the game into Shawn of the Dead and add the Crossroads Mall in its entirety already on the horizon, it is pretty easy to believe this game will end up being played for as long, if not longer, as the other Valve juggernaughts.The mechanics of the game work out better than most, but a lot of that can be contributed to the fact they focused mainly on the cooperative aspect. Being able to see the highlight of your partners through walls is a lifesaver when the gritty darkness of the level design is taken into account. The on-screen prompts combined with the video and audio cues help you change strategies on the fly, and with an experienced team communication isnt really even necessary. When the horde music starts to play, everyone knows to hop into the best defensive position they can find. When a partner is captured or incapacitated by a special enemy, you are forced to hatch a quick rescue in order to minimize damage. Some of the most fun moments are during particularly hard panic events or finale scenes when, inevitably, someones first plan fails and the next person takes a turn hatching a strategy to defeat the zombies and move on or find rescue.The only way anybody could be remotely disappointed with this game is if they somehow ended up expecting something completely different, or if you are the kind of person who just cant wrap their minds around being able to play as a team. The only real negative is when you get stuck playing with those kinds of gamers. You know the type, the kind that think Halo 3 is the be-all and end-all of online shooters. The kids who think every single game should be able to be played as Rambo and anything less is lame. This is not the game for those people, at all. Sure, there is a versus mode, and that mode is pretty fun but, at this time, only two of the campaigns are playable and depending on your patience it can be pretty annoying. A few bugs and exploits that made it through playtesting also help to make versus mode a little bit less fun than it should be. Oddly enough, the best part about playing Versus mode is that it is nearly impossible to win against a good human-controlled team of infected. This makes things much more suspenseful and being able to switch sides every round and cause some revenge-filled havoc against the team that just whipped you is pretty rewarding.Closing Comments:All in all, if you know from the start you are getting into a game that is entirely based around its cooperative multiplayer elements you are going to be rewarded with hundreds of hours of the best gaming experience you have had in years. If you were looking for a game you could blow through by yourself, maybe because you have no friends due to your poor hygiene, then you might want to look somewhere else. Just let me know if you didnt like it though, that way I know not to save you during the inevitable zombie apocalypse.", "date": "November 17, 2008", "grade": 4.5}