{"name": "Blitz: The League II", "ref": "https://hardcoregamer.com/?post_type=post&p=32045", "text": "The idea behind Blitzs gameplay premise has always been sound: Take the intensely aggressive game of American Football and crank it up to eleven by letting players literally break each other apart while on the field. While Blitz: The League II is no different, and features some of the most bone-crunching gameplay the series has seen yet, it also lacks much in the way of a proper football game. Though on the surface the game is all about causing physical violence, at the end of the game it is still about who has the most points on the board.Theres no arguing that beating the snot out of your opponents is quite fun. The game features the Clash system, a meter that fills up every time you make a big play and, when used, allows you to pull off impressive jukes, catches, and tackles in slow motion. Performing a tackle while in Clash results in a dirty hit, which amounts to your pulling off an overpowering tackle that would make any NFL referee throw a flag and possibly call the police. As you pull off these moves in Clash you earn a Clash badge for each one, and when six of them are acquired your team enters the Unleashed mode.While in Unleashed mode your Clash bar is immediately refilled and your next Clash move is made much more over the top. Pulling off jukes that cause your would-be tackler to literally break his ankle or engaging a three man tackle against a wide receiver that results in a broken spine or ruptured scrotum are often the result of doing so, complete with suitably cringe-worthy cutscenes actually showing the damage occurring. Injuries like these can also happen during the course of the gameplay, and at times you can actually choose which area on the victim you want to injure and then mash the A button to inflict maximum damage. There is a wide swath of injuries in the game, ranging from mere dislocated shoulders and bruised kidneys to shattered vertebrae and fractured skulls.Many things in the game boil down to arcade-style mini-games, such as pressing the specified order of buttons to kick a field goal or punt and the treatment of injured players. Dislocated joints are resolved by moving both sticks in a specified direction and snapping them back towards the center, while other injuries are treated by injecting the player as close to the injury location as possible as they thrash about in pain on the bench. These mini-games make it possible to concentrate on the core offense versus defense gameplay and get back to it quickly, rather than fretting about the angle and elevation of your punters kick.However, it is this gameplay that suffers as a result of all of the above. While the Clash and the Unleashed mechanics work well and are incredibly enjoyable, playing the game without them is incredibly sloppy. When one team has plenty of Clash they can easily make big plays, which regains their Clash and then some, while a team that has none often finds that they cannot gain any. Using your Unleashed completely drains your Clash and makes you start from scratch, which is a major disadvantage in using it even before you realize that you have no choice *but* to use Unleashed once it is available. Though teams are rated based on many factors, you still get mostly the same gameplay if you pair up the best and worst team in the game than if you pair up two more adequately-matched teams.Closing Comments:", "date": "October 12, 2008", "grade": 3.0}