{"name": "MotorStorm: Pacific Rift", "ref": "https://hardcoregamer.com/?post_type=post&p=32026", "text": "When the PS3 launched, there were only a few must-own games for a while, one of which was the excellent racer MotorStorm. Two years and one acquisition later, MotorStorm is back with the sequel MotorStorm: Pacific Rift. Does the jungle environment breathe new life into the MotorStorm series, or is Pacific Rift a disappointing cash-in?The original MotorStorm was all about tearing up off-road environments at high speeds. Pacific Rim definitely delivers the same thrills. There are sixteen tracks (double the eight tracks of the original game), all of which are expertly crafted. While the original featured mostly canyon/desert courses, the tracks in Pacific Rim are all in the jungle. The tracks have a really cool vibe to them. While they might be marked in the traditional sense, the multiple routes through overgrown jungle growing all around make you feel as if youre creating your own route.All of the vehicles in the game handle very well. Instead of cars varying on speed and acceleration alone, different vehicles do better in different environments. For instance, one of the buggies has great speed, but it will swerve horribly in water. It really adds more depth when it comes to choosing what to race with. Theres a new class in Pacific Rift, the big and bad Monster Truck. Monster Trucks are a lot of fun to play with. They are able to crush almost all of the other vehicles, which feels incredibly rewarding to do. Like most vehicles, however, the power comes at a price. The Monster Truck can easily flip over, so youll have to crush with caution.The graphics are very attractive. There is a cool seamless effect when the camera shifts that really impresses. The crashes in the game are simply awesome. They follow the laws of physics and, much like Burnout, are entertaining to watch. Adding more realism to the game, mud can often splash on to the screen. Just like the original, MotorStorm: Pacific Rim definitely has some of the best graphics on the PlayStation 3.The game has a really slick presentation. When you first start out the game, you can select from a large amount of male/female character models, allowing for a more personal feel with your racer. All of the menus look cool, and theres always a rocking track playing in the background. The soundtrack of Pacific Rim is awesome. All of the songs are dance-punk, electro or techno, including great artists like Death from Above 1979 and Boyz Noize. The music really gets you pumped up during races.Closing Comments", "date": "September 27, 2008", "grade": 4.0}