{"name": "Disgaea DS", "ref": "https://hardcoregamer.com/?post_type=post&p=31260", "text": "Disgaea DS is a grid-based strategy RPG, and is mostly a straight port of Disgaea for the PS2. As with the original, players guide Laharl, the demon prince of the Netherworld, through a ridiculous plot to reclaim the throne of the Netherworld in the face of his fathers death. After a two-year nap, the prince is a little rusty, but with some help from his loyal vassalssilly, demonic penguins with knives, known as prinnieshe plans to make great strides, and even surpass his fathers impressive legacy.As it stands, the gameplay from the original Disgaea is intact, along with all the bonus content from Afternoon of Darkness (the PSP port of the same game). The main story remains unchanged, so for anyone who has played either of the previous titles, theres literally nothing new as far as the main game goes. Battles take place on a 3D battlefield, with movement and attacks bound to a grid. Using whatever skills, weapons, and magic he has at his disposal, the player helps Laharl blast through the main story of the game. What Afternoon of Darkness brought to the table was the ability to play from the perspective of one of Laharls vassals, Etna. This added some replay ability, as well as an increased difficulty, which is welcomewhen the player finally steamrolled the story line in the original, there was nothing left to do but grind for hours, powering up items and characters in order to take out the ridiculously-leveled final secret boss. Essentially, Etna Mode is more of that, but the added story helps to ease the monotony of endlessly leveling up. The inclusion of Etna Mode into Disgaea DS is certainly appreciated, as it allows people who dont have a PSP and newcomers to the series to enjoy more of the entertaining, silly plots.I expected to find some glitchy animation tucked away somewhere, or other bugs or omissions that crop up with ports, but Disgaea DS had none of those issuesthe game is as solid as the original, with all the grid-based, strategy combat you could ask for. If you liked the original, youre not going to be missing out on a thingand if this is your first time experiencing the game, you couldnt have done much better. Disgaea DS does lack some sound, having cut out many of the voices from dialogue scenes, but when you compress a DVD down to a flashcard you have to make a few sacrifices; it does hurt the overall presentation, but its the only thing with which I have any complaints.Now that we have the negative out of the way, lets move on to some positives.The DS version has four new additions, all of which are pretty cool in their own right. The first obvious change is the addition of touch screen controls. I found them to be a little frustrating at first; the camera is positioned in such a way that selecting exact squares can be very tricky, especially squares that are hidden from view. However, it is nice to be able to select units that are some distance apart without having to move the cursor across what seems like an infinite gap. Moving Laharl around out of battle is easily accomplished, and the camera is much easier to manipulate with a few clicks instead of button presses. Particularly, shopping, item management, and other tedious selection tasks and menus are streamlined with the stylus, which makes it seems more like a useful tool instead of a novelbut worthlessindulgence. It isnt a necessary addition by any means, but touch controls are a welcome change of pace.Disgaea DS also makes use of the top screen during combat, with something called the NAV Grid. It acts as a handy overview of everything on the map, with all squares clearly marked by their geo panel color, and impassable squares grayed out. Enemies are colored-coded red for your convenience, with allies in blue; whenever a unit has used up his turn, his marker also grays out. When a unit uses a skill, the affected area is also highlighted on the map. Overall, the NAV Grid makes it very easy to keep track of everything, which is fantastic in many of the more confusing stagesoften times, Item World stages can have terrain features that block the camera, and so having a different point of view is very appreciated. If you havent already played Disgaea, its difficult to imagine exactly how useful such a feature is, but it really is a life-saver; in the original Disgaea, I found it impossible to complete some stages, simply because the height of the terrain kept me from being able to see exactly what I was doing, and I wasted a lot of playing time cancelling and reselecting orders till I finally found a suitable placement for my units. The NAV Grid cuts out all the guess work, which means you can go right back to playing, even if you cant see where your units are.Of course, DS-centric additions are only the icing on an incredibly delicious cake. The two real additions are Pleinair as a playable character, and the Prinny Commentaries.Fans have been waiting ages for the blue-haired girl to be a playable character, and she certainly doesnt disappoint. Her stats are rather unique, even for a secret character, which helps to keep everything fresh. Instead of focusing on attack power or magic like most other characters, shes based around speedit makes for a very different character build, which makes leveling up equipment that isnt a sword finally viable. Usually, players would stick to leveling up only the main character, Laharl, as it was the quickest path to beat the main game. In subsequent plays through, there would be little use to leveling up anything other than a sword userchances are the player had already started making gear with a lot of ATK, which made anything that wasnt melee impossibly hard to bring to the same level. Pleinair makes that grind less necessary, because her particular character can completely avoid attacks that would be fatal to an ATK-centered character, which makes for a refreshing change in tactics. As a mascot character, her inclusion is always welcome, but the fact that shes a useful character as well is wonderful.The Prinny Commentaries, however, make the whole game. Normally, story scenes take place on one screen, which left the second DS screen with nothing to do. What was NIS going to do with all that empty space? The answer: add a prinnywhat else?The prinny hangs out on the top screen, and he is a very cool dude. Hes got all kinds of funny and insightful things to add to the scene playing out on the lower screen, which makes playing even the tutorial worth the experience. For people who already own the other two games, the story has probably become old hat by nowbut with the simple addition of a wise-cracking prinny, its almost a whole new game. It used to be that if you wanted to see more than one ending, youd have to sit through the story mode multiple timesand with sufficiently-leveled characters, it was more of a chore than anything else; if you wanted to see every ending, youd likely fight through the same stages and story dialogs, skipping every scene you could. The Prinny Commentaries, however, give you a break from the repetition. Instead of listening to the same lines over and over, the top-screen prinny is there to give you a fresh spin on what you already know, which makes listening to character jokes for the second or third times more than bearablewhich is something every port could use a little of.Closing Comments:", "date": "September 22, 2008", "grade": 3.0}