{"name": "The Witcher: Enhanced Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=31247", "text": "Every once in a while, a game comes along that reminds us that PC gaming is a long way from extinction. The Witcher: Enhanced Edition is a shining example of how a game with a simple point-and-click control scheme can still suck gamers into a totally unique experience that can last for dozens of hours.When The Witcher was first released in October of 2007, it was met with favorable reviews from many outlets, but it could have used a few tweaks here and there. Developer CD Projeckt listened to the fans of the game and decided to release The Witcher: Enhanced Edition in September of 2008. The Witcher: Enhanced Edition includes new lines of dialogue, better translations, and over 200 new character animations that give the citizens of Temeria a little more life. The end result is the same great game, but only better.The Witcher: Enhanced Edition follows the story of Geralt (also known as The White Wolf): a Witcher who specializes in exterminating monsters with superior strength, speed, and magical abilities. The story takes off like many other games in the action RPG universe with Geralt losing his memory after an unpleasant encounter. Consequently, he must relearn all his abilities while he embarks on a quest to retrieve sacred Witcher objects that were stolen. The main story wont win any awards for groundbreaking originality, but the incredible amount of depth The Witcher: Enhanced Edition contains easily makes it one of the best PC titles in recent memory.Controlling Geralt is as easy as pointing and clicking a mouse. There is another option for using the keyboard and mouse in combination, which brings the camera down to ground level, but both ways are really easy to pick up on. Clicking once on the landscape will move Geralt to the desired location whereas holding down the mouse and dragging will give Geralt constant movement. While navigating around the environments, the camera sets itself slightly above Geralt to prevent multiple enemies from being obstructed by random structures. This works well in combat as keeping a birds eye view of the action is essential for preventing an unnecessary death due to a foe you didnt know was pummeling you.Geralt can carry a few melee weapons such as daggers, axes, and his trusty steel sword. He is also a master of different combat styles that fit any situation. Geralt can switch between quick, heavy, and group stances. Each stance looks noticeably different as Geralt swings away like theres no tomorrow. Understanding what enemies are weak against a certain stance is essential for successful encounters. Quick moving opponents will constantly dodge Geralts attacks if he is in heavy stance, which makes the battle incredibly one-sided. If an enemy is quick, Geralt must be quick. Extra attacks can be performed by clicking the mouse as soon as you see a flaming sword.It takes a little getting used to but quickly becomes second nature. Switching between stances can be done simply by clicking the corresponding symbol at the top left of the screen or by pressing the space bar. This will pause the game so you can choose the appropriate style. Doing this does remove you from the action, which would otherwise be very satisfying. As Geralts level increases, points are given to choose which abilities the player wants to upgrade. Each of the abilities requires either a bronze, silver, or gold talent. The interface is set up similar to the chaining system found in Final Fantasy XII. You have to upgrade all of Geralts attributes separately, so customization is highly encouraged.When youre not in the heat in battle, youll find yourself visiting the locals to accept side quests. One of the problems with The Witcher was the odd translations that plagued dialogue. The developers kept sentences short to be on the safe side. More lines of dialogue have been added in The Witcher: Enhanced Edition, but it still sounds a bit odd at times. The character movements while speaking have also gotten a slight upgrade to make them seem less robotic. Their facial expressions and body language are little more natural, but its still a noticeable flaw.The overall graphics in The Witcher: Enhanced Edition is above average. That is to be expected, given its somewhat demanding recommended system specifications. Looking at the combat from the over the shoulder camera perspective is the best way to observe the subtle wind effects of Geralts sword. Occasionally, some character renderings can show a hiccup such as a shirt collar that extends into the sky, but it doesnt occur often enough to be too distracting from the overall experience by any means.Closing Comments:", "date": "September 15, 2008", "grade": 4.5}