{"name": "Viva Pinata: Trouble in Paradise", "ref": "https://hardcoregamer.com/?post_type=post&p=31234", "text": "The piatas are back and theyre just as odd as ever. Viva Piata: Trouble in Paradise is a reworked version of the original game released in 2006, adding new piatas and items to use in your garden as well as overhauling some aspects of the original game that just werent quite right. It is more of an expansion pack than a true sequel and owners of the original title may not find enough new content to warrant the sticker price, but those who didnt pick up Rares colorful title the first time around will find plenty to enjoy.In the game you play the role of a gardener and are tasked with first shaping your plot of land to attract nearby wild piatas, then getting them to mate to produce offspring. On the surface the game is quite simple, but the real dynamic comes in how relatively small your garden is. Careful thought must be put forth into arranging your garden to cater towards various piatas without wasting any space or resources. Crab piatas will need sand while others might prefer grass instead, and thats not even getting into how your bird piatas may consume all of your caterpillar piatas for lunch.To help your garden grow you must plant seeds and then water the plants. Some piatas may require that they eat a specific number of a plant before they will become resident, and others will require that they eat a different plant before they will be willing to mate using a mating house built especially for their species of piata. This cycle is a continuous one with the player constantly trying to woo new types of piatas, whether to complete one of the many challenges the player can choose to undergo or to simply sate their own creativity and curiosity.As the player does just about anything in the game they gain gardening experience, and when enough is gained to level up even more items and buildings are made available for purchase at the various stores in the game which helps keep the game fresh. Chocolate coins are the currency of the land, which the player gains by completing challenges or simply selling piatas and getting paid depending on how happy the piata is. Money is rarely hard to come by, and usually easily attainable if care is given towards growing the garden and breeding piata.The incredibly colorful and cute visuals are back for a second showing, and practically every piata is not only detailed with their own unique look and mannerisms but is cute to boot. The garden itself is a serene place of your own creation and design, and things such as the passing of day and night or of how a passing airship casts its massive shadow down on your garden as it passes are examples of the detail that the game contains. Humanoid characters are downright creepy looking thanks to their costumes and masks, looking like something the Aztecs would use to scare the crap out of their enemies.Thats not to say other aspects of the game arent equally strange. Breeding piatas involves a maze-like mini-game that rewards the players with watching the piatas in question perform a bizarre disco-lit mating dance followed up by a large flying woman delivering the egg. Making piatas happy fills them with candy, at which point the player can either sell them for profit or beat them with a shovel. This cracks them open, spilling their candy about and immediately causing every nearby piata to eagerly consume every ounce of candy spilled. Its presented in a completely innocuous manner and is admittedly unnecessary to play the game, but it is an incredibly odd way to sacrifice one piata to raise the happiness of others.Closing Comments:", "date": "September 1, 2008", "grade": 3.5}