{"name": "GTR Evolution", "ref": "https://hardcoregamer.com/?post_type=post&p=31229", "text": "When gamers hear about car racing games these days, we tend to place them into one of two categories. The first houses arcade-style titles such as Grid or Burnout, while the other provides a more realistic experience like Gran Turismo or, in this, case GTR Evolution. That being said, GTR Evolution is a hardcore racing simulator in every sense of the word. This game will not allow drifting around corners at 200 mph or provide anything else you may have seen in The Fast and the Furious. Instead you will get a true-to-life professional racing experience that requires patience and a bit of skill to master.When you pop GTR Evolution into your PC, youre given three install options. One option installs the game online through Steam, and another installs offline. Theres a slight advantage by selecting the first option because you can then play the game from anywhere simply by logging into your Steam account. If you install offline, you wont be able to participate in online multiplayer matches. The third option installs the game both online and offline. Doing this obviously eats up more hard drive space, so it really comes down to a matter of preference as to how you choose to install the game.Its important to note that GTR Evolution is not a brand new game in SimBin Studios series of racing titles. It can be played as an expansion to RACE 07 or as a full game unto itself that contains RACE 07, along with 30 new car models and the famed Nrburgring Nordschleife race track in Germany. Though most of the cars are real, GTR Evolution introduces a fictional line of WTCC Extreme cars that take on their own unique look and driving style.GTR Evolution contains an Arcade Extreme mode, Championship mode, Time Trial, and Multiplayer mode. If youre new to the game or just want to get a quick fix, then Arcade Extreme is where you want to go. The multiplayer option features leaderboards that rank according to country. They can be checked out either in-game or on the GTR Evolution website. Before taking on the world in multiplayer, you may want to practice your skills offline first.This is not the easiest game in the world to control. Expect to spend the first few races skidding off the track with little effort. This doesnt mean the control scheme is flawed, as its tailored to players who want realistic driving physics. The cars can be controlled with the mouse and keyboard, standard gamepad, or racing wheel. I wouldnt recommend using the keyboard and mouse set-up, as I found it very difficult to convey subtle steering movements accurately. Using a racing wheel is the best way to go, but a standard gamepad makes controlling the game much more tolerable if youre not up to spending extra dough for the wheel. There are several preset options for different control schemes. From my experience I found it difficult to setup my own controller with buttons tailored to my liking. After starting a race, my car would not accelerate for anything. The speedometer just revved up as if I was still in park even though the other controls worked fine. It wasnt until I chose a preset scheme and altered those controls that I was able to finally race.The tracks are fairly lengthy in size. Races can easily last for several minutes. This may turn some people off because, as I said earlier, its easy to lose control of the car at first. Unlike arcade-style races that last a few minutes at best, being forced to restart a race after playing for 7 or more minutes due to spinning out can become frustrating.The funny thing about GTR Evolution is that it can become addictive after a while despite its learning curve. You sort of settle in to this relaxing driving mode while taking in the gorgeous scenery and relishing in the various engine sounds the cars emit. If theres one thing GTR Evolution does that more fast paced racers dont, its the way the game makes you hone in and improve your driving ability. You dont need to worry about smashing billboards or finding the perfect ramp to take the lead.Graphically, the game is easy on the eyes. Different weather patterns help to contribute to the realism by forcing you to turn the wipers on  lest you want to crash. However, on a sunny day, the look of the trees as you pass by is breathtaking especially if you have the draw distance setting turned all the way up. It isnt the best looking racing game on the market, but its by no means inferior.Closing Comments:", "date": "August 27, 2008", "grade": 4.0}