{"name": "Tiger Woods PGA Tour 09", "ref": "https://hardcoregamer.com/?post_type=post&p=31223", "text": "Golf is by nature a slow game, one that emphasizes gray matter more than it does physical prowess. People who like the sport tend to like taking things slow, thinking long and hard and doing it all on a delayed time schedule. For such individuals, Tiger Woods PGA Tour 09 should be just about perfect. If you just like to play speedier arcade golf games or you already have a recent installment in the franchise, though, pre-purchase contemplation is warranted.First, know that this is a golf sim. Thats evident even in the way you swing at the ball. You dont simply press buttons at key junctures as an indicator slides across a meter at the bottom of the screen. Instead, you pull back on the analog stick and then sweep it forward. The developers were apparently trying to mimic the actual sport, and to an extent they were successful. The control scheme just doesnt permit the same precision. The lack of an arcade-style configuration (something similar games have provided as an option even when taking a more serious approach) is disappointing, but youll soon adapt.Fortunately, the game doesnt leave you floundering in the meantime. There are numerous tutorials available if you have the patience to sit through them, guided by a virtual Hank Haney (Tigers real-life coach). These walk you carefully through more play mechanics than you may even have realized existed. As a result, it becomes easier to swing your on-screen club with confidence.Thats important, especially since the game tracks your performance each time you play. Good or bad, your actions in previous rounds stay with you long after theyre complete. If you find yourself routinely managing birdies and eagles (it can happen, yes), youll build your golfers attributes in those areas where you show the most strength. However, a strong tendency toward errors can damage your stats even if youve been a golfing god up to that point. In this manner, the good get better and the bad get worse. Thats not newbie-friendly, perhaps, but it gives the hardcore player more reasons to keep coming back as the game grows more personal.Options for custom characters will help with that, as well. You can of course tweak the usual things like skin, hair and eye tones, or even the depth of lips and breadth of nose (just for starters), but theres also the option to import photos from your personal collection and map them to the character model. This is handy if you have special attributes that might not otherwise be able to appear in-game. You can also affect things like the general shape of your golfer, though youre limited in how obese or wimpy you can make him or her look.Once youre done in that mode, youll have plenty of places for your fresh new golfer to roam, since the game recreates a variety of famous golf courses from throughout the world. This is as close as many of us will get to attend a professional golfing event, so the attention to detail is definitely appreciated. However, it seems like less attention was paid to the player models. Its a little hard to be absorbed by the gorgeous environments when the golfers and crowds that populate them seem to be dressed in plastic instead of polo. The clothing rarely moves as fluidly as it should, though the golfers themselves do fine. The issue is nowhere near as bad as it could have been, but the disconnect between the various elements can still be jarring.Closing Comments:", "date": "Venter on August 25, 2008", "grade": 4.0}