{"name": "UberSoldier II", "ref": "https://hardcoregamer.com/?post_type=post&p=31183", "text": "Budget titles are a grab bag when it comes to entertainment value, and quite often they are not worth even their lowered sticker price. UberSoldier 2 has its share of flaws, but it also somehow manages to make shooting Nazis in yet another World War II shooter entertaining. Playing through it like any other shooter will get you killed fast, which makes the unique twist of stopping bullets in midair and throwing them back at the guy who fired them all the more important. Its ham-fisted and full of clichs, but theres some fun to be had with this budget first-person shooter.In UberSoldier 2 you play as Karl Stolz, nicknamed the UberSoldier by his team. Karl and his compatriots have uncovered a secret Nazi program designed to manufacture super soldiers, which would then lead the Nazi war machine to victory. The plot unravels mainly through comic book-style cutscenes, though there are often gaps in the story with no effort made to explain them, presumably because theyre filled by the first game in the series. Incoherencies in the plot aside, it serves as a decent vehicle for whats really important; mowing down squad after squad of Nazi soldiers.Karl can use a variety of weaponry to that end, ranging from Lugers and k98 rifles to Tommy guns and rocket launchers. The weapons are oddly balanced, and while itll take over half a clip from a Tommy gun to drop a Nazi, the same happens with three shots from a pistol. Thankfully ammunition is plentiful, encouraging spraying the room with automatic fire just as any popcorn action title should. Karl also has the use of grenades such as explosive grenades and concussive charges to give him the upper hand when taking on large groups of foes.If three enemies are killed by using melee or from headshots within a certain time limit, the player enters one of two modes for a short time. In either mode the game slows down and the player is made invincible for the duration. For melee kills you enter the Berserker mode, which makes the player move faster and the knife itself an instant-kill weapon. For headshots you enter the UberSniper mode, which rewards successive headshots with a boost to the players current energy level, used for sprinting or the bubble.The biggest advantage that Karl has is the ability to toggle that protective bubble around him. This bubble stops all incoming fire dead in the air but also stops the player from firing out of it as well. The more objects that the bubble is currently holding, the faster its energy charge is depleted, though when not active it gradually recharges to full. The bubble itself extends a fair amount away from Karl, which means that enemies can just as well run inside of it and fire at point blank range or use their weapon as a club.Entering the two special modes also nets the player experience points, which are spent at the end of the mission to permanently upgrade Karl. Points can be spent to increase Karls maximum health and energy, his accuracy using weapons, as well as the length of time he spends in the special modes or the strength of the bubble shield. The bubble strength is particularly useful in that when upgraded not only can it stop bullets but it can also deflect them back for a deadly effect. With an upgraded bubble, players can also turn on the shield, fire a whole clip into it to hold it there, then turn the shield off to unleash all of the rounds at once wherever they choose.UberSoldier 2s status as a budget title shows in its engine quality, though effects such as ragdoll physics spruce things up a bit. The animation quality is poor across the board and the level design often leaves much to be desired. The cutscenes have full voice-overs that do a decent job of portraying the characters, however clichd they are. Music is something that is practically non-existent in the game, with it either playing a forgettable uptempo track for some fights and nothing more than ambient sounds for others.Closing Comments:", "date": "July 22, 2008", "grade": 3.0}