{"name": "Knowledge is Power", "ref": "https://hardcoregamer.com/?post_type=post&p=278987", "text": "Knowledge is Power is a classic trivia game that uses PlayStations PlayLink technology, which turns your friends phones into their controllers, or in this case, buzzers. Its got a wide breadth of topics that are interesting and challenges contestants to answer as quickly as possible in order to take home the glorious  albeit virtual  trophy. It has some quirks, but Knowledge is Power is a fun game that will get you and your friends fighting for the title of Master of Useless Facts.A full game will take your group around 20-30 minutes, which is quick, but a good stretch for friends and family with short attention spans. It also leaves room for a rematch for those feeling extra competitive. But first, youll have to take a selfie and pick a character. The selfie is kind of irrelevant, however, since you never really see it while youre playing. It pops back up if youre the big winner at the end, but the characters are your avatars for the rest of the game. Theyre goofy little guys and girls that are dressed up in anything from astronaut gear to a cordial dress and one is even done up in a hot dog costume. Theyre emotive little buggers, too. Theyll pout when a wrong answer is given and jump around and smile with a correct answer. And when you get frozen or glooped (well talk about that later) by a Power Play, they might even cry. Theyre funny and had my friends and I laughing out loud often.Once everyones selected their avatar, theres a little introduction from your eccentric host and youre off to the first round of questions. To choose a question, players vote on a selection of four topics, which can range from Fantasy Characters to Egyptian History. Whichever topic receives the most votes is the one from which the topic is taken, and all players are asked the same one. The topics presented during the next round, youll notice, will be catered towards what the game thinks you and your group are confidently knowledgable in. So, for instance, if you all pick a topic on literature for the first round, the options in the second round might revolve around literature too. This little trick makes for questions that the whole group feels they can answer, unless youre an outlier in your group and know nothing about sports. The faster you answer correctly, the more points youll earn. Once youve racked up enough points, youll be able to use a Power Play on any of your opponents. Power Plays inhibit your opponent from answering quickly in some way. Their answers might be frozen, meaning theyll have to hit them multiple times before breaking the ice and being able to vote, or theyll be glooped, meaning answers are covered in goo and it has to be wiped off to see the answers. Theres even one that will take away some of the letters from the answers so that theyre harder to read. You can team up against the person in the lead and hit them with multiple Power Plays or use other strategic moves to get to the top. Every couple of rounds there will be a little mini-game which always have something to do with matching. Youll be matching fast food chains to their slogans or differentiating between animals with lungs versus animals with gills. This is another chance to rack up points if youre quick, but again, its all about speed.The final stage of the game has players competing in a rapid-fire flurry of questions in order to reach the top of the Pyramid of Knowledge. The points earned throughout the first half of the game will determine from which terrace you start, so if youve racked them up, you could get a good head start on your friends. The Pyramid of Knowledge rewards speed in this round, however, so your friends could catch up if youre not careful. For quickly answering a question, you could jump up two or even three levels at a time. This makes the second half much more exciting than the first. Its kind of anyones game during this portion, which is exciting, but also kind of makes the first half a tad irrelevant. Its a small gripe, but there for anyone who likes when points matter. And they do  just not a lot. Thats about it from a gameplay perspective. Its simple, but thats what the PlayLink service is all about. Its trying to bring the whole family to the couch for some gaming, and for that to be enticing, well, let them use a device theyre familiar with and make the games simple to understand and fun to play. And Knowledge is Power does a good job at both of these things. Its fun, quick and simple. It may be a bit quicker and simpler than the other PlayLink games, but its still a good use of the technology.In terms of aesthetics, Knowledge is Power has a fun vibe to it, but its brought down by a few weird choices. The animation style is very Pixar, with smooth character models and color, but the developers decided to put a sort of grain over the entire screen and it makes everything look a bit worse. I think what they were going for was an old TV game show look, which of course is fitting, but they should have left out the grainy old TV fuzz that people used to have to deal with. I would have rather they just show off theyre well animated characters and backdrops. The music is also very game show-ey, but forgettable. Youll also be talking amongst your opponents while this music is playing, though, so its likely they made the music scarce on purpose. Closing Comments:While not the most robust of the PlayLink games, Knowledge is Power is still a fun, playable game show that family and friends will easily be able to pick up and play. Games are short, which means that its not something you have to dedicate a night to, but also sets you up for rematches galore. The questions are interesting and niche, which makes them harder while at the same time making you feel like you know the answer. The way theyve implemented the Power Plays is a nice touch, allowing you to slow your opponents down in a game thats all about speed. So if youve been liking the games that Sony has been offering with their new PlayLink initiative, Knowledge is Power is another one to pick up.", "date": "on November 12, 2017", "grade": 3.5}