{"name": "Hot Shots Golf Open Tee 2", "ref": "https://hardcoregamer.com/?post_type=post&p=30986", "text": "Hot on the heels of the PS3 debut of the Hot Shots Golf series (Hot Shots Golf: Out of Bounds) comes the newest incarnation, this time on the PSP. Hot Shots Golf: Open Tee 2 takes the game PSP owners have enjoyed since it was released over three years ago, and builds upon it with many new features.If it aint broke, then Hot Shots Golf dont fix it. Aside from some new features and updated graphics, the core gameplay hasnt changed much since the series debuted in 1998. So, Hot Shots Golf: Open Tee 2 plays just like its predecessors. Stop a cursor moving along a meter to determine the power of your swing, and then the accuracy. Stop at the best point along each meter to get the best total swing. One problem that Hot Shots Golf has had in the past is the putting mechanic. Unfortunately, its still a problem here. No matter how many times you play, you can never figure out where the ball will go when you putt. It seems random at times, requiring too much or too little power to get the ball in the whole if you are on a small slope.Thankfully, the amusing power shots remain in Hot Shots Golf Open Tee 2. Depending on your character and clubs, you have a certain amount of power shots you can perform every round. When you turn on a power shot, you get a small boost to your swing. It adds an extra layer of strategy, because if you use them haphazardly to simply extend your shot, you wont have any left when your ball is wedged in a sand trap and you actually need a little boost. By combining simple gameplay mechanics with fun anime-style character design, Hot Shots Golf has become the odd sports franchise that hardcore gamers love. Hot Shots Golf doesnt try to simulate an actual game of golf in any way, which is part of what makes it so entertaining. Theres nothing stressful about it, just fun and addicting attempts to get low scores.While Hot Shots Golf: Open Tee 2 doesnt try to make any drastic changes, its still a worthy entry in the series. There are 24 different, customizable golfers to play with. You can change your characters clothes or accessorize them with sunglasses, hats and many more things you can unlock while playing through the game. You can also customize your equipment, upgrading it to allow for more accurate shots and longer drives. One of the main draws is its very impressive multiplayer, featuring tournaments for up to 16 players and head-to-head play. Online play runs very smoothly and lag isnt a problem, letting you use it to test your skills against other diehard players.Closing Comments:", "date": "June 3, 2008", "grade": 4.0}