{"name": "We Ski", "ref": "https://hardcoregamer.com/?post_type=post&p=30954", "text": "We Ski, huh? Love the stuff! I cant afford Crown on writers pay, but Southern Comfort is pretty tasty too. Oh, wait, were talking about that Wii skiing game. Well hey, why the hell not? The Wiis motion controls have simulated everything from darts to swordplay to squirting water into a clowns gaping mouth, so why not make a proper skiing game already? Im surprised no ones done it before, actually. While We Ski delivers on its promise of a motion-controlled skiing experience, though, much of its gameplay proves to be a series of frustrating missteps.The good news is that We Skis core skiing mechanics are pretty much spot-on. You pick up speed by thrusting the Nunchuk and Wii Remote downward simultaneously, and you turn by tilting both devices to the left or to the right. Its a simple setup, and the motions are immersive enough to be satisfying on a basic level.Youll quickly run into trouble when trying to master some of the more advanced techniques, however. Attaining the fastest speeds requires your player to enter a crouch, which you can only trigger by twisting the Nunchuk and Wii Remote inward. The motion is imprecise and awkward, and trying to turn while in a crouch is even more difficult, since it requires further tilting of the twisted, mangled mass youve made with your hands in an attempt to maintain an on-screen crouch.Fortunately, crouching is only really necessary in We Skis head-to-head racing segments. Predictably enough, the most fun youll have with We Ski is in the events which demand the least from the games control setup. Slalom works out especially well; the motion-sensing controls are accurate enough to provide all the precision you need, and the modes greater focus on movement rather than speed ensures a fun experience free from the frustration found elsewhere in the game.Mogul mode is the weakest of We Skis available events. While Slalom is fun and Race at the very least provides course variety, Mogul features only one course and wildly inconsistent gameplay as a fun bonus. Mogul mode boils down to racing over a series of bumps, hitting a jump, and performing as many tricks as you can while in mid-air. Then you get to do it again before crossing the finish line.No step of this process works correctly. Successfully traversing the snow bumps leading up to the jump requires the player to hold down both the Z button on the Nunchuk and the B button on the Wii Remote while shaking both controller segments back and forth rapidly in unison. To attempt this is torture on the wrists, and youll rarely pull it off. After your skier stumbles up to the jump, you can squeeze off two or three tricks in mid-air. Oh, by the way, did you go through the tutorial in its entirety and memorize the controller motions necessary for in-air tricks? Youd damn well better have, or else youre going to mess this part up, too.Its not like your performance matters, though, since your first dozen or so attempts at Mogul are going to be given a failing grade of D because your Turning wasnt good enough. What this refers to, I have no idea. I went through all of the in-game tutorials and found no solution. The instruction booklet wasnt any help, either. I even checked GameFAQs. Nothing ever told me what Turning meant or how it could be improved, and it was only after several frustrated tries that the game decided I had turned well enough to earn a passing score.Elements of Mogul, Slalom, and Race can all be found in We Skis Freestyle mode, which at first glance appears to be a fairly deep mountain-wide quest filled with missions and challenges. In practice, its pretty much the same events repeated over and over again with fetch quests in between. While boredom will set in quickly, youll at least be able to unlock additional outfits and items by completing missions. Be aware that many of these accessories cannot be used if youre playing as a Mii character, however. Lord knows Nintendo would never stand for anything that adds variety to its Miis in any way.Equally disappointing is We Skis Balance Board support. While its fun to try out as a novelty, its hardly useful enough to warrant a giant feature bubble on the front of the box. The Board must be recalibrated between events every single time (why?), and it cant be used in multiplayer modes at all. Inconvenience aside, though, its simply not as accurate as the default Remote/Nunchuk setup. Precise movements are difficult to pull off, and your skier will often veer sharply when youre attempting to make slight turns. Maybe my sense of balance is off (Ive only been playing Wii Fit for one day, so cut me some slack here), but I dont think Ill be bringing out the Balance Board for another try.There are small bits of fun to be mined from We Ski, but few of them satisfy with long-term appeal. Much of the game is barely playable at first, and its only after viewing an extensive tutorial that youll become aware of the techniques needed in many events. Mastering these techniques is another matter entirely, and many will trigger inconsistently or only with great difficulty. The Wii Fit Balance Board is of little help, and only serves to complicate things further.Closing Comments:", "date": "May 13, 2008", "grade": 2.5}