{"name": "World Heroes Anthology", "ref": "https://hardcoregamer.com/?post_type=post&p=30749", "text": "I wont lie to you. World Heroes Anthology is a straight port of World Heroes, World Heroes 2, World Heroes 2: JET, and World Heroes Perfect. As they stand, I find them to be rather lackluster fighters, even as old school as they are.The anthology doesnt bring anything new to the table. Everyone you can play as is unlocked from the start, so the only real extras include a color edit function and a move list on the pause menu. Its easy to switch back and forth between games, and its a solid port. Everything seems to be emulated perfectly, and I never saw any slowdown or other problems.Sadly, even under the new coat of paint, its still World Heroes. Much like the different versions of Street Fighter 2, theres no real differences between the titles, save for the Hero meter in World Heroes Perfect. The combo system is still lacking; theres no handy combo meter, like you would expect in an anthology, and the characters special moves are still largely worthless (with some exception). Several times, Ive actually had the enemy recover from hit stun in the middle of a combo, only to throw me out of the opening animation of my specials. Either I dont get the system, or its rather flawed, and Im really leaning towards the latter.Still, its not all bad. Versus mode is highly entertaining, and theres a wide selection of difficulties, including a few bonus modes that make the game more difficult than it has a right to be. Explain to me this: if my character is smaller than the foot of my enemy, why do I still have to duck in order to block crouching attacks? This and other riddles await you, should you dare.Despite my misgivings, I cant say anything bad about the collection itself. The sound is rendered perfectly, the controls respond very well, and with the exception of one playable character (he still shows up as a boss), nothing has been left out. If you liked World Heroesor just need to complete a collectionyou probably cant live without this. If you arent a World Heroes fan, I wont even bother cautioning you not to purchase it; Ive had trouble finding copies of it anywhere, so good luck with that.Closing Comments", "date": "April 11, 2008", "grade": 2.5}