{"name": "Mana Khemia", "ref": "https://hardcoregamer.com/?post_type=post&p=30936", "text": "Mana Khemia is, to put it politely, yet another JRPG alchemy game in the Atelier Iris series. It plays very similarly to Atelier Iris 3, which actually works in its favor. You play as Vayne, an adorable protagonist with a slightly muddled past, and guide him through three years of school at Al-Revis academy. Sure, its not tossing anything new at us, but thats fine; developer Gust has hit a sweet spot with their alchemy and combat systems, and delivers a very solid, enjoyable title.Alchemy is the coolest game mechanic ever. Using alchemy, you can create all kinds of awesome combat items, healing potions, and sweet equipment. It used to be that if you were diligent with your synthesizing, you could forge yourself an unbeatable set of items and just go to town. Sadly, gathering ingredients for your synthesis was an arduous task, and you still had to grind and level up your characters.No more! In order to emphasize how awesome alchemy really is, your level-up progress is directly tied to your progress in alchemy. The more cool items you forge, the more items you unlock in the Grow Book; each item you unlock allows you to purchase skills or stat upgrades, with points that are easily acquired from battle. What does that mean? Instead of wasting your time grinding in combat, you get to spend more time in the workshop mixing up explosives and making better cannons.Not only that, but a lot of the harder parts of alchemynamely foraging for rare fruits and painstaking mining endeavorscan be sloughed off onto your classmates. Theyll gather for you, forge for you, and even keep the workshop clean. Whats not to love?Even the battle system has been tuned up. Turns are still marked off by cards, and you still use HP and MP to battle monsters, but youre given a great set of skills to play around with, and a truly diverse cast of characters with a host of unique offensive and defensive options. Each character has his own niche, and there arent really any redundant characters. Theres a lot of strategy to be had, which is a nice diversion from the press button continuously style of combat most RPGs offer.If the fighting wasnt good enough, theres also a dynamic social element to Mana Khemia. As you take Vayne through his years at Al-Revis, you can spend your free time getting to know the characters in your workshop. Each has her own personality and side quests that add to the overall story. Theres even multiple endingsone for each character. Trust meif you like the game at all, youll find it rewarding to complete the game more than once.The only complaint I really have involves the dubbing. While youre allowed to play the game with either the English or Japanese voice track, the voices for shopkeepers and some other minor characters are completely absent from the English track. This probably only bothers me, but I feel like a little character is lost.Closing Comments:", "date": "March 30, 2008", "grade": 4.5}