{"name": "Space Invaders Invincible Collection", "ref": "https://hardcoregamer.com/?post_type=post&p=408722", "text": "Since 1978, the Space Invaders series has delivered some of the industrys most memorable gameplay and art. The iconic Invader sprite art has become a universal sign of gaming  including being the inspiration for the Mooninites on Aqua Teen Hunger Force back in the 00s. The franchise as a whole was lampooned in Futurama with Fry lamenting that he could never beat the last Invader without his brothers help, and the original was such a huge hit that it was the cause of a rumored coin shortage in Japan. While that didnt wind up being true, the mere fact that it seemed plausible for so long shows the hold the game had on the public at large. Last years Space Invaders Forever Collection brought two mainline entries in the series together, while the Invincible Collection brings ten games together alongside a download for Arkanoid vs. Space Invaders that was also featured in Forever.Both Space Invaders Forever and the Invincible Collection feature Gigamax 4 SE and Space Invaders Extreme, but Invincible adds a lot more to the package to make it a better value for the dollar. With two versions of the original 1978 game in black and white and color form alongside its 1979 follow-up, two 1990 successors, Space Invaders DX from 94, Space Invaders Extreme, Gigamax SE and two SI-adjacent games in Space Cyclone and Lunar Rescue, this collection offers a lot of variety. You have slower-paced games like the first couple of games alongside far more modern-feeling experiences like Extreme that have held up wonderfully  especially with quality of life improvements for every game that manage to make them more fun to play now without stripping all the challenge out of them.All of the games have on-screen controls given  which makes it easy to figure out button configs from game to game and includes things like turbo fire as an option for some of the titles. Every included game has save states to end a game quickly if need be or gain an edge when youre on a hot streak and have a break in the action. For Space Invaders early games, that usually comes from brief points where the screen is empty while Lunar Rescue includes a score tally after every screen and Extreme has areas like bonus round graphics or BOSS ATTACK graphics to give players a good stopping point in a pinch. Theres no rewind option offered up, but it actually doesnt hurt things too much and it might be better to not have it since there is usually going to always be something coming at the player  so you could really only use it to send you back to the same attackless screens you can save and load from anyway. The pacing of the included games varies from slower-paced to more action-centric for different reasons. Gigamax adds more action with the ultra-widescreen four player display setup while the earliest entries feature slower action that requires more strategy. The nature of the first five or so games in the series is that you cant just bulldoze enemies even if you had things like spreadshots and turbo fire. The player has to play them deliberately and that wont be for everyone, but the formula is still addictive. Lunar Escape is the most unique entry in this collection and the most pleasant surprise as it was built on the original games circuit board, but has a totally different gameplay setup. The player goes down to a points platform, gets their points and then goes up to the ship they came from at the top of the screen to move onto the next screen. Its a blast and my second-favorite game included in the set.The absolute most fun experience included is Space Invaders Extreme  the most modern-feeling game in the bunch that retains the same blend of offense and defense from prior games, but at a quicker clip. Players still have to do what they can to avoid taking damage, but shots are against a bolder set of colors and are a bit easier to see with the bolder color and larger size. Originally released on the Xbox 360, the version included here has all of the same graphical improvements as the full-fledged console release before, but now has a crisper look and world rankings for leaderboards to keep the sense of arcade-style competition alive. Its a top-shelf game and well-worth picking up either collection to enjoy. Space Invaders 94 DX is another excellent game and its gameplay is right in line with the first few games, but with massively-improved graphics and backgrounds. The collection doesnt have a lot of museum content, which is disappointing. The franchise has a long history and while theres a strong sense of some of its scope in the menus with conversational text in each games menu listing, it still feels lacking. Even dating back to PS2-era collections, this series hasnt gotten its just due when it comes to extra content and its a shame since theres so much rich cabinet art and a story that is unlike most games on the market ever. Its the only part of the overall presentation that really needs some revamping, because the lean menus and information-filled text showcased in an entertaining manner helps keep the player engaged even if theyre just reading a menu.On the AV side of things, the games included look razor-sharp and feature a wide variety of aspect ratios. Some are are in a small portrait mode window, others are in 4:3 and others are in widescreen, and this collection is one of the few on the market that doesnt allow for a black border. This is something that usually bugs the daylights out of me, but here since theres so much to focus on in the core games, it didnt bother me in the slightest. It wouldnt be bad to have it as an option, but it works well here. The audio is fantastic, with strong changes to the music making enemies closing in that much more fear-inducing, while newer entries have a more robust sound that takes better advantage of things like soundbars or immersive headsets. Closing Comments:The Space Invaders Invincible Collection features a lot of fun packed into a single package  albeit with a lot of similarity between them. Thankfully, the inclusion of some non-Space Invaders games helps to mix up the gameplay variety offered up, with things like Space Invaders Extreme making things feel more modern than a lot of current-day arcade-style shooters. There isnt a bad game in the bunch here and being exposed to games like Lunar Escape in this kind of form can help make new die-hard fans of games that have been forgotten over time. Its a must-buy for anyone who has wanted to play more of the series or even if you just have a missing entry or two in the series. Space Invaders Invincible Collection plays great, looks fantastic and showcases just how strong the franchises sound design has always been.", "date": "August 17, 2021", "grade": 4.0}