{"name": "Axiom Verge 2", "ref": "https://hardcoregamer.com/?post_type=post&p=408577", "text": "Sequels tend to carry a lot of baggage, especially when the first game was as well received as Axiom Verge. The dimensionally-misplaced scientist Traces adventure wasnt just as good as Super Metroid, it was as good as people remembered it being. The atmosphere, level layout, art style and secrets hit all the right notes for nostalgia, but the plot, weapons and abilities made Axiom Verge very much its own unique entry into the Metroidvania genre. Thats a lot for a sequel to live up to, but Axiom Verge 2 pulls it off by being a different game from its predecessor while keeping the tone, art style and quality of music that made the first one so well received.Indra Chaudhari was not a good person. She oversaw the type of company that will ruthlessly cut its workforce in order to boost its profits, existing not so much to manufacture any specific thing but rather to generate revenue. How Indra ended up being in charge of a small expedition to check up on an old Antarctic base isnt particularly clear at the start, but thats her job now and shes going to get it done, right up until an unexpected message sends her to find a secret door leading to a passage to somewhere else and the misadventure turns fatal. Luckily the voice Indra was following knew how to put her back together at a convenient save point, but much like Trace was changed by his adventures, shes no longer quite human. Theres probably a downside to losing her original body, but being only temporarily inconvenienced by death should take the edge off it.Axiom Verge 2 is set in the same universe and starts from the same Earth as the original game but requires no knowledge of the first one to understand. If you played the first youll see a good number of similarities, such as the small cloud of health pickups enemies sometimes burst into, but otherwise this is a very different game. Indra isnt much for guns, for one thing, and instead wields an ice axe and boomerang. While new weapons do show up theyre basically tougher versions of the starting gear, although a few new abilities expand Indras attack options. The best upgrades come from the urns hidden around the landscape, providing Indra with much greater mobility to get through the ever-growing map. One of the earlier upgrades, for example, is a drone you can use to explore small tunnels or send through rifts in space-times fabric. The dimension Indra landed in isnt particularly stable, but even so its not a good idea to squeeze through a crack in the universe. The drone can handle it just fine, though, exploring a second map that usually has exits in places Indra wouldnt be able to reach until the drone opens the door from the other side. One of the fun things about the parallel dimension is that the camera zooms in so the small drone takes about as much space on the screen as Indra would, and in these sections the art playfully leans in to the pixel-chunkiness that would have been a side-effect if it hadnt been turned into a feature.Another early major upgrade is the hacking field, which spreads out from Indra in a circle and allows her to choose from a number of preset commands associated with any enemy inside it. A small energy bar determines how much she can do with this ability, with minor hacks like Slow being cheaper than major ones such as Allegiance. Anything electronic can be hacked, including the obvious things like doors and less-obvious creatures like persuading the formerly-harmless fly-bots to swarm. The type of available commands depends on the enemy, but all can be helpful in some way if youve got the energy bar to afford it. Like any good Metroidvania progress is rarely linear. The map may have a green glowing dot indicating the next big objective, but to get there youll probably need to explore a completely different area to earn the upgrade necessary to progress. A jump thats a little too high may block off the passage forward, for example, but finding the ledge-hang ability means you can grab on and pull yourself up. Theres never a go here, do this hint for these sub-objectives so youll need to be in an exploratory mood to get through, but thats kind of the point of this type of game so its hard to complain. Progress tends to vary between having a good number of choices as to where to go next and then poking around the edges of the map afterwards to find the bit that opens up progress again. It might be the ability to climb walls, or a grappling hook for the drone, but theres a path forward if only you can explore the right area to find the tool that will open it up.While the major upgrades are necessary for any kind of progress there are also plenty of minor ones to chase after. Documents give background details on the history of the lost pocket dimension from both the native and human sides of the story, while the red orbs grant a point of health when five fragments are collected. Blue vials are particularly helpful, supplying a point or two to spend on skill upgrades. The skills arent super-exciting in the way that finding the ground-slam for the hammer is, but instead cover stats such as attack speed and power, increase the health bar again, expand hacking range, etc. The exotic skills are nice but you can never go wrong enhancing the basics. Closing Comments:Axiom Verge 2 is exactly what a sequel should be in that its more of the same but different. Indra isnt Trace so her skills and abilities dont try to mirror his too closely, and the world shes been dropped into frequently has wide open vistas in its background instead of more types of caverns. The level design is every bit as good if not better, featuring varied biomes that stand on their own but eventually all interconnect as new skills open up more passages. The switch back and forth between Indra and the drone provides a nice change of pace, with each earning different abilities that complement the other. And of course the soundtrack is fantastic, with its non-US-traditional instruments and vocalizing. If you loved the first Axiom Verge then odds are good the second one is everything you hoped for, and if youve never played the original then the standalone nature of the sequel means you dont have to worry about having missed out. Either way, Axiom Verge 2 is an excellent Metroidvania, and a rare perfect example of a series that can balance quality and change to deliver something new.", "date": "August 11, 2021", "grade": 4.0}