{"name": "Akka Arrh", "ref": "https://hardcoregamer.com/?post_type=post&p=437623", "text": "Not every game sees its way to completion. There are dozens of Early Access titles that will never graduate, but at least those were released in some format. Others are just lost, although lost is a relative term seeing as semi-completed titles ranging from the PS1 brawler Thrill Kill to early-80s arcade prototypes like Marble Madness 2 or Akka Arrh managed leak out and get preserved in some form. Akka Arrh in particular was far enough along to have a few arcade units produced, but public testing results said it was too complicated so it never got to become a full game. 1982 is a long time gone, but not so long as to see the game forgotten completely. Its 41 years later and not only can the original incomplete arcade version be played on the Atari 50th Anniversary Celebration, but an all-new version is now available that polishes up the gameplay into something for the current year.Like a lot of arcade games, the plot of Akka Arrh is that there isnt one. Instead theres a scenario, the same every level but put through endless permutations as new enemies and battlefields keep you on your toes. The basic structure is that theres a turret on a platform in the middle of the level, viewed from overhead. The turret can either drop a bomb onto the platform or shoot bullets, both of which are best used in specific situations. The bomb creates an explosion-field on the platform that radiates out and slowly fades away, and any of the low-tier enemies that wander across it blow up to create their own explosions in a way that any player of Every Extend will be familiar with. Using the bomb is vital to scoring, seeing as enemies start at a single point apiece and each one chained bumps up point-reward for the next one. Using another bomb resets the point-reward back down to one, so keeping that chain alive as long as possible is one of the keys to major scoring.Bullets, on the other hand, are a plentiful but still limited resource, with each enemy in the explosion-chain adding another shot to the turrets arsenal. Any enemy killed by a bullet rakes in whatever the point-reward is at the moment, but its best to try to be at least a little conservative with them for a nice post-level score bonus plus an extra life or two, if youve saved up enough. Not too conservative, though, because mid-tier and up enemies are generally immune to the shockwaves on the turrets platform, and they frequently shoot back a few bullets of their own (that you can shoot down, of course) when attacked. Theres a balance to the firepower between being stingy and spammy, and once you get a sense of how the enemies respond, it feels great to find a comfortable rhythm of proper bullet usage.The final gameplay wrinkle is that Akka Arrh is played on two fields, with the main one where the bulk of the time is spent being up top and a second one where the orbs that count as player health are stored down below. Enemies attack from up top, but if one gets past the turrets border it goes below to take out an orb or two. You can drop down below to attack them before they complete their work, but its easy to get caught up in the action up top and mentally tune out the alert that theres trouble elsewhere. Thankfully most the action on the main platform is put on hold and all enemy bullets erased when you go downstairs, but it can still be a lot to keep track of.The trick to good gameplay and staying alive is to keep the popcorn-enemy chain spreading its shockwaves around the platform while focusing firepower on the bigger threats, but this is more easily said than done thanks to a control scheme that I didnt find particularly controller-friendly. The central turret fires by zipping a cursor around the screen, and it feels maybe too slow and imprecise with a gamepad. Switching to mouse, on the other hand, made a world of difference, and a game that had been fighting me the whole time all of a sudden opened up to reveal a fantastically precise shooter thats equal parts fast action for the bigger enemies and patient management of the shockwaves for the best possible scoring. Additionally, the default control scheme is one button for attack, tap for bombs and hold to shoot, and a second to drop downstairs for the defense sections. The hold to shoot left a tiny delay in the bullet firing, and that just didnt work at all. Switching to three buttons, one each for bomb, shooting and descend, improved the action no end.Closing Comments:Once the controls are sorted out, Akka Arrh reveals itself as an absolutely fantastic shooter that plays like nothing else out there. Levels become massive chains of exploding enemies, polygon-shatter pyrotechnics, fast shooting and careful bullet management, and power-up frenzy. New enemy behaviors show up at a regular pace, and learning to manage them so that what had been threats become another scoring tool feels rewarding. Theres an initial feeling of shattered attention, as the need to manage the platform shockwaves, keep an eye on the downstairs, be mindful of the bullet supply, and handle the mid-tier and stronger enemies can be overwhelming, but theres a mental groove to Akka Arrh where this all somehow becomes manageable. Until its not, of course, because the levels arent going to remain kind to your current skill level for long, but its nice while it lasts and the level select lets you restart with the score and lives from your best run to keep on practicing. It may take a bit of work and experimentation to find your way into Akka Arrh, but once there it reveals itself as a unique shooter well worth having been rescued from the dumpster of history.", "date": "February 20, 2023", "grade": 4.0}