{"name": "Chernobylite", "ref": "https://hardcoregamer.com/?post_type=post&p=407952", "text": "Imagine a horror game that takes place from a real world location thats filled with history and bad, maybe even radioactive, energy. The team at The Farm 51 has created just that with Chernobylite. The game is touted as a sci-fi survival horror RPG as it sets out to blend different elements from these genres, but it feels like each of those four words needs a comma after them. Chernobylite doesnt bring something completely new to the table, but finds a comfort zone in offering bits and pieces of sci-fi, horror and RPG in what is ultimately a good survival game at its core.The main selling point of Chernobylite is the fact that the team at The Farm 51 has literally 3D-scanned the Exclusion Zone in Chernobyl. The nuclear disaster at Chernobyl took place during the late 1980s as the people were forced to leave in the middle of the night never to return. Movies like Chernobyl Diaries and the HBO show Chernobyl help provide an idea of what the area is and was. With the radioactivity starting to die down in the area, many people have been back to the area to see it first hand. Chernobyl is one of the most mysterious places on earth, and mystery breeds horror. Theres no doubt a deserved kudos to the team for accomplishing its vision after raising enough money on Kickstarter to do this. The loading screens in Chernobylite offer real life glimpses of footage that was taken in the area. Chernobylite has been in pre-access for quite sometime, but the final version has finally released on PC.Rather than just putting a player in Chernobyl and letting them figure out their journey, Chernobylite offers cohesive story with branching paths and character building. The decisions you make will determine the path of the story and the game also offers an element, upon certain death scenarios, to change a memory to adjust the path of the story. This is done with literal Chernobylite, which is the item that powers the game. You play as Igor, a physicist and employee during the Chernobyl meltdown, as he returns thirty years later to investigate what happened to his fianc, Tatyana. Chernobylite is best described as crystalized radiation that harnesses a ton of power and has even more deeper scientific elements. This is also used to alter the memories within the game, but if you dont die a lot, you wont come across this. Basically, if you are killed by the Shadows, which are the monsters, you will get this opportunity as long as you unlock those specific events in the story along the way. Unfortunately, you wont be encountering these monsters that much, which starts to pull away from the horror elements. Grouping Chernobylite into a survival horror genre doesnt work in the end. While the atmosphere can be unsettling and you will see day transition to night, youll encounter NAR soldiers for a majority of the story. A lot of the combat is either done via stealth kills and staying out of sight or using a handful of guns. There are no melee weapons, and unless you crank up the difficulty, ammo is apparent especially the deeper you get into the game. Some of the higher-level guns are cool and that includes the ability to basically vaporize an enemy. All of the guns can be upgraded with parts and this can be done in your base, along random locations in the game, or you have the option to build a specific crafting station anywhere on the map that will stay there. This also includes crafting station for traps like land mines and fireworks or stations for health.In Chernobylite, you will balance health, psyche and radiation. The more that one of these are affected, the more distorted the screen becomes. Psyche will actually lower the more you kill enemies, so you have the option to take calming salts or drown yourself with vodka to get it back up. The enemy AI can be a mixed bag as multiple NAR soldiers can flank you from different sides and theres a search timer thats activated once they identify you. Theyre hard to see as lighting can be difficult, but thankfully their guns have aiming lights to help identify where theyre located. There are heavily-armored soldiers, as well. You will use a Geiger Counter to measure radiation and send out a beacon to identify items and eventually enemies.The Shadows dont offer a ton of variety, even though there are small monsters thrown in to mix things up. If you stick around too long in specific missions, youll be introduced to the Black Stalker. This ties into the story, but hes basically a giant man thats able to teleport to pop out right in front of you. The game offers some solid jump scares, but they arent often enough to truly throw the game into a horror category. Also, traversing through the area is straightforward as youll be running through bushes without much resistance. Igor should also be able to jump over small objects, but I found this hit and miss in terms of getting around on a map. On top of item gathering, inventory management and crafting, Chernobylite will also have you build and manage a base. As the story progresses, youll encounter more allies that you can have join your team that you will also be managing. Decision making can affect if they stay around or not, and keeping them healthy is key to having success in terms of getting necessities like food and ammo in the field. While all of this seems complicated at first, it turns out to be straightforward. Youll level up Igors attributes by inviting these people back to your base and actually participating in an event that grants the individual upgrade. The game tries to give back stories and get you to like these people and build their characters, but other than side missions, they dont tie into the main story.The sound design in Chernobylite is strange. One of the bigger aspects that takes away from the experience is the voice acting. Literally nobody has a Russian accent and the accents that are here are all over the place. Someone born and raised in the area that was forced to flee shouldnt be speaking perfect English. Igor has a British accent and that doesnt line up to the story at all. The soundtrack offers solid music that can affect the atmosphere, but in a lot of cases it just doesnt seem to fit well. I almost feel like ambient background noises along with wind and the sound of the Shadows in the distance would have made for a better decision. The sound quality across the board is excellent.Chernobylite runs on the Unreal 4 engine and it can be beautiful on PC. The lighting is magnificent and the areas can change to include rain and fog. This actually provides certain advantages over enemies as sound or vision from the AI can be impaired, which is a nice touch. Some of the settings just take place in the woods and it can feel drab. The locations in Chernobyl that include buildings that you can actually go into help provide a better idea that you are in Chernobyl rather than just being buried in the woods. The game did offer pop in on objects at a distance, but with the trees swaying in the wind and shadows that are meant to fool you, the visual design is fantastic. The Farm 51 did include DLSS on PC, but no ray tracing and honestly it didnt need it. Running on a RTX 3080 and at 4K, framerates ranged from 60-100 with DLSS giving a slight boost on the lower end. The game feels like its designed to harness the raw power of these newer cards, but its well optimized. Reflections on surfaces look great and object textures offer sufficient detail up close. Closing Comments:Chernobylite offers a deep survival game experience that offers elements of sci-fi, horror and RPG. Its hard to call this a survival horror title, but all the management aspects and the branching storylines will provide fans of the survival genre plenty to enjoy. There are only a handful of areas to go to and while theyre decent sized, enemies tend to respawn in the same location upon returning to the location. The atmosphere could have gone a different direction, but the visuals and environments are undeniably effective. The visual design in the portals in particular are something to marvel at. With a structured base of a game with varying options to keep players coming back, Chernobylite is worth checking out.", "date": "July 28, 2021", "grade": 4.0}