{"name": "Last Stop", "ref": "https://hardcoregamer.com/?post_type=post&p=407564", "text": "The last time I had reported on Last Stop, the latest graphic adventure game from developers Variable State, I noted that it didnt seem to be getting as much attention when compared to other games being published by Annapurna Interactive. Which was odd to me, because it looked neat, seemed to have some entertaining hooks, and was Variables latest project followed their award-winning game Virginia. It felt like it was getting the middle child treatment, which was sad, because a lot of promise could be seen in this little anthology-esque adventure.Last Stop is a narrative-focused adventure game set in present-day London, focusing on the stories of three different characters. Theres basically nothing to talk about here when it comes to gameplay as its all driven by dialogue prompts with three different choices and a bunch of walking simulator moments. Theres nothing in its world to interact with as you move and nothing off the beaten path to explore. You just head towards the next story beat. There are occasional mini-games like throwing bottles, playing piano or performing a full first-person investigation like a traditional adventure game, but those are few and far between and dont add much.Each of our three protagonists has their own story with six chapters each, plus a final chapter for all of them, and in between each round of three chapters, you select the order to play the new chapters in for these stories. Sadly, the order in which you play them doesnt affect anything at all, so the option seems pointless. But lets look at each tale in the order of left to right from these selection screens Paper Dolls centers on John Smith, a middle-aged man who finds his mail constantly getting mixed up with a nearby, similarly-named Jack Smith. During a commute in which both cross paths, they bump into a man who becomes mad at them, cursing them by saying You two were made for each other and causing them to switch bodies. And of course, per a lot of body-switching stories, the two are almost comical opposites: John is a balding older guy in a dead-end job with a recent heart attack struggling with finances and a dead wife but has a daughter they love with all of their heart, while Jack is a young single man in his twenties whos healthy, lives in a luxurious apartment, has a gig as an artist, is a bit rude, you get the idea. Its not exactly the most original setup, to say the least.But tropes are tools, so if these elements are used well enough, they can still make for an entertaining story. And indeed, thats what happens here. It takes a while for the best stuff to kick in, especially during moments where our characters arent the brightest bulbs at times (they keep pondering how this happened without ever once thinking huh, I wonder if this has anything to do with the recent time we interacted outside of our apartments that just happened to include a mysterious guy who grabbed both our arms, was mad at us and made vague threats involving us both), there are genuinely charming moments here, especially the interactions between John-as-Jack, Jack-as-John, and Johns eight-year-old daughter Molly, all of them getting good lines. It helps that Paper Dolls is the most light-hearted story here, and this has a lot of moments for levity and more out-there, stylistic stuff. Theres a part where John and Jack plan out their routines in the style of a heist film, the reveal that Jack works for a game developer creating empathy games leads to a section with clever bits of satire, and a selection of scenes where John and Jack look for various specialists who can help them which all climax in humorous moments (especially the psychic). Its all good stuff and still finds time for clever and emotional moments, like when characters actually ponder how to handle things if they cant switch back, with different ways they want to live their new lives.Domestic Affairs comes next, and is about Meena, a professional working for some sort of secret organization with ties to the military-industrial complex, and who is a cold, blunt workaholic being threatened by a young hire gunning for the promotion they want, all while dealing with marital issues and affairs that theyre having, her home life being impacted by all of their projects, especially with the Cats in The Cradle relationship it has created with their son, and they also have a bitter relationship with their father who may have a drug addiction.I know I just said that tropes are tools and can still lead to good stories, but alas, Domestic Affairs wallows in them without ever doing anything that interesting, making for what is easily the weakest story in Last Stop. Its basically just watching Meena deal with her increasingly horrible life that has spawned as a result of bad decisions, and she isnt given any real options to be that likable until the very end. And as the kicker, its the only story to not involve any of the supernatural elements tying all of this together right before the final chapter. But even then, these elements end up having virtually nothing to do with the rest of Meeras story, which mainly focuses instead or her trying to discover whos blackmailing her over her affair. It comes off as dull most of the time and drags things down. Stranger Danger rounds things out, with our main character Donna being a high school student who hangs out with their friends Vivek and Becky in order to help get away from their overprotective cop sister and ill mother that theyre in denial over. One night, though, Vivek points out a mysterious man who keeps bringing different people into their house, yet never sees any of these people come out. So they decide to tail him and find him in an abandoned pool, seemingly with supernatural abilities. One thing leads to another, and when knocking out the stranger during into an escape, things escalate into a possible kidnapping, as Donna now has to handle keeping watch on this stranger, who ends of being more powerful than expected, even when tied up.This is easily tied with Paper Dolls as the best story in Last Stop, especially since it was the one that had the better twists. The stories in Last Stop can be seen as nods to different genres, with Paper Dolls being comedy and Domestic Affairs being a thriller. Stranger Danger, though, goes into potential horror, especially with the rather affable yet creepy Stranger (he isnt given a name unless you find a way to do so) and the abilities they they seem to have. I wont go into spoilers, but it was genuinely chilling to see the effects of it and seeing how it impacted Donna. Again, there are clichs (like an obvious love triangle), but Donna is a nice lead and there are a lot of good moments, with the only real flaw being that we never learn what the Stranger is or what their goals are by the time the credits roll, even when the final chapter hints at a deeper connection to Donna as well.Without spoilers, lets talk about the final chapter for a moment. Last Stop bills itself as a game where all of these stories are apparently interconnected. As it turns out, though, apparently in this case means not really. You may see one or two NPCs cross over for a brief moment, or the occasional similar location, but none of these crossovers have any actual impacts on the other stories. The three stories dont actually collide until the final chapter when John, Meena and Donna meet up under strange circumstances, and yet they still have no rael impact on the others. They interact, sure, and have to work together, but ultimately, they change nothing about how the stories for each character ultimately end, instead going their separate ways after this drawn-out chapter. Instead, it all boils down to a binary choice for each one, courtesy of the Ending-Tron 3000. In fact, outside of those final choices, you seem to have no way to alter the narrative at all. I typically dont mind if the story choices made in video games are minor, so long as they still result in any notable changes, even if its just something like a different NPC appearing later or something. But to say Last Stop only has the illusion of choice would be an understatement. Every dialogue choice you make just seems to have the exact same result. I have Donna lie about having detention after school, but then when her sister arrives later and asks where she was, detention doesnt appear in the three choices, so the game forces me into contradicting myselfand then the contradiction results in nothing as well. And this especially goes for Meena, who too often is given options that simply translate to be a jerk, be a jerk in a different way, and be a jerk in a slightly different way. It never feels like youre actually in control of these characters, just being constantly railroaded.Its possible to simply have a linear, narrative-focused adventure that mainly relies on working your way through dialogue (see last years Necrobarista), but its hard to shake the feeling that Last Stop was satisfied with just telling a bunch of cool stories. It comes across as wanting to be more ambitious, with its dialogue options and random mini-games and actions, as if it wanted to be something in the vein of David Cage (it even has the joystick movements designed to replicate real-world actions and chores at times). It has a well-crafted, visually-impressive version of London with large streets to explore (even if the character models inhabiting it can be awkward, with faceless non-speaking NPCs in crowd, lip syncs that are off, and odd animations and expressions), but doesnt use it as little more beyond a backdrop.This might all sound excessively negative, but what it comes down to is that if all you want is a semi-interactive, five-hour anthology of good stories, then Last Stop can be recommended as it delivers when it comes to entertaining tales (well, two out of three of them). Theyre fun, enjoyable and have cool moments. But if youre looking for something more substantial with a deeper amount of gameplay, then youd best look elsewhere. Closing Comments:Last Stop may succeed when it comes to delivering a (mostly) engrossing set of stories, but it suffers from a notable lack of substance when it comes to gameplay, with several moments of interactivity feeling like they were included solely only to draw things out. It can still be a fun ride with a lot of enjoyable twists and turns, and could be recommended for fans of narrative-focused games, but it could have benefited from more depth. Last Stop is a good, straight shot of a subway ride that gets you to your destination, but dont expect much beyond that.", "date": "July 21, 2021", "grade": 3.5}