{"name": "Overboard!", "ref": "https://hardcoregamer.com/?post_type=post&p=406513", "text": "During the various lockdowns experienced in this pandemic, several folks tried to cope by tapping into their creative sides in one way or another. Some tried baking their own bread, bigger names crafted entire albums of music, and back in another lockdown during January, Cambridge-based developers inkle decided to work on a quick little narrative game. Appropriately enough, its a game about wanting to get away and escape, set on a boat trip across the Atlantic with your loved onesexcept in this case, you end up killing your loved one and have to cover up the murder. Yes, inkles latest game, Overboard!, is a reverse whodunnit and also possibly one of their best games to date.Set in the summer of 1935, Overboard! casts you as actress Veronica Villensey, recently married to the wealthy Malcolm Villenseyor rather, the formerly wealthy Malcolm Villensey. It would appear Malcoms wealth has been wiped out and now the two are deciding to try their luck in America. But Veronica would rather try her luck the the money provided by Malcolms hefty insurance policy, and so on a moonlit evening, over the edge Malcolm goes, ready to sleep with the dolphins Veronica tricked him into trying to see. It seems like an easy setup, but Veronica quickly discovers she may have made some errors, and that she may not have been alone, and now she has to uncover a way to make everyone believe Malcoms disappearance was an accident, all before they arrive in New York. And if they cant? Well, at least shell get three squares a day in jail. From a basic gameplay perspective, there arguably isnt much to Overboard!, as it basically sticks to a visual novel style, selecting what areas of the ship to go to, what actions to take and what dialogue options to go with as theyre all shown to you. The real hook is that you only have eight in-game hours to try and sort everything out, and all other passengers on the ship stick to their own schedules. So you only have a limited amount of time to make all of your decisions and try to figure out who will be where when, who to talk to, how to access certain things, and what you should pick up and leave behind, with certain events or movements eating up even more time as well. And as you may have guessed, it isnt always an easy choice.For example, one of the first things that you can discover in Veronicas cabin is that one of her diamond earrings seems to have fallen off, which if it happened on the upper deck  the crime scene  it could easily implicate her. Get there too late, and one of the passengers has already found it, and now you need to come up with a possible excuse, or just lie and say it isnt yours somehow. Of course, you could just bolt out of the cabin immediately and go straight for the upper deck and find the earring first, except this results in not having time to deliberately mess up the bedsheets (as Veronica fell asleep on a lounge chair after coming back from the murder), meaning now the maid can see that no one seemingly came back and slept in the bed, creating suspicion and forcing you to work your alibi around it. The result of this is a beautifully simple yet perfectly taxing adventure game, one that requires you to notice all of the possible pieces to the puzzle at hand, likely going over everything you can on your initial run as you try to figure out how it can come into play later. This extends to the actions of your fellow passengers, because like any good and meaty mystery, theyre all harboring their own dirty secrets as well. From the hunky Commander Anders to the drunken gossip that is Lady Armstrong, all of them add different levels of intrigue to things as you learn of mysterious papers one holds, a silent stranger seemingly being in anothers cabin or the fact that another may be thinking that the ship is sinking. Each new development is added to a little checklist, helping you keep track of what to look for and what could possibly help you with your cover-up.The fact that the mystery in Overboard! ends up containing so many knots to unravel is, of course, a good chunk of the fun. Its easy to complete a run of the game (which typically lasts around half an hour) and learn about each new little catch with each attempt. The first couple of times I tried to get away with things, I accidentally fumbled when it comes to mentioning Malcolms whereabouts or lack of. Then on one try, I figured I had gotten away with it only to find that Lady Armstrong seemed to have some way of strong-arming Commander Anders into siding with them almost every time. Okay, so I guess I have to get them out of the way. I can smother her with a pillow! Yes, hopefully theyll just think it was natural caus-oh, they, uhdidnt fall for that. Off to jail I go againOkay, new run, maybe I can try pinning the blame on someone else. I have Anders on my side now, Ive established that someone else could have been there, or maybe someone mistook something, maybe I can make it seem as though they caused Malcolm to jumpaha, success!! Ioh wait, right, Malcolms life insurance policy doesnt cover suicide. Okay, I noticed that key in Malcolms jacket alongside his wallet, maybe it opens another cabinha, it does! Now lets see, I can plant the wallet in here and blame them, but will that work? Yes, it did! Were rich! Veronica is swimming inuh, whats this ending? Oh, looks like there are loose ends coming back to haunt uswell, time to dig deeper. Its a beautifully-tangled web that encourages players to try something new each time to see if they can uncover a new and vital piece of information or object that eventually unravels things just a bit more. A nice, challenging little burst each time, helped along by excellent writing. Unsurprisingly, the team behind 80 Days and the Sorcery! titles still brought the same level of wit to Overboard!, giving each character a good chunk of personality. Through various discussions, we learn more bits about each character (including hints fact that Malcolm may have deserved his fate for various reasons), all of whom are enjoyable with clever dialogue. And that extends to the version of God that you can ask for hintswell, a god, anyway, and possibly one of the snarkier, more sinister ones. And as a bonus, certain results of key conversations you uncover are saved between runs, meaning things thankfully dont get repetitive.This is where I suppose I would detail any possible flaws with Overboard!, but honestly, I cant think of anything notable in that department. Some people might argue that its not much of a looker, with limited artwork and any possible backgrounds only showing up in character portraits during certain conversations, but it doesnt need to be a looker. The minimalist approach, simple yet stylish characters and ambient noises with a few era-appropriates tunes are enough here, as the focus here for inkle is again on the narrative, grabbing a hold of you as you set out to get away with murder and never letting go, throwing a nice batch of small yet effective curveballs at the player. Its a quick mystery that you can easily play in short bursts and one worth checking out. Closing Comments:Overboard! is one of the years most delightful surprises so far, a terrific reverse murder mystery with several twists and turns around every corner, and one that can still put up a notable challenge as you try to figure out every possible step towards getting Veronica off the hook and on the path to a life of luxury instead. A mix of sharp writing, clever puzzles and simple yet effective gameplay results in a killer experience that will leave you coming back for more.", "date": "July 2, 2021", "grade": 4.5}