{"name": "Mario Golf: Super Rush", "ref": "https://hardcoregamer.com/?post_type=post&p=406306", "text": "From the mind games that can be found in the back-and-forth volleys of Mario Tennis to the over-the-top chaos of Mario Strikers, the sports games starring Nintendos iconic plumber have explored a wide variety of gameplay styles over the years on both home and portable platforms. None, however, have matched the level of peaceful satisfaction that playing a few holes of Mario Golf has inspired in many players over the past two decades. After starting off life on the N64 and GameCube, the series has since largely focused on Nintendos mobile devices, allowing players to hit the links from anywhere much like the varied courses that these games often featured. So its only fitting that the latest Mario Golf game arrives on Nintendos hybrid platform, with Super Rush offering a variety of single player as well as local and online multiplayer modes to suit both big and small screens. Mario Golf: Super Rush expands the depth of its core golf gameplay and introduces some fun new modes, but its middling singleplayer campaign and technical issues when playing online leave little reason to return to the game on its own.Camelot has continued to refine the Mario Golf gameplay over the years, and Super Rush represents the pinnacle of that hard work. Unlike past games in the series, Super Rush no longer requires players to attempt to set the accuracy of their shot, instead placing the focus squarely on power and control. The club you pick and the course itself will still play a large factor in how players approach each shot, with differing levels of wind and a substantial number of surfaces that affect the balls potential trajectory. But the swing is now separated into two sections, with the first determining power and the type of shot, including topspin, backspin and lobs, and the second allowing players to curve the ball to varying degrees at different points after the ball has been hit, providing a greater sense of control with how your shot ultimately plays out. The average player can easily ignore some of the finer details at first and still make solid progress towards the hole, but a more skilled player can take these additional risks to have them hopefully pay off and reach the flag just a shot or two faster. Its a welcome level of additional depth that gives players plenty to strive for in their early hours with the game, as they slowly realize which areas they can improve on to improve their efficiency with each hole.The courses are similarly well-designed, with clear opportunities for shortcuts that may or may not pay off, and plenty of realistic and Mushroom Kingdom-inspired hazards for players to account for as they drive down the fields. The one downside is the lack of unexpected locations, with each of the six available courses representing traditional or expected areas across the Mushroom Kingdom, but hopefully Camelot is willing to experiment with its planned DLC courses. Additionally, the developer has made strong moves to make the game more appealing to newcomers, with a Golf Guide that not only provides useful gameplay tips, but introduces players to some of the more unusual golf lingo as well. If the numerous button combinations prove to be too complicated, Super Rush also provides the option to take advantage of motion controls for its swings, which work about as well as expected, but will likely be avoided by players looking to refine their shot down to the most minute detail. Of course, a game like Mario Golf isnt just satisfied with the fundamentals of the sport its emulating. In addition to Special Shots that can break or simply ignore obstacles in its path, Super Rush introduces a new element of gameplay in between each shot where players are tasked with reaching their ball in its new location as quickly as possible. Since these balls wont always land on the easy-to-reach fairways despite the good intentions, players must traverse the trickier sections of the course via jumping, dashing and Special Dashes, with the latter two both consuming a stamina meter that slowly recharges over time and can be filled up with hearts strewn about the field. Special Dashes are also useful for knocking aside other players and causing them to lose coins, which can be used to fill up the aforementioned power shot meter. This more frantic gameplay could be frowned upon by longtime series fans, who value the relative peace and quiet that Mario Golf offers compared to the plumbers other sports games. But since these sections of gameplay can be performed simultaneously when playing with others, it goes a long way towards reducing the downtime that the series has often dealt with and keeps players engaged with the action as they try to out-hit and out-run their competitors.Although all sixteen characters are available from the start of the game, Mario Golf: Super Rush does require players to unlock most of its six available courses, either through the solo challenges or by completing Golf Adventure. Set directly after the events of the jolly opening cutscene, the single player campaign stars a customizable Mii who begins their golf journey as a rookie alongside other Mario characters. As the player focuses on upgrading their badge and improving their golf skills, they can explore several decently-sized hubs that reflect the theme of each course, with a large number of Mushroom Kingdom inhabitants to chat with. These conversations, while wholesome in nature, are mostly forgettable and are more likely to be ignored as the player progresses through the story, with a giant red arrow showing the way to the next required objective. Each hub also features a practice area where players can complete short (and surprisingly tough) challenges to hone their skills, as well as a shop to buy new clothes and clubs from with their earnings. Golf Adventure initially starts off slow, with the mode forcing players to replay the same course in gradually larger chunks before they eventually earn the badge and move on to the next area. The more memorable sections of the campaign present themselves during the second half, when boss battles and more unique gameplay challenges become a nice buffer inbetween the more traditional golf gameplay, but as a whole, the single player mode feels undercooked and repetitive despite a runtime of 6-8 hours, leaving little reason to fully complete the adventure when the vast majority of the unlockables dont carry over to the main game. Shockingly, Golf Adventure introduces players to only one of its two new modes of playing golf, with Speed Golf showing up at around the halfway point. Speed Golf takes advantage of the same courses as the standard golf mode, but embraces the new traversal aspect within how it scores players after each hole. Instead of simply relying on strokes, each hit instead adds one minute to the players overall time, which is then added on top of the amount of time it takes each player to drive the ball from beginning to end. Much like the core traversal mechanics, Speed Golf will likely appeal more to players who bounced off the more relaxed nature of past Mario Golf titles, but its a perfect fit alongside the other mechanics Camelot has introduced to accelerate the core gameplay. The other new mode, which is featured in the opening cutscene but is nowhere to be found in the campaign, is Battle Golf, which restricts players to two separate stadium courses that are far simpler in their design. Instead, the challenge of Battle Golf lies in taking advantage of each characters special moves to be the first to capture three flags as quickly as possible, while avoiding the chaos of other players and stage obstacles, including the optional rush events that create even more mayhem every few minutes. The mode can be frustrating when it reaches its peak levels of anarchy, but theres still strategy to be found with planning out your path for reaching that flags that are more secluded from other players and obstacles, and the race for the final flag can easily produce some of the games most exciting and heartbreaking moments.Much like the core Mario platformers, Mario sports games have typically felt polished in their presentation, and Mario Golf: Super Rush is no exception. From the subtle effects that the wind and rain can have on the various elements of the courses, to the bombastic sequences that play out before each character shoots their Special Shot, Super Rush nails the beloved looks and vibes of the Mushroom Kingdom through its solid graphics and inspired soundtrack and sound design. Unfortunately, that same level of polish doesnt fully carry over to the online multiplayer modes, which allows players to join customizable lobbies of up to three others where they can partake in standard, Speed or Battle Golf. While the infrequent stutters are only slightly annoying, particularly when they happen in the middle of a swing, the larger issue is the communication errors which boot every player back to the menus. Shorter matches like Battle Golf or three holes of standard or Speed Golf can usually avoid this issue, but anything that tries to run longer is less likely to reach its conclusion than one would expect, making the time put into each match feel wasted. Much like any online multiplayer game these days, these issues could always be ironed out with further patches, but as it stands, players would be far better suited with gathering some friends in the same place as opposed to trying to play a full 18 hole course over Nintendos shaky servers. Closing Comments:Mario Golf: Super Rush strengthens the core gameplay with its faster pace and strong fundamentals, but the barebones package will likely leave players wanting more. Even with the additions of Speed and Battle Golf that offer fun alternatives to the traditional mode, the lack of a reliable online multiplayer experience and a mediocre story campaign leaves little for a solo player to get invested in without some local friends to play with. Super Rush has clearly put a focus on quality over quantity, with its stellar presentation and refined mechanics making it another excellent entry in the series that diehards are sure to enjoy. But until the technical issues get ironed out and more DLC characters and courses get added on down the line, Super Rush will have a hard time standing alongside some of the Switchs other multiplayer juggernauts.", "date": "on June 29, 2021", "grade": 3.5}