{"name": "Backbone", "ref": "https://hardcoregamer.com/?post_type=post&p=404582", "text": "Does anyone really want normal detective games anymore? Was Disco Elysium a possible game changer, alongside the more Twin Peaks-inspired titles like Kathy Rain or the Darkside Detective games? Or is there just something about certain genres or twists on established ones such as film noir that draws us in more? I dont think I can necessarily say, but after games such as Backbone, I can say that Im okay with never going back to normal if it means more games like this. Coming from Raw Fury and developers EggNut, Backbone is another offbeat noir adventure that easily commands your attention and finds ways to keep a hold of it.Set in a dystopian version of Vancouver (simply known as The City here) thats populated by anthropomorphic mammals (birds and reptiles remaining regular animals), Backbone sees you playing as Howard Lotor, a raccoon and a private investigator with the type of gruff, snarky exterior that youd expect from a character such as this, having been stuck with small-time cases. But when hired to track down a potential cheating husband and find out whats going on, Howards investigation leads him to a club called The Bite, where he has run-ins with crime boss Clarissa Bloodworth and investigative journalist Renee Wilson, eventually uncoveringlets just say something shocking that leads to a much larger case than Howard expected.I really cant go into spoilers about what exactly drives the plot in Backbone. Or to be more accurate, I suppose I dont really want to, since this is another game where going in blind may be the best approach (even if there has been a free prologue out for a while now). The true joy comes from discovering all of the details about the games world as you go along (in particular, the caste system they have and hints towards what the dystopian parts actually come from), which is delivered in a natural way as you interact with the cast of colorful characters. The closest comparison I can make is the Rubacava portion of Grim Fandango, which is probably one of the highest honors I can give a games story. And like a lot of noir tales, the plot goes through a lot more twists and turns than it appears at first. The majority of the gameplay in Backbone is dialogue-based (with a couple of light puzzles), meant to evoke classic CRPGs, where Howard has to rely on his words and whatever wits he has in order to get ahead. You have to do whatever it takes to get the facts out of peoplebut what conclusions and theories you arrive at with these facts, especially when it comes to discussing them with people like Renee who can help, is mainly up to you. Some bits may be essential to the big picture, a couple may be just red herrings. And trying to untangle this web until it makes sense is indeed fun, and the game is at its strongest when letting you go full detective.It helps that with different approaches when it comes to how you handle Howards investigation, the opportunity for multiple paths arises. Saying the wrong thing may put a quick halt to a conversation, and thus might require Howard to find alternate means of getting whats needed, if possible. Or sometimes you might have to decide how to sneak into a building, like either climbing up and getting in from the rooftops or sneaking in through the back entrance. And even those options can come with their own choices about how to approach them. Its a game where multiple playthroughs are encouraged, maybe not changing more plot-heavy elements, but worth going back just to see if different options have different impacts, even if its just seeing how certain characters react this time around. Sure enough, the characters in Backbone are one of its biggest selling points. Howard is delightfully snarky and bitter, yet lovable (or thats how I chose to play him, anyway), Clarissa is a confident and imposing villainess, and others like paranoid conspiracy nuts, chipper cab drivers, at least one notable cameo and a recurring newsstand owner are also treats that also provide nice levity as well, alongside the more sympathetic characters and dramatic moments. Theyre all backed up with impressive dialogue and writing as well, with all sorts of different personalities and attitudes shining through, illustrating just what the brutal food chain thats set up here has done to this games world, and showcasing the gaps between the haves and have-nots, and how they treat each other.Indeed, one of the reasons youll want to investigate everything is to learn more about how this world works, what The City is actually like. And what a city it is. This shouldnt be a shocker if youve looked at any of the screenshots, but Backbone is an absolute stunner, with truly breathtaking hi-bit pixel art and a terrific use of 2.5D graphics. You need to see it in motion to appreciate it, the level of detail when it comes to each of The Citys areas drives home how its a main character in and of itself, and how fluid and lifelike it can feel with so many well-animated characters walking the streets at times, even when inhabited by talking otters and the like.This is all especially prominent whenever you get a good walk in certain sections that show off a grand cityscape, with propaganda-style statues and posters in the backgrounds, or when you get to see bits of urban decay in contrast to the more affluent parts of the metropolis. It feels like a twisted-yet-beautiful mirror universe version of Zootopia, while also still feeling like a real-life city. Back it all up with a superb doom jazz soundtrack by Danshin and Arooj Aftab that effortlessly fits both the dystopian and noir vibes perfectly, and Backbone easily goes down as one of the years most aesthetically pleasing games. Backbone truly is an amazing adventure for the longest time, one with rarely anything that bugs me (except for a couple of minor bugs, but nothing that hindered gameplay). And the moments where you have to use stealth are a a tad simplistic and shallow (they comes across as more of a remnant of the earlier stages of development), but those barely felt like a hindrance. But what did hurt the game waswell, I cant go into this in detail without spoiling anything, but lets just say something happens at a certain point that happens to act as a big twist in many ways, one which significantly changes a good chunk of the plot (and arguably invites further comparisons to Disco Elysium).The problem is that while the direction the story goes from this point is shocking, unexpected and interesting (though whether its in a good way or not is up to you), the pacing, structure and even the gameplay sort of change with it as well, dropping a lot of the detective work in favor of something more linear, and something that feels too quick, leaving the game a little short. Its even where choices youve made that should begin to pay off get dropped, as do a couple of plot points (a Fallout-style Where are they now? epilogue might have been welcome). Not that Backbone was ever a lengthy beast to begin with, described as lasting five to seven hours (though my playthrough clocked in at just over four), but it never feels brief until after this turning point. Its a twist that might work narrative-wise, but the gameplay suffers for it. In the end, though, I can still say that I genuinely loved Backbone overalleven if its reminiscent of Thimbleweed Park in how what should have been a jaw-dropping twist finale just had me raise an eyebrow and go wait, was this the point where they ran out of Kickstarter funding and just had to wrap things up? Still, cant complain much. Closing Comments:Even if its brief and falters during the third act, theres no denying that Backbone is a truly gorgeous and captivating adventure, with an engrossing world that youll want to see even more of. Its a unique mystery with a cast of amazing anthropomorphic animals that ends up going places players wont expect, and its also one thats likely worth revisiting after youve finished. Theres just a lot in here that truly excels in creating a unique twist on noir classics, and EggNut should pat themselves on the back for giving us another detective game that proves why many of them prefer to take the offbeat routes these days.", "date": "June 7, 2021", "grade": 4.0}