{"name": "Hood: Outlaws & Legends", "ref": "https://hardcoregamer.com/?post_type=post&p=403570", "text": "The more hours I spend with Hood: Outlaws & Legends, the more I feel that creeping reminder seep in that games like Evolve and LawBreakers once existed. Not because what developer Sumo Digital have crafted here, in their take on one of English folklores oldest tales, is doomed to fail. Furthermore, that its lacking  albeit in the sense its core loop doesnt warrant repeat visits. Or to add to that, that its arrival comes at possibly the worst time imaginable. That its demise on the basis of active player-count is a matter of when, as opposed to if. Quite the opposite on all these fronts; for one, theres still plenty of room for a few more alternatives in the PvPvE scene. Two  and more fundamental a point here  Hood genuinely has something promising going in its favor. And this, coming from someone who actively avoids online-centric, competitive multiplayer outings like the plague, take that as an even more emboldening compliment with whats provided here.Buried it may be beneath predominantly unsatisfying melee combat on a mechanical level, as well as a general mission progression that at times feels at odds with its own intentions. Thats without factoring in the many symptoms of online connectivity woes, the present state of a game sorely lacking in content and worst of all, how the community itself has adapted, putting it kindly, to the games interpretations on what constitutes as a match victory. One primary mode, four characters/classes and five maps in a release whose bevvy (or lack thereof) of substance quickly loops back in on itself with a solitary objective-based mode thats even quicker in laying out just how thin and loose the experience can get. Hood: Outlaws & Legends has many problems, that much is clear. Some more damaging to ones personal enjoyment than others and in another light, had this been an utter failure, perhaps the sentiment would be to walk away and refuse giving the game a second glance.And yet, I reiterate: theres something here. Whether its the preliminary phase in each match that has you and your fellow three teammates sneaking through the map, albeit for the briefest of moments before it all truly kicks off, or the delightful tug-of-war the core PvPvE structure has wrought in its asking the player just how careful, or wild, they want to be for the sake of victory. For all its occasionally janky animations and questionable (again, a milder equivalent) hit-box detections between players on opposing sides, theres still that satisfaction to cherish in the many emergent moments between matches. Baiting a group of AI soldiers so as to have them gang up on a nearby opponent. Likewise, fooling a lone player into an implied one-on-one, only for an ally  tucked away in an unforeseen corner  to suddenly emerge and initiate an instant kill one is rewarded upon sneaking behind a foe, AI or human alike.These kinds of small, standalone moments may not, on paper, sound or seem like theyd be entirely exclusive to a game like Hood. That similar build-ups and executions couldnt so easily be replicated in another game, whatever its genre or however its mission structure may dictate player mentality. Likewise, in theory, to consider they are but the briefest of moments  when teams actually co-ordinate and decide to help one another out  I wouldnt begrudge someone else to assume these opportune times dont add up to much. The point is: for all its emphasis on stealth  the idea that battle, direct engagement, may not be the ideal way to go  that supposed move away from the precarious of competitiveness doesnt actually negate the need to think things through thoroughly and methodically. Making such pivotal moments of teamwork that much sweeter. At the very least, Hood succeeds on that basis. And Im not just referring to the simple fact that those who actually work as a team  players who communicate to one another and make sure to look out for one anothers back  will benefit the most from this style of play.But even if you find yourself confined to that more lone wolf position, taking the time to farm for XP by marking as many enemies in one case, potentially taking them out seconds later. Hood: Outlaws & Legends still finds ways to test and trip-up if one isnt careful. To broaden things to something a touch more than just a case of an allied group of four players taking on a fellow group of four players. Its during each matchs first-half where perhaps the most enjoyment  where a lot of this deduction on how far you sway between teamwork and lone priorities  is to be found. So its disappointing then that the latter stages of most matches do sadly devolve into your run-of-the-mill Deathmatch/Domination-esque fight for supremacy, rather than anything that could be considered tactical planning. A major consequence of the fact that victory in Hood is confined solely to whichever team manages to haul the treasure at the final moment.Regardless of the time and effort the other team might have put in seizing the key, extracting the treasure, guiding it to a desired location on the map and, putting it bluntly, doing most of the work for such a diminished return in rewards. The resulting experience of matches when it reaches this point, slipping too much into headless-chicken like behaviour  when the very concept of stealth is thrown completely out the window and players are mindlessly sprinting about. Spamming attacks, disregarding any and all AI foes nearby, even if that can work to ones favor on occasion. Hoping the RNG back-end server gods bless them in that instance, to then receive a measly amount of gold at the results screen for all their troubles.It also results in a great disservice to the map design in Hood  limited a selection it may be. As narrow and a little too reliant on bottlenecking players some may seem, theres fortunately enough variety and possibility with how space and verticality too play a factor across pretty much all maps featured in the game. One interesting detail especially is the decision on whether or not to, for example, open locked doors or cut loose climbable ropes scattered about the map. Minor an element these bits of level design are, its another small but crucial decision players must make when thinking long-term about how matches can play out. Again, even if a vast amount of a maps routes, floors and areas end up discarded during the final stages when it resorts so easily into beating each other up for kills. Closing Comments:Time will tell if Sumo Digital can iron out the many creases prevalent in Hood: Outlaws & Legends. Providing that the early player-base is patient and/or willing enough to stick around for whats coming. An already-difficult feat among online-multiplayer ventures, but one Sumos efforts here have only added to on top. But while this isnt to excuse the games somewhat-woeful lack of content and back-end connectivity alike, persist through the bevvy of janky animations and far-from-fluid mechanics and what youll find is a PvPvE effort with a solid-enough vision  albeit one that hasnt stuck the landing. The potential always there to flourish into a series of interesting little emergent moments neednt requiring players of all backgrounds to forcibly funnel themselves into that most tactile of team mentality. Theres still a lot to do  so far as amendments to the overall flow, as much base content to warrant the grind to get there  but Hood: Outlaws & Legends has at least found a way to fit sufficiently, if not entirely successfully, into the PvPvE mold.", "date": "May 31, 2021", "grade": 3.0}