{"name": "Maneater (Switch)", "ref": "https://hardcoregamer.com/?post_type=post&p=403746", "text": "Revenge has always been one of the strongest motivators. As a plot device it would be a tired clich, but remains appealing as most of us have had some sort of fantasy about getting back at someone who has wronged us. The wrongful killing of a loved one has been done to death in literature, movies and games, whether it be a significant other, parent or child. In Maneater this theme is played out, as the protagonist is seeking vengeance on a man who disfigured her and killed her mother. The twist is that the protagonist is a bull shark.Maneater begins with a prologue where the player learns the basic controls by controlling a shark through the waters of fictional Port Clovis. After a short while the shark has an unfortunate encounter with the star of the reality TV series Shark Hunters vs. Maneaters, who goes by the name Scaly Pete. Pete captures the shark and kills her, but upon cutting her open finds she is with child and delivers the baby shark by improvised C-section. The baby shark attacks the shark hunter turned murderous midwife, taking most of one of his arms before being tossed back into the ocean. Thus begins the baby sharks quest for revenge.A shark seeking vengeance against a person for killing their relatives was explored before in the absolute dumpster fire cinematic triumph in Jaws: The Revenge. It was a ridiculous premise in that film and even more so in this game, but the difference here is Maneater has enough self awareness to be cognizant of its own absurdity and have fun with it. The game features narration from Chris Parnell, giving the game the feel of the snark reality show where Scaly Pete earns his salary. Lines like 400 millions years of evolution defeated by future luggage add levity to an otherwise dark premise of a man-eating shark on the rampage. The action Shark-PG has interesting game mechanics that ante up its overall silliness but also make it more fun. The shark gains levels by gaining experience points by fighting other predators, eating prey and killing humans but also gains items that assist with evolution. The term evolution is used loosely here, as this pertains to things like overeating to make the shark bigger and also adding on a nice suit of exoskeletal armor, sonar echolocation or electric teeth, among other evolutionary traits that dont match up to any shark youd see in a National Geographic documentary. This takes the game away from being a realistic shark simulator (which was never really intended) and more into RPG territory where the character is powered up with abilities no one possesses in the real world. It adds to the absurdity, but in a way that benefits the gameplay.The open world of Port Clovis is a lot of fun to explore. For the observant player there are many humorous moments to be found throughout the many landmarks in Port Clovis. There are a few humorous Easter eggs to be found in the game world like a giant bathtub drain stopper at the bottom of the sea along with several pop culture references. Exploring Port Clovis one can easily observe influence from the world building of Grand Theft Auto, where the fictional setting feels like an actual living environment filled with enough humor to offset the otherwise grim premise. Of course, making the connecting line to Grand Theft Autos world may be helped by the fact that like that other franchise, going on a rampage and drawing notoriety draws out the shark patrol in droves. While taking advantage of being able to explore the open world is where a lot of the enjoyment comes from, advancing the story is a much more linear process. There are three basic mission types: Overpopulation, Hunter and Revenge. Overpopulation is finding a large group of prey such as catfish or mackerel floppers and eat X number of them. Hunter is taking out an alpha predator and Revenge is going to X location to eat X number of people. After doing enough of these there will be a showdown between the player and the regions apex predator which will advance the story further before the ultimate final battle. The lack of variety in mission structure can get tiresome, but part of the appeal of open world games is the freedom to go explore and make your own fun.Playing Maneater is enjoyable due to the responsive and intuitive control structure. Sometimes there are issues with lock on and there were several occasions where it seemed like the camera was sentient being trying to make progress as difficult as possible, but navigating through the watery environments was a breeze. The game controls worked well enough where I could challenge myself early on by taking on more powerful predators in combat and actually winning on occasion and feeling like I had a fighting chance when I lost. The controls for dodging and lunging against powerful opponents made the challenge enjoyable, bobbing and weaving to eventually wear down an enemy that clearly had the advantage. The sea creatures and environments look great on the Switch, and the portability factor made Maneater fun to play in bite sized doses. Completionists can probably get about 20-25 hours out of Maneater, but those who tend to bore of exploration and the repetitious loop could probably mainline the campaign in under 10 hours. The loading times seemed surprisingly reasonable compared to other Switch ports, and while there were some hiccups with performance if too many fish got on screen, these happened rather infrequently. Closing Comments:Maneater is a ridiculous, fun title that should be applauded for its ambition of making a viable action RPG starring a shark. The snarky narration provided by Chris Parnell helps cement the tongue-in-cheek nature while the gameplay reminds us why a shark is a good choice for a game that focuses on a violent force of nature. The repetitive nature, lack of variety and sometimes wonky camera hold Maneater back from being a true Apex RPG, but even with its limitations Maneater is a fun and unique game that should be experienced by action RPG fans who want something unconventional on Switch.", "date": "May 25, 2021", "grade": 3.5}