{"name": "Biomutant", "ref": "https://hardcoregamer.com/?post_type=post&p=403705", "text": "Picture this for a second: the opening moments of a game centered around exploring a vast, seemingly post-apocalyptic open-world in which some form of calamitous event has occurred. Or may in fact occur once more if you dont do something about it. You emerge from below ground into a grand, vibrant space; the camera pans up and out to reveal but a sample of the wider breadth of the game youre now at liberty to explore. Cue title-drop. Tasked with dealing with four distinct, hostile, potentially world-ending threats  all of whom are located in one of four compass directions right at the edges of the worlds perimeter  the game follows this up by suggesting, but not flat-out declaring, that the main quest may not be all there is. That there may be more to what one can experience upon taking that first, curious trek forth. Does any, or all, of what Ive just described sound a little familiar to you? If it does, it may also surprise you to hear that this direction isnt the main drive to ones time with Biomutant.As it turns out, it ends up playing a supporting role, at times easily dismissed for more interesting endeavors. Endeavors that have come to define the [at present] 25-30 hours spent with one of its many branching endgame story routes. But what a rather wonderful number of hours they have been. Hard as it is to pin down just how much (if at all) developer Experiment 101 have borrowed from Nintendos book here  the game was originally unveiled around five months after Breath of the Wilds release  it doesnt take long for Biomutant to occasionally revert into a little meta-game of spot the influence. Theres shades of Far Cry 3 and Shadow of Mordor, just as theres a call-back to the stylings of Fallout, Borderlands, Max Payne and Devil May Cry of all things. There are games that fling as wide a net as possible in what ideas they want to capture and encompassand then theres Biomutant. A game that does this, one assumes, with little care for just how cohesive  let alone enjoyable  these many design choices may end up becoming. Ah yes, we havent even tackled the artistic direction the game takes here too. Arguably Biomutants key piece of marketing that has drawn many an eye since its announcement.Going in, youd think (rightfully so) that all signs are pointing to disaster. Already the idioms come flooding in: the game has bitten off more than its bi-pedal, player-created, rodent-like warrior can chew. Jack of all trades, master of none; wide as an ocean, deep as a puddle, etc. How surprising it is to find that Biomutant  despite that figurative juggling act still ongoing, like some towering stack of boxes the game is hoping to keep in check  not only pulls this off, but only amplifies the joy one has once again in the very act of exploring its rich world of multi-colored flora and mutant creatures that would sit right at home in a childrens picture-book. Perhaps thats why Biomutant is so perplexingly-charming to want to see more of. Even just the sight of a group of seemingly-innocent, cartoonish characters wielding guns/melee weapons and beating each other to death is off-kilter enough to be regarded as inviting. Or having the omnipresent narrator offer another not-so-subtle jab at your combat proficiency, though the option to alter just how much a running commentary is provided, is also welcome. Biomutant makes sure to paint the post-apocalypse in a not-so-dreary light, but isnt shy of having you stumble across a cel-shaded, low-poly human skeleton on occasion. One minute youre sprinting across a lush field of green, the next youre navigating what must be a landfill littered with nondegradable plastic waste. The shifts both visually and tonally are as much frantic as they are frequent.But its admirable just how unafraid X101 (Ill be shortening the developers name from hereon) are at being unconventional with this juxtapose, presenting one tonal mis-match after another. Scavenge this toxic section of the map; also, look at how goofy these enemies appear. How Biomutant, if youll pardon the rather cobbled-together comparison, feels like the result of the following pitch: post-apocalypsebut for children. Thats not a slight against X101, yet not for the first time do you ask yourself: surely, this isnt going to work. Yet Biomutant absolutely does work. How, you may ask? For starters, Biomutant  like recent favorite Genshin Impact  understands that part of the joy of exploration is in the discovery. Whether its the spectacle of reaching the top of a hill to marvel at the near-distant plains before you or the curious little emergent moments of an underground bunker or side-quest that just may provide you with a helpful bit of clothing. Granted, Biomutant isnt entirely open, as its namesake may imply. In that at any one co-ordinate one can physically traverse without restriction. Nor is it as puzzle-engrained as these recent highlights of the past few years, though the sprinkling of move-limited puzzles (requiring you to line up colored dials in a given fashion without resorting to brute-force) do provide a welcome break in proceedings.Theres spots of invisible walls and working out just which parts of the environment are climbable and which ones are simply walls disguised as such. Players will no doubt find themselves funneled at points into a route as opposed to making that choice on their own, but thats not to say that such moments  making a two/three kilometer trek down some beaten road  are deprived of more quainter enjoyment. Basic an execution it may appear, theres joy to have in simply setting off on ones journey across plains and plains of lush art design  not unlike last years Ghost of Tsushima in that respect. The trick, once again, is in suggesting rather than flat-out telling its players what may be out there. As hard to ignore the games use of that dreaded Ubisoft open-world formula, is at times  one of the main story quests requires you capturing rival outposts dotted about the world  theres consolation in that Biomutant allows you to ignore this for a large stretch of ones time. You are unfortunately required to complete them to see the end credits and its odd that the game, after a certain period, essentially gives you the option to skip the rest of the quest. As if, by its own admittance, conquering outposts is there just to pad time. Even so, formulaic  and a touch aggravating with the whole go here, get this, come back, go somewhere else, come back fetch-quest repetition in another part  the more story-leaning sections may seem, its easy enough to discard these moments in favor of Biomutants greater appeal: the freedom to go off and explore at your leisure.Even if, again, ones time exploring are met with momentary instances of systems not properly explaining both their place and relevancy in the grander scheme. Namely, the Aura system and the fact that certain choices or dialogue options instigated over the course of the story can add to either your Light side or your Dark equivalent. This isnt a morale system a kin to something like Fallout  there are no reputation levels to consider, outside of a tribe affiliation that boil down to which settlements you can access, or not. Nevertheless, Biomutant can falter briefly from lack of explanation or indeed elaborating on the importance of such systems at times. Specifically, why one should even bother making a character as good or bad-natured as they want. Without spoiling the details, theres a point during ones chosen quest where a crucial decision must be made. A decision that is limited on the number of times you can make a given choice. Unfortunately, not only does the game force you into a binary choice there and then, but theres little warning on when that critical choice is going to be instigated. The game states it comes at the end of a given NPCs string of quests, but its never made clear if that point has even been reached prior to interaction. A little heads up wouldve been preferred.But to reiterate, Biomutant lets you freely tackle (or completely ignore, albeit to a degree) these moments at your leisure. It was a while before I even considered tackling the next Worldeater quest, or even capturing the next outpost my aligned tribe, required of me. And the reason for that is of course how well X101 sprinkle the world with visual cues and oddities that may turn a curious few minutes in countless hours. From reaching a required point on the map, to acquiring higher-level loot, add-ons, tools that helped me buff my stats, or even just another novel dial-turning puzzle. Its less a case that Biomutant has plenty to do or invest in, but rather the games strengths lie at how well it off-sets its momentary mandatory AAA open-world stylings in favor of a more novel and attractive alternate to a worlds back-story and present state. Even if some of that backstory is a little too on-the-nose at times. Biomutants world exists, because a corporation called Toxanol excessively-polluted the world and made it this way? OK game. Thankfully this is as eye-rolling a pro-environmental message the narrative gets. Better still, its not forced on the player; the backstory is there for those who are eager for exposition, but entirely avoidable for those who arent. What themes or ideas X101 themselves may be wanting to express are fortunately left to the world design and environmental details themselves.So what of combat then? Well again, this is where another one of Biomutants bafflingly-cohesive traits comes into play with surprising effect. Following in the wake of games like Shadow of Mordor and even Marvels Spider-Man to a degree, Biomutant is all about keeping on the move  mixing-and-matching a steady stream of melee and projectile strikes to keep the accompanying group of foes at bay. While groups of hostiles vary constantly, the usual rhythm is relatively the same. Frantically shift from attacking one enemy to the next, making sure to time ones parry so that you initiate a juggling of that same stunned foe to land a few crucial strikes mid-air. Oh and you can also initiate bullet-time by jumping Max Payne-style. Theres even an ability to fire more rapidly by sliding, then firing. Its a touch ridiculous, but again Biomutants pace and its encouraging to be on the move, means its a welcome fit. Getting the timing right to initiate a combo move  whereupon landing three combos in one encounter without getting hit mid-animation, enables you to pull off some stronger-powered Super Wu abilities for a short time  only heightens the incentive to act accordingly.Even the more RPG-leaning mechanics find a way into combat. A highlight being your players Ki meter, which for all intents and purposes is Biomutants equivalent to something like Souls magic meter. One of the interesting things is the way you can borrow MP to initiate an attack. For example, you may want to unleash a Ki-powered attack on a group of foes, but may only have a small amount of Ki in your meter. You can still perform said attack, but what it means your meter then goes into the negative values. Meaning that for a few vital seconds, not only are you without the ability to perform special attacks  as your meter slowly fills up from its -40 or -50 value  but given that the Ki meter also governs your ability to dodge, theres always that possibility youre left vulnerable for a fair few precarious seconds. Of course, this is just one area of the extensive combat potential and it would be misleading not to cast some light on the minor parts that dont quite work. Namely the reliance on an auto-targeting system, as opposed to one dictated by the player themselves. Your player-character at times focusing on the wrong target  bullet-fire and weapon strikes aiming in the direction you necessarily didnt intend.It goes without saying that both inside and outside of combat, there are a lot of systems to consider in Biomutant. Some of which leans even more into the general lack of care for just how silly aspects such as your gear and weapon load-out can get. Not that this works against it in any way. That said, while not every one of the ability tabs or unlockables especially are essential, the game still finds a way to have all these potential avenues work in tandem. Or at least prove a viable, helpful compliment to just spamming away at standard attacks. Combo tricks, weapon types, ailment-inducing abilities, even the fact you can switch weapons on the fly, all of these gel together sufficiently enough that it doesnt disrupt the regular flow of battle. Instead heightening it without making later encounters feel too much like an eventual power-fantasy. Better still, the RPG side of Biomutant is one players will eventually find themselves more and more invested in for more than just the arbitrary increasing of numeric stats. The loot economy and self-serving loop of finding/upgrading gear is another one of the persistent staples and thankfully Biomutant does enough with its variety to make this detour feels worthwhile.Just like its art direction, theres something oddly appealing at the way Biomutant presents this on top. And not just because the menus and general UI has this minimal, colorful, almost mobile game-like attire to it. How add-on attributes to ones gear are presented as having literally been stuck to ones clothing. Before long youre resembling a walking lump of recycled goods whose arsenal is itself a cobbled-together, modular set of components that just so happen to be sufficient melee weapons. Again, this is another area where X101s clear environmental themes are presented in anything other than a preaching or pretentious manner. Credit where credits due (even if that may sound at times like unnecessary praise) to a studio that recognize that not every potential message needs to bludgeon its players to death. Yet to steer this back to the game itself, none of this investment  this strive to find better loot or simply enough currency to purchase it from a stumbled-upon merchant during ones travels  would have anywhere near the staying power were it not for the world. And more importantly, how great it feels at times to simply ignore all objectives, decide upon heading towards a blurred-out part of the map and going straight for it. Voluntarily following the winding roads or rivers at times. The journey is as much, if not more so, satisfying than the destination itself.Closing Comments:As satisfying its exploration is, the most striking take-away from Biomutant is just how astonishingly well it pulls off its intended tone. More so its seemingly endless and mismatched assembly of influences. The feeling that its one mechanic or idea away from disaster  likely to collapse into a confused mess of what was once an aspired open-world, action-adventure. But X101 have seemingly achieved the unthinkable in threading that most unfathomable of needles that is Biomutants pitch. Whose upfront, visual attraction is met with both a satisfying RPG progression and a near-endless supply of let-loose combat sequences. Complimented on top by a world both familiarly ruinous yet entirely fresh in its vibrancy. Sometimes that former familiarity can work against the player  the game occasionally lacking some much-needed fleshing out of its more dialogue-focused moments of choice. And the less said about the delivery of its main/story quests, the better. Even so, Biomutants highs owe a lot to just how stacked against the odds it appears. And how over the span of an average twenty-or-so hour single-run it comes out not just unscathed, but victorious. Experiment 101 finding a way to incorporate the surreal and the strange, yet maintaining a consistent thread wherein the gameplay loop is both satisfying and intriguing to engage with. All of this, despite such continued reveling in its own eccentricity. But its that very eccentric attitude that marks Biomutant down as an unmistakably curious, but more importantly, entertaining open-world adventure to lose ones self in.", "date": "May 24, 2021", "grade": 4.0}