{"name": "Shin Megami Tensei III Nocturne HD Remaster", "ref": "https://hardcoregamer.com/?post_type=post&p=403639", "text": "The Shin Megami Tensei series has been going strong for nearly three decades, but it wasnt until the third iteration, Nocturne, that it truly broke ground in western territories. This dark and brooding franchise took the conception of the demonic apocalypse and made it feel fresh and unique, introducing a recruitment system where you would fight alongside mythological beasts, not too dissimilar from Pokmon. With Shin Megami Tensei V on the horizon sometime in 2021, what better way to reintroduce a whole new player base to what truly kicked the series into overdrive, even helping popularize the Persona spin-off games to a certain degree. With brand new features, touched up visuals and most importantly, a near fully-voiced cast of characters, Atlus is putting in even more love than expected into this beloved cult classic JRPG, but was it enough to entice new and old players alike?This is very much a game from nearly twenty years ago. Combat is turn-based with slight variations to the formula that allow for a more versatile system. For example, if you land a critical blow or hit an enemys weak spot, your team will earn an additional attack, whereas if you dodge an incoming blow, the enemys turn is reduced. And this goes both ways. It allows for a little bit more RNG, especially how you level up and spend attribute points, keeping on your toes as you progress through the surprisingly challenging RPG. Theres also a meter in the bottom right of your screen to indicates how close you are to running into a battle, something I wish more turn-based RPGs utilized back in the day, as you can prepare accordingly instead of running into an enemy trio completely at random.This is a dark, demonic Pokmon-esque game where youre able to recruit iconic monsters into your party and have them do battle alongside you. Theres an incredible number of monsters to recruit, each with their own unique abilities along with strengths and weaknesses they bring to the fight. Just as you would in other Shin Megami Tensei and Persona games, youre able to combine them and make even better monsters, increasing the size of your compendium. The combat systems are surprisingly strong and could be considered ahead of its time for back in the early 2000s. Even today, even though it may not be the deepest of systems, it still has a certain charm to its execution. Atlus has put a Merciful difficulty in for players who just want to sit back and enjoy the story, and I personally prefer this. Its not that Nocturne is particularly difficult, but you would need to grind a fair amount to get through specific bosses. This boosts how much damage you deal and receive, along with the amount of EXP and money you earn from each battle, making your journey far more forgiving. Alongside this, theres a brand new Suspend feature that will allow you to save and leave the game at any point. This is a welcome addition, although it feels like a half step from a full on save-anywhere mechanic that might have been better suited. Granted, we never ran into any issues with finding a save spot, but some sort of save state implementation would have been preferred over what we got.While its enjoyable (yet sometimes frustrating) to converse with demons and try to convince them to join your cause, exploring a post-apocalyptic Tokyo and uncover what caused the Conception is the main draw. Its not only that but there are multiple endings and paths you can walk, with your dialogue choices slowly swaying the fate of the world. Now, Im not entirely the biggest fan when it comes to Nocturnes pacing as for a lot of it feels like youre just going from point A to point B, following a crumb trail, but there are enjoyable encounters along the way, such as Dante from Devil May Cry, or Raidou from Devil Summoner  depending on which option you decide to play. It helps that the translation has been altered in almost every scene to a surprisingly large degree, although it doesnt necessarily change anything major. Its primarily better wording and phrasing while retaining the same meaning as to what was translated eighteen years ago. Atlus has put an exceeding amount of extra work into Shin Megami Tensei IIIs presentation. It isnt going to win any awards when it comes to technical graphics (nor artistic, for that matter) as it looks like its pulled from the early 2000s, but a decent chunk of it has been touched up to look cleaner. This was during an era where texture work was still not detailed or high-res, meaning youll see a lot of simple looking coloring on characters (especially demons). Atlus has greatly enhanced some of the textures on not only the protagonist, but portions of the environment to better immerse you in this demonic world. They also added extra lighting in spots, making Tokyo pop just a bit more. Its not monumental improvement, but it adds to the experience to ensure its closer to what our nostalgia remembers it being. Outside of that, the font for the dialogue has changed, some for the better, such as the choices you make more room for whats happening on screen, although the text itself was a little chunkier.The most surprising addition to Nocturne, or any HD remaster for that matter, is converting this silent, non-voiced title into a fully-voiced JRPG. Well, fully-voiced might be over exaggerating it a hair, but most of Nocturne has received a vocal treatment. This is a treat for both existing and new players, as it brings the game closer to be up to snuff with modern releases. It feels like a whole new experience going through the game again with the English voice track as the voice work is done perfectly, giving specific characters a certain level of charm you just had to imagine back in the day. Atlus could have just re-released Nocturne with visual HD improvements and called it a day, but putting this in to ensure most of the characters get their own voice is exemplary. Closing Comments:Shin Megami Tensei III Nocturne HD Remaster is an apocalyptic blast from the past that goes beyond what we could have hoped for in celebration of the cult classic. This isnt your typical HD remaster, as Atlus has went back and recorded an astonishing amount of voice work, something that wasnt even in the game to begin with. They also cleaned up some of the visuals, even though it still looks like something thats nearly twenty years old. Thats on top of redoing the translation and ensuring we have both Dante and Radiou to choose from recruiting. There are aspects that dont necessarily hold up today in its combat and exploration, especially considering the maps are linear, but if youre in it for just the story, youll be in for a treat with the new Merciful difficulty. Whether youre a hardcore fan or a curious observer, Shin Megami Tensei III Nocturne HD Remaster is a classic worthy of being in any RPG players collection.", "date": "May 18, 2021", "grade": 4.0}