{"name": "Dust & Neon", "ref": "https://hardcoregamer.com/?post_type=post&p=437428", "text": "When it came to sharing my opinions about the best games at PAX West last year, I knew I had to choose at least one from publisher Rogue Games stacked lineup. In the end, I went with Dust & Neon from developer David Marquardt Studios. As I stated then, it wasnt the most original title, being a twin-stick shooter with roguelike elements, but it had more than enough charm in the demo presented to completely win me over, delivering an experience that was just pure fun. Unfortunately, I was so dazzled at the time that I forgot to ask one important question: will this experience that was fun for about fifteen minutes be fun for multiple hours? And the answer to that question iswell, I direct you to the use of unfortunately back there.Set in a futuristic version of the Wild West, Dust & Neon sees you playing as a deceased cowboy reanimated by a mad scientist in order to defeat a robot army, and that one sentence is all that youll be getting in terms of plot. Theres not even an intro cinematic or anything; you just start, see your gunslinger emerge from a cloning chamber and get straight to killing robots. Its not exactly starting things off on the right foot, to say the least. Now, expecting every roguelike action game to have a plot or lore on the same level as something like Hades would be ludicrous, but Dust & Neon only aims for the barest minimum as far as story or characterization goes, mainly through a rather weak sense of humor in stuff like the attempts at one-liners our hero gives out after killing enemies (I came, I saw, I killed they say often, delivering a line that even the cheesiest 80s action film would reject).Dust & Neon doesnt exactly deliver in terms of story, but can it at least deliver when it comes to the all-important action? Well, it does have fun gameplay at its core. Back when I took a deeper look at the game, I said that it had some of the best reloading action of any game ever, and I still say that its the best thing about this game. I dont even mean that as a backhanded compliment or anything, its truly that good. Whenever you reload, a model of your current gun appears on screen, and you see every bullet placed back into it as you quickly tap the reload button for each individual bullet. I probably cant describe how it feels in words, but it feels so satisfying.Part of the reason why the reloading feels all that satisfying, though, is because it goes hand in hand with the gunplay. Sometimes youre dealing with robots that speed right at you and demand quick reflexes, sometimes its a more traditional robot outlaw hiding behind cover with a gun, forcing a duel as you utilize the easy-to-use cover system as well. Or sometimes a powerful enemy wielding a shotgun or gatling gun comes along, and you have to suddenly plug an entire six-shooters worth of bullets into them in a mere second in order to stop them. The point is that Dust & Neon actively feels like its rewarding you for truly living up to the title of Fastest Gun in the West, and thats where its at its best when it comes to gameplay.The rest of gameplay, as mentioned earlier, isnt that original. Theres not much use going into depth about it, even. You have standard twin-stick controls with three weapons (pistol, shotgun, rifle) plus a dodge roll, a hub area where you can purchase upgrades for your headquarters that include shops and free weapons to help you out, permanent character upgrades that can be purchased with points you gain from levelling up, etc. Its all nothing special, but it gets the job done. Everything controls perfectly and it all forms the foundation for a classic, arcade-style shooter. But thats just the foundation and its in building the rest of the gameplay where Dust & Neon falters.Progress in Dust & Neon is structured by having players choose one of the missions currently available via the hub area, which involve objectives such as sabotaging enemy machinery, robbing trains, killing marked targets or other activities that more or less just all boil down to some variation of kill everything between you and the goal. And even if you dont plan to kill every enemy, you likely will. Killed enemies are one of the only ways to gain cores, which are spent on the precious base upgrades. Money is more common, but its spent between missions on either guns or mind blower chips and snake oil tonics that provide temporary buffs for missions, but you need to spend hundred of cores on multiple upgrades for those shops before they truly become useful.So between having to rack up cores as well as upgrade points, as well as having to reach certain levels before the boss levels of each area become open, Dust & Neon falls into the trap of creating a grind. Except Im not even sure it does that successfully, since by the time I had picked up three high-tier weapons (the train heists in particular almost always ending with legendary-status weapons), I had no real need to grind for money in order to get guns, and was just spending money on mind blowers and tonics more out of boredom than anything else. There were the cores, of course, but the game had no shortage of enemies to get them from. So really, all I was doing with each mission was basically just killing time until I reached a level where the game said Okay, the boss is ready now. And notably, if you lose to a boss, they go into hiding until you complete a couple more missions after coming back (they are well-designed battles, though).The conclusion I came to is that Dust & Neon is set up to be a perfect, more straightforward arcade-style action game, but instead feels like it drags itself out with its attempts at integrating mechanics more commonly seen in roguelikes, RPGs, and even looter shooters, what with its two thousand-plus unique guns that basically boil down to comparing numbers as you open up each chest. The game clocks in at around ten hours or so and feels like it only needed to be half that length. It doesnt help that while the graphics are nice and colorful with good character designs and backgrounds, the actual levels become too repetitive and lengthy after a while, with each new biome not adding much in terms of variety. At least theres still a killer Western-inspired score backing it all.One final flaw that also needs to be addressed, however, is the enemy AI and how annoying it can get. Sometimes the game falls into the frustrating trend of just spawning a ton of enemies is substitute of difficulty (at one point even spawning half a dozen or so goons at the immediate beginning of a boss level), sometimes enemies actively seek you out across entire maps, sometimes they wont follow you through doors, sometimes they will, and sometimes they just walk right past you without doing anything, despite having a clean shot. Again, theres fun gameplay at the center of all of this, and if it could benefit from some tweaks, this is a proper area to start with. Maybe then we can move onto making the whole thing a speedier timeClosing Comments:Dust & Neon has all of the tools and gunslinging gameplay needed to offer up a good time, but its hindered by a lack of story or characters to be invested in, bad AI on occasions and a structure that just ends up dragging things out for too long. Theres still fun to be had here in successfully beating enemies to the punch with it comes to being the quicker draw, and maybe those who are more patient will find something to truly enjoy, but for those looking for a good twin-stick shooter, roguelike, or both, there are many better options out there.", "date": "February 16, 2023", "grade": 3.0}