{"name": "Horizon Zero Dawn: The Frozen Wilds", "ref": "https://hardcoregamer.com/?post_type=post&p=278273", "text": "2017 has been a banner year for PlayStation. Sony Interactive Entertainment and its partners have launched a treasure trove of titles that could only be found on PS4 with the crown jewel being Horizon Zero Dawn. Guerrilla Games brilliant new IP mixed a profoundly intriguing narrative, pulse-pounding gameplay and breathtaking visuals to give players one of the best games of the year. Now, eight months later, Guerrilla Games is ready to bring players back into the world of Zero Dawn with The Frozen Wilds. An expansion to the main game, does this icy adventure successfully expand the journey or is this a story worth skipping?Horizon Zero Dawn: The Frozen Wilds takes place during the events of the main campaign. The content of the expansion can be accessed after completing the main mission, A Seeker at the Gates. For those who have already completed the game, its important to note that The Frozen Wilds wont answer any questions left over after beating it. The Frozen Wilds sees Aloy travel to the north where she encounters the Banuk tribe. Proud and loyal, the Banuk tribe hunts Machines in their land of snow and geysers, but something dark and sinister is taking hold. The local Cauldron has begun spitting out new and deadly Machines, and the tribes shaman has gone missing. Aloy must work together with the Banuk to find the shaman and stop these deadly machines in their tracks.Its easy to get caught up in the well-developed backstories of the new characters from the Banuk tribe. Guerrillas writing and world-building are, once again, on point, making the Banuk feel grounded in Horizons world. Theres also plenty of intriguing tidbits that further flesh out what happened to humanity before the Faro Plague. It all remains intriguing stuff and its easy to find yourself hunting for artifacts that further flesh out the worlds backstory. Unfortunately, the main story is surprisingly short, clocking in at just a few hours. The moment you feel like youre getting into the plot, its already time for the final mission. The story with the Banuk does reach a satisfying, yet early, conclusion that manages to tie up most loose ends. Although, there are a few plot threads left hanging that tease a potential sequel. The Frozen Wilds adds a significant chunk of new land to explore. Far to the north, this new land features snowy mountains, geysers and hot springs. Like the main game, theres plenty of stuff to do during your playtime. In addition to a litany of new sidequests, a Tallneck to override, a bandit camp and a hunting ground, players can tackle Control Towers. Across this land, Control Towers have popped up, possessing nearby machines. Aloy can either destroy them or override them, which is best done before attacking any Machines. While these towers are harmless, they can repair damaged Machines, making destroying them first a necessity. Theres plenty here to keep players occupied past the main campaign.As an expansion, The Frozen Wilds doesnt alter the gameplay or RPG mechanics found in the base game. The third-person shooting, platforming, stealth and crafting are the exact same with a few exceptions. The new Traveler skill tree gives players some beneficial new skills to unlock such as Mount Repair and Shard Salvager, which allows Aloy to disassemble resources and mods for extra shards. There are also a handful of new weapons players can try out; Stormslingers, Forgefires and Icerails. Each act like a flamethrower, spewing out either electricity, fire or ice, and are fun to use. Theyre great additions to the roster and helpful when going up against the new Machine types. While there may only be two new Machines in The Frozen Wilds, both are deadly and require patience and precision to takedown. The Frostclaw is like a polar bear, capable of standing on its hind legs as it prepares to assault you and utilizes a cryogenic fluid to unleash icy attacks. Meanwhile, the Scorcher is like a mad dog that charges at a moments notice. Equipped with blaze, the Scorcher unleashes deadly fire attacks. Each is a challenge to master, and the rewards for felling them (EXP and items) are well worth the effort.There is one new gameplay mechanic, puzzle solving. During the main story, Aloy will run into a handful of puzzles that involve guiding a stream of light to an endpoint. To do this, players will need to alter the position of nodes that guide the light. Theyre fairly easy to solve and dont distract from the story or gameplay. Horizon Zero Dawn was a technical marvel back in February, and eight months later, its still downright gorgeous. The new area is as immensely detailed as the rest of the world. For the expansion, Guerrilla has deployed a litany of new snow effects to make the snow-capped mountains of the new area as realistic as possible, such as Snow naturally deforming as Aloy and other characters wade and roll through it. The expansion is a marvel to look at on both a base PS4 and PS4 Pro.That isnt to say that the presentation is spotless. Lip-syncing, which was spotty in the original game, is still hit and miss here. If Aloy isnt talking with one of the main characters, then theres a chance that things might not sync-up. Yet this a tiny issue that doesnt take away from the fact that this game is still gorgeous and remains one of the best-looking games of this generation so far. Closing CommentsHorizon Zero Dawn remains one of the best games of 2017 and The Frozen Wilds complements it with a decent chunk of new content. While not a necessary addition to the main narrative, the expansion adds a personal story thats well-worth exploring. Its disappointing how short this story is, but there are enough revelations and teases for a potential sequel to make completing it worthwhile. With new Machines to fight, side activities to participate in, weapons to play around with and an area to explore, there are plenty of additional hours of enjoyment to be had. At only $19.99, Horizon Zero Dawn: The Frozen Wilds provides plenty of bang for your buck.", "date": "November 6, 2017", "grade": 4.0}