{"name": "Poison Control", "ref": "https://hardcoregamer.com/?post_type=post&p=402658", "text": "For many in America, their introduction to developer and publisher Nippon Ichi Software was thanks to the excellent Disgaea series. Over the years, the company has released all manner of RPGs and occasionally titles in different genres. Even so, it always feels a bit alien when they stray from their RPG roots. Poison Control is the latest Nippon Ichi Software release and it does exactly that. Dont expect a turn-based or even real-time RPG here. Instead, this game is a third-person shooter. Its a total departure from the norm, which makes it intriguing. The question is does this foray into another genre work well or is it not ready for prime time?Poison Control has a lot going for it even if it isnt fleshed out as one might hope from a shooter. First, lets get into the basics that make this title tick. The game begins with a young woman or man (you choose the protagonists gender) meeting a creature called Poisonette. Their fateful encounter serves the basis for the entire game  Poisonette and the protagonist must henceforth share the same body. This enables the protagonist to fire bullets from their arm. There are also times when the two can disengage from each other. This is important due to how levels are structured. Players must shoot enemies, but they must also clean up the poisonous mess spewed all over Hellish stages. Only Poisonette can clean up the muck, which she does by bursting out of the protagonists body. This is only temporary, as she must return after a certain amount of time lapses.Why clean up the poisonous Mire at all? Thats part of the story as well as gameplay mechanics. You see, the story takes place in a variety of personal Hells. Basically, each level focuses on a different woman who had some form of trauma in her life. Your goal is to cleanse these troublesome thoughts and feelings by entering their specific Hell. Not only does cleaning up levels achieve this goal, but its also necessary to generate more bullets and regain lost health. This is the main way to get more bullets and the shooting gameplay is also key. Stages require players to achieve goals such as destroying certain types of enemies and in certain quantities. As such, youll need to use lots of bullets along the way. The shooting, for the most part, isnt particularly engaging. This is because Poison Controls simple shooting feels slow. Yes, you do gain access to new bullets and even types of weapons along the way, but none of that changes the key mechanic not feeling awesome. Aiming with the Switch joystick doesnt feel as precise or even as speedy as aiming in more traditional shooters with controllers. Its a lot slower with no means to increase the speed, and as a result, its recommended to turn on aim assist to line up shots faster and easier. Some may choose not to, but theyll regret it once faster enemies start to make an appearance. Fortunately the aim assist option can be changed at any point so players can try one way before swapping to another.One thing that NIS captured well was the unique gameplay of needing to swap back and forth between shooting and collecting. When out of bullets, players must strategically place themselves and then deploy Poisonette. They must do so, however, while either carefully avoiding enemies or circling around one to cause damage while collecting the poison for bullets/health. Due to the limited nature of bullets, theres also a newfound focus on counting each bullet and trying not to waste shots. Its a cool concept that keeps players thinking about their surroundings rather than constantly spraying every which way. With more refinement, this could yield an improved sequel. Another intriguing aspect is how it manages leveling up player skills. It wouldve been easy enough to just have a level up screen and stats to choose from at the end of a stage. Instead, leveling up almost feels like a dating sim. Players chat with Poisonette and depending on the choices they make, theyre upgrading their stats. This adds a fun flavor into an otherwise simple mechanic. Fortunately, each dialogue option lists which stat it affects. If not for that, it would be a much more obtuse system to try and uncover the meaning of each dialogue option. As a result though players may end up giving answers they dont want to give simply to upgrade a specific skill.While the gameplay could use tuning up, there are elements of Poison Control that exude excellence. Those being the visual artistry and soundtrack. Take one look at the game and its hard to think of another game that looks like it. The menu art alone is stunning and the pink and purple-hued worlds stand out as both alien and appealing. The only downside to the art is that the levels themselves all look similar. The soundtrack is another high note as its funky, exciting and worth listening to outside of the game. Its excellent aspects like this that remind players that NIS has been in the video game development world a long time. Even when creating a new IP, they still put the effort into making something memorable. Closing Comments:A good, but not great, new IP, Poison Control skillfully harnesses NISs abilities to present a visually-striking, musically-engaging world with unique gameplay concepts. The biggest issue is the gameplay itself doesnt feel as polished as it should be. The third-person shooter gameplay is functional, but the execution leaves something to be desired. Even so, its enjoyable enough to make quick work of each stage and uncover the storylines behind each. The unique factor wears off after a while, but as long as you dont expect a Call of Duty-style shooter, youll be able to enjoy what Poison Control has to offer.", "date": "April 27, 2021", "grade": 3.5}