{"name": "MotoGP 21", "ref": "https://hardcoregamer.com/?post_type=post&p=402419", "text": "Two years ago, Milestone upped the ante with its MotoGP series by introducing a new Career Mode that was deep and started focusing more on the technical aspect of the motorsport. While the previous years release of the game brought even more technical realism with the implementation of tyre temperatures and wear, if left a lot on the table in terms of aspirations for the game. Thankfully, next-generation consoles have been released with specifically the PlayStation 5 and its DualSense controller in mind. Racing games will no doubt benefit from these controllers and their haptic feedback technology. In all honesty, MotoGP 21 is the first racing game to make the most of the DualSense, and in turn, result in the best MotoGP game in the series.MotoGP 21 goes all out in offering off the branches of this FIM racing league. Players have the choice of the teams, bikes and riders from MotoGP, Moto2, Moto3, MotoGP Rookies and MotoE. Everything will be here for the 2021 season and Milestone continues to include historic riders and bikes. There are over 40 historical options to choose from dating back to the two-stroke 500cc bikes in the 1990s. While it would still be nice to see a larger variety of even older bikes, it still offers a different feel and take on bikes from a different era. Its fascinating to jump on the older bikes and then jump back on to the new bikes to see the huge difference in technology. Three historic tracks that are included are Laguna Seca, Donington and Brno. I am a big fan of Laguna Seca, in general, and being able to experience this on a bike is fantastic. Players can expect 120 riders across 20 different circuits in MotoGP 21.The Career Mode was a game-changing decision a few years ago thanks to the depth that was offered. The core of this carries over for MotoGP 21, and with the updates to the mode, this is the deepest Career Mode in any racing game to date. Players have the option to join either MotoGP, Moto2 or Moto3. Starting off in MotoGP allows users to join an established team or mold a newly-sponsored team. As the Manager, players will choose a Personal Manager, Chief Engineer and Data Analyst. The Personal Manager will provide new contracts and sponsorship opportunities as you look to provide financial growth for the team. The more money you win, the better research and development you can do. Once again, the team will be armed with engineers and the opportunity to hire new ones, but balance of the budget is required. A few new aspects help propel the Career Mode forward. Outside of developing the bike based on engine, aerodynamics, frame, traction control, anti-wheelie and overall electronics, the Manager can now develop Junior Teams in the lower rankings. The team needs to become somewhat successful financially before setting up either a Moto2 or Moto3 team. The team can be upgraded to two riders and can have separate R&D implementation to build a farm team. The brand new teams can be fully edited if going this path in Career Mode for the MotoGP league. There are plenty of customization options that can also be shared and downloaded. These can be stickers, helmet liveries, bikes and more.The MotoGP series is honestly in a league of its own, although it feels like one of the F1 games in terms of how its presented. Milestone has literally invested in research for the A.I. in the game. The Neural A.I. known as A.N.N.A. uses telemetry to properly telegraph the pace of the riders on the track to help create more realism. While it hasnt been perfect since its inception, its continued to get better and has finally reached the point where it feels right. Riders seem to separate properly with a few different packs in between. The flow is right and isnt impossible to catch up to like other Milestone games. The A.I. will also wreck a decent amount or take each other out. The only issue with this is that rider and bike will just disappear off the track, and thats an issue with a new option that was implemented. The A.I. is the best the series has seen, but theres still an issue with the riders recognizing where human riders are.For the first time in any Milestone game, the option exists to have your rider chase after their bike after wrecking. The rider is literally on foot and will chase down the bike. Once at the bike, a cutscene is triggered where he picks up the bike and hops on. This is an excellent element, but unfortunately with the fact that the A.I. just disappears when it wrecks puts you at a disadvantage. MotoGP 21 also introduces the new Long Lap Penalty to coincide with the rule change in the sport. Both of these options can be turned off, and it may be better to have both the options for serious online play rather than racing against the A.I. As for the actual racing, thanks to the power of the PlayStation 5 and proper utilization of the DualSense controller, MotoGP 21 offers the best racing experience the series has seen, and even the best racing experience since the console has launched. Players have the option to go with the super simulation aspect with monitoring fuel and tyres and adjusting engine options to finish the race, or go with a more casual approach thats complete with auto-braking to help riders get a feel for the track. Milestone has added brake temperatures to further showcase the realism of the sport as optimal temperatures are needed for proper braking, much like optimal tyre temperature is required for the best grip. This is something that can be seen in the F1 games and is a big reason why fans of that series should give this a try. Wet racing also drastically changes the bike handling as it becomes much more difficult.As for the DualSense, the adaptive triggers completely change the game. Brake pressure is tied to the left trigger and can be either full of pressure or lacking pressure based on the brake temperature and speed of the bikes. Whats more impressive is the accelerator that is mapped to the right trigger. Managing the throttle is superbly improved thanks to the feedback pressure. What Milestone did that was completely right is the removal of the pressure when the rear wheel breaks loose. This means when you lose traction, you actually feel it. All of this helps to maintain the stability of the bike as well. The realism of riding these bikes is unheralded in MotoGP 21. Even bumping into other riders creates the proper response with the controller and feels natural. The racing makes you want to strive to be faster and more consistent rather than being overwhelming and unachievable.Outside of the Career Mode, MotoGP 21 remains bare in terms of modes. You can compete in a Championship, Grand Prix or Time Trial. Theres a new tutorial thats broken up into two parts to help new riders get acclimated with the game. Outside of multiplayer, this is all thats offered. There are no Challenge Modes or any other type of depth, but the Career Mode helps to make up for a lot of this. Multiplayer offers dedicated servers and the online experience was great with no connection issues, but individual races are the only option. No split-screen and no online championships once again leaves much to be desired. Playing on next-generation consoles will provide players with a dynamic 4K resolution as the game runs at 60 FPS. This is the way this game was meant to be played, much like the other recent Milestone titles. The visual design is getting close to the F1 games as the game looks and runs well. Lighting, reflections and little details help to up the visuals on next-generation consoles. Player faces and models are improved, but the bikes are the showcase as the colors pop. The reflections off of the player models while racing looks excellent and smaller aspects such as dirt build up on tyres adds to the realism. Wet races may stand out even more with puddles and more reflections seen on the track. The game sticks with the Unreal Engine and while it hasnt been rebuilt, it makes the most of what has been there.One aspect thats in need of an overhaul is the sound of the bikes. It has been sufficient enough for a few years and various bikes sound different, but they noticeably dont sound great in this version. 3D positional audio can be heard in the next -generation version as you will hear the other bikes on the circuit echo through the area. Its a nice touch that can be improved with more aspects, but the bike sounds need an overhaul in terms of the raw sound that comes from the actual real-life bikes. The original score in the game remains fantastic as it captures the essence of the sport. Closing Comments:Milestone always seems to put more of an effort into its MotoGP series than the others. MotoGP 21 continues to separate itself from the pack to the point that its standing alone in the racing genre. The deep Career Mode gets even deeper this year and continues to be the best one out there. Its not convoluted or difficult to navigate besides the fact that it still doesnt notify you if an engineer is working on something else before allocating them to a new R&D. What shines the most this year is the racing itself thanks largely in part to the DualSense. The haptic feedback completely changes how you race and gives more control of the bike. The Neural A.I., A.N.N.A., is also the best version that has been seen since its inception, but it still isnt perfect. To put a cherry on top, MotoGP 21 retails for only $49.99, including next-generation options. If youve ever been on the fence about dipping your toes into this series, this is the year to do it.", "date": "April 22, 2021", "grade": 4.5}