{"name": "Laytons Mystery Journey: Katrielle and the Millionaires Conspiracy (3DS)", "ref": "https://hardcoregamer.com/?post_type=post&p=278296", "text": "When it comes to puzzle titles, the Layton series has managed to stand out prominently with a mix of not just one style of puzzle, but a wide variety in the style one might see in a typical puzzle book. Fortunately it included even more with a full cast of characters and huge plots for players to follow along with. The latest entry  originally released in the summer for mobile devices  passes the hat to the next in the Layton line with Katrielle taking the reign of the mysteries that await. With a slightly different approach, Laytons Mysterious Journey: Katrielle and the Millionaires Conspiracy still brings a whole new slew of puzzles to be uncovered.As Laytons Mystery begins, it introduces the daughter of the famous detective himself, Katrielle. With her father missing and no way to find him, she decides to open her own detective agency and start fresh. As soon as she manages to get things underway for the day, she finds a mysterious talking dog requesting her help. After taking him in and discovering the dog has complete amnesia, Katrielle and her assistant (who can also understand the canine) decide to take on the case. Unfortunately for the dog, whom they name Sherl, they are quickly distracted by a more interesting case presented to her by an inspector in need of assistance. This begin Katrielles detective solving skills through a series of unique and unusual cases that begin presenting themselves one at a time.Katrielles mystery solving typically goes in two directions: talking to people and investigating the area around them which leads to solving puzzles. Investigating will slowly unlock clues that will lead to the truth of each case and will help Katrielle piece everything together. Puzzles are found hidden in the surrounding area and occasionally the villagers of London will present them for the crew to solve. Some of these can be simple riddles, others math challenges or most often logic puzzles requiring close attention to detail in order to solve. Each puzzle reward players with points known as picarats. While these dont do anything during a normal playthrough, once done players will be able to use those theyve collected to unlock bonus materials. Be careful during puzzles, though, as any time an incorrect answer is submitted the amount of picarats rewarded will decrease. Those stuck on a puzzle wont need to worry too much, as throughout the exploration will be hidden hint coins. These can be used to unlock, of course, hints for puzzles when stuck on something challenging.Aside from the main puzzles stumbled upon while progressing each case, there are also a handful of mini-games for players to challenge. These range from trying to figure out certain characters ideal meals based on clues, to navigating Sherl across a board by raising and lowering blocks. These make for a great break from the main story that gradually unlock as it continues. Eventually, after completing all the cases and beating every select challenge, extra puzzles will be unlocked in the bonuses section. These act as a way to further earn more picarats, while also getting to try out new puzzles or slightly varied versions of ones solved previously.Outside of puzzles and story, the new Layton detective office is in need of some change. Katrielle is able to completely redecorate her space with new furniture, wallpaper and even flooring. For ever five puzzles solved a ticket is rewarded, which can be exchanged for new furniture. While this is simply cosmetic, its nice to see these changes take place when the characters are talking in the main Layton agency and makes for an extra level of customization. Katrielle herself is even able to customize herself further with different outfits that can be bought with Fashion Farthings found during cases. There are a limited amount of outfits available right as the feature is unlocked, but each one also comes with a bonus puzzle players can solve at any time.One of the biggest draws of Layton titles has always been their stories. Previous entries typically had long drawn-out stories with small mysteries solved along the way that ultimately lead into one larger reveal. Laytons Mystery instead contains more bite-sized stories with each case covering one specific plot within itself. While these individual missions are fine it ends up feeling like there isnt anything in particular really driving the characters. The last few cases end up being the highlights, but those before it dont feel like theyre building up to them. Each case does do a great job of furthering the characters of London and making them likable, but areas and characters are frequently reused within each case it quickly manages to feel repetitive after visiting the same place for the third time.The visuals are as gorgeous as ever for a Layton title, with detailed backgrounds that are fun to examine. Occasional fully-animated 2D cutscenes make a nice break from the 3D models and add a lot of life to dramatic scenarios. The music manages to be strong and never feel repetitive even when the same tune chips in familiar areas. While its not a feature every 3DS owner uses, the title does lack 3D functionality likely due to the initial mobile release. Its a little disappointing as it added a nice bit of depth in previous entries, but isnt a huge factor when everything still manages to pop on its own.Closing Comments:While the story leaves a little to be desired, Laytons Mystery still makes for an enjoyable entry into the puzzling series. A likable cast of characters persists despite featuring an entirely new crew and the ending manages to hint at a continuation for the series branching off from this title with a plot to draw players in. Those new to the series can easily hop in without needing to have knowledge of the previous stories, but it does make some welcome nods to previous endeavors Layton has gone through. Any puzzle fan should dive right into this title when they get the chance and look forward to what Laytons Mystery Journey brings next.", "date": "November 6, 2017", "grade": 4.0}