{"name": "Root Film", "ref": "https://hardcoregamer.com/?post_type=post&p=401533", "text": "Visual Novels have always been a moderately popular form of play style to present a story in a very different way. The most two common genres within visual novels are romance stories, following characters who often have multiple options of characters to pursue, and the second being murder mysteries. Ace Attorney managed to make this mainstream with a mix of gameplay and fantastic storytelling, and now most recently, weve gotten Root Film tossing its hat into the ring as the brand new mysterious visual novel with murders on the horizon, so just how well does it get the job done?Root Film follows two different character paths throughout its story, starting with a director by the name of Yagumo and his assistant Magari. Yagumo is a popular filmmaker who focuses on mysteries, murders and occasionally the cult in fantastical fake documentaries. While thats his goal, of course, he and Magari quickly get swept up in actual murder cases. Unable to help themselves, they end up diving further into them in order to help solve these crimes in addition to getting some material for their shows. The second character is Riho, an up and coming actress with a love of puns, and her manager Manabe. Riho is an up-beat girl who just wants to help those close to her, which ends up also getting her wrapped up in mysterious deaths. While she may not be looking to use it to necessarily help her career, she cant say no to people in need and seeks out the truth. Fortunately, both Yagumo and Riho also have a helpful ability that makes them better than the average civilian at putting the pieces together.As with most of the genre, the meat of Root Film is dialogue and characters interacting in conversations. Outside of that, however, is the two main characters traveling and investigating once their task has been laid out. Traveling to different areas via a world map causes them to meet different people they can speak with or examine objects in the area to gather further information. Listening to the dialogue is important as its often key to figuring out where to go next, but fortunately the characters are usually good about expressing where they dont need to go as theres often quite a few choices. The dialogue among characters is charming and even when not necessarily going in the right direction can lead to some interesting or funny interactions, making it great to investigate every little thing to see what else theyll end up saying. After a while of speaking to other characters in relation to their case, either Yagumo or Riho will hear an important line of dialogue that sets them off which leads into the core gameplay of Root Film. Yagumo and Riho both have synesthesia, which for many people allows them to remember senses or other things much more clearly than other people. In their case, they can clearly remember key phrases or statements and make note of them for use later. Early on it may not be entirely clear, but towards the end of the case is where these phrases all come together. As a case progresses Riho or Yagumo will have gathered tons of information and slowly begin putting the pieces of the mystery theyve encountered together. Finally they will do all they have to interrogate people involved in the case in a Max Mind battle against the person theyve chosen, which begins a round of pulling out evidence in the recorded phrases against the person theyre speaking with. The correct phrase of multiple options must be chosen in order to help uncover the truth, but choosing the wrong one will cause them to get further from the correct answer. It usually doesnt take a lot to uncover the truth, but this fun mini game style interrogating puts the players memory to the forefront of remembering the case and what has happened in order to also piece everything together. Its hard to actually mess up for anyone paying close attention, but it does its job helping push the resolution forward in a unique manner.The art style is a wonderful 2D drawn one where, like many visual novels, the characters have a variety of poses and expressions used for certain situations. Characters are wonderfully detailed, and any time theres a special illustration of a detailed scene, it feels like a wonderful treat to see them in a new situation. The music might not be the most memorable, but it does have a nice fitting click with every atmosphere and helps set the mood rather it be ominous or light-hearted at a moments notice. The most important aspect, however, is the writing itself as thats truly what visual novels live or die by. Root Film has some of the most enjoyable character interactions both from the main and supporting cast. Yagumo and Magari are a wonder pair that bounce off each other brilliantly with their adorable schemes and ability to outsmart those around them. Riho and Manabe meanwhile share a more balanced back-and-fourth way of joking with one another despite their working relationship, but also manage to take things seriously when its necessary. The murders around them arent always the most in-depth, but offer a great platform for the characters to expand and build up to a bigger story happening in the background. Closing Comments: Murder mysteries are a wonderful genre of any medium that have near limitless potential and Root Film is a great entry that fans of other similar visual novels are likely to find enjoyment from. While it may not have a ton in the gameplay department due to focusing much more on the storytelling, it does its job well and the build up to uncovering the criminal in a fun who-done-it moment is worthwhile no matter the case at hand. Titles like these are hard to discuss due to the spoiler nature of murder mysteries, but anyone looking for a new mystery series thats a mix of wonderful comedy and serious murder drama should check out Root Film.", "date": "April 5, 2021", "grade": 4.0}