{"name": "Signalis", "ref": "https://hardcoregamer.com/?post_type=post&p=429203", "text": "The indie game scene has been home to several different revivals of various classic game genres over the years, with many folks loving their retro throwbacks. Not every trend that emerges from this scene tends to be a success, though. For example, take fifth-generation survival horror throwbacks. For every Murder House or Tormented Souls (the latter feeling more like sixth-gen in terms of presentation), there are several more games like Back in 1995, Vaccine, Daymare: 1998 and more that wind up as critical duds. But with Signalis, Humble Games and developers rose-engine have been gearing up to create an entry into this somewhat niche subgenre that could truly pay justice to the most retro of retro survival horror while bringing the fun and the scares. Does it succeed?In terms of scares, Signalis succeeds almost right off the bat. Not merely because of the ominous visions flashing on the screen that our main character seems to receive, or because of the hints of some sort of cosmic horror that seems to have been unleashed, or even because of the wrecked ruins of a mining operation with several screeching ghouls shambling around it. No, the games greatest scare comes from that most terrifying of classic survival horrors: a six-item inventory limit. Followed by something just as spooky: manual save points only found in specific safe rooms with item boxes to manage.In this writers opinion, fifth-generation survival horror throwbacks havent fully taken off yet for the same reason most fifth-generation throwbacks (with the exception of boomer shooters) fail to succeed: they tend to take a warts and all approach to things, which always seems to end up hampering the experience instead of adding to it. While later games in franchises such as Resident Evil have been more forgiving with such mechanics, games such as Signalis tend to stay trapped in 1996 for some reason. Admittedly, though, its not the manual saves that are much of an issue here, but rather the safe rooms, as the game has only about two of them per level/chapter, and thus only about two item boxes. That may not sound like much of of an issue at first, but given how, per the genre, Signalis is focused on exploration and puzzle solving, it all adds up over time. To be more specific, a limited inventory plus a limited amount of item boxes plus items like spare ammo and necessary modules taking up their own slots (even while equipped) equals loads and loads of backtracking, especially since at least half of your inventory will be used up almost all the time in order to prepare for anything. And backtracking itself isnt necessarily a huge sin, but it reached a point here where it just started to feel like padding (especially with several puzzles requiring you to assemble exactly six items in a single spot). Wandering down a hallway filled with enemies feels frightening the first time, but it quickly becomes annoying after repeated treks, which is one of the last things you want in a horror game.I know it seems insane to harp on something like that, but I want to make this clear: The shackles of this decades-old gameplay approach are the only things holding back Signalis from being a survival horror classic. In every other area, it succeeds. Even combat, which hands your character standing in place while aiming, is nice, fun and simple. Enemies are spread out just enough to be a threat while never being overwhelming, ammo is nicely spread out as well, and there are even several opportunities to stealth your way around the various monsters you come across, or at least run past them. Said monsters also have effectively creepy appearances and mannerisms to them, with some even being able to come back to life, even after youve stomped on their heads to try and make sure they stay down. One particular highlight is an enemy that pops up from seemingly any regular floor, and who happens to move fast, nicely adding to the paranoia factor. And all of them look impressive as well, being cloaked in darkness and bloodied while seemingly dripping with a mysterious goo, making things even more unsettling, boosted by a nice and spooky score. Its even more impressive given how perfectly all of this works with the low-poly aesthetics, perfectly capturing that fifth-generation feel while providing a unique top-down perspective that keeps everything at the right distance (which also helps with the aiming as well).Signalis also delivers in the puzzle department as well, with a lot of its best stuff having just the right level of difficulty. As mentioned above with the bits involving six different items to collect, repetition and backtracking hurt things, but there are simple yet brilliant bits, including several that require you to break out the cell phone camera (or the in-game camera module) in order to take notes, like figuring out the pattern to open an astrolabe lock or knowing where to properly place different phases of the moon. There are even puzzles built around the lead characters radio, both in having to find the right frequency and actually toggling it in order to play particular sounds out loud (which is even the key to defeating a particular enemy). Definitely well-designed stuff.Finally, the story also delivers when it comes to dispensing a rather impressive mystery, as well as plenty of suspenseful moments. You play as Elster, a Replika searching for someone they need to find in order to fulfill a promise. Why, exactly? Well, that becomes more apparent after a journey through a facility filled with hints of a disease, the remnants of a totalitarian regime (complete with Russian-style propaganda), the aforementioned creepy visions and messages, and even moments that seem to warp space and time. It might get confusing at times, and the whole game is on the relative short side, clocking in at eight hours (though there are hints of multiple endings), but overall, Signalis dystopian sci-fi horror tales always kept me hooked when it came to its twists. In the end, if you can get past a small inventory and the backtracking that comes with it, theres a dark world here worth exploring. Closing Comments:While Signalis wont be leading to a full-on fifth-gen survival horror renaissance, if only because some of the genres past sins still linger, it still delivers an enjoyable adventure that perfectly captures the feel of the classic era while also doubling down on more detailed cosmic horrors and twisted visuals, capped off with some sturdy combat and impressive puzzle design. Those in the mood for a quick yet quality-filled horror game should check out Signalis, as it delivers welcome sci-fi scares.", "date": "October 25, 2022", "grade": 4.0}