{"name": "Neptunia Virtual Stars", "ref": "https://hardcoregamer.com/?post_type=post&p=399797", "text": "The Neptunia series has gone from being a low-key action JRPG with tons of gaming history references contained within it to something more. Over the past decade, weve seen Neptune and her friends save worlds in action RPGs, tactical RPG, JRPGs, rhythm games, zombie-battlers and even musou-style adventures. Now, the Gameindustris finest group is out to save yet another world from destruction  but with the power of third-person shooting and a bit of teamwork. Mainly third-person shooting, though. Like a lot of it, in super-bright environments that serve to remind players of just how far the industry has come from the greys and browns that filled all kinds of shooting games over the last ten years.Now, Nep and the gang are all about saving V-Tubers  which stays in line with the series being contemporary with its nerd culture comedy thanks to the rise of virtual YouTuber personalities over the past two years. Players will switch between both the usual cast of CPUs that have been used for a decade now and the new group of V-Idols, resulting in a varied gameplay experience. One wouldnt normally expect the series to ever be great as a third-person shooter, but it works out surprisingly well. Its amazing to see how the cast always seems to wind up in a new kind of gameplay experience, and yet it all just seems to work because the characters themselves are so fun that theyll work in anything.Its a testament to Compile Heart that the series always winds up delivering a genuinely good experience at whatever genre is used for the given game. In some ways, Virtual Stars evokes a bit of Neptunia Shooter, where you had a side-scrolling shooter that itself was a massive changeover from some manner of RPG. The switch to a musou game was also big, but fit in nicely with the action-centric RPG style used, just with the stakes ramped up to an absurd degree. Here, players have both various shooting styles to enjoy, with traditional blaster-style weapons and a sniper rifle as well to mix things alongside the V-Tubers hack and slash methods. No matter which character youre in control of, you have to consider defense as well as offense to clear roomfuls of enemies to progress in dungeons. The CPUs long-time players know and love retain their quirky personality even when shooting foes, and that allows the main combat to be injected with a lot more comedy than most shooters. The shooting action is well-crafted, but could stand for improvement overall. While it does use a twin-stick approach for aiming and movement, it would be nice to have gyroscopic controls given that the DualShock 4 has one and its occasionally used. While it isnt a deal-breaker by any means, it would make for an easier time making micro-adjustments in your aiming with a gyroscope instead of a stick. You do have a lot of control over sensitivity with stick movement, which helps to minimize this issue as much as possible as do massive hitboxes for enemies, but it does result in the shooting controls not feeling as smooth as they could be.On the V-Tuber side of things, the cast basically acts as alternate-world equivalents of the main cast, making them easy to get used to. Both sets of characters have chemistry with one another, and those who prefer short-range combat will probably enjoy the V-Tubers more. Their dodging technique tends to send players rapidly away from a foe, or they can simply just run from an attack and hit the dodge command right into the enemy. The close-up hack and slack combat can get a little tougher when you have enemies all around you since they can overwhelm you and theres a tendency to just chip away at foes. The damage sponge aspect of enemies would be nice to adjust with a slider  or just a difficulty level option. As it is, even lowly enemies can feel like theyre taking way too long to take out.Being able to switch between the various characters is nice, and if you get tired of one, you can can just switch over to the other. Its kind of like play a latter-day Mega Man X game and choosing between either X or Zero. Both work fine, but it can be better to use certain characters depending on the circumstances youre in. The longer-range nature of the CPUs is better for those who prefer X, while the shorter-range V-Tubers are nice if you prefer Zero and want a more instantaneous response since theres no aiming needed. The V-Tuber side is a bit snappier and more responsive, while the CPUs require more thought and careful planning to aim and attack while also avoiding damage. Finishers help make combat seem more rewarding. Visually, Virtual Stars is the best-looking Neptunia game yet and makes use of far more modern-looking reflection affects for its brightly-colored environments. The character models themselves still look simplistic by modern-day standards, but it does work for the franchises premise of the cast being representative of many parts of gaming history. Their animations are smoother here than in most games, but there are still instances of things like larger weapons clipping through environmental pieces and wonky camera problems. It can be frustrating to spin the camera around only to have it get stuck on part of the environment. This will result in needless damage being taken and while its not likely to result in a death, it could and is more of an issue with the V-Tubers since players will be moving the camera around more with them. Using the CPUs, the shooting mechanics generally keep things simple with camera movement beyond zooming in with a sniper rifle.Virtual Stars features the same kind of bold and bombastic anime comedy-infused music and does a lot to keep the vibe cheery throughout. The OP song in particular is a lot of fun and does a lot to put you in a good mood when playing the game, while the slower songs fit the visual novel portions of the adventure and just let the player explore the story at their own pace. This is the first entry to not receive an English dub and that does hurt things because this franchise has become known for having fantastic dubs that nicely got across the characters. Its a shame to see the game released without a dub, and hopefully thats something that can be patched in later because it does feel like this entry is missing something as a result. Still, the Japanese voice cast does evoke the silly vibe nicely and the large subtitle text is fantastic to have by default instead of having to try to crank it up in settings to make it easier to read. Weapon sound effects are fine, but nothing extraordinary  everything sounds reasonably good, but nothing feels visceral just based off the sound effects when it comes to slicing and dicing foes up. Closing Comments:Neptunia Virtual Stars is a good game in the long-running series, but does fall short in terms of being a great gateway game. The shooting action is solid and the hack and slash combat is rewarding, but the camera does get in the way too often and the lack of an English dub will make this tougher to get into for newcomers. For longtime fans, its a completely different change of pace for the cast and feels like a nice shot in the arm from the norm. It also has a pleasing visual style and uses a far more modern graphical styles than one might expect from whats normally a low-tech series that isnt known for pushing visual boundaries. The soundtrack is a lot of fun and keeps you humming and tapping your toes to the songs.", "date": "February 28, 2021", "grade": 3.5}