{"name": "Gal Gun Returns", "ref": "https://hardcoregamer.com/?post_type=post&p=396930", "text": "Japan as a nation has a way of producing entertainment thats quite unique to Western audiences. As a movie, Helldriver just shouldnt exist. Their game shows are famous for their bizarre rules of competition. Some of their games veer off into a whole new realm of silliness, though. Its part of the charm, really, and why there are so many Japanophiles abound; its natural to be fascinated by the cultural divide. Obviously, this is where Inti Creates Gal Gun series comes in. To hear it described is to gaze into the maw of madness, albeit it one with pastel hearts instead of teeth.To be honest, the Gal Gun games are old hat at this point, even in the west. The sequel title, Gal Gun: Double Peace launched over here in 2016, while the confusingly-titled Gal Gun 2 hit in 2018. There has always been a hole in the mainline games, though, as the first one was never localized until now. That is to say, Gal Gun Returns is a remake of the original with most of the DLC included in the package. While its nice to finally have the entire series available in English, though, it must be said that this is the weakest entry in the series.The concept itself still manages to amuse. On the way to school, unassuming high school student Tenzou was meant to have a chance at love. A cupid in training, Patako, is meant to strike him with a single arrow of love which will help the young lad find a romantic partner. The angel is more than a little incompetent, though, and the boy is struck with sixteen arrows instead of the one. This has the benefit of making him irresistible to most of the fairer gender, but there is a drawback: it wont take long to wear off. Tenzou has until the end of the day to find his true love or hell never had a chance to do so again. It cant be that simple though, as Tenzou has specific standards. There are companions that he would be interested in wooing. The thing is that they have problems of their own and are immune to the heros ill-gotten charisma. He needs to make a real effort to win the affection of the girl of his dreams. This doesnt even consider the fact that the young man has a finite amount of willpower. Girls are throwing themselves at him. Should he fail to defend himself, he could succumb to the advances of a less-than-ideal mate instead of the true person in his heart. To defend himself, our hero has to spray his pheromone gun at the advancing hordes of adoring lasses, causing them to collapse in ecstasy so that he can pass. If things get too harried, Tenzou can also engage Doki Doki Mode, where he focuses on different parts of a young lady, such as her eyes or her endowments for the arts to cause them to figuratively explode in happiness, clearing the screen.Now, this is a stupid concept on the face of it. In practice, most of the game becomes a rail shooter as Tenzou mows down the screaming throngs of admirers with his pheromones like a classic lightgun title. An Operation Horndog, if you would (Slime Crisis? House of the Dead Sexy?) In the past, a game with such a silly presentation could slide by on the concept alone. In 2011, that would have been enough for this reviewer to have a laugh with the game, but the fact of the matter is that Gal Gun Returns runs into a huge hurdle: the sequels. I reviewed Gal Gun: Double Peace when it launched in the west, and very much enjoyed it for what it wanted to be. The writing was funny on its own and there was an element of a demonic adversary that built on the foundation introduced in this title. The girls there were tropey, but had much more personality to explore. It was just a more interesting game. What Gal Gun Returns shows us is that the original title hung its quirkiness on the core concept alone. The fact that the game exists is the entire joke. There might be a smattering of decent lines here and there, and some of the side missions specific to the object of affection that is receiving focus in the current run do add some variety, but this feels like a lesser title. The lasses are more one dimensional, the writing is just more flat, as opposed to the buoyancy that the sequels enjoyed. One girl likes to rock, and dreams of playing guitar. Another is rich and travels with a pair of bodyguards. This has all been seen before, and the writing doesnt add anything new to the tropes. Theres one exception of a rather tentacly scene, but thats the outlier.This is a shame, too. Graphically, its not too bad. All of the characters are classic high school anime, transposed to 3D models. Oftentimes, the move from 2D to 3D can hurt this art style, giving it a creepy look. Returns handles this with aplomb. The environments are sharp and do a good job of feeling like a hand-drawn cartoon in 3D. The controls, such as they are, are smooth and effortless. Moving the cursor around the screen feels accurate, making it a snap to pull off the one-hit kills (known as Ecstasy Shots). The speed of the cursor can be sped up or slowed down by using the left shoulder buttons, but it never felt necessary. Its tuned to the point that players can skip the Newbie setting without feeling overly challenged. The game design itself is fine for what it wants to be. Its just that its been done better. One other thing of note thats appreciated: the game does have a point to make about romance. Conversations with a potential romantic partner shouldnt just be about saying what the other person wants to hear. Neither is it about being a boor, dominating the conversation and only making it about one persons needs or desires. Its about paying attention to each other, being attentive to the other persons needs without losing the personality that has been built. Its good advice wrapped up in a game thats ridiculous on its face. Of course, the same point applies to this: the sequels do the same thing and do it better.Finally, it seems pertinent to address the concern around the concept of consent that this game raises. Having the ability to attract pretty much any mate through supernatural circumstances seems like it could be a problematic core to drape a game around. I would argue that the game manages to sidestep the issue with the gameplay itself. Tenzou can have almost any girl he wants during a brief period of time by nature of his accidentally overly-powerful magnetism. In practice, its better to woo a potential mate. Theres more satisfaction, more joy, in earning the trust and affection the person one desires. Closing Comments:Gal Gun Returns isnt a bad game. Had we not been spoiled with the better sequels, one could even argue that its quite good for what it sets out to do: embarrass the gamer if they play it in front of other people while having some decent, if simple, gameplay. Theres enjoyment to be had, but with the sequels easily available, this is a title that can only be recommended to completionists. Someone jumping in fresh to Gal Gun Returns would be better served jumping ahead to one of the more fully fleshed-out entries.", "date": "Bohn on February 8, 2021", "grade": 3.0}