{"name": "Sword of the Necromancer", "ref": "https://hardcoregamer.com/?post_type=post&p=396600", "text": "In the gaming medium as a whole, the indie developed rogue-like with retro graphics is something of a clich. More accurately, the genre as a whole has reached the point that even pointing out the clich is a clich in and of itself. The point is theres a metric crap ton of these things, more than one person can hope to experience. As such, a title using the genre and art style has to do something remarkable to even have a hope of standing out. This is where Grimorio of Games Sword of the Necromancer comes in. As a title, it faces an uphill battle to even be noticed. Fortunately, it has a good pitch: take the action of Secret of Mana, add a light dusting of The Legend of Zelda and give it a great story. It mostly pulls it off, but its not without flaws.The game puts players in the role of Tama, a brigand who was hired by the priestess Koko to act as a bodyguard. Over the course of their journey, catastrophe befell the pair and Koko has passed on. Learning of a place where a necromancer long ago discovered the secret to eternal life using the Sword of the Necromancer, Tama journeys to the dungeon in hopes of reviving her fallen friend. Quickly obtaining the titular sword, she learns that the artifact is not powerful enough on its own to save her friend and she must venture into the depths of the dungeon to finish the job.Its a simple story, but one thats well told. Vignettes detailing their budding friendship are unlocked whenever a player clears a dungeon floor for the first time. These scenes show how their partnership evolved from transactional into true friendship and budding romance. It comes across as believable, though arguments can be made that some common tropes worm their way into the tale. For example, Tama catching Koko bathing and trying to reconcile the emotions the scene stirs up. It doesnt take long to feel invested in the pair, though. They are likable and human, with behavioral quirks that resonate. The chemistry that develops, while slightly rushed, strikes one as genuine. Still, while the story is a major part of the game, it isnt the meat. As a rogue-like, Sword of the Necromancer does a few interesting things. Delving into the dungeon is a dangerous thing, but Tama gains experience during the process, growing stronger. Should she die in the dungeon, shell be shunted back to the beginning, with half of her accrued levels taken away. The items and weapons that she finds are also removed. Upgrade materials, however, are kept. The idea is to clear a dungeon and return back to the home camp to store them away. Alternatively, an Escape Rope can be found to get out while the gettings goods. When enough upgrade materials are earned, the items stored can be improved in preparation for a serious run. It isnt required that the dungeon be conquered this way, though. Buried in the Settings menu, which is unlocked after dying three times during a play session, are the options to maintain levels after death, keep the items and lower the difficulty. This flexibility is welcome, though even setting it to Easy doesnt equate to an automatic win.Combat is where the game shines. The player always has access to the Sword, but there are three other slots that can be filled with a variety of items. New weapons, shields and magic spells that share a pool of energy with the dash/dodge function all make appearances. One of the truly unique aspects lies in the necromancy, though. Any enemy, with the exception of the bosses, can be resurrected and added to an inventory slot for use later. In practice, this means that players can grab three enemy mobs, run into a new room and throw out some allies to distract and/or kill the foes, making some of the more difficult enemy arrangements trivial. When the room is cleared, they can then be picked up either directly or by running into another room. The allies that are picked up earn their own experience and level up, becoming stronger up to level five. By the same token, they can be fragile, so strategic use is needed. When factoring these options with the elemental system, the amount of options available quickly open up during a run. It may seem shallow at first glance, but the systems in play give the game real depth. What does hold the game back is variety. There are enough basic enemy types, with elemental differences interspersed in the same species, to keep the basic dungeon runs interesting enough. Each floor of the dungeon has the same boss, though. Some variety there would have gone a long way to keeping the player engaged. Couple that with the fact that each floor has the same tile set with minor color variations, and the game can begin to feel like a slog from run to run. The floor layouts differ, and the rooms comprising the each level do have some variety to them, but it all looks the same, feels the same and the levels end the same. For a game that is designed around repeated attempts, this can get tiresome. True, the same complaint can be leveled at any classic title, but the design here is intended for near infinite replayability, which the game cannot deliver. The comparison title being used here is The Binding of Isaac, a game where the player doesnt know what boss will be found with a more intrinsic artistic variety between floors.On the other side of that same coin, what is included is well designed. Every level, room and boss can be defeated with a level one character sporting only the default weapon so long as the player is careful with stick and move tactics. Theres no series of bad drops that makes a run hopeless; every item found can only make the challenge easier as opposed to relying on found equipment to make the game possible. The reduced variety can also be said to allow the player to make use of the wide range of options by encouraging experimentation. Failures I experienced (after getting used to the systems in play) came about because I was foolish. I would get too greedy with attacking when a dodge would have been smarter or maybe misread a timing window. These screw ups, though, came with the feeling of distaste for having to push through the same levels again to get back to where I was, both in power and in simple catching back up to the point of where I lost. Its a testament to the game itself that this feeling can be pushed aside as the gameplay itself remained engaging, even if the repetition did not. Closing Comments:While complaints can be leveled at Sword of the Necromancer based on repetition, that doesnt mean that its bad. In fact, its enjoyable and recommended. Sure, Supergiant Games Hades devours this titles lunch in that its a superior action rogue-like with great story. Barring that, Grimorio of Games built a fun and interesting dungeon crawler thats deeper than it appears at first glance. The tale behind the stabbing is interesting and heartfelt, drawing the player further into the depths of the dungeon, while the action is exciting. An expansion to add more level and boss variety would go a long way to making this required playing, but anyone interested in this type of game should give this Sword of the Necromancer a swing.", "date": "Bohn on February 2, 2021", "grade": 4.0}