{"name": "Ys IX: Monstrum Nox", "ref": "https://hardcoregamer.com/?post_type=post&p=396292", "text": "Adol Christin and Dogi have had quite a few adventures over the years. While never becoming a household name in the States, Ys has always enjoyed a following which has seemed to be growing in the past decade as shown by the favorable reception of Ys VIII: Lacrimosa of Dana. Their latest adventure has been out in Japan since 2019. This newest entry introduces new gameplay elements that have intrigued us since we started following its development, and now the wait is finally over as Ys IX: Monstrum Nox is available for western gamers.The story begins with Adol and Dogi arriving at the prison city of Balduq. As is the case with everywhere these two go they approach the new city in an unassuming manner and then something out of the ordinary happens and their adventure spirals into some completely new and unforeseen direction. This time Adol has a warrant for his arrest and hes promptly taken into custody in Balduq prison, which isnt the first time Adol has visited a new area and been in trouble with the locals for reasons he cant fathom. Adol takes the most logical course of action, which is to escape, but doing so leads him to a woman named Aprilis, who inflicts the Monstrum curse upon him, drastically changing his appearance while granting him powers. But as these powers come from a curse, Monstrums are imprisoned in the city of Balduq due to a barrier around town that doesnt seem to affect regular people.Once free the prison, Adol enters an emo phase where he dyes his hair black and wears it just long enough to slightly obscure his eyes. He and Dogi find a hideout that will serve as a base of operations throughout the game. As the story progresses and the player takes on side quests, the amount of people and services at the hideout will increase. The city of Balduq is of a considerable size, so having a centrally-located place to do all the equipment upgrades and shopping is a good quality of life convenience. The overall gameplay of Ys IX: Monstrum Nox is what fans of recent Ys titles would expect, save for one key difference. The action RPG has the characters switching control between three active party members (eventually) who each have their own set of special moves and one of three different damage types. The in-game tutorials due a good job of teaching players the ins and outs of combat and exploration. The key difference is that Ys IX: Monstrum Nox plays like a typical Ys game except it has been injected with some Saints Row IV DNA where each character has their own Monstrum gift that grants them a super power. One nice thing about the gifts is once a character joins the party they do not have to be an active party member for their gift to be utilized, so the player is free to pick their three characters to play and maintain access to all the gifts.In addition to Adol there are five other Monstrums. Adol, renamed the Crimson King, is gifted with Crimson Line that allows him to quickly travel to inaccessible places. White Cats gift is Heavens Run, which grants the ability to run vertically up walls. Hawk (whos a bit of a jerk) has the gift of Hunters Descent which allows the characters to sprout wings and glide into place. Doll has the gift of Third Eye that allows players to see treasure chests and other secrets. Raging Bull has the gift of Valkyrie Hammer that allows for charged-up powerful attacks and can knock down certain walls (typically something only Dogi can do). Lastly, Renegade has the gift of Shadow Dive, allowing the Monstrums to move underground in passages normally too low to access. Having an assortment of characters that essentially have super powers is unusual for Ys, but the inclusion of these make playing Ys IX: Monstrum Nox incredibly fun. The story progression of Ys IX: Monstrum Nox is divided into chapters. These chapters do follow a formulaic pattern, which in itself feels repetitive, but theres enough variety in the particular quests where it doesnt get too monotonous. Each chapter has a main objective, but before that can be accomplished the Grimwald Nox needs to be completed to break down a section of a barrier. For that to happen the player needs to get 100 Nox points, which can be done by defeating Lemures that appear from miasma pillars that serve as portals into the Grimwald Nox and by completing bulletin board quests. The bulletin board quests are worth doing. Not only do they offer a lot of Nox points for completing them, but also they flesh out the story and can recruit new characters to the hideout. But the format for each chapter is take a quest related to the prison, do a couple other quests for random people in Balduq, clear the large miasma clusters in town to break down part of the barrier, and learn about some main plot point which leads to a new Monstrum joining Adol.The Grimwald Nox is bit of a tower defense mini game, not too dissimilar from the beach raids in Ys VIII: Lacrimosa of Dana. Aprilis brings all of the Monstrums into the world that the lemures call home. Adol and company are tasked with protecting a Sphene from being destroyed or with destroying all the Lacrimae while fighting off hordes of lemures. These skirmishes can be replayed to get the coveted S rank and associated prizes. Materials can be spent to make these events easier, such as by strengthening the Sphene or adding traps and decoys to the battle field. The people who Adol befriends during his adventures also help out in these battles, so thats a another reason to collect as many friends as possible. While Balduq is a large city, its appropriate that its called the Prison City because thats how the player feels for a good portion of the game. Small portions of Balduq are unlocked in each chapter because of the barrier mechanic, making exploring the entire city a gradual process. Adol also doesnt get to venture out of the city until several chapters in, so even though the land mass between the city, prison and surrounding areas is large, it feels smaller and more claustrophobic than other Ys games. Throughout Balduq there are gates that can let Lemures out. This allows for players to get battle action in during the lengthy parts of each chapter where the player is confined to exploring Balduq, but they are somewhat jarring in their existence. Non-Monstrums cant see Lemures or these gateways, so when the player activates these a quick battle will happen in town where the music shifts from something tranquil to a piece much more appropriate for fighting. Ten seconds later the lemures are defeated and things return to normal and the civilians are none the wiser. In addition to killing monsters, collectible hunters have plenty to look for between landmarks, graffiti and azure petals.The economy of Ys IX: Monstrum Nox is based on money and other tradeable resources. Money for purchasing items and equipment is easy to find, but upgrading them requires specific components, as does upgrading the Sphene and other objects for Grimwald Nox battles. The game assists the player with this a little by allowing the option to trade common items for more useful ones, like ten copper ores equal one iron ore and ten iron ores equal one crimson spar, but gathering enough components to construct the best of everything for everyone can be difficult. There are unique and useful items can be missed, but fortunately items the player misses can sometimes find their way into black market vendors. Ys games follow the exploits of Adol (except for Ys Origin), but despite that each story is self contained enough where players can jump in at just about any entry and not feel lost. Ys IX: Monstrum Nox is no exception, but there are reasons why it may not be the best game to be an introduction to the series. For one there are several nods to previous games and inside jokes. Nothing that would detract from the overall experience too much by missing, but references that long-time fans would enjoy seeing. Another reason is Ys games are consistently good, but after getting used to the Monstrum powers, it may be hard to adapt to games where Adol and his companions are mere mortals. There are also bonus items that are helpful in the beginning of the game if theres save data from Ys VIII: Lacrimosa of Dana or Ys: Memories of Celceta.The graphic style of Ys IX: Monstrum Nox is the same anime-inspired style thats been part of the series since the beginning. The technical quality of the graphics is adequate, nothing that will be considered impressive for the hardware, but meets expectations for PlayStation 4 with graphical errors rarely occurring. Ys traditionally has a good soundtrack and Monstrum Nox does not disappoint in this area. The physical Pact Edition comes with a soundtrack sampler, and based on the musics quality, that version would be recommended over the digital version. As chaotic as some of the battles can look, the controls are responsive and precise for the most part. Some gifts like Heavens Run arent always as precise in execution as other aspects, but overall the added mechanic of Monstrum gifts makes this one of the most fun Ys games to play. Closing Comments:Ys IX: Monstrum Nox is a continuation of what fans have come to expect from the series and the Monstrum gifts add a new and fun gameplay mechanic. In some ways the Monstrum gifts make this the most fun Ys game to play even though there are other arguments against it being the best one. The game isnt perfect; some of the story exposition in each chapter feels unnecessarily long, and while the missions are varied enough to keep things from being too repetitive, the formulaic approach does make progression feel predictable. Closing off the Grimwald Nox in each chapter is fun, but after doing it few times it begins to feel routine. The story is one of the more interesting and also stranger ones in Ys with unexpected twists that should keep players scratching their heads for a few chapters. Overall, Ys IX: Monstrum Nox is a must play for Ys fans and worthwhile for action RPG fans in general.", "date": "January 29, 2021", "grade": 4.0}