{"name": "Redout: Space Assault", "ref": "https://hardcoregamer.com/?post_type=post&p=395904", "text": "While no points were earned for originality, developer 34BigThings was onto something with 2016s Redout. At first blush, it was a garden variety futuristic racer with nothing new to offer the genre, but it ended up as a solid genre entry during a time where the genre itself wasnt seeing much love. That, coupled with the fact that it was an excellent piece of VR software with a superlative sense of speed, and one can be forgiven to see what else the studio produces. Time passed and the developers followed up with Redout: Space Assault. If this looks familiar, the game did launch (unknowingly, to this reviewer) on Apple Arcade and is only now branching out to other platforms. Still, a Starfox-inspired space shooter is, once again, an ignored genre. It seemed likely that 34BigThings will satiate a retro thirst with a modern twist. In practice, though, Space Assault doesnt reach the same heights as its forbearer.In this title, theres a bit of a plot. Taking place before the original Redout, players take the role of Leon Barrett, combat pilot extraordinaire. Working with Poseidon Corp, his job is to help facilitate the transfer of civilians to create building space in the lead up to a massive project to colonize Mars. Protecting company interests from pirates and rebelsits already obvious where this story is going, isnt it? To be sure, there are zero surprises in store for the tale. Of course Leon joins the rebellion after witnessing a war crime and realizing hes complicit. Of course hell cobble together a rag tag group in order to fight the true enemy. This was meant to build on the prior game to establish a Redout universe, but there isnt a tale worth telling here. Normally, a criticism would be leveled at the voice acting, but they actors werent given much to use. It just wasnt possible to salvage the tale.Thats okay, though. The great Starfox titles didnt need a strong plot, either. Its not the end of the world, so long as the action is decent. There, Redout: Space Assault fares better. Taking place entirely in space, usually in debris laden fields of ships, space stations and asteroids, the game has some fantastic on-rails sections. The early stages start off slow and manageable, building a complexity of chaos to a crescendo in the final stages. Dodging rapid and overwhelming patterns of red and purple bullets, along with the obligatory barrel rolls to shake off missile locks makes for a good time. While the weapons never pack the punch that one would hope, they do the job for thinning the stream of baddies that need to be shot down. The dogfighting does show some telltale signs of the titles mobile origins, though. The guns themselves automatically fire when in range and on target, with the missile locks and ship control being relegated to the the player. Theres an option to turn this off, but it didnt seem to work as intended. Another staff member picked this title up for the Switch and reported the same issue. While its likely this oversight will be fixed posthaste, the game doesnt actually suffer for this. It allows the developers to throw more stuff on screen while preventing the feeling that the player isnt stemming the tide in any way. So, throwing on a mix of weapons to plan for a variety of ranges and not having to worry about works in the games favor. Hopefully, the option will be fixed to allow for a more tactile experience.It should be said, though, that the best parts of the game are the on rail sections. When the game tries to branch out into other territory, things become dire. There are exploratory sections where the player hunts around the map for coins to pay for upgrades, blueprints to check off optional side missions and signals to move the story along. In brief snippets, these parts arent too bad, but the signal hunting can get annoying. These tend to break down to playing Hot or Cold where the player meanders around the map looking for the beacon. In one particular mission, this leads to searching an area for too long, listening to the beep, and getting insta-killed for wandering outside of the Mission Area. Thats in scare quotes as there only way to know I was outside of the area was text on screen and an exploding ship a few seconds later while trying to veer back into the right space. Eventually, the beacon was found tucked away in the center of an asteroid via an opening that could only be seen through pure luck. Then there are the racing missions. It does make sense to include a few of these considering the pedigree of the series. In practice, not one of these jaunts provide anything in the way of entertainment at all. They are more something to be endured. Focusing on rote memorization, these sections feel more like a level in Superman 64 in that the player needs to fly through all of the rings or fail. Theres surprising lack of any sense of speed or strategy. Just hit the rings and dont bump into anything. What should have been a highlight of the title manages to be the worst part.At least the game is reasonable pretty. While the range of maps seem paltry or repetitive, they are well designed. The paths that the rails levels take the player through tend to feel unique. There are decent color choices, and the flash of explosions in the midst of the chaos found in the rail levels does look good, especially considering the titles origins. It should be noted that the frame rate started chugging on a mission that required the player to fly into a base and destroy four generators. This was playing using backwards compatibility on a PlayStation 5, so it could be attributed to the differing hardware. Still, it was odd. Closing Comments:In no way, shape or form could Redout: Space Assault be considered required playing. Its simplistic and more than a little disappointing for what the developer can actually produce. That doesnt mean its without any merit, though. Folks looking for a new Starfox type game will find plenty to enjoy here so long as they know that there are some lumps in the gravy. When its hitting its mark, this is an extremely exciting game. When it stumbles, though, it stumbles hard. For the budget price, there are worse ways to spend an afternoon, but there isnt anything here to justify more than that one afternoon.", "date": "Bohn on January 25, 2021", "grade": 2.5}