{"name": "Morkredd", "ref": "https://hardcoregamer.com/?post_type=post&p=395736", "text": "Frustration, not least in puzzle games, can be just as much the drive a player needs to succeed as it can be that which finally ceases any and all continued effort to carry on. Frustration with finding the solution is one thing, but its an entirely different matter when the frustration of maintaining that eventually-claimed solution is just as challenging as anything that preceded it. Odd as that may be to describe, its precisely the kind of scenario Morkredd cleverly conjures on a number of occasions. This, despite its brief [on average] five-hour run-time. Its premise being that of a co-operative, two-character puzzle game set in, for all intents and purposes, a bleak if vague setting where darkness is all-but-absolute and light sources are the key mechanic underpinning the puzzle-solving.On the surface, you might quickly assume that Morkredd doesnt have much going for it outside of its concept with dynamics, its setting and its eventual up-for-debate ending. An ending which, for anyone having played either of Playdeads two iconic entries, will be familiar of how strange and a touch unsettling these kinds of climaxes can get. But credit to developer Hyper Games here; yes theres a reliance on physics-based puzzle-solving, just as there is this ever-present air of something more disturbing awaiting its grand-if-still-indecipherable reveal. Granted, the developers need to provide more suggestion to its world does at points get in the way of simply controlling the trustee sphere of light youre predominantly both guiding and relying on over the course of the game. Morkredd may seem unoriginal, a touch too familiar and reliant with whats come before. But while its shorter run-time in a way works against the mystery and the implications its many discoverable murals hint at, the same cant be said for the area which matters most: its puzzles.Morkredd predominantly runs along the basis that dark is nothing but deadly to your two characters, of which (in single-player mode) youre required to control at the same time. The main mechanic of the game requiring you to roll a large sphere of light to required points so as to unlock gates, expand platforms to walk across and at times, and simply keep up with where the physics dictate said spheres movement. Though its a simple case of keeping to the illuminated safe-zones  keeping out of the dark, making sure that the required paths and space are completely devoid of any darkness whatsoever  the trick, thus the surprising little detail in the delivery, is the way in which players must, in a way, rewire their usual line of thinking. For one, each of your two characters also cast shadows, meaning that either ones shadow can instantly kill the other if they should so happen to walk into it. When you add that to the equation, the actual method of solving puzzles in Morkredd becomes more trickier than initially presented.Its one thing to place your light sources in the exact correct spot so that a platform is fully lit or a switch is within visible reach. Unfortunately its not as simple as that; given the fact your characters shadows move just as you do  and alter in shape depending on how close or far you are to a given light source  the simple act of moving both figures, will perhaps be the bigger perpetrator of many players easy-to-avoid deaths. An added complexity that, as alluded to, can become evermore anxious as you stumble upon a puzzle solution, only to realize that part of the trick is simply getting both your characters back to the starting point without inadvertently killing them. This is something Morkredd in a way takes great pleasure in trying to trip its players up on, yet manages to gets away with it with just how deceptive some of these scenarios can end up being. A simple requirement of building a bridge is no longer just a matter of picking which character to do the seconds-long, laborious act.At times, its a delicate, second-guessing on where shadows will be cast and where the other character not only needs to be, but has to be just to avoid death. Its so easy to act on instinct with these kinds of scenarios yet despite how stressful they can be  not least when a sphere of light is out of your control or running away from you (requiring you to keep up with its momentum)  theres enough hidden intricacies with the ways shadows are cast and light sources can be manipulated to make this added requirement feel anything but annoying. Its a risky move, but Morkredd just about manages to lift what would be a basic puzzle set-pieces from out such similarity. Landing just about on the right side of the boundary between needlessly frustrating and satisfyingly frustrating by contrast. Better yet, even when the game introduces new elements and at one point removes entirely the need to guide a giant sphere around, the rules and solutions are simple enough to grasp that players paying close attention to the surroundings will be able to figure out the required trick relatively quickly.That said, Morkredd recognizes the need for respite and for breaking up what might be considered the more complex or delicately-poised of puzzles, with some easier strolls or segments that, more likely, feel like carefully-disguised transition periods from one sequence of puzzles to the next. And given how much emphasis is placed on the gradual transition between puzzles  on continuing to guide your companion sphere between checkpoints  the presence of some blatant loading screens, to which your players will simply warp back into place, is a touch disappointing to see. Not least because for a world predominantly shrouded in dark and of how little environmental detail there is to go on, Morkredd is sufficient enough with its mystery and of the reasoning behind why the locales are changing so.As noted though, Morkredd doesnt capitalize on its distinct puzzles-solving when it comes to actually providing meaning to its world beyond the fleeting murals. And more pressingly, the suggestions its drawn-back camera angles want to profess to its players, which most times comes at the cost of still trying to keep both your player-characters from dying. As such, Hyper Games attempt to impress and evoke with its world doesnt hold the same appeal or effect as its gameplay does. Not least during the final hour or so when surroundings shift dramatically in terms of aesthetic and its closing segment sadly feels more like one of those interactive chase sequences youd find in some higher-budget AAA game, rather than an otherwise fundamentally-varied take on its previous mechanics. Theres an attempt to shake things up, but its late placement in the game as well as a cumbersome control scheme means the impact it perhaps should have isnt as meaningful. Closing Comments:Not the first game to focus so literally on the contrast between light and dark, Morkredd isnt brimming with aesthetic originality, but its puzzles make up for in plentiful amount. Its the surprisingly deceptive nature of its puzzle-solving  and the many hidden dangers its rendition of darkness brings  where Morkredds best moments are to be found. Puzzles that somewhat rely on a preconceived assumption of movement so as to trip you over, yet more importantly are designed in such a way to encourage you to think carefully about your next move. Slow and steady is the general order of play here. Its world may seem too insistent on its own implied sense of shock and surprise, not least when it tries to be climactic for climactics sake. But despite the lack of any real meaningful exposition with its narrative or its world-building, the true revelation lies with how Morkredd makes each step forward into the dark an anxious yet entertaining one to consider.", "date": "January 21, 2021", "grade": 3.5}