{"name": "Hitman 3", "ref": "https://hardcoregamer.com/?post_type=post&p=395661", "text": "It has been over two decades since IO Interactive introduced us to the genetically-enhanced Agent 47 and his rather engaging adventure around the world. Over the course of seven games, we were given assassination targets in what would seem like impossible scenarios, heavily-guarded individuals with little means of actually accomplishing said objective. It was up to our creative thinking and the tools the developers laid out in each open area that we were able to make the impossible possible. With the third chapter in Agent 47s newfound adventures, we put to bed the story that has been going on since the reboot of the series five years ago, continuing to showcase beautiful vistas and tracking down ICA-related individuals who have had a hand in making your world a dangerous and less than appealing place. While there are certain elements that have been improved upon, Hitman 3 looks to be a marginally-improved sequel, playing about the same with only a couple of surprises. Is this enough to quench fans thirst or is the conclusion not as monumental as we had hoped for?Mechanically, Hitman 3 plays similar to how the series has always played in the past. Youll be maneuvering through various environments, climbing and shuffling along edges, and of course taking out innocent individuals (be it through lethal or non-lethal means) in order to strip them of their clothes. Youre a chameleon and your goal is to blend into the background whilst getting close to your target. Blending into crowds has become less important than ever before, with only a mission or two where theres even a small amount of focus. What has been added is a camera, which is a handy device that can help hack certain terminals and gather intel spread through the map. There are also shortcuts that you can unlock that will continue throughout play sessions, which proves a handy inclusion. And thats about it. There are your typical items youll find around the world, such as wrenches and screwdrivers, with a couple more unique weapons dependent on the level. All in all, though, not a whole lot has changed, for better or worse. Its still incredibly fun to play and interact with the various scenarios put in front of you. The story has taken a somewhat larger role this time around, but possibly to a hindrance. IO Interactive has been pitching Hitman 3 to have a more story-centric emphasis, and while thats somewhat true, it has been done so in a ham-fisted way. Whats best about Agent 47s adventures are not the looming ICA corruption thats going on in the background, but the smaller world elements that are developed upon little by little. Its like the film series John Wick. Every movie slightly expands upon the universe while not throwing too much at the viewer; we know theres a massive hidden world out there, but we dont need to be weighed down with explanations because that shouldnt be the focus. With Hitman 3, it quickly explores that world all while trying to have emotional and convincing scenarios told between missions, but fails on all fronts. It moves too quickly where you dont actually get to know anyone or care about whats going on. Normally you wouldnt expect it to affect it too much, but there are two missions that it affects greatly, with the last of the six becoming a disappointment. This is just a revenge plot with all the tropes and predictable outcomes youve come to expect.Fortunately, one aspect of Hitman that hasnt changed is the missions. The world of Hitman 3 is massive, with Agent 47 flying to all corners of the globe. Youll be able to see the neon lit streets of Chongqing, China to the gorgeous villa in Mendoza, Argentina. This is without doubt the high point in 3, as while there are issues regarding the missions themselves, the open environments the developers were able to create are breathtaking and add a phenomenal amount of variety. With that said, as mentioned before, the story somewhat gets in the way with the final mission, and thats because it simply takes place on a speeding train (Uncharted 2-style) where its a linear slog thats not at all fun to play. Where the other five missions had at least a lot of creativity and variety for you to experiment with, this had none of that. It was sorely dedicated to the story of Agent 47 and the ICA that it affected it in such a negative manner. You cant fault IO Interactive too much for following through with a conclusion to a story, but it ends up being the worst mission in the trilogy by a wide margin. In addition, one of the more disappointing aspects of Hitman 3 are the Mission Stories. In the past two games, there have been a bevy of creative stories in which players can take on, but in Hitman 3 these have been greatly limited. There are still smaller side activities you can find around the world without initiating a lengthy storyline, but considering there used to be up to seven Mission Stories per mission, the reduction down to three is a huge blow. Thats not even counting two of the six main missions which dont have any. With that said, there are still a ton of challenges per mission and some of the stories are lengthy, from playing a detective and uncovering a whodunit murder mystery to disguising yourself as a facility inspector who is taken on a lengthy tour. There was even a story where you basically had an assistant helping you with a kill, which is a refreshing change of pace that I would have loved to see more of. Theres a lot of encouragement in finding creative methods of taking out your targets, especially considering theres so many small details and interactions within the world, but still, I would have loved to have seen more of these Mission Stories as they were highlights of past games.Visually, Hitman 3 is a treat to the eyes. Playing on a next-generation system or a beefy PC, you will see the most aesthetically pleasing Hitman game to date. The environments are glistening with impressive lightning and reflection techniques on the various materials. It helps that each mission showcases different elements, from the clean tower above the clouds in Dubai to the neon reflecting off of the pools of water in the backstreets of China. Oddly enough, though, IO Interactive has made Agent 47 look even younger, giving him smoother features, but this is a small complaint as the crowd dynamics and environmental design sets the game apart from other action titles. Unfortunately, the CG cutscenes between missions arent good. I complained that the still in-game cutscenes of Hitman 2 were a step down, but somehow IO Interactive was able to one up themselves by creating cutscenes that look significantly worse than the in-game visuals and look like theyre hand animated. Considering the developers were looking to focus more on plot, this only hinders that advancement. Closing Comments:In the current trilogy, Hitman 3 would be considered the weaker of the three. The Hitman games have always been entertaining and well crafted, and the third entry is no different. There are grand moments that will leave you enthralled, from the Knives Out-esque murder mystery to skydiving to one of the tallest buildings in Dubai. The environments are also a highlight as theyre not only a visual treat, but contain an incredible amount of detail that encourage creativity from the player. Unfortunately, there are hang ups that drag the experience down. The focus on the rushed story has taken a toll on at least two missions, while the CG cutscenes are awkwardly done. The decrease of Mission Stories down to between zero and three is a huge blow as they used to offer some of most entertaining ways in getting close to your target. The whole point of the Hitman games is replaying missions over and over again, but after completing one a couple of times, I felt like I experienced everything it had to offer, which isnt something I had a problem with in the past. There are standout moments, but Hitman 3 just doesnt have the same charm it did in the last two games, and the limitations only contribute to this. Its more Hitman, but at the same time less of Hitman.", "date": "January 19, 2021", "grade": 3.5}