{"name": "Deliver Us Mars", "ref": "https://hardcoregamer.com/?post_type=post&p=436962", "text": "Back in 2018, developer KeokeN Interactive released a thoughtful and emotional title about humanitys attempt at survival in light of a dying Earth. After depleting most natural resources, humanity searched for answers off-planet. Trips to the Moon revealed a new source of energy in the form of a rare isotope that could be transmitted to Earth. This would patch the hole in the sinking ship for awhile, but the Earth was still dying. In Deliver Us the Moon, players take on the role of a lone astronaut who sacrifices himself for the sake of rebooting lost power on the Moon  without doing so, humanity would die. Not only do you fix power to save Earth, you also uncover a treasonous plot by colonists to evacuate the Moon station, leaving it unmanned so they can abandon Earth and search for a new home. This was a divisive issue, as it would mean leaving the Earth without power. During our gameplay, you learn of a successful coup that did leave. Its a title that explores delicate themes about life and death with a great premise. A major area that does fall short in Deliver Us the Moon is its abrupt ending, with no clear resolution. Now the title is back with Deliver Us Mars, a sequel that does fill many of its predecessors plot holes. Featuring a new cast of characters, Deliver Us Mars expands the universes lore and returns with a gripping story. While this sequel does a fantastic job with its storytelling, it unfortunately falls short in almost every other way. The title faces challenges from its clunky game design to its unfortunate texture choices. Its difficult to appreciate the dev teams hard work when there are so many misdirections in the overall product.Ten years after the events of Deliver Us the Moon, players take on the role of a former colonists daughter: Kathy Johanson. Yet Kathys father is not just any moon colonist, hes one of the lead engineers for so much of the technology used to power Earth. He also ends up being one of the main conspirators in the colonists plot to abandon Earth in the first game. Kathy and her father are separated during the coup and he leaves without her. Left behind with her older sister, whom had attempted to stop their father, Kathy is taken under the World Space Organizations (WSO) guardianship. Now an adult and capable engineer, Kathy suddenly finds herself enlisted for a mission to seek out the origins of distress calls from the ARKs  the very ships used by colonists to escape the Moon. Since the day they were separated, Kathy never stopped thinking about her father and hoping that one day theyd be reunited. The title does an amazing job of setting the tone and premise for the story. We can feel Kathys joy, but also her trepidation since bringing up her father in any conversation tends to sour the mood. Making her the daughter of a traitor creates incredible relationship dynamics and opportunity for character development. She now works side-by-side with her older sister, whom was chosen to lead the reconnaissance operation into space. They have a rather strained relationship because of their differing opinions of their father, but interactions between characters feels genuine. The themes of family and sacrifice are effortlessly woven into the story. Coupled with beautiful visuals of space, Deliver Us Mars knows how to set the stage for deep narrative.Yet even with such strong narrative, the titles inability to support its own story with full optimization is a shame. It becomes one of those moments where a subject looks beautiful from far away, but radiates flaws as you take a closer look. A main offense thats difficult to ignore is the choice in visuals and textures for human character models. Deliver Us Mars showed incredible ambition in delivering a robust experience. In the previous game, we played as a helmeted astronaut and never saw his face. Models of other humans were usually shown as silhouettes through hologram. Now weve returned with a cast of various characters and they all have fleshed-out models. Their construction is unfortunate and something to expect of software from a couple of generations ago, but not now. There are so many clipping issues with models hair and clothes. Certain textures and lighting choices throughout the game also dont help the aesthetic. It really is unfortunate when the title does an amazing job at landscape modeling and construction, but the actual humans are nowhere near as beautiful. One could only hope that gameplay could be a good distraction.Much to ones dismay gameplay also feels like a disappointment, as the title lacks direction in its use of gameplay mechanics. Puzzles make a return and are properly intuitive, yet the ambition to add physical challenges harms the ability to deliver a thoughtfully-immersive game. Its not that the title needs to hold the players hand, but there are moments when status indication and direction would be helpful. One particular instance of this was after crash landing on Mars, Kathy must make her way to a colony outpost for air. With the airlock in sight, and the only indication of lowered oxygen levels a tiny blinking light on our pack (that I didnt notice the first time, thus causing me to die), its just one major example of how clunky this game is. After attempting four different times to reach this airlock and die in the process, I was left staring dumbfounded at the screen wondering if the game was even play tested before launch. It offered no indication of what I was doing wrong and I had to painfully try different methods to succeed. Kathy states shes running out of air rather late, so my first attempt ended with death because of this lack of indication.But it makes sense that we cant exactly do the most intense activities like running. The timing ends up being so incredibly precise, however, that even jumping or stopping once during the trek can ruin the attempt. On one of my last attempts, all I did was have Kathy simply walk  and I died literally right outside the door. I still couldnt figure out why I died. The game overcompensates in some gameplay areas to try and amp up the dramatics when it doesnt need to. Making mechanics overly tedious just to slow down the pace of the game to draw it out longer feels like way too much work for such simple tasks. Even the new climbing mechanic, using Lara Croft-esque pickaxes, feels slow and tedious. Utilizing an alternating input system to climb (where one button moves one arm, a second button vice-versa), players need to maneuver their way up a wall at a painfully-slow pace. Kathy doesnt need to be a superhero, but she ends up feeling ineffective because of these mechanics. Its a pity when Deliver Us Mars has such strong storytelling, but poor quality gameplay to back it up.Closing Comments:Deliver Us Mars is a small studios notable attempt at bringing something new to their fledgling franchise. Yet the attempt falls short as it feels the title takes one small step, and one giant leap, backwards in its development. Its commendable for KeokeN Interactive to aim high and want to deliver something more robust than a walking simulator, but the overall game feels unpolished. A fantastic, emotionally-charged story and gorgeous landscape visuals arent enough to keep this title in orbit. Any action within the game feels stiff and tedious. Its a title that doesnt give players much direction in some parts, while forcing them to slog through others. And while the narrative pace of the game keeps things moving along, its gameplay causes major stagnation and frustration. The issues with gameplay arent even related to any of the sequences in space  where players are floating around in zero gravity. Many of the frustrations are actually due to gameplay on the ground. Not only is gameplay overly tedious, its difficult to find other components to appreciate when human models and other graphical decisions leave the game looking like a last-generation product in some sequences. Despite all this, fans of the first title will find detailed accounts and contexts that help make sense of the lore provided. If you can stand mediocre gameplay and character design in light of an amazing story, Deliver Us Mars does hold value to players. With only about ten hours of gameplay (give or take), it feels too long in all the wrong ways. Im optimistic, however, that KeokeN Interactive can finesse development to bring quality to future titles.", "date": "February 8, 2023", "grade": 2.5}