{"name": "Beyond Eden", "ref": "https://hardcoregamer.com/?post_type=post&p=277775", "text": "Until recently, folks hungry for period drama featuring yaoi romance would be left empty handed after a visit to Steam. Now, though, there are two releases which cater to these themes within the visual novel genre. One is A Hand in the Darkness by Ertal Games. Another newer release is Beyond Eden by Studio Pieplus. In the case of Beyond Eden, instead of focusing on students of a boarding school, players are given a more regal scenario to explore. The game stars Alex Wake as he returns to his childhood home  a stunning mansion. Given that everything takes place in the Victorian era, expect a lot of well-mannered men living in the Barons mansion. The Barons children range in age, but the vast majority are handsome adults. This homecoming is extremely bittersweet for Alex. Hes not simply there to see childhood friends for the first time in ten years. In the most dramatic fashion possible, the return is fueled entirely by revenge. The events which took place all those years ago originally ousted him from the Barons estate. Its only now that he is finally poised to execute revenge against the family in grand fashion. Unlike some revenge plots, players get an incredibly good look at what fuels Alexs anger. It also demonstrates how haunting and awful it can be to be saddled with such fiery emotions for years on end. Fortunately, as with many visual novels, there are a wide variety of paths to go down which determine exactly what happens with Alex and his devious, yet surprisingly simple plan.There are six main routes to read through, with each offering a good and bad end of sorts alongside other choice-based variations. Unlike most other yaoi releases, not every single route is sexual in nature. Its a good move given that this non-romantic route in particular deals with a child. For a wide variety of reasons there is an unfortunate history of yaoi titles offering dubious consent in some adult sequences. Its a shame this is still the case for a few moments in Beyond Eden, but players should be made aware of this fact before playing. After all, it could be seriously upsetting to certain readers. Beyond Edens writing proves unique in how it weaves together concepts of revenge, the supernatural and romance into a tidy package. The translation from Korean to English is also generally well done. Rarely do sentences come across as stilted or otherwise unnatural. With that said, there are typos and grammatical errors present. They seem to appear more readily once youre late into certain routes while the common route is basically pristine. None of these issues make the story unreadable. They just prove a bit of an annoyance since its yet another example of a visual novel releasing launching with typographical errors. Going through a single route should take players anywhere from two to five hours. After that, its generally much quicker to go back, make some different choices, and collect that characters other ending. Future routes are also a bit faster once you can skip past the previously viewed scenes. There is, however, gatekeeping to stop players from activating certain routes on their initial playthroughs. After beating one, others become unlocked, and so forth. Sometimes it can prove challenging to get onto another route and theres currently no English guide to help players in a tight spot. With that said, once on the way, it should take anywhere from fifteen to thirty hours to fully complete Beyond Eden depending on your reading speed.Watching stories and relationships unfold is always a high point of a good visual novel. Although the developers stated there is no main route, theres certainly good reason to complete the game with all endings. Each character adds their own facets to what went on in the past that led to Alexs vengeful mindset. Learning more about the other men also showcases their multifaceted nature. None of the characters fall into simplistic tropes. As stated earlier however, the sexual scenes sometimes come across in a negative light, especially when weve only interacted with said character for a couple of hours beforehand. Adult scenes do not show everything, but present enough to completely understand whats going on. There is no extraneous patch to download.Beyond Eden features lovely artwork which showcases the Victorian era as a lavish, beautiful time. The men, too, are depicted as perfectly handsome gentlemen. Even the aged Baron maintains his good looks. CGs also look fantastic and all of this skillful artwork pairs with the elegant soundtrack. Players can explore CGs via an interactive mode that crops up from time to time. This allows for investigation of a scene that may offer a clue or simply bring more life to a sequence. Its not a big deal, but certainly doesnt harm the experience.Closing Comments:There is a lot to like in Beyond Eden, but there are also aspects that detract from the overall experience. Anyone who wishes to shy away from depictions of dubious sexual consent should definitely seek out another game. Those who can handle this sort of content in fiction can go right ahead with playing the visual novel. Sure, there are some typos and some inconsistencies, but this rarely detracts from the overall experience. Beyond Eden presents a skillfully written story with a believable cast that players absolutely want to learn more about.", "date": "November 2, 2017", "grade": 4.0}