{"name": "Call of the Sea", "ref": "https://hardcoregamer.com/?post_type=post&p=393564", "text": "The works of H.P. Lovecraft have often had trouble translating to solid adventure games. Call of Cthulhu was thoroughly average, The Sinking City already left me bored after a couple of hours and Dark Corners of the Earth was ambitious, but too bugged and difficult. Maybe part of the problem is that all these games are horror titles, and as such feel the need to insert combat and/or stealth. Why not have a Lovecraftian game thats not only more of a straight-up first-person graphic adventure, and why not one that takes a different approach with a different story genre? To answer that question, we have Raw Fury and developers Out of the Blue with Call of the Sea. And this game brings up an even bigger question: can you actually get a good game and a good romance story out of Lovecraft-inspired material?Set in 1934, Call of the Sea follows Norah, an ordinary art teacher suffering from a mysterious disease. When her husband Harry sets out on an expedition to try to find a cure for it, he ends up missing. But then a mysterious package appears with clues suggesting that hes still alive, so off Norah goes to a mysterious island in the South Pacific, where the expedition was dropped off. And there Norah immediately finds Harry and his team, stranded but working hard, very much happy andnope, of course the expedition has completely gone south. Only the remains of it are left behind, and now Norah has to find out what happened and hopefully find Harry, all while being unable to shake the feeling that she almost seems to feel at home on the islandUnsurprisingly, Call of the Sea hits all of the beats one would expect in a Lovecraft-style tale: remnants of ancient civilizations, fish people, body horror, characters going mad for various reasons, bizarre science and physics-defying objects and landscapes, but what makes it unique is how none of this is mined for horror (well, not much). Instead, this focus is more on the surreal aspects and the pulp adventure, how Norah explores all of these fantastic temples and sees what happened, how she reacts to the bizarre world that was uncovered, and most importantly, how she actually finally feels alive on a lush and intriguing island after living so long with a disease. Cissy Jones once again delivers a fantastic performance, selling the feeling of shock and wonder perfectly. One particular moment where she goes on an experience so life-changing that she almost forgets about Harry is a particular highlight. Similarly, the game sells the romance between Norah and Harry, even if the two never share the same space for the longest time. The writing is nice and well-done, easily covering several lovable little quirks in the duos relationship. Their devotion to each other really does come through, making you believe they truly would break through any obstacle for each other. Of course, Norah really does have to get through several obstacles, as the various abandoned temples and scientific equipment requires players to solve various puzzles. Luckily, Norah jots anything important that you can view down, requiring one to explore everywhere possible to get the hints they need. None of these puzzles are any real mind-benders, mainly Myst Lite stuff like figuring out proper sequences or combinations, but they are still nicely designed and have the right level of difficulty for such a narrative-focused adventure.But while Call of the Sea is an overall well-crafted experience with a great story and nice puzzles, it always feels like it lacks a little something. And Im not even sure if I can say what that thing is. Maybe the chapter structure is too linear, holding things back just a bit. Maybe it could have potentially been longer, clocking in at a mere four hours or so (and thats even if you aim for one hundred percent completion by getting all of the journal entries, secret objects and murals). And related to that, maybe it could have helped if the rest of the cast were given more time to develop. Norah and Harry are a good romantic couple, but the rest of Harrys expedition may as well not exist. They only pop up whenever the game feels the sudden need for drama by showing what happened to them. Its characters so underdeveloped that I actually questioned why one even did something evil seemingly out of nowhere.It also doesnt help that I was playing the Xbox One version of the game (because attempts to get a Series X in time have been futile), which feels like it pales in comparison. While the island is still a lush paradise, there are some notable pop-in issues at times, along with other bugs like subtitles not matching dialogue (though these issues are apparently being worked on). And I could never shake the feeling that the graphical quality wasnt as strong as could be, and this became extremely evident during Chapter 5, which featured many underwater sections where the frame rate notably chugged, which actually took away from the otherwise vibrant and gorgeous setting. Call of the Sea is a solid adventure game, but perhaps you should invest in the Series X or PC versions instead. Closing Comments:Call of the Sea could benefit from having more substance, but otherwise its a solid adventure game that manages to put a unique spin on the traditional Lovecraftian adventure. Norahs journey is a memorable one, thinks to some terrific dialogue and a breathtaking, surreal island full of fantastical mystery. It may not be the most challenging graphic adventure game, but its still one that players might want to take a look at sometime. After all, after so many sheer descents into madness, why not set out to find a welcome change of pace?", "date": "December 8, 2020", "grade": 3.5}