{"name": "Cassette Beasts", "ref": "https://hardcoregamer.com/?post_type=post&p=439840", "text": "There have been many monster-collecting games, but none of them blend that core mechanic with a more realistic slice-of-life feel and killer music quite like Cassette Beasts. Your avatar starts the adventure being created and then shifted to a new realm with all manner of odd things happen that can only be explained by gaming or animation logic  if its on-screen and visually works, it just works. Here, the world of having a cassette to transform yourself or your teammates into a monster works for the citizens because it happen, so it makes sense.The in-game world poking fun at the absurdity of things like that helps to set the tone as light early on, and when combined with the emphasis on slice-of-life comedy, makes it easy to care about everyone you interact with. Kayleigh is your first ally and shes easy going and a great person to have as an early-game partner because she doesnt just provide information-dumps, but does so in a way that shows that she knows a lot  but also has gaps in her knowledge that shes open about. Chatting people up in a lot of RPGs feels the same, but not here.Every character has an ebb and flow to what they say and the usage of limited voiceover helps give the characters a voice while also allowing the player to insert a bit of their own interpretation. This allows for the best of both worlds where the game provides a core voice, but one that the player can add to with inflection and tone. The players allies all have solid chemistry with them and one another. That aspect reminds me of Cowboy Bebop or Lupin III where cast chemistry is underrated, but makes the adventure more engaging. The usage of a cassette as the Pokeball expy is fantastic since the devs went all-in towards making use of functions that would be on a cassette deck, but applying them to work for the player. Stop is used to switch out the monster mid-fight, which allows you to not only change your strategy up in real-time, but has the massive benefit of restarting your health bar as well. This is a huge help during boss battles where a single hit can tear your party down quickly and may result in having a less-than-optimal build for a character, but result in still winning because of the damage you can deal in that new form. Having the in-game characters be the ones morphed helps change the dynamic a bit from hey, these battles are hurting animals/pets! to adding more drama because theyre hurting the cast of characters that you get to know throughout the game. The addition of far more personality able to be shown for humans versus animals adds some stakes to the combat and made me always want to avoid a knockout in battle for that reason. Most of the adventure takes place from an overhead-style perspective like the original Pokemon games, but the polygonal world makes sense when you want to go exploring as the camera shifts to a behind-the-back view and enables the player to find items and other hidden goodies. This setup helps make the world feel more lived-in as well since it isnt just this fully-static world and feels more active. It helps that theres a structure to it with folks selling items and the like, but having it be more explorable than most monster-catchers helps keep it fresh.The addition of environmental puzzles helps a lot as the avatar character will be needed to do things like lure enemies over from across a chasm or even glide across a chasm to unlock a new part of the map. The constant feeling of progression and self-improvement makes play sessions easy to keep going longer than expected. I had a small play session carved out in my head and then by the end of it, two hours had passed. The gameplay loop of free-range battles and then town exploration before a dungeon is a good one and leads to every session, whether its large or small, getting something done. It also helps keep a constant flow on character growth because while there are sections that are full of battles, those can be fled if need be and you can just continue the story or mix up doing battles without the hassle of taking out everyone. If you wind up with a couple of battles where youre able to evade attacks, its worth battling as much as possible to level up faster and gain new skills and especially HP gains and defense buffs. Being able to fuse the characters monster forms together is another neat thing that helps make progression feel like a true improvement in power and not just experience leading to naturally getting stronger.Cassette Beasts is a great-looking game in part due to its simplistic art style. It feels like a GBA-era Pokemon game in terms of color in the world, but within a 3D world that has real dimension to it that comes up from time to time. Animations are fluid for things like running and attacks, although a run button would be nice to have instead of a limited dash to get around the world faster. Befitting a game called Cassette Beasts, it has a killer soundtrack that is among the best in a game Ive heard in a long while. The OST is full of lyrical, relaxing music that also ramps up a lot during boss battles to create a level of intensity that you dont normally see for the genre. So many games go for relaxing music without much fanfare in it, but there is a lot of variety in the tunes here and the soundtrack is addictive. One thing I love is just pausing every so often and listening to the soundtrack to unwind. Closing Comments:Cassette Beasts is one of the best and most entertaining monster-collecting games outside of Pokmon. Not since Monster Tale on the DS have I had so much fun capturing monsters and this being a blend of a Pokmon formula with a more grounded, realistic slice of life anime puts enough of a twist on the formula to make it feel fresh. It plays like a dream and is a ton of fun even for those burned out on recent Pokmon games hurting the format. A lot of those have felt overburdened with gimmicks or too many long quests, while Cassette Beasts streamlines things to take out all the fat. Its the all killer, no filler of monster-catching games.", "date": "April 26, 2023", "grade": 4.0}