{"name": "Tails: The Backbone Preludes", "ref": "https://hardcoregamer.com/?post_type=post&p=436607", "text": "In case youve forgotten, Backbone was a noir adventure game crafted by developers Eggnut and released in 2021, set in a dystopian version of Vancouver inhabited by anthropomorphic animals. While it wasnt without its flaws (namely how it became more linear as it progressed), the stunning and unique setting combined with its enjoyable cast of characters helped it become something memorable, something with an engrossing world that youll want to see even more of to quote myself back then. And low and behold Tails: The Backbone Preludes was announced, and thus would be showing us more of this world again, causing me to react with a mix of excitement and bewilderment. Would an anthology-style set of small stories such as this be the best way to delve further into the Backbone universe?As suggested with the mention of an anthology back there, Tails: The Backbone Preludes is a set of four separate stories, each focused on a different character at different parts of their lives. With the previous main character Howard, we see glimpses into their university years as they become friends with Larry and prepare for the future, our journalist Renee is investigating a serious of mysterious fires and trying to deal with our struggling marriage, we see Clarissa Bloodworths rise from innocent child to adult mob boss, and then for a twist, we have Eli Abbas, a scientist conducting research in the wasteland beyond the citys wall with their new partner Jorge, in the story thats the most directly connected to the first games plotbut is also a hefty spoiler for the first game, alas.So we have four acts with four scenes each for each character, with the first act allowing players to pick one of three personality traits for each protagonist that can determine what dialogue options appear, and from therewell, honestly, there isnt a whole lot else to say. The graphics are still impressive as before and the world is dazzling, the characters are still fun and worth getting invested in, but again, things are a lot more linear, its over in about three and a half hours, and the gameplay hasnt changed at all. There are a few times you move and interact with things, mainly in one impressive scene that basically has Howard solving his first detective case, but the meat of things here involve a lot of dialogue. Well, dialogue and a few quick games of Unpacking, in Renees case. No, seriously.The end result is something that feels hard to judge, as the whole experience is over too quickly, and fans of the first game wont find much thats new here. Sure, the writing is still good, and each story is still well-told and gives more insight into each character, but Tails: The Backbone Preludes commits the sin of trying to put a larger focus on branching narratives affected by your choices. Which is something thats welcome in these gamesbut not necessarily in a prequel. Im reminded of Life is Strange: Before the Storm and how it tried to give Davids character more depth and sympathy, and allowed you to choose how Chloe should handle this initially rocky relationship with their stepdadexcept it was still a prequel, so no matter the choices, you know theyre going to end up at complete odds with each other by the time the first game begins.The exception, of course, is Eli, the complete newcomer who ends up playing the most important role. Fittingly, he also gets the final scene in the game, and its a rather tense one that places the heaviest emphasis on all the choices youve made in their story so far. Its also a nice, lengthy conclusion that builds up, especially as the length of each scene is rather uneven, with Clarissa and Renee getting rather brief ones at times. The only downside with Elis story is that it takes place entirely in one location, though this could be said for most of Howard and Renees stories as well. Only Clarissa gets a tale that has a new location each time, largely owed to each of their scenes taking places years apart from each other. And in a sequel to a game where the city itself feels like a major character, the lack of variety in the locations feels like a hefty blow.Still, whats here is good, its just that you shouldnt go in expecting some epic prequel that causes you to look at the first game in a completely different light. Tails: The Backbone Preludes is just that: a set of quick preludes to Backbone. If you liked Backbone, then it should make for a nice side dish of sorts, albeit nothing too substantial. Thankfully, theres a New Game+ mode, allowing for replayability so that you can explore each path further, which is always a welcome touch. Still, while the initial journeys of our leads are enjoyable to check out, heres hoping that this is all still just a prelude to a more fleshed-out Backbone II.Closing Comments:Tails: The Backbone Preludes is the prequel that fans likely werent expecting and didnt know that they wanted, and due to a lack of variety mixed with brevity, they may also walk away still expecting and wanting more. But whats here is a set of well-crafted stories in what is still a highly-engrossing world with a bunch of great characters to see a little more of, so even if its just a slight chunk of what Backbone can offer, its still one for fans of the series and fans of well-done narratives to check out. And hey, its still one of gamings most unique and best dystopias. If we have to spend time in some sort of hellscape, it may as well be here in Vancouver.", "date": "February 2, 2023", "grade": 3.5}