{"name": "Puyo Puyo Tetris 2", "ref": "https://hardcoregamer.com/?post_type=post&p=393244", "text": "Despite the game already being around for a while in some circles, Puyo Puyo Tetris still turned quite a few heads when it officially released in the West in 2017. Tetris has been in the mainstream social consciousness for almost forty years now, so both puzzle fans and non-puzzle fans were pretty certain that there was nothing more that could be done with it. The same could probably be said of Puyo Puyo too. Its not as well known outside of Japan, but it too had been around long enough for any hope of innovation to fade.Thats when Puyo Puyo Tetris came along and flipped the table, making both games fresh and exciting in exactly the way many thought impossible at the time. Its a fantastic puzzle game and a must-have for any puzzle fanatic. Its a sort of game that would be difficult to top, so the announcement of Puyo Puyo Tetris 2 was something of a surprise. How could Sega possibly expect to top it? Why by simply making more of it, of course. Puyo Puyo Tetris 2 isnt the literal game changer that its predecessor is, but its still more of something excellent and that might just be good enough.All of the game modes from the first game return in Puyo Puyo Tetris 2. Normal Versus, Party, Swap, Big Bang and Fusion are all back, and theyre all basically identical to what they were before. This isnt a bad thing of course; all of these modes were and still are a blast to play. Its just disappointing that no new options or gameplay tweaks are available for them. The new characters make a difference in modes like Fusion, where their unique drops come into play, but otherwise these modes are virtually unchanged. The same is true of Puyo Puyo Tetris 2s Adventure mode. Worlds have collided once again, and upon regaining their memories, its up to Ringo, Tee and the rest of the gang to put things right again. If theres anyone out there who was invested in the Puyo Puyo Tetris story, then they might find this disappointing, but it still does a decent job of serving as a vehicle for gameplay. Since most of the game modes are the same as they were in Puyo Puyo Tetris, there isnt all that much here in terms of new and interesting challenges. All that said though, the campaign has seen minor improvements. There are more characters to meet, battle and eventually unlock, and the adventure plays out over beautifully-rendered world maps instead of static screens and mission labels. Its more of the same, but its at least presented better. Its not all the same though, as theres one brand-new game mode in the mix now. In this Skill Battle mode, players put together a team of three characters and equip them with stat-boosting items. Once thats done, its time to throw that team into battle and combine their special abilities with ones own Tetris/Puyo Puyo skills for a chance at victory. On the whole it works well and I was excited each time I encountered it in Adventure mode. Against competent CPU players (and especially other people) Skill Battle can be a lot of fun, but thats not always the case. There are two problems with Skill Battle in its current form. The first is that character stats actually matter, making it possible to run up against an opponent whos just plain too strong to fight at the time. Character level is only used in Skill Battle, meaning that it only ranks up in Skill Battle games. One cannot gain experience from the rest of the campaign, so its either keep fighting the same opponent over and over until your characters levels are high enough or go grind out matches in the dedicated Skill Battle mode. Its an interesting mode to be sure, but its not so interesting that grinding experience becomes fun. At the very least, players have the option to just skip these battles and continue the adventure, but that means skipping all future Skill Battles too since the character level problem wasnt addressed. The second problem has to do with the difference between Tetris and Puyo Puyo.While this is a minor problem in the other modes, it becomes something major in Skill Battle. See, Tetris is just plain faster than Puyo Puyo. Theres no getting around it. Once the game gets going, its easy for a Tetris player to just keep clearing line after line, frustrating the Puyo Puyo players efforts to get their Puyos stacked properly. The games basically over if the Puyo Puyo player is able to get the four or five step chain theyve set-up, but its not easy to get there. In all other modes (except for Big Bang), this mostly evens out since players can recover and the game isnt over until one persons board is filled. In Skill Battle, though, players have health bars. Once that health bar is depleted, its game over. All the normal rules of reducing damage go out the window here. It doesnt matter whether one is getting single or double Puyo Puyo chains since theyre not playing to block garbage puyos/blocks like normal. Landing a line clear or a puyo single does damage regardless. This makes speed paramount and puts the Puyo Puyo player at a noticeable disadvantage. If Puyo Puyo is going to be viable in this mode, then some more balancing needs to be done. The rest of Puyo Puyo Tetris 2 consists of the Online, Lesson and Customization spaces. Online allows players to jump into both ranked and unranked matches, host their own custom lobbies and quickly jump into the lobbies of online friends. There are also online leaderboards for the solo challenges, so even players who dont like head-to-head play have something to enjoy. Its easy to use and works well. Online is what most of Puyo Puyo Tetris 2s expanded player customization options are for too. In the Options space, one can customize their character, portrait, frame, voice lines, tetriminos, puyos, board, SFX and their Skill Battle teams. Its impressive how many options are available right from the start, so fans of playing online will appreciate this.Of course, one cannot enjoy any of this if they dont know how to play, and thankfully the Lessons space does a better job of getting new players up to speed this time around. All the basics are carefully explained and the game will even guide players though some of the more advanced strategies and maneuvers. Once those are done, theres a ton of special challenges with which to hone specific skills. One may not come out of the Lessons mode on the same level as a seasoned veteran, but they wont be a newbie anymore. Closing Comments:Puyo Puyo Tetris 2 isnt the game-changer that the first Puyo Puyo Tetris was. In fact, its just more of the same with extra toppings. The new characters, better presented Adventure mode and improved Lesson mode are all great additions, but it would have been better of more had been done to make everything else feel fresh and improved. The Skill Battle mode helps, but that mode is undercut by a poorly-implemented stats system and the existing disparity between Tetris and Puyo Puyo. With that in mind, Puyo Puyo Tetris 2 is better as an entry point for new fans than it is for older fans who already have the first game. Its all the fun of the original, but theres not enough new here to justify buying basically the same game all over again.", "date": "December 7, 2020", "grade": 3.5}