{"name": "Borderlands 3 (PS5)", "ref": "https://hardcoregamer.com/?post_type=post&p=393160", "text": "Editors Note: The non-console specific portions of this review originally appeared in our own Kevin Dunsmores review of Borderlands 3, which can be read in full and unaltered here. Additional portions here were written by Cory Wells.With Gearbox announcing a free upgrade for Borderlands 3 for owners of the game on last-generation consoles, the developer has taken advantage of the PlayStation 5 hardware to truly make this the premiere edition of the game. Those who held off on the initial release will be impressed with not only the full graphical experience, but also the DLC for extended replayability. Borderlands 3 on next-gen is a cohesive experience with more options, even though the story gets left untouched.Borderlands 3 takes place seven years after the events of Borderlands 2. Pandora remains as desolate a place as ever, but things are changing for the worse. The Calypso Twins, Tyreen and Troy, have moved in and used their streaming capabilities to coalesce all the various Psycho clans into a single cult, the Children of the Vault. You play as one of four new Vault Hunters (Zane, Amara, Moze and FL4K) who answer the call of the Crimson Raiders. Working with series mainstays like Lilith, Claptrap and Dr. Tannis, you travel the galaxy to put a stop to the Calypso Twins plans to open legendary Vaults.Borderlands narrative has progressively gained more importance with each new entry. Borderlands presented itself with a rather straightforward plot about hunters looking for a Vault. Borderlands 2 expanded upon that premise with a great villain, plenty of plot twists, and expanding the backstories of old and new characters. The Pre-Sequel developed Handsome Jacks story and introduced characters that would become villains in Borderlands 2. Finally, Tales from the Borderlands crafted the most competent narrative the series has seen to date. Unfortunately, Borderlands 3s story gets lost in the noise of the games other activities. The story is, once again, a hunt for a Vault. In many ways, Borderlands 3 feels like a Greatest Hits collection, with missions used mostly to reintroduce fan-favorite characters from previous games. Its nice seeing characters like Tina, Sir Hammerlock, Aurelia, and Rhys pop up, but they rarely stick around long enough. Instead, theyre quickly dropped in favor of some of the franchises less exciting characters.Probably Borderlands 3s greatest narrative weakness is the lack of a robust central antagonist. It was always going to be difficult to escape the shadow of Handsome Jack, and the Calypso Twins dont manage to get close. Presented as a commentary on todays culture, the Calypso Twins would have been perfect for dissecting streaming culture, fandom and corporate obsessiveness with chasing popular trends. The commentary never materializes, however, and once the Twins motivations are revealed, they come off as generic bad guys. As for humor, most of Borderlands 3s falls flat. In many ways, Borderlands 3s humorless jokes fall into the same hole as Battleborn. The game tries hard to be badass and funny, but rarely comes across as either. Pretty much all the jokes feel crass and crude and are often obnoxious. Borderlands 3s writing is at its best during side quests, which often play up pop culture references and lead to fantastic Easter Eggs. While not all strike comedic gold, theyre far more consistent than the main missions.What Borderlands 3 lacks in story it makes up for with its gameplay. The game doesnt do anything particularly new with the shooting mechanics but does tighten things up while expanding how players interact with the game world and their Vault Hunter. Gearbox has done an excellent job tightening up the shooting controls. Taking shots, whether from the hip or down the sight, feels accurate, and the feedback satisfying. Its the new changes to the movement system, however, that makes the most significant difference. Being able to slide and clamber over objects vastly increases the players mobility and allows for greater maneuverability around the battlefield. Heres the kicker, though. The DualSense controls introduce a deeper feel to shooting. Each trigger response varies based on the gun that is used. You are truly introduced to the differences of the varying weapons. With the subtle rumble of the controller that moves from side-to-side, this allows for a much more immersive experience. Players are given even more control over their Vault Hunters than previous games. Whereas past Vault Hunters got one ultimate ability, Borderlands 3 provides each Vault Hunter with three Action Skills. The new system gives players more latitude to customize their character, especially since only one or two Action Skills can be taken into battle. A more defensive player may want to use Zanes Digi-Clone and Barrier. An offensive player that likes to dominate enemies could consider Mozes railgun to destroy shields and minigun to decimate the defenseless foes. Each Action Skill can be further altered through Augments unlocked as you progress through the skill tree. Season 2 of the DLC has also added new skill trees for each Vault Hunter and theyre substantially improved.Its the guns, however, that still steal the show. The sheer amount of weaponry available to players is insane and new additions like alternate fire modes make collecting guns even more exciting. Borderlands variety and number of weapons is something no other looter shooter has managed to replicate to this day. It can get overwhelming, but its fantastic when you find that right combination of weaponry. The more outlandish guns come on the second playthrough, so the focus of the first playthrough should be to simply get through the story. This has been a Borderlands staple since the first game. Borderlands 3 offers up a big amount of customization and weaponry to keep fights interesting. Each character feels unique, and its especially fun working with a whole squad and seeing how all the powers mesh together. Like previous games, Borderlands 3 is playabale with up to four-players online. PS4 and Xbox One both support two-player split-screen, which is, unfortunately, a downgrade from four-player split-screen in Borderlands: The Handsome Collection. The next-gen versions have rectified this, as players can participate in either three or four-player split-screen action. Borderlands 3 is at its best when playing with friends. Those looking for a solo experience, however, can still have a good time.As fun as it is to play Borderlands 3, the play areas and mission design do hamper the experience. Despite traveling to other planets, there are minimal changes outside the scenery. Eden-6 may be a swamp and Promethea might be a city, but functionally theyre just like Pandora. You have small corridor areas and then big areas to drive vehicles around in. The locales, enemy names and NPCs may change, but a gunfight on Pandora feels exactly like a gunfight on Eden-6. Missions also start to get tedious as the game progresses. Towards the end of the game, its common to fight waves of enemies in a single area, push forward and then fight waves of enemies in the next area. Battles never evolve in any meaningful way, nor does the difficulty ramp up over time. Add-on continuous back-tracking, loading screens between regions, bullet-sponge bosses and a laggy menu system, and you have a game that tends to drag towards the end.The move to the Unreal 4 Engine for Borderlands 3 severely hampered the previous generation version of the game. Attempting to play the game in Resolution Mode on a PlayStation 4 Pro amounted to a 20 FPS experience that was practically unplayable. Thanks to the new hardware of the PlayStation 5, we get what is undoubtedly the best visual game in the series. Ray tracing and screen-spaced reflections and shadows can be witnessed everywhere. Pandora, which is usually bland, is brought more to life without the reflections and shadows work. Places like Promethea truly stand out with its neon lighting. The game mostly runs at 60 FPS outside of a lot of hectic action happening and does so in upscaled 4K. Gearbox has included a Performance Mode, which opens the door to 120 FPS. Unfortunately, the team sacrificed everything to achieve this and there isnt a huge difference in how the game feels. Anti-aliasing doesnt exist and details are dropped severely low. This may not be as apparent on smaller screens, but its noticeable on a big one. You wont be hurting for frames on the default Resolution Mode, though, and its the recommended way to experience the game. The audio experience is also improved thanks to the 3D Audio of the PlayStation 5. The same voice acting and music is retained from the original, as the game still features one of the best soundtracks. The 3D Audio allows for hearing enemies in different areas plus keeping track of gunfire and explosions. It allows for a leg up and youll be looking at the map less.As previously mentioned, Season 2 of DLC includes an extra skill tree for the Vault Hunters that adds more to the game. If you went with Season 1, theres a ton of extra content and missions, but it lacked the skill tree. The big part of Season 2 DLC is the Arms Race. This mode allows for infinite gameplay with friends that plays kind of like a battle royale. Youre transported to an area and over time a circle closes that leads to a boss fight. You can select up to four weapons that can be saved to your inventory that can be used in other modes. If you die, you lose everything. It can be played alone, but is strongly recommended with others. Matchmaking was difficult, but doable. The mode does allow for endless fun and grabbing the occasional obscene weapon to add to your loadout. If you beat the boss, you get to keep everything. Its truly a fun experience. Closing Comments:Borderlands 3 is a no-brainer for those who already own the game to experience what the PlayStation 5 is capable of. The Resolution Mode visually adds so much more and the Performance Mode gives players a chance to try out the 120hz mode on a compatible display. The story remains the same, but the DLC will add many more ways to play for users. The DualSense Controller with the PS5 is the true game changer here and its further bolstered by the 3D Audio. Gearbox no doubt took advantage of the new hardware to unleash the proper Borderlands 3.", "date": "December 1, 2020", "grade": 4.5}