{"name": "Yakuza: Like a Dragon", "ref": "https://hardcoregamer.com/?post_type=post&p=391463", "text": "If one statement rings truer than all others, its that developer Ryu Ga Gotoku have played it daringly bold with this years iteration of Yakuza. New setting, new characters and above all else, a new gameplay premise. One that has seen the once predominantly real-time, beat-em-up affair, replaced with a turn-based, traditional RPG set-up  one centered as much around gear, classes, party set-up as it is the tactical decision-making enacted during many a confrontation. The argument in favor of a shake-up  let alone one as radical and unexpected as this  will of course forever hang above many a series known (for better or worse) for playing things safe or consistent throughout. And if theres one series known for keeping to a relatively safe, though highly-enjoyable, formula over the years, Yakuza is sure to be one of the first names on many peoples minds.Its easy then to see the uncertainty going into Like a Dragon. For years fans have been kept relatively satisfied by what Ryu Ga Gotoku have offered; thats not to say that much of what has made Yakuza such a revered IP has somehow been lost or discarded with this new interpretation. But with Like a Dragon  an entry that puts as much effort into framing its admittedly indulgent love of old-school JRPGs through the lens of Yakuzas ridiculously slap-stick, over-the-top expression on world-building  how much of this attraction to the new would ignore what has come before? What it is fans love about Yakuza to begin with, beyond just the manner at which we can beat fictional Yakuza and thugs alike with our player-characters fists. With my closing statement on the preview I sampled of the game last month, I spoke of my love and enjoyment of the bite-size, ten hour snapshot I got to savour.Play-time with the full build has now surpassed five times that length and if there were any lingering suspicions of doubt beforehand, those feelings have truly been exorcised. Yakuza: Like A Dragon is simply phenomenal; a common trend among its brethren sure, but the scale of Yakuzas success this year  and the ways in which it effortlessly balances the beloved old with the enticing new  means that Like a Dragon stands as one of the more interesting iterations in the series and undoubtedly one of 2020s best games. Perhaps the best place to start is, naturally, the games beginning and of already the challenge Like a Dragon puts on itself. Namely, the introducing of new protagonist Kasuga Ichiban  a low-ranking, yet positively-upbeat member of the Arakawa Family. Itself a low-ranking part of the Tojo Clan in Kamurocho at the dawn of the 21st century. For all the difficulty other series may have at convincing players to get on-board with a new face, in the span of a few hours and a couple of chapters, Ryu Ga Gotoku make it look so easy. All the essential pieces are there: Ichibans origins, his motives, his relationship with fellow characters and the rationale he holds as a well-meaning protagonist. Then comes the eventual betrayal, the impending stages of grief and before long, Ichiban winds up tagging along with fellow outcasts amidst Yokohamas city streets. Trying his best to unravel a city-wide conspiracy that (unsurprisingly) reveals even more complexity the further one progresses with the main story. Suffice it to say, Ichiban is a likeable main character in Like a Dragon  one whom so easily slots into the role of main protagonist. Its actually surprising just how quickly the game convinces us of Ichibans rightful position as a sound replacement for the former, long-standing staple that was Kazuma Kiryu. A character you so quickly sympathize and get behind in the opening chapters. A character whose evidently stern, argumentative moments during a heated, expository cutscene, are balanced nicely with spots of big kid at heart indulging in the role hes trying to play: the RPG-like hero. Some of this appeal is by way of the interactions he has with fellow party members and Substory characters alike, yet Ichibans mix of bumbling optimist, complimented by an obsession of Dragon Quest, in actuality feeds rather well back into the series standard for playful absurdity. The integration of the series own tonal motif into its main character works wonders not just for the major cutscenes and story beats peppered throughout, but (much like Ichiban himself) of the games own obsession on translating JRPGs many traits, gimmicks and cliches alike into its own rendition of fictional Yokohama.Some of these references are outright spoken through character dialogue, but for the most part, theres a charm and on occasion a bit of laughter to administer at the ways Like a Dragon plays up some of JRPGs most notorious characteristics. For example: in early chapters, the only reason Ichiban can only scrape together enough money for one new weapon or one new piece of armor is simply the fact hes both penniless and homeless. Another: the only way you can switch job classes  and perhaps an explanation as to why characters can do it so swiftly  is by way of the local Job Center. And of the circumstances that binds each of the four starting party members in Like a Dragon to begin with. Likewise, the way ordinary-looking NPCs transform into varied enemy types is simply by way of Ichibans child-like imagination and nothing more. Its that very acknowledgment of its own ridiculousness  and better still, little sign of shying away from even its least-appealing factors  where Like a Dragons deviation into turn-based battles is evermore entertaining to see unravel further down the line. But on its combat alone, Like a Dragon makes sure to not simply play cheap imitation. Rather than simply resorting to providing a battle system reliant on four figures standing in a line, doling out determined moves. One of the obvious factors here is that combat has both the players party and the enemies present, constantly moving about a given space. Its not wholly fluid, but neither is it static to the point character positioning shouldnt be considered. Theres a bit of a luck and good fortune about how things play out sure, but it at least provides an interesting dilemma for players to look at a touch more closely. Especially when an enemy is downed and one has to decide whether its worth rushing to get a critical hit on. Be that at the risk of another nearby foe potentially disrupting that by blocking you or using a part of the environment to land a couple of extra hits. Whats more, how players use the manner of both turn order and placement in combination with a variety of attacks that target single enemies, multiple enemies or better still, whose area-of-effect execution has the potential to hit multiple foes at once.Outside of this, Like a Dragons general progression of tougher encounters  and how players prepare for this both in and outside combat  plays relatively close to the genres past affairs. Later down the line you have the kind of enemies that inflict status ailments as do the main boss encounters whose last-ditch tactics can trip you up if youre not careful. A lot of this is admittedly common-place for any RPG outing and those coming into this expecting a revolutionary deviation of JRPGs more than likely will be left baffled  but not entirely disappointed  by the traditionalist approach. As previously noted, Like a Dragons doubling-down on all the genres best/troublesome nitpicks is where the game generates but another layer of comical antics. It helps that the combat is deep enough that one cant just rush through spamming regular attack after regular attack. But above all else, the absurdist get-up to Yakuzas world is why these repeated encounters manage to keep combat from feeling stale. It helps that Yokohama itself is a welcome change of both pace and structure to the likes of Kamurocho before it. Much like what Onomichi provided in Yakuza 6, Yokohama is more varied and surprisingly spacious when it needs to be. You still have your narrow streets and alleyways to meander through, but so too you have your numerous districts that see you exploring widened roads, public parks and glitzy Chinatown-esque regions whose multi-colored neon signs at night  a call-back to Kamurochos intended aesthetic  offer an interesting dynamic to the citys otherwise desolate, grimey, untreated vibe of poverty during the day. Yakuza has always found a way to balance the allure and the peril alike behind city living, but at least with Yokohama, Like a Dragons setting is its own and simply traversing its many districts is but another of the voluntary, but welcome deviations from the norm.At the very least, theres an incredible amount to invest in here so far as side content goes. So much in fact that at one point, Id wasted nearly two-and-a-half hours away from simply following the next story objective. For a series lauded for its side activities  not to mention the effort Ryu Ga Gotoku go to so as to pack each of their releases with the kind of gameplay and presentation that could be their own stand-alone releases  Like a Dragon takes this to another level in terrific, yet thoughtful ways. And thats not simply a referring to how shockingly deep, moreish and worthwhile its trove of mini-games are, though the likes of the Ichiban Confectionary, Dragon Kart and Can Collecting could well masquerade as their own stand-alone releases. Another rabbit hole with which players will find it increasingly difficult to escape from once theyve got their first taste-test.As funny, entertaining and occasionally challenging these mini-game feats can be, said content along with the dime-a-dozen, secondary objectives littered about, do actually feed back into the grander RPG elements at play. Substories for example, upon completion, may provide an additional Poundmate for you to use in battle  Poundmates essentially functioning as highly-powered NPCs, that after paying a small fee, can offer anything from strong attacks to useful buffs/debuffs. Its tempting enough that Ryu Ga Gotoku have managed to win through on quest-lines that are at times comical, at times heartfelt, possibly both in the same quest. But much like the Part-Time Hero activities that unlock around the fifth chapter  succeeding in such activities, netting you larger stash of money as well as a useful gear piece/weapon  theres an even greater incentive to poke around the city streets and see what else there is to savor. Beyond the fact random conversations can be initiated between select party members by simply passing a seemingly-ordinary landmark or part of the city. Theres just so much to meander towards and risk forgetting the main story over with Like a Dragon. Expected it may be to find some of these mini-games lavished with some exaggerated cutscene or the like, or how returning distractions like Darts or the Batting Cages work again as sufficient changes of pace. Ichiban finding out if hes passed a five-question exam in the most dramatic way possible; in another scenario, sitting in a cinema whilst taking apart the blatant quality of some B-tier movie; getting pelted with projectiles after failing to appease shareholders at an annual company meeting. And yet for all its slapstick, its desire to play things out in the most unnecessarily over-the-top delivery possible, the fact Like a Dragon can still find both the time and the space to be serious, to be in-depth and to make you care for the world its building, should strike home at just how much Ryu Ga Gotoku once more are firing on all cylinders here. How despite its gameplay changes and of the implied developers own personal interests, the changes in artistic choice havent dampened what is still brilliant storytelling both in the main campaign and through the citys many inhabitants whom, in this game especially, feel a little more than random quest-givers, but actual living-breathing inhabitants whom may or may not return to aid in Ichibans continued quest.For all the departures from tradition the game triumphs on, Yakuza: Like a Dragon is not without the momentary failing. Worse, issues from previous games that not only look untreated, but seemingly ignored. The most blatant of which is the manner at which AI functions both inside cutscenes or worse, outside of them whilst still exploring the world. NPCs who seemingly fade out or fade back into existence  worse, doing so within point-blank range of your person  or instances where an AI figure can offer consistent one-eighty rotations in some hellish struggle to walk forward and out of shot. Though it remains at the level of nitpick, its an annoying nitpick that must be raised  something that one too many times damages part of the immersion the narrative garners. Another brief annoyance (similarly one that is a result of the reuse of assets from prior games) is the manner at which players can sometimes struggle with interacting with objects. Opening safes or simply getting the correct prompt to show in general, though not a new issue, is like AI, something whose clumsy execution can have players, at times, fumble with to get working. Closing Comments:Even with these minor annoyances  not least those carried over from previous games in the series  what brief frustrations that do surface are quickly and easily eclipsed by everything else going on in Like a Dragon. Or more appropriately, by the sheer scale of deviation and conviction that this years entry shows in proving that this genre of gameplay  this more classically RPG-centric approach  is an unquestionably excellent fit for the series. It might not be the most unique or transformative approach to turn-based combat, but what Ryu Ga Gotoku may lack in unique vision, they more than make up for with the kind of passion, knowledge and understanding of the genre  heightened evermore by the bizarre interpretation of JPRGs long, winding history. Whats left then is an interesting dilemma; time will only tell whether or not this game will eventually stand as the turning point for the series or merely a well-executed experimentation. But much like Yakuza 0 and even last years actual spin-off Judgment before it, 2020 has provided but one more jam-packed, stand-alone helping of the kind of emotion-spanning, content-bursting joyride weve come to know, love and expect from Ryu Ga Gotoku. From its gripping story, tactically-grounded combat, vast ensemble of well-written characters not to mention the sheer amount of side content to conquer and smile at, Yakuza: Like a Dragon is no less than a brilliant reinvention for the Yakuza series and one of 2020s best, most complete experiences.", "date": "November 9, 2020", "grade": 4.5}