{"name": "Power Chord", "ref": "https://hardcoregamer.com/?post_type=post&p=436378", "text": "The first thing to note about Power Chord is that on its Steam page, the developers proudly state that theyre fans of Slay the Spire. You dont say I sarcastically think whenever I see that remark. Yes, there isnt much sense in going to depth about a good chunk of the core gameplay, because you may as well just easily copy/paste a description of Slay the Spires gameplay and call it a day. If youve played any similar roguelike card game, you should know the drill: move along a map filled with branching paths, some are marked as battles, some as tougher battles with elite enemies, here are the spots you stop to heal at, the shop, the mystery encounters where you select from multiple options and get dialogue and worldbuilding, the chests where you can get new relics/gear that provide passive effects and more cards, use cards in turn-based combat by spending energy to either buff yourself or damage/debuff enemies, etc, etc.Still, theres nothing wrong with having a basic setup as long as you have a new twist on the formula and Power Chord does have another twist as well: the developers also being fans of Darkest Dungeon. Its starting to sound like Im being hard on the gameplay, but mixing the now-standard Slay the Spire formula with the four-on-four team-based battles of Darkest Dungeon actually works surprisingly well. When you start a run, you choose a band consisting of a guitarist (the attack-focused class), singer (healer and general support), drummer (defense) and bassist (the one that specializes in more unorthodox, destructive moves). Each member has their own set of color-coded cards that you start out with and find along the way, each suited to their specialties, which in some cases includes unique sets of charges that can be built up in different ways for more powerful moves and unique stances they can take that provide benefits as long as they dont take damage.The twist is that each character needs to be properly managed and taken care of, because if they die, all of their cards get removed from your deck, at least until you can resurrect them (either at a healing stop out automatically after each boss fight). So losing even one band member can cause a huge hindrance later on, especially since they lose all of their gear as well. Yes, unlike similar games, youre only given a finite amount of items that provide passive benefits, four per character, with most benefiting the one band member theyre attached to. In other words, success in Power Chord relies on you being able to find a way to successfully craft what feels like a well-balanced team, allowing for a terrific focus on strategy. There are other unique ways the selectable team-based setup comes into play, such as random encounters with secret third options that are only accessible if certain characters are in your band, like a dare involving a potentially dangerous drink that allows Shinobi 13 an options to gain a buff that starts every opponent with two points of poison debuffs if theyre with you at the time. Its a simple idea, but one that allows a little bit of each characters personality to come through. The personality also shines on the wide variety of challenging enemies as well (which are part of a story about needing to find a legendary Chronocaster guitar to repel a demon army, though the story is only told in cinematics between levels), which is helped by impressive and detailed graphics, backed by  of course  a rocking heavy metal soundtrack, albeit one that can get repetitive after a while.Part of the reason that the soundtrack began to feel repetitive, though, is because youll be spending a lot of time looking at the battle screen. Power Chord seems to have one of the same problems that Cursed to Golf has in that every run just feels way longer than it should. Part of it might be the slower pace, but in this case, though, it might be because sometimes each run can feel like a chore at times. Things started out easy, introducing each new enemy type and ramping things up, until it felt like the game was being stingy with any cards that actually provided armor, healing or support. Whatever ones I did have quickly became useless as later enemies began to dish out attacks that could wipe out a third of a characters health bar.Now you might think that this is of course the point of any roguelike. You start out weak and eventually find ways to boost yourself up with each run. The thing is that Power Chord doesnt unlock new gear or cards simply by stumbling across them. Instead you need to complete specific challenges first, like defeating certain amounts of enemies, dishing out enough damage of a certain type and other objectives that can stretch to even taking out a boss without getting a band member a killed, then doing it ten times. Even new characters can only be unlocked in ways like, say, killing twenty Furnace Demons, even though said enemies dont arrive until the second level, at least half an hour into a run, and them showing up isnt a guarantee. And the cards and gear you unlock are merely unlocked to be found throughout the game, meaning whether or not you actually get them is up to RNG. And thats the big problem with Power Chord and its difficultly: its completely reliant on grinding until you unlock better cards. A good roguelike like Slay the Spire, Monster Train or a non-deckbuilder like Hades should never have any of its runs feel like a grind. In all of those, the difficulty is always fair, like you legitimately have a shot at clearing a run after a short while as long as youre particularly skilled. Or at the very least, theres a always a sense of discovery and progress as you unlock new tools. But that never felt like the case here. It feels like you can only go on for so long until you hit a wall that can only be taken down by unlocking certain cards. It wasnt until about seven hours in until I got a combo of cards and gear I needed to take down a stubborn boss, and by that point things were finally beginning to click. But if it takes that long for a game to finally feel truly satisfying, then its doing something wrong.One last thing to note, though, is that my playthrough of Power Chord was prone to bugs. At times there were unresponsive controls, glitched audio playing during the cutscene, and most notably, an incident during the previously-mentioned stubborn boss where every action except for the animation and sound froze, forcing me to quit and start the fight over. Hopefully these will be ironed out in time, but for now, it makes for a rather discordant performance. Closing Comments:If you can get past its more grind-y elements, Power Chord can still be a fun deckbuilding roguelike game thanks to its impressive blend of influence that makes great use of its Battle of the Bands setup. Its something for every headbanger to check out, as well as fans of the genre who dont minds banging their heads against walls as they gradually chip down each tough demon in their path. Not exactly worthy of a Platinum record, but it can still be an enjoyable listen.", "date": "January 25, 2023", "grade": 3.5}