{"name": "Rays the Dead", "ref": "https://hardcoregamer.com/?post_type=post&p=391317", "text": "Ray LeMorte is dead, just another corpse planted in a poorly-tended grave. He had a life and then he didnt, and normally thats the end of it. When a graveyard experiment goes slowly right, however, he finds himself reanimated, short on memories and under attack by those who turned him into a brain-hungry shambling monstrosity. One thing Ray does remember is how to take care of himself, which when combined with his new undead stamina is enough to at least escape the graveyard. The thing about zombies, though, is if youve got one it doesnt take long to turn into a swarm, but instead of being the standard virus-based spread its got more to do with that giant weird lightbulb sticking out of Rays head.Rays the Dead is a zombie action-adventure thats as much about the life leading up to zombification as it is chewing on brains and commanding a horde. At the start Ray can basically swipe at things using an attack with a good horizontal arc, but once hes learned to create zombies the action switches focus to keeping the horde healthy while Ray directs the action. Hes a front-line commander, though, running around the thick of the action, sending out the undead troops and calling them back as necessary.The initial starting zombie is a good all-rounder, getting several good swipes and chomps in before returning to the horde. They can also dig into burrows, which is useful for undermining structures when the path forward requires them to collapse. These are just standard people, nothing fancy, but get a bunch together and they can quickly take down enemies. Dogs are a more tactical unit, in that they can hold enemies down to prevent them from attacking, plus they sniff out secrets and can somehow knock bombers from the rooftop. The third type of zombie is the ninja, which has low health but a strong attack. They go spinning out for a single hit before whirling back into the pack and it doesnt take too many strikes before an enemy goes down. Finally there are the big bruisers, huge burly zombies that slam down an area attack and can also shove obstacles out of the way. Each of the four zombie types is sent out to attack with a different face button, so its easy to choose the right ones when necessary instead of spamming everyone into the fray. The dog is an excellent first strike, for example, capable of pinning ninjas or gunners so the rest of the swarm can take them down with minimal damage. Ray has a targeting line shooting out straight ahead, and when it hits an enemy they get a highlight with red for attack, green for safe. Knowing the attack pattern of an enemy means you can either let loose the swarm to inflict strong but slow damage or use a break in the attack to ping them with ninjas. Once taken down, most enemies can be raised to join the group and eventually, with a little care towards keeping everyone safe, swell its ranks to become a serious force.A big part of managing the force is keeping everyone in line and Ray has two more abilities for personnel management. One trigger controls a tightly-clustered swarm while the other raises a shield, and each have their place. The swarm moves fast, basically doubling as a run function, which is great for getting out of the way of incoming explosives. The shield, on the other hand, knocks back charging dogs and humans, leaving them open to attack. Both moves double as a way to rein in the horde and keep the force focused, but they also deplete the energy meter. It quickly charges back up but a badly-timed moment of slow shambling in the middle of a boss fight is a great way to see the zombie forces whittled down to nothing.The bulk of Rays the Dead is raising a zombie mob to take down hostile rednecks, corporate goons, ninjas and other assorted minions but theres also a good amount of exploration as well. Each level has a decent amount of secrets to chase after, with hidden gravestones and energy-meter-extending batteries tucked away in odd places. The batteries arent designed to be fully collected, though, because while some are free for the taking others are a choice, usually involving taking something from someone who needs it. A little extra energy is nice but maybe not at the expense of letting some goons rough up a woman theyve had a disagreement with. As the game goes on and the story opens up, the initial modest graveyard beginnings eventually turn epic. Theres corporate greed, a skull-mountain lair, invading Russians, and at the heart of it all the life story of Ray. Between most zombie levels is one featuring Ray starting as a young boy going all the way to adulthood and eventually death, with family, friends and bullies all playing their part. While the characterization is more than a little cartoonish the overall story beats are strong, eventually contrasting living-Ray as a passive follower to zombie-Ray leading and taking charge after death. Its thematically strong even if the actual dialogue cant carry its weight and the living-Ray levels do a great job of breaking up the zombie action. Younger Ray is still good at leading people, even if hes being told to by others, and these levels frequently work as training for new skills like the shield ability. Its too bad, then, that so much of the humor is focused on endless 80s pop-culture references.There were a lot of good movies and cartoons in the 80s, but having them endlessly shoved in your face isnt all that endearing. Ok, heres a Gremlins reference, and Karate Kid, Alien, Mr T, GI Joe, and on and on and on. Theyre not subtle either, but instead are just sitting there in the middle of the level given the full spotlight, and frequently as major characters in the story. I wish Rays the Dead had more faith in its world and the insanity going on, because these references quickly stop being charming in the same way that someone saying Wink! Wink! while distorting their idiot face is.Theres also the problem of an endless array of bugs, some simply annoying and others requiring a level reset. Ive been exploring and the camera decided I crossed just the right pixel to focus on a new scene, except Ray and company are still hanging out in the previous area which is now off-screen. Thats easily fixed by taking a short walk back into the frame, but the time I hit two buttons in a level at the same time only to have one pallet fall instead of both required restarting the level from scratch. Enemies sometimes run away into walls forever, while the big goons forget to go into their taunt animation and instead attack and flex endlessly, effectively invulnerable until the game remembers that, right, its been a minute or two so maybe it would be fair to let the player get a hit in. It gets tiring after a while, trying to let things slide, but theres enough good in Ray that it can be worth the effort. Closing Comments:Rays the Dead is a hard game to either recommend or trash, balanced neatly between being a charming and much-smarter-than-it-looks zombie-fest and a buggy mess punctuated by painfully blatant 80s nostalgia. Ray commanding a zombie horde with a good selection of units combat can be a lot of fun, with interesting decisions from one moment to the next and a satisfying payoff when the right ones are made, and on paper the story of zombie-Ray rising up to be a hero while living-Ray just goes along with things while he and his friends lives get worse is structured incredibly well. The problem is that Rays the Dead is so rough around the edges that it can be hard to enjoy the things it does well. Rays the Dead is a mixed bag, but its a unique one with a lot of heart. Just be aware going in that its going to take effort to like the game as much as you wish you could.", "date": "November 4, 2020", "grade": 3.0}