{"name": "Assassins Creed Origins", "ref": "https://hardcoregamer.com/?post_type=post&p=276698", "text": "Its surprising to say this, but it has been a long time since we had a full-on new Assassins Creed game. Sure, two years might not be that long for some, but it has been eight years since the franchise saw a biennial release and that was a significant jump to Assassins Creed II. To celebrate its ten-year anniversary, Ubisoft has crafted a tale that tells the early beginnings of the Assassins organization and how it became in charge of maintaining balance and order against evil organizations out to obtain ancient artifacts from an extinct, hyper-futuristic civilization. Sure, things have become a bit convoluted over the last few years, not to mention aimlessly stumbling around the overarching plot after Desmond Miles met his end, but there has always been a fascinating idea hidden underneath the interconnected historical stories that has had fans coming back for more. The series desperately needed a break in order to innovate, so is Assassins Creed Origins the leap the franchise deserves or has Ubisoft missed the pile of hay?As the name implies, Assassins Creed Origins tells the origin story of how the Assassins organization came to be. You follow the Bayek of Siwa, a Medjay who goes around Egypt to essentially fix the problems of both the Egyptians and Greek. While hes tasked with keeping the peace, thats not his main objective, as its revealed relatively early on that an organization had essentially killed his son, thus putting him on a revenge quest  which is typical for not only a Ubisoft plot, but an Assassins Creed story. This leads him across the hazardous environment to not only search for those responsible, but topple this shady organization and their desire to obtain power through ancient tombs and artifacts. Of course, just as all Assassins Creed games have featured, there are a number of historical figures that Bayek conveniently interacts with, this time being Cleopatra and Julius Caesar. The plot is typical for the series, but unfortunately Bayek is far from the most memorable protagonist. Hes more in line with Altair as a serious individual, rarely having any fun with his work. It does make the moments when he does show a range of emotions all the more delightful, but there were times when I wished I could be playing as his wife instead as she has more of purpose and drive outside of revenge. Assassins Creed Origins also features modern day story elements. While I wont spoil too much of this, know that its not going to blow anyone away. In fact, a lot of the questions posed at the end of Assassins Creed Syndicate are not only unresolved, but arent referenced. There are secret tombs spread throughout Egypt that will help expand this story a bit as they act as audio journals after the events of Desmond Miles, but they do little to actually expand things further. It does set things up for how Ubisoft will tell more stories moving forward, but outside of this, the characters and motivations are lackluster with an insignificant impact. There are a couple moments when the developers try to make you care about one of the characters, but they do little to actually set her up for you to feel anything.Mechanically, Ubisoft has made some significant strides in creating a new experience, but at the same time retaining the same familiar feeling of an Assassins Creed game. The controls have more or less been overhauled, making combat a lot more personal and far more challenging to maintain. This is primarily due to the core structure resembling that of a Dark Souls game, where its more about timing and looking for openings rather than just waiting for counter prompt. Its when you find your preferred bow and weapon types that things begin to open up. Whether you want to wield a heavy weapon like a mace to perform more devastating stuns, or quicker, more agile weapons such as dual blades to get in more hits, the amount of customization to your combat style is expansive. Its not only about one-on-one (or ten-on-one) battles, as youll still be able to sneak about and hide in the bushes to get the jump on enemies, but now its far harder to flee. Enemies will rarely give up on chasing you down, be it on horseback or in a camp, sometimes making it questionable how theyre able to find you even when hidden. Regardless, the stealth mechanics are still fantastic, as eliminating a whole camp of enemies and then finally taking down your target with one fell swoop has never felt so good. Unfortunately, one aspect of combat that still needs tweaking is the targeting system. Too many times was there trouble switching between the different enemies on the field and sometimes I couldnt lock-on for the life of me. This made some encounters just a frustrating mess. In addition, the traversal mechanics are still clumsy. While they work more times than they dont, there were frequent occurrences where Bayek would grab onto ledges he wasnt instructed to, jump all the way down to ground level instead of a nearby ledge, or run up on a wall instead of moving to the side of it. Its still nowhere near the levels of frustration of Assassins Creed Unity, but its still a finicky system that needs work.Surprisingly, while the main story is the highlight of the campaign, the side quests are far from an afterthought. In fact, a lot of them have compelling plots to dig through, varying from a quest that resembles Gollum from Lord of the Rings finding The One Ring, to an washed up brawler whos looking to earn a quick buck. This sometimes brings out the better sides of Bayek as there are some comical or somber moments to find throughout the world. I do wish they were a little more optional, though, as the progress in the main campaign will require the player to grind a few levels to progress further, but these are more than worth your time, at least for the story. Speaking of which, Assassins Creed Origins worlds is massive. While its not on the level of something like The Witcher 3 or Skyrim, it goes beyond expectations. Its around 14km2 with the time going from corner to corner on a mount taking around 20 minutes without any interruptions. Assassins Creed IV: Black Flag could very well have a larger map as a whole, but this is far denser with the vast majority being a variety of earthen environments. This includes more of a tropical setting in the north and north east, mountainous terrain in the middle, and desert in the south and west. This world is filled with things to do, not only the side quests but gladiator battles, chariot racing and so much more.The biggest problem Assassins Creed Origins has is its mission structure. While the core combat is engaging, the missions can be broken down into three formats: assassinate, rescue and investigate. Rescue requires you to either carry someone out of a camp or escort them (with abysmal AI), and investigation is simply finding clues in an area After investigating a scene for the thirtieth time, it gets old; they almost feel more prominent than actual combat scenarios. In addition, one of these mechanics almost always has to be thrown in no matter what. There was one side quest that expanded upon an incident in the main story that was heartbreaking, but instead of taking a moment of silence, theres a random occurrence in the background that then tasks you with assassinating someone. Im aware the title of the game is Assassins Creed, but you dont need artificially inject mechanics into moments where it should be quieter.We were able to play through the entirety of Assassins Creed Origins on the Xbox One X and it makes us appreciate the amount of work that went into the game from a graphical standpoint. Playing this at 4K with enhanced graphical options really brings Egypt to video game form like never before, with beautiful terrain and wonderfully-detailed character models. Seeing a sand storm roll in or a hippo fight off a crocodile will immerse you within the vast world Ubisoft has created. Now, its not all great. While the draw distance for geometry and alpha effects is more than fine, the lower resolution texture work in the distance becomes visibly dispiriting. The world itself is beautiful, with lush fields and striking lighting effects, but there are lots of spots where you will see bland, low resolution textures in the distance that pulls you out of the experience. Its not even that it happens hundreds of meters away; there are a couple instances where characters will revert to their lower poly model as youre riding right next to them. Its off putting, to say the least. In addition, we did run into a few of crashes in our 27 hour playthrough. Thankfully, they werent anything game breaking and most of them happened early on, with the bulk of the experience being smooth sailing.Closing Comments:The extra year of development has helped Assassins Creed as a whole, as Origins is the next level for the series. Its bigger, better and more robust than ever before, featuring an engaging combat system and surprisingly compelling side quests. That isnt to say there isnt anything wrong with it, though, as traversal remains clumsy, the mission structure can get repetitive and the AI can be either overly aggressive or plain dumb to the point of frustration. Thats not to mention the disappointingly light current-day sections that do little to push the envelope in any way, outside of the secret audio clips found throughout the world. It sounds like Im being overly harsh, but it really is a journey well worth venturing, as the world Ubisoft has crafted is massive and thick with content to experience. There are elements of Assassins Creed II, Assassins Creed III and The Witcher 3: The Wild Hunt found within Origins, making it a step in the right direction for the series.", "date": "October 26, 2017", "grade": 4.0}