{"name": "Hotshot Racing", "ref": "https://hardcoregamer.com/?post_type=post&p=387283", "text": "Its hard to overestimate the effect Sega had on arcade racing. Theres a look and feel thats expected of the genre that has its roots in Virtua Racer and Daytona USA, with a side of Outrun thrown in for good measure. Fast cars tear down the track under blue skies, nimbly attacking the curves while constantly somehow always in the thick of the pack, with an upbeat pop tempo tune keeping the racing action at its perkiest. Namcos Ridge Racer emphasized drifting and the incredible Burnout series brought bumping into the foreground, but they all owe a strong debt to Segas mid-90s output. Its not so much that arcade racing cant escape that influence as why would it want to? It may not be 100% required for a great arcade racer to be bright and upbeat, but the nighttime landscapes of Midnight Club just dont resonate the same way. Hotshot Racing is squarely in the Sega-inspired vein, and while maybe a little shallow overall, the sheer exuberance of its presentation easily makes up the difference.Theres absolutely no setup to the events in Hotshot Racing. You pick one of eight drivers, each of which has four cars to choose from that focus on balance, speed, drift or acceleration, and race in either a four-course grand prix or single-race event. There are sixteen tracks total to choose from, divided up into four scenery groups of seaside, desert, jungle and mountain, and youll need to use drifting and drafting to build up the boost meter and maintain the lead. The other racers are fierce, constantly on your tail and bumping in the curves, although their deadliest weapon is blatant rubberbanding. In a more serious racer Id consider that a problem, but always having the pack around to play with makes each race more action oriented than preserving the best line all alone would be. Hotshot Racing isnt about squeezing out every advantage from a complicated chunk of machinery and its mechanics are as forgiving as its AI is aggressive.The start of each race opens with the typical 3-2-1 countdown and revving the engine into the yellow band gets a nice boost to leap from the gate. This is usually enough to earn first place immediately, but the rubberbanding means you constantly have to fight to keep it. Each track is tuned for constant top speed, with no need to release the gas, but you will need to work the drift to screech around the tighter corners. A quick tap on the brakes starting the turn is enough to get the drift started, and so long as another racer doesnt bump you out of the perfect angle, its relatively easy to keep the slide going and come out facing the right way. Drifting also fills up the boost meter, and while it may take a drift or two to fill in one of the five boost bars, it happens often enough they can be used frequently. Drafting also fills up the boost bar, with a nice whoosh noise plus air streamers coming off the car to let you know when youre lined up properly with the racer ahead. Getting first place in either the grand prix or a single race is fairly simple on Normal difficulty. Just keep pointed in the right direction, dont hit too many walls and save a nice pile of boosts for the final lap. Hard only takes a little more effort, but Expert can be a real challenge. The primary difference between the difficulty levels is each being faster than the last, and although the Hard speed makes for a nice challenge, it takes fine control to stay off the walls and full exploitation of the boost to squeeze out a win in Expert.While the sixteen tracks provide a decent amount of content in grand prix and single-race modes, Hotshots Racing comes with a nice selection of extras to keep busy with. In addition to mirrored modes for the single races, theres support for up to four-player split-screen multiplayer as well as eight players online. To fill out the package there are also extra modes in the form or Drive or Explode and Cops and Robbers. In Drive or Explode each car has a damage meter, refilled a bit at the race checkpoints, and while the object is to come in first, its a lot more fun to try to take out everyone else. Take too much damage or fall below a certain speed and the car will blow up, but if you can drive with confidence at a sliver of health you get to leave a trail of fire behind the car. Which, admitted, is more about looking cool than any kind of win condition, but thats enough of a reward to make it well worth the risk. Cops and Robbers probably works better as a party game, with most of the cars being robbers trying to avoid the police. When the player in a police car wears down a robbers health bar theyre deputized, turning on the remaining racers to bring them to justice. Closing Comments:Hotshot Racing is a refreshing blast of retro-arcade racing action. Every inch of each course is filled with personality, from fans waving on the sidelines to dinosaurs wandering through jungles and caves. The racers dont come out quite so well but you spend most of the time looking at a car rather than the person driving it, so thankfully thats not too much of a problem. The racing action feels as good as the courses look, and while eventually you learn that the first couple times around the track dont matter so long as youve got a nice supply of boosts for the final lap (Normal and Hard modes only), its still more than fun enough to burn up the track at top speed. Hotshot Racing plays as nice as it looks and ends up being a concentrated shot of pure upbeat racing happiness.", "date": "September 15, 2020", "grade": 3.5}