{"name": "NBA 2K21", "ref": "https://hardcoregamer.com/?post_type=post&p=387162", "text": "While the current NBA season seems to be endless, 2K continued with focusing on the next season with NBA 2K21. The team at Visual Concepts made quite a few strides last year with how the popular modes are implemented. These aspects retain in the latest version with a focus being on gameplay. A new version of the Pro Stick has been added and the shot meter has returned to the franchise. There are still countless modes to play in NBA 2K21, but that doesnt mean they have been updated. Whats more real then ever before with the franchise is the grinding involved. The case for this has been amplified by the difficult shooting. Welcome to Brick City.Players can expect the return of MyCAREER, MyTEAM and MyGM/MyLEAGUE and the WNBA. MyCAREER gets the biggest change for NBA 2K21. You star as Junior who has to live in his fathers footsteps as a legendary basketball player out of Newark, New Jersey. The narrative includes actual actors and actresses as the voice acting and story once again proves that this series narrative design is the best across sports games. The chemistry between Junior and the people he encounters along with some decision making from answering questions makes the story enjoyable. The mode also includes ten officially-licensed NCAA Basketball programs. Once choosing a college after high school, you are brought into some solid college atmosphere.Playing the NCAA portion was the most enjoyable portion of MyCAREER. The crowd chants dont sound like what you would hear in an arena, but the commentators are different and tend to provide history for the different programs. The narrative gets cut off in the end and leaves a gaping hole as you jump to the NBA. Participating in the NBA Combine activities is something every sports game needs just for creating players. You get drafted, have to manage some sponsorships and gain some fans as you attempt to make the starting roster for your team. The overall experience is held back by the grind for Badges and the bad shooting mechanics. The new Shot Stick and Accuracy Meter all sound great on paper. The Advanced Pro Stick is much more intuitive with different dribble animations that allow for great combos. If you get good at combining the Shot Stick and the Pro Stick, you deserve a shot in the 2K League. Its not that shooting is just difficult, the results are inconsistent. Sure, if youre able to nail and Excellent shot rating, its going in every time no matter the player rating or circumstances. 2K released a hot fix for this, but I dont see much of a change, and its only at lower difficulties. There are easy shots that Kobe and Jordan should make, but because the meter was even slightly off of Excellent and they had no one covering, it didnt go in. This is where Paint Warriors come in.A majority of the scoring youre going to do in this game is in the paint. In MyCAREER, its rewarding to break free from a defender towards the paint and score a dunk or lay-up. Shooting from the perimeter, which is the direction the NBA has taken in recent years, isnt really a thing. You could hope for a rebound, but the AI is so inconsistent that you cant depend on a rebound. I ended up moving to just using the button and it helps focus on timing, but the results are all over the place. It also carries over across all the modes so the game isnt just focusing on making MyTEAM or MyCAREER more of a grind because of it. Leveling up your player is also done through VC, and its minimal at best if you purchased the Standard Edition. If you just want to pick up and play an NBA game, its going to be difficult and thats an issue. Even taking to the practice court and working on shooting would help gain confidence, but it never carried over to an actual game.I do love the moves that can be pulled off with the Advanced Pro Stick. Depending on the rating of the player, I was able to change hands in mid-air and create awesome moves, even if the bucket didnt sink. The defense has changed in a way that players now have more weight. Fast guards can easily beat anyone around the edge until the AI cuts you off with a steal or a foul. This seems to be the way Visual Concepts intended to counter this, but when playing defense, it doesnt really exist. The extra weight transfer will have the offense allow to cut and pivot extremely easily, leaving you in the dust. A lot of the gameplay mechanics still come down to canned animations. Sometimes you want to pull off something quick and cant because of the animations. Yes, there are more this year and at times it looks and feels better, but the overall gameplay is still stiff and sluggish. If you try to play a game of NBA THREES with all big men, it feels like youre literally pushing tanks around that are oblivious to hitting an outside shot. The gameplay changes would normally seem welcome, but they have been implemented poorly here and result in a difficult experience.MyTEAM is again the primary focus in the game as there are more ways to grind. Visual Concepts has added Seasons that result in big rewards, but the focus is on keeping players coming back daily. Free Agent cards are available which inevitably tease the player to go out and purchase the card. These Free Agents do not stay with your team and cannot have contracts or boosts applied. I also feel like just because these players have high ratings, theyre not as good as a badged player. You are able to upgrade badges for specific players, but these cards still require contracts to actually use in game. Add that to the difficulty in shooting and youre playing even more often to make up for it.MyGM/MyLEAGUE roughly remains the same, but its still the best form of a Franchise Mode in any sports game. As a GM, you will still participate in specific activities like conversation pieces that remain stale. The biggest bright spot to this mode isnt something thats going to be seen immediately. Players can progress quicker or regress if they join a team that doesnt fit their playstyle. This would be better recognized if there were shorter season options and there also isnt a way to tell if a player is going to fit in or not. There needs to be a better way to expand on this, but the hardcore purists of this mode will enjoy this feature. The Neighborhood has changed locations to Venice Beach in California, which is a nice change of scenery that brings a vibrant and chill atmosphere to the mode. You can take your created player and jump into 3v3 or the 5v5 ProAM. To jump on the court, you have to wait around in an open interactive lobby which can be annoying. The only real difference in this mode is just the location and the clothing you can purchase. That and the fact that most people arent going to sink any shots. The visuals feel improved as it seems facial scans are near perfect. Even the cheerleaders faces look more lifelike this year. Facial animations and new off-whistle player interactions bring the visuals as close to life as they have ever been. The gameplay is still extremely smooth in motion and there will be tiny nuances that are to be appreciated on the court during play. The broadcast presentation, while still deep, is basically unchanged from last year besides some new product placement. The commentary team still sounds professional, but it just tends to blend in as background noise. Hopefully the next generation version will get a new look and sound.Online plays feels hit or miss. Theres either a delay or a heavy delay when playing in any mode. This is made worse by the timing required for shooting as youre going to feel off when jumping online. Theres still plenty of ways to play online and NBA THREES continues to be the favorite mode for me. The neon arena thats used is extremely fun. Matchmaking doesnt take that long at all, but its the execution online and not knowing what youre going to get thats the issue. Closing Comments:NBA 2K20 was a fun and serious game of basketball to play. On the surface, Im partial to the difficulty involved in shooting and the Advanced Pro Stick for NBA 2K21, as they can no doubt separate the great players from the average ones with endless combo possibilities. I like the idea of having to get better with shooting and while Ive improved, the results are still too inconsistent no matter the player you have. What made last years version great with the new MyPLAYER designs are all here, but roughly not updated. The narrative in MyCAREER is enjoyable, but leaves a gaping hole at the end. The Neighborhood is also a nice change of scenery. It really comes down to the difficulty involved in NBA 2K21 holding it back from greatness. Youre not allowed to build up to it with confidence. Also, if purchasing the Standard Edition, the grind is worse when it comes to getting badges for your player or getting cards in MyTEAM. When the grind interferes with the gameplay, it becomes a major issue.", "date": "September 12, 2020", "grade": 3.0}