{"name": "Marvels Avengers", "ref": "https://hardcoregamer.com/?post_type=post&p=386787", "text": "The road to Marvels Avengers release has been a long, confusing one. Following its reveal at E3 2019, Crystal Dynamics has often struggled to articulate exactly what kind of game they were making. Was Marvels Avengers a story-centric game, a pure looter game, a more Destiny type of experience? It wasnt until the recent beta that we finally learned the answer was yes to all the above. Marvels Avengers would attempt to juggle a cinematic story alongside looting and co-op. Finally, the final product is out, promising a full experience day one with more to come. Does Marvels Avengers do Earths Mightiest Heroes justice or is this just another botched live service game?Marvels Avengers takes place five years after A-Day, a cataclysmic event that destroyed most of San Francisco and caused the Inhumans creation. The Avengers find themselves blamed for the event, forcing their disbandment. The game picks-up with Kamala Kahn, a young Inhuman who discovers evidence that implicates Advanced Idea Mechanics (AIM) in the attack. Having uncovered the truth, she sets out to reassemble the Avengers and find her own place on the team.Marvels Avengers does what no other looter live service game has managed to do this-generation: tell a compelling story. Though at times predictable and inconsistent in its delivery, the campaign manages to tell a worthy tale thanks to Kamala. From the outset on A-Day, players are locked into her perspective, experiencing the excitement of meeting the Avengers, the horrors of a terrorist attack and the sense of awe mastering her powers. Sandra Saad provides a masterful performance, capturing the excitement but never going so far as to become campy (asides from some of the live service levels). Her relationship with Bruce Banner, and eventually, Tony Stark form the backbone of her evolution. Banner manages to develop a believable mentorship with her and serves as a guiding hand. Meanwhile, Stark provides levity and inclusion into the Avengers ranks. Both are wracked with guilt over A-Day and Captain Americas death, and Kamala comes to be seen as a glint of hope that they can move past it. Black Widow, Thor and Captain America dont get close to enough screen time to form a connection with Kamala. Thors treatment is especially noticeable given his scant amount of screen time and awful voice acting. The campaign features mostly handcrafted missions that highlight the capabilities of its characters. A handful of times, however, the live service elements crop up into the campaign. These generic, repetitive missions often feel like time sinks, working more to artificially enhance the campaigns length rather than adding anything of value to the narrative. Then theres the villain problem, a carryover from the MCU. The game only features three named villains  Taskmaster, Abomination and MODOK  all of which dont have much of a presence in the story. Yes, despite MODOK being the main antagonist, he barely shows up and never comes off as an intimidating presence. A lot of this isnt helped by how unthreatening AIM is. As the only enemy faction in the game, players spend all their time beating up their goons and robots. Without strong villains to counteract this, the stakes never feel all that high. Lasting 10-12 hours, the campaign tells a competent narrative thats worth exploring. While not all characters or villains are appropriately utilized, the ones that are work tremendously well. Kamala, above all, steals the show. The handcrafted levels are a lot of fun to run through, with only a few live service levels holding back the experience, but not even she can save the post-game.The campaign may tell a good story, but it only scratches the surface of the intricate combat system Crystal Dynamics built. By the time the credits roll, its unlikely youll have unlocked much of the skill trees, which is a shame. Combat is exceptionally varied, with unique systems that differentiate each character outside of shared combos. Each character has a light attack, heavy attack, support ability, offensive ability and ultimate attack, but each tree allows for additional personalization. For example, Iron Man can unlock different projectiles that switch up how his combos work.Theres a lot of fun and nuance to find when digging into the skill tree. Crystal Dynamics has done good work here, creating a system that works across all characters and keeps each feeling unique to play. Unfortunately, the camera tends to hinder more than it helps. The camera set-up prioritizes focusing on showing your character pulling off flashy moves rather than providing a comprehensive understanding of the battlefield. While a game like God of War can get away with this camera style due to a limited number of enemies on the screen at once, Marvels Avengers cant with large amounts of enemies sending all manners of attacks at you. With so many enemies attacking and so many icons popping up on the screen, its easy and frustrating to take unblockable hits off-screen.What ultimately brings the game down, however, are its live service components. Despite releasing in 2020, Marvels Avengers is perfectly happy with repeating the mistakes of vanilla Destiny, The Division, Warframe and Anthem. The post-game mission structure and world are boring to play in and explore. Missions, locations and objectives are recycled frequently, particularly the indoor areas. Its not difficult to get a strong sense of dj vu every time you hop into any mission. War Zones dont feel special like a Strike would in Destiny because every War Zone feels like its been thrown together from a randomized grab bag of options.The world of Marvels Avengers also lacks any character. Theres a canyon level, a forest level, a city level and a tundra level. Everything in the game feels so homogenized and theres never a feeling that people live in this world. Even the city levels are devoid of life, with JARVIS or Hank Pym explaining that AIM evacuated the city. Despite all the problems vanilla Destiny and Division had, their worlds still felt like they could be real, that people once lived there and gave each location a sense of history. Marvels Avengers doesnt offer any of that in any of its levels, and they all quickly grow tedious.It doesnt help that the game features a paltry gear system. Leveling up your characters Power Level is a mind-numbing experience compared to similar games. The benefits are marginal and the continuous dropping of slightly better gear makes sticking with anything pointless. While it makes sense on paper that the gear doesnt change a characters appearance (thats reserved for outfits), it does mean theres not much excitement around getting new gear. Marvels Avengers will never have its own Gjallarhorn-like moment and thats fine if the rest of the live service element was strong enough to hold up the game. Unfortunately, thats not the case. While Marvels Avengers has incredibly deep and rewarding gameplay mechanics, the game doesnt provide much to flex its muscles. Experience doled out during the campaign isnt enough to unlock the moves. Meanwhile, the bland and repetitive co-op live service levels and unrewarding loot quickly grow tiresome over prolonged play sessions. Marvels Avengers was always going to have a tough time nailing its presentation. The looks of Robert Downey Jr., Chris Hemsworth, Scarlett Johansson and the other stars of the Marvel Cinematic Universe are forever engraved into peoples minds. Despite this, Marvels Avengers manages to look good most of the time. Most of the character designs look decent and often balance that fine line between comic book and film. The game can also look downright gorgeous at times. Marvels Avengers visuals shine most when playing in a handcrafted campaign mission where the highest-quality assets can be used. Unfortunately, a lot of that sheen is removed from the open, live service missions where material quality noticeably dips. At least, during all sections of the game, there are plenty of impressive particle effects. Considering that the live service levels are quite big in scope, the drop in quality can be forgiven.What cant be forgiven about the presentation is the long list of technical issues currently hampering the experience. From texture pop-in to collision detection to audio issues like some sounds repeating constantly or missing audio, the game has plenty of moments that mar the experience. The game also has a habit of crashing at inopportune times, like after a long load. This all pales compared to the frame rate, however, which tanks in the live service levels to the point where sometimes its like watching a slideshow. Live service games are known for having launch issues (i.e., Anthem), but in 2020, after so many ruined launches, its unacceptable. Marvels Avengers has its moments where it delivers a presentation that could rival some of the MCU films, but lackluster live service levels mixed with unacceptable performance issues mar the great moments. Closing Comments:Marvels Avengers clearly wants to be something great, but it cant answer what that something is. It wants to tell a narrative-driven story with the Avengers characters. The co-op elements, meanwhile, want you to play with your friends. Finally, the live service elements wish to ensure you and your friends stay playing forever. Thats a lot to manage and Marvels Avengers just cant be everything. The 10-12 hour campaign is good thanks to robust level design, excellent writing and great performances from critical cast members. Outside of the campaign, however, the live service elements do Marvels Avengers no favors. The constant repetition and recycling of enemies, locations and objectives make playing beyond the campaigns closing act a chore. Once youve played one War Zone, youve pretty much played them all. Tack on a weak gear system and theres not much incentive to keep playing. Marvels Avengers is a blast when playing through the campaign and in short doses in the live service segments. Combined with severe technical issues, however, Marvels Avengers feels more like an unfinished product than a cohesive experience. Theres some might in these heroes, just not enough to keep things interesting.", "date": "September 7, 2020", "grade": 3.0}