{"name": "3 Out of 10 Season One", "ref": "https://hardcoregamer.com/?post_type=post&p=386796", "text": "Hollywood and gaming have been trying to come together for years. Everyone wants the cinematic experience and years of experimentation have given amazing results in fusing two very different media together, but movies are only part of the Hollywood product. TV may be lower budget but that doesnt make it easier to do. With a full cinematic game you can be one-and-done, with maybe hopes for a trilogy if everything comes together right, but episodic gaming has never gotten one of TVs biggest features right until now, and thats scheduling. Whether it was Telltales output, Life is Strange or the endless wait for Kentucky Route Zero, theres always been a significant gap between one entry and the next. 3 Out of 10 Season One came out weekly, which went a long way towards realizing the sitcom style it was going for.3 Out of 10 is a lot of things, all at once. Its a five episode comedy series, a collection of games ranging from mini to not-so-mini, an experiment in gaming storytelling, a warm-hearted look at bringing a game destined for bare adequacy to market and a huge amount of fun. Like any good TV show the first episode sets up the plot and characters, introducing Shovelworks Studios through the eyes of new employee Midge. While Midge is the main character for the first couple of episodes the series is an ensemble piece and most of the cast manages to get their chance in the spotlight.Each episode is a series of scenes with a small game used to bridge one to the next, with only the first episode confined to the Shovelworks office. Episode 2 goes to a local gaming school/mill, getting in a few good jabs at the process along the way, while episode five ends up in a Canadian hospital for technical gaming disorders (pathfinding or excessive ragdolling are not illnesses to be taken lightly) for a short while. Like any good sitcom the main set gets a nice workout every episode, but that doesnt mean it might not end up as the site of a riot or completely aflame by the end. The chaos in the latter half of each episode still leaves room at the start of each episode for someone to peacefully wander the office and chat with everyone while trying to track down a few extra stars. Every game needs some kind of pickup to track progress and stars are 3 Out of 10s. Investigate a rubber duck, get a star. Play a crusty old 1980s-era micro-cabinet to completion, get a star. And of course, test out Shovelworks Studios latest game, Surfing with Sharks, and see what kind of progress has been made from one week to the next to earn yet another star. There are a handful scattered throughout the office but the bulk of them come from the minigames connecting one scene to the next.One of the more technically-impressive aspects of 3 Out of 10 is how many different games it packs into the season. Two different Sokoban-style block movers, a brawler, FPS-stealth section thats super-creepy despite the only thing in danger being a cup of chai tea, a top-down driving challenge and even a multiball-madness pinball game are a small selection from the series total. While some of the games lack polish and the difficulty varies from five stars practically for showing up to reset button again!, none of them hang around long enough for any weakness to become too grating and the strength in variety means theres always another to look forward to. Plus its honestly impressive how they all tie in so well to the storyline.The strongest part of 3 Out of 10 is, as would be necessary for a sitcom, its story and characters. The cast manages the trick of having even its abrasive characters be likable and theyre all navigating a world thats just a bit more insane than necessary. Ben just wants to work in peace, Francines sardonic exterior masks an equally sardonic interior, Joan is a sweet middle-aged woman yet somehow could give Sam Fisher a run for his money, Jeb just wants to wring maximum profit from minimal work and Midge is trying to figure out how to fit in while hiding a secret of her own. Everyone gets along reasonably well, but somehow each episode ends up in pure chaos anyway. Protesters storm the building, there are multiple robot rampages, an office battle royale gets completely out of hand despite being waged with Nerf-like guns, etc. Its like a particularly entertaining new animated series has shown up, except in gaming form. Closing Comments:3 Out of 10 came as a nice surprise, released for free and dropping a new episode every week for its first five-week season. While the story is in no way is close to wrapping up, with Shovelworks Surfing With Sharks still being under development and the background of Midges secret remaining a mystery, every episode was a 45 minute treat. It would be easy to pick apart issues like the stars being functionally useless or some of the minigames feeling shallow (folding the limbs of an action figure to match a silhouette is not super engaging) but then theres a little Zelda/Isaac-style dungeon crawl that I could have happily played another dozen levels of to make up for it. What makes 3 Out of 10 work is that its just plain enjoyable, mixing smart commentary on the gaming industry with a great cast that can weather the madness of their world. Like most TV series it takes an episode or two to fully establish itself, but I played these as they came out and caught myself looking forward to the season finale. The needs of a game are different than those of a TV show, but 3 Out of 10 does an amazing job of fusing them together into an episodic adventure that demands a hopefully-quick turnaround for Season Two.", "date": "September 7, 2020", "grade": 4.0}