{"name": "Madden NFL 21", "ref": "https://hardcoregamer.com/?post_type=post&p=386139", "text": "In a typical year, the NFL preseason would be fully under way. With the current situation of things, most can be thankful that football is at least coming. What did not miss a beat was Madden NFL 21 as the team at EA Tiburon closes out this generation in what it hopes is the pinnacle of the series this generation. With another year of the Frostbite Engine and updates to the Superstar X-Factors, this alone may not be enough to be an attention grabber. EA introduced The Yard, which is an arcade style of backyard football in hopes of freshening things up. EA is also claiming that Madden is now a Live Service as new content will come throughout the year, much like the inclusion of last years Superstar KO mode. So you have to decide if you want something familiar out of the gate or if you need to wait to see if these promised updates make your purchase worthwhile down the road.Face of the Franchise is entering another year as EA hopes to implement a career narrative much like NBA 2K has to attract fans. Once again, the mode feels like a tutorial for how the game plays as it eases new players along to get comfortable and confident. This year, EA implemented a deeper player customization option that also transfers over to The Yard. The narrative has you starting out in high school and playing a couple games as the player immediately makes a frenemy and tries to do the right thing. You will then choose between a couple of NCAA teams to go play for with some missing from previous years. Once done with college, the combine and the NFL are on the horizon. This mode gets a dragged out as EA seemed to want players to spend more time here. This is actually an on-going issue with the game.In the past, you would always play as a Quarterback whether it was Long Shot or Face of the Franchise. This year, you are able to choose between Quarterback, Wide Receiver and Running Back. This does add replayability to the mode to go back through and play. What is dumbfounding is that rather than just playing your plays when on the field, you now play the entire game. This means you play both sides of the ball. I actually got more interested in how well my defenders and running back were doing. Theres no type of stat tracking or leveling up your character or anyone else. The games are typically blowouts and the mode just reminds me of what we could have with a modern day NCAA game. The narrative itself is okay at best. Its still the career rising storyline and there are cameos around every turn. Ill give the voice acting credit; it is the best its been through all these modes in the past. The characters are likable enough and you will answer interactive questions or interview questions in-between games during cutscenes. Also, the high school field strangely for some reason has frame rate drops that arent seen anywhere else in the game. Where Face of the Franchise gains some steps, it ends up getting held back with the design of lazily being longer by being forced to play defense and the entire game. The Yard is the other big addition to the game in terms of gameplay modes. EA has wanted to implement a backyard-style football mode with a focus on arcade action. Theres no doubt that the team did add more animations specifically for this mode as youll see different types of catches, throws and tackle breaking. The problem is that it doesnt feel like a true arcade mode. It literally plays like the normal, simulation version of the game. It lacks fast play and the pacing is just off. The focus feels purely on celebrating and the individualistic design the team did set out to create. You will unlock new gear just from playing the game, but a ton of it is buried behind microtransactions with the max amount points coming in at $99.99. That might net one piece of the elite gear. Going back to the game mode, theres no announcer, the mode just plays the soundtrack over a PA speaker and the same typical gaffs that plague the regular gameplay carry over here. Passes that should be easily caught or even sideline passes being called out of bounds. Its an arcade mode. Two feet versus one feet shouldnt matter but it happens a good bit. The sound of big hits on defense are drowned out by the soundtrack that you cant turn off.The Yard offers up to 3v3 multiplayer, but again getting involved and the ability to reach this point takes forever. The games are six minute games, much like Face of the Franchise. You will go through a ton of tutorials and challenges just to get to the point to play with your friends. These arent like two minute quarters that are fast paced. You will select different Prototypes for your player as they play both sides of the ball. Leveling up each individual Prototype is a grind and there are a few. Each one offers different abilities but in the grand scheme of things they dont stick out like the Superstar X-Factors do. Overall, The Yard feels like EA got an early jump on 2K for their eventual arcade title and it isnt fully polished to be a true arcade experience and is more focused on microtransactions for digital clothing.In terms of other modes, the same as last year are retained. And by retained, I mean are exactly the same. Madden Ultimate Team will continue to keep its fanbase engaged by grinding for cards and spending money. You can do missions where you get a chance to play games with the player you can eventually unlock. Rivalz were added, but its just another way to grind for more cards. Some of the missions are shorter to complete than waiting through the loading and transition screens. At least NBA 2K and MLB The Show will provide access to some high level cards in their modes, but cards continue to evolve and the only way to keep up is consistently grind or pay money. Even with this mode, which is the money maker, nothing has changed besides new cards, new ways to get cards and players having to start over from the previous year. EA has promised to address Franchise Mode, but at launch theres nothing noticeably new. Theres still a disconnect from the rest of the league youre in. You are able to up the roster size and can still relocate teams to pre-determined cities, but this is nothing new. The same screen with your coach on it fielding texting messages and doing the same prep are prevalent. The mode is completely stale and one can only hope it gets addressed. Superstar KO, which was introduced last year, is literally the same. Traditional online play options are limited and the online play still produces a delay in gameplay that you dont account for when playing offline. These are the same issues from year to year that we can only hope get addressed for the next generation.The gameplay seems to be have been sped up with some noticeable changes on the field. Superstar X-Factor 2.0 seems to further separate the field. Christian McCaffrey, for one, rarely goes down after one hit. Hes so quick to juke and spin that its devastating. This may be due in part to the new overpowered run game. Youll clearly see a hole to run through and while it comes off as random, its more common than not. The offensive line will push the defense out and away to make sure you can hit the second level to try to put on that one on one move on a safety or linebacker. Sometimes you think you have an opportunity and the defender warps off the blocker. Blockers are still used in the open field to create separation from the defender based on the defenders angle. The blocker isnt chasing someone down to knock them out. It still comes down to positioning the ball carrier to make sure the blocker picks up the defender. Also, catching a pass and turning up the field still makes no sense based on momentum. The offensive line also has the ability to double team defenders. Calling this works about half of the time. Overall warping is still an issue. Receivers dropping passes, even if it seems they have caught it and held possession, will drop it. These are high level receivers, too. Other times theyll just ignore the pass. AI quarterback passes are still perfectly timed and scripted, though. I had an instance where the quarterback darted perfectly through five defenders that were obviously oblivious to what was going on. Even in one-on-one coverage, the random balancing act of a defensive back blinding defending a ball still exists. Zone defense still doesnt work especially since your blitzers wont get close to the quarterback. This was all mostly on All-Pro difficulty because if you drop the difficulty level, it becomes too easy and receivers will be making those great one-handed grabs and hitting the quarterback once on defense will cause them to be inaccurate for the rest of the game. EA did attempt to counter this with the new defensive line controls. I actually like how this is implemented as there are multiple moves mapped to the right stick. Bull rushes, spin moves and swim moves can be pulled off if perfectly timed. You can view how prone an offensive lineman is to getting beat on his right or left side as this changes based on how successful you are. This works better for multiplayer than it does for playing the computer. If the computer is going to take a sack, it isnt necessarily because you worked for it. You will just get frustrated that the AI will continually pick your defense apart while you struggle to maintain a drive without choosing the go-to cheap plays. At least the improved running game makes up for that.Online play, while still offering that delayed input that you dont get offline, goes strange ways to try and keep things balanced. With no lobbies, the quick match for traditional play is still here. In a game I played, interceptions were exchanged four times as were fumbles. One was a fumble into the end zone that randomly had the ball pop back in the receivers hands. Its the same online experience the series has had for years. If theres one aspect of Madden NFL 21 that truly stands out, its the visuals. This is the culmination of what EA accomplished this generation. No one can complain about the player faces anymore. It seems that every major player face is perfectly scanned and supremely detailed this year. Even if there isnt a specific face for a coach such as Matt Rhule, the face at least looks realistic. Some players still have a proportion issue without their helmets with their body. There are other details that stand out. Each helmet has a reflection on it during gameplay including walking up to the line. The lighting is bright and while some players have too much occlusion, this is the best looking version of the game to date. The clipping seems more limited than it ever has been.The marketing this year for all EA Sports games has changed. I feel this is aimed at a younger fan base and Madden NFL 21 exemplifies that. Gone are the days of passionate NFL football, the dramatics of the sport and the grittiness. This has been replaced with the ability to celebrate after every play and a colorful palette that mimics mobile games or social media. The soundtrack is completely catered towards a younger crowd and EA even got rid of the official NFL music in the game. Theres a composer that came in and did his own songs that tend to be a chill version of traditional NFL music. Brandon Gaudin and Charles Davis return as announcers and its time for someone else. I didnt hear a lot of repetition, but a good way to change how a game feels is to switch up the commentators. Specific crowd chants such as GO-PACK-GO and the Chiefs song are louder than ever before. Player soundbites seem to come out more as well. Player hitting and collision, however, seems to be toned back. Closing Comments:Madden NFL 21 is a mix of missed opportunities. While its the best-looking version weve seen to date, EA Tiburon seems to have swayed the game in a different direction with new modes that keep you busy rather than engaged. The Yard is a mode that nobody asked for, and even if worth a shot, ended up shortsighted in its execution. Face of the Franchise continues to improve, but the fact an entire game has to be played on both sides of the ball just to extend the life of the mode is aggravating. Load times and transitions seem to be slow and it makes going through the fluff of MUT annoying. While the marketing has changed as the game lacks that true NFL feel, I do think the introductions are cool. The team also removed stats before starting a game. There are still legacy issues and bugs including Cam Newton being introduced as the Panthers quarterback even though its stated hes on the Patriots. The gameplay is faster and the running game is more overpowered and that goes along with Superstar X-Factor 2.0. Its hard to say where the franchise stands now in what its trying to accomplish with Madden NFL 21, but hopefully a new generation will bring a new experience.", "date": "August 28, 2020", "grade": 3.0}