{"name": "Gleamlight", "ref": "https://hardcoregamer.com/?post_type=post&p=385669", "text": "Imitation is the sincerest form of flattery; its a proverb most of us have heard at one point or another. Its also one we can so often  and inevitably  associate with a certain subset of video game releases, no matter the year. For when a game comes out that is so great, unique and intriguing to reach its pivotal end point and maybe even emotionally engage with, sooner or later youre bound to get those desperate to replicate it. To replicate the experience, knowingly or not, with the hope that players will lavish this new game with just as much (if not more) praise than that which it was inspired by.They can of course be subtle about their influences by contrast, but thats not to imply that being direct and upfront with ones inspirations  of which could be many, or entirely singular  necessarily means failure. More often than not though, these studios (these budding teams whom may or may not have played a particular favorite one too many times prior to production) fail to truly understand the originals appeal. A challenge if the imitation lies in the same sub-genre, but especially difficult if its of a completely different one entirely. Developer DICO really  and I mean really  want its players to know they adore NieR: Automata and when taking that sentiment on its own, who can blame them? From the abrupt credits screen that, surprise, reveal its actually just one route of many; the suggestion of a haunting, sparse title screen that changes as the player gets further into the tale.Then, during the supposed second run of the game comes the inevitable player input that requires you to delete your save file (a mandatory move, rather than some climactic option to debate with ones self over) and before youve referred back to the presser on the story of Gleamlight being one thats left to the players imagination, the game is seemingly over. How fitting that the developers want to envision players going through NieR: Automata, whilst more importantly, tackling their own project? Because admittedly, anyone would want to rather be playing NieR than this. Id be willing to wager even Automatas less-than-charitable critics would choose to go back to NieR over this. Gleamlight is a sorry state of affairs and it says something when the evidently unfinished state is the least of its problems. Lets start with a point previously raised: the games floating of the idea that Gleamlight is one of those perceive of the story what you will scenarios. That the games literal absence of anything pertaining to characters, story or a narrative progression is in someway an artistic choice  one that, in other better circumstances, still leaves behind sufficient material to at least garner a theory. When in reality, Gleamlights blatant decision-making (or lack of) has as much artistic ingenuity and deeper meaning as The Quiet Mans [pre-update] lack of sound, denoting a developers thought-provoking reimagining of deafness. In case youd forgot, it wasnt then and it most certainly isnt here in a game that is even more blatant in its attempt to ride the coattails of past greats. Alas, if only that were the end of the woes, but more annoyingly the deceit it plays in masquerading such shocking lack of care. In quickly revealing what could be described as a lack of figurative meat to its bones.The general premise is that Gleamlight is a side-scrolling, action-platformer chock full of many a pitfall and enemy to tackle alike. Admittedly theres decent variety to enemy design throughout the scarce, basic level design and brief [first] run-time. As is the use of the color; in trying to replicate some glass aesthetic with its bright, vibrant array of hues and an over-emphasis on sharp, pointed environments complete with many a glass-shattering sound effect. But even the artistic design ends up a victim of the slap-dash, hurriedly-compiled nature  the three main, distinct biomes never seeming to properly connect to flow well into one another. Rooms and particular screens, regularly confiding to the same up-and-down/left-to-right, zig-zagging of narrow corridors and many a spike pit one has to avoid colliding with. I use the word collide deliberately there, as collision detection in Gleamlight is so frequently unpredictable, an assumed safe position above could in fact lead to you losing a slice of precious health. Gleamlight does try to answer this perceived difficulty by way of its own take on health recovery/loss. That being your characters state/health is denoted by how saturated you appear in the world. The less vibrant you are, the closer you are to death. One of many tie-ins to the notion that the game is without any form of prompt or user interface  another unconvincing argument as to this being some kind of artistic choice as the reason behind such absence. The other part of this, crucially of all, is that the only way to recover health (outside of occasional gems you can break along the way) is by attacking enemies. Whose own suggestion of near-death is too denoted by how pale and desaturated they eventually appear. Youd think this area would prove a touch more tactical and at least provide Gleamlight with the consolation of some interesting peril on how slow, or maybe risky, one proceeds.But again, Gleamlights attempt at anything resembling depth or even reason fails spectacularly. For one, even getting around the environments to begin with is underpinned by the deliberate lack of visibility players are weighed down by from the very start. Meaning youre likely to take many a jump or plunge into a space hidden in the dark  more often than not landing in a bed of spikes or colliding with an already-alert enemy you had no chance of spotting beforehand. Only once you get around this added headache (not to mention wrestling with some momentary puzzle-platformer sections that are nowhere near as fluid or as charitable with space as they should be) does the flawed combat system reveal itself. Put simply: why would I even bother to try and duck and weave between an enemys varied attacks  more so in the case of boss battles  when I can just stand in the same spot and mash the attack button constantly? An attack of which theres only one standard sword swipe throughout and never holds any kind of impact or strength amid your player-characters own stilted, frame-limited animations. An attack that, in most cases, takes more from the enemy than what occurs in the opposite direction (the potential caveat the game tries to present, is that bosses especially can steal back health if they get a hit on you). Meaning you can, ridiculously so, clip into a larger enemy and spam attacks until they die. Thus, when such a massive loop-hole takes place in boss battles  what youd consider the most crucial and reliant on skill  its easy to exploit what is, again, a shallow and lacking mechanic. Even when the game attempts a work-around in this regard in some cases, when the difficulty curve receives an enormously upward spike, Gleamlight is still too poorly presented and tested for any reasonable amount of satisfaction to surface.One latter boss encounter, one of many repeated assets only with increased health and added grunt enemies to consider not only mistakes volume for complexity but suffers from the simple mistake of having attacks lashed out from off-screen. Another encounter does the exact same to the point the entire set-piece is flooded with enemies, the whole situation quickly slips into a chaotic mess of which the frame-rate can not handle. The best you end up clambering for out of the handful of repeated foes is some modicum of enjoyment in weaving in and out of projectile fire here or there. But even then, much like the limited and admittedly predictable scope of abilities you acquire, the barely-existent sense of positivity one feels while playing through is one that is in no way exclusive to this game. To somehow note the most universally basic of enjoyments as a plus should speak volumes about how far a game like this fails, but does so in such a blind, self-assured way thats more egregious than most bad games. Closing Comments:Its evident, even from as early a point in what is a dismally short but unsatisfactory game as this, that Gleamlight is both unpolished and unfinished. A game that comes across more and more desperate in its attempt to mask the lack of ideas and play-testing with some dismissively hand-waving statement of artistic choice the further in you invest. And ultimately, the longer the literally-repeated environments and boss battles begin to grate to the point the penny drops and you realize this is a one hour attempt of a video game disguised as something more. Sure the actual artistry and effort with its visuals may be pleasant-enough and the variety of enemy designs are there to take notice of, but a simple sake of existence and presence is nowhere near enough and its perhaps the only sign of cohesion and purpose in a game that feels poorly bolted together. Avoid at all cost; Gleamlight may have pretensions of depth, or at least a steady amount of enjoyment, but thats all they are sadly.", "date": "August 27, 2020", "grade": 1.5}