{"name": "Star Wars Jedi: Survivor", "ref": "https://hardcoregamer.com/?post_type=post&p=440561", "text": "EAs decade-long exclusive rights to the Star Wars license was filled with controversy and disappointment. It wasnt till 2019 that a new hope emerged in the form of Respawn Entertainments Star Wars Jedi: Fallen Order. A single-player narrative-driven action-adventure game, Fallen Order was a breath of fresh air for players. Featuring a new cast of characters set after the events of Revenge of the Sith, Fallen Order delivered a great story with exhilarating lightsaber combat. While rough around the edges, the game was a solid proof of concept with a foundation that Respawn could build on in a sequel. Four years later, that sequel is finally here. Star Wars Jedi: Survivor continues where Fallen Order left off, building upon it with more characters, bigger locations and a grander story, all while polishing the originals foundation. Is Star Wars Jedi: Survivor the next great Star Wars game or is this franchise doomed to fall to the Dark Side?Star Wars Jedi: Survivor picks up five years after Star Wars Jedi: Fallen Order and follows an older, more brash Cal Kestis, who finds himself increasingly targeted by the Empire. Following a botched job on Coruscant, Cal retreats to a forgotten planet to find a new place to escape the Empire. To do so, hell need to reunite his allies, uncover a more than 200-year-old secret and battle the increasing lure of the Dark Side.To say Star Wars Jedi: Survivors story is grander than Fallen Orders is an understatement. While the original focused on a singular objective (getting a Holocron) with excellent character moments sprinkled in, the sequel aims for a more significant objective with fewer character moments. Nevertheless, the story manages to weave a narrative about surviving the Empires onslaughts, uncovering a High Republic mystery and battling inner demons. Star Wars Jedi: Survivor provides clever twists and turns for those wanting a more consequential story.The grander ambition does mean fewer character moments. Cere, Merrin and Greez are all back alongside newcomer Bode Akuna, but their personal stories and growth happen off-screen before the games events. There are a handful of great character moments, but nowhere near the level of personal growth or stakes as the original. Its a trade-off, and mileage will depend on whether you prefer a grander story or more intimate characters, but Survivor remains engaging throughout its length.Where the story suffers most is in its pacing and antagonists. While the story does its best to juggle the Galactic Empire and High Republic plot threads, it often loses focus, with one thread usually falling by the wayside for hours before being picked up again. While both plot threads are wrapped up neatly enough, the path to their endings is uneven, and sometimes, unsatisfying. This mainly damages the antagonists, who dont get the proper screentime to establish their histories and goals outside some rushed exposition. It also doesnt help that, unlike Trilla, they dont have a direct or personal connection to Cal. Theyre grander in scale with more pull on the state of the galaxy, but lack connection and focus to make them feel special.Star Wars Jedi: Survivors story is a grand one with galactic-scale ambitions. While it trips up now and again and forsakes some of what made Fallen Order special in pursuit of that ambition, the overall story is well told with plenty of great revelations that will reverberate across the Star Wars canon. Its also a healthy length, clocking in anywhere between 12-18 hours depending on difficulty. Beyond the story, Star Wars Jedi: Survivor more than doubles its length.Shedding the constraints of the last-gen consoles, Star Wars Jedi: Survivor delivers bigger worlds with more to see and do. Respawn Entertainment has mostly perfected the interconnected level design from Fallen Order. As a result, Survivors levels make more sense to navigate and explore without feeling overwhelming. Where players need to go and what objects they can interact with or platform onto is clearer and more distinct, with each location having an equal level of polish that the previous game lacked (looking at you, Dathomir, and your many unjumpable platforms). Meanwhile, enemy placements are much more thoughtful and less cheap. In a game where Cal can lose more than a fourth of his health bar in a single hit, being able to better understand where enemies are coming from is paramount.Planets are split up into different categories. Linear planets like Coruscant keep the action focused and moving at a fast pace. Meanwhile, open plants like Koboh feature numerous dungeons, hidden bosses, shops and more. Theres a robust variety that encourages multiple run-throughs as Cal acquires more traversal abilities. Exploration is helped by a new Fast Travel system that simplifies going back to unlock new pathways. Customization has been dialed up exponentially. In Survivor, players have complete control over Cal and can customize his hair, facial hair, shirt and pants. BD-1 can also be fully kitted out with different parts and paint jobs. Of course, in true Star Wars fashion, you can still fully build your lightsaber with different pieces and blade colors. In a nice change from the status quo of taking months to release a New Game+ mode, Survivor launches with one from the start with additional bonuses available. So, while the story will end, theres still plenty to unlock and see in Star Wars Jedi: Survivor.The gameplay remains mostly the same, with players employing various saber strikes and Force abilities to string together combos and blocks and dodges to avoid incoming attacks. Like the previous game, Survivor borrows heavily from From Softwares Soulsborne formula, tasking players with studying enemies to devise strategies to tackle them and manage their supplies. It was fun in Fallen Order, and thanks to numerous quality-of-life improvements, remains fun in Survivor. An increased Force meter makes it more rewarding and useful to utilize the Force in combat, Perks allow you to stack different bonuses and accessibility options enable you to alter the difficulty to your liking. It all adds up to an experience far more fun than its predecessor, at least when the performance isnt dragging things down.Adding to the gameplay are the new lightsaber stances. The single and double-bladed stances return in addition to three new ones. The dual-wield stance offers aggressive attack options at the cost of defense. For those wanting a more attack-heavy stance, the crossguard stance trades speed for power. Finally, the Blaster stance adds range at the cost of strength but is highly versatile. Each stance is fun and injects a large amount of variety into combat. The system especially shines when dueling lightsaber-wielding foes. The stances are weighed down by a baffling design decision, though. Unlike a game like Ghost of Tsushima, which allows players to swap stances on the fly, Star Wars Jedi: Survivor only allows you to equip two and only allows you to switch them at Meditation Points and Workbenches. Its a highly-baffling decision that discourages experimentation and promotes choosing favorites. Rather than players organically finding solutions to combat scenarios in battle through instant swapping, the system actively pushes frustrating trial-and-error tactics.Star Wars Jedi: Survivors gameplay is overall more polished than its predecessor, but it still has a few issues, most relating to platforming. Little hiccups remain like Cal not properly grabbing onto grates or objects or too many actions assigned to one button and the game momentarily not performing the correct action. Despite these small issues, when caught up in a high-speed chase or dueling powerful Sith, Survivor truly provides a top-notch gameplay experience.Star Wars Jedi: Survivor made headlines when it was announced Respawn Entertainment would be focusing on current-gen consoles only. For the most part, Survivors presentation is beautiful, particularly in its strong environmental detail, wonderfully-detailed main character models, and the plethora of intricate lighting and destruction effects. Lightsabers, in particular, are breathtaking to behold as they light dark spaces, cut deep marks into enemies, and clash against one another. Despite this good look, the game looks decidedly last-gen in a handful of areas, particularly when interacting with NPCs. The frequent awkward standing, dead-eye staring and mechanical mouth animations are enough to distract from the otherwise current-gen presentation.What really hurts Star Wars Jedi: Survivors presentation, however, are the terrible performance issues that frequently pop up on PS5. The performance mode, which targets 60fps, rarely maintains a solid frame rate, instead dipping drastically during hectic moments to the point where it severely impacts gameplay. Survivor is a case where youll want to play in Fidelity mode, which does have issues, particularly in cutscenes, but does a much better job at maintaining its target fps. Star Wars Jedi: Survivor may look good, but its performance lacks polish.Closing Comments:Star Wars Jedi: Fallen Order built a solid foundation on which to build a sequel, and Respawn Entertainment has happily obliged. Star Wars Jedi: Survivor takes what worked in that first game and expands it significantly. Its bigger, grander and more ambitious, with a few trade-offs. While the story isnt as personal, the events feel more significant and have greater consequences for Star Wars as a whole. It also helps that the story remains intriguing and engaging throughout its lengthy campaign. The design is fair, with well-laid-out levels, enemy placements and plenty of incentive to return or start a New Game+ save. Gameplay is as fun as ever with quality-of-life improvements and new saber stances injecting additional variety to play around with. Unfortunately, some decisions forsake organic experimentation in favor of trial and error, and some elements dont feel nearly as polished as they ought to be. Its presentation is beautiful outside some last-gen-looking NPC interactions, but its burdened by a terrible technical performance that makes the performance mode nonviable. Ultimately, Star Wars Jedi: Survivor is a very good game with a great story, excellent design and fun gameplay, but hampered by a lack of polish and poor performance. It may not have achieved the rank of master, but Star Wars Jedi: Survivor is a true Jedi of the light side.", "date": "April 28, 2023", "grade": 4.0}