{"name": "Remnant: From the Ashes  Subject 2923", "ref": "https://hardcoregamer.com/?post_type=post&p=385458", "text": "Its more than a year now since Remnant: From the Ashes was first released and despite its AA-tier stature, Gunfire Games have managed to punch well above their weight. With its mix of third-person shooting, challenging combat and intertwining of procedural, roguelike-styled environments, its proven to be one of the most replayed, returned-to gameplay loops for some time. If ones recent accounted play-time of around fifty hours  and thats prior to the release of the latest, and final, batch of post-release content  at the time of writing is anything to go by, even with the evident limitations on budget and scope alike clear to see, it hasnt stopped Gunfire from carving out their place in a sub-genre that has arguably long been overdue. That sub-genre being the type of game, despite the desperate brandishing of wholly Souls-like this or wholly loot-led game that by some, aims to appease both these sectors whilst still providing a fresh twist on shooter-based RPGs.As the previous DLC, Swamps of Corsus, demonstrated well, Gunfire clearly had more ideas they wanted to bring into the fold. Ideas that werent simply new items to gather and collect, but in one instance an entirely new mode that went so far as to elevate the game as one you could so easily replay again and again. Anyone coming into Subject 2923  the final DLC with its allotment of new areas, new bosses and all the acquirable loot that comes as standard  expecting the same surprising longevity of an easy time-sink may come away somewhat disappointed at the lack of new and unexpected modes. But admittedly its a lofty expectation to hold. Though a few issues still linger and the players journey is met with the occasional, unflattering absence of empathy with the narrative, Gunfire once again invest in the areas that matter most. Delivering what might be the best variety of bosses and an even grander reason to invest a further eight to ten hours on one solitary run alone.Subject 2923 is as much a satisfying return into the world of Remnant as Corsus was a few months previous. While theres no meaty equivalent to the brilliant Survival Mode prior, 2923 instead offers up a sprinkling of well-placed set-pieces amidst its separate story campaign, away from the base games main tale. Set after the events of the main game, Subject 2923 has players returning to Earth  venturing into the abandoned Ward Prime under the pretense of uncovering the mysteries of what originally took place, as well as putting a stop to the antagonistic Root once and for all. While the DLC does eventually lead to new setting Reisum  which takes the form of a wintry, frost-covered world  its Ward Prime where 2923s prominent deviations begin to unfold in interesting ways. First and foremost, Ward Prime isnt procedurally-stitched together like all other environments previous. Remaining the exact same, multi-floor retreading of ones steps, no matter how many re-rolls the player instigates. Its here where a lot of the DLCs more interesting scraps of narrative and world-building are handled. Even if the delivery of certain tape logs can feel ham-fisted in their delivery. Alongside a couple of environmental puzzles and exploration for handy items, a gimmick that has you swapping between realities  and as a result putting yourself in harms way so to clear the way  does manage to wrestle away most of the tedium its premise can initially suggest. Aided in no small part thanks to the enemies introduced here and how their prowling, menacing demeanor actually gives Remnants latest update a welcome splash of horror vibes.Away from the shake up in tone  not to mention the momentarily nice spots of strategy involved with deciding when and when not to hop between dimensions  there are admittedly other parts where the new, temporary formula doesnt always work to the players favor. One part having you dash back-and-forth between two points to take out three nearby obstacles  an annoyance made even more cumbersome due to the fact you swap dimensions automatically upon clearing an obstruction. Even so, inflated the duration spent here can sometimes feel, for a game whose levels have been predominantly stitched together and assigned, its nice to find a reasonably-sized, non-procedural region to explore and work out. That said, Remnants and as such 2923s continuing enjoyment, does remain with the random dealing of what bosses one is dealt to take down or how particular journeys are structured. What objectives or side-quests one is unknowingly walking into or not as the case may be. One example being the complete absence of a barn siege early on in the DLC that requires you to fend off a lengthy wave of foes on first go. Only for it to pop up after an immediate re-roll of the campaign for a second campaign. And believe me when I say immediate, because Remnants suggestion of more bosses, more weapons and simply a reason to poke at the edges all over is not lost with Subject 2923. Granted, 2923s dungeons dont offer much the same tense, interesting slow-crawl of a stand-off that Corsus offered, but the challenge in pushing through the unrelenting horde of enemies (troublesome close-range and long-range attacks notwithstanding) still resonates.Not least when players are well into exploring the world of Reisum and you find yourself once more pressured into the umpteenth tactical retreat just as another round of enemies spot you. Backing away, all the while trying to take down the largest foe before you, whom is making its dreaded way toward you. Yes, larger enemies remain as enjoyable a nuisance as they were in the base game and add to this an addition of a new Frostbite ailment for those who once again go into proceedings confident in simply rushing through things, youre sure to be the first to die. Theres a minor criticism to draw in the fact that some of these encounters can still suffer from foes seemingly popping from out of nowhere directly behind you. The signatory audio cue more so a reminder to literally watch your back, let alone keep your head on a swivel. But if you manage to make it through the overworld and dungeons alike, Subject 2923 eventually revels (and justifiably so) in its best asset: its boss battles. Arguably the best roster of big-bads to take down  better even than the selection on offer in the base game  Subject 2923 puts greater emphasis on picking your shots carefully. A large majority of the total boss count, though fitted with armor so as to mitigate any suggestion of simply spamming ones way to victory, provide a reasonable amount of variation too on how fights generally progress and require of the player beyond shooting. One fight  whose boss figure is pretty much enveloped in armor  taking the form of a tense one-on-one in which players can go down in two hits if theyre not paying close attention. Another, not exactly the most original gimmick, has you fight two reasonably-protected enemies. One even having you sprint between safe areas, all the while requiring to not lose track of the other nearby dangers that, too, can kill you in a matter of seconds if youre not careful. Annoying, relentless, bound to incur a hefty number of swear words and hindsight of not having done x sooner, but all enjoyable because of both the task and the varied ways players will need to engage defensively, let alone go on the counter-offensive when the opportunity finally arises.Its unfortunate then that 2923s story, even just the execution of a tale to tell, is far from as exemplary as its gameplay is. While the more enthusiastic followers of Remnants lore and narrative ties will find a satisfactory amount to dig through away from its major cutscenes, 2923s narrative presentation in this regard remains awkward and isolated to the point where scenes meant to evoke a reaction, can only harbor confusion as to why any of it matters in the grand scheme. It doesnt help that 2923 introduces a character implied to hold relevancy and importance  on top of all the bundled-in exposition  but still feels restrained by the structure that said interactions are both fleeting and seldom impactful. You might remark that it makes it easier to jump back in and start over, but whether its a fault of Gunfires production scale or not, the closing scenes after conquering the final boss (a two-phase one at that) feel anything but as celebratory and as elation-inducing as they may want to suggest. Closing Comments:While its a shame that Gunfire Games havent worked out the best method in presenting a character-led story in this formula of game, it doesnt tarnish too much how enjoyable and tempting Remnant is to go again at its campaign efforts over and over. Away from the discoverable audio logs, expository lore and a few interesting areas to scout out to completion, by far the most compelling argument in favor of Subject 2923 no doubt lies in the new bosses offered up. Providing some of the best set-pieces and variations on what has come before, those who maybe felt a little down by the base games reliance on the same repetitive formula will be pleased to find a much better assortment here. An assortment whose perils pertain to more than the bosses themselves. If you can manage to ignore the shortcomings with its story and how limited in reach such scenes are, Subject 2923 stands as a great snapshot of why Remnant: From the Ashes should not and can not go unnoticed a year later.", "date": "August 24, 2020", "grade": 4.0}