{"name": "Relicta", "ref": "https://hardcoregamer.com/?post_type=post&p=384293", "text": "Few 3D puzzle games can stand alone before the overbearing comparisons to Portal begin to surface. Even if the core gameplay or the main gimmick underpinning it intentionally decides on maintaining as much distance between itself and such a coveted name, its an easy name to drop. But many forget, or simply dont realize, the extent of the reasons as to why Valves venture in puzzles is so highly regarded. For it wasnt just about the conundrums presented as to why the original Portal (as much its sequel, lest we forget) was as beloved as it was. Arguably a lot of its more memorable staying power lies in the aesthetic it posed, the story it wanted to tell on top and as a result, the suggestion that it, the game, was on some level aware of its own absurd premise. Amidst this strange environment and off-kilter tone, the only way to get to the bottom of everything going on was to complete a series of tests in one sterile, minimalist chamber after the next.In the past decade-or-so, many games have toyed with the meta-commentary on the genres absurd suggestion. The idea that a world, a story, can be told and resolved simply by solving puzzles one after another  as ridiculous an idea that would be if applied in real-life. Some have attempted to follow in Portals wake by making the writing, the narrative, as engaging as the puzzles. Others have aimed for a more straight-faced mystery or narrative with philosophical leanings. Some, however, have fortunately found a way to marry that aforementioned absurd idea of puzzle-solving with the very story its trying to get its players to reach the end of. With Relicta, that aim can often feel like a mesh of all three, but never one that truly shines in any department.To developer Mighty Polygons credit, as forgettable the main plot is and as barely-existent the implied roster of characters tries to present, Relicta still manages to ride out its rough parts and prolonged moments of exposition alike. As far from easy it is when the voice work is an unpleasant mix of overreaching emotion and literal line-reading that comes off off-puttingly amateurish in this regard. Characters themselves weirdly animated vocally in one part, deadpan and seemingly apathetic when emotion should be present in others. Another ironic scenario in which the AI character in the game demonstrates far more a human-like believability in mannerism than the implied humans whom are kept to distant voices for long stretches. Focus too long on the dialogue and it becomes easy to pull Relictas bare thread of believability apart. Take it away however  or rather, proceed into another one of the sequences of puzzles to tackle  and the game, thankfully, settles into a steady rhythm. Its a rhythm that, following a sequence of story beats it may do, still offers a sign that Relicta is in a way playing around with that same genre trope of resolving a story through a testing of some advanced, technological contraption. Theres even a brief comment early on from the main character about the needless investment in such an activity and while the game does bet more on the relevancy of its actual plot (and falters because of it) its at least welcome to see a game like this offering a passing remark on that same ridiculous premise. In a setting comprised of a terraformed moon where strange events are slowly unfolding, the best (or only) means of moving forth is by continuing with a similar rung of tests with the devices one has equipped.Naturally, the prime reason for this, is of course its gameplay and the means at which puzzle-solving in Relicta manifests. There are essentially two abilities  or rather, natural forces  players are given control over: magnetism (able to attract and repel alike) and gravity. Both of which are applied to cubes scattered  and in some cases, tucked away and hidden  amidst the many, closed-off puzzles players subsequently enter and can not exit without finding the correct solution. The general gist to most solutions, being the player getting a set number of cubes to their required destination, usually in the form of a button to activate or panel to hit, which in turn disables the final force field.As with most puzzle titles whose main apparatus are cubes or blocks of some capacity, though the premise may sound relatively simple and bordering on a touch basic, Relicta is another title that manages to inject a lot of these puzzles with a kick of unpredictability about them. Predominantly with the way gravity can be removed from a targeted cube and how the added question on friction comes into play. There are of course sequences that require perfect timing and the player having mapped out in their head the correct decision to undertake so as to avoid ruining the whole process. But what Relicta has in its favor is the possibly-unintended emergence that its physics-manipulation employs. In a way, players may often feel like theyve skipped a step or are perhaps finding the solution in a way the game isnt intending, because of these very mechanics. Getting a cube, for example, to float up onto a platform, even though they were meant to do it an entirely different way. While these methods can neither be deemed glitches nor a confirmation of multiple solutions (the end objective of disabling a force field is always present after all), theres still fun to be had when a more unorthodox testing of the physics manipulation is stumbled into, if not intentionally discovered. Perhaps its the peculiarly humorous sight of a gravity-less cube wandering aimlessly mid-air, where this distractive enjoyment stems from. It at least helps mitigate those moments of progression in Relicta where the additional elements introduced from one thematic, window-dressing environment to the next, dont always feel like that next, head-scratching dilemma one has to quickly adapt to and master.A small counter to this though is the fact the game spends little (if any) time drilling the specifics of each new component towards the player. Though some of these additions are self-explanatory  which goes back to the previous point on some additions not exactly providing as fresh a spin on puzzles later down the line  the show dont tell approach provides an effective means of instruction and as a result players will quickly get to grips with whats been added to on top. The only real spots of what you could deem as instruction, being for example, the pin-pointing of the start and end points in a drones patrol route. Said drone  another obstacle to both grasp and overcome  being able to nullify any magnetic property one applies to a cube or a nearby panel. Closing Comments:While Relicta does at least try to put in the work to help bolster the scale of its world with a story to support it and characters to refer back to, the end result is far from one you can take seriously. In no way helped by what is a rather clumsy and laughably-amateurish mix of inconsistent performances. At the very least, where it matters most, the focus on physics manipulation results in a good mix of challenge that, while not the most inventive or consistent of puzzle outings, still offers an occasional delight with how its more emergent puzzle-solving inevitably plays out. Though there may be better and more narratively-intriguing entries out there already, for genre enthusiasts focused squarely on the puzzles themselves, Relictas subtle self-awareness in its own pitch  as much the assortment of challenges on display  are enough to help it win out in the end.", "date": "August 5, 2020", "grade": 3.5}