{"name": "The Knight Witch", "ref": "https://hardcoregamer.com/?post_type=post&p=430901", "text": "The day the sky split open didnt turn out to be the end of the world, but that wasnt for lack of trying. The four Knight Witches had fought with strength and bravery against the corporate forces viewing the planet as a fully-consumable resource, and while they won the fight, the damage had already been done. The survivors moved underground to rebuild as best they could, living in the caves and slowly, over the next several years, creating a home that may have been missing a sky but was at least comfortable. With the past threats defeated and the future looking stable, it was time for a festival in honor of the worlds saviors, finally giving everyone a chance to have time to express their appreciation and also take stock of how far theyd come since most of the world was lost. It was supposed to be a day to relax and celebrate, but instead turned into a disaster that would require the fifth Knight Witch to grow into the power shed been too young to access in the original conflict.Rayne was supposed to be the fifth Knight Witch, but it hadnt worked out, so instead she got married and grew up. Shes still got power in that she can fly and fire a magical bullet, but that wasnt enough in the past and wont cut it for the fight ahead. The mechanical war golems have reappeared and locked the townspeople away, and this time Rayne is ready to be the Knight Witch she wished she could have been the first time around.The Knight Witch is a beautifully-drawn 2D metroidvania adventure with more than a touch of bullet hell. The opening section takes place at the end of the war, placing you in the experienced, powerful hands of the lead Knight Witch Robyn, wielding abilities that Rayne can wont be earning for a good while to come. While its easy to die in her fight with the Emperor, he goes down quickly once youve got a sense of how to use her abilities, and then the rest of the game is spent building Rayne up to Robyns level of strength as the enemies throw more and denser bullet patterns at you and the boss encounters turn mercilessly difficult. Rayne basically has four abilities, one of which is locked away until the second major area. First up, shes always flying, so The Knight Witchs approach to being a metroidvania is platform-free. Her standard shot starts as a slow-firing bullet that packs minimal punch and evolves over time into a somewhat-faster-firing bullet that still feels weak. The gun is supplemented by a small deck of magic cards, three drawn at random, that can be instantly fired off with the tap of a corresponding face button. Finally, when all else fails and the bullets are too dense, Rayne earns a short-range dash that not only zips through bullets, but also less-solid bits of scenery. The intro to the game, where youre playing as the full-powered Knight Witch Robyn, shows off how necessary the dash is, and while it makes a kind of sense to leave that ability until the bullet density starts ramping up, its still a frustrating wait.The gameplay flow once all the basic skills are acquired feels nicely satisfying, with a constant change between regular twin-stick style shooting and magic usage. The spells are powered by magic orbs, with Rayne having a low maximum number she can hold at a time, so even with a full gauge theres a decision to be made about the best time to use it. Enemies drop orbs often enough that you can usually top off the gauge after a well-timed spell, but spamming skills wont be possible. The huge areas are filled with enough enemies that good usage of the basic attack and dodging will eventually top off the magic, though, so a mis-timed spell probably wont cause much pain. The only real knock against The Knight Witch, in fact, is its difficulty level, which can feel unfairly punishing on a regular basis. Youll need to come to terms with boss fights and trap rooms that require rethinking the spell loadout on a regular basis, and also be fully aware of the tricks of each ability. The giant axe, for example, does a full-circle swipe that does heavy damage, cancels all bullets it comes in contact with and also swipes through walls. The scimitar, on the other hand, is similar except it swings around for a few seconds before the effect ends but doesnt cancel bullets. The spell that reflects bullets back to sender doesnt have the same area of effect as the one that simply cancels them outright, and the spells that change Raynes attack for a few seconds all have their advantages as well. Its possible to get through everything by knowing what the abilities do and when to use them, but the endless trial and error against rooms packed with merciless attackers can feel overwhelming at times.Even once youre familiar enough with the spell cards to use them properly. the magic system isnt suited to the type of bullet-hell action The Knight Witch throws at you. The problem is that the three spells drawn at random from your chosen loadout are displayed in the lower-right corner of the screen. Tap a face button, fire off a spell works great in theory, but when youll need the ability the most is frequently when the screen is too busy to check which cards are available. Theyre all designed to be easily identifiable even if youre only getting a reading from the corner of your eye, but even so its easy to fire off the wrong ability. A bullet hell needs to have fully-predictable controls so your hands can do their job with as little input from the conscious part of the brain as possible, and needing to divert attention to read a vital ability works against that.Everything else about The Knight Witch is truly fantastic, though. Raynes story is well told, filled with a great cast brought to life with wonderfully-drawn 2D art. The levels look just as good, nicely detailed and populated by a good variety of enemies firing bullets and other attacks in multiple patterns, and also filled with an impressive collection of secrets and optional challenges that award new spell cards or rescued villagers. Technically not all the map needs to be fully explored to beat the game, but the rewards for looking everywhere always feel like theyre worth chasing after and that last boss wants every bit of power you can throw against it. Closing Comments:The Knight Witch is excellent in a lot of ways despite its forbidding difficulty, the kind of game youll be glad to have beaten even if the journey to completion is sometimes a bit much. Raynes journey from coulda-been to savior goes through a number of twists and turns, the metroidvania levels are filled with a great amount of variety, and other than the occasional trap room that locks you in, the choice to shoot everything or zip on past is rarely taken away. The sky is broken and the underground is getting more dangerous than the anyone is comfortable with, but the survivors have a new knight witch to pin all their hopes on. It just may take a few dozen more respawns than expected to reach The Knight Witchs conclusion.", "date": "January 3, 2023", "grade": 3.5}