{"name": "The Mummy Demastered", "ref": "https://hardcoregamer.com/?post_type=post&p=276523", "text": "Video games and Hollywood have always had a contentious relationship at best. Exceptions do exist, but theres an extensive history of converting extremely popular video games to film and big budget Hollywood blockbusters to video games with craptacular results. The past summer the newest Tom Cruise vehicle was inflicted on the masses and it was called The Mummy. This film was trashed by critics and was a box office flop. Several months after the fact, possibly to coincide with Halloween and partly to put distance between the game and the films failure, this mummys tomb was raided to produce a game called The Mummy Demastered. Perhaps the thought process of converting this unlikely candidate into a game was considering a movie that is universally accepted as bad can be turned into a good video game. Considering how many good movies have resulted in bad games, this isnt the craziest idea, but the question remains is The Mummy Demastered fit to be among the pharaohs treasures or is this game part of the curse that is inflicted on the world when a pyramid is raided?The Mummy Demastered is a 16-bit style metroidvania, but contravania seems like a more fitting moniker. Maybe controidvania since it does have some Metroid qualities, but were splitting hairs at this point. For those who like this style of game but saw the incomprehensible mess that was the film, your fears may be laid to rest because it has only has a tenuous connection to the film. When the game begins we are in the familiar tomb from the film, but we are not stepping into the shoes of Nick Morton, but instead we are a nameless Prodigum Agent who looks like he takes his fashion cues from the Cobra Commander. Henry Jekyl is still giving the orders, and due to the large amount of giant bugs there are to battle, its a safe bet the early scene where Chris Vail gets a bit trigger happy with the machine gun and camel spiders was instrumental in the games development. But aside from the scenery, Henry Jekyl and Ahmanet raising the dead and making life generally difficult for everyone, The Mummy Demastered follows its own path away from the film, which is cause for much rejoicing. The Mummy Demastered seems more like an homage to 8-bit and 16-bit games than the film it takes its license. Maybe this was the original plan from the inception of The Mummy reboot or maybe the game tie-in development budget took a hit due to a disappointing gross from the film, but whatever the reason, this is the best thing to come out of the film. The influence of games from the Castlevania, Contra and Metroid families are absolutely shameless and that plays into the greatness of The Mummy Demastered. Its a classic metroidvania formula with some contra flavoring thrown in for good measure. Bats, ravens and skeletons with an unlimited supply of extra bones to throw at the agent are lifted straight from Castlevania. The life bar and number system is straight out of Metroid, along with the general aspect of having a large nonlinear area to explore with inaccessible parts that become open after acquiring certain items. To give it a unique twist, Contras run and gun action is thrown in. There are other guns to add to the arsenal and switch out such as an assault rifle, shotgun and flamethrower, but there always is the trusty machine that Dr. Jekyl assures you has unlimited ammo, unlike the other acquired guns.During the course of the game several different locations will be explored including underground tombs, forests, deserts, caves, Londons subway system and a clocktower level that might be an intentional nod to the ones in Castlevania. Dr. Jekyl maintains communication with the player during the game and offers some guidance to the next objective. Finding a helicopter serves as a quick travel function where the player can use this to travel to the different helipads marked on the map. As per the formula commonly used with this particular subgenre of games, different items will be collected throughout the game and allow the player to access new areas. Grenades can destroy weak walls, at some point the player will be able to grab onto the ceiling and travel along that and there is some rappel gear to travel down into the deepest abyss just to name a few of the contraptions that are waiting to be discovered. Basic gameplay is a lot of 2D platforming and a lot of gunplay. Aside from the brief dialog sequences, the player will probably have their thumb on the fire button for the majority of the game. The default machine gun does have unlimited ammo, but based on the amount of shots required to take down bats, birds, bugs and zombies it probably fires rounds that are a comparable caliber to the Daisy Red Ryder. Thankfully the game is pretty generous with health and ammo drops. A nice feature is holding either of the the trigger buttons will lock the agents feet in place so he can aim in any direction without moving. The platforming action is very old school with floating platforms that move on their own volition and taking a hit at the wrong time can send the agent falling quite a distance, requiring a tricky jump sequence to be attempted multiple times. Standard enemies are resilient to damage but generally arent a huge danger, but the boss enemies take up a lot of screen real estate and can provide a dangerous encounter. Dying is generally not advised in any game, but death provides an interesting challenge in The Mummy Demastered. Like the movie, dead soldiers can come back to life and pose a threat. Should the player die, their extra equipment is taken away and they are left with just the default rapid fire Red Ryder. The player will need to return to their place of death and fight an undead solider to get their equipment.The title kind of gives it away, but the graphics of The Mummy Demastered are 16-bit styled 2D glory that come with a gameplay style and memorable chiptune soundtrack to complete the 1993 ensemble. The controls are quite responsive, simple in their layout but cooperative enough that when the player has to repeat a platforming challenge because a giant locust knocked them several screens down getting back to the falling point is easy. Closing Comments:Aside from the simple fact it exists, the biggest surprise about The Mummy Desmastered is that its actually quite good. The formula to the success lies in that it built itself from a movie that doesnt have a large passionate fanbase and distanced itself from the source material. Following the film closely would make for a bad game, which can be said of most movies. The developers used the film as a basis but patterned the game more based on some of the best action games from a couple decades ago. What we end up with isnt the most groundbreaking game in the world, its quite derivative of popular games that came before it, but because of this we have a fun title that managed to beat the odds for being good despite being licensed from a movie. Whether you loved the The Mummy or viewed it as a cinematic plague of locusts, The Mummy Demastered was a worthwhile find inside that tomb.", "date": "October 24, 2017", "grade": 4.0}