{"name": "Othercide", "ref": "https://hardcoregamer.com/?post_type=post&p=383818", "text": "The Veil between worlds is thin  a nightmare is brewing. A lone warrior stands between the forces of Suffering and humanitys survival. Try as she might, this warrior is one against many and Suffering overwhelms her. In a last ditch effort to continue the fight, this warriors spirit lends its energies to soldiers who will continue the fight. This is where an army of this warriors echos, or Daughters, must be led in epic fights in the Othercide. This turn-based strategy title takes the genre and thrusts it towards new and refreshing heights with its dramatic aesthetic and unique gameplay mechanics. All of these components come to fruition in Othercides complex narrative and deep content. There is little the title doesnt do correctly and instead presents itself as a refreshingly original work that entices players to return.At its core, Othercide is a a turn-based strategy title that marries XCOM gameplay with Dark Souls aesthetic. Inspiration is all it takes, however, as Othercide has its own identity and style. We get a sense of this identity as soon as the game begins and it permeates through every pixel. Its a hauntingly stylish game with a grey-scale palette and Gothic artistry. The titles art direction is a remarkable feat that helps set the tone for the overall game. Stoic warriors fighting inter-dimensional, Lovecraftian demons looks just as epic as it sounds. To help add to the world-building, the Mothers memories are able to be unlocked through gameplay for a deeper look at the world of Othercide. These memories also play into the games mechanics seamlessly for a fully-realized concept. Othercide blends various gameplay mechanics together to create an original experience.Combat may be turn-based, but the title also make use of rogue-like elements to keep players always learning and thinking. Othercide prides itself on being a hardcore game  even giving a disclaimer at the beginning that we are supposed to die. While Ive heard this from most games like it, one of the most important tests to stress is if hardcore means adequately challenging or if it means hardcore just because we can. Difficulty is important to assess when looking at a challenging title. The secret to this soulsborne mentality is to create a work that allows players to see improvement and growth from one run to another (if not, this is when controller throwing happens). Its not easy to die over and over, but it may even seem worth it if the rewards are ample. Othercide understands this well and is prepared to set players up with never-ending progression regardless of success or failure. While a time may come when all of your Daughters are obliterated in battle, the title still rewards progress with unlockable modifiers and special currencies for upgrades. Each run-through in Othercide is counted by Recollections. Each Recollection is measured by how many days the Daughters last in their fighting. These days are usually broken down by weeks and each week comes with its own special missions and boss fights. After beating each boss during the week, we move forward with a new era of the Othercide. Progress can be kept track of in a main hub menu that allows missions to be selected and Daughters loadouts to be customized. This is where management efforts in Othercide become key. To keep Daughters in top shape, their skills, stats and traits must be managed.Each Daughter can be curated to have special skills chosen as they level up  these skills can even be upgraded by attaching Memories to them that may modify mechanics like critical chance or attack power. Daughters may even acquire traits in battle that can affect their stats. This could also be important when sacrificing a Daughter to regenerate another  as Daughters lose health in battle, the only way to heal them is through sacrifice. This leads to difficult decision making as you may need to say goodbye to a favorite in order to save a key player. Not all is lost, however, as Resurrection tokens can be obtained that allow Daughters to be brought back from the dead. This was an especially useful feature after I sourly watched a favorite Daughter meet her end in battle. These are a little harder to come by, but the game doesnt make it impossible. The currencies needed to buff and resurrect units are reasonably obtainable in missions while still creating a challenge. Vitae is used to create new Daughters and add Memory buffs to skills. Shards are used to activate Remembrances that are bonuses added to save files (for example, Daughters dont have to be born at Level 1, you earn more currency per battle, you can skip certain weeks, etc.). Because so many resources actually carry over from one run to another, it may even be beneficial to fail in some cases. A single save file will store all your past Daughters, so theyre never truly gone. This also means they can be brought back as stronger players in the early game. The Mother was the ultimate warrior who was master of all classes. After being defeated in battle, Mothers spirit gives life to the three classes of Daughters. The beauty of Othercide is the tactical freedom had to mix and match teams for battle. Yes, theres a gorgeous balance in having one Soulslinger (range), Blademaster (striker) and Shieldbearer (tank) on a team. Each one of these classes compliments the other well in a reverse rock-paper-scissors. The true test for this freedom was to see if a team of any design could be successful. After testing with various loadouts, I did find it possible to successfully complete missions with dozens of team combinations. As a gamer whos always been obsessed by tank classes, it was a joy to be able to make a team of three Shieldbearers and one Soulslinger. The game is masterfully balanced so that all team combinations are feasible so long the player steps up to the strategic challenge. Theres only one difficulty in Othercide: hard. The game makes it deliciously easy to build tactical combos from your Daughters, though. For example, the Soulslinger is able to interrupt enemy attacks when a nearby sister is in danger. This reactionary shot then triggers another Soulsinger on your team to attack an enemy in range that has been dealt damage by a Daughter already. It becomes an intricate domino effect if you can time it correctly. While Daughters have limited skill lists that can be customized, each of their skills work in nearly endless combinations with one another. It becomes increasingly exciting as a player to learn how to put these pieces together. Understanding how skills chain together becomes the key to successfully progressing in Othercide.Where we see Othercides strength and beauty is in its battle play. Units are set on a grid and move similarly to XCOM, but this is also where innovation in gameplay is seen. The title uses turns to determine which units go next, but all units on the board are subject to the unique Dynamic Timeline System. All active players are at the mercy of initiative that could be affected by attacks and abilities. The timeline dictates turns, but it also adds an extra layer of strategy as players must now play the board and the turn order. This means utilizing Daughters skills effectively to make the most of a turn. Perhaps youre able to stun enemies out of their place in line or can buff your Daughter to cut an enemy in the queue. If you know a powerful enemy is going next, this could be a good chance to trigger combo moves from Daughters. Using an initiative system like this gives the title a refreshing mechanic to set it apart from other turn-based titles. The fluidity of gameplay is commendable as whatever action desired can be performed as long as the Action Points (AP) are available for it. For example, a Daughter could attack first, then move, then attack again if she has the AP available. Othercide truly puts the strategic freedom in players hands without confining them to one kind of attack pattern. Its a title thats adequately challenging without being tedious or time-wasting. Closing Comments:Othercide blends beloved elements of turn-based strategy with its own unique brand of style and gameplay. A gorgeously macabre world awaits players with its stunning art design and intuitive mechanics. While early developer bugs interfered with smooth gameplay, the title deserves its praise. Othercide is a refreshing experience that contains deep content to explore. Innovative gameplay mechanics help drive an intriguing narrative forward while staying true to its own flavor. Othercide works so well with all these intricate details because it holds a classic blueprint at its core. As I played, I couldnt help but notice how chess-like the title is. This is perhaps why its gameplay is so strong because it forces players to make similar moves and sacrifices. Othercide is a masterfully-created strategy title because of how it encourages players to think several steps ahead. It pushes players into difficult spots as a way to confront difficult decision making  there may be times when you have to make the choice to wipe and start all over again. Its a title that offers deep content beyond the scratched surface. Othercide may challenge you harshly, but it also adequately rewards your perseverance.", "date": "July 27, 2020", "grade": 4.5}