{"name": "Destroy All Humans! (2020)", "ref": "https://hardcoregamer.com/?post_type=post&p=383778", "text": "Its rare when a fifteen-year-old game gets two different HD remasters for the same console, but thats exactly what happened to Destroy All Humans! Originally released for PlayStation 2 back in 2005, Destroy All Humans! got the HD remaster treatment for PlayStation 4 back in 2016 which can be read all about here. Less than four years later the title gets a remake which the very existence of such a thing does seem strange. Destroy All Humans! (2020) is at its core the same game were familiar with, but unlike the 2016 version that only offered cosmetic changes to usher Crypto-137 into the HD era, this new version makes changes to the gameplay.The plot of Destroy All Humans! (2020) naturally remains unchanged but for the uninitiated it involves an alien invasion with little green grey men who do not come in peace. The Furon DNA necessary to obtain immortality through cloning has been degrading over time and the aliens need to get a fresh batch in order to keep this operation running. After the capture of Crypto-136. the next clone in line, Crypto-137, is sent to Earth to harvest a copious amount of human brains as they contain Furon DNA in its purest form. This premise didnt make a ton of sense in 2005 and the passage of time hasnt enhanced it, but it does provide an excuse to run around earth destroying property and collecting brains from your slain enemies so it falls into the good enough category.Unlike the 2016 HD version, significant changes were made to gameplay which actually makes the game much more enjoyable and somewhat easier. Part of the difficulty in the original Destroy All Humans! was from Cryptos limitations which have been reduced in this remake. To even the odds against the swarms of police, military and Majestic agents Crypto can use psychokinesis, brain extraction and his Zap-O-Matic all at the same whereas in the original he could only use one weapon at a time. Brainwashed humans who are armed will now shoot their former allies to protect Crypto, and when Crypto assumes one of their identities for a disguise he can now jump while using the Holobob. Cryptos jetpack has been streamlined for smoother air travel and hell eventually be able to dash around for faster travel and easier dodging. Additionally, the available upgrades for Crypto and his saucer has increased from 18 to 66. The game difficulty level feels comparable to the original as far as enemy toughness, aggressiveness and AI, but supercharging Crypto does make taking out the human enemies easier in addition to increasing the level of on-screen chaos and destruction. A few other changes were introduced to the remake of Destroy All Humans! Missions now include optional objections that dont seem to net major rewards if theyre completed but do add some fun challenges, such as using psychokinesis to destroy a building by using a human. The cutscene graphics have been enhanced by using motion capture to improve the character models. The dialogue is comprised of the original audio tracks but have had the sound quality enhanced through studio magic. Theres an additional mission included in Area 42 that was based on plans from a mission that was intended to be in the original release but ended up on the cutting room floor. The HUD has also been completely revamped and looks much better than the original version and the Trophy/Achievement list is completely different from the 2016 version.Aside from those enhancements, this is the same Destroy All Humans! thats been previously available. As such, much of what has been said in reviews of the original version applies to this one. The satirical take of 1950s America and McCarthyism confusing an alien invasion with communism holds up and almost seems even funnier today in light the social political climate. The humor of Destroy All Humans! remains effective, which is in part thanks to taking place in the 50s and using general approaches to humor instead of relying on topical humor from 2005. Mistaking cows for the dominant lifeform on Earth with their profound thoughts still generates a chuckle, and referencing a Hollywood icon like Tommy Wiseau James Dean is noteworthy regardless of what generation someone is.Having played both the original Destroy All Humans! and this current remake, as much as saying this is considered heresy in some circles (especially film), this version is an improvement upon the original. Destroy All Humans! was always a fun Grand Theft Auto inspired game with an extra terrestrial twist but the gameplay enhancements here make it feel more contemporary. It does require more dexterity, but having a group of soldiers caught in the Zap-O-Matic while ripping the brain out of someone else while levitating an explosive oil can to drop on the group makes Crypto feel like a powerful force, unshackled by the more limiting design choices in the previous console generation.On a technical end Destroy All Humans! doesnt have any major issues. The graphics look like HD versions of PlayStation 2/Xbox character models but cleaned up and improved to look passable on HD monitors. Theyre much improved over the original version but its easy to spot that this is an enhanced 2005 game. Psychokinesis is the only element of controlling Crypto that could have been benefited from more streamlining, but aside from that the controls are tight, which makes some of these new abilities that much more enjoyable to inflict on the humans. Closing Comments:Destroy All Humans! is a rare example of a remake that changes just enough to maintain the essence of the original while improving the overall experience. The gameplay enhancements give this a more modern feel but it maintains the original story and visual style to appease those seeking a nostalgia fix. Destroy All Humans! was always a fun game though hasnt aged all that well. This version revitalizes the title, changing just enough to make revisiting Area 42 a worthwhile invasion.", "date": "July 27, 2020", "grade": 4.0}