{"name": "Panzer Paladin", "ref": "https://hardcoregamer.com/?post_type=post&p=383395", "text": "Several decades ago the world had no idea how to handle aggressive religious infestations. Demons, angels and assorted deities were dealt with by a number of options that ranged from school girls transforming into makeup-based heroes to teenagers getting the half-human/half-divine or -demonic treatment. Then came Neon Genesis Evangelion and we learned that the only effective solution is giant robots. Why go toe-to-toe with the mystic/demonic/deific when you can hop into the cockpit of a massive heavily-armed construct and meet the threat on even terms.The attackers in Panzer Paladin are a demonic army that arrived when giant weapons rained down from space, hitting seventeen areas around the world and releasing a horde of minions backed up by the weapons masters. While humans can be corrupted by the demonic essence, the pilot Flame is an android and therefore immune. Flame is a female-shaped robot with killer 80s-anime hair, and while capable in her own right, she pilots the mecha-suit Grit, which expands her powers immensely.Grit is a Paladin-class mech, capable of wielding any melee weapon it can get its hands on and making due with a strong punch when nothing else is available. That doesnt happen often, because weapons are plentiful and you can carry four at a time, but there are reasons you might end up unarmed. Each weapon doubles as a spell, for example, giving abilities such as healing, offense and defense up, lightning and beam attacks, and many more. Theyre also breakable, with a meter that slowly goes down the more you pound on enemies with them. Sometimes its good to use a favorite weapon right down to the last possible hit before blowing out the spell and other times its common enough that it doesnt matter much if theres only a few lines taken off the durability meter. Saving a Large Heal spell until the last second is a great way to lose a life, after all. Theres no shortage of weird monster enemies, and while most go down in a single hit, theyre still more than capable of whittling down Grits health bar to nothing when enough of them sneak through its defenses. The side-view run and jump and attack action is simple, backing up Panzer Paladins 8-bit style, but there are enough different enemy types mixed together in deeply unsafe environments to make the simplicity a positive. Grit has a high and low attack, and when not attacking holds out a shield to block enemy hits. Attacking down while in mid-air does a downward stab (which is particularly entertaining when wielding a hockey stick, which is just about the non-stabbiest weapon available) while an upward thrust gives a little extra height to a jump. Its not uncommon for a short stretch to have enemies that need all these abilities at once, with spiders on the ceiling and weird pink cow-pie with eyeball in the center things walking the floor. Other enemies may need a couple of hits to take down and theyve frequently got shields just like you. Thankfully an advance technique means that if you strike at the same time you block a hit the enemy freezes for a second or two and may even drop its weapon.While Grit can pick up anything an enemy drops, Flame is human-sized so those are a bit large for her. At any point Flame can hop out of Grit and each level has both regular sections and a secret or two that require something smaller than a giant robot to access. She comes equipped with a laser whip, not as strong as Grits weapons but capable and with excellent range, and it doubles as a grapple to swing over pits. She moves somewhat faster than Grit, whos a bit lumbering and stiff, but both of them react exactly as youd expect after a little getting used to their move sets.The first few times going through a level can feel like a war of attrition, but each new attempt makes it a bit easier. The problem is that, when you know what to do, getting through a level is a great time, but the first run or two usually feels like being punished for a test there was no way to study for. Checkpoints can be far apart and falling into one of the many pits is an insta-death not matter how much health you had going in. A little exploration turns up plenty of hidden weapons in the walls, but after a death theyre gone, not respawning, and you only revive with what you had in hand. This usually means that, if youre low on weapons when dying, youre even worse off on revival. Enemies can drop random weapons but its not guaranteed, so its a little too easy to end up with nothing but a punch rather than the nice ranged swords, clubs, and spears that are the normal armament. It only takes a single fall into a pit because a platform youd never seen before moved when you werent expecting it to, causing a several minute reset back to the levels start except with fewer lives and weapons to reach for the Exit to Main Menu, Exit Game, Screw You feature. The checkpointing is true to Panzer Paladins 8-bit roots, sure, and death is a learning experience, but being punished for taking a hit mid-air that kills all momentum and then dropping like a stone into a bottomless pit teaches me that I dont want to be doing this. Closing Comments:Im hoping Panzer Paladin gets ironed out post-release because despite the above paragraph, the game is a huge amount of fun when it works. When you have a decent sense of the levels challenges theres no reason to ever take a hit, and building just the right loadout from weapons found on the fly leads to enough decision-making that your brain always has something to consider. Sure, the short sword might have no range, but if its got a good healing spell attached maybe its worth taking up one of the weapon slots. Beating on monsters while keeping an eye on the durability gauge, waiting for the moment to swap out or use the spell, does a great job of keeping the action from being mindless. Even if it was all-action/no-brain, Panzer Paladins retro-look is bursting with style in a way that other NES-throwbacks frequently miss. Theres a lot to love here, including harder remixed versions of the levels and a speed-run mode, but its mean-spirited death penalties mean you have to work for it.", "date": "July 21, 2020", "grade": 3.5}