{"name": "Rock of Ages III: Make & Break", "ref": "https://hardcoregamer.com/?post_type=post&p=383351", "text": "A common thread running through many of the reviews to Rock of Ages II: Bigger & Boulder was the feeling of a solid second outing. Solid being the operative word there; a sequel that despite its problems and recurring frustrations managed to ride out its rough waters. Thanks in large parts to a returning mix of quirk and short-bursts of effective gameplay. That this wasnt a case of its criticisms being some minor facet, but rather the shortfalls were prevalent, yet the best of moments were always there to help steady the course. It mightve been a sequel everyone neither expected nor asked for  one that took almost six years to the day to reveal itself  but when it comes to a third installment, that same excusing of familiarity seldom pays off a second time. For those coming into ACE Teams third entry Make & Break  having already delved in that same oddly-enticing fusion of Marble Madness-esque action and tower defense strategy  the question will likely revolve around improvement.The foundation may be present, persistently absurd a premise as it always was, but for what reasons does this third game exist? Other than mere continuity for continuitys sake. Of what is, as stated, a solid-enough crack at a series-long IP. You might think, by contrast, that the perception would be more on the forgiving side for those having never played the previous two games. That ACE Teams obsession with Monty Python-esque absurdist humor could, again, be enough for the shortfalls to wind up drowned out by snickers at such ridiculous set-pieces. That this tone, sitting alongside the equally-surreal mix of genres on show, would create a majority share of positivity in playing either alone against the AI or one another online.As someone having sat in that latter camp prior to touching Make & Break, I may end up speaking for a large swathe of fellow newcomers when I say ACE Team (in collaboration with assistant team Giant Monkey Robot this time round) have replicated the same experience in their third entrant. For better, and sadly, for worse. There are still the novel variations on what is a relatively simple premise of rolling a sphere to an end goal. The idea that its not always about knocking your opponents fort down, that this concept can also extend to such a thing as a race, a score challenge. Even the precariousness of deciding whether to invest in defensive measures on your opponents track or in fact rush in first to beat your opponent to the punch. All the modes that made Rock of Ages core gameplay interesting enough with its variations return with as delightful a mix of devious course design and type of objective alike. And while the interface still lacks that much-needed cosmetic make-over  with a touch of frustration as to what exactly is being highlighted sadly coming a little too much to the forefront  a significant amount of Make & Breaks familiar simplicity is so often forgiven. Partly the reason for this is the way the game continues to compartmentalize what it has on show. In doing so allowing the player to go about the modes they enjoy the most at their leisure. While theres a single-player campaign of sorts to partake in  and many a surreal encounter between numerous historical figures  which requires you to take on the main events if you will, theres no incentive other than earned stars to partake in these. And given the requirements for unlocking new levels  as well as additional defense/obstacles to use in the tower defense moments  are reasonable, Rock of Ages III: Make & Break makes the right call in letting players indulge in the game modes that are to their own fancy.It isnt long after kicking off the campaign that you could, theoretically, jump all the way to the end of the games figurative timeline and take on the challenging Humpty-Dumpty courses. Courses that, for all intents and purposes, are more like menacingly-precarious, 3D platforming stages disguised as Rock of Ages levels. Doing so means you run the risk of potentially missing out on those modes you wouldnt otherwise give a chance and its worth even just taking a quick glance of the tower defense objectives. After all, its genuinely surprising just how well it integrates the necessity for both short-term and long-term tactics  namely the way already-plotted ground cant be used again after an obstacles destruction. But even if your early hours in Make & Break are spent only on racing an AI-controlled boulder to the finish or only playing the delightful skee-ball challenges  wherein you can go long stretches without ever having to install a single defensive mechanism  theres just enough charm and risk:reward questioning of ones tactics to keep the sparse surroundings and repeated presentation style from feeling too tiresome. A feeling that naturally increases should you detour into the optional, community-made levels. Whereupon the use of elevation, corners and frustrating obstacles to avoid at all costs is strangely more intriguing than a lot of what the main base game attempts to offer as a semblance of challenge. Which leads me onto one of the main and sadly returning complaints with Rock of Ages going into its third game. And thats the inconsistent interpretation of challenge and how AI opponents go about attempting to beat you over the many objective types. Or not attempting as is so often the case; one minute the AI can make the exact correct turn around every corner  and can so easily avoid the many traps and defenses youve installed to protect your own fort  the next theyre not even attempting to put up even a semblance of a fight.Regardless of what difficulty setting you select, the AI can bounce from master to laughable amateur without any notice, it does admittedly take away on occasion from the delight of victory. That is if youve even managed to figure out how you go about achieving victory in early parts; once again, Rock of Ages does a poor job at easing newcomers into the many ideas on show. What should be a providing its players a significant tutorial for each of its game modes, other than the prime tower defense moments at the start of the campaign. Or at least enough of a tutorial that allows players to ease into proceedings before theyre unknowingly thrust into rolling or planning accordingly without so much as a basic set-up. Worse, when the game genuinely tries to invest in some weird, oddball objectives namely with its quote-unquote boss battles, Make & Breaks execution comes off half-hearted. More interested in the wild antics of the set-up (and of its stop-motion, collaged aesthetic) but never on the ease at which players control the action on-screen. One boss encounter  a blatant reference to Mortal Kombat  plays out in such a clunky and clumsy way it works against what is a rather sufficient parodying of that series presentation. Closing Comments:Three years ago, Bigger & Boulder sought forgiveness in its shortcomings by repeating its originators quirks. As infectious this mix of arcade-like objectives and strategic conundrums still is with the third game, its harder for those same cracks in the foundation to be so easily ignored a second time. Thats not to say that the short-bursts of challenge are in anyway less enjoyable and its fortunate to see ACE Team refusing to rail-road its players down a strict progression of mandatory objectives, regardless of whether they like all game modes provided or not. Rock of Ages appeal still lies in its basic premise and of the entertainment (as much triumph) one finds in reaching a levels end, no matter the true goal. Disappointing it may be to see the same infrequent defining of difficulty  as much the over-reliance on visual gags at the cost of gameplay variety where it matters  Rock of Ages III: Make & Break still manages to entice, but not impress. At the very least, ensuring players will gladly once again come back for another roll down a winding level or two.", "date": "July 21, 2020", "grade": 3.5}