{"name": "High Hell", "ref": "https://hardcoregamer.com/?post_type=post&p=276590", "text": "Those of you who can remember the time of eons past known as May of 2017 should be able to recall a little first-person shooter by the name of Strafe. It was a retro-styled game published by Devolver Digital that was designed to be a throwback to the likes of Quake, and while it had its issues, it was still quite the memorable game indeed, with plenty of fast-paced, old-school action. Well, Devolver are back with a new FPS, this time showcasing High Hell from developers Terri Vellmann and Doseone, trading in the far reaches of space for a comedic corporate Hell on Earth, and losing the roguelike elements in favor of quick but difficult levels, all while keeping similar retro elements. So can we get another memorable blast out of blowing suit-wearing demons away?Being a game designed to evoke the spirit of games from the early to mid-90s, High Hell isnt exactly big on plot. Youre a lucha libre-masked saboteur sent in to topple the diabolical and demonic corporation known as Pitchcorp, infiltrating a series of high-rise bases and sticking it to them by perform such acts as blowing up statues, sabotaging equipment, killing high-ranking officials, and maybe dicking over the employees by shutting off the wi-fi. There are interactive cutscenes in between levels, but they tend to consist of non-sequiturs such as chucking corpses into a ball pit, stabbing wieners moving across a giant grill, or leading a group of devil employees in weightlifting exercises. They add nothing to the story, but they do showcase one of the games biggest strengths in the form of its twisted sense of humor.Gameplay-wise, things are quite simple. At the beginning, you acquire a soul-sucking shotgun that shoots an infinite supply of lightning-fast lasers, and its the only weapon you have for the entire game. However, thats all you need. Regular enemies go down in one hit (save for some minigun-wielding mofos, which take three), but they come at you fast, aggressive, and mostly in groups, meaning you have to have sharp reflexes if you dont want your health drained quickly. But in a twist, enemies you kill do restore a bit of health via the souls you take (unless you can also find a battery that provides full health, which you really have to hunt for at times), meaning that as long youre careful and have the skills to pull it off, you can always come back from a devastating blow.Unsurprisingly, High Hell excels quite a bit in the action area, in case you couldnt tell. The controls are nice and simple, and every door you kick down, enemy you blow away, or piece of scenery you wreck has some real kick to it, allowing you to leave scattered remnants of ragdolls and props in your wake. Like a lot of similar games, the catharsis level is nice and high, especially once you master a way to make it through a particularly challenging area. Yes, things are nice and Nintendo Hard here, to the point where even the slightest hesitation (such as, say, snapping a screenshot for a review) can lead to instant death, leaving you to restart the level. Yet even with the challenge, things are nice and fairfor the most part.There are some issues with the AI at times, mainly when in comes to figuring out when an enemy can or cant detect you. At times, this led to still figures partially seen around a corner or a good mile away, which you can pick off with ease. Other times, enemies seem almost psychic, to the point where you dont notice the crumb in the the distance with the laser sight pointed on you until its too late. You can also sometimes pick off a few foes simply by sticking your head into a room, going out, and picking off the red-headed cannon fodder as they come out. But then again, thats just one of my preferred methods, and I questioned if I wasnt actually going against the spirit of the game at times.See, as many have noted (including us), High Hell does resemble a 3D Hotline Miami at times. The goal is to be quick, brutal, and rowdy, running circles around enemies while ducking in and out, bashing down doors with sudden attacks while you and your enemies can get taken down easily, and failure results in almost-instant restarts, like in Dennatons classic. And when it comes to replicating that style of gameplay, High Hell succeeds. It helps that the levels themselves are incredibly well-designed, featuring a nice amount of routes to take (especially in later stages) and a good variety of enemies with different attacks, including some mini-bosses and bosses that require a bit of puzzle solving in order to expose their weaknesses.The real highlight of each level, though, is just how much you can discover in it. You do have your side objectives, such as wrecking portraits and stealing plans alongside locating and burning a certain amount of money for extra end-of-level points, and collectable devil dolls that really require you to search hard, but sometimes the little things are the biggest rewards. Like discovering various secret passageways by jumping across small ledges on the current buildings sides or finding a hidden ladder allowing you to bypass certain areas. But the real joy is in taking in the various surroundings, which paint a picture of just how evil and cartoonish this Satanic workplace is.Sure, you come across the occasional pentagram on the floor or the packages of cocaine ready to be shipped out. But then you have bits where you can head downstairs, come across the employee showers and find a naked goon in there (still wielding a gun), who you can then shoot in the genitals and watch as they fly ten feet into the air. Or come across a break room with a party and enemies wearing paper hats, providing you with a twisted, petty joy in ruining Johnson from HRs birthday. Or even just the balconies with non-smoking signs and cigarette butts all over them, or hideaways where employees have set up folding chairs and coolers for Casual Friday. Aside from providing a window into this demented workplace, it feels like a nod to the days of Duke Nukem 3D, where the reward wasnt just items that can improve your game, but just the fun Easter eggs and jokes the developers stuck in.Of course, theres no ignoring the rest of the aesthetics in High Hell as well. Befitting its setting of both a soul-crushing corporation and an expansion of Hell, theres a unique mix of grayish colors spiked with crimson everywhere, creating an environment where the most important bits easily pop out. Enemies and scenery are simplistic, but complement the fluid cel-shaded graphics perfectly, with a slight blur layered on to add an old-school touch as if you were watching things via VCR. And do we even need to go into Doseones soundtrack? Its another set of adrenaline-pumping, electronic beats with sounds bringing to mind classic arcade games, perfectly tying in with the fun and frantic feeling.All that said, High Hell does have one notable flaw holding it back from true gory greatness. And there was quite the red flag hinting at it in the form of one of the games achievements, rewarding players for speedrunning the gamein twenty minutes or less.Yep, High Hell sadly comes across as rather short, to say the least. Even someone like myself who considers themselves to just be mildly okay at FPS games will be able to make it through these particular shenanigans in about two hours at most. And yes, this is a game where the fixation is more on providing an arcade-style experience instead of a lengthy campaign, and you can always go back to any level to try and tackle it as fast as possible while completing all objectives in order to get the best high score. But given the type of insanity and creativity on display here, its just a shame that it ends a bit too soon. You want more bosses, more maps, more abilities to blow away laser-wielding chimps hanging out near an employee barbecue. But as the above achievement suggests, it almost feels like it was designed to pander to the speedrunning crowd at times (like a lot of other games with similar achievements, including one here for beating a level in less than five seconds), and while I have nothing but respect for speedrunners, the game suffers a bit due to this.Closing Comments:While its longevity may be tied into just how willing players are to shoot for the highest score and go after as many achievements as possible, High Hell is a wicked little shooter that you wont soon be forgetting. Its eye-popping visual style will draw you in, but the rapid, skill-testing and just plain fun gameplay is what will hook you. Whether you blaze through things as if you were powered by inferno-style hot sauce or take your time to poke around every corner to find new areas full of demonic oddities to ogle, theres still a lot here for you to enjoy, so make sure to give this sinful delight a shot.", "date": "October 23, 2017", "grade": 4.0}