{"name": "ECHO", "ref": "https://hardcoregamer.com/?post_type=post&p=275953", "text": "Whats the point of it all? Do my actions even matter? How do my actions reflect on me? These are just a few of the questions that will slip through thought while playing ECHO from developer ULTRA ULTRA. ECHO presents a familiar story that comes complete with a living puzzle box of environments out to challenge the player in anyway the player sees fit. It puts emphasis on action and reaction. ECHO is a living manifestation of Newtons third law; for every action there is an equal and opposite reaction. By the end of making ones way through this living labyrinth, ECHO is a lesson in disassembling as much as reassembling.ECHO starts simple enough, playing more like reading a sci-fi novella than a game. Like many sci-fi stories, ECHO is a game about what comes across as an over-inflated ego meeting a challenge only that very ego could take on. The beginning is cause enough, with player-protagonist En waking up aboard her ship after just having slept through a solid hundred years. Its quickly revealed she has run away from some problem back home even though she comes from a family of wealthy elite. En is the best of the best. It even helps that she has the appropriately specific inflection in her voice to make her sound like a young twenty-something know it all.The reason for Ens long space nap? To get to a seemingly impossible Palace the likes of which no imagination could fathom. En hasnt traveled all this way for self-gain though, even if her companion London, who takes on a disembodied A.I. says thats exactly why shes there. ECHO does an excellent job shrouding the player in enough mystery of the goings on that it begs pulling questions up that otherwise the player might not be invested in. Its blending of intrigue and feeding the player just enough makes sure the task at hand is being focused on while trying to figure out how to achieve Ens ultimate goal. En and London arent the only two who made this journey to a seemingly impossible Palace. After touching down on the planet En finds herself at, things get weird. The quote thats no moon comes to mind. To say the least, En came to her destination in search of a Palace and in its place finds something beyond the scope of a hundred life times. Maybe a hundred life times is needed though for such a destination. En does find her Palace, its just not what her or London thought it might be. The reason for her visit? The seemingly innocent red cube En carries with her at all times even referring to it by name. This is no ordinary cube (much like everything in ECHO) as during the intro its revealed that the cube is someone. Yes, a living person has become a cube, but this is hyper advanced science being dealt with and ECHO does a stupendous job explaining without having to explain. Its the same story beat in fantasy that states hey, dont worry about it, its magic. Sometimes the most wondrous things are the things that retain mystery and in an age where searching Google is the easy way to answer anything, a story that provides even a sliver of mystery can be worth it  ECHO provides plenty.The exact reason behind Ens visit is to revive a life lost. While the full story is never revealed, enough can be gleaned from dialog throughout ECHOs entirety that En is hoping to save one of the few people close to her. This isnt the story of ego revolving around men becoming gods or trying to be all powerful (thats the Palaces job); its about ego getting in the way of relationship and the strain that comes with it. As for the star of the show, the Palace is truly a place of omnipotent-opulence and if En hopes to achieve her goal, then getting through this lavish labyrinth is her first priority. In fact, its the only priority. What starts as a quiet game with no enemies in sight soon is teeming with things out to kill the player. The beauty of it is the player ends up killing themselves. Again, using smart story-telling, the Palace En finds herself in reveals itself to be the true enemy. Its also the entire structure of gameplay for ECHO. Ultra Ultra did their homework with Greek mythos as anyone familiar with the tail of Echo knows that the nymph cursed by Hela can only utter the last thing she hears, which is baked firmly into ECHOs game design. Every enemy the player encounters is a copy of En. Initially they will just ideally stand there not doing much of anything but sucking air. This is quickly thrown out for enemies rushing En head on while the player reacts. The problem with reacting? The Palace learns from the players actions, thus using those actions for future encounters.Avoiding narrative beats, when En arrives at the Palace its in something akin to a sleep mode on a computer. The lights are off, nothing moves, but once En flips the switch, the Palace burst to life and Ens copies start showing up. The Palace shows its hand, but not everything. As En makes her way through the Palace, the copies start copying the player. Take out an enemy with a choke-hold? Better make sure it doesnt happen to En the next time. Getting overwhelmed and decided to use Ens gun? Bad news, now the copies can use a gun too. Having an enemy learn from the player and then use that strategy on the player makes for a wonderful enemy, and failing truly cant be blamed on anyone but yourself.Enemies arent the sole occupants of the lavish Palace rooms En wanders through, with each environment holding a number of things to interact with. In turn these other interactive set pieces are means to an end. Every action has an equal and opposite reaction, remember? See a bowl of grapes? Maybe eating them would be a smart move. Now copies of En will also eat grapes. See that harp begging to be played? Thats right, now enemies will want to play the harp. The beauty of these actions is that the will cancel out other actions copies have learned. Since the Palace is one big computer it means needing to reboot itself constantly while it processes all that information. The Palace runs on cycles, when the lights are up, copies of En are free to roam around pursing En while using actions used against them against the player. When a blackout happens  albeit they are brief  the player is free to use any action they want to move through the Palace. There is a short window of opportunity when a blackout starts for these types of action, but eventually a full blackout happens leading to a total reboot of whatever room one is in. The blackouts are almost too short, but never such a hassle that they felt cheap. Its just one more way for playingly smartly against the Palace. ECHO falls into the category of true sensory overload, because the environments are on such a grand scale its easy to feel overwhelmed in such open spaces. The Palace presents a grand scale that feels completely empty, letting the mind wander as to who or what it was all designed for. This question does get answered subtly and gave me the chills. ECHO does struggle with this sense of scale though on a technical level. It pushes a standard PS4 into overdrive and frame rate drops were consistent throughout, especially as the environments became more complex with more enemies throughout. This isnt due to the game having to learn/relearn things, but more the graphical sensory overload happening on screen. ECHO even crashed a few times during my time with it. This same hitching can also lead to the certain puzzle elements breaking. If a door isnt opening even when it seems like everything has been done right, the game probably just needs a reboot. This happened a couple of times as well with my playthrough; I spent the better part of an hour trying to figure out a puzzle already solved when it dawned on me the game might have broken.These same environments are exceptionally gorgeous. ECHO not only taking its name from the copies of En mimicking her, but also how the environments copy while folding in on themselves. Think of M.C. Eschers Relativity. The feeling of dread that comes with such empty space is one usually reserved for claustrophobic spaces, but ECHO nails it perfectly. With no map to go off but such simple environments, the feeling of getting lost can quickly sink in. Whether its Ens footsteps hitting the marble floor or casually walking for what can feel like eternity, ECHO knows how to make the player feel uncomfortable. Accompanied by exceptional sound design, ECHO always has a seed of dread ready to plant as soon as the player begins letting their guard down.ECHO is a relatively short story that will last at most ten hours if trying to see and do everything. The story is straightforward enough and the challenges appropriate that there is nothing the player will get stuck on (unless its a glitch). Something that truly stands out is that I immediately started playing again after beating it the first time. More challenging modes reveal themselves after the initial first playthrough, but thats not what drew me back. Throughout ECHO En will come across tuning forks (appropriate, right?) which carry encoding that if the player collects all of them during a level will reveal a verse at the end of said level. Each level is littered with these forks and the urge to collect them all can be strong, just for seeing what these verses say. If really invested in the story, which is great, it would be highly advised to try and collect them all. The new modes are also reason to come back with the copies of En retaining more memory of moves while also becoming tougher to take out. This extra challenge is worth it for those who might find the game too easy. Finally, the trophies/achievements are reasonable enough that its one of the few games where collecting them all cant be helped. None of them seem unreasonable presenting mini challenges to take on, which is what achievements should be. Closing Comments:ECHO is a puzzle game disguised as a third-person action-adventure game. The puzzle is everything and the action-adventure is exploring the lavish environments of the Palace. Backed by an exceptional story of intrigue, love and general weirdness, ECHO knows how to make the player think in more ways than one. Mirror enemies are nothing new for video games, usually reserved for boss battles or mini-bosses, but what happens when every enemy is the player? Thats where ECHO steps in, showing that the biggest challenge in life is ourselves.", "date": "October 21, 2017", "grade": 4.0}