{"name": "The Last of Us Part II", "ref": "https://hardcoregamer.com/?post_type=post&p=380049", "text": "Naughty Dog, previously best known for its colorful action-adventure games, made a bold move at the end of the PS3s lifecycle. The release of The Last of Us marked a complete tonal change for the storied studio. Focusing on dark and mature themes, Naughty Dog was able to spin a thoughtful, deep narrative with tense gameplay to match. Seven years later, the team is back with The Last of Us Part II. Building on the narrative and gameplay foundations of the original, The Last of Us Part II aims to deliver another deep and engaging story. Is The Last of Us Part II a worthy successor to one of the best games of the last generation or should it be fed to the Clickers?The Last of Us Part II takes place four years after the events of the original game. Players take control of Ellie as she leads a peaceful life in Jackson County, Wyoming. Things, however, take a turn for the worst when a cataclysmic event rocks her life, thrusting her back into violence. Heading for Seattle in search of revenge, Ellie must navigate through Infected and warring factions, all while somehow holding onto her humanity.The Last of Us narrative was built on how far someone is willing to go out of unconditional love for their child. The Last of Us Part II builds its narrative around how far a person is willing to go when someone they love is wronged. The story is ultimately a tale about the cycle of violence and how the need for revenge perpetuates it and The Last of Us Part II provides plenty to stew over its runtime. Its a fascinating narrative with many twists and turns thanks to an expanded cast of characters. The story takes great pains to make it clear this is a messy world, which allows for powerful narrative beats and plot twists. There are plenty of surprises, some that you might not like, but every thread funnels towards truly powerful moments, whether they be happy or sad. What sells the story is the excellent script and performances. Ashley Johnson and Troy Baker return as Ellie and Joel, respectively, and turn in genuinely outstanding performances. Johnson, in particular, turns in the best performance in the game thanks to her powerful delivery through Ellies high and low points. Overall, the cast is strong and given plenty of great material to work with thanks to Neil Druckmann and Halley Gross script.The Last of Us was a relatively average length of 12-16 hours. The Last of Us Part II nearly doubles that time, lasting anywhere between 20-30 hours. Its a huge game. In fact, it might be a bit too long. Much like The Lord of the Rings: The Return of the King, it falls into the infinite ending trap. There are several moments when it feels like youre heading toward the conclusion, only for the game to snap you back in. This could be taken as a meta-commentary on how the cycle of violence continues onward, but it can also be jarring. Regardless, The Last of Us Part II delivers an emotional, complex and powerfully-delivered narrative that keeps players hooked throughout the runtime.The Last of Us Part II incorporates many of the design elements Naughty Dog has built up since The Last of Us. The game remains a linear, story-driven action-adventure game, but allows for open enough levels and combat arenas to provide a world filled with plenty of variety. Levels have been cleverly designed to drive players towards the next plot point subtly, yet remain open enough to allow for random detours. These random details help flesh out the world and make Seattle a more interesting locale than any single location in the original game. The city has a story to tell through various collectibles and its engrossing putting all the pieces together. The Last of Us Part II, like the original, places a strong emphasis on survival and resource management. Youll need to explore to collect ammo, crafting materials and upgrade materials. The sequel expands on the originals crafting and upgrading by enhancing the variety of items and upgrades available to the player. New craftable items like the stun grenade and pipe bombs open up new ways to engage enemies. Meanwhile, there are more defined upgrades that reward players with enhanced health, faster and better crafting, the ability to hold their breath, improved Listen Mode and quicker executions, among other benefits.The Last of Us Part II is all about providing players more options to explore, craft and upgrade. Its a successful reinvention of the original games systems and all these elements weave their way into the gameplay. While still a third-person shooter, the game provides plenty of tools to take out enemies in your preferred way efficiently. New stealth options allow players to go prone, hide underwater in shallow pools or climb ledges to gain vantage points. A guns-blazing approach is also more than possible, though youll want to keep an eye on your ammo reserves. Gunplay feels weighty thanks to excellent feedback and a robust selection of firearms. A deep weapon upgrade system makes it easier to control recoil and sway while retaining that heaviness.The open level design encourages players to use their environment as they see fit. The various combat arenas afford players the luxury of playing stealthily, loudly or a combination of both. Thats fantastic considering the enemies players face. All your tools and strategies will be put to the test against the two main enemy types: humans and the Infected. All four Infected types (Runner, Stalker, Clicker and Bloater) return,alongside the new Shambler. A new dodge mechanic makes it easier to escape an Infecteds grasp, but Naughty Dog has made them more hostile to up the ante. Get caught in a bad situation or move too fast towards a Clicker and its game over. On the flip side, humans have received a dose of variety as players go up against two distinct factions: the WLF and Seraphites. A typical militant group, the WLF utilizes various rifles and pistols and provides callouts to teammates. They also shake up the formula with guard dogs capable of sniffing you out. Meanwhile, the Seraphites tend to prefer hiding and using bows and long-range weapons. Both factions challenge players in different ways and keep encounters interesting long into the campaign. Whether it be stealth, guns-blazing or a combination of both, The Last of Us Part II is an engaging and satisfying game to play.Naughty Dogs ability to push PlayStation consoles is legendary. Starting with Uncharted: Drakes Fortune, each subsequent game has pushed the level of graphical fidelity possible on its respective console. The Last of Us Part II follows this trend utilizing a mixture of pixel intensive models, high-resolution textures and top-notch lighting and rendering effects.The Last of Us Part II spares no expense delivering a highly-believable world with as much detail crammed in as possible. The game goes to great pains to hook the players senses, whether it be a dilapidated childs room, the lively streets of Jackson, rolling waves or the swaying grass. It all runs at a solid 30fps and rarely slips. There are some visual glitches now and again, but they dont mar the technically impressive presentation. Gustavo Santaolalla returns to compose the soundtrack. His haunting and subtle melodies blend into the world seamlessly. The visuals, soundtrack and performances from the cast all add up to an immaculate technical presentation thats one of the best this generation.Closing Comments:The Last of Us left a memorable impression. Its immaculate presentation, award-worthy performances, tense gameplay and thought-provoking story left players in awe back in 2013. Its a hard act to follow, but Naughty Dog has managed to craft a highly-ambitious sequel that builds and expands on what made the original so successful. Built on the idea of cyclical violence, The Last of Us Part II delivers an emotionally raw story. It may go on a little too long, but its rousing themes and performances make it a gripping tale from start to finish. The world is larger, giving players more latitude over how they explore and engage with it. Combat too has been tightened up, providing more gameplay opportunities and variety. The entire package is wrapped together in a gorgeous presentation that serves as Naughty Dogs PS4 swan song. The Last of Us Part IIs harrowing tale and exploration of violence may not leave everyone happy by the time the credits roll, but its another stunning home run for Naughty Dog.", "date": "June 12, 2020", "grade": 5.0}