{"name": "Shantae and the Seven Sirens", "ref": "https://hardcoregamer.com/?post_type=post&p=379653", "text": "Just because a half-genies work is never done doesnt mean she cant try to take a break now and then. Shantae has been on one adventure after another since her debut on the old Game Boy Color, and while there has been a good amount of time between each release, shes still had four major adventures plus a remake despite barely aging an in-game day. When Shantae and her friends get an invitation to a tropical paradise it seems like an irresistible offer, and while there are a few strings attached, the resort is beautiful and it doesnt seem like anything could go wrong. Until everything goes wrong, of course, because while shape-shifting half-genies are real, peace and quiet is a purely mythological concept.Shantae and the Seven Sirens is the newest, biggest entry in the platforming-adventure series, and it returns to the Metroidvania roots after the last couple games more level-based setups. Initially starting in Arena Town, the world spreads in every (2D side-view) direction with the only limit being that Shantae has no powers to speak of. Shes got a nicely-animated walk and hair-whip attack, a jump with decent height, and thats it. The island is expansive but Shantae is by no means equipped to explore it yet. Shell need the help of her new half-genie friends for that.The mayor of Arena Town has decided the perfect tourist event is a half-genie stage show and to Shantaes surprise shes not the only one. A half-genie is born to a female full-genie who fell in love with a human and as is standard for the series every single one of the other five is a scantily-dressed young female. After Shantae tracks down her not-quite-sisters, wandering through the first area and hair-whipping a few low-level monsters into shape, they all get together on stage ready to entertain the masses. At which point the lights go out for a minute only to come back with a show that, all sayings to the contrary, cant go on. Five of the half-genie performers have disappeared leaving only Shantae behind, leaving behind a pile of questions that only gets more complicated when longtime nemesis/rival Risky Boots shows up. Like any good Metroidvania, Shantaes areas are set up primarily to work out her current skillset but also tease sections that cant be reached until later. Rooms that the map clearly shows continue on are blocked by sand, water or gaps too big to jump across. New abilities to tackle these areas come in a number of styles and can be augmented by equipping cards. By games end Shantae will have five fusion transformations, four magic dances and a good number of spells to choose from, making her incredibly powerful.Fusion transformations are granted on rescuing a half-genie and they all give Shantae new mobility options. The first one, for example, changes Shantae into a ridiculously cute chameleon, activated by a press of the right trigger, and it not only sends her dashing horizontally but also sticks to the wall if she lands on one. The dash also grants a moment of invulnerability, which is perfect for zipping through a charging enemy and striking from the back, and can even be used as a mini charge attack to dispatch one-hit enemies. The reason the chameleon transformation is first is because its by far the most versatile one of the lot, but the others have their uses too.Dances take a little more work to acquire, being earned after the rescue by chasing after a summoning stone, but theyre all uniformly helpful. Shantae can dance at any time, and if there are unclaimed gems or health items on the screen this automatically brings them to her, but once started she can then do a summon spell for a variety of effects. The first one, for example, reveals hidden objects on screen, while the healing dance also purifies poisoned water and grows withered plants. Secrets and background items are almost everywhere, offering plenty of rewards for those wanting to chase after them. Its a good idea to go chasing after secrets, too, because the gems and gold nuggets come in handy. The magic spells are technically easiest to get, seeing as theyre just sold in shops and dont require any questing, but theyre not cheap to max out. Spells come in a number of forms like homing missile, fireball, defensive and offensive shields, etc, and they all drain off Shantaes magic bar. Health and magic drops are common but its still easy to run out of magic while using the search dance on every new screen. The reward, however, is more gems than you can spend, and if youre thorough you can have all Shantaes purchasable magic maxed out around the halfway point.The final thing to chase after is the monster cards. Each monster has a small chance to drop a trading card, each with a unique perk, and Shantae can equip three of them at once. If youve got a favorite spell theres probably a card to make it use less magic or hit harder, while other cards enhance dance and fusion abilities. Most cards are usable on discovery but a few require getting multiple copies first, which can require a fair amount of farming if its a rare drop. The Sirens of the title are the bosses of the game and they get cards too, but townsfolk hold on to those cards and are willing to trade for the gold nuggets hidden deep in the levels. Its worth it for a regenerating magic bar or stronger standard attack, but theres no way to know what the card does until you buy it.With as powerful as Shantae gets she needs a strong set of challenges to use all that power on and The Seven Sirens can kind of deliver on that up to a point. Later dungeons are crowded with enemies of varying types, dropping from the ceiling, shooting projectiles in various patterns or just hopping or fluttering around to add a little confusion to the mix. It can get enjoyably chaotic but theres no real danger there thanks to the huge number of healing options available at any given time. Monsters drop different food types that you have to drop into the menu to use, while shops sell a healing potion that activates automatically as soon as youre out of hearts. Anyone who enjoys chasing secrets will find theyve got a full inventory, at which point the more careful play back when you didnt have a healing dance that only lightly impacts an auto-regenerating magic bar, multiple healing items and a full set of nine get out of death free potions isnt so necessary. To Shantae and the Seven Sirens credit, though, it never once stops being fun to play despite being easier at the end than the beginning. Closing Comments:While the difficulty level is unbalanced everything else in Shantae and the Seven Sirens works together to create an incredibly entertaining platform-adventure. The series leans more heavily on sex appeal than it needs to, but the world and characters are a huge amount of fun, bursting with color and personality. Theres a good variety in challenges, with the levels alternating between straight combat, platforming and even the occasional puzzle. Secrets are frequent enough that its always worth going back and re-checking an area, and even though I thought Id done a thorough sweep for a first play-through, I still only ended up finding 84% of all items. Theyll have to wait for another play-through, though, because while my first save is still playable New Game+ is waiting with more magic, less defense, and a new outfit. Shantae and the Seven Sirens is a big, ambitious outing for the half-genie hero, and while she may not have gotten the vacation she was hoping for, its an adventure worth having.", "date": "June 9, 2020", "grade": 4.0}