{"name": "Resolutiion", "ref": "https://hardcoregamer.com/?post_type=post&p=379020", "text": "A common mistake when it comes to applying tone to anything, be it video games or maybe movies and television, is the idea that tone is superficial and primarily visual. That for something to be dark all one needs to do is subtract any and all connotations to light  have everything bathed in some murky, disheveled filter  or for something to be surreal, basically have little semblance to structure or internal logic. A few minutes into Monolith of Minds Resolutiion and were already graced with not one, but two examples of what could so easily be construed as common narrative tropes. Namely, the suggestion of an amnesiac protagonist and that eventually, inevitably  through the acquisition of lost memories  well learn of our true place and nature in the world. To its credit, Resolutiions leaving many a question unanswered come its closing credits (the second rolling of credits actually given the nature of its fake/true final battle), does avoid fulfilling that specific trope.But even that lends itself to one of the games major gripes and something which leaves Resolutiion, to fall back to my original point, feeling predominantly surface-level in its attempts to evoke and aspire whatever kind of message or theme its attempting. It doesnt help that in its early stages, it quickly settles into the seen-before cyberpunk aesthetic complete with breezy 80s synthwave music and blocky, retro-futurist surroundings. But even these design choices dont cause that much a problem; its the vague story beats and NPCs whom all talk in riddles where a lot of the frustration occurs. That like its backdrops, they allude to something grander, but end up merely a decorative affair. Like a lot of things in Resolutiion, the appeal to keep going, to keep digging, falls off quickly and only after a couple of hours, the formula reveals itself as satisfactory, if relatively shallow.Which is a shame, because for all the lack of clear communication (a problem that bleeds into far more than its narrative, which Ill get to), Monolith of Minds artistic design, specifically the choices with color palette and pixel art, are spot on. So rest assured that there are some good aspects to Resolutiion. From the burnt orange and purple contrast of its desert regions, to the refusal to simply have forest-orientated parts confide in only green  touches of blue and even lilac are part of the mix  if Monolith of Minds get anything right here, no doubt its the use of color to make the surroundings pop from out the screen. That careful attention to detail expands to even the pixel art itself, with some impressively-detailed work invested in particular reaches of the world map. Large masses of organic matter, one great example  a point in the game where the overarching surrealism on whats actually going on lends itself in a positive light to some absurd level design. Its a shame then that this over-reliance on pixelation does get in the way a few too many times. Namely the map layout one can access at any time and how its reliance on empty shapes and lines does a terrible job at pin-pointing your exact position. Sometimes that same disorientation can come by way of the world itself, with some moments making it hard to distinguish what parts of the environments are in fact the floor, the walls or something else. Usually in areas where a more isometric, top-down perspective is provided and the contrast in color is not as great. But even when you can put those brief annoyances aside, to focus squarely on gameplay, Resolutiion is your typical run-of-the-mill Metroidvania progression. Explore regions, inevitably stumble across parts you cant unlock or pass without some future upgrade; eventually youll brute-force your way through to a solution whereupon that desired item unlocks a new route. The problem here is that players will often make plenty of U-turns due to the over-reliance on long, corridor-like stretches only for you to hit a road-block by the end  resulting in countless time wasted in areas that neednt require attention. Its also another case where the map (in its indulgence with its aesthetic) doesnt help in providing a clearer bearing on position.It also doesnt help that a lot of routes in and out of regions are one-way only  meaning that an unnecessary trip or use of a certain item requires you to take the long-route back. Even the fast-travel system  unlocked after acquiring a certain item  requires you to travel to a specific point on the map, making the suggestion of easily warping between environments, feel if not pointless, at least not as helpful. Some of the puzzle-solving in parts, that require said abilities, also feel like a step too far and an obvious attempt to prolong progression at the risk of getting on a players bad side. The only real instance where this works is in the first half, requiring you to enable/disable certain parts of the environment to find the route out. When the game isnt solely fixated on cliches  like the classic find three switches to unlock the main route out shtick  and better yet, compliments the choices made with its art-style, Resolutiion can click as an action-adventure. One that, even with its three-hit strikes and attack-dodge repetition that make up the main combat, can still find the means to pose genuine challenge along the way. Though theres an unfortunate spike in difficulty for both its supposed final boss battles  wherein the game does the thing of posing a fake ending and a true ending providing youre curious enough to continue  the evolution posed with its main enemies in the overworld is fortunately better in this regard. Combat, as a result, is at its most enjoyable when you find yourself surrounded on all flanks  those who can fire projectiles and hit you with area-of-effect strikes alike. All the while youre having to make the most of your stamina meter (a sprint function replaces the usual dodge mechanic), making careful and conserved uses along the way. Add to this the fact music gains a touch of intensity during combat and while not exactly deep, Resolutiions approach to hostility and engagement with said threats is modestly satisfying. One can only ponder as to the missed opportunity the game throws away in its semblance of some kind of moral system though. No matter if its a feral creature or a towering form with projectiles, players have the choice to finish off their foes or offer mercy upon their entering a severely-damaged state.Theres no pay-off or repercussion to this action however  regardless of how many you decide to slaughter or let be  and while on the surface it may seem like an interesting dilemma or one that will incur a consequence later on, the fact is that theres a complete lack of pay-off. Ultimately diluting what attempt of a message or mechanic the game might have been attempting. An idea, like many things in Resolutiion, that eventually feels pointless and rather superficial, upon the acquisition of a certain item that allows you to revive any enemy or even NPC youve [un]intentionally cut down on your travels. The only redeeming quality to this particular moment in the game, coming in the form of a bit of puzzle-solving during the latter parts. A sequence that eventually unlocks the true ending and real final boss. But again, that set-up is soured by the lack of any clear or concrete answers as to the vagueness of its story. Worse, the boss fight in question suffers from a severe reliance on random luck so as to even offer an attack, let alone attain victory. Closing Comments:Even from as quick a glimpse of any of the attached screens, Resolutiion is no doubt a looker  a game that manages to use color to great effect. An asset that unintentionally becomes far more vital to ones drive to finish the story, given how lacking the overall product feels. Its not that Monolith of Minds are unsuccessful at injecting a sense of vague mystery here, its that the obsession with such cryptic reveals and keeping its players in the dark goes one step too far in other departments. And in the end, it doesnt amount to much. What you have instead is a game whose suggestions to greater things end up feeling little more than distraction. Theres some charm and striking art to admire on ones travels, but other than the well-crafted pixel aesthetic, the other half-baked ideas on show in Resolutiion fall short on delivering a world you feel adamant is both realized and worth unraveling.", "date": "June 4, 2020", "grade": 3.0}