{"name": "Neversong", "ref": "https://hardcoregamer.com/?post_type=post&p=378498", "text": "Its a natural fact that, despite how much we may wish it, life does not guarantee consistent happiness. Ive personally seen the highs and lows life has to offer  as Im sure many of you have as well. We often find support in the people closest to us. Friends and family are usually our first point of contact when bad things happen. And as much as we want to return the favor when those closest to us are in need, there are times when we may not have the capacity to do so. As someone who has lost friends due to my inability to be there for them, Ive known the guilt associated with that loss. Maybe if I was there for them they would still be here. What was I so busy doing that I couldnt pick up the phone and call? Ive been in situations where my own mental health kept me from being there for others and for that Ive made my amends. And yet, we can never guarantee that our support will always help. Instead, we can hope for the dawn of a new day and the possibilities it brings.Neversong is a short indie title that deals with the heavy themes of loss, hope and the mental struggle of supporting others. Featuring a fully-realized cast of characters with fully voice acted scripts, Neversong takes the innocence of childhood and thrusts it into the deepest, darkest places of the human spectrum. While the title is a platforming adventure, players are treated to deep narrative through an actual page-turning story. The fairy tale sets the stage and adds a needed layer of world-building. Its also a fantastical treat to hear a dark and twisted Dr. Seuss play with themes of innocence and loss. We play as Peet, a young boy who lives happily with his best friend Wren. Wren is considered one of the most beautiful and talented children of Red Wind Village. She and Peet have a connection that is unlike any other. From playing in the woods together to Wren teaching Peet how to play the piano, these youngsters are inseparable. That is, until the story takes an intentionally dark turn.While searching for a place to play one day, Peet and Wren abscond away (the rhyming is catchy). They find themselves in an abandoned asylum. While in the middle of their play, a horrible monster snatches Wren and kidnaps her. Our evil antagonist, Dr. Smile, is tall and slender with a mouth full of jagged teeth. Dr. Smiles visage is so horrendous, Peet is shocked into a coma and passes out  unable to rescue Wren. Peet eventually does recover from his coma, much to the shock of his friends. This is where the story begins. Neversong keeps to its fairy tale aesthetic by featuring gorgeously-panted visuals and an emotional soundtrack. Much emphasis is placed on the piano within the soundtrack because its also a main component of the story. Theres a piano in Wrens house that players must keep returning to for the sake of progression. Keeping with its musical themes, Neversong has players learn various songs throughout the game that can be played on the piano. Bosses will drop musical notes during their battles that complete each of the songs Peet must learn. Returning to Wrens house and playing these songs correctly reveals secret rooms that contain the various tools we need to beat the game. To provide more flavor to the story, its eventually learned Peet and Wren were working on a sonata together and each of the songs learned make up a component of their work. It shows true attention to detail that all these interconnected components that make up the story are seen.Neversong shows us that even platforming titles can feature deep narratives without compromising on gameplay. Each area navigated shows clear direction without unnecessary hand-holding. Puzzles in each level consist of intuitive steps that feature accurate physics. While Peet doesnt have the most sophisticated arsenal of tools, theyre still enough to kill the monsters guarding the road to Wren. From a baseball bat to a skateboard, each item is necessary for traversal and boss killing. At times you may even need to use items in certain sequences to reach areas. Neversongs intuitive design makes it a quick title to blow through without it being too easy. Where the title does stumble is its repetitive use of some puzzles. You also dont end up using all of the items obtained in the final boss battle which leaves the title feeling disjointed. While these misses are minor, it does disrupt immersion and dedication to the title when components are overly repeated or tossed to the side. While playing through the title, its clear that intentional design is at the heart of everything. Levels are designed to look solemn and precarious. Even bosses are designed to be the stuff of nightmares. As players set out on the journey to save Wren, its discovered that the adults of Red Wind have also gone missing. Promising your other friends that youll find their parents, you learn the horrible truth that all the adults have turned into monsters. With no way to change them back, each parent must be killed that guards a song that needs to be learned. To say their designs are creepy would be an understatement. Gorging monsters with voracious appetites await in each level. Dr. Smile himself is the epitome of horror with elongated features and expressions that could kill. Each boss design could have been pulled out of a Tim Burton film. Juxtaposing the fairy tale narratives with these twisted elements help build the titles identity. Its clear that Neversong was developed with a clear purpose and were able to distinguish the various themes that create the story. Its a title that pulls from various inspirations to create something that is both fearful and hopeful. Even the narrative feels like a Suessian-Stephen King mashup with themes about coming of age and the duplicity of adults.Despite all the darkness faced in Neversong, it ends on a high note of hope. The title touches upon emotions that are natural to the human condition. We are treated to narrative twists and turns that teach us the value of hope. We may feel the weight of guilt brought about from not being there for loved ones when they needed us most. We often wish to change the past for a better outcome, but instead we must move forward with their memory to guide us. Its a title that forces us to reflect on deep emotions in a neatly-constructed presentation that appeals to a wide audience. Closing Comments:Neversong took me about three hours to complete, but its message resonated with me for far longer. The title is short, sweet and gets to the heart of the matter without deviation. Theres a little something for everyone in the title  collectibles, intuitive gameplay and brilliant visuals. The use of the fairy tale narrative inspires a Brothers Grimm aesthetic that fits with the morals of Neversongs story. Its also a title that has some good replay value as you receive permanent special items after beating the game at least once. While its a short game, length of time does not necessarily detract from the quality of the title. Instead, it takes the time needed to tell the story it wants to tell. Length of play-time is often associated with quality, but oftentimes developers take extra time just for the sake of it. And while there are some light gameplay missteps, the title recovers by being genuine in its storytelling. Neversong shows that even deep, emotional stories can come from small packages.", "date": "May 20, 2020", "grade": 4.5}