{"name": "The Walking Dead: Saints & Sinners", "ref": "https://hardcoregamer.com/?post_type=post&p=378208", "text": "There have been a couple of games that have released that involve Robert Kirkmans Walking Dead universe. The Telltale series and OVERKILLS The Walking Dead all offered their own take on the universe, but never gave that immersive experience. Skydance Interactive has gone a different route introducing a VR title called The Walking Dead: Saints & Sinners. This wasnt a rail shooter and in fact this title may have just propelled not only the survival genre forward, but also the expectations of VR titles in the future. The depth in the game is absurd while not being overly complicated.The Walking Dead: Saints & Sinners takes place in New Orleans as the player will navigate different areas of the city. The outbreak is already three years in, so there are few survivors. While this is a horror game, it cant really be called a survival horror game. More or less, Saints & Sinners is a survival game that takes place in a horror environment. The game is a slow burn and the pacing is extremely slow. Day transitions to night and the game, however, is measured on a day-by-day basis. Theres only so much that can be done in that one day. You will play as The Tourist as districts are divided throughout the city with a few different factions at play. The title, Saints and Sinners, allows the player to make decisions on the fly when encountering survivors, as the walking dead wont be the only enemies.One thing that I would have liked to have seen was a better guidance system. I understand the concept of replicating a true survival experience, but having some type of direction rather than just missions you are on would be nice. There will be things on the first play through that you could have done differently and nothing can be done to go back and change that. Each passing day results to less and less supplies and more and more zombies. You can end up getting sick, which lowers your overall health. Stamina plays a key part as sprinting and meleeing with weapons further reduces it. Eating or drinking something can replenish stamina, but then it reduces your overall health. Medicine can improve the overall health, but its few and far between in finding some. Sometimes you can barter with a survivor to get something extra for intel when that opportunity does arise. It may be best to take the first few days and just scavenge for supplies. Crafting is the biggest aspect of the game as scavenging is extremely important. This allows for leveling up three different portions of your character to further unlock weapons, abilities, recipes and more. You are armed with a backpack for storing items. Taking down a survivor who has a gun rarely results in picking up their weapon. I think in nearly twenty hours of gameplay this may have happened once. Usually the gun the survivor was using ends up broken after death with no ammo to consume. This game takes the survival element seriously, but its inconsistent as well. If you are on a mission and you get killed, but you take out a couple of survivors, returning to that same location will have those survivors already removed. Honestly, this is a relief, but I am unsure if this was on purpose. Survivors can also take down zombies for you, but if a zombie is in the general vicinity of a survivor and not moving, the survivors dont do anything until it moves. This can also be a big help though in certain areas.Much like the main series, taking on one or two zombies is simple. If you get overrun, this is where the problem comes in. Its hard to justify just running by the zombies due to the amount of stamina you have and the fact that these zombies will no doubt chase you. Weapons do deteriorate and its nice to be armed with plenty of different melee weapons. Broken bottles, knives, shivs and modified baseball bats are just a few things. Shooting is a whole other animal. You have access to a bow and arrow, shotguns, pistols and more. The thing is that you cant rest on your laurels with these guns. They are good for a minimal amount of uses. The game requires you to properly reload each weapon. While a double barrel shotgun will no doubt take care of business, you have two shots until you literally have to pull two lugs from your pouch and manually insert them into the gun. Dont get me wrong, the detail that Skydance Interactive put into the game is amazing, but youll need constantly to plan ahead. Having a loaded revolver, a good knife and a shotgun can be the way to go. Running out of ammo while trying to aim at two zombies who are crashing down on you is a whole other feeling. The game is truly a balancing act for survival. Saints & Sinners requires use of the PlayStation Move controllers. I cant help but think with a better set of controllers, Id have more confidence in doing a lot of things. Youll end up having to get comfortable with how everything works with time. You have two holsters for weapons on the hip, one for a big weapon over your right shoulder, and the book bag is over your left shoulder. Doors have to be individually opened with rotation of the doorknob. Movement is mapped to the left Move controller with the ability to rotate left and right being mapped to the right Move controller. Also, unless youre ambidextrous, good luck trying to shoot or even stab with your opposite hand. Theres so much thought put into the control of this game that it will actually begin to make you doubt your abilities if you were put in this situation. Aiming a gun can already be difficult, but trying to line up the sites for a headshot while under pressure and having to reload ammo is a panic that no other horror game has created.You will, at times, be battling with the controls in this game. Things can get a bit wonky because of how the Move controllers track. While you can literally cup a pistol or put two hands on weapon, it feels a bit off because of the controllers. Its totally doable, but I think the options on PC might be better. Theres the option to drop whats in your hand or reload the gun, and these are mapped to opposite buttons on each controller. This can take time to adjust to. Also, opening doors isnt easy if youre trying to pull it open. If you try to shut a door quickly, it doesnt always shut completely and the door might not move far enough. If you try to push the door by running into it, it will push it open on the other side. It will take time to get this mastered. Lastly, all of your information is tied to a journal that you physically pull out of your pocket (along with a flashlight). The tabs are interacted with by using your finger and this constantly registers improperly. The game does allow to you choose whether youre sitting or standing though, which helps out. Two-handed weapons, unless gripped correctly, have and issue with tracking properly as well. Visually, Saints & Sinners is a mixed bag. Player models almost resemble the Telltale series art but they are modeled in 3D. There are a decent amount of variations for zombies and youll see some survivors turn as well. The city mostly looks dreary and even when its sunny out there isnt a lot of light. The headset also poses an issue in dark environments as the black levels seem to suffer and make it difficult to see. This world, no doubt, draws you in. The objects that are scaled at a distance such as skyscrapers and other buildings will begin to trick your mind. The atmosphere is so dreary yet hectic that after playing the game, you feel like you have successfully escaped a world but will want to dive back in. Its truly the overall physics that makes the game so exceptional.The soundtrack consists of ambient noise to help set the atmosphere. Couple that with zombie moans that help identify where theyre located and the audio experience is perfect. Theres no doubt that you need to play this with a headset. I heard coughing and someone clearing their throat while playing and assumed someone was watching my gameplay. I was surprised to figure out that it was me doing this due to low health. Voice acting is also on par from survivors as most of them have New Orleans accents. Closing Comments:I havent had a VR experience in the past that equaled what The Walking Dead: Saints & Sinners was able to accomplish. The intricate details for doing every little action will make you feel skilled once you get comfortable. While the controls can get wonky at times, the combat is fantastic yet primitive. I believe this comes down to how the tracking on the Move controllers work and it isnt an issue with the game. The physics are fantastic and the visuals are sufficient enough. The world sucks you in and impacts you emotionally. The sense of accomplishment when successfully and confidently doing tasks is satisfying, a feeling which will have you strutting into areas only to bring you back down to earth. You can even cover yourself in guts to fit in with zombies. I do wish the overall guidance was better, but I also understand the desire for difficulty involved. Finding resources such as food and medicine is difficult. The game is a slow burn due to its pacing and youll lose track of time progressing through the story. Bottom line, Skydance Interactive has undoubtedly created the deepest VR experience to date with The Walking Dead: Saints & Sinners.", "date": "May 14, 2020", "grade": 4.5}