{"name": "The Wonderful 101: Remastered", "ref": "https://hardcoregamer.com/?post_type=post&p=377967", "text": "The Wonderful 101 originally launched exclusively on the Wii U, making use of the double screen capabilities that the system had. It gained a following, but didnt take off as much partially due to the systems low general sales. Fast forward to just this year when Platinum announced and launched a Kickstarter for the title to return to consoles and PC for even more players to try out. With the title having been a huge success on Kickstarter and now reaching a broader audience, does it stand out enough to make the impact people are looking for?Earth is suffering from a horrible invasion of aliens and has been for some time. The only people strong enough to fight back against these invaders are the Wonderful 100, a group of human fighters who use their super powers to work together and send the aliens packing. The leader of this group is Wonder Red, who starts out aboard a train as its attacked by alien forces. After transforming from his teacher disguise, hes able to fight back and put a stop to oncoming enemies. The alien invaders wish to take over Earth in simple enough fashion, and although the story is simple enough in concept, it has some enjoyable depth the further in it gets. The best part of this story is the dialogue, which is simply charming. Wonder Red might be the newly-nominated leader, but hes backed by tons of allies such as Wonder Blue and Wonder Pink he meets along his way to help save people. The charming back and fourth dialogue is easily the star, as theres a fantastic Saturday morning cartoon charm to the storytelling which makes it feel like a combination of western comics and Japanese Super Sentai. Theres a lot of mysteries hiding behind the aliens and characters, and its up to the Wonderful 100 to uncover the truth with their trusty 101 unit, the player.Perhaps the most interesting thing about Wonderful 101 is the play style, where players take control of not one but an entire group of fighters. This starts out with Wonder Red, but slowly grows over time as more characters join the party. The main mechanic to fight starts with drawing symbols using the right stick that switches characters or becomes a weapon. In order to successfully draw these symbols, however, allies must be recruited. By progressing the story more, wonder allies will join the team, but normal civilians can also be saved while exploring the map in order to help out. Symbols are drawn using the available team and the larger theyre drawn the more powerful they become. These are simple symbols such as circles, lines and triangles in order to quickly activate them, but they lead to creating weapons or tools to use in combat. Each characters weapons also have multiple uses, such as the fists being able to turn locks or the whip having the ability to grapple and swing from certain items. Combat itself is simple at first but ranking up Wonder Ones increases their available abilities which can be even further approved upon in the market. Stages in Wonderful 101 are mission based with multiple missions within each one that may be familiar to fans of Platinum titles. Each level has multiple objectives that are graded based on how well the Wonder team does. Overall these rankings can be mostly ignored unless going for completion, but theyre one of the major reasons replayability is so high. Each stage carries tons of secrets and collectibles to be find, most of which are easy to overlook while casually playing through. Tie this into the bottle cap system, which more or less acts like an achievement list, and theres tons of reason to replay each stage and explore every corner it has to offer. The one flaw with stages is they can be hard to navigate at times. Although mostly linear, there are times when its unclear what direction to go when just trying to keep progressing and its a shame theres no clear direction on where the correct story path way to go is but this seems to be in place to further encourage exploration. Abilities to explore are obtained periodically throughout such as the ability to climb up buildings making a human ladder or building a bridge to cross gaps. Missions also reward currency for clearing certain objectives, beating enemies and destroying certain objects. These can be used in the Wonderful Mart to gain new abilities or buy useful items to help in the midst of combat. The abilities are especially useful as they offer all sorts of new advantages in combat and make it feel more engaging.The visuals in Wonderful 101 are adorable with main characters and enemies all looking like toys with sleek, shiny paint on them. The soundtrack is action-packed with tons of songs that build upon the heroic vibe the title is going for. Lyrical songs boost the enthusiasm of the team and make it easy to get pumped to keep moving forward. One of Wonderful 101s early issues is that its tutorials are lacking. Its easy to die early on as there are many quick-time events that require a pattern be drawn right from the get go and it can be confusing at first. There are also many instances where theres expectations to switch to a certain character in order to proceed but its not immediately clear and can come across as confusing. It starts making sense once its clear that every characters powers are color coded to them, but it would be nice if there was a bit more guidance from the get-go, especially when it comes to gaining new abilities wherein the information on how to use it appears only briefly and can only be seen again once out of the current mission. Closing Comments: The Wonderful 101: Remastered is a charming title with a ton of unique mechanics that make it almost intimidating to approach. It can look confusing from the outside and while the beginning tutorials are lacking, once further in it all begins to click little by little. Despite trying to be so action heavy from the get go its a slow burn that would benefit from a way to practice moves and abilities in a safe space without being in deadly combat that can be difficult at times if not paying close attention. The story, dialogue, characters, visuals and soundtrack are all a delight that nail the superhero vibe its going for, while the unique Wonderful Ones are fun to collect and learn little tidbits about. Anyone looking for a short, challenging and action-packed adventure with tons of side content begging to be discovered should consider checking out PlatinumGames most unique title to date.", "date": "May 11, 2020", "grade": 3.5}