{"name": "Life is Strange: Before the Storm  Episode 2: Brave New World", "ref": "https://hardcoregamer.com/?post_type=post&p=276374", "text": "Episode 1 of Life is Strange: Before the Storm was outstanding, and episode 2 follows up on it marvelously. Episode 1 showed us Chloe Prices life before the original Life is Strange and allowed more retro-fitted characterization that shed some light on how she became who she was in that game. Episode 2 starts off with Chloe and Rachel paying for their misdeeds in the first episode, and as it turns out, starting a fire is not exactly taken lightly at an uptight school. She finds that her actions have major consequences and can even bleed into affecting the lives of her friends. Expulsion leads us to seeing that Chloe may have liked school more than she let on  giving off a vibe that she enjoyed some aspects of the school  just not its authoritative nature.Chloe remains bull-headed and that has pros and cons to it. Her mother is torn apart by her life, while her pseudo-stepfather is too rigid for her. Her parents want to make her life better, but struggled to find a way to do it and trust issues pervade the household. Chloe doesnt trust her stepfather at all, while her mother doesnt trust her due to her drug usage. Chloe calls them both out on taking things too far with her and for embarrassing her with a search of her things  showing that even those trying to do the right thing can do the wrong thing in the heat of the moment. The series has gained part of its high reputation for showing that in life, there arent just absolute black and white situations or people  but shades of grey.Chloe is a damaged character, but one that has a strong sense of self-worth. She may not think about the consequences of her actions, but it winds up showing that she will do anything she can to help someone in need. This was explored in the first episode, and is a trait that is cemented her thanks to her growing bond with Rachel. Brave New World takes Chloe out of her comfort zone and forces her to grow from the devil may care person we saw in episode 1. She takes her consequences in stride and at least makes an effort to mend fences with her family and we see her even showing a bit of real-world skills when she tries to fix a beat-up truck in the junkyard. This is one of the few times a fetch-quest in a game worked as a character-building device, because she has to use ingenuity to find things to work around the broken vehicle while also juggling her recent actions. Chloes past torments her during a dream  leading to her reality being a dream in and of itself when Rachel comes to thank her for all shes done. They bond over a makeshift therapy session inside the busted-up truck and its apparent that they share a bond that nothing can truly break. They may argue and fight, but theyre fire-forged allies both figuratively and literally. The far-reaching consequences of the blaze wind up having greater effects on the town at large  as it led to more buildings being damaged and even a bit of tragedy thrown in as well. Life is Strange has been a narrative driven by thinking about your actual consequences, and it tells that story with narrative choices that still allow you to make Chloe a bit of your own character.If you want her to be completely anti-authority and brooding over the loss of her father, you can. That is just as believable a tale as her wanting to still keep a toe dipped in the past while still being able to accept that she needs to make fixes in her own life to prevent what happened to her dad from happening to her. Small things like either focusing on the pure narrative or soaking in the scenery and making all of the little cosmetic changes you can to an area when youre given a chance show off some personal touches the player can give Chloe too. You can have her just focus on the task at hand, or show off her creative side with tags or interior design. Chloe is a character longing for a sense of hope. She lost it all with her fathers death and regained a sense of self with Rachel. Their goal is to leave the ho-hum city theyre in and forge a bigger life  and that motivation is her driving force behind everything she does in episode 2. Whether its right or wrong morally, she can rationalize it because it brings her a slight step closer to their goal. Episode 2 is a tense morality tale and one that keeps you enthralled from beginning to end. There are rarely any easy answers to the questions youre given  but that makes the few times that does happen, along with the games more serene moments, stand out even more. Sometimes, these moments come at the least-expected times  like a school play. The entire cast of characters is strong, with even small roles standing out  like the creepy groundskeeper and the overly-dramatic drama teacher. Episode 2 shows off the strength of making you care about the characters first, and then putting you in situations that show just how much of a bond that you as the player have built with them. This holds especially true during the play sequence, where deceptive characters true nature is revealed and the bond between Rachel and Chloe grows to its strongest level yet. Episode 2, like the other entries in the Life is Strange series, is a mix of beauty and flaws. The entire adventure is shot like it was a movie, and as a result, it is beautiful to look at. However, the characters and environments certainly dont look impressive for a game crafted on modern hardware. Muddy textures are all over the environments while the more exaggerated facial features of the characters wont be for everyone. Despite the visual flaws, the dramatic tone of the game never suffers for it. The animation carries the drama and captures the awkwardness of life easily, while the voice work and soundtrack punctuate it.Episode 2s soundtrack shifts from the rock sound of Episode 1 to being more sublime and relaxed. Chloe gains more confidence in who she is and is more empowered. Daughter did an outstanding job with the music, and the folky tone fits Chloes personality perfectly. The sound design as a whole is strong and everything ties together nicely. The voice work is strong and drives the plot forward perfectly with performances that are layered and add some weight to the characters. Even a minor character showing fear works due to how it is done  never melodramatically, but realistically and in a way that keeps you glued to the screen. Closing Comments:Life is Strange: Before the Storm  Episode 2: Brave New World is an excellent entry in the series. Its an emotional roller-coaster from beginning to end and an experience that will leave you with questions answered and tears in your eyes. Anyone who enjoyed the first episode, or even the original game, will love it. Seeing Chloe gain so much characterization here while also growing as a person with Amber is a minor revelation. The more grounded nature of Before the Storm remains one of the biggest advantages it has over the original game and helps it stand out tonally as well. The same visual issues abound, but the animation and overall sound design combine with the writing to make a story that hooks you at all times.", "date": "October 20, 2017", "grade": 4.5}