{"name": "A Summers End  Hong Kong 1986", "ref": "https://hardcoregamer.com/?post_type=post&p=376944", "text": "Every year the visual novel genre grows with titles speaking to a larger community of gamers. In particular, were seeing massive strides with games featuring LGBTQ content making their way out. Its a great sign that helps bring even more gamers into the world of visual novels. A Summers End  Hong Kong 1986 is a recently released visual novel centered around a burgeoning lesbian romance. The main difference between this title and its genre brethren is that its not a modern slice of life high school tale. The story is set in 1980s Hong Kong and all characters involved are adults. The question is whether or not this game from newly-established indie Oracle & Bone Studio stands up against output from established developers.The answer to that question is a resounding yes. A Summers End  Hong Kong 1986 succeeds on nearly all counts and does so while feeling fresh. This is thanks in large part to the narrative. Players are first introduced to Michelle. This twenty-something office worker lives with her mother and is doggedly focused on her career. It seems this determination comes in part from her upbringing and her continued desire to please her controlling mother. Her days are always the same  until the unfortunate moment she breaks her high heels. This forces her to go to a shoe repair store recommended by her boss. This tiny, mundane step out of her schedule turns out to be a fateful one. Its at the shop where she meets Sam.Sam couldnt be more different from Michelle. Shes older, but floats through life without a care. Despite owning her own video store, she has no issue closing down for a day to goof off instead. This free-spirited woman takes Michelle to dinner and cements their newfound relationship that evolves from friendship to something more over the course of the story. While a story like this could still be told with a 2020 lens, it benefits from its setting. The decision to set the game in 1986 within Hong Kong is utilized. Characters decisions feel tied to how they were raised and cultural and familial expectations weigh heavily. The 80s time frame is both nostalgic and refreshing. It also allows for characters to wear all kinds of excellent fashion and youll see more than a fair share of shoulder pads via each characters multiple outfits. The biggest strength as far as the story is concerned is how frankly both characters are presented. Michelle and Sam each have their own histories and obstacles they overcame. Because of the setting, this blossoming romance isnt presented as a fantasy fairytale. Instead, realities of the culture and time frame play into the relationships development. Seeing a more honest depiction like this isnt common in the yuri/yaoi visual novel space. Usually, one character will simply utter but, were both girls! and that will be the end of the conflict. Fortunately, and this is a bit of a general spoiler, the game does escape the stereotypical tragic endings so prevalent in LGBTQ media. This must be mentioned because many people will avoid LGBTQ films/books/etc because the dramatic, bad endings can be triggering in nature.If there is any downside to the story it is simply that the writing starts out odd. At first, it feels formal. There are no typos or grammatical errors, but something about the writing just doesnt feel right. Over the course of reading, however, the writing eases into a better flow. Players should expect to spend anywhere from four to twelve hours with A Summers End  Hong Kong 1986. This depends on your reading speed as well as how long you spend paused in-game simply to hear an awesome song loop over and over. A Summers End  Hong Kong 1986 features an astoundingly good soundtrack. Expect to hear all number of great tunes from vaporwave to city pop to funk. Some of the key artists who provided tracks for the game are Crystal Cola, Timecop1983 and Stevia Sphere. If the soundtrack is ever offered up for sale then it will be a must buy. The only disappointment in the audio department is that theres no voice acting, which does make sense given this game was not made by a big studio, and to be fair, poor quality voice acting could have ruined the vibe.When it comes to visual novel gameplay, this title features dialogue options throughout the game. It does not, however, force players to get every single choice right. In fact, there are no correct choices. Instead choices are assigned point values which are invisible to the player. This means that you will receive one of two endings depending on how many points you accrue during the playthrough. This method of routing is much appreciated. It means players wont need to rely on a guide in order to get the best ending on their first time through. While the game is currently only available for PC, the developers have expressed interest in bringing it to mobile as well as consoles in the future. Closing Comments:A Summers End  Hong Kong 1986 provides a beautiful snapshot of a love story befitting of the time. With that said, it still feels contemporary and captures struggles which many deal with today. The message it presents is valid for anyone who chooses to play, no matter how they identify. For those who have experiences similar to those explored in the game, however, this will immediately become a treasured title. Oracle & Bone Studios have captured the hearts of many and were immensely excited to see what they create next.", "date": "April 28, 2020", "grade": 4.5}