{"name": "Sakura Wars", "ref": "https://hardcoregamer.com/?post_type=post&p=375600", "text": "Sakura Wars began its life as a Sega Saturn game in 1996 that received four sequels in addition to branching off across several forms of media including anime, manga and live stage shows. The fifth and final of these games was Sakura Wars: So Long My Love for PlayStation 2 and Wii released in 2005, so it was surprising to see a new Sakura Wars title released in Japan in 2019. The new Sakura Wars is a soft reboot of the franchise, introducing new characters but staying in the fictionalized steampunk version of the Taisho period in Tokyo. Sakura Wars maintains its dramatic adventure style of gameplay that combines adventure, visual novel, dating sim, role playing and action elements.The protagonist of Sakura Wars is Imperial Japanese Navy ensign Seijuro Kamiyama, who was recently reassigned to be captain of the new Imperial Combat Revues Flower Division in Tokyo after a mission at sea went horribly wrong. The all-female Flower Division is stationed in the Imperial Theater and their primary duty appears to be performing plays, something they are dreadfully terrible at doing. Initially this seems like a demotion to Kamiyama but he accepts his role and attempts to bring the acting crew up to snuff.Sakura Wars is split into two main game modes with a few minigames interspersed. The adventure portions of Sakura Wars is Kamiyama exploring the theater and other Ginza locations, talking to the girls and other NPCs along the way and maybe busting out some cards to engage in a friendly game of Koi Koi Wars. Combat is kept separate from the day to day activities where Kamiyama and the rest of the Flower Division get suited up in there giant mech armor and go battle demons. Essentially its the basic split of activities found in most RPGs, but the way the its broken up almost feels like two different games.The home base is the Imperial Theater in Tokyo. More of the surrounding attractions in Tokyo open up as the story progresses. The early objectives mainly focus on Kamiyama getting acquainted with the theater and the members of the Flower Division and his newly-assigned duties from commander Sumire Kanzaki. The ladies under his command include Sakura Amamiya, a swordswoman and childhood friend, Hatshuo Shinonome, the theaters resident shrine maiden, Clarissa Snowflake, a noblewoman from Luxembourg and resident bookworm, Azami Mochizuki, a trained ninja from the Mochizuki clan who dresses the opposite of how one would expect a ninja to dress, and Anastasia Palma, a famous actrees from Greece.The primary objectives given to Kamiyama are to get the theaters revenue to improve so they can avoid being shut down, ready the Flower Division for the upcoming tournament against other combat revues and to defend Tokyo from demon invasions whenever those happen to occur. The adventure is exploring the theater and Tokyo, talking to members of the Flower Division and other NPCs and running assorted errands. Mostly this consists of walking around and talking to people which will be a huge chunk of time in the game. The characters are interesting and likable enough but they each fit a certain character archetype, so interacting with them does have a certain feeling of familiarity and predictability.Theres a dating simulator component to Sakura Wars that serves as a mini game. These portions shift to a first-person view where the player moves the cursor to certain items in the room or certain parts of the character Kamiyama is addressing to advance conversation. This portion of the game suggests neither Kamiyama or any of the girls have any experience in dating or even talking to members of the opposite sex. Sometimes the awkwardness is cute and other times it can be cringe worthy. Kamiyama has tendencies that are sometimes effectively played up for humor and other times his behavior is like a human trainwreck, such as his internal struggle not to peak at the members of the flower division taking a bath or staring at their chest during a conversation. These interactions if done successfully can improve trust with the members of the Flower Division and improves their effectiveness in combat.Combat is fun, but dont expect to see it until well over an hour into the game. Unlike past Sakura Wars titles these battles are straight up action. The combat system isnt too deep and you can button mash your way to success, but this approach actually works with the structure. Combat sequences are sporadic early on and dont become a major part of the game until the later chapters. Battles are fought with Kamiyama in his mech suit with one or two members of the flower division with him. There is some variance with everyones normal and special attacks so it is fun to play around with different team configurations. Some of the demonic landscapes and creature designs are well done, adding a nice contrast to the realistic style of anime graphics to day-to-day life in Tokyo.Sakura Wars does some things very well. The story and characters follow a predictable pattern and deal with themes that are familiar to fans of these sort of games. In spite of not being the most original, however, the story is engaging and found myself caring about the characters as things progressed. The attempts at humor can be cringe worthy at times but more often than the not the attempts hit their mark. The story is broken down into different episodes and teaser previews at each chapters completion helps make the game feel like an episodic serial. The combat sequences are fun and the simplistic mechanics and straightforward nature fit that the emphasis is more on story and building relationships than action.Pacing and balancing the two different game styles are the biggest weakness. The first half of the game has a greater emphasis on the adventure portion, with combat sequences occurring rarely outside of the episodes finale. Later chapters flip the ratio where they have extended battle sequences. The story is also a slow burn where the early chapters were just interesting enough to keep playing but didnt take hold until the second half of the game. Later on a combat simulator becomes available for people that want to revisit battlegrounds and Koi Koi Wars is a card game that can be played against members of the Flower Division if players are looking for a break from the regular gameplay. There is a New Game+ feature that allows players to try different approaches to social interaction and complete their Bromide collection. There are no levels to be gained in Sakura Wars so the main benefit of this is it allows players to skip cutscenes, keep their Bromide collection and some secrets are marked on the map.Closing Comments:Sakura Wars is a blend of adventure, visual novel, dating sim and action game. Trying to blend all these different types of gameplay together to create a dramatic adventure is a tricky tightrope to balance, but the game succeeds more than it doesnt. Slow pacing and inconsistent balance between the different types of gameplay can make Sakura Wars difficult to get into, but the payoff for doing so is worth it. People wanting a straightforward action RPG may be disappointed with how little action there is proportionately to the other play styles early on, but people looking for an interactive story peppered with combat will find what theyre looking for with Sakura Wars.", "date": "April 27, 2020", "grade": 3.5}