{"name": "Bubble Bobble 4 Friends", "ref": "https://hardcoregamer.com/?post_type=post&p=369736", "text": "Taitos legacy was built in the arcades and fortified on consoles  and the Bubble Bobble series was one of its earliest and most endearing creations. For nearly forty years, Bub and Bob have been two of gamings cutest and most recognizable dragons, all the while providing fun with a unique blend of action, platforming and puzzling. The series has been long-dormant though, with the last major release coming from a remake of the original game on the GBA many years ago. Now, the series returns to a Nintendo console and portable all in one  but does Bubble Bobble 4 Friends offer enough to be a worthwhile pickup in the modern era?The original games were known for being short and sweet affairs that were best played in short doses. The games core format of putting enemies in bubbles and popping them to win the stage naturally doesnt leave much room for a lot of depth  but does open the door to a lot of fun to be had. Its a simple formula, but it works for the series and allows for some expansion, which is what we have with 4 Friends adding in things like massive boss battles to keep things somewhat fresh.The core format has you place enemies in bubbles and bop into them to send them off-screen, but there are some wrinkles to keep this format interesting. Chaining combos is the main way to do so and turns it from a simple game of put enemies in a bubble to doing so in rapid succession while also sending one encased foe into another to build up your chain and rake in the points. The more points you earn, the more lives you get and that can come in handy for when youre just a single enemy away from clearing a stage and dont want to have to start over from the beginning due to a single mistake. Fortunately, most enemies have attack patterns so avoiding damage is a simple matter of being patient, but that isnt always possible as some areas dont give you much room to move. Some stages feature close-quarters sections where you can only really jump up slightly and throw bubbles to buy yourself some time. This means that an enemy may wind up bouncing around somewhat randomly, leaving you to sacrifice a life or two in order to figure out a good strategy. Trial and error game design can be frustrating, but its minimized here thanks to a generous game over system.Even if you lose all your lives, you just start over at the start of the level  and with these still being screen-based affairs, its not like youre out a ton of time. Stages can take anywhere from three to five minutes, so if you die early on, you retry and lose a few seconds of playtime. Larger, more puzzle-filled stages are where this approach does hurt you a bit, but that also forces you to be more careful. When you have areas where you can only ride bubbles upwards, you have to focus more on your timing for not only jumps because you could land on spikes, but also ensure that you shoot at the perfect time to trap an enemy and thus ensure that they cant shoot you.The more puzzle-heavy stages test your mettle more than the action-oriented ones, but theyre also more rewarding to clear. After a series of nine stages, the tenth will feature a boss battle that tests what youve learned up to that point in the sequence of stages. If youve been on an action-centric path throughout that run of levels, then it will be largely based on avoiding damage and dealing it out instead. The more puzzle-centric boss battles really test you, though, because theyre so large and give you little room to move among things like marrow platforms to avoid damage.Bubble Bobble 4 Friends plays really nicely and controls far smoother than any past entry in the series. Those were a bit stiff and while you could get to where you wanted, you didnt have a great sense of momentum  something that becomes quite clear when you play the original game thats embedded in this one. Now, you can move around with great ease and enjoy a faster-paced game thanks to the bubbles shooting out at a faster rate of speed  almost to the point of feeling a bit like a Mega Buster in terms of sheer volume.Visually, 4 Friends is a clean-looking game that manages to take the overall style that worked before  mainly patterns with a lot of tiles and sharp colors, and update it. Instead of 2D sprites, you have 3D models in a 2D space and the end result is impressive. Facial details are easy to spot, which makes things like the large teeth of the dragons pop even in portable mode, while the environments all evoke a different feel thanks to the rich color palette on display.Musically, the game is cheery with a fast-moving soundtrack, but it doesnt stick with you after playing. Still, during an extended play session, it does fit the action and thats all it really has to do. Theres a fair amount of variety when it comes to music in each themed area, so there isnt much repetition either. The sound effect work is fantastic, with the bubbles in particular sounding exactly as you would expect for a gaming projectile that also has to double as a bubble. The sound of enemies being whisked off-screen in bubbles  especially with chain reactions, is satisfying and a perfect way to encourate you to focus on chain combos instead of just clearing the stage. Closing Comments:Bubble Bobble 4 Friends is the best-playing entry in the long-running series. If youve ever enjoyed a Bubble Bobble game, you owe it to yourself to give it a shot. The gameplay is faster-paced and tighter than ever before and it looks fantastic in either handheld mode or on TV. The core formula has been tweaked to include more puzzles and boss battles, but the root of the game remains intact. The end result is a classic-feeling, user-friendly game that isnt bogged down by a lot of the clunkiness of games of the originals era.", "date": "April 2, 2020", "grade": 4.0}