{"name": "The Complex", "ref": "https://hardcoregamer.com/?post_type=post&p=370353", "text": "If theres one genre with a near-insurmountable task put before it, the return of FMV-styled multiple-choice tales would fit that descriptor. Weighed down not by some niche market-share or expectation from consumers, it almost seems as if FMVs are already at a disadvantage before one has even booted up the main menu. This feeling of caution, of uncertainty on how (if at all) this genre can genuinely prove worthy of mention, is not unwarranted though. While a lot of non-FMV games with story and choice front-and-center, owe much to their larger budget  let alone their being fully-animated, fully-constructed video games  the troubles and pitfalls of FMV games is in their execution. On being fleshed-out, varied releases whose multiple outcomes not only exist, but are worth going back to scout for.Production values may have gotten better  as is the ease at which such titles can be readily made available on any storefront  and maybe its that strive to match the sleek direction with actual substance where publisher Wales Interactives motives stem from. Credit to the team for sticking with this genre; this years The Complex the latest in a portfolio that consists of similarly-recent efforts like The Bunker and Late Shift alike. Little Jade Productions approach here veering more into light sci-fi and thriller-esque territory. The presence of a figurative ticking clock and conspiratorial suspicions on who did what, the order of play here. Delivering, in the end, what winds up as a roughly two hour run-through whose unfortunate failings are more evident than the trickle of brief pleasantries the game offers.Perhaps the first area to start off with  something that speaks to The Complexs less-than-successful allusion to grander tales and heftier stakes  is the feeling that a lot of crucial elements feel so frantically brushed off or passed through without a consideration to explore or flesh them out better. Or worse, to lack any investment in time so as to make such key/dramatic moments have weight to them. An early revelation that comes at the point where things start to take a turn for the worst, lacking the surprise or feeling of players having to involuntarily adapt or reconsider their choices. But in the opposite case: another visual cue so blatantly pointing towards a later dilemma that its eventual reveal lacks any effect. Granted, The Complex does make an effort early on to try and sow some seeds of doubt and second-guessing, particularly with the relationship between main protagonist Amy and fellow assistant Rees. True the foundation for their relationship stems from a few cliches, but The Complex seems to start with this alluding to possible double-crossing or ulterior motives, then drops it entirely to play things completely straight and safe a few scenes later. Neither character benefiting from any sort of development other than: lets sort this mess out. There do eventually come moments of questioning certain characters and people in authority  and the multiple choice system does tug players between two choices that may, hopefully, lead to promising outcomes  but their presence feels only to serve the gameplay mechanics, rather than of being actual three-dimensional characters with a purpose. Worse still, given how many characters are present, you could so easily cut the cast in half and still get the same effect with how little certain individuals are given here. A consequence perhaps of how The Complex tries to integrate a relationship-based tallying of ones progression  something of which Until Dawn used but more importantly applied with purpose  so as to make you think about how to keep positive relationships in check. Unfortunately, not only is this mechanic far from fleshed out and so uneven in parts (certain disagreeable choices affecting a characters meter in wildly conflicted percentages), but when it comes down to it, it rarely holds much weight to how said characters eventually respond or react to your choices.Even the emphasis on how many have died doesnt factor into things other than merely being a stat to record. The same goes with the tracking of Amys current personality traits  another obvious bit of fluff that in the end serves no real purpose aside from partially filling the pause screen. But the biggest disappointment when focusing on moments of decision specifically, is the odd way The Complex tends to designate apparent moments or conversations as choicesand not others. You can count maybe four or five lines of dialogue in the game where multiple choice could have been interestingly posed, yet characters quickly land on a choice and the story so merrily carries on. Thats not to say there arent some multiple choice moments that even veer into how risky a player may feel. An early moment that tempts players to delay proceedings a notable stand-out, even if the ramifications thereafter arent that great. Its a missed opportunity in general and one that could have alleviated another one of The Complexs less-forgiving elements: its ambition to be both high stakes yet condensed with how its set. Whether this is a fault of the game/productions budget or indeed an oversight on scale, rarely does the potentially catastrophic scenario of a major viral outbreak (that is the storys premise) feel as critical or as dramatic as the games writing so desperately wants to convey. Even when later revelations and interactions hope to sully what should be a clear-cut path, again such vital information isnt developed enough for the interactions between characters to feel that crucial to maintain. The game by the closing chapter  when one of the many ending plays out  almost having a half-hearted execution and rather lets get it over with mentality to, again, making these scenes land with impact. Not that you carve a (video game) story of shorter length and still keep players intrigued, but theres just this lingering rush and franticness to the way The Complex hopes to reach an end point that you just wish that the game had invested in a few more key scenes of multiple choice. Or at least some fallout from the choices youve made along the way. The only example of this near the end  a reference to the very first decision in the game  too offered up in a fleeting, whatever kind of fashion. That person went on to do this and that, the end.On the side of the games technical foundation and its general performance, The Complex does suffer frequently from individual scenes not transitioning as smoothly as one would hope. A scenes end bookended by a half-second pause before the next scene begins. As far as the thematics go, while a case of obvious green-screen post-production does manage to get away with what its doing, moments involving the firing of weaponry do unfortunately let their CGI-aided visuals laughably remove any sense of tension or threat they may intend. Also, a nit-pick this may be, for a setting as large as The Complex offers, it says something about the possible budget again when interiors are so oddly vacant of staff or people in general. Closing Comments:While you cant fault the visuals and the effort put in to try and mask the evident budget limitations, that cutting of corners vibe is sadly something that plays into The Complex one too few many times. Scenes that are surprisingly absent of crucial choices to make, added to via a general pointlessness of certain characters presence. In the end, resulting in a story that eludes to high-stakes and relationships to keep in check, but seldom puts the effort to make your choices seem consequential or carrying as critical a weight as they should. And for a game to falter on its decision-making  the crux of a genre such as this  should speak plenty on the emotional investment one should hope to find and expect here. Credit to Michelle Mylett and Al Weaver (who play Amy and Rees, respectively) for serving what material theyre given here, credit too to Wales Interactive for supporting the FMV genre still. But the pull of multiple branching endings (technically) as well as a shallow relationship mechanic mark The Complex down as, while not terrible, a safe, sterile and sadly under-utilized effort.", "date": "March 31, 2020", "grade": 2.5}