{"name": "MLB The Show 20", "ref": "https://hardcoregamer.com/?post_type=post&p=369452", "text": "What is currently considered as possibly the most overlooked PlayStation exclusive returns with MLB The Show 20. The game will soon be transitioning to multiple platforms and its possible that this is the last version for PlayStation 4. San Diego Studios looks to offer its deepest offering yet as the foundation was laid a few years ago with this franchise for the current generation. What we have seen since are incremental updates for a full-priced baseball game. MLB The Show 20 is looking outside the box to add entertainment value to the already deep modes. When a series is as good as The Show, it makes it more difficult to build and improve on things. The point is MLB The Show 20 continues to be the best realistic representation of its sport but the updates to the game are just that.San Diego Studios has pushed a plethora of updates to this years game. All the core modes return with some subtle changes. Players can choose from playing the long game with Franchise Mode where this year they can create a team and substitute them for another team to play as. Theres no expansion draft or any other element to it. Players will play multiple years and control their team with trades, signings, scouting and the norm. Franchise Mode is left unchanged and theres still no ability to play a shortened season. The team did state it has included much more Minor League players with face scans, but ultimately some of the biggest prospects are missing but will be added soon.What has seen some attention was the mode that was introduced last year with March to October. The updates to this mode are welcomed as players will participate in pivotal moments of games that will help carry momentum through the simulated games. March to October now includes the ability to seek trade offers and also build the club throughout the season. Some games involve telling player-specific stories much like Road to the Show and completing challenges will help with their stats. Even when completing, I did not notice a big change in a players statistics and this may be based on their rating. March to October also still leaves you missing out on the strategy of baseball. Figuring out and wearing down a starting pitcher is out the window as mostly you will just enter the game in the later innings against the bullpen. Its easy to get caught up in the mode as the progression is satisfying but there are still some holes in getting a proper baseball experience. The mode is rather addicting and the addition of trading helps with that. Diamond Dynasty still continues to be the best card-based microtransaction mode in sports games. The team added a new tier of cards called the Diamond Club with the most important addition to the game coming in the way of Showdown Mode. Madden introduced something similar a few years ago but MLB The Show 20 does a few things to make it stand out. You wont be using your team but rather drafting a team. Completing challenges will allow players to draft more guys and perks. The goal is to setup a final showdown and make sure the score is closer. Outside of the initial Showdown, unfortunately, the rest cost a minimum of 500 subs. This makes the mode almost pointless unless youre paying for it. Its a fun mode that I wish was separate from Diamond Dynasty, but having to pay that much to play the mode is ridiculous. Otherwise, Conquest and the other modes return with minimal changes. Players can also participate in Moments with Legends to unlock cards. Diamond Dynasty basically ends up remaining the grind it has always been with a new mode for players to gain stubs when starting the mode for the first time. The Moments still remain hit-or-miss in difficulty as you will again be replaying some of these multiple times.Road to the Show continues to be the fan favorite as the major changes from last year carry over to this year. The more narrative-based gameplay based on the Player Archetypes you choose will ultimately determine the type of player you are. The team did not add any new Archetypes and the selection is still 4 and 4. This could have gone a little deeper. The team has added new challenges to better match up with what Archetype your player is and the game will also notify you when perks are active. Perks can be unlocked over time when certain goals are reached. RTTS remains a fun grind with quick progression if you choose to be a non-pitcher. The variety remains there and keeps the mode fresh. You can also import your previous RTTS players to use here. Its still the great mode that players expect. One major mode that has been added this year is Custom Leagues. San Diego Studios eliminated the Online Franchise Mode a few years ago and that irked a lot of players. Custom Leagues allow players to create leagues for their friends with certain stipulations such as innings, teams and games played. This still works best with a dedicated group of people but if you try to randomly join someones league, there is a good chance that not a single game will be played. This is best used for a coordinated effort between players. Its a nice touch to the glory days of having the Online Franchise for players.The gameplay of MLB The Show 20 still stands out as the most important aspect. The biggest change comes in the way of fielding. Last year, San Diego Studios implemented a new fielding AI to better represent the ratings of the players. This year, a new first-step mechanic has been implemented and an extreme catch can be executed depending on the fielder. I personally havent come across the opportunity to make one of these plays yet. What is completely different is the new throwing meter. When fielding, the meter begins instantaneously and the cursor needs to stop in the green zone to make a correct play. Theres a high difficulty curve when using this meter. If it is slightly off, and the meter is fast, the throw will be off. Throws can be pre-loaded but the response time in the meter feels confusing at times. What makes things harder is the camera view being used. This can cut off the meter view on a double play or make it hard to see on a deep fly ball. This seems like something that was tacked on and I have lost games because of this mechanic. Players can revert to the traditional pressure sensitive throwing as a new indicator was added for this. Perfect-Perfect hitting is a new aspect added to batters this year. The aiming cursor brings back a resemblance of the All-Star Baseball franchise on the Nintendo 64 in the late 1990s. The window seems bigger for contacting hitting this year. If you aim the cursor perfectly and match that with the perfect time, you will receive that grade. I have yet to accomplish doing this and just like the Extreme Catch opportunity, it is a rarity. There are still issues with hitting. Having a good timing and good contact grade on a hit will still result in some flat responses or foul balls. With the way the game has changed with hitting home runs, it still feels that the game is left in the past. It really comes down to each individual players stance, swing and the angle the contact is made at to result in different hits. Players can now choose beforehand which direction they want to bunt.Playing the game online looks to be the best experience The Show has had to date. The focus is clearly on batting as you will not get any hiccups when getting pitched to. This seems to be the priority set for the game. When pitching, the game will sometimes drag during the throw but this doesnt really affect anything. What does seem to be affected is the fielding. It feels sluggish and heavy online and I have had a few games lost due to trying to re-adjust catching a fly ball. Diving also feels a bit delayed. Running the bases is still an issue as button commands are hit-or-miss and feel often delayed. That can be the difference between a run and an out. What you cant dictate is your opponent either quitting because youre winning and constantly pausing the game to check their phone. The server has disconnected a few times and this is most detrimental in Showdown. You will lose all your progress in Showdown if the server boots you off and that is disheartening. MLB The Show 20 still shines graphically as faces, player models and stadiums look fantastic. The game still lacks in the portions of the stadium that are added such as objects beyond the wall. The crowd looks better than ever and the HDR adds life to stadiums. Its hard to distinguish the game versus realism if it is overcast out. Shadows are smooth across the board. If you have a PS4 Pro, you still have the three visual options. Performance will run the game at a lower resolution and less detail for a completely smooth appearance. The Balance option took a big step up this year as its buttery smooth without sacrificing the visuals. If you go for the high fidelity mode, the game still chugs along and is borderline playable. With how good Balance looks, theres no reason to choose the highest setting. The game also includes a new visual presentation for scores and it looks fantastic. The MLB Network theme is still selectable and Moments including Legends feature a retro look that I wish was available in all modes.The audio still remains unstoppable in MLB The Show 20. Player chatter and crowd chatter are unmatched in any other sports game. Sound effects on the field and literally anything you would hear during a game. Matt Vasgersian retakes the helm for better or worse. He seemed to transition well to Sunday Night Baseball on ESPN but still remains dated here. If somehow they could add A-Rod to the broadcast, that would be an improvement. The commentary still feels a bit off and delayed at times, but there are still dynamic moments. The soundtrack in the game is a blend of all current genres that is better than what it has been in the past. Maybe in the future, San Diego Studios could include official player interviews during the game much like NBA 2K has. Closing Comments:MLB The Show 20 launches at the perfect time as the nation needs sports. Baseball has been pushed back and this is the closest thing you can get to a real baseball game. The core of the game is left untouched and its hard to fix what isnt broke. There are a slew of updates here, but mainly the game feels like a seasonal update for a game like The Division. Its hard to justify paying a full $60 or even $100 for the game if you are a casual fan. This may be locked into the contract with Major League Baseball, but there needs to be a legacy discount of sorts or the game just needs to be $40. The series remains excellent and the updates are nice, even if these updates are focused more on appeasing the hardcore fans that play and grind on a daily basis. The online experience is still suspect but is vastly improved. Even though it may not be the best value, MLB The Show 20 remains the top dog in representing its sport on a video game platform.", "date": "March 18, 2020", "grade": 4.0}