{"name": "Langrisser I & II", "ref": "https://hardcoregamer.com/?post_type=post&p=369320", "text": "Back in 1991, a niche tactical title by the name of Warsong launched to fans in the west on the Sega Genesis. In Japan, this series was known as Langrisser. After Warsong, the series would not see any further official English releases outside of a mobile title until this year with the launch of Langrisser I & II. For many, this is likely the first time theyll have gotten to sit down with this title thats somewhat reminiscent of other early tactics titles like Fire Emblem but now get to see where Langrisser actually started many tactics and RPG staples.The story in the first title follows the young prince Ledin who is thrust into battle after his kingdom is invaded. While at first he is forced to flee the fighting, he returns to claim the land once again and uncovers that more is going on than it may seem. Together with close friends and comrades, they must band together in order to save the world from darker forces at play. The second title followers a traveler by the name of Elwin who is put in the midst of many decisions along his journey. The story has multiple paths Elwin can take and changes depending on who he decides to ally with along the way. He can take on the path to find the murderer of his instructor or follow one of three other paths given to him. Each path will change his allies in combat, but offers unique replayability to try each one again and see the many different stories before him.Basic gameplay between each title is generally the same. At the very start, a goddess asks the player a variety of questions. These determine the main characters starting stats and if they arent to their liking, the quiz can be taken again for an alternative setup. Players are also given the option to start with bonus money and combat points if they like to make starting out a little easier. Once that has been finished players can immediately jump into their first quest where the tactics combat begins. Like most in the genre, each team on the field takes turns navigating and attacking one another with either physical attacks or magic. Magic can only be used without moving, which makes positioning the turn before important when planning attacks or helping to heal. Langrisser has a unique mechanic that allows each character to summon their own protective mercenaries to their side which greatly aid in battle as almost every boss will also have these with them as well. These mercenaries cost gold at the beginning of each battle, but are important in battles. If the main character who summoned mercenaries is defeated, be it enemy or ally, the additional mercs will also disappear. This makes strategizing attacking the leader important to help wittle down extra forces. Outside of combat players need to manage their commanders and their equipment. By leveling up and fighting, commanders will earn combat points. These points are vital in order to improve commanders by changing their classes. Each character has a class tree that will increase their skills, units they can summon and type of unit theyre able to be. This is important to keep in mind as the type of unit in battle has weaknesses and resistances to others. The main triangle to keep in mind is that spears are weak to infantry, horseback units are weak to spears and infantry is weak to horseback riders. These are integral to doing extra damage especially against the smaller generic units. Other units can also be important in their ability to travel and doing neutral or ranged damage on the battle field which is all dependent on the scenario at hand. Equipment is mostly straight forward with weapons, armor and an accessory all being equitable on each character. Any character can take on equipment, but skills are more unique to characters and the class they choose. Two skills can be equipped from a list of the ones unlocked by the classes the character has taken on and these can be helpful in improving stats. Those who want to get even stronger do have the option of replaying missions, but this is at the cost of the story reverting to the chosen chapter which includes the available playable characters as well. Its nice to have there for anyone who enjoys grinding, but is for those who dont mind having to re-equip any characters obtained after that map which is mainly only an issue early on.The art style for both the first and second titles are interchangeable and allows players to choose between the retro art seen for characters or the modern remade look for this version. This can be freely swapped at any time and also changes the backdrop the characters play on to a more modern or retro style. The music can also be changed between the original or modern rendition freely from the main menu, so players can decide how best they enjoy their journey. One thing most players will notice upon beginning Langrisser is that there is no tutorial of any kind and it instead thrusts players into battle without an introduction to even the most basic mechanics. While this may have made sense back in the day with tutorial books were included, for a remake it would have been nice if there were the smallest amount of guidance to explain the bare minimum. While neither title has stories of intense depth found in modern RPGs, the second title in particular feels the most engaging due to decisions drastically changing the outcome of the story and feeling impactful instead of just a tale guiding the characters to the end. Some characters feel generic and forgettable, but the enjoyable combat makes up for the somewhat lackluster stories. Closing Comments:Langrisser is a tried and true return to retro roots. This enjoyable remake is one that long-time fans of Warsong or those who have been interested in the series for a long time finally get the chance to play. While it lacks a tutorial, the mechanics are mostly easy to grasp with a little sleuthing around the menus to understand how everything works. The updated art style is wonderfully drawn, but the inclusion of the original art is what shines most with a wonderful early 90s nostalgic anime style. The story may not last on most memories, but the combat makes this a fun romp with a good amount of challenge. Any fan of tactics titles should absolutely consider diving into Langrisser I & II.", "date": "March 13, 2020", "grade": 3.5}