{"name": "Pokmon Mystery Dungeon: Rescue Team DX", "ref": "https://hardcoregamer.com/?post_type=post&p=369067", "text": "While Mystery Dungeon didnt originate as a Pokmon title, it was popularized in the west by the popular spin-off that would become the Pokmon Mystery Dungeon series. Originally for the Game Boy Advance and DS, Rescue Team Red and Blue started the unique spin-off for Pokmon that would end up being one of its most popular with multiple entries. Rescue Team DX was first unveiled at the beginning of the year during the Pokmon Direct and would have fans wildly excited after a multiple year absence for the series. Lets see just how well this remake holds up and if fans are in for the return to form theyve been waiting for.DX begins with the player going through a quiz to determine which they seem to be similar to, but unlike the original people are freely able to choose whichever Pokmon they like after the quiz has been completed. As with all Pokmon Mystery Dungeon titles, the story follows a human who has been transformed into a Pokmon. Theyre awoken by the Pokmon that was chosen as their partner and are informed they are indeed no longer human despite saying as such. Although confused about their situation, things immediately jump into action as a mother Butterfree comes looking for someone to help save her child who has fallen into a cavern. The two set out to rescue the young Caterpie and after coming out together decide to start a rescue team. As they begin to get into the routine of rescues, the human continues to have strange dreams as cataclysm and earthquakes shake the land. With everyone more or less confused about the whole thing, its up to the newly-formed rescue team to try and uncover just whats going on and put an end to the issues harming the world.Much like most Mystery Dungeon titles, the core gameplay is exploring randomly generated dungeons in order to reach an objective or boss. In the case of Pokmon, progression through is made through both fighting and befriending the enemies that can be met while exploring. Occasionally after defeating a Pokmon, they may want to join the rescue team adventure. Typically only three party members can be brought along initially, but while exploring up to eight in DX may travel together through making friends. Some dungeons have restrictions on befriending, but in general players will be wandering with a large group by the end of exploration. Combat is turn based with each Pokmon allowed up to four moves that have similar effects to the core titles. The difference being that the combat is grid based, with attacks having different lengths they can reach and positioning being important. Pokmon still retain their usual weaknesses and resistances so having a varied team is crucial. Outside of the dungeons there are a few other things Pokmon can do or may want to put time into. The first is expanding their camps where their many recruited friends live. Going to Wigglytuff in the main town area is where more of these camps can be bought to accommodate Pokmon found in dungeons. Each Pokmon has an area they like and not having their area means they cannot be fully recruited. Any Pokmon that cant come along will still offer up some money for a good time through the dungeon, however, so saving up can be quick. Kangaskhan will hold items while the Kecleon brothers will sell them and Persian is the one who will keep money safe for those adventuring through dungeons. The Makuhita dojo allows training with a quick time limit to gain lots of exp, as long as they have tickets to go in. Finally, the Pelipper post office is where new jobs can picked up or rescue teams can head out on a mission from another player in order to save them. An area to evolve also exists since theres no evolution method through normal means, but this isnt unlocked until the main story has been completed.As the name implies, Rescuing plays a big part in DX. Outside of the main story dungeons, teams take on requests from other Pokmon in need of help or items delivered in certain dungeons. Multiple of these can be taken on at once for each dungeon, and completed at ones own leisure. Teams simply enter a dungeon and need to meet the required floor in order to help the Pokmon in need. Of course, one of the most creative draws is that this feature has never been exclusively for NPCs. Players who happen to get defeated in a dungeon can also request help from friends or anyone else around the world. There are two ways to get help, the first most classic method is through a code which players share back and fourth. One enters the code to help the other team, and in return shares a code they receive once the mission has been completed. Those who have Nintendo Switch Online can also take online rescues which allow players to accept multiple at once before heading out and helping. Rewards are given for completion, and much like NPC quests, these increase rescue points that will help level up a teams capabilities along the way. Although a remake, a good slew of new things have been added for returning players to enjoy. The original Red and Blue titles only included up to generation 3 of the Pokmon roster at the time, but the remake ups the ante by including the additional evolution and pre-evolution for those three generations as well as the Lucario line which is unlockable late game. For those that are eligible, Mega Evolution has been added via an item known as Empowerment Seeds. These will awaken any normal Pokmon that uses them, making them much more powerful than normal, but those capable of mega evolution will be able to take on that form when eaten for that floor and help dish out their most powerful attacks. Theres also the inclusion of shiny Pokmon that can be befriended for the first time in the series. Theres only a couple dozen of these, but theyre challenging opponents that wont be easy to recruit without a helpful item found later down the line. A major quality of life change to the title is the ability to freely edit the party team, items and money from the mission select screen. Previously these things could only be done in town, but now theres even an option to save multiple teams to be ready to head out and take on any challenge.While the first two major entries into the series used 2D sprites, there was a shift to 3D models when the series hit the 3DS. Rescue Team DX continues this trend, but with an utterly lovely stylized look. Over every model theres a wonderful texture that makes it look similar to the official artwork and similar to a hand-drawn art style. The backgrounds hold up both in and outside of dungeons, with each area being charming with even more character than ever before. The music is beautifully remixed as it captures the essence of the original soundtrack with its own twists that make each song pop. Theres also a much greater emphasis on cutscenes which originally didnt have much impact but are now wonderfully animated with tons of charming introduction to boss fights and great story moments. One minor drag is that while in dungeons it does occasionally feel like theres a slight delay to some button inputs and rare frame drops when running around with a large team in a heavily-populated area, but this isnt terribly common for the most part. It would also be nice if there was a way to turn off the location of undiscovered items and Pokmon in the main story dungeons without having to turn off the map, but its a helpful feature for those new to the series that doesnt persist in the post-story dungeons. Closing Comments: Many fans felt as though this wonderful spin-off series had seen its last entry with Pokmon Super Mystery Dungeon. This remake is not only fantastic but has revitalized what made the series so memorable to begin with. Whether playing for the first time or revisiting once again, Rescue Team DX delivers an amazing adventure that doesnt end after the story has been beaten. The difficulty is right in the perfect spot thats satisfying to overcome challenges, while being random and wild enough at times that some help might be needed. The art style and music making it worth hunkering down in one area to admire the surroundings, while each new area offers brand new surroundings to never get bored of. Pokmon Mystery Dungeon: Rescue Team DX is on par with if not superior to the original in many ways, and offers the perfect kind of journey for players looking for the latest adventure in the world of Pokmon.", "date": "March 9, 2020", "grade": 4.0}