{"name": "The Rumble Fish 2", "ref": "https://hardcoregamer.com/?post_type=post&p=430761", "text": "Once upon a time arcades were a haven for tournament-style fighting games. While the era where major fighting games rose to prominence on coin-operated machines has long since past, Street Fighter and Mortal Kombat would probably only have a fraction of their notoriety had they been released only on home consoles. Many other franchises have gained prominence over the decades, but not all of them have made their way to the States. The Rumble Fish 2 is such a game that found its way onto the radar of fighting game fans, but never made it out of Japan. That is until now when the 2005 title is finally ready to leave the arcade and challenge American consoles.The Rumble Fish 2 was developed Dimps which was founded by Takashi Nishiyama, who created the original Street Fighter with the concept of having a martial arts games that was entirely boss fights and later created the Fatal Fury franchise. The team at Dimps included other developers that worked on various Fatal Fury and Dragon Ball games. This naturally helped generate buzz around the game given the popularity of these other franchises, but for whatever reason the two Rumble Fish games remained exclusive to Japanese arcades.The Rumble Fish 2 takes place in the future after a natural disaster caused economic and political disruption. PROBE-NEXUS is a corporation that moved its operations into the ruins and begin reconstructing the area, transforming the wreckage into the bustling city known as Zone Prime. In the underground circuit, PROBE-NEXUS funds the Fight for Survival Tournament (FFS). About nine months ago the founder of PROBE-NEXUS announced his sudden retirement, which caused mass panic in the business world, with no announcement of who the next chairmen would be. To distract the public from such things, a sixth FFS tournament was announced, though who is funding it and what their motives are remain unknown.Much like the other fighting games the development team is known for, The Rumble Fish 2 is a 2D fighter. Taking an initial glance at in action doesnt look too different than other 2D fighters, but it does rely heavily on multiple gauges in addition to the health bar. Underneath the health bar is a guard gauge that gets depleted when blocking attacks. It regenerates over time, but if its completely depleted, the character will be unable to effectively block incoming attacks. On the lower corner of the screen theres the charge gauge, but its divided into an Offensive section and Defensive section. Attacking and defending fills their respective gauge. The offensive gauge can be used to power Offensive Arts, Advance attacks and Jolt Attacks. The defensive gauge can help a player thats getting slaughtered by unleashing Defensive Arts, Quick Recovery and Impact Breaks. When both gauges are full. the player can use it to unleash an Ultimate Attack.There are a total of sixteen characters, and given the previous works of the developer, it should come as no surprise how varied some of the designs are. Mito wields a sword and due to her height doesnt quite look old enough to be participating in such a tournament. Conversely, Bazoos towering height and starting each match in a cage suggests he might have something in common with Frankensteins monster. The remaining characters fill out the roster with their variety, hailing from different parts of the world with different martial arts styles. The modes in The Rumble Fish 2 are about the standard fare for fighting games. Arcade mode takes the player through seven fights against some of the various characters before pitting them against the final boss fight. Survival mode is the endurance test of how many fights they can survive and Time Attack is testing how fast a player can complete the game. Theres a training mode to help players get acclimated to the the nuances of combat and a Gallery. There are two ways to experience Versus mode as this port supports both local competitive multiplayer and online through the use of rollback netcode.Having been released in 2005, The Rumble Fish 2s graphics look like a product of its time. It isnt native 4K and does show some pixels, but aside from this has a unique fluidity to its animation. This is done through the Smooth Model Animation (SMA). This animation technique allows the limbs of the sprites to be animated independently. Its an optical trick that makes the animated characters appear as if theyre moving in way thats closer to real life than in more conventional animation approaches. It may not seem impressive now with the advances that have since been made in graphics and animation, but compared to its contemporaries it gives the title a distinct visual effect that helps it stand out among the crowd. The Rumble Fish 2 was released in the twilight of the 2D fighters heyday. The thing with this particular genre of game is the template for fighters is pretty much the same at its most basic level, but the games that stood out were the ones that had some unique characteristic. Mortal Kombat had gore and fatalities. Killer Instinct had intricate combos to memorize. The Rumble Fish 2 has its multiple gauge system. Playing through the arcade a mode a couple times it seems like its just a typical fighter, but after spending more time getting to understand the system gameplay, can become intricate and complex. Utilizing the different offensive and defensive techniques adds another layer of strategy to a game that requires decisions made in about a second. There is quite a bit of variety in characters, and learning how each handles is part of the fun in any fighting game, but mastering the different types of techniques with the two different gauges makes becoming a FFS champion that much more rewarding.The Rumble Fish 2 looks faithful to how it would have looked if it were to be released in 2005, save for the upgrade to 16:9 aspect ratio. The art style and animation work well together, giving the movement of the 2D sprites almost a lifelike quality. It has just the right amount of technical adjustments to look at home on modern display units while maintaining its original style. Closing Comments:The Rumble Fish 2 has developed a cult following since its release and its no surprise why after finally being able to play it. It can go toe to toe with any of the other fighting games of its era. The multiple gauge system brings another element of strategy to each match, but getting past that feature, The Rumble Fish 2 delivers a polished fight experience that includes the requisite staples of the genre. The roster of fighters features several interesting designs and varied fighting styles. As with any game being available seventeen years after its original release, it may not appeal to everyone, but this is one of the top contenders viewing it through a lens of 2005 gaming.", "date": "December 7, 2022", "grade": 4.0}