{"name": "Raiden V: Directors Cut", "ref": "https://hardcoregamer.com/?post_type=post&p=275778", "text": "Shooters dont tend to come in series. Theres the occasional Gradius, R-Type and Gridrunner, but at best they tend to run for a game or two before coming to an end. Gradius V and R-Type Delta seem to have been the end of those two series, but Raiden still drops a new game every now and then at a slow but steady pace. With twenty five years under its belt, Raiden has seen plenty of gaming fads come and go and the industry evolve into endless new shapes, but at its heart remains basically the same. Raiden V: Directors Cut may have more weapons, plus a fancy voice-acted storyline thats basically a radio play constantly running behind the action, but its still instantly recognizable as a successor to the classic arcade game.All the series staples are there, including the classic weapon set. At the start of each game you can choose from one of three weapons for each class of red, blue, and purple, customizing your arsenal to your liking, and as a new addition can even choose which color your ship starts with. The red weapons are a spread shot, blue is a focused beam, and purple is a homing laser. Each weapon comes with three variations, and while the first selection in each category is the classic version the others are either all-new or returning secondary variations. The red weapon, for example, comes in the standard spread, a different version thats more focused but angles left and right as you move, and a variation that you control the angle of spread by moving up and down and then locking into place by holding down fire. The purple Catch Plasma is particularly fun to watch when enemies start swarming in, as the homing plasma balls tethered to the ship by an electro-leash dart out like fast rabbit-punches knocking the swarms out of the sky as quickly as they appear. For more technical-minded players the blue Reflect Laser provides plenty of strategy as it shoots out a crystal that refracts the blue beam like a spinning laser disco ball.Each weapon starts at level 1, and shooting carriers drops a power-up that cycles slowly through the colors so you can use it to enhance your preferred gun up to a total of nine times. In theory, when coupled with the ability to customize your loadout, this means youve got a versatile, personalized fighter at your disposal. In practice, though, what tends to happen is you choose your starting weapon and stick with it to the very end. Its hard to go from the destructive power of a level seven spread shot to a level two toothpaste laser, and thats compounded when coupling the weapon of choice with one of the three ships. The blue laser, for example, is very powerful but also relatively thin, so its best used with the fast Moulin Rouge ship. The average Azuma works nicely with spread, while the slow Spirit of Dragon pairs best with homing. Its worth accepting either a downgrade in power or slower progress to the strongest weapons, though, because maxing out all three of them earns the true final boss and the good ending. The good ending also requires the S-ranked path through the level, which is supposed to be earned by playing well, but in actual play I found that you get this path just by showing up, holding down the fire button, and maybe dodging a bit. While flying up the screen and shooting things is nice, a good shooter relies on its sub-systems to give the player plenty of options for any situation, and Raiden V has a couple that not only help with scoring but also save your butt in a tight situation. The central scoring mechanic is the Flash meter, which is basically a score multiplier up to 6x that depletes fairly quickly if you dont keep shooting things. Defeated enemies also drop medals, and you can either pick them up manually or let up on the shot button to reel them all in at once after a half-second wait. The standard bomb is the usual helpful screen-decimating explosion, canceling all bullets and doing a hefty amount of damage for a couple of seconds, but the Cheer system is more fun to use. In standard mode the game is always online, with a box on the left showing when other players achieve certain goals. Hitting the Cheer button sends a bit of goodwill their way, and in turn they do the same for you. The Cheer Call button acts similarly to a bomb in that it wipes out all bullets, but also adds a hyper-powered secondary weapon to the ship for a brief period. The primary differences between Cheer and bombs is that the Cheer only clears out the bullets on screen at the moment its pressed, rather than for the duration of the attack, and the hyper-powered attack is one of three different sub-weapons that might as well be random for all the control you have over it. Cheer is also a refill-able resource, and while you cant spam the attack you can make a good distance in the higher levels by alternating bomb and Cheer.That doesnt mean Raiden V is easy, by any stretch of the imagination. Sure, you can quarter-feed through all eight levels to final boss and earn the good ending while doing it, but score resets with every continue so death has at least a little consequence. Unlike previous Raiden games youve got a single health bar instead of multiple lives, and the three different ships have individual armor ratings determining how much damage they take from a hit, but the result is still the same in the end- if you want single-credit to the end of Raiden V its going to take a while before the later levels stop soaking up a load of continues. Raiden V describes itself as bullet hell but while its certainly got the difficulty this isnt an accurate description. In a bullet hell shooter the enemies let loose elaborate patterns that blanket the screen with firepower, with the focus being on making it very difficult to navigate out of the way of the small number of bullets that are actually aimed at the player. Raiden Vs shot patterns, on the other hand, want to shoot the ship out of the sky with a minimum of wasted effort. There are a large number of enemies with plenty of different bullet patterns to weave through, but these are focused at the player with only a few sections throwing out screen-covering bullet gauntlets to navigate. There are a few attractive patterns, sure, but for the most part the enemies want the Raiden fighter dead rather than going Ooooh at the pretty fireworks display. While most of the enemy firepower moves across the screen at a quick but fair speed, though, by the time you get to the final bosses it becomes less about reaction and more knowing whats coming, because the bullets are moving just too quickly for any kind of reflexive dodging.While only the last boss or two overdo it on the fast bullets, there are several places in the game where color issues make it harder than necessary to avoid a hit. A blue bullet on a blue background is never a good idea, and while they show up fine in screenshots its not quite so simple when everything is moving at a fast pace, enemies are swarming in every which way, and bullets with a better contrast soak up all the attention. Its the kind of thing that justifies leaving a game on Free Play and not worrying about the credit-feeding. The other major issue with Raiden V, at least on the PC version thats being reviewed here, is that the port is technically weak. Raiden IV has screen-sizing and tate mode, but this is nowhere to be found in Raiden Vs options. The game speed is tied to your monitors refresh rate, which is perfect if youre at 60hz and not so good if youve got a nice gaming rig with a high refresh-rate display, and I cant even call this an amateur-hour mistake because the indie scene is packed with hundreds of developers who dont do this. There had also been an option for those preferring the Japanese voices to change the .ini file to get them, but that was removed in a patch. Its hard to know whats going on with the PC port of Raiden V seeing as neither patch at the time of this writing has come with any update notes, but its not particularly inspiring. Closing Comments:Raiden V is a good, solid shooter and it helps that its got the power of its heritage to draw on. The radio play running in the background adds a story to a series thats never had one before, and while the voices can be hard to hear and pay attention to, its good to know its there. The Cheer system is a nice addition, adding flexibility for handling difficult situations that complement the standard bombs nicely. Letting up on the fire to collect a floating swarm of medals can mean accidentally letting a swarm of enemies fly off the screen, making for a good risk/reward situation, but it wont effect your path ranking if you pay attention and stay on top of the game. The end-of-chapter commentary on performance might chide you for letting enemies escape, but so long as the score is good, youve earned the S-ranked path to the next level, maximizing further scoring potential and maintaining a shot at the proper ending. Its a bit of a mystery how the game mishandles something as basic as bullet color-contrast, and while its nice to have Raiden V on PC, its odd that it doesnt support features that were in Raiden IV (including the lack of the screen refresh-rate bug), but these are issues that can be tolerated. When the game gets going and enemies swarm in from the sides with tanks firing from the ground and bigger ships letting loose with targeted swarms of bullets, the action is as good as its ever been. Raiden V: Directors Cut ends up being a shooter worthy of its history and does a good job of keeping alive gamings longest-running Japanese arcade shooter series.", "date": "October 16, 2017", "grade": 3.5}