{"name": "Lightmatter", "ref": "https://hardcoregamer.com/?post_type=post&p=365090", "text": "Its not easy to save the world. Society doesnt need a hero with rippling muscles and cool shades, but rather people with good ideas and the expertise to see them realized. Virgil, the CEO of Lightmatter Technologies, almost managed to pull it off. Hes discovered a substance he calls lightmatter thats basically a perpetual motion machine, putting out more energy than it takes in. It can revolutionize everything, because what mankind needs to make the world a better place is an energy source that doesnt make the place worse than before it was extracted and burned. Wind and solar are coming along nicely but lightmatter promises to be far easier and more powerful than both of those greener options put together. The launch party at the caverns in Virgils mountain laboratory in full swing with everything going according to plan, and then Lightmatter starts right after the point when it all goes horribly wrong.Waking up just in time to miss the last train to the exit, you the player are stranded in the heart of the mountain, physically alone but with Virgil on the intercom to guide you to safety. He may be sarcastic and working with an ego and arrogance thats second to none, but hes not a bad person overall. The entire place is falling apart, strange rumblings shaking the mountain and hes still taking time to usher a lost straggler to safety. The problems quickly start mounting, though, as every escape route is blocked or falls apart, routing you deeper into the lab and farther from the light that keeps the shadows at bay. The darkness has turned into an oily film that absorbs any human it touches, leaving the surrounding area, the occasional plant and lab-cat Lux in peace. Theres probably deep science-y reasons on why the shadows are picky in their diet, but the point is that a misplaced foot is instant death followed by instant respawn to a few seconds before the accident. Thankfully the lab is filled with two types of helpful light-emitting items. Portable spotlights shoot out a cone of light, small at the base and huge on the other end, while photon connectors generate a near-solid beam. Both tools have their drawbacks, such as the way the spotlight doesnt illuminate its own feet so you cant carry it into the shadows, while the photon connectors, as the name implies, need a line-of-sight connection to function. So long as theres a visible energy source, whether it be the originating point or another photon connector, they generate the beam, and if it gets too close to an interrupting edge the beam turns from white to dark red as a warning. Combine this with various types of switches that move bits of the environment around and each new section of the lab is a puzzle about how to not get swallowed by unintended consequences resulting in darkness.While the only living thing in the lab is you (and inanimate plants plus a cat whos happy to snooze whenever it likes) its not lonely down there because Virgil has found his perfect audience: someone who cant talk back. The comm system is busted so hes only getting video feed and hes happy to chat about anything along the way. Generally with a snide comment, of course, but when its the dozenth time using an elevator to raise a spotlight to shine on a light-sensitive switch that opens a pathway that, hopefully, will be lit up by the other spotlight shining down it in a way that means you dont get eaten by shadows, its not unreasonable to hear a grumble about the equipment being abused. The monologue shows up at the start of each new room while other commentary is triggered by random events, and its well-voiced enough that I listened to every word. Virgil is a difficult, complicated person, and the story of the lab and development of lightmatter comes out in bits and pieces all through the well-written adventure. Closing Comments:What makes Lightmatter work isnt the puzzles or the story but how well the two fit together. Every new room is a different challenge and comes with its own chunk of story as well. It also helps that the game has a distinct art style, mostly blues and blacks but with everything clearly defined in bold solid colors. The player moves at a decent speed, and movement is nicely responsive so theres never any impatience at enacting an attempt at a new possible solution. Theres an unanswered mystery as to the players identity, teased at but never revealed in any kind of believable way, but in the end its not important. The player is in the right place to fix the lab when it all goes terribly wrong, surviving the puzzles all the way to the final semi-morally-ambiguous end. Whoever the player was at the start, theyre the ones who have to deal with the consequences of Lightmatter.", "date": "January 14, 2020", "grade": 4.0}