{"name": "Raw Data", "ref": "https://hardcoregamer.com/?post_type=post&p=275638", "text": "The wave-based shooter is to virtual reality as what screaming nonsensically is to YouTube videos. Basically, when someone wants to create content for a platform but doesnt actually have a good idea, its the default. Even so, through a long Early Access period, Survios managed to be one of the quickest adopters of the idea with their title Raw Data. It was also arguably the best, though it was incomplete. Watching it grow from a handful of levels with a couple of characters to the final product it became was rather interesting. Seeing the quality that came through listening to the audience as well as careful attention to detail be brought to fruition was an engrossing process. The end result is the current pinnacle of the pick up and play VR experience, while offering a decent amount of replayability.The story centers around members of the cyberpunk anti-corporate group SyndiK8. There have been rumblings that the massive corporation, Eden Corp., has been engaging in some nefarious practices that need to be exposed to the world. This corporation also, apparently, employs the infamous Box from Silicon Valley as the only way to retrieve the information is via a direct incursion of the companys home office. So, its up to the players under the guidance of a floating robotic tour guide, Wilson, to collect the data and escape. This problem lies in the fact that the corporation takes CPI compliance and other security standards very seriously. When the files are being gathered, swarms of armed and aggressive robots will converge on the spot to prevent it, all while leaving one to wonder how Murderous Mechanic Army fits into Six Sigma.Its not like SyndiK8 is unprepared. There are four classes, each with their own weapons and style of play, from which to choose. While they are all excellent, the best one is probably Bishop. This dude packs dual pistols with a quick reload feature that can be unlocked, allowing the player to feel a bit like John Wick. With enough practice, a player can lay down pinpoint damage from a distance while still being formidable close up. Through use of the motion tracked controls, I became particularly adept at a pistol uppercut when a bot gets close, firing a round through the chin straight up and, usually, destroying the robot. The other characters each have their own unique benefits. Boss comes packing a pump action shotgun that can shred kill-droids with grenades, along with his powered fists. Saija is a sword wielding badass that can remove parts from the machines with ease. Finally, there is Elder. While there is no shame in being the last in a particular group, Elder is probably the least fun to play. Rocking a bow and arrow is fine and all, and the mechanics work, but Elder doesnt have the immediate and visceral satisfaction that one can get from the other characters. Unlike the other characters, I was never able to come to grips with using this load out in an effective manner.One should address the melee combat, particularly with Saija. Frankly, it feels a bit silly at first due to the fact that one feels like they are flailing with the wands instead of taking the role of a bladed violent decommissioner of automatons. The best advice is to stick with it and stay cool. With practice and environmental awareness, its possible to use Saija in such a way that the player almost feels overpowered. Just choose the best strikes and dont be afraid to use telekinesis moves often. Using movement is vastly important to surviving Edens security. There are plenty of points where the player can physically duck under cover for a brief respite, but staying mobile is typically the best strategy. As such, Survios has two locomotive options available. The first is the original teleportation system, allowing the player to point at a spot a reasonable distance away, press a button, and immediately warp there. Obviously, the idea behind this style is to avoid motion sickness. As more and more people grew used to VR, Survios decided to add a direct control option, using the trackpad or stick to move the player through the world directly. Each has its own gameplay advantages. Teleporting makes dodging much easier, as it can be done with a flick of the wrist. However, direct control feels more visceral and engrossing, as well as removing the chance that the player might accidentally poorly aim a warp in the heat of the moment and end up in a worse spot than before. Players new to virtual reality should stick with teleportation for the time being, though.One of the cooler aspects of this title is that each stage can have its own mood. Some of the arenas are brightly lit and allow for the player to set up friendly autonomous turrets to assist with the horde. Others are dour and poorly lit, setting a tense mood that is driven home when a shrieking robot manages to get the drop on the player. With the immersion the VR can afford, and the timing of these moments, Raw Data is the first game in a long time to actually land a jump scare on me. Kudos to Survios for that, those jerks. No matter the stage that is being played, whether alone or online (if playing the PC version), there is never a feeling of boredom. All the way up to the incredible final level, this game doesnt stop with the memorable moments. Of course, there will be three other character classes to master when the game is complete, as well as the PvP mode, Hostile Takeover, to dominate.That last is currently the only objectively weak link in the package. When playing here, I experienced quite a few drop outs during play, losing my connection during inopportune moments. My initial theory was that sore losers were dropping out early, but I experienced the same issues when I was the one getting crushed. As I never had any problems when playing cooperatively during the campaign, these issues seemed a bit odd. Even when there were no technical issues, the death battles found in Hostile Takeover never quite reached the level of elation that comes from indiscriminately decimating the robot swarms. Closing Comments:While one mode is a bit technically spotty, that becomes immaterial when the entire package is brought into focus. Raw Data is absolutely the game that every VR owner should play. It has humor, scares and a metric crap ton of cool ways to blow things up, all with some major replay power to keep headset on and sweaty. It just feels great to play and looks sharp while doing it. Raw Data will convince people of what virtual reality can do and stands as the best overall title for the medium.", "date": "Bohn on October 14, 2017", "grade": 4.5}