{"name": "Shenmue III", "ref": "https://hardcoregamer.com/?post_type=post&p=362839", "text": "Eighteen years ago, fans of the Shenmue franchise were left on a massive cliffhanger at the end of Shenmue II. For nearly two decades they had to simply ponder what Yu Suzuki had planned for the storys continuation. When a Kickstarter campaign to fund Shenmue III was announced during Sonys 2015 E3 press conference, fans went wild. They quickly funded the project far and above its $2 million goal. In the end, it raised over $6 million from devoted fans. The team received further funding from Sony, publisher Deep Silver and Epic along the way. After all this time, Shenmue III is finally out in the wild and in players hands. Is it possible for this game to live up to the expectations of fans everywhere?This question is, of course, impossible to answer. Everyone expected something different from the third game in this beloved trilogy. Some would have loved to see the game streamlined akin to the Yakuza series. Others wanted the exact same thing they played back in the early 2000s. Ys Net opted to push more toward the latter  but not entirely. In many ways, Shenmue III feels like a Dreamcast game which was simply lost for many years. The classic gameplay of exploring a huge, lively town is still fully intact. So too are the multitudes of side quests, minigames and mainline quests which require questioning tons of townsfolk to complete. Back in the day, many gamers were so enamored with Shenmues world that the fetch quest style gameplay never felt tedious. As were now in 2019, the allure of an open world is not nearly as unique.Fortunately, the game kicks off in an open world that we dont typically see coming from big developers. It starts players off in Bailu Village, a rural Chinese town which is both visually arresting and packed with things to do. There are a good deal of sidequests just waiting to be found as players progress through Ryos main quest. Collecting capsule toys, picking wild herbs, and helping out the townsfolk in Bailu and the second in-game area could easily add dozens of hours of playtime to the overall experience. Smartly, once its time to move to the second area, the game alerts you that you cannot go back. That way you know to not progress the storyline if there are still sidequests youd like to finish in the current area. Anyone who has played a Shenmue game before is familiar with the fact that many main quests play out in a similar way. First you must question numerous NPCs for information, then use your newfound information to go to a specific location or person. At that point you may be able to move onto the next story beat or be required to complete another list of tasks before a character will help you or an area will open up. If someone brand new to the series picks up Shenmue III to start theyd probably be surprised with this style of gameplay  and they might even get frustrated. Unfortunately, there are points in this game which will likely test the patience of even the most die hard fans. Certain points in the game are clearly designed to artificially elongate the experience. For example, even if you are powerful enough to beat a certain character in a fight, the storyline forces you to fail and complete a multitude of other tasks first. A smart tweak was to allow warping to a different location or time, but this only happens under specific circumstances and cannot be called up at will.One change to the classic Shenmue formula is its fighting mechanics. Back in the day it was a matter of simply getting good at the combat controls to win fights. Now players must level up various fighting skills via practicing in order to win difficult encounters. Practice is managed by sparring or training via simplistic minigames. At times it feels rather fun to practice with Ryo and see his skills continue to climb, even though all hes doing is punching at a wooden post. After a while though it turns into a bit of a grind. As for the fighting mechanics themselves, theyre solid and after a while youll begin to master them. There are multiple difficulty options to choose from, but even the easiest mode still requires players to level up their abilities and know how to fight strategically. Something that was always a bit goofy with the Shenmue series was its NPCs. Not only were they totally unique, but they were often silly and had stilted voice acting. The middling voice acting returns which hopefully pleases purists but might also annoy or confuse newcomers. One thing thats missing from previous games is more memorable NPCs. Aside from one or two new characters, people arent likely to remember many of the folks they met on their journey, for better and for worse. Perhaps the biggest disappointment is how some of the newer important characters are not given nearly the attention they deserve. Although Ryo is accompanied by Shenhua, and their fates are deeply intertwined, it feels like a solo quest the majority of the time.One way Shenmue has changed since its inception is in the graphics department. Walking into Bailu Village for the first time hammers this point home. The vibrant flowers and lush green hills stretch on as far as you can see. Its a beautiful town and shows just how much care went into creating colorful, detailed worlds that look great on modern platforms. Fortunately, playing on an old PS4 rather than a PS4 Pro does not hamper the experience. Unlike some newer games which run poorly on original hardware, this one works perfectly fine.Seeing Shenmue III to its conclusion can take anywhere from twenty to fifty hours. This is due to the densely-packed quests and large areas to explore. Yet, for all that time, we do not get to see a great deal of forward movement in the overarching storyline. If this game were a movie then it would best be boiled down to a training montage in the middle of an action film. Players put in a great deal of effort getting Ryo ready for a massively important encounter rather than receiving answers to mysteries fans have been curious about for years. Yu Suzuki has long maintained that he wants Shenmue to be a many-part series. This is clear by the conclusion of the third game. It does not bring closure the series. It begs to be continued with yet another game. Heres hoping it does not take another eighteen years for a future sequel to come to fruition. Closing Comments:Some players may want to mainline Shenmue III in order to see all the story has it has to offer as quickly as possible. This is not advised. For one, theres actually not very much new story information to glean during a playthrough. Secondly, doing so would make the more annoying aspects of the game all the more glaring. Its much better to savor Shenmue III at a leisurely pace. Theres tons of enjoyment to be had simply taking in the scenery, wasting hours fulfilling weird requests for NPCs or even just fishing. It may not be perfect, but it is undoubtedly a Shenmue title. Even after all these years, there are no other games quite like it out there.", "date": "November 27, 2019", "grade": 3.5}