{"name": "Romancing SaGa 3", "ref": "https://hardcoregamer.com/?post_type=post&p=362689", "text": "Its not a clearly-defined era, but theres been a few instances where the 90s have been referred to as the Golden Age of RPGs. While the best era of RPGs is highly subjective, personal and up for debate, the decade that began in the 16-bit era has some arguments going in favor of it. One reason is the vast differences in hardware capabilities in the new 16-bit consoles compared to their predecessor and another was that only a selection of JRPGs actually got localized for the US. Romancing SaGa 3 was a title that never made it stateside in 1995 but now western gamers are finally getting a chance to experience a 16-bit classic on a legit platform.Romancing SaGa 3 places a lot of emphasis on a character-driven story. At the start of game the player selects one of eight specific characters to be the main character while the other characters maintain important side roles in the story. The decision made here does impact how the story will unfold in a given playthrough. The choices vary between men and women with different classes and societal backgrounds. An Adventure Log is a new addition to the modern re-release to help flesh out the story. The story includes a rather inconvenient event that occurs every 300 years called the Rise of Morastrum. This event may have once been an inspiration to Mr. Burns since it blots the sun from the sky and brings death to all the life that was born. This apocalypse has been defied twice which resulted in a great evil called the Archfiend and another entity called the Matriarch. The next occurrence of the Rise of Morastrum is due and the world has begun speculation on the next destined child.Nonlinear gameplay isnt a term that is widely associated with JRPGs and this was especially true in 1995. Sure, there are sidequests and end game content, but generally there is a linear story progression for the bulk of the game. Romancing SaGa 3 does not adhere to this convention. After the introduction the player is turned loose into the world to explore things as they see fit. Along with the freedom to tackle the world at their own pace the choice of character has an impact on the gameplay experience. Each character has their own agenda and goals so different minigames and unique quests become available depending on who is selected. For example, if Thomas is the main character (or at least in the party) the player can acquire and run businesses. If Mikhail is the main character a minigame becomes available where he sits on the throne and can manage domestic affairs. Combat in Romancing Saga 3 is initiated when the player comes into contact with an enemy marker on the area map. In a lot of ways the format is what everyone has grown to expect from JRPG turn-based combat, but there are a few noteworthy differences. The player has an option to choose between Fighter or Commander mode. Fighter is where each party member has their action decided by the player whereas Commander mode the player just controls the main character while everyone else acts on AI based on parameters set by the player. Stats can sometimes increase after battle, but Romancing Saga 3 uses a system where the used commanders are the ones that will increase in power. Character growth isnt too far removed from the Final Fantasy II where it seems to occur at random intervals where players learn certain skills after battle along with the gradual stat increases.In addition to standard battles there are some instances where Mass Combat will occur. There are large scale battles between armies that are too massive to approach in the standard way where each character gets a turn. Players can manage the tactics and formation in battle prep and then watch the battle unfold. The way these battles are handled isnt incredibly complex but it does add another dimension to the overall ambition of what the developers were originally trying to create when Romancing Saga 3 was originally released. Being one of the more ambitious titles of 1995 and being released for the first time (on a legitimate platform) in 2019 is a bit of a double-edged sword. Open-ended exploration is a nice feature in RPGs and is a common feature in newer ones but in the 16-bit era linear story progression was a useful narrative and gameplay device. Romancing SaGa 3 may give players a little too much freedom without much direction, so left to their own devices the player may get frustrated meandering through the game world trying to figure out what to do. The story is interesting enough but without the fleshed-out portions in the Adventure Log finding a way to make sense of the information the game throws at you is difficult. Its also recommended to look at an online guide about the main character differences since the choice made at the beginning of the game does impact it a lot and not much direction is offered. On one hand I want to applaud the game for making so many outside of the box design choices but the execution of some of these features falls short from the mark.For a 24-year-old game Romancing SaGa 3 looks and sounds great on the modern consoles. The graphical facelift it receives looks great on HD displays while maintaining the charm of the 1995 pixel sprites. The soundtrack is impressive, showing that even in the era of chiptunes there were some great musical compositions in gaming and RPGs tended to boast the best game soundtracks. Closing Comments:Romancing SaGa 3 is a game that is easier to respect for some of its design choices that were better realized in some later games than simply for being fun. There are a lot of things to like about it, but what passes for ambition and pushing the genre forward in 1995 comes across like an experimental convoluted mess in 2019. Removing the nostalgia filter, a lot of the gameplay elements of Romancing SaGa 3 simply wont be that enjoyable for people who are die hard RPG fans of that era. Keeping that caveat in mind, fans of that era of gaming can find a lot to enjoy in this title, provided they are willing to deal with the lack of direction and unconventional approach to the JRPG formula.", "date": "November 26, 2019", "grade": 3.5}