{"name": "Stardew Valley (Nintendo Switch)", "ref": "https://hardcoregamer.com/?post_type=post&p=275445", "text": "Stardew Valley hit the PC market about a year and a half ago and gave the platforms users something that console gamers had grown accustomed to  a farming simulator. This may seem like an odd genre to find a lot of enjoyment from, but Stardew Valley finds many ways to create an enjoyable experience with an unconventional concept. Eric Barone was inspired to create the game after playing Harvest Moon and wanting something better  so he rolled up his sleeves and created something that took the farming aspect of that franchise and combined it with a bit of Animal Crossings larger-scale world and social integration.The adventure begins innocently enough, with your self-crafted character beginning by taking over his grandfathers land  but having to pick up everything from scratch. You didnt inherit his farming talent, or seemingly, any social skills as its all too easy to just wander into folks houses and be informed that you simply arent good enough friends with them to barge into their rooms. Its soul-crushing, but a fun reminder that what may be appropriate in 99% of RPGs created over the past 30 years is actually a terrible invasion of ones privacy and personal space. Seeing a farming simulator may be intimidating at first, but Stardew Valley introduces you into that aspect of things gradually and explains it with a great amount of ease.Youre told what your first harvest should involve, given clear instructions on how to go from step one to two to three, and then accumulate money over time as the crop builds up and generates more income for you. The game can be a pure farming simulator if youd like it to be, but the game encourages you to do more than that by showing off how physically tiring the act of farming is. If you do it too much, youll pass out and have to be brought back to safety at your own expense  something you want to avoid having to do since money can be quite scarce, especially early on. Stardew Valleys learning curve is gradual, and there are many small ways to make money that are reliable. Beyond farming, you can destroy trees and bushes to harvest material that you can ship out for small amounts of money. These methods wont make you rich, but will ensure that you always have some spending money for the essentials. Fishing is another great way to make money, and its a lot of fun to cast a line out, feel the fish biting, and then hit the Y button to activate a mini-game when youve got a live one. Mashing buttons with a bit of rhythm is the name of the game here, and can net you some big rewards without taking up a ton of time. Fishing in the game reminds me a lot of Animal Crossing, where its a task that I normally wouldnt enjoy in a game  but its done so well here that it works. Animal Crossing added a lot of comedy to catching fish, while Stardew focuses on bringing the relaxing nature of fishing to a video game. Its just you, a body of water, your fishing rod, and a bit of relaxation. Its easy to find yourself closing yours eyes and just relying on your sense of touch to tell when youve got a bite  then you have to get back into the in-game world and reel that fish in to see what youve nabbed. Big fish are rare, but small fish can still net you some money consistently, and be found pretty much anywhere you can fish. Its a tranquil experience, and one that not only brings out the fun of real-life fishing  but also manages to make it fun as a game mechanic.There is an overarching narrative to the adventure and its one of just living a life, interacting with people, building bonds, and forging friendships. Obstacles have to be overcome, but doing favors for people and generally being someone they can rely on to perform a task will go a long way towards gaining trust. The sense of community here is very much like Animal Crossing, where you eventually get a sense for the personalities of the townspeople and learn about their lives. In that regard, it goes far beyond Animal Crossing by exploring things like fears, mortality, and wanting to have a legacy to pass onto others. The game is very much an allegory for life in that regard, and its moments of reflection make the player do the same. Stardew Valley isnt an emotional roller coaster, but it is a game that makes you care about the cast by treating them like people. If it was a TV show, it would be a docu-drama of sorts  something like the original version of The Office. Traits are exaggerated, but everyone in this world could be someone you would interact with in real life with the volume turned up. There is a layer of believability with the cast that most games lack and would definitely benefit from having because it makes caring about the games events much easier.Stardew Valleys pixel art style is perfect for the Switch. The smoothed-out look is gorgeous on both a TV or on the go and having this adventure playable anywhere youre at is wonderful. The use of highly-detailed pixel art brings out both the beauty of the 32-bit era of 2D games, but also goes beyond that with a level of detail that was never used back then. As a result, being able to see your character wince a bit when hitting something or see different facial expressions. Having realistic proportions helps the narrative out a bit. There isnt a ton of animation, but whats here is solid and the world as a whole looks gorgeous  with rundown buildings looking like they havent been used in many years.This high level of detail holds true for the games sound design as well. In abandoned areas, you will hear every creek in the floorboards along with an ominous, spooky sound effect playing in the background. The soundtrack is very relaxing, and gets you in the mood to rest up before things turn completely silent and youre taken aback by a point in the narrative that throws you for a loop with character depth. The sound design is marvelous  even if this isnt a soundtrack that will have you nodding your head or listening to it much after a play session. The game itself is relaxing, while also being exciting despite being a game that isnt typically seen as exciting. Closing Comments:Stardew Valley brings a mix of farming and life simulation to the Switch and the platform is absolutely perfect for it. Being able to pick up and play the game for a quick bus ride allows you to get in a quick meeting with a couple of people or take care of some light farming. Then you can play at home and enjoy it on a TV screen to really absorb yourself in the adventure. Stardew Valley was a top-notch game on PC and on the Xbox One and PlayStation 4 before  but it feels truly at home on the Switch. Anyone who loved Animal Crossing or Harvest Moon will get a lot out of it. Even if you havent played those games, if you want a good adventure that has some drama, humor and a slice of real life thrown in, give Stardew Valley a shot.", "date": "October 14, 2017", "grade": 4.5}