{"name": "Pokmon Sword and Shield", "ref": "https://hardcoregamer.com/?post_type=post&p=362285", "text": "Pokmon as a series has gone through many changes since launching back in 1996 and we fans have evolved right alongside it. The release of Pokmon Sword and Shield is a culmination of many factors and aspects of the beloved series; these two games pack in nostalgia, strategy, advancements and of course, interesting Pokmon. There is much to discover in the Galar region, so lets raise our swords and steady our shields for a brand new adventure. Some minor spoilers are ahead.The story in Sword and Shield is great, hands down one of the best of the series. There are some twists and turns along the way with a fun group of characters. Even gym leaders become deeply involved with the plot which should always happen in Pokmon games. They are basically protectors of their towns and if there are problems or threats they would be the ones to intervene. Things do jump around at times because while you are dealing with a sour rival there are world-ending events happening at the same time. Its not hard to follow but making it more linear and prioritizing particular moments would help. In a short summary though, there are Pokmon able to grow gigantic during battles which is called Dynamaxing, and any of them can do it. The main antagonist is draining energy from its source which triggers cataclysmic events and its up to you and your Pokmon to save the region. Some huge battles take place and when everything settles you will be the new Galar League Champion. Then, there is a bit of storyline after the game ends but with completely new characters that really could have been the main story all along. But because youre already invested in the whole thing saving this for after is still worth the wait. Sword and Shield start like the many Pokmon titles that came before. You are from a small town, this one is called Postwick, which is also home to your rival named Hop. He happens to be younger brother to an important character  Leon the Pokmon Champion. You complete a little mission and receive starter of either Grookey, Scorbunny or Sobble each with the traditional Grass, Fire and Water typing. From here you are on a mission to start the Galar League gym challenge in order to collect all eight gym badges and eventually face the champion. Of course, battling trainers and catching new Pokmon along the way are a given. This tried and true formula for Pokmon games is repetitive for longtime fans but it still works wonderfully. There are some new features and basic Pokmon in the starting area for everyone to get accustomed to before embarking on the huge adventure that awaits, which is why keeping the games like this is important for consistency and educating players.Sword and Shield allows for a great variety of Pokmon to be had before making it to the next town and you will quickly build a team made up of monsters both new and old. Among the mix are Bug, Electric, Dark and a pure Flying type which is a first in the series. This leads us to a surprising amount of new and interesting Pokmon to meet in Galar. There are great type combinations some of which have never occurred in the past. If you want to have a team consisting entirely of Galar native Pokmon there are many to choose from. Go with Blipbug which evolves into a Bug/Psychic-type with high defense and special defense stats. Arctozolt is an Electric/Ice fossil Pokmon who would come in handy against many Water-types. Plus, an adorable army of Spartan-like soldiers in Falinks can be found a bit later in the game. There are many more to choose from the 81 total new Pokmon introduced in the games and each one either acts cute, looks cool, fits well with your strategies or is a mix of all three. Plus, you can find many old favorites to join your team. Theres really no need to knock any of the new creatures and their designs. Seeing Galarian forms and new evolutions on top of that is incredible. But it does make one curious as to why some of them receive a Galar variation because as weird and unique as Mr. Mime is it wouldnt be our first choice to give something new. And catering so much to the first generation is overdoing it in Sword and Shield. Having Charizard as the Champions main Pokmon is a let down because it would have been a great chance to show us how awesome a new Pokmon would be; that the champ of the entire region and most popular trainer around could be partners with one we can all try to strive for. It was a missed opportunity to highlight the new regions toughest opponent. But building up to that match goes well with the gym challenge as it combines classic gym puzzles and battles along with missions introduced in Pokmon Sun and Moon in order to reach the leader. Making us work just a little more for the final match is lots of fun.The biggest new addition to this generation is the Wild Area. Leading up to release we saw footage of Pokmon roaming around a vast land and in the actual game turns out to be quite large. This is where you can find a majority of older generation Pokmon living around all types of terrains and weather conditions. Its chock full of opportunity as you can catch so many different Pokmon but watch out because you could run into one at a higher level and the game doesnt allow you to obtain it until more gym badges have been earned. While its understandable to have a limit it just would have been nice to actually try catching some because you might get lucky. Even with all the Pokmon running around it could feel somewhat overwhelming at times. Too often would a Pokmon spawn right in front of you without warning which would always happen in the old games but since we are spoiled with seeing them out and about already just feels annoying. At least that difficulty counters the point made by players that new Pokmon games have too much hand holding. But yes there is a lot of it happening in this generation. Characters heal your team often, the experience gained by one Pokmon gets shared with them all and there is access to your PC from anywhere. While you dont need to take advantage of two of those examples, the experience share cannot be turned off and youll find some of your Pokmon easily reaching levels much quicker than usual. Trainers trying to catch them all will put all these to good use.Sword and Shield could have used some more polish in some areas. Backgrounds during battles need more variety because you could be indoors somewhere and it appears like an endless void, but more care was placed into outdoor and arena locations. The sound seems to cut or become lower and higher at random moments; usually Dynamax cries can become ear piercing. Attempting to connect with trainers online to help with battles or trades isnt all together yet, as while the majority of times youll have no problems, there are instances of connection troubles. There is some lag, mostly in the Wild Area, but its not bad at all. The Pokmon sprites look fantastic in Sword and Shield, from overworld to camping to battling. The artwork is vivid and more detailed than expected. Plus, loading times are virtually instant and thats a great thing to see in such a monumental task of creating the huge world of Galar. Closing Comments:There are currently over 800 Pokmon in existence but not all of them made it into Sword and Shield and that really doesnt matter. Players still have half the total to mix and match for their teams and the new Pokmon in the Galar are all incredible. Pokmon Sword and Shield truly live up to the Pokmon name by creating an enjoyable experience filled with so many unique creatures. Those who have played through previous generations can come into these games with all their knowledge and still be surprised and blown away at the creativity and strategy. Sword and Shield are amazing as is and truly define the term quality over quantity.", "date": "November 22, 2019", "grade": 4.5}