{"name": "Black Future 88", "ref": "https://hardcoregamer.com/?post_type=post&p=362343", "text": "Last week saw the season finale of American Horror Story: 1984, the latest incarnation of Ryan Murphys horror anthology series. Without trying to go into any spoilers, it touches upon the nostalgic parts of the 80s, the darker parts of the 80s and being trapped in the 80salmost literally, as if the decade was to act as some sort of purgatory. And that was one of the things I thought of as well when playing Black Future 88, the new roguelike run-and-gun game from developer SuperScarySnakes and Good Shepherd. Several games have created alternate history post-apocalyptic worlds based on the 80s, but not only does Black Future 88 evoke the feeling of classic arcade games and synth music, it actually uses the trappings of the era as a plot point. But is the game also trapped alongside the worst parts of the era or is it advanced enough?In an alternate version of 1988, a mad architect named Duncan launched a series of nuclear bombs that had the result of blotting out the sun with endless rain. As such, time became meaningless to everyone, and this it basically became a permanent 1988. Now, in the middle of a synth-punk apocalypse, a group of survivors have decided to climb Duncans massive tower, Skymelt, kill Duncan and stop the rain once and for all. Theres a catch, though: thanks to a deadlock affecting their bodies, each survivor only has eighteen minutes until their heart explodes. So now they quickly have to ascend a massive tower, grab whatever weapons they can and fight of hordes of enemies as quickly as possible. If youve played any retro action game in recent memory, youll immediately get used to the core gameplay of Black Future 88. You have your standard double jump, dash and in a nice addition, the ability to use both twin-stick firing/attacks and regular button attacks. I recommend the former for accuracy, but its always nice to have a choice. Its all smooth as butter, regardless of which character you play as and which weapon youre using. And there will be weapons to use, oh yes. You get fifty guns at your disposal, which range from traditional shotguns and the like to those that use money as ammo, those which can slow falls, and my personal favorite, the Night Piercer, a rapid-fire gun which teleports you to an enemys position after a kill. The choices can sometimes be overwhelming, but theyre all a blast to play with.Also a blast? The grungy, detailed backdrops, enhanced by the vivid colors of all of the gunfire going on around you. The graphics are nice, crisp and a definitive highlight, but just like any 80 throwback, the music is even more amazing, with the synthwave sounds perfectly setting the tone for an epic sci-fi adventure with just the right dose of punk bits. You only get to hear it over quick gameplay sessions due to a time limit, but Don Bellengers tunes are indeed to die for (I mean, its a roguelike, so youre dying a lot anyway, but you get the idea).The time limit is one of the most notable gameplay aspects of Black Future 88, though, and its used well. Roguelikes such as these tend to play up the risk/reward factor, since it causes the player to consider their options carefully. Sure, you could easily exit a dungeon once youve found the exit, but what if a room you didnt check contains any gear you may need for even more difficult challenges that lie ahead? But wait, what if those rooms contain deadly challenges as well? Will you dare to try and uncover everything? Well, take all of that, and then add a ticking clock with a mere eighteen minutes on it, forcing you to think fast. Yes, that wasnt just part of that plot, you only have eighteen minutes to complete each run of the game. This means that while you can explore for any shops, extra guns, ammo and health, or secrets, risking death along the way, now you have to ponder if you even have time for it. And just to add to your dilemma, your time can actually be used as a currency as well. Enter a portal and discover an obelisk, and you can trade one minute for a curse that provides you with beneficial buffs, albeit sometimes with another drawback (like emitting projectiles from your body after being hit, but taking extra damage). Or trade twenty-five seconds or so for a more straightforward buff at a repair station.The buffs and curses are your standard upgrades that are either hidden or that you earn after defeating each boss, with experience earned from every run going towards unlocking more upgrades to discover (along with more weapons and other tricks to works with), and they work particularly well. What ends up being a highlight is the fact that certain combos of weapons and buffs/curses actually unlock boosts. And not just like in The Binding of Isaac where a certain combo of items provides the most powerful powers, I mean a combo of abilities and weapons actually unlocking secret buffs. Take the Night Piercer weapon, for example. If you have it on you and then gain a certain curse that enhances your dashing, suddenly the Night Piercer gets modded and is enhanced to where it can blow away regular enemies in one or two hits. So experimentation is encouraged as well, if gunning for everything. It further builds upon the risk/reward parts and does so in a unique way. Actually, Black Future 88 seems to have quite a few secrets along those lines and others, and Im still hunting for a chunk of them.Hunting isnt exactly easy, as you may have deduced by now. Sure, there are waves of robot and cyborg enemies to deal with, but your biggest enemy is Skymelt itself, which is actually a living tower. If you leave any items around on the floor for too long  weapons, money, ammo, et cetera  Skymelt actually absorbs them, filling up a meter. The moment it gets filled up, new challenges are triggered. More hazards like flamethrowers may suddenly appear, more Hunters  elite mini-boss enemies that drop gear but are more powerful  can be summoned, and even regular enemies can be juiced up. So now you have worry about juggling your two weapons and dashing to collect anything you can. Its a clever twist that adds a bit to the procedurally-generated gameplay.All of this makes for an exciting eighteen minutes, but the most intriguing part was when I finally made it to Duncan, defeated them, andwell, without spoiling anything, lets just say classics are honored, you still arent done yet and even more twists appear in the gameplay. Definitely some wicked stuff. Black Future 88 isnt perfect, though. For one, if youre like me, you might think a retro arcade-style action game like this would be perfect at home on the Switch. And it isalbeit mostly in docked mode. In handheld mode, it did feel that while the action was clear, some of the text was a little small, which can hurt when you have limited time to see what gun was dropped on the floor, for example. There were also a few moments when items actually fell behind parts of the HUD or where enemies would spawn too close upon entering a room. Also, like any roguelike, you can be at the mercy of the random number god, meaning you can already be dealt a weak hand in terms of weapons at the very start. Arguably minor annoyances, but annoyances nonetheless.The one notable flaw with Black Future 88, though, is that it honestly kind of feels too fast at times. Not gameplay-wise, mind you, there the intense speed during combat is part of the appeal, although it does mean it can be tough to pay attention to more rapid-fire stuff at times. The problem is that despite a unique plot, universe and setting, the short time limit and quick pacing for each run means that there isnt much room to actually develop the story.Youll face off against colorful wardens at the end of each area that act as bosses, like the blade-wielding Dr. Avalanche that can split into three selves, or Jupiter and Juno, a man that shoots massive energy waves and is guarded by a giant robot. And while theyre fun battles, you dont get any info on them and their significance unless you check the in-game codex. Its a synth-filled world with a lot of great action, but I wish we could explore even a bit more of it. As is, youre best off experiencing Black Future 88 in regular bursts, coming back to it often, like any good game would still want. Closing Comments:Black Future 88 is almost a quintessential throwback to 80s arcade games, with rock-solid gameplay taken straight from the era and mixed in with several interesting and unique gameplay twists. You may only get eighteen minutes at a time to take everything in, but what youll be hit with is a heavy dose of fast-paced action, a killer soundtrack, and and a ton of weapons and gameplay features to work with that reward you for experimenting and exploring every bit of Skymelt. You may be trapped in the 80s here, but at least youre trapped alongside some of the best parts of it. Well, at least when it comes to video games. We cant help if you get permanently trapped alongside Kajagoogoo or something similar, after all.", "date": "November 21, 2019", "grade": 4.0}