{"name": "Luigis Mansion 3", "ref": "https://hardcoregamer.com/?post_type=post&p=361362", "text": "The original Luigis Mansion released to a great amount of success. It was an early title for the Gamecube and took a unique approach on a more scary title from Nintendo aimed at being friendly towards younger players. The 3DS sequel, Dark Moon, released with a lot of mixed reception as it stepped away from what many people loved about the original. Luigis Mansion 3 came as a wonderful surprise reveal that left fans excited to see what the latest ghost hunt had to offer, but just how well does the spooky adventure hold up compared to the first and second titles?Everything begins in a bus driving down the road with Luigi, Mario, Peach and an assortment of Toads along for the trip. The group has been lucky enough to win a vacation to a luxurious hotel for free and are ready to relax. Upon arrival things seem mostly normal, but things quickly go awry when the crew goes to sleep in their individual rooms. Luigi wakes up to a much darker and eerier hotel than he remembered, and finds his brother and friends missing when he goes to investigate. After making his way down the hallway he runs into the hotel owner and soon discovers an old enemy is back. The hotel owner has been infatuated with King Boo for years, and decided to take manners into her own hands by setting him free and giving an opportunity to capture his nemesis Luigi and his pesky friends. Mario, Peach and the Toads are all captured in portraits and King Boo plans to do the same to Luigi. Unfortunately for the ghastly ghost, Luigi is able to narrowly escape down a laundry chute. Finding himself at the bottom of the hotel, Luigi finds his poltergust among the belongings and has no other choice but to take on the looming hotel tower in order to save everyone.Like the previous Luigis Mansion titles, its up to the fan favorite green mustachioed brother to wander through haunted rooms and find out who or what is causing problems. The poltergust has a few key main abilities. It can suck up objects or ghosts, blow things away, turn into a flashlight to stun enemies and track ghosts or bring objects from paintings to life with a special light. New to Luigis Mansion 3 is the ability for Luigi to do a small jump by blasting air at the ground in order to avoid certain attacks. The new poltergust can also shoot out a plunger to attack to objects and swing them around. Finally, Luigis newest ability comes in the form of Gooigi. Fairly early on Luigi gains access to this alternate form of himself who can switch between controlling. Gooigi can go through many areas Luigi is unable to access and is only weak against water. Gooigi has a small amount of health, but it regenerates over time and being defeated simply means he returns to Luigis poltergust and will need to be called out again. The first and second Luigis Mansion titles took the timid ghost-hunting expert through various mansions. This time around its an entire hotel, and Luigi has to explore every floor to get to the tip top. When he starts out Luigi finds that the elevator is missing the majority of its buttons, and theyve been scattered throughout the hotel in the grasp of enemy ghosts. Each new floor of the hotel offers a vastly different environment for Luigi to explore, with puzzles awaiting him every step of the way. Ghosts are the main obstacles that stand in Luigis path and will challenge him to use all his skills to stop them. For the most part ghosts are captured by first stunning them with the flashlight and then sucking them up slowly. Luigis Mansion 3 adds a brand new slam attack for Luigi to use to deal more damage as theyre being sucked up. The move itself is extremely overpowered and makes things feel much easier from previous titles, but does make some puzzles and fights more interesting to work out. As Luigi progresses, his enemies will begin to get smarter and adorn themselves with ways to block the flashlight and suction. It takes some unique thinking to figure out how to get around it, but its what makes the fights much more interesting until Luigi can finally slam his enemies and end their ghostly existence.Puzzles are easily one of the best parts of Luigis Mansion 3. A lot of the story puzzles are straightforward, but some are extremely clever and well thought-out with cool ways to figure them out. The best puzzles, however, come from one of two main collectibles. Gems are the main collectible players will find, with almost every floor having its own collectible. The other is the classic Boos, which can be found later down the line in well hidden locations. The gems are easily the best collectible, and are extremely well hidden and fun to find. While entirely optional, they offer some of the most creative puzzles that often leave players scratching their head trying to figure out. Gooigi often plays a big role in these puzzles, as his unique abilities allow him and Luigi to work together in order to act like two characters instead of one. There are a few puzzles that are unfortunately time based and are the only ones that were more annoying than exciting if only because failing them means instant death for Luigi. Fortunately the auto save keeps players from having to back track much but the timed element for some of the puzzles is a tad unwelcome. Outside of the main story is a returning multiplayer mode that began with the Dark Moon 3DS title. There are two main modes players can try on with friends either locally or online. The first is ScareScraper, an entirely cooperative mode that puts players in a uniquely generated mansion. Up to four friends can work together to take down ghosts, collect money and upgrades while trying to clear each floor in a set amount of time. This challenging mode requires teams to work together or split up in order to conquer each floor, and is easily the most fun multiplayer has to offer. The second is the ScreamPark, which is a team-based competitive mode. In the ScreamPark up to eight players can go head to head to see which team can collect the most ghosts, money or targets broken with cannons. This mode requires teams to work together in shorter mini-games so it isnt as in-depth as ScareScraper, but is still a way to play with friends in a quick mode to see who has the best team.Luigis Mansion 3 is a simply beautiful title. The cutscenes are gorgeously animated and flow seamlessly into gameplay at a moments notice. The characters are more animated than ever before and the ghosts are full of tons of charm that makes it easy to smile at how lighthearted things are in a haunted hotel. The music is wonderfully atmospheric to set an eerie tone and still be wonderful to listen to. The framerate is consistent across the board, never dropping even when in an area with tons of items or enemies. While there are a couple of floors in the hotel that are a tad short, they make up for it by having memorably fun boss fights that are creative new takes on fighting ghosts. The slam attack is a double-edged sword for this title, as its incredibly powerful while fighting ghosts and makes each fight go much faster than before. It removes a bit of the challenge and is only somewhat balanced by giving ghosts more protective gear from the flashlight, but it might have been better if the slam started much weaker and was upgraded by paying money instead of being powerful right off the bat. Closing Comments:While the 3DS title may have received mixed reception, Luigis Mansion 3 is a wonderful return to form from the first title that does the series justice. Its on par, if not better, than the original simply because of the great atmosphere and wonderful puzzling challenge it brings. While fighting enemies isnt the most difficult thing ever, especially for older players, its still fun and never overstays its welcome between exploring each and every floor in the haunted hotel. Luigis Mansion 3 is an absolutely wonderful time that makes it easy to want to jump in and keep exploring the hotel to find every last secret it has to offer.", "date": "November 5, 2019", "grade": 4.0}