{"name": "Mario and Sonic at the Olympic Games Tokyo 2020", "ref": "https://hardcoregamer.com/?post_type=post&p=361236", "text": "Back in 2007, Nintendo and SEGA made an unprecedented move for video game crossovers at the time and put both of their signature mascots and secondary characters in the same title to compete against one another. Their goal: taking on one another in simplified and motion-control based versions of Olympic events. With the international and family-friendly appeal of both Mario and Sonic combined with the Olympics, the partnership made sense and seemed primed for a decent amount of success. While this team-up has seen a favorable enough response from players to garner four follow-ups so far, none of the titles have been particularly well-received from critics, often due to a lack of depth in the minigames and the meager offerings available outside of them. With the sixth entry, SEGA is looking to address some of these concerns and embrace the potential of this exciting crossover by introducing a story mode to the first game of this franchise to arrive on the Switch. Unfortunately, bland storytelling and brief yet over-complicated minigames offer little excitement for gamers above a certain age in Mario and Sonic at the Olympic Games Tokyo 2020.The story mode of Mario and Sonic Olympics 2020 takes place during the titular event, where Mario and Sonic receive a mysterious Tokyo 64 game console, which, when accidentally turned on by Luigi, transports the two mascots and their rivals, Bowser and Dr. Eggman, inside the machine to a 2D retro version of the 1964 Tokyo Olympics. The resulting story switches between the perspectives of these four inside the machine and the remaining cast, primarily Luigi and Tails, in 2020 as they all attempt to figure out exactly how the game console works and what must be done to return everyone to the present. Despite a relatively intriguing original premise, the story rarely manages to get more interesting throughout its four to five hour length, as cheesy and simplistic dialogue with minimal voice acting pads out the plot as key points get restated over and over every time a new character gets introduced. Despite the variety of characters featured within, most of the text-based conversations feel unambitious and similar to one another as the newly-introduced cast member attempts to forward or halt your progress to acquire gold medals or compete in Olympic events for somewhat convoluted but often uninteresting reasons.The core story mode experience is comprised of exploring two hubs, modern and retro Japan, and visiting the various venues and inhabitants that populate them. Even though the world maps seem open for exploration, there are few opportunities to deviate from the main path, as every side area will ultimately be revisited within the main storyline and only offer forgettable one-liners or related trivia from the Toads and Chaos that fill these spaces. Outside of the 31 3D and 2D Olympic minigames that represent the majority of the gameplay sequences within the story mode, which rarely offer much in the way of difficulty, the campaign does also feature a decent number of original solo minigames starring Tails, Luigi, retro Mario or retro Sonic. These often represent the high points for the adventure, as the 2D story minigames include clear nods to and inspirations from other retro titles while the 3D story minigames usually display some much-needed depth that separates them from the other competitive events contained within, as they arent restricted by the limits of their real-world counterparts. Outside of the aforementioned story minigames, the rest of the available activities are all unlocked right from the start for solo, local or online play with adjustable difficulties and a roster of twenty characters. 21 of them are the expected Olympic-based competitions, which are brief and often offer an option to choose between motion or button-centric controls. While the general motion controls work as intended, a few minigames that require more specific maneuvers with the Joy-Cons can often prove to be frustrating, as the precision required to hit a bullseye in Archery or throw a Javelin at a reasonable angle is nowhere as simple as it should be. Although the buttons are almost always a more reliable alternative, a good number of the minigames adhere too strongly to the rules and real-life moves often to the detriment of the gameplay, making for numerous minigames that feel uninspired and are over too quickly without enough time to fully attain a grasp of the relatively complicated controls. The provided post-match tips admittedly do work in the benefit of replayability, but it far too regularly leaves an unnecessarily sour first impression that does little to delight outside of a few standout minigames including Rugby, Boxing and Equestrian Jumping.In addition to four new 3D minigames, those being Karate, Surfing, Skateboarding and Sport Climbing, Mario and Sonic Olympics 2020 introduces ten 2D events that feature retro 8-bit and 16-bit graphics and sounds coupled alongside Olympic events that were performed at the 1964 Tokyo competition. While most of the 2D competitions lack the depth of the other offerings, their controls are far easier to grasp and the undeniable charm of the nostalgic animations and simplified mechanics go a long way to making them a worthwhile addition. Additionally, dream events make their return and are far and away the deepest and most immediately enjoyable gameplay experiences this title has to offer. Dream Karates deep moveset and unique scoring, Dream Racings power-ups and aerial tricks and Dream Shootings open hub and time-based bonuses bring some much-needed creativity that hold up when playing alone or with others, although multiple courses for each of them would push them even further. The minigame selection would also greatly benefit from a more engaging way to play multiple events in a row, which seems like a relatively simple addition worth considering when a franchise is releasing its sixth entry in the same genre.The retro presentation is as delightful as expected, but the 3D models and environments, while not particularly impressive, do a solid job for their purpose without hampering the Switch. The story mode and minigames run well on both the handheld and larger screens, and although we were unable to test the online performance prior to release, there were no technical issues or frame drops to speak of even across the minigames that required simultaneous splitscreen play. The soundtrack, while far too reliant on one particular track, is upbeat and representative of the competitive spirit of the Olympics, which itself is often embraced within the trivia and general atmosphere during events. The decision to release the game nearly nine months before the actual 2020 Olympics gets underway is somewhat baffling, but the polished nature of the title even without a day one patch is without question even if there were other aspects of the title that could possibly have benefited from a longer development time. Closing Comments:Despite the addition of retro 2D events and a story mode, Mario and Sonic at the Olympic Games Tokyo 2020 does little to improve the franchise thanks to middling minigame design and an empty, lackluster campaign. The more creative and deep gameplay arises in the story and dream minigames, but convoluted controls and brief runtimes hold back the majority of the events from entertaining players for more than a couple of attempts. The simplistic story will likely amuse fans of a younger age, but for most Mario, Sonic, Olympics and minigames fans, this crossover continues to disregard its potential and does little to justify its $60 price tag by offering only a few hours worth of polished but mostly mediocre minigames.", "date": "on November 5, 2019", "grade": 3.0}