{"name": "Super Monkey Ball: Banana Blitz HD", "ref": "https://hardcoregamer.com/?post_type=post&p=359851", "text": "The original Super Monkey Ball Blitz hit the Wii over a decade ago and offered up something a bit different from the norm. Whereas the first two games were a blend of monkeys and a lot of Marble Madness, Blitz came out after the first non-obstacle course entry in the series. Super Monkey Ball Adventure introduced a fully-fledged world into things and brought elements like boss battles and an overarching plot. Blitz had to find its niche and wound up focusing more on obstacle courses as was the series norm, but shifted new elements into places like boss battles and a lot more traditional platforming thanks to the addition of a jump button.This move shifted the gameplay from being a pure obstacle course to then blending in platforming. This brought about a different issue, though  the camera staying in the same place as it would if it was an obstacle course. With the first two games setup, the camera was fixed and that allowed you to move around and see obstacles in front of you and get a bit of a view of the world around you. You didnt have to worry much about the latter because the pre-level pan showed you if you had walls to contend with or not and so you could plan ahead. The shift to adding a jump amid the obstacles wound up creating a much harder and more frustrating experience.With the HD remake of Blitz, the team behind Yakuza had a chance to right a lot of wrongs and create the definitive edition of the game. It isnt often that you have a chance to take a good game in theory and finally make it the great game you can envision in your head, but they had that here and didnt quite reach the heights they could have with this HD remake. The controls as a whole are better since they arent just motion-only as that was a Wii game at the height of waggle-mania, but they arent what they could be. There, not having second stick control for the camera made sense because the Wii Remote wouldnt allow it and the game itself didnt support a more normal control method. Here, motion control has been taken away in the remake  which isnt the end of the world, but it wouldnt hurt to have it as an option on Switch. Instead, the more normal control scheme from the first two games is used, only with a jump thrown in, and thats fine. Its not everything it could be, but the core game is still mechanically sound except for the problematic camera. With the Wii version, waggle could lead to you just not being able to get a clear view for a long period of time due to constant movement shuffling you around. Now, you dont really have that issue with analog stick control for movement, but you have no camera control whatsoever. No matter what version you play, you have a right stick available to you and yet it does nothing. The devs had a chance to fix the issues with being able to tell where you were in relation to a lot of the platforms and especially projectiles during boss battles and didnt do it. This means that a game with 3D platforming elements in it has no way to control the camera, so you wind up minor leaps of faith when it comes to core levels as a misplaced jump can put you on top of something and send you off the field. The worst part is trying to properly time jumps to avoid oncoming projectiles, which is one reason why the addition of boss fights is more frustrating now than before. Now they were a pain in the butt in 06, but with the benefit of 13 years of hindsight, one would think that the modern version of the game could be brought up to a higher level. Instead, the problems that existed before when it came to depth perception and being able to properly time jumps to either avoid or send projectiles back to the enemy are amplified because while playing, all you can think of is how simply being able to move the camera would make things easier. You could get an overhead or isometric view of where the objects are in relation to your character and pick up on jumping patterns to capitalize. Now, boss battles are just as much pure luck and perfect placement on the stages as they are skill  but they arent much fun.Fortunately, the boss battles make up a small amount of the core content  but they do block you from accessing later stages, so they do impede the amount of fun you can have since you need to topple them in order to play more of the parts of the game that work perfectly. The obstacle course areas are some of the best in the series and here, the addition of jumps largely works out nicely since theyre used for fences and other small areas to tie into the more normal ramps and the like. Momentum and speed still tell the tale of your success or failure more often than not and while jumping is present, it isnt used all over the place.The jumping mechanic is largely used as a way to enhance whats offered up and doesnt get in the way of the action much. There are a few occasions where you can wind up stuck in a rut due to it, but it isnt frequent and the quality of life improvements here compared to the first two are huge. Being able to continue from a stage and not just a series of stages is a massive time-saver as is having unlimited continues. It would be nice if boss battles didnt reset your progress and instead let you just spam lives, but that would hurt some of the challenge and thrill of beating them. A skip this area option for boss battles would also be nice but isnt something I would ever expect to see added to the game. Speaking of new additions, there have been some changes to the mini-game portfolio. The original game had fifty mini-games to play and this streamlines that number down to ten and limits them to multiplayer only outside of a marathon version where you run through all of them in one go. Whats here is a lot of fun and it does keep clutter down, but its still disappointing to have less to play even with the best mini-games like Monkey Target being retained.Visually, this HD remaster does look a bit cleaner than the original game. Colors pop more and theres more detail in both the characters and environments. The Monkey Ball art style lends itself well to remasters since the cartoony nature of it generally looks at least good at any resolution  and it looks nice in portable mode on the Switch. On the TV, you do appreciate more minute details, like the ground textures and reflections on the spheres the monkeys are in. The overall look of the original game is retained, while the increase in detail helps things look a bit more modern. The 16:9 aspect ratio helps you see more of the environment as well and that is a huge boon for the mainline stages.Musically, the remaster has lost a couple of steps. Licensing issues affected some early-game songs and as a result, music replacement was done. Whats here isnt bad, but isnt on par with the original release. Its still bright and cheery, but lacks some of the charms of the original tunes. Fortunately, the sound effects are untouched  so the silly noises the monkeys make are intact alongside voice effects that are generally chipper and happy even if theyre announcing your demise. Closing Comments:Super Monkey Ball: Banana Blitz HD isnt a perfect recreation of the original game due to some things being improved and others being taken away. The overall presentation is more enjoyable when it comes to the main game, but the massive drop-off in mini-game selection hurts the replay value. With revamped controls, it plays better than the motion control-only Wii original  but improvements werent taken far enough. Camera improvements would make the boss battles more enjoyable and motion controls as an option on Switch wouldnt hurt things either. Visually, the HD visuals are a nice upgrade from the Wii, but the reworked soundtrack isnt as impressive as the original games. Still, if you havent played Blitz, this is the best overall way to do it  as long as you can mainly enjoy the series for its regular stages and dont mind the lack of a lot of mini-games.", "date": "October 29, 2019", "grade": 3.5}