{"name": "John Wick Hex", "ref": "https://hardcoregamer.com/?post_type=post&p=358924", "text": "Back in 2014, an action movie by the name of John Wick was released in theaters, which told the tale of a retired hitman who returns to his violent ways after his house was broken into, leading to the loss of his car and his dog, a gift from his late wife. While this plot isnt too far away from those seen in most generic action movies, the strong performance of lead actor Keanu Reeves coupled with well-shot and choreographed battle sequences helped the film find success critically and commercially. John Wick: Chapter 2 and John Wick: Chapter 3  Parabellum followed in 2017 and 2019 respectively, each building upon the surprisingly deep universe and supporting cast of assassins hiding in plain sight and the people that assist them, while also showcasing some truly memorable shootouts and melee sequences that cemented John Wick as one of the most prominent action heroes in recent years. With a fourth film set for release in 2021 and potential TV shows and spinoff movies possibly in the works, the franchises rise over the past half-decade has been undeniable and it seemed like only a matter of time before John Wicks gun-fu style of combat would be attempted to be replicated in a video game. Earlier this year, Lionsgate Games revealed that they would be publishing John Wick Hex, a top-down turn-based strategy title from Bithell Games, a small indie team led by Mike Bithell who has seen a similar rise in popularity thanks to cult classics Thomas was Alone and Volume. While the pairing and genre choice may seem like a smart fit for a video game adaptation of John Wick, the bare-bones story, challenging but simplistic combat and a myriad of technical issues hold John Wick Hex back despite strong voice acting and smart level design.John Wick Hex serves as a prequel to the trilogy of films, taking place before the death of Wicks wife and during the prime of his career. Loyal companions and Continental employees Winston and Charon have both been kidnapped by Hex, a gentleman with a mysterious past who attempts to lure out Wick and establish himself as a man of power by taking down the Baba Yaga. Considering Wicks notoriety for surviving impossible situations, the story avoids running into the common prequel issue of low stakes, since players who are familiar with the titular hero already expect him to survive even the deadliest of encounters. Unfortunately, while Hexs motivations are gradually revealed in interesting ways, the plot is far too comfortable with simply featuring its cast of characters and not offering them unique opportunities to further their backstory or really do anything that could be considered memorable. Furthermore, even though Bithells notable talents for finding the humanity in the most dire of situations occasionally appears in the various conversations, the dialogue is overly reliant on philosophical ponderings and the occasional quip that is reminiscent of the movies conversations but rarely packs the same punch. With such a stellar voice cast on hand, featuring Ian McShane and Lance Reddick reprising their film characters and Troy Baker as the primary antagonist, its hard not to feel let down by the lack of risks that John Wick Hexs plot is willing to take.John Wick Hexs main campaign offers batches of six levels across seven locations, with each group maintaining the players health, focus, ammo and bandages across each level, forcing you to keep an eye on these precious resources and leading to tense final showdowns, with deaths forcing players to repeat the level. Certain locations allow the player the opportunity to stash bandages or weapons in specific spots or acquire suit upgrades with various benefits prior to beginning the new location, representing the only guaranteed assists players will receive throughout their journey. The vast majority of levels dont require the player to fully clear the area of enemies, instead simply those that are in their way or close to the exit, with a few boss levels that change the pace by reducing the total number of opponents but housing a tougher final showdown. All told, the campaign runs for around ten to twelve hours on the standard difficulty, with a second, more demanding difficulty available from the start.As John Wick, players have access to his entire moveset from the first level, featuring four melee abilities that require the player to get in close, shooting his one carried weapon and throwing said weapon to temporarily stun an enemy if it hits its mark. While the melee abilities will always succeed if Wick is not attacked prior to starting it, they rely on focus and leave Wick vulnerable while hes performing them. Additionally, Wick can also crouch to raise his accuracy while shooting or roll out of or into cover, with both shooting and throwing weapons having percentages of success attached to them that take into account line of sight, distance and movement. Fortunately, all these factors can often be tracked in the ever-present timeline along the top of the screen, which foretells every visible enemys next immediate actions to help the player best consider their next move. Considering the constant flow of enemies that the game happily sends your way, the timeline is essential for providing the player with the opportunity to think like John Wick as they determine their best chance for survival, ensuring that deaths and their harsh penalties rarely feel unfair and making success all the more satisfying. This balance makes for a challenging playing experience throughout and is bolstered by well-crafted levels with spread-out enemy spawn points and a nice mixture of close-quarter showdowns combined with more open areas. Although these fundamentals do their best to replicate the combat sequences of the films, putting them into practice and witnessing the final result via replay often feels far from the same awe-inspiring and anxiety-inducing battles that John Wick Hex is attempting to simulate. The crucial nature of visibility can often be easily manipulated, as moving back and forth or crouching down while in cover until enemies are close enough to shoot accurately or take out via melee combat can prove far too reliable, eliminating any need for going on the offensive in most situations in order to maintain resources. Additionally, even with new enemy types spread throughout the game that have more health and focus, taking down these combatants can feel too repetitive, as alternating between takedowns and strikes can finish practically every enemy type with ease. The ranged combat is more varied, thanks to a steady flow of new weapons and low ammo counts that ensure the need to constantly switch guns, but most of the later weapons are surprisingly worthless, often requiring long start-up times for no apparent reason or continuously fire shots that unnecessarily wastes ammo and leaves the player far too vulnerable as they shoot at the open air. Plus, Wicks animations look stilted and are disappointingly limited, leading to similar looking fights as the player watches Wick perform the exact same takedown or strike over and over, making the infrequent but enjoyable moments of intensity while playing a level look bland and basic when watching the post-level replay.The second and third John Wick films do a strong job of establishing the look of the franchise, relying on neon colors and memorable visuals and locations that help separate the films from standard action affairs. While there are glimpses of similar design choices throughout the locations of John Wick Hex, most of them are far too reliant on one or two color palettes, and the objects that inhabit them are far more useful as a means of cover then as part of an environment thats worth observing. The soundtrack by Austin Wintory does a solid job of embracing the semi-futuristic atmosphere, but the over-reliance on the same music track throughout the game ruins any attempt the compositions have of boosting the intensity of the ongoing combat. While it should be noted that the playable build was lacking a day one patch that will be available at launch, the amount of technical issues that were encountered during our playthrough are tough to ignore. From harmless incidents including strange ragdoll physics and delayed sound effects during post-level replays, to several death-causing glitches where an attempted action caused the timeline to continue moving while the player stands frozen after opening a door or picking up an item, it feels overly harsh to call the game unpolished but it could have used more time in development, particularly considering its release during a crowded holiday season. In addition to the aforementioned second difficulty, each location showcases the players results at the end, incentivizing a replay through that section to beat the par and improve Wicks time to completion, accuracy and weapon variety. Closing Comments:John Wick Hex excels at making the player think like John Wick, but fails to back it up with combat that is representative of the titular assassin. The strong fundamentals ensure a constant reliance on resource management and upcoming enemy actions, but the artificial animations, easily manipulable enemy AI and various technical issues makes the thought of surviving such overwhelming odds far more interesting than actually attempting them. The gameplay is interspersed with a mostly surface-level dive into the John Wick universe via its locations, plot and characters, aside from excellent voice acting, that would be easier to overlook without the other setbacks. John Wick Hex is a worthwhile playthrough for those with a fondness for turn-based strategy games or a desire for a challenge, but remains tough to recommend to those who only want another opportunity to spend time in the established world of John Wick.", "date": "on October 8, 2019", "grade": 3.5}