{"name": "Dragon Quest (Switch)", "ref": "https://hardcoregamer.com/?post_type=post&p=358508", "text": "Dragon Quest has come a long way in the 33 years since the franchise made its debut. Compared to last years Dragon Quest XI, the original Dragon Quest is short and simple, but it not only launched one of the biggest JRPG franchises but was also a huge influence on JRPGs in general. The 1986 classic has received a facelift to go along with some quality of life improvements for its debut on the Switch. The modernization streamlines the gameplay but even the most cosmetic surgeons cant completely remove all traces of their subjects age.Dragon Quest, or Dragon Warrior as us Americans who played it on the NES were introduced to this title, takes place in the fantasy world of Alefgard. The player assumes the role of the descendant of the legendary hero Erdrick who must stop the evil Dragonlord from plunging the world into eternal darkness. The Dragonlords castle is visible but inaccessible from the moment our hero steps out of Tantegel Castle, which is meant to encourage the player by showing them where their goal is located. The objective is for the player to freely explore the world with little hand holding and guidance though there is a recommended order of quest completion. The strength of monsters in a given area are a good measure for whether or not the player should be exploring that area. If the first random encounter after crossing bridge is fatal or almost fatal that is a good sign to go do some experience grinding and save up for better equipment. There arent too many quests in Dragon Quest to worry about. Theres the standard rescue the princess from the dragon quest and everything else is finding the legendary items to unlock the path to the Dragonlords castle. Even though there isnt a great deal in the way of guidance the quests arent too challenging to figure out and are structured in a way where they make sense and have a level of satisfaction upon completion. A necessary quest item, for example, is located in a town thats in close proximity to Tantegel Castle, but the player wont be able to access it until they are leveled up and acquire magic keys from a different location on the other side of the world map. A sense of exploring the world and figuring out where the next objective is and what is needed to complete it is part of the charm of this title.Dragon Warrior on the NES was a huge grindfest. In fact the majority of that game was just grinding to level up and upgrade equipment and that greatly extended the time needed to complete it. Dragon Quest on Switch is patterned after the Game Boy Color re-release and part of the quality of life improvements were that enemies gave more experience and gold to help reduce this. Some of the more drastic changes were Metal Slimes originally gave 115 experience, in this version they give 775. Beating a Goldman originally netted a random amount between 70-100 gold, now they drop 650. Even so, grinding is reduced but not eliminated. With the grind time reduced illustrates how short this title actually is. Being familiar with the title from the NES and GBC versions I remembered how the game is and made it to the Dragonlord at level 18 (level cap is 30) with all of the best equipment in about five hours. Modern perks that are almost mandatory in modern games arent anywhere in this title. Fast traveling to previously visited towns isnt an option, though returning to Tantegel Castle is possible. Inventory space is extremely limited so its a good idea to see if there is any space before opening a treasure box. Combat doesnt really have much to it as far as strategy is concerned. The descendant of Erdrick is a lone wolf so fights are just exchanging blows. Casting fizzle to prevent a foe from putting you to sleep is about the extent of tactical combat. Sometimes the encounter rate feels excessive, but the good thing is battles are so short it doesnt ever get too annoying.On the flipside, the modernization that was introduced in the GBC version of Dragon Quest was included in the Switch port and that helps with the experience. The player can now sell weapons and armor before purchasing an upgrade which contributes to reducing grind. A couple specific battles have been revamped to have more of a boss fight feel to them and an autosave feature has been added in case these boss fights go south. The graphics are the same as the 2014 mobile version and look like high-quality drawings based off the original sprites and the music sounds like the modern renditions of classic Dragon Quest music featured in the newer games. Closing Comments:Dragon Quest is one of the most important titles in the history of JRPGs and the Switch port is the best version of it. Unfortunately, as much as the modernization improves the original game it still feels primitive compared to current titles. Fans of Dragon Quest who are feeling nostalgic for the original title should check this out as this is the best way to experience it and it isnt a huge time sink. Outside of nostalgia or historical curiosity about early JRPGs, Dragon Quest is a hard sell. Because of nostalgia, binge playing it in a single sitting for the review was enjoyable but this title shows its age and the limitations of the time too much to engage newcomers.", "date": "September 27, 2019", "grade": 3.0}