{"name": "FIFA 20", "ref": "https://hardcoregamer.com/?post_type=post&p=358028", "text": "Last years FIFA 19 was a stepping stone in the right direction for the longstanding soccer franchise: EA Sports landed the coveted license for the UEFA Champions League and Europa League from Konamis Pro Evolution Soccer series. FIFA 19s marketing campaign was focused predominantly on Europes top-tier club competition and the publisher pulled a similar trick with FIFA 20 through the addition of Volta Football, the so-called spiritual successor to the beloved FIFA Street series. Players are immediately treated to a taste of Volta action in a three-on-three match featuring Real Madrid starlet Vincius Jnior. But for all of its showboating tricks, fast-paced action and the refreshing new experience that Volta brings, FIFA 20 exposes the long-running problems of the franchise to shake up the single-player mode to the core. EA Sports has spent plenty of time revamping the microtransaction-filled Ultimate Team mode since its introduction, but that has come at the cost of making the FIFA franchise fall short of becoming the definitive soccer experience both in multiplayer and single-player.FIFA 20 will hit players with franchise fatigue as soon as the main menu loads up. The design is almost identical to FIFA 19 and it feels bland and unimaginative not to refresh it up for the latest installment in the series. Game modes in kick-off are all too familiar and players will question how much replay value there is in the single-player, despite the addition of Volta. Even if FIFA is the ,omplete experience for some players, it feels lazy not to see other areas of the franchise gradually improve over time. There has been no real effort put towards improving the womens side of soccer, especially to capitalize on the popularity of the FIFA Womens World Cup in the summer. Just like FIFA 19s kick-off mode, there are only international teams to choose from in the title. FIFA 20 continues to showcase some impressive visuals, but the female stars dont have the same attention to detail in their facial animations and are long overdue for major improvement. A PlayStation 4 trophy (or Xbox One achievement), In the Game, is awarded for playing a womens soccer match, but it also sums up this area of the title: its only there because its there. The same requirement was needed to unlock the trophy in FIFA 19  under a different name, of course  but it spotlights the little effort put towards improving the whole single-player package, even if womens soccer isnt as popular as the mens in FIFA 20.Gameplay has been tweaked in FIFA 20 and players will instantly feel the difference as soon as they hit the field. Player movement has drastically changed and it allows more complete control while dribbling the ball or trying to skill past the opposition. Along with the movement, there is the introduction of a new defending mechanic that is less reliant on AI support. Its a welcomed addition, especially as it makes this area more challenging for players and doesnt allow them to be automatically bailed out by the AI for their mistakes. FIFA 20 might have tightened the AIs restraints on defending, but it does come at a cost, though. The AI will rarely help out in defending and it can leave some players feeling completely exposed, mainly for how much it has changed compared to FIFA 19. FIFA 20, despite some of its glaring negatives, deserves full praise for the introduction of tactical free-kicks. Players now have a target of where they want to aim their shot using the left analog stick and the right stick puts them in control of the spin or other variations they want to add to their free-kick. Its all coupled with the introduction of last years timed shooting mechanic in FIFA 19, which needs to be pulled off before the ball is struck. Finally, players feel in full control of this area and it builds on previous FIFA titles lack of innovation in free-kicks. Just like free-kicks, penalties have also had a facelift that improves the overall experience. The same targeting mechanic for free-kicks is now used from the spot-kick and timed shooting is needed the precise moment that the player is about to connect with the ball. It helps to raise the ante when penalty shootouts take place or the chance for players to equalize from the spot-kick. Despite the major changes to free-kicks and penalties, players will start to notice that not much has changed in FIFA 20 during a match. Rather than shaking up the whole gameplay experience, the finely-tuned changes made to player movement does have an impact in other areas. Passing, for example, is long overdue for a complete overhaul and it can feel hard to take full advantage of it with the movement that players can now make on the pitch. It can leave players frustrated with how difficult it becomes to pull off the simplest of passes (whether its short or long), considering the ball can fire off in the wrong direction or to an opposition player.Volta had high expectations placed on it from the moment that EA Sports first unveiled it in June, and it was always hard for the mode to live up to the hype when the immediate comparisons with FIFA Street were drawn. Either way, the FIFA Street-style mode does its best to offer a fresh experience by taking soccer off the pitch and moving it to the streets, especially with the effort put into the mode. Volta is not the only mode to receive it, but players can now fully customize their characters and have the option for them to be male or female. Volta has three options  story, league and tour  that will provide plenty of time for players to become fully immersed in the new mode. The FIFA franchise waved its farewell to Alex Hunter and The Journey in FIFA 19 and has replaced it with a Volta-themed story. The players character, dubbed Revvy, becomes a new member of the Volta J10 squad and is vying for his team to become world champions of street soccer. The campaign, however, fails to impress due to the average story concept, cringe-worthy writing and insipid characters. Volta isnt a memorable story and wont have players feel invested in it in the same way as they might have done with The Journey. Volta does have a weak story, but players will relish the different experience that the mode can offer. Players have the opportunity to compete in several different matchups, from three-on-three rush and four-on-four rush to five-on-five clashes. Volta skips out on the option to make substitutes and the mode has adopted a chemistry style that is affected by players abilities and formations. Players can recruit new members to their squad and pre-match preparations are essential before taking to the streets. Matches can have players either controlling their character or the whole team, while its fantastic to see local co-op allowing others to take control of other players. The level of customization extends to players recruits and they can change their styles using coins earned from matches. Thats not to mention the opportunity to set up their sides home turf, logo and name. Gameplay also varies depending on the match type, especially if there are walls for the player to utilize in their playing style. Street pitches that have walls can allow players to take full advantage of them in bouncing the ball off them and finding a teammate in space. The mode also offers some amazing locations for players to compete in across the world, ranging from Amsterdam and Barcelona to Tokyo and Paris. It might not be the mode for everyone, but Volta is a dream come true for skillers that love to pull off trick shots for montages.The FIFA franchises career mode has been neglected in recent years due to the popularity of Ultimate Team, but fans were excited at the prospect of some new features being introduced. Just like Volta, FIFA 20 has the same level of customization for managerial avatars in career mode and they look far better than the same models that were regurgitated in FIFA 19. There are a couple of other features that shake up the dated mode, which includes the ability to attend pre-match and post-match press conferences. Players will be directed questions from the press and the responses can affect the morale of players and the club. Over time, though, players will start to notice the same responses and questions pop up, but it doesnt have the same choice-and-consequence impact in episodic titles. The novelty does fizzle over time, but its baffling that there are no voice-acting performances. Thats right, the players manager will mouth the response and the text will appear at the bottom of the screen. When it seemed like EA Sports wanted to add a bit more realism to FIFA 20, it feels like it was only half implemented in career mode. Players will have correspondences with their stars and can reply to them with messages that will impact morale. But like press conferences, it feels like theres potential held back in a feature that could move career mode into the right direction. There are also some other glaring oversights in career mode. For example, Chelsea submitted a transfer bid for Juventus striker Gonzalo Higuan in my playthrough, despite the club serving a two-window transfer ban in real life. Aside from a couple of tweaks, career mode remains very much the same. In most cases, the location for transfer cutscenes has changed  pretty much everything else is the same  and it will leave players disappointed if they expected a whole new experience from career mode.Konami dealt a major blow to EA Sports FIFA franchise when they signed Juventus to an exclusive partnership for the PES series  and that absence is very much felt. While PES 2020 players can enjoy playing as a fully-licensed Juventus, the same cant be said in FIFA 20. The reigning Italian champions have been rebranded as Piemonte Calcio and it feels like a custom-made team with all of their real-life players. There is no mention of them on commentary and it hinders the experience in the match, especially when theyre only talking about the history and last seasons exploits of the licensed team. Juventus now feels like an empty vessel, which is highlighted in its biography description for career mode. While other teams have their extensive history on show, the Old Lady is reduced to a few generic lines of text in its place. Sure, Argentine sides Boca Juniors and River Plate are also exclusive to PES 2020, but Juventus presence in European soccer does make their absence far more noticeable. Thats not to mention having a superstar like Cristiano Ronaldo in their team, making them one of the more desirable clubs that the player will want to choose in career mode and kick-off. Ultimate Team has been the FIFA franchises crown jewel in recent years  and that is no different in FIFA 20. EA Sports online multiplayer mode continues to move from strength to strength with its improvements each year, despite the heavy criticism facing gaming publishers with the ongoing debates surrounding loot boxes. FIFA 20 players are treated to bonus items if they played Ultimate Team in FIFA 19 and also new animations for pack openings. The most noticeable change to the mode is the introduction of season-based objectives, which allows players to complete different tasks to earn XP to use in the dedicated season. Players will subsequently have the option to unlock a plethora of new content, ranging from loan players and cosmetics to Ultimate Team packs. FIFA 20s Ultimate Team also has some welcomed adjustments to the squad layout screen, making it seamless to prepare for a match from one designated area. Players can also customize almost every aspect of their club from the screen, whether its the clubs kits and ball to searching the transfer market for a new player to put into their team.Pro Clubs, like Volta and career mode, has the same level of customization for the playable character. But its from here where players will feel that similar theme of FIFA 20, where there is a lack of improvement or changes implemented. Players will find this common theme across several modes, but once the euphoria of having the new title fades off, they will find it to be a similar experience that FIFA 19 had to offer. FIFA 20 uses the same engine as its predecessor and does showcase impressive visuals in Volta and facial animations of world-class soccer stars. But the franchise is far from being the polished experience, especially as some players look lifelike while others are subpar at best. EA Sports does deserve credit for selecting another solid soundtrack that includes a nice balance of urban sound for Volta. Closing Comments:FIFA 20 has Volta at the center of its marketing and successfully introduces a mode that has real potential, but its not the experience that reinvents the franchise. Some players will fall in love with it from the minute they first play it, while others will feel the novelty quickly wear off. If the player heads into the mode with the expectation that this is the spiritual successor to FIFA Street, they will feel disappointed after going hands-on with the mode. Irrespective of Volta, FIFA 20 does little to inject the series with gripping features to help improve the stagnating single-player experience. Ultimate Team remains popular and returning fans will be happy with the tweaks that have been made to the mode, but the single-player experience is far from being the complete package. Customization to modes like Volta, career mode and Pro Clubs is a step in the right direction, but FIFA 20 does little to flesh out features like press conferences and make them have more of a real impact. Players will quickly realize how similar the interface is to FIFA 19 in several modes and will be yearning for the franchise to receive a complete overhaul. With Sony and Microsoft preparing for next-generation consoles, players can only hope that the FIFA franchise also decides to evolve and significantly revamps the single-player experience next year.", "date": "September 24, 2019", "grade": 3.0}