{"name": "Ninjin: Clash of Carrots", "ref": "https://hardcoregamer.com/?post_type=post&p=311641", "text": "Ninjin: Clash of Carrots is one of those strange concepts that the gaming industry is all too familiar with now, but it will still raise anyones eyebrow nonetheless. No, its not a complete exaggeration. Its as if developer Pocket Trap decided to throw a whole host of different ideas into a box and created a new concoction that popped straight out of the rabbit hole. The title doesnt take itself seriously in any aspect, though thats where the problems begin to manifest. What seemed like a promising beat em up on paper  one thats carefree, yet players can be fully immersed in  begins to show its true colors. The studio doesnt know where and when it needs to show controlled restraint with how odd its concept is for Clash of Carrots, falling back on its own sense of humor multiple times and causing the shine factor to be taken away from the title.Clash of Carrots transports players to a world drawing inspiration from feudal Japan, putting them in the position of a bunny, Ninjin, or a ninja fox, Akai. Its open choice is based purely on its co-op experience, effectively eliminating a tough choice when it comes to selecting a character with different strengths and weaknesses. Pocket Trap wastes little time in setting up the story of the title, too. From the opening moments, the Shogun Moe leads the invasion of a village for its carrot supplies. Its not hard to believe that the plot begins to fizzle into obscurity shortly after this point. After all, its an average story being told, with no real reason to feel invested with the characters. In fact, they are rather one-dimensional characters that have no substance or personality to them, making it difficult to care about almost any plot point in the story.Pocket Traps storytelling is lackluster and fails to inject a natural charm into its characters. Sure, voice actors are not completely necessary for every story, but Clash of Carrots lacks a crucial feature that could have made its story feel far more engaging. While it would have changed the experience in terms of not needing to read the story on screen, it might not have been worth the effort when the dialogue is frankly bad. Remember that bit about an overuse of humor? It applies to all aspects of the story, which sometimes feels like an early draft for a comedians stand-up gig. It relies far too much on puns, executing them poorly and creating cringe-worthy moments. Its only reinforced by dialogue that doesnt have an identity, which will instantly turn most people off from both the story and the characters. It switches far too many times from a bro-ish tone to something that is written like an essay. Considering that the title is marketed on the fact that it doesnt take itself seriously, it lacks a conversational flow when players read the text on the screen. Gameplay is by far where Clash of Carrots entire experience is built around, with five different stages for players to make their way through. Players face waves of enemies in different levels, usually reaching a tenth wave before they unlock the next mission. Its worth crediting Pocket Trap for trying to mix up the enemies in each world, specifically for how players have to adopt different playstyles ahead of a new mission. There is a basic level of customization for Ninjin and Akai, in which players are able to use certain items to upgrade their abilities, unlock improved weapons or equip different accessories. New items can be purchased using carrots collected from defeated enemies in a level. What is frustrating is how many different weapons are unlockable in the title, mainly for how they begin to clutter the inventory selection screen. Okay, there is a wide variety to choose from in terms of swords, axes and spears, but it doesnt help that players cannot do a side-by-side comparison to see which one has the best stats.Clash of Carrots fast-paced combat is supported by the excellent use of its stamina meter. While players are able to improve it by equipping different items, both throwing and hand-based weapons and dashing will have an impact on the meter. It can make combat more challenging, especially as it stops attacks from being spammed and requires players to be a bit more methodical with how they best handle an enemy. Despite its positives, however, its negatives undermine much of the experience. Players will no doubt find it frustrating that the title doesnt have a blocking system, with the dash feature being the only way to avoid incoming attacks. It could have benefited from a parry mechanic, rewarding players for perfectly stopping an attack. Theres no difficulty option either, leaving some players to face an onslaught of enemies who will cause more explosions on the screen than there is actual space to travel to for protection. The combo meter is effective for building special attacks, but it doesnt stop the combat from becoming bland. It could have done with a two-button attacking system to alternate between for handheld weapons, but its one-button attack leaves much to be desired. One of Clash of Carrots most redeeming factors is when the survival mode is unlocked. The Live TV Show allows players, either on their own or with a friend, to face off against waves and waves of different enemies, starting off with the most basic equipment and unlocking new ones the further that they progress. Its a mode that players can spend plenty of time in, especially for the different rewards that can be unlocked. Players dont need to finish the story to revisit different levels, which means they can continue to develop their character and then come back to them when they want to earn a better overall ranking for a certain mission.Pocket Trap hasnt created visuals that will mesmerize players, but it fits the characters and enemies that have been conceived for Clash of Carrots. Considering the action takes place at such a high speed in levels, the aesthetic seamlessly suits the title and is a nice throwback to classic beat em ups. In fact, its noticeable from the world map that is used, as it looks like the developer has taken inspiration from a classic title like Super Mario World for its design. Theres a sense of nostalgia that players will no doubt feel over the course of the title, with an over-the-top soundtrack to match its crazy world. Closing Comments:Clash of Carrots had the potential to be a real diamond in the rough, but it quickly becomes apparent that its not when its novelty begins to fade. Most players might find themselves walking away from the story after an hour or so, with its overall experience lacking a real reason to stick with it until the end. Gameplay is enjoyable for how basic it is, but its equally frustrating when players are sent back to the beginning of a level once they die. It all boils down to the lack of a blocking mechanic, though. Its simply unsatisfying that the only way to avoid attacks is by dashing. Despite keeping an open mind with the title, its concept is flawed in its execution and it lacks a sense of identity and purpose for its characters and story. What seemed like a title that could reinforce the reason not to judge a book by its cover proves to be the exact opposite in almost every aspect.", "date": "September 10, 2018", "grade": 2.5}