{"name": "GreedFall", "ref": "https://hardcoregamer.com/?post_type=post&p=357257", "text": "Not for the first time (this year alone) will we have come to a title published by Focus Home Interactive, and left with a mix of genuine surprise and enjoyment at what weve witnessed. Its unfair to praise a distributor for the quality of their portfolio (rather than the developers of said content), but similarly to the likes of Devolver Digital, the Parisian publisher have gained a fair and note-worthy reputation in among the AA field as of late. Releases that may prove divisive when taking all polarizing views into account, but games that have at least pursued different approaches to seldom-challenged genres and conventions. Some like Vampyr and this years A Plague Tale: Innocence have mostly succeeded, while others like The Surge  despite a satisfying introduction that garnered optimism for the subsequent experience  falter on their execution. And then theres GreedFall, a game whose own admittedly-present missteps and technical follies should equate to ambitious in its own right, if sadly not quite enjoyable enough. In reality, the opposite is true and the reason why this game is an odd but intriguing affair to discuss; GreedFalls patient stride and confidence in what it wants to portray, on top of all the small little tweaks and touch-ups to the traditional RPG formula, is not only enticing from a narrative standpoint, but on its gameplay is one that carries it through regardless.A bizarre turn-around if one were to make presumptions based on the developer in charge. The similarly-Parisian outfit, Spiders, not exactly strangers to trying other approaches  the studios last outing being the Mars-based escapade, The Technomancer  but neither have they been known for their end quality and of yielding positive results. Until now. From the very first few hours, long before youve set sail to the primary setting, whereupon the title drop emerges after an introductory/tutorial-style array of quests, Spiders drive and commitment to their premise and setting shows. From establishing the quasi-fantastical/industrialized backdrop to providing useful expository details on the varying factions, to exploring another part of the semi-open network of deciduous-like environments, GreedFall is a significant step-up.And justifiably so, for even the occasional blips the game offers  the flinching facial animations, the momentary T-posing NPC off to the side, the comical sliding animation enemy AI make when attempting a melee attack at too far a distance, the repeated use of assets and building interiors for particular locales and settlements  do little to detract. From the tale its presenting and the mechanics that, added up, offer moments of genuine consideration on how best to attain victory, GreedFall avoids the usual playbook of being grand, epic and all-encompassing  instead homing in on the short-burst pleasantries to be had. Whether thats succeeding through a dialogue option, or finally having the material to craft a stronger weapon, alone these moments are meaningless, but as a sum, GreedFall shines as a slew of wonderful set-pieces defined by ones decisions. There are, what many will proclaim, some fantastical elements at play yes. Something that factors into the aesthetic to an extent  your player-character having access to magical, as much a vast assortment of physical/medieval-themed, weaponry and abilities alike  but GreedFall does attempt to ground its story whilst embracing the liberties that fantasy stylings can offer. Placing you at the tense middle-ground as a diplomat trying to maintain peace between a series of rival factions and native tribes. All of whom seek to get their own way without compromise. For as mild or as unappealing as diplomatic relations sounds on the surface, the game utilizes this where it matters most, sprinkling just enough of a mystery and a growing friction between parties that, eventually, compromise becomes inevitable.Factions and the moral dilemma of whom to prioritize, or even side with, isnt new of course, but over time GreedFalls appeal is in making you think twice, even thrice-over about how well (or awry) your choices could go. So crucial the small details are  the way youll be interrupted mid-quest by members of a faction whom you may well be working against; their suspicions evident, your own anxiety emerging on whether to continue with your supposed actions. Its no exaggeration to say GreedFall does exactly what Fallout: New Vegas succeeded on in offering enough of an intrigue with its lore and of the multi-branching possibilities with its quest-lines, complete with greater revelatory stakes at play, for you to really consider how to approach things going forward. Quest design is easily GreedFalls most positive contribution as a result  particularly the way the game can lull you into assuming events will end on a positive note once all the hard-work is done. Only to run off on a tangent and leave you with more questions than answers, something which happened on numerous occasions on ones play-through. Whether you are indeed confronted mid-way through or even find yourself timed on how fast you can react to a new objective, GreedFall may feel like one is following map icons at points, but the crucial thing is that it puts the potential boon/risk of your play-style, back to the forefront. The fact you can even enable/disable quests on-the-fly by simply pointing to markers on the compass mid-play, and its evident Spiders have approached this RPG staple with a focus on both variety but also ease of accessibility.An accomplishment, odd as it may seem when a players run is guaranteed to throw up some hiccups along the way, but even the gameplay beyond just its dialogue is where GreedFall continues to surprise. Combat, while standing as your typical attack-and-dodge display through real-time actions, does add a few intriguing twists. For one, all participants  be they friend or foe alike  have a set amount of armor on top of their usual health bars. Normally, attacking wont do much good; the intent however is to find a way to stun, knock enemies over or even strike when at their most vulnerable. Whether thats through parrying or launching in with a specialized move. Do so and you incur damage to armor on top of health, eventually depleting it for good. The execution can feel like button-mashing at points; the game doesnt make it entirely clear why one attempt at a stun is different or more successful than another, animations lacking a severe amount of weight or impact. But with the differing forms of damage output (melee, ammo, magic) and knowing how best to combine your own and your companions attack styles, theres a sufficient level of strategy integrated into GreedFalls battles. Particularly when up against a major or otherwise optional boss and fights can be as much a test of endurance as they are wits. Companion AI may not be the most wise or intelligent in going against its namesake, but the mechanics on show have enough to merit a closer, more thorough engaging of enemies.So far as progression goes, GreedFall isnt afraid of dishing out many a loot-drop and crafting material in what is that usual cycle of number-increasing and striving for the supposedly rare-branded of weapons/apparel/equipment. Fortunately the game doesnt commit or otherwise demand too much time to this aspect. Even if you ignore the upgrading functions  modding ones inventory with add-on parts that in turn increase the stats a touch  GreedFall does a respectable-enough job with its branching, upgrade tree and finding that balance between having players commit to a particular play-style, but not entirely closing off other fields with which they can pursue further down the line. The fact that progression is split across three areas  with skill points allocated at different amounts of levels  does make the feeling of progression that bit more celebratory and a milestone to strive for. Stats can be reset and reallocated at any time of course with a handy item, but having to think long-term  particularly when quest-based, dialogue-altering attributes are locked behind such progression, and could prove useful in amidst a heated, reputation-risking confrontation  is key. This means players must think carefully on what path they want to go down. Prominent when it comes to picking from a variety of dialogue choices of course. Some enabled by default, others accessible through a required level of a certain trait or item. Have enough money and you can bribe a soldier; invest in the Intuition perk and you may be able to convince someone to help you; think your percentage level is high enough to risk intimidating another person to comply? This approach to conversation and deciding how to resolve quest objectives is nothing new  something any fan of WRPGs will pick up immediately  but its how Spiders build on top of this that should be noted. Even if you fail your desired route, the game seldom treats this as an automatic fail/resort-to-combat trigger, instead requiring you to achieve the objective in an implied longer route scenario. Another positive inclusion is the way your companions themselves can even interject  steering discussion or confrontation alike away from a risky fail-state and more in your favor, should the faction and their origins/allegiances align. Even commenting on the end result of your decision is a small feature that prevents your party from feeling too static or deprived of any sort of quirks.Some design decisions in GreedFall, however, arent so easily forgiven or dismissed. Notably the lack of an in-game map, or at least one that doesnt require the player to constantly pause the game, for the simple sake of getting ones bearing. The very nature of exploring in a particular area of the world can be a confusing, and often annoying, series of doubling-back  mistaking reasonably-sloped hills as a means to traverse. Rather than the presence of invisible walls with which the game uses to funnel players down and through certain routes. Something which, because of the aforementioned lack of an in-game map, makes traversal slightly more complicated and mundane than it should be. Enemy variety is also in short supply  the manner and type of foe, simply swapped out through different skins/visuals  with it too suffering from a frequent lack of intelligence in parts. Even, what appears to be, losing complete interest in a battle at random points to simply wander off to their previous location. An odd moment that can lead to some annoying wasting of ones time, given that enemies recover all lost health should the game declare/assume, out of player control, combat has ceased. Closing Comments:It would be misleading to ignore the many borrowed ideas and means to appease long-time fans of past WRPGs and current action RPGs alike. But nonetheless, GreedFall should be regarded as an ambitious, but more importantly smart compiling of both sub-genres greatest strengths. One that players can tailor to suit their play style, but at the same time throws up enough twists and turns to illicit a sense of urgency and importance about its players decision-making. Whether youre patient enough to think things over before acting through dialogue, or are content with simply going through the motions of acquiring better/higher-numbered loot, the plentiful, weaving, dynamic approach to quest-lines prove more than sufficient to keep you fixed until the storys end. Minor issues are frequent  at times garnering bitterness to some of the games unwarranted restrictions and absences  but theres enough of a discovery, satisfaction and fascination with its world-building for those rough edges to not become that much of an issue. Easily Spiders best work and one that is confident in its own material, GreedFall, though flawed, is one more fine addition to the AA sphere and a great example of passion and dedication, succeeding where it matters.", "date": "September 15, 2019", "grade": 4.0}