{"name": "Raiders of the Broken Planet", "ref": "https://hardcoregamer.com/?post_type=post&p=274336", "text": "From the outside, MercurySteams Raiders of the Broken Planet seems a bit odd with its business model. In practice, it actually makes plenty of sense. This is an episodic action game where the tutorial and first mission are treated as a demo with progress that carries over. Explaining this is quite easy, but the studios marketing was never able to successfully simplify it in an understandable form. This confusion is indicative of the design of the game as a whole. The online-based cooperative action experience is aggravatingly baffling, poorly conceived and even more atrociously executed.The game itself centers around a planet with a giant crack in it, dubbed the Broken Planet. This fractured sphere is home to a mysterious substance called Spice Aleph, unique in its ability to empower folks to reach new heights. A group of outlaws, the titular Raiders, find themselves in a war with a highly funded corporation to control the substance. The story itself is rather generic, featuring innumerable science fiction tropes pulled from common examples of the genre. This by itself isnt a deal breaker. Plenty of stories can follow clichs while still being told with such sincerity or creativity that it rises above the sum of its parts. Raiders of the Broken Planet is not one of them, featuring ham fisted cutscenes and obnoxious characters that would have been better off silent. Im quite open to foul language and tend not to find myself put off in the least by a few choice expletives. There is one character here, though, whose entire personality is her willingness to utter the word mother%^&*er freely and for no reason. She is grating, obnoxious and also the most memorable character.The gameplay doesnt fare much better. It seems that MercurySteam took a look at Battleborns story mode and decided to copy that. Whats more, they failed to even reach that level. For all of my praise and declarations that Gearboxs famously underappreciated title deserved an audience, the story mode missions were certainly not the reason. Raiders basically tasks a team of players to enter into a series of large arenas to perform some task, such as defend a crane thats moving a prisoner to a point where he can be rescued or break a reactor by defending overloading generators. The design behind these missions manage to be both dull and infuriating through the magic of subpar design. Enemies can come from anywhere, blindsiding the players that are trying to work strategically using the cover based system. This system of maneuvering and flanking is touted in the tutorial as a main gameplay mechanic. In practice, it is best used for recovering health. Staying in cover any longer will invariably find the player getting chewed up by a freshly spawned swarm of enemies, or worse, even if they are constantly moving. They could also be caught by an elite soldier who, if they touch the player, will engage in an overlong animation where the protagonist is pummeled to death. This latter provides no opportunity to counter, the health level of the hero doesnt matter, and is unavoidable due to cheapity cheap cheapness. Hopefully there is still a life left in the teams shared pool. Otherwise, that player is out until they are restocked.Its not like the offensive and defensive capabilities of the heroes improve matters. Each are equipped with a firearm of some type and melee attacks. The gunplay is unbelievably weak. Even the character rocking the high powered chaingun feels like hes peppering the enemy with wads of paper. Punching out the Elites is required for collecting Aleph, which is needed to activate mission goals, such as those generators that need overloading. Good luck with that. Landing a successful combo is a matter of luck, as the foe will duck randomly out of the way and counter with one of the aforementioned instant death attacks. If there is supposed to be an effective timing mechanic, it was never explained and certainly doesnt appear obvious to someone who has played more action games than can possibly be healthy for a lifetime. Something else that was never explained is the character upgrade system. After suffering through a mission, the players get to choose a reward, like faction points, character points or a weapon blueprint. Be quick, because everybody chooses from the same pool. What do faction points and character points do? Beats the figurative urine out of me. The character screen is awash with cards that can be drawn somehow, weapons that maybe can be researched or bought from a blueprint and cosmetic skins. Along the borders are currency indicators. Blue points, red points, gold and myriad more. Dont have enough? Buy some more with real cash from the store. For something that the developer specifically calls Not Free-To-Play, it sure as hell feels like a free to play game with an embarrassing amount of ways to hose the player. Theres a commonly accepted trope that developers dont want this stuff in their titles but it gets crammed in by avaricious publishers. MercurySteam is their own developer and publisher and managed to bork their game on their own. Theres no excuse.One might notice that this review is specifically calling out stuff found in the free levels. Theres a reason. A PlayStation 4 code for the Founders Pack was provided for review purposes, which includes the current paid episode Alien Myths. This code was redeemed. Unfortunately, while it shows as something I own in my purchases on the PlayStation app, the PSN Store still thinks I havent bought it and the game doesnt register it. Ive tried deleting all saves, and re-downloaded the title multiple times to no avail. No Founders Pack for me. A web search reveals that this issue also exists for the Xbox One and Steam versions. This isnt a complaint. I so completely loath everything else about the experience that it was nice to have a valid and reasonable excuse to remove the title from my hard drive and never look back. Its being mentioned solely to warn the masochistic: do not buy a code from Amazon or some such. Anyone squandering their money on this should purchase it directly from their marketplace of choice.There is one saving grace to this title: the art. While no amount of graphical work can save a disastrous game such as this, the folks behind the tech and visual design did extremely well. Raiders looks great in screenshots, and that appearance is actually whats in the game. Flames spew from damaged gunships, the sun lights outdoor areas in a believable manner, and the environments maintain a level of thematic cohesion that deserves a better game. Sure, theres quite a bit of brown, but the visual style truly pops during play. Even the heroes, if they would stay quiet, have a visual charm to them. Its appalling that this work is going to such waste. Closing Comments:Typically, a more rigid outline is used in writing up a review to create a flow that is comprehensible, allowing the reader to separate out thoughts and opinions in an intelligible manner. For this item, I decided to free flow my bile like a possessed child painting a room with so much pea soup. Coincidentally, this mirrors the Raiders of the Broken Planet design document. Hopefully, the post write up reorganization helped for legibility. The point is that its rare to see a title with so much promise wasted. This is a game that needed some sort of oversight. Somebody needed to step up and explain that things were getting way out of hand with the currencies, that the mysterious appearing enemies style of challenge doesnt fit with the mechanics as designed, that surprise instant death isnt fun within the confines of a cover shooter. That didnt happen. Instead of being pulled back from the precipice, MercurySteam merrily stepped over, embracing oblivion. The splatty mess that resulted was scraped up and released for Xbox One, PlayStation 4 and PC. The actual talent that went into this game dripped through the crack in this Broken Planet.", "date": "Bohn on October 5, 2017", "grade": 1.5}