{"name": "Dragon Quest Builders 2", "ref": "https://hardcoregamer.com/?post_type=post&p=351939", "text": "Progress thats the result of unbridled creativity fused to wild originality is a wonderful thing, but sometimes its nice to slam two existing ideas together and see what falls out. Admitted, merging Minecraft with Dragon Quest was an unexpected curveball of a concept, but the result was a cute and fun little action RPG, that while had its share of monster-bashing, was more about reconstructing a devastated Dragon Quest fantasy world than swinging a sword. There was no shortage of combat, of course, but why waste time beating up on slimes and drakhees when you can turn a decimated pile of rubble into a functioning town? Dragon Quest Builders was a weird little spin-off that didnt have any right to be as entertaining as it ended up being and Dragon Quest Builders 2 proves the quirky concept of the original has everything necessary to become a series in its own right.Much like Dragon Quest Builders acted as a sequel for the bad ending of the original Dragon Quest, Builders 2 picks up as if Dragon Quest 2 went horribly wrong. In the original Dragon Quest 2 (spoilers for a game that originally came out in 1987) Erdrick and his band defeated the wizard Hargon, who then sacrificed himself to the lord of destruction Malroth. The heroes then destroy Malroth and restore peace to the land. Builders 2 starts out as if Erdrick and crew had never confronted Hargon, and instead the wizard was the undisputed leader of a cult that preached against any form of creation. Building things is bad, destruction good and anyone who goes against this simple edict will see their creations destroyed before theyre ground to dust. As for the demon lord Malroth, hes got no memory of who hes supposed to be. The Builder meets him after the prison ship s/he (you can choose the gender, but seeing as I made mine female, the Builder is she for the rest of this review) was being transported on is destroyed in a storm and she washes up on a deserted island and they become friends that travel the world together to undo the damage caused by the Children of Hargon.The opening tutorial on the prison ship is followed by a brief chapter on the barren Isle of Awakening and then its off to the rustic farming land of Furrowfield in search of help to revive their new home. The teachings of Hargon has made Furrowfield a disaster area, however, without a single standing structure, earth turned to useless muck thanks to the corrupting spoilspores, and the people who used to be farmers firmly indoctrinated into the cult of destruction. Only one person in the whole ruined village hasnt given up on the dream to be a farmer, but thats enough for a plucky Builder to work with. Combining wood harvested from dead trees, dry grass from the tufts kicking around the cubic terrain, and cord made from ivy, the Builder creates a scarecrow to mark a field and start growing the first successful crops the village has seen in a long time. A functioning field restores hope, hope brings workers, workers need a place to sleep and one creation after another turns the ruins into a farming village. If that sounds familiar then you most likely played the original game. The Builder comes to a ruined town and goes questing into the surrounding landscape to find the necessary components to create what the people need. The major difference between the two games is that Builders 2 is one giant adventure instead of four sub-adventures loosely strung together into a story. When you learn a recipe it stays learned, equipment transfers from one area to the next, and a handful of characters from each island you visit will return to the Isle of Awakening to help build it out. The entire quest is gigantic and its divided into two types of story.The more focused part of the game takes place on the islands you travel to, with each one having its own huge section of plot that will see you questing over every cube of the landscape to heal the its damage. Part of the quest is to gather up the resources to fix everything, such as seeds for a farm or cart rails for a mine, but there are secrets and hidden recipes for an adventurous Builder to turn up. Mini-temples with small puzzles are scattered through the landscape and solving them by shuffling their blocks around correctly rewards a mini-medal. Other hidden areas can have unique items and collecting them learns the recipe, letting you create fancier rooms and landscapes. This leads to happier people and happy people give more gratitude points. One of the biggest additions to the sequel is gratitude points, which are hearts that pop out of the villagers when theyre happy. Anyone can get by in a square room with dirt walls, a torch and a straw mat on the floor, but hanging a lamp on wooden or brick walls to illuminate a proper bed, dresser, table and chair, maybe with curtains over a window, will make for much happier townsfolk. Theyd also like a communal eating area, complete with a kitchen and a chest stocked with food, and an outhouse or two would be nice as well. All this results in even more gratitude points, which power up a bell in each new land. When enough are accumulated you can whack the bell with the Builders hammer, sending a chime across the island that calls new residents to the town. It takes a bit for them to shake off Hargons influence but they pitch in soon enough and eventually theyll have their own set of requests.After much adventuring and construction the islands story finally is complete, at which point its time to return to the Isle of Awakening for the other half of the game. Unlike the main quest, Awakening is mostly unstructured and you can build as youd like. The island is a wasteland and it can be a bit overwhelming to figure out where to start, but once youve started transforming the parched earth into arable dirt and plopped down a few buildings, the possibilities start revealing themselves. This area is almost big enough for a field so by flattening this hill and moving the dirt over there its now much more useful. Keep flattening and another field for a different type of vegetable can go beside it. Drop a few forest tiles around to get some trees, use the bottomless water pot to create a river, build a communal sleeping area so the people have a place to crash while you plan something a bit more urban and soon it can be hard to leave for the next story area. The only guidance is a few villager requests at the start plus a task board with bonus objectives, the latter of which I found just happened automatically while following one idea to the next. Much like the story-islands, Awakening has gratitude points but uses them in a different way. Theres no bell to level up the town so instead the points act as a currency, opening up new crafting recipes plus bonus randomized islands. The extra islands are uninhabited except for monsters but make a great place to scavenge for resources, which is handy seeing as even a built-up Awakening wont have all the items youd want. One of the major perks of the random islands is that each one has a checklist of research items, which are no more complicated to tick off the list than hitting X to investigate when standing near one. The advantage is that, once a list is complete, it permanently awards an infinite supply of a specific resource, simplifying crafting immensely. Building a streets worth of houses is much simpler when you dont have to budget the wood for the walls, after all, and thats not even taking the floor tiling into account.Dragon Quest Builders 2 is an incredibly playable game, of the type where one task segues into another until the birds are chirping as the morning sunlight creeps in through the windows, but it still has a small handful of rough patches. A bug on the crafting table at Awakening base left some mid-tier items out of the list of available parts until I crafted a mid-tier table to remind the game they existed. The X button cycles through tools, such as the hammer for breaking blocks or the glove to pick them up and carry them around unbroken, but it also acts as a general action button. This is not helpful when constant companion Malroth is hanging out out just within activation range, willing to chat at the tap of the button that would have been far more useful if it had done the thing Id actually wanted it to do. The plot also takes a hit on the mining island, which would be a cute adventure if the towns supply of muscle-men werent so utterly obsessed with the only woman in the entire area, and even moreso after she finally relents to the towns need for a bunny-girl stage dancer. Closing Comments:Most of the time the game is working properly, though, humming along with an endless series of pleasant tasks to chase after. Find slimes to get oil to make torches as a component for lamps, or smelt silver into ingots to craft into building blocks fitting for an ornate stage. Theres a marker on the map with a main quest point, plus another with a subquest, but there are also people in town sleeping in the dirt, so maybe saving the world can wait a minute while fixing the place up. Combat is simple but gets the job done, while building out each new town has endless options to experiment with. Each new recipe is a chance to get a little fancier in the design, and while some villagers have specific requests, in general the choice to build a mansion or simply four walls and a few beds is down to how creative you feel like being at the moment. Once the world is a bit nicer for your creations the story calls, dragging you from one end of the land to another while keeping an eye out for monsters or secret points of interest on the map. Its never particularly difficult, with even the major encounters only requiring a casual eye for attack patterns and a little patience, but the Builders job is to reconstruct the land rather than carve a bloody path through it so thats OK. Dragon Quest Builders 2 is a cute, fun, deeply enjoyable and satisfying trek through a ruined world that only needs an irrepressible spark of creation to burst back to life.", "date": "July 11, 2019", "grade": 4.0}