{"name": "Final Fantasy XIV: Shadowbringers", "ref": "https://hardcoregamer.com/?post_type=post&p=351871", "text": "Almost a decade ago, Final Fantasy XIV was released to, well lets just say a less than stellar reception. It was a game that Square Enix had stated that, if they had a repeat, could very well ruin the company. Alas, three years later, the Japanese developer rebuilt the MMO from the ashes of old and created a greater experience. Mind you, A Realm Reborn was far from the best game on the market, with a slow and sometimes monotonous pace, but it was still a significant improvement that laid the groundwork for future releases. Since then, we received one of the best expansions ever in the form of Heavensward that consisted of a dark and (in-world) politically-charged plot. Then we were treated to the second expansion Stormblood, which while has its numerous faults, ended up being an adventure that was highly engaging thanks to its antagonist and trials. Now we come to today where the user base is higher than it has ever been. The third expansion, Shadowbringers, is finally available, and all we can say is that Square Enix has outdone themselves.After about a year of teasing a mysterious individual talking into your ear, seemingly putting your fellow comrades into commas, you finally get to understand why: they, and yourself, have been whisked away to The Firsts world to help solve another calamity in the making. This isnt just some side plot distraction from the Empire, but one that helps extend the lore, especially when it comes to the Ascians true motives and history. It does put the Empire on the backburner, though, with only a couple of instances where we learn about what theyve been up to in your time away, but outside of that, were strictly confined to this new world and all its fantasy. Speaking of which, because this is a splintered world from The Source, there are a lot of similarities you will notice, something that Square Enix has put a lot of attention of detail into. There are areas that are comparable to A Realm Reborn, but at the same time theyre drastically different because events of that world took a significantly different path. The same can be said about the inhabitants and how theyre treated. For example, Lalafell are now considered Dwarves and are situated in warring tribes, bickering over the shine of their beards, and Viera are in the forest where they protect ancient structures. Its a fascinating outlook on a world that has some trappings that will evoke nostalgia, while being drastically different at the same time. The pacing of Shadowbringers is near perfect, with only a couple of instances where the quests become mundane tasks, but even then you can generally push through them moderately quickly. These usually take place in the Greatwoods, which offer the least fascinating and somewhat undeserved melancholy stories. The plot in general, though, is significantly darker and grimmer than Stormblood, maybe rivaling that of Heavensward. Despite this, there were countless moments throughout the 40 to 50-hour core story where I had the largest grin across my face, be it from callbacks to events prior or joyous surprises you didnt see coming. It truly feels like a Japanese RPG from the golden age in MMO form, where youre re-recruiting teammates of old, all while making allies in the process. While Heavensward was about establishing relations with another nation, and Stormblood about liberation, Shadowbringers is about bringing an entire world together to prevent what seems like the apocalypse. The final act alone goes beyond anything weve come to expect from Final Fantasy, let alone XIV. I was completely enamored with everything that was going on, and it will sure to please fans with the epic conclusion, and thats not even mentioning the post-credits stinger that hints at whats to come.The only somewhat notable gripe I have with the plot is the antagonist. Despite my misgivings with Stormblood, at least that expansion focused on arguably the most fascinating villain from the entirety of Final Fantasy XIV. In Shadowbringers, we dont really have that. We have a snarky Ascian and a stubborn fool of a man whos hell-bent on becoming the one and only king of the land. The former does make for a compelling villain that you both sympathize with yet utterly despise, but the latter isnt going to win anyones hearts. Thats not to say theyre bad by any means, but coming off the affable and charismatic Zenos, theyre in a tough spot. The same comparison can be made about the Trials. While challenging to partake in, they might be the least memorable since A Realm Reborn. They have the style and visual flair, but they lack the substance and appeal past entries imbued. Its disappointing because, while the story ends in this fantastical, grandiose way, the final boss doesnt portray the level of quality weve come to expect for a closer. With that said, while the trials arent going to win any awards, the dungeons are another matter. As you go through the story, they continuously improve upon one another, with the final story-driven scenario being an absolute showstopper. Im not too hot on the two post-campaign dungeons as the only thing they have going for them is nostalgia and maybe a boss or two, but that might have to do with following up arguably the best four-player dungeons in the entire game. Gameplay has been consolidated down to a surprising degree for most jobs. Tanks in general are overhauled significantly, which in some ways makes them feel less special. They still have their own traits and stylish abilities, but most of the attack patterns and action unlocks are pretty synced up with one another. The only downside would be Paladins leaping attack is locked at a very high level, whereas Dark Knight and Gunbreaker are in their mid-50s. At least Paladin has one now. DPS seems to have been raised, but it would appear to be on both parties as someone who mains a healer, its a little more challenging to keep up. In addition, Healing has also seen an astonishing rework. White Mage receives the best treatment as they have more stackable and insta-cast heals with the lily gauge actually being incredibly useful. Scholar and Astrologian on the other hand have some of their complexity stripped, making them a little less entertaining to play. Outside of that, the job that received the most sizable update is Machinist, which is now one of the most fun jobs to play. Lastly, MP depletion has taken a significant impact. Square Enix has decided that the cap is now at 10,000, and adjusted skills appropriately. Unfortunately, its easy to find yourself bleeding MP early into a fight, at least for healers, Summoners and Red Mages.If you loaded up Shadowbringers on release, or early access, you may have noticed insane queues for Tanks. This is primarily because everyone is using the new Gunbreaker tank class, and for good reason. Prior to release, when we go our hands on a build of the expansion, we were worried Gunbreaker would just be a DPS job with damage mitigation, and we were more or less right. Gunbreaker is combo heavy with a focus on dealing damage. With that said, thats what makes it fun to play as. Its not as flashy as Dark Knight or as useful as Paladin or Warrior, but its far more alluring, and theres just something about the sound effects of both blade and gunpowder that give off a satisfying pitch. Finally, theres Dancer, who is a long ranged support class that really helps out now that Bard has gotten a bit of a debuff. Its heavily AOE centric, with numerous attacks doing raw damage to multiple enemies at once, and buffing characters via skills and linking to a dance partner, not to mention possessing the ability to heal party members. Its a well rounded, unique class, more so than Gunbreaker, that deserves to be in any partys chemistry makeup. I was a bit skeptical on both jobs both coming in after getting my hands on them prior to release, but having had a significant amount of time with them, I can safely say that theyre marvelous additions to the job roster that focus on inviting new ways to play. Closing Comments:Shadowbringers solidifies Final Fantasy XIV as the best MMO on the market. Sure, A Realm Reborn is still a huge barrier to entry, but if players are able to overcome it, they will be treated to not only two phenomenal expansions, but another that tells a story that rivals the best Japanese role-playing games of present and past. It truly feels like a JRPG of yore. The pacing is just impeccable, with only a small section in the middle that brings things to crawl. Fortunately, that doesnt take away from the exciting and captivating events throughout, and a third act that will blow you away. The dungeons are also top notch, with the final being one of the best in the series, although the Trials leave a little more to be desired. While another healer would have been preferred, Gunbreaker and Dancer are both solid additions that offer drastically different takes on their respective roles. The rebalancing of jobs has also made a considerable positive impact, although there are still a few that need to be reexamined as theyre currently in rough condition. Regardless, Final Fantasy XIV: Shadowbringers is what MMOs should aspire to, telling a story for the ages and engaging their players with evolving mechanics. Its an exquisite adventure that needs to be experienced.", "date": "July 8, 2019", "grade": 4.5}