{"name": "Inmates", "ref": "https://hardcoregamer.com/?post_type=post&p=274471", "text": "Prisons can be fascinating places, at least to people who have never seen the inside of one in real life. The fascination largely stems from the certain mystique they have and the presumed evil atrocities that are committed inside or what horrible acts got the residents incarcerated. Prisons exist in various security levels and can be as diverse as the people who occupy them, but people tend to be more interested in the worst of the worst environments. Movies and other entertainment that utilize fictitious prisons will more likely be modeled after ADX Florence than a minimum security adult transitional center. These hardcore penitentiaries can be mysterious and frightening from the outside looking in, but once you spend some time inside you become acclimated quickly, then the novelty factor wears off and it becomes mundane and routine. The same could be said for Inmates.Inmates is a psychological horror game that was developed by a single person, almost making one wish that reviews could be scored on a curve (they cant). For a game being made by one individual, there are some aspects that are fairly impressive but at the same time the limited development team is apparent in the end product. There are several good ideas showcased and the blueprints for a great psychological horror journey are present but unfortunately while the potential is apparent it never comes to fruition.The premise of Inmates is the player takes control of a man named Jonathan who after ascending a spiraling staircase where people sit suspended in birdcages wakes up inside of a prison cell. He cannot recall how he got there or where he is, but this prison has an undefinable element of familiarity to it. He also has an unrelenting headache so perhaps all these symptoms could be attributed to over indulging in toilet hooch the night before. While this wouldnt be the first time moonshine created a scenario like this, there are other factors at play since his cell is unlocked and there are no correctional officers or other inmates around. This eerie environment works wonders at quickly establishing a crushing sense of dread. The sound and visuals are remarkably well done at establishing the mood and environment, minus some texture issues that pop up with animation. The prison environment looks like something out of a horror flick, dank, decrepit and run down. Cells are empty, and while no specific faith seems dominant religious icons are abundant. Bible verses are scrawled on pieces of notebook paper in the cells, but there is also the holy bible and various books on demonology and exorcisms laying about as well. A few places have altars for various faiths set up, but these simply serve as remnants of a belief system with no one left to practice it, but in the context of inmates one has to wonder if this represents man abandoning god or vice versa. What seems really out of place are childrens toys and coloring books, and this does not appear to be a juvenile facility. The soundtrack is oppressive ambient noise that only adds weight to overall sense of dread and hopelessness Jonathan has to contend with.The set up is perfect for this type of game, but after that is where things begin to unravel. To progress through the story Jonathan is inconvenienced by various puzzles he encounters. None of these puzzles are very complex and really do feel like inconvenient impedances as opposed to real challenges. An example of these puzzles is early on Jonathan can get locked inside a random prison. There are two clocks in the room and a dial on the wall. Match the time on the dial to one of the clocks and the door opens up. Later on Johnathan discovers a radio and if he turns the dial a broadcast directed to him will begin when he turns the dial to a certain frequency, which most people would discover just by playing with the radio when they enter the room but they even have the correct station listed on a nearby piece of paper. They arent exactly brain busters but they give the player something to do to keep this from strictly being a walking simulator. The gameplay is quite simple and supports both controller and keyboard/mouse formats. Jonathan walks around the prison trying to piece together where he is and what happened. While Inmates did a great job of setting the stage for an unnerving descent into madness, the story never really delves deep into the nether regions of the psyche or brings truly startling revelations to the table. Instead of the plot taking unexpected twists or becoming deeply disturbing on an emotional level Inmates depends largely on visual and audio jump scares, like shaking the screen while some noisy random inmate suddenly and harmlessly walks past Jonathan. While unexpected initially, this tactic doesnt create any lasting sense of horror and seems like the easy route to get a scare out of player.Jonathan doesnt really fight anything so the only two actions he has are interact with objects he finds or open doors and light a match. The use of matches is an example of a nifty idea that ends up being pointless most of the time. Matches are the only source of light in dark areas and burn for just a scant few seconds. This sounds like an ideal inclusion for this type of game except most places have enough light they are only rarely needed and they feel like an infinite resource because almost every cell has matches lying around. This prison looks like it could be massive and labyrinthine but follows a mostly linear path in the three to four hour adventure. As short as that is, it feels like it was artificially extended but not allowing Jonathan to sprint and occasionally stopping him or slowing him down while he laments his situation or headache. Closing Comments:Inmates is a textbook example of untapped potential. Its obvious what the developer was trying to accomplish, but was only partly successful. The ingredients for psychological horror are present but they just never come together in a meaningful way. Inmates features the grand environment that is perfect to get under ones skin but slow gameplay, linear progression, predictable storyline and reliance on jump scares takes a promising premise and leaves it mired in mediocrity. Its a short time investment and inexpensive, so if it sounds interesting, there is some enjoyment to be had playing through it but theres better options for those looking for a cerebral fright fix. Its impressive for a technical project accomplished by one person, but unfortunately that is not something that factors into how enjoyable a gaming experience is.", "date": "October 5, 2017", "grade": 2.5}