{"name": "MotoGP 19", "ref": "https://hardcoregamer.com/?post_type=post&p=348477", "text": "The MotoGP video game series is one of the more long-running franchises from the same developer. For 2019, developer Milestone has really invested in MotoGP 19 with a plethora of content. Not only does it feature MotoGP, MotoGP 2 and MotoGP 3, the game starts to dig into the history of the sport. A lot of effort and resources have gone in to developing a new type of machine learning AI known as A.N.N.A. that hopes to revolutionize the way competition is treated in racing games. With all of these new aspects on the table, is MotoGP 19 Milestones crowning achievement?It is one thing to have the general MotoGP season in a game, but adding tons of depth comes with the inclusion of all three racing leagues. This includes every bike manufacturer, rider and team for the most current season. If that isnt enough , Milestone has included a Historical Challenges mode that will have players replicating racing moments dating back to 1990. This includes legendary 500cc bikes and riders from that era. The plethora comes from the turn of the century where the sport was arguably at its peak with the likes of Valentino Rossi, Casey Stoner and Nicky Hayden. Completing challenges unlocks the riders and bikes, but these challenges can be a bit difficult for the newcomer. Milestone even included video packages for each highlight that will really appease any fan of the sport.What digs deeper is the Career Mode that rivals Codemasters F1 games. Upon starting the game, players will create their rider with the option of using them in races or jumping into a career. This includes not only the three MotoGP classes, but also the Red Bull rookies. Players will start off in Winter Testing that will earn research and development points to improve the bike and team. Each team is performance-based and it clearly shows. Hopping onto a sister team from the likes of Honda Repsol or Ducati will be the first steps. Players will then progress through the season which is complete with some news stories across all MotoGP classes to help keep some investment in the season. Players also have the option to complete in full race weekends or just the race itself. The presentation is what really can pull the player into the coverage. Again, an aspect that rivals the Codemasters F1 games is the pre-race and post-race coverage. One can say that Milestone takes from that, but watching the actual coverage of a MotoGP race rivals that of a F1 race. Having an announcer and watching the pre-lap really consumes the player for each race, even though it may end up getting stale over time. This is still a really good inclusion. On top of this, the presentation intervals during a race such as time intervals is another great touch.As for the inclusion of the neural machine learning AI known as A.N.N.A., it does some things right. The idea behind this AI is to have each rider on the circuit set goals. Players will notice towards the end of races that opponents will come into corners hot as they push. The presentation will show overtakes on the track, but ultimately the actual passing wasnt noticeable. There are times where the packs will separate into different groups, or they all go single file. While all the math might be there for what the system is trying to accomplish, one thing that was clearly missed out on is track awareness. The AI literally has no idea that the player is on the track. I have had the AI run into the back of me, slide into me, cut me off. This can kind of kill the racing some. Speaking of racing, the on-track action can be a mixed bag. Players can used guided setups to try and help out with certain aspects they are struggling with, so they dont need to be an engineer to properly adjust the bike. There are also different riding styles that can alter how a rider controls. When watching MotoGP on live television, it purely is a symphony in motion. MotoGP 19 can reach that type of action at times, but the biggest issue is with managing cornering speed. Keeping balance and speed are the key to racing as losing traction will have the bike wobbling. It takes some precise control, especially with assists off, to accomplish this. There is enough here to make the racing fun and also enough to master the bike. Motorcyles are an entirely different animal than cars. The game does an excellent job of incorporating the riding aspects of racing, and the issues with cornering speed may come down to personal strength or the AI. MotoGP 19 does include wet weather racing that quickly increases the difficulty. There is a proper difficulty for everyone and frankly MotoGP 19 is one of the funner racing games I have played.Milestone had promised a racing game that hits 4K resolution and 60 frames per second. While it accomplishes this, there is certainly some sacrifice in visuals. The more important aspects of the game do look really good. Rider faces are properly replicated and the bikes stand out. The backgrounds and environment, while in motion, are sufficient enough. MotoGP 19 runs on the Unreal Engine, but its not the latest. Players will notice an abundant amount of jaggies in the distance as opposing riders will be noticeably degraded. The lighting in the game is a bit bright, but tracks at night and in the rain really stand out because of it. Cut scenes from pre-race and post-race are well done, as the focus is only on a few people. Even sitting in pre-race, the difference in the player models between the riders and other people are night and day.As mentioned previously, every bike class is different and that includes the sound. When wearing headphones, players will pick up a lot of audio details coming from the exhaust pipes. The 500cc bikes sound the best, but the actual sounds from the bikes are solid enough. The bike engines wont blow anyone away, but its important that each bike class sounds different. The soundtrack does a great job, as well, in capturing the emotion of the sport.Milestone has jumped on the e-sports wagon with MotoGP 19 and some improvements have come to multiplayer. The game includes a race director mode along with dedicated servers. There is a lobby system in the game, but no online championships. Racing online was seamless and enjoyable. There was no lag involved and the controller input was precise. Players can also hop in and watch races. One pet peeve I had when joining races is that they just end. There isnt any waiting for the race to end then going back to the room.Closing Comments:The time and effort for MotoGP 19 prove that this is Milestones best game to date. Its actually only $50 and has more going for it than some of its competition. The racing is enjoyable and has the ability to be mastered while the A.N.N.A. AI has some flashes but some other aspects need to be touched up. The plethora of bike classes are welcoming and the Historical Challenges will have players hooked. While the visuals take a bump, fans of the series will no doubt enjoy the updates to the game.", "date": "June 8, 2019", "grade": 4.0}