{"name": "Persona Q2: New Cinema Labyrinth", "ref": "https://hardcoregamer.com/?post_type=post&p=348003", "text": "With the advent of Nintendo Switch, the aging 3DS hasnt been getting all that much love. Titles are still releasing for the line of hardware, but the platform has just been creaking along, ready to fall over. Nintendo themselves have been keeping the life support plugged in with periodic releases of remakes and re-releases, but the prognosis hasnt been great. Its to be expected. Things age and fade away, but the demise of the 3DS has been a bit sad. There hasnt really been a grand send off along the lines of Twilight Princess for the Gamecube or Mario Maker on the Wii U. Sega and Atlus are picking up the slack here, giving the 3DS a grand farewell with Persona Q2: New Cinema Labyrinth. This is a game that could only work on the dual screen device and its one of the best ones available for the platform.Veterans of the first Persona Q will have a good idea of what to expect. The Phantom Thieves crew from Persona 5 are tooling along, exploring Mementos, when they suddenly find themselves somewhere that isnt the amalgamation of societal attitudes. Chased by a giant monster, they run and jump through a wall (as one does), landing in a theater. Here, they discover that they are trapped, with a door bearing four locks being the only hope for escape. To get the keys for the locks, theyll need to clear the dungeons available to them. The conceit behind the dungeons this time is apparent from the title. In the first Persona Q, the overarching theme was literature. Now its all about the movies.The gameplay itself is a major improvement over the first Persona Q. Q2 incorporates a host of quality of life changes. These games are a marriage of the Etrian Odyssey titles and Persona, with a heavy emphasis on the Etrian Odyssey part. This means lots of first-person dungeon crawling, careful effort in min-maxing the stats of each party member and hand drawing the map using the touchscreen on the hardware. This is going to seem to be heresy, but people who avoided the Etrian Odyssey series because of the map drawing nonsense are in good company. While pulling out the graph paper was a fine solution in the olden times of the 80s and 90s, technology has advanced well beyond the point where that was a necessary part of the experience. Bringing it back as a required mechanic simply felt like it got in the way of the actual interesting part of the game. The developers finally realized this line of thought with Etrian Odyssey Nexus and the option for automapping is available in Q2. This automatically makes this title better than the first. Otherwise, players of the first will have the gameplay loops down quickly here. Explore a dungeon, grind for currency and materials, avoid FOEs (super powered minibosses that stomp around the dungeon) and clear the dungeons. This last statement comes across as more dismissive than intended. The rapid rate of growth and reward found in the title makes for an addictive experience. Around every corner, there could be a fresh search spot that will yield valuable materials that can be sold to the concession stand for cash. After selling them, the purveyor, Theo, will dump the crud into the popcorn maker. After all, if popcorn makers can turn kernels into popcorn, itll turn random bits of rock and bone into a new beast-slaying weapon, according to the games logic. Leveling up is done at a brisk pace while still feeling rewarding, and building a stable of sub-Personas to augment each heros base stats feels like a great exercise in give and take. Once the first hour or so of set up has been completed, theres an untold amount of quality play to be had, no matter the difficulty level chosen.Graphically, Persona Q2 demonstrates the age of the hardware. After growing used to the resolution and detail of the Switch, and to a lesser degree, the Vita, the jagged and muddy appearance of the crew is unpleasant. While the animated cutscenes look great, the standard character models tend to look less like cute chibi versions of themselves and more like formless blobs. Morgana and Teddie manage to escape this curse relatively unscathed, but theyre the only lucky ones. Fortunately, the environments themselves look decent, owing to the fact that the backgrounds tend to be repeated, if highly detailed, textures and models. Even so, the game seems to be pushing the 3DS to its maximum capacity. During play, the one attempt to back out to the systems home menu caused a total crash, seemingly due to memory concerns. To help surmount the system issues, Atlus has done some great work in translating much of the stylish flair from the PlayStation big brother. Red is all over the interface and the menu features the same crooked font. The feeling of inhabiting the world of an over-the-top group of supernatural thieves of twisted desires makes its way to the small screen, with the tone permeating the experience even after SEES and the Investigation Team pops up. Many nods and winks to series fans, usually in the form of wonderfully terrible wordplay, are thrown out and left to properly stew. Its hard not to crack a smile when seeing that the next dungeons film is going to be entitled Junessic Park.Despite the graphical issues and the familiarity, the game itself manages to be a rollicking time. Once the ball gets rolling, the dialogue between the characters and the story brings back that great Persona feeling. The boisterous and charming characters across the three best Persona titles translate well to this latest title. Good-natured bickering happens frequently among the party, which the player can choose to egg on, but theres always a sense of camaraderie that makes these kids seem like people that one wants to be around. The quality of the writing matches that in the originals, managing to finally resolve something that has been nagging at this reviewer. Among the series faithful, it is generally agreed that the fifth was the weakest entry of the 3-5 trilogy. This is somewhat confounding. The fifth entry was the product of years of loving work. It was slathered in a unique pastiche, featuring lovingly-crafted and clever Palaces to explore in addition to the randomly-generated areas that made up the dungeons of the past games. It was gorgeous. In playing Q2, watching the three groups interact, what was missing finally became clear: the characters. The Phantom Thieves are charming, but the problems they experience in the real world arent exactly relatable. Most people havent been framed for a crime by a crooked politician. Most arent being plagiarized by a famous painter. The characters in the other games face issues like not fitting in with what society, family and peers expects of them. Even when a character is a fantastical robot laden with armaments, it still feels human. Still, taking last place in the most likable character contest in this series is like being described as the weakest person to win a professional heavyweight boxing belt; you wouldnt want to meet them in a back alley on a bad day (Give me your money or youll be bludgeoned with whimsical banter!). This is all a longwinded way to say that Persona Q2 brings all of the great characters back exactly as they were in their respective titles. That alone is a major selling point.Finally, theres the music. Some of the best tracks from the original RPGs have returned here and sound great. Each is used extremely well in the story and add to the drama and experience. There are new tracks too and theyre simply fantastic. The new stuff tends to hew close to the best parts of part 5s soundtrack, evoking the disco thief vibe, with a bit of rock thrown in. Those that collect game soundtracks should be sure to hunt this one down. Closing Comments:Persona Q2: New Cinema Labyrinth is not a perfect game in the overarching landscape that is video games today. For the platform, though, its one of the best. Barring the one technical issue experienced during play, it makes use of the hardware as much or as (almost) little as the player wants. The story is expansive and filled with great moments of the cast of three of the best RPGs ever made interacting with each other (check out Kanji trying to hug Morgana). Sure to keep the 3DS clean of dust for some time, Persona Q2: New Cinema Labyrinth is the perfect farewell for Nintendos handheld, and one that will appeal to fans of the series and old school dungeon crawlers alike.", "date": "Bohn on June 3, 2019", "grade": 4.0}