{"name": "Team Sonic Racing", "ref": "https://hardcoregamer.com/?post_type=post&p=347547", "text": "In the pantheon of stupid, stupid ideas, taking a character known for his foot speed and tossing him into a car for a racing game manages to top the list. The only thing that might top it is Ham Gloves, the fashion wear for the cowardly autosarcophagist. This is a long way of pointing out that the existence of the Sonic kart racing games can only be described as equal parts ridiculous and smacking of attempting to get some of that Mario Kart money. The thing is, once all the kinks were ironed out, the second title in the series, Sonic & All-Stars Racing Transformed topped everything Mario was doing in his karts. The fact that Mario Kart 8 turned out as well as it did probably had much to do with Sega pushing the genre forward. With the announcement of a follow up, the mind races through the potential leaps forward that would be found in the package. Lamentably, the results are a tad underwhelming, not quite reaching the level that Transformed had to offer. This isnt to state that developer Sumo Digital phoned it in with Team Sonic Racing, though.Theres a bit of a story to be found in the game, but its unimportant. Sonic shows up to tell his friends that hed love to eat a chili dog at a picnic, but he got offered a chance to go race some experimental cars. The inventor of the vehicles shows up and amiably invites the rest of the crew while calling them idiots. Look, one doesnt show up for a kart racer for a story, but credit has to be given for the developers leaning into the worst of the Sonic lore to create something that manages to land hard on the correct side of the irony scale. Its a throwaway moment to introduce the single player campaign, but it managed to be more endearing than most of the high-budget CGI Sonic cutscenes since the 16 bit era. That is to say, it knows exactly what its about and leans into it hard.As far as new features go, Team Sonic Racing lists what its about right in the title. While there are classic every anthropomorphic nightmare creature for themselves races, the biggest change up comes in the team based races. Racers are divided up into teams of three, with the goal being to work together to get everyone across the finish lined as soon as possible. Players can aid each other by sharing items, providing a speed boost to friends who have been slowed by a rocket and creating a trail for other teammates to follow that provides a bonus acceleration. Sure, a talented player will be able to take first while using every item they find and expertly drifting around corners, but teams working together will end up winning on points even if they come in behind the selfish driver. This isnt to say that the skilled driver can make up for the unskilled moonbat throwing themselves off of every conceivable cliff. The team dynamic helps to create a balance that allows for the lesser talented to still contribute. One of the things that made the last title stand out has been carried forward to Team Sonic Racing: the expansive single player campaign. The maps are laid out in worlds, similar to Super Mario Bros. 3, and offers plenty of variety. Of course there are races and grand prix matches to barrel through, but the challenge stages also return. These run a wide gamut of styles from slaloms, target destruction and ring gathering races. The last has increased in challenge from the last title. The goal of collect rings to top off the ever dwindling timer clock is still in place, but the lay out of the rings on the track and amount of time they add demands perfection. Any flubbed turn means that its better to just pause and restart. This is fantastic for players that want to push themselves and become a beast of a challenger online, but this is a game that is ostensibly intended for the younger crowd. Since the replay value is already high, there isnt a reason to pad the length to prevent the tykes from beating it during a rental, like in the NES days.While the single player content is meaty enough to justify a purchase on its own, multiplayer is where the kart racer thrives. Team Sonic Racing covers that well. With the expected quickplay, casual and ranked matches, theres always a fair race available for whatever the mood. Plus, it runs like a dream online. Even on a less-than-stellar internet connection, I experienced no dropped frames or lag in the high-speed driving here. Weaving around obstacles, getting an extra back flip in a frame before landing or tagging a rival with a dumb rocket worked flawlessly. The net code is solid. Playing locally is a bit less ideal, though still workable. Trying a three player team race on one PS4 Pro caused the framerate to dip a bit and the feeling of momentum was reduced. Its still perfectly serviceable, but it doesnt feel as though as much work was put in here as it was for online. Considering the twenty one tracks, with twelve of them being new, theres plenty of fresh racing to be found. While theres a ton to praise about Team Sonic Racing, it does somehow feel a bit less substantial compared to the previous iteration. The clue as to what is missing is right in the name: Sonic & All-Stars Racing Transformed. The cast of fifteen characters is all Sonic based this time around. The joyous feeling of running an opponent off of the road using the lame but adorable AiAi isnt available to be had here. Its not like Sega and Sumo didnt have options. Running around the track as Joker driving a crop-top Morgana van would have been an obvious inclusion. Of course, there may be DLC. Missing out on the transformation bit also feels like a step back. Jumping off the road and continuing a race by boat added a ton to variety before and this package feels somewhat lesser in comparison.Finally, theres how upgrades and cosmetics are unlocked. While there are a few that requires completing challenges, most of them are found in a Gatcha machine. To the games credit, theres no way to feed real money into the machine for better results. The stuff is only unlocked by spending coins earned in game. While that massive pitfall was avoided, it misses the other reason why the lootbox trend sucks: its based on luck. It used to be that, when coming across someone with snazzy guff online, it was an indicator of their skill and or dedication to the game. With random loot boxes, its only a measure of how lucky they were with the random number generator. Loot games like Diablo are excepted from this rule, but relying on Gatcha machines for upgrades and rewards in games is almost universally dull. Closing Comments:Theres a ton to like about Team Sonic Racing. The racing itself is as tight and high octane as ever while remaining accessible. Some of the challenge might be a bit much for the wee ones in single player, but otherwise, the solo content is extremely engaging and well balanced. Online works like a dream and local play with friends will still serve up some classic rivalries turning into fist fights. By design, theres some stuff that was in the previous game whose absence feels missed here, but Team Sonic Racing is still a no brainer for Sonic fans and kart racing fans alike. The concept might still not make sense, but that doesnt mean it isnt fantastic.", "date": "Bohn on May 28, 2019", "grade": 4.0}