{"name": "One Finger Death Punch 2", "ref": "https://hardcoregamer.com/?post_type=post&p=328994", "text": "Stick figures are nothing but trouble. Put two of them in the same space and theres going to be nothing left but a smoking crater once the dust finally settles. Stick figures gonna fight and thats all there is to it. Nowhere was this chronicled more successfully than One Finger Death Punch, which originally came out on the Xbox Live Indie Games platform back in the day. The two-button brawler made up for its simplicity by being far deeper than its control scheme would imply, mining the setup for what seemed at the time to be every idea possible. Enemies streamed in from the left and right sides of the screen, and once they were within range you hit the correct shoulder button to dispatch them. It had a huge amount of content and a fantastic visual style, and while it could be repetitive, the game wasnt made for binging. The developer, Silver Dollar Games, had a lot of titles on XBLIG of what could tactfully be called varying quality, but One Finger Death Punch was a solid hit.That was six years ago, though, which is just about the right amount of time between a game and its sequel. One Finger Death Punch 2 was created with the goal to make the original game obsolete and it succeeds at this beyond all possible reason. Four hundred levels, over two dozen special abilities, uncountable hundreds of martial arts moves and an incredibly kinetic spectacle of stick-figure violence work together to make this two-button brawler far more playable than the phrase two-button brawler can explain. Theres rarely a moments rest and the simplicity of the controls lets you pull off moves you wouldnt have thought humanly possible, acting without thought to flawlessly clear each new wave of attackers.First, though, there are sixteen levels of tutorial to go through before the game begins properly. It sounds like a bit of a slog but each of the intro levels are a standard encounter introducing a new mechanic. First up is punching things, which is done by waiting for one of the stick-figure baddies to run into your zone of attack, as indicated by the gauge underneath the player character. The intro stresses thoroughly the idea of Do not button mash!, because a true martial artist strikes with precision rather than random flailing in the hopes the enemy is careless enough to fall into the line of attack. A miss leaves you open to getting hit, so its important to only ever attack when theres something there. Which is just about always. While the attack gauge shows your range, its not a precise science, and once youve started a combo the attack zone can grow far beyond the default area and even to enemies off screen. The attack indicator is impossible to miss, so theres no danger of a false positive, and the game even slows down a bit when an enemy gets too close. ODFP2 wants you to win, and while it wont hand over the victory, the deck is always stacked in your favor. Other tutorials introduce regular weapons, which are fun to play with but dont do any extra damage, and super weapons, which look powerful and dispatch all enemies in a single hit. There are also enemies who hang out beyond the edge of attack while throwing projectiles your way, for you to swat out of the air, dodge or grab and throw back depending on criteria that, honestly, are never all that clear. Sometimes you can grab a shuriken out of the air and toss it at the nearest enemy, other times you duck and it takes out the stick figure coming up behind, and if theres an internal logic determining which action you get, Ive got no idea how it works. The point is a successfully-countered projectile takes out an enemy for you, so it all works out right in the end.The rest of the training is about enemy types, of which there are several. The standard baddie is a grey stick figure that goes down in a single hit and these are the bulk of the attackers in every level. There are also enemies of varying colors that take two to four hits to go down and the bars beneath them tell you what the pattern is. All enemies have at least the one bar beneath them, red on the right and blue on the left, but the enemies requiring multiple hits can have both. An enemy coming from the right will always have a red bar first, but if theres a blue bar below that then you know it will dodge left after the first attack so a quick right-left tap when its in range dispatches it instantly. When youve got several different types of multi-bar enemies coming from either side, though, youll need to come up with an order of operations on the fly to handle all of them at once, and after a bit of experience youll sit back somewhat amazed as your fingers take care of things for you. The brawler enemy is similar to the multi-bar ones, except when it shows up the other attackers clear out while you face off. Bars drop down from the top of the screen, color-coded in the standard red/right blue/left fashion, and you need to hit the correct button combination for as long as the encounter lasts. Some go down after two or three bars, others can take a good dozen or more attacks before a solid hit finally gets through. The last major enemy type is a boss stick figure, indicated by a crown on its head, and these fight like a combination of brawlers and multi-bar goons in that you alternate between the two enemies attack styles until finally whittling down the boss health. A good level of OFDP2 is a long stream of all the enemy types, mixed together in waves, and while it can seem like pure chaos to an observer, theres a logic to it thats hard to see unless youre actually playing.Part of this is due to the speed at which everything is happening. A level starts off at a speed ranking of 1, but at points during each wave a glowing enemy shows up carrying a big green plus icon that speeds up the gameplay. Theres also a manual speed adjustment you can increase if your personal skill level isnt getting the workout you want, although I found that after a few hundred levels it felt plenty fast enough. That brief moment of slowdown when an enemy or projectile is close shrinks down to a microsecond by the time youve gotten a few speedups in the later areas, but its nice to see there are options for the hyperactive overcaffeinated meth-squirrel players.All these details are introduced in the linear opening tutorial, after which the game opens up to a series of interconnected maps with branching pathways. Each stop on the path is a gate to a new level, with an icon above indicating what type. The most common version is the Mob Round, which sees a counter at the top indicating how many hundreds of enemies will be coming your way. Dispatch them all and you win, but be careful not to miss any attacks. You can clear a level taking a few hits and the game wont judge, but five misses or more impacts the star ranking. On the one hand getting five stars for missing four times is a bit generous, but one of the games end-of-level hints is Dont be a perfectionist. Most levels can have the five-star ranking attained by an attentive mortal player and those who want more of a challenge can manually crank up the speed. Other level types include Blade Storm, where enemies are replaced with projectiles, Multi-Round, which has a series of smaller fights with the speed increasing after each one, Drunken Master, where the hit bar sways back and forth, and many more. OFDP2 introduces new level and enemy types even on its last area map, constantly switching up the challenge. The action may be controlled by hitting left or right, but theres an incredible variety of things you can do with those two little buttons. Closing Comments:Theres still more buried in One Finger Death Punch 2, such as bonus game modes, unlockable and upgradeable skills, bonus levels, customization options, and entire maps filled with levels that arent actually necessary to beat the game. There may be an end to the content but its hard to know where that might be, and it feels like every single idea that could possibly work with this setup was polished and included somewhere. OFDP2 is a huge game, but the important thing is that even if it was a fraction of its size it would still be worth playing. The simplicity of the controls make it easy to sink into a gaming trance, sitting back in your own head while instinct works with experience to perform a hundred little decisions per second with lightning-fast precision. One Finger Death Punch 2 is an epically huge arcade two-button brawler that shouldnt be anywhere near as good as it turned out to be, but if stick-men are going to die by the thousands for our personal entertainment, theyre determined to put on the best show possible while doing it.", "date": "April 17, 2019", "grade": 4.0}