{"name": "The Walking Dead: The Final Season  Take Us Back", "ref": "https://hardcoregamer.com/?post_type=post&p=327720", "text": "After nearly seven years and nineteen episodes, Telltales most ambitious project has finally come to a close. Featuring dozens of characters, hundreds of zombies and too many tough choices to count, Clementines journey has been an emotional one, to say the least. After revealing that this fourth season would be the series last, fans have been wondering and worrying if Clementine will fall victim to the same fate that so many of her friends and enemies have. Attempting to wrap up this multi-dozen hour narrative in a clean and satisfying fashion is an undeniably tall task, particularly considering Telltales closure during the midst of this final season. While the final hours of Clementines adventure provide some of the series most memorable moments, the indecisive nature of Take Us Back holds the conclusion back from being truly satisfying to long-time fans.While the remainder of the review will not address any spoilers for Take Us Back, important plot points from the previous episodes of the season will be discussed below. For more on the final season, check out the reviews for Done Running, Suffer the Children and Broken Toys.Take Us Back picks up right after the chaotic ending of Broken Toys, as Clementine and AJ must escape the wreckage of the sinking boat and the consequences of Lilys actions. The combat sequences in this episode remain unsurprisingly similar to previous ones from the season, but the brief nature and raised stakes of the later ones make them feel stressful in an effective manner. The presentation also remains consistent, with the priority clearly lying on the advancing and concluding nature of the narrative at hand. As old problems are solved and new ones arise, the episode still finds time to prioritize its conversations, including the continued standouts of the season, the dialogues between Clementine and AJ, as Clementines final attempts to shape AJs future hang in the balance. Both of them are provided effective voice acting considering the delicate nature of this final episode, while the remainder of the cast also does a solid job.With Take Us Back not being only the season but also the series finale, there were plenty of story strands to wrap up as the relationships Clementine has formed continue to be in flux and their fates are sealed. Without directly addressing the possible outcomes, the fluctuating nature of the final few scenes work against the strong storytelling of previous episodes and seasons in the series, as many of the most dramatic moments in The Walking Dead are abrupt and clear. Unfortunately, the same cannot be said for the closing moments of Clementine and AJs tale, which flips back and forth and suffers from an unclear sense of finality across multiple scenes, leading to an actual ending that is tough to be content with. After so many characters in previous seasons have seen fitting conclusions to their arcs, its a shame to watch the story stumble in its final moments with some of its most noteworthy characters.Closing Comments:Take Us Back is a well-constructed but ineffective conclusion to Telltales The Walking Dead series. While the gameplay and presentation remain well-suited for the final hours of this journey, the waffling narrative holds back some of the episodes final decisions from being truly meaningful. Although Take Us Back is not the lowest point in the series by any means, having the series finale falter in these crucial concluding moments makes each misstep seem that much larger as both Clementine and Telltales lengthy adventures reach their end.", "date": "on March 28, 2019", "grade": 4.0}