{"name": "Sekiro: Shadows Die Twice", "ref": "https://hardcoregamer.com/?post_type=post&p=327324", "text": "Death has always been an essential aspect of From Softwares games. Its both a punishment and learning experience in Dark Souls and Bloodborne. In Sekiro: Shadows Die Twice, From Softwares latest title, death permeates the entire experience. From the fast, brutal gameplay to resurrection, death is a constant in Sekiro. This time around, however, From Software is trying something new with their tried and true formula by composing a proper, personal story, speeding up gameplay, and giving players additional tools to tackle enemy encounters. Is Sekiro: Shadows Die Twice worth the constant deaths and resurrections or should it have stayed dead?Sekiro: Shadows Die Twice takes place in Sengoku Japan during the 1500s. You play as Wolf, a Shinobi who serves as the protector to his master, a young lord descended from an ancient bloodline. On a mission to rescue him, Wolf, or Sekiro as hes also called, loses his left-arm in a duel and is left for dead. Finding himself in a constant-loop of life and death, Wolf embarks deep into enemy territory to rescue his master and exact revenge.Sekiro is a more personal tale than From Softwares previous efforts. While Dark Souls and Bloodborne told interesting tales, it was mostly accomplished through world-building. Sekiro still has that but also injects personal goals and objectives. Wolf comes packaged as his own character with motivations and personality rather than being a player-created character. He has history with this world and characters, which makes it easier to connect with Sekiros world. The revenge plot isnt very original, but its personal and gives us an anchor to the world.Littered throughout the locations is From Softwares legendary world building. From the NPCs you meet to the hidden memories scattered about, theres always something to learn about the world. With branching story paths and areas you may miss during your first playthrough, Sekiro finds plenty of ways to sink its teeth into you. Combine the world building with a more personal story and you get From Softwares best story offering yet.Director Hidetaka Miyazakis intricate level design makes its grand return. Ashina provides a vast playground of temples, castles, canyons and warzones to traverse as Wolf pursues his objectives. The different areas connect seamlessly and are filled with secrets to discover. The addition of platforming adds a new wrinkle to the worlds design by allowing for larger and more open environments.Equipped with a Shinobi Prosthetic that doubles as a handy grappling hook, players will find numerous areas Wolf can grapple onto throughout the environment. This opens new traversal areas and creates new gameplay opportunities. With the addition of stealth, learning to use the environment to your advantage is key to survival during tough enemy encounters.Sekiro disappointingly doesnt feature any weapons outside your katana. Considering all the unique weaponry in Sekiro, it would have been nice to acquire and turn some of those weapons on their masters. Instead, the lack of weapon variety is made up with use of the prosthetic arm which doubles as a combat weapon and tool. Found out in the world, each tool adds additional functionality to the prosthetic. For example, the shuriken launcher is great for interrupting enemy attacks and the flamethrower deals massive damage to more supernatural enemies. Prosthetic tools can be further upgraded by finding materials around Ashina. The tools dont create the same gameplay variety as different weapons might, but theyre great additions nonetheless.If theres one thing that must be made clear is that Sekiro: Shadows Die Twice is not like Dark Souls and Bloodborne from a gameplay perspective. Sure, the game shares a lot of the same DNA, but if you play Sekiro like either of those games, then you will die over-and-over again. The dodge, hit two or three times and run away tactics that defined Froms previous efforts dont work here. Sekiros gameplay is all about studying the battlefield, stealthily taking out enemies and then pressing the attack.Gone is the stamina system from the previous games. Instead, Sekiro employs a new Vitality and Posture system. Posture defines the entire combat system with the players goal to break an enemys posture and leave them open for a deathblow. Wolf himself has a posture bar that, when full, leaves him open to attacks.Players fill the enemys posture bar by accurately deflecting their attacks, landing attacks, forcing them to block, countering and using the prosthetic tool. Vitality is, simply put, the health bar. The more vitality you or the enemy have, the faster the posture bar decreases. Continuously pressing the attack is so important since successfully breaking an enemys posture, even a boss, is an automatic kill.Sekiros gameplay is hugely challenging and it can take some time to adjust. Once you get over that hump and embrace Sekiros take on combat, however, youll realize just how satisfying and rewarding the gameplay-loop is. Theres nothing quite like breaking an enemys posture, seeing that deathblow marker and then ending the battle with a blood-splattering finisher.Thats not to say getting a grip on the combat makes the game any easier. Sekiro: Shadows Die Twice lives up to its predecessors penchant for being challenging. The game is hard and it will punish you if you make a mistake. There are healing items, including Gourds (similar to the Estus Flask), but they have limited uses. Players can also spend experience points and key items to learn new abilities and increase their Vitality and strength, but that wont protect you from death. Death is a learning experience, but in Sekiro its also a tool. During a life, Wolf has the opportunity to resurrect up to two times. This provides players an opportunity to correct their mistakes.Dying though can be brutal. At death, youll lose half of your gained experience and Sen, the games currency. Sometimes though, players receive Unseen Aid from Buddha that prevents any loss of experience and Sen. The downside is that dying increases the chances of an NPC acquiring a sickness called Dragonrot. The more NPCs infected with the disease, the lower the change of receiving Unseen Aid. This adds a new dynamic to dying in a From Software game. Theres a chance that death wont affect you, but that could drop anytime you die. Like Bloodborne or Dark Souls, death can still be punishing.Overall, dying feels mostly fair and primarily caused by careless mistakes. Thats not to say every death feels fair. The game encourages players to press the attack continuously, but its too easy to overdo it and make sloppy mistakes. Most unfair, however, are the non-human enemies. When facing animals or supernatural monsters, it sometimes isnt clear what your sword can and cant deflect. For example, a raging bull charging at you feels like it should be something to dodge, but dodging could get you killed. Instead, Wolf is supposed to block it, which doesnt seem physically possible considering its a bull charging at you. Sekiro could have used more clarity when going up against these types of beasts.Overall, the gameplay-loop in Sekiro is exceptionally satisfying. Aside from a few hiccups when facing non-human enemies, From Software has crafted a mechanically sound way to engage with enemies. The game demands precision and any mistake could mean death.From Softwares worlds have always been painstakingly crafted to fit with the games setting and tone. Sekiro: Shadows Die Twice fits that mold with its beautiful Japanese aesthetic. From the bamboo forests to the temples to the armor on each character, the game lovingly recreates its 16th Century Japanese setting. Its all furnished with beautiful touches, such as red-tinted leaves blowing in the wind and sparks flying every time katanas clash. Despite the occasional frame-rate drop, Sekiro runs and plays well, though the game never felt like it was utilizing the extra power offered by the enhanced consoles.On the sound side, Sekiro delivers a tension-building soundtrack thatll keep players on the edge of their seat. The games voice-acting defaults to Japanese with an English option available. While the English voice actors turn in a decent performance, Sekiro is at its best in Japanese. Not only do the Japanese voice actors deliver a better performance, they also add additional authenticity to the Japanese setting.Sekiro: Shadows Die Twice may not fully maintain 60fps, but remains a joy to play and look at. The game utilizes a beautiful aesthetic, mesmerizing effects and fantastic audio to transport players to Ashina.Closing Comments:Death is one of many constants players have come to expect from a From Software title alongside a well-designed world, a gameplay loop that rewards risk and experimentation, and a fair challenge. Sekiro: Shadows Die Twice mostly checks these boxes while delivering a new take on the traditional formula. While not original, Sekiros story provides greater context through its pre-defined protagonist and his motivations. The game is faster to focus on offense, but still retains that addicting gameplay loop players expect. Sekiro is difficult, perhaps unfairly so at specific times. The gameplay is overall satisfying, though there are moments where its unclear what can and cant be deflected or dodged, making for an experience that feels more unfair than any Souls game or Bloodborne. Set against the backdrop of a gorgeous Japanese aesthetic, Sekiro: Shadows Die Twice combines what makes a From Software title special into an excellent, solid package that fans are going to love. Death may be a constant in Sekiro: Shadows Die Twice, but its worth getting up each time.", "date": "March 21, 2019", "grade": 4.0}