{"name": "Forza Motorsport 7", "ref": "https://hardcoregamer.com/?post_type=post&p=274067", "text": "With the exception of maybe the Xbox Ones launch title, year-after-year, Turn 10 Studios has consistently made some of the best racing games on the planet. While they may not be as hardcore simulation as some, such as DiRT Rally or Project Cars, the Forza Motorsport series contains a high level of customization and tuning, far more than most have become accustom to. With the biennial release going to Playground Games Forza Horizon 3 last year, its back to more track-oriented racing as the Redmond-based developer has crafted an iterative experience that hopefully will please those looking to race around their favorite tracks scattered across the world. Even though the Horizon series, in our opinion, has taken over its elder brother in terms of delivering a highly accessible racer, this is what the Forza series started with, and they have expanded upon the formula substantially from the first game way back in 2005. Considering the Xbox Ones somewhat lacking holiday lineup, Forza Motorsport 7 is Microsofts biggest showcase for not only Xbox One and PC, but the upcoming Xbox One X. Is Forza Motorsport 7 the jump the series has needed, or is this just more of the same?Mechanically speaking, Forza Motorsport 7 is masterful. Its the same driving mechanics weve come to love for years now as players will be speeding around and around various race tracks, but most importantly, it comes with more cars than you can comprehend. There are a staggering 700 cars to collect  an insane amount for any game, and each one feels unique. As per usual for a Forza game, whether its how they control or their audio quality, the way Turn 10 Studios represents the numerous vehicles to their real life counterparts is on a new level. Revving your engine and squealing around corners has never sounded or felt so good, and each has been designed with perfect accuracy. The big addition this time around is Porsche vehicles finally making their long awaited return, as only earlier this year have they been slowly added to the Forza experience. Put them in the various modes outside of the standard circuit race, such as drag racing and drifting, and you ultimately get an incredibly robust and feature rich racing game that has every means of lasting the two years before the next Forza Motorsport title, if not longer. This is also complimented with 32 locations to visit, from the iconic Nurburgring to the bustling city of Rio de Janeiro, and numerous variations for each. Suffice to say, variety is Forza Motorsport 7s strongest trait. Because there are so many vehicles to take a seat in, this allows for almost unlimited play, and the way Forza Motorsport 7 progresses actually helps encourage players to use cars that they normally wouldnt ever touch. This might be a less than popular opinion, but I think locking more of the super cars behind a secondary leveling system is smart. Alongside your own personal level, which is progressed through completing races, theres a Collectors level. As you buy and obtain new vehicles, they will give you a better Collectors rating, allowing you to rank upwards of five times. The pricier and faster cars are obviously hidden behind the higher ranks, with some of the less than ideal vehicles being accessible early on. Youre still able to race with your favorite cars in specific events by renting them, but this will put a restriction on earning credits or experience in the process. Its understandable if players dont like this system considering it almost feels wasteful to throw away hard earned Credits on vehicles that they dont really want, but really, the ranking system is deceptively fast. After a few days, I had almost reached the fourth rank, so there really isnt too much to worry about.As per usual, the rewind feature comes as an option for those who are just learning the mechanics, and obviously disabled during online play. Normally I would suggest against using this feature, but considering Drivatars can be complete dicks and constantly ram you off the road, it might be a good backup option when youre on the final straight away and someone decides to careen into you. Speaking of which, Drivatars make their inevitable return for the fifth time in series history, and once again they highlight the incredibly aggressiveness of players. There were numerous times where someone just pitted my car or slamming into others on the track. With that said, there are moments where this feature is put into question only because things can slow down to a crawl considerably. In the early parts of a track, the first and potentially second corner will see every single car be ever so considerate and follow a slow leader. This Drivatar feature can be adjusted before hand, but its far from the perfect implementation, at least from the early goings. It might take some time before theyre populated with more properly represented AI.Customization is a huge part of the Forza formula, and the latest iteration doesnt skimp out. As per usual, you will be able to adjust each cars tires, gearing, alignment, and so forth, with under-the-hood parts being available for purchase to better upgrade a specific vehicle. If youre someone who doesnt likes messing with things, you still can be competitive in both online and offline matches, but for more hardcore fans who like specific driving attributes, these options are made available. Speaking of offline modes, there is a campaign called the Forza Drivers Cup, but it isnt anything revolutionary, as its primarily here to help unlock specific cars and accessories in a quick manner. This has players go through a number series and showcases, some unique such as going head to head with racers, and your standard circuit tournaments. Its a fine campaign overall, keeping players busy and could be a good tutorial for those looking for learn some of the basics, but if youre a veteran of the series, this probably wont be the reason youre playing. Graphically, Forza Motorsport 7 looks immaculate. Racing games have always been a showcase for hardware, but if you thought Forza Horizon 3 maxed out the 4-year old systems capabilities, youd be wrong. The biggest introduction to Forza Motorsport is dynamic weather. There have been weather effects such as rain in past, but they have been baked in the world, being static throughout a course. So now, when starting a race under rainy conditions, the clouds will begin to form and eventually pour later on. Same can be said about the time of day as theres nothing like coming around the corner during a night track only to see the sun slowly peer over the horizon. With that said, I would have loved to see more weather varieties outside of day, night and rain. Considering theres a both desert and frigid mountain terrain, it would have been great to see Turn10 use sand and snow to affect both visibility and control. Throwing in some black ice would add some much needed randomness to the mix. Still, this is one step in the right direction and leaves some room for improvement. Outside of that, there are just small, subtle details to appreciate, such as the reflection of your hands and the steeling wheel inside the cockpit of a car, and the consistent damage that is reflected both on vehicles and the track. With that said, load times can be a bit long, even for a racing game, as it can take over a minute to load a track. Normally this wouldnt be so bad, especially considering you can mess around in the menus while it loads, but if you want to make small changes to course, you will need to start the counter over once more. Regardless, Forza Motorsport 7 is a visual showcase that will take your breath away, be it on Xbox One or PC.Now lets talk about the inevitable fears of microtransactions. This has been a heated discussion ever since the Xbox 360, but only recently has it intensified as it has become more and more prominently applied. Forza Motorsport 7, as of the time of this review, doesnt have paid microstransactions, although chances are that Turn 10 and Microsoft will eventually open things up later on. We got to buy a number of loot boxes with the in-game currency and dont feel they impact the game substantially. Its nowhere near the level of something like Halo 5: Guardians or the recently released Destiny 2 as nothing meaningful is locked behind these crates. You can obtain cars, costumes for your character and boosters (mods) to obtain additional Credits and experience from races if you fulfil certain feats. The cars can be purchased without having to go through this process, although they are locked behind the said collection meter. The character accessories on the other hand are much harder to come by, but considering you will rarely see your avatar, mainly quickly at the start of each race, its not like youll be able to show it off too much. Finally, mods are the biggest issue some may have with these loot boxes as they allow for additional credits and experience to be gained. Its a concern, no doubt, but so far they have done little to dampen our enjoyment of the game. Closing Comments:Once again, Turn 10 Studios proves that theyre at the top of the heap when it comes to creating impeccable racing mechanics. Car porn is a term thrown around a lot by racing game fans and Forza Motorsport 7 is just that. Its beautiful, a pleasure to the ears, mechanically sound and just incredibly fun to play. Variety is a huge component to what makes this such an appealing and sought after series and nothing was skimped this time around. With around 700 cars to collect, 32 tracks with multiple variations of each, a diverse set of tuning and customizations and dynamic weather effects, there is enough content here to last a long time. Also, playing online will always be a highly-engaging and especially entertaining activity, having seen so many crashes and overly assertive drivers. Sure, the campaign mode wont win over any fans and the implementation of loot boxes can be a concerning trend for the future, but they are small blips on an overly comprehensive racer. For fans of racing games such as this, Forza Motorsport 7 offers more than you can possibly hope for. Its a top-tier racing experience.", "date": "October 2, 2017", "grade": 4.5}