{"name": "DiRT Rally 2.0", "ref": "https://hardcoregamer.com/?post_type=post&p=325224", "text": "Rally racing is a niche market when it comes to motorsports. The driving ability required to succeed in rally racing is high, as the motorsport has a strong heritage of racing. Driving at high speeds on narrow roads with varying weather conditions can be nearly impossible, and the navigator in the passenger seat only provides a tiny bit of support. Rallycross was introduced in recent years to bring this same type of racing to more of a stadium environment. Codemasters is aiming to replicate this driving extreme ability in both of the sports with DiRT Rally 2.0. This is not a casual racing game. What it is, however, is an intense and beautiful representation of both motorsports.Codemasters has had much success with DiRT series and introduced the Rally series two years ago. This series aims at the hardcore racers and DiRT Rally 2.0 continues that tradition wonderfully. The game features both traditional rally racing and features the official FIA Rallycross World Championship. Upon loading the game, there are no tutorials or on-screen guides such as braking lines. All of the assists are turned off by default such as traction control. You will need an understanding of how rally racing works. For the appreciators of automobiles, there are a wide variety of vintage rally racers and modern speedsters. The game currently includes fifty cars that are spread out across different classes. Each car handles differently ranging from old Lancias and a Ford RS 200 to modern Subaru WRXs and Ford Fiestas. The varying degree of speed helps to raise the difficulty as navigating a hill climb in that Ford RS 200 becomes a tall task as the turbo kicks in at 4,000 RPMs. Its such a monster that deserves appreciation.While its important to get an understanding of the courses, the required perfection towards top times will require tweaking of a car setup. Dirt Rally 2.0 includes a new handling model and setting up your car properly will allow for the most gains in posting quicker times. While you may have extremely fast revving rallycross cars that may not require as much attention, taking the true rally cars across an entire stage will require attention to detail. This also involves race strategies such as the best tyres to match the time of day and conditions. The attention to detail is fantastic and not overly complicated, but you will still need to know what to change with the car and each one is different. The content may seem fairly limited on the initial startup, but it digs deeper beyond the surface. From the start, youre part of a race team with the ability to upgrade engineers and team members to help out with certain facets of your car. Cars can also be individually upgraded, but the focus is on bettering the parts that are on the car for durability and not necessarily adding horsepower or better parts. Players can choose from an historic car championship or an official FIA Rallycross championship and can bounce between different events. There are continual daily, weekly and monthly challenges that include championships to keep things consistent and fresh. Purchasing cars can be a bit of a grind until you start bringing in some real money, but thankfully the Time Trial mode allows all cars to be driven to get a taste of everything. Codemasters does have post-launch DLC content with more cars and races already planned, but that will come with the Deluxe Edition.The lighting in Dirt Rally 2.0 is beautiful and the environment in motion blends some gorgeous backdrops that may cause you to lose focus on driving. The lighting helps with the reflection on the cars. Dirt and mud will also collect on the cars and the physical damage is just as detailed as you would expect from a Codemasters title. The terrain, especially in the wet with standing puddles, combines for a realistic and immersive feel. The car interior while racing from the cockpit is also extremely detailed and the game runs at a smooth and stable frame rate. Whats even more impressive are the post-race replays, but at times this reveals some of the eye sores as certain camera shots show weak details on draw distance and some low-resolution environment items. Some of these shots mixed with the in-game soundtrack are truly an example of beautiful tranquility. I played a majority of this review with a Logitech G29 steering wheel setup along with the manual stick shift that Logitech offers. Unlike most racing games where the cars feature paddle shifters, every single car in this game uses a stick shift along with a clutch. The clutch works wonderfully in the game and shifting is extremely satisfying. Once you get your launch down, it becomes a game of knowing your shift points and using the paddle shifters hurts the immersion. I havent had a better experience with getting the maximum usage out of my wheel setup than with playing Dirt Rally 2.0. Granted, the default wheel settings for vibration needed a bit of tuning, but the options are there to cater to any driving style.While the wheel is the way to go, playing with a controller can be just as challenging. You will find yourself feathering the throttle much more and maintaining speed and balance. Turning around corners feels smooth, but based on how much speed and momentum you have, it could easily create oversteer especially in more powerful cars. Playing with the wheel feels like youre more in control of the car, but both ways of input require a bit of practice. The sound of the engines roar across the beautiful backdrops as Codemasters has always done a fantastic job at replicating engine sounds in the game. Each car sounds different and using a headset really puts you in the drivers seat. The navigators voice comes across as calm and concise and he isnt muted by the sound of the engine. The ambient soundtrack is akin to a golf game as it helps produce a calming atmosphere when navigating through the menus.There are a few gripes I have with the game outside of some of the visual issues on replays. While the game features the FIA Rallycross World Championship and its eight tracks, the traditional rally is just based on real-world locations. So if youre looking for the official Pikes Peak courses, theyre not here. On top of that, there is just one actual hill climb that is situated in Argentina. It seems the Monte Carlo Rally is being added soon, but that is part of the Season One DLC. While weather plays an important factor, the game currently lacks snow but it looks to be incorporated once the Season One DLC starts coming out. DLC seems to be spread out over time between new races and car releases, but youll have to pay for it. Closing Comments:Dirt Rally 2.0 may just be the most complete racing experience of this generation. The physics and handling model will be a treat for hardcore racing fans, even if it pushes away casual racers. The improved lighting engine brings an utterly realistic and beautiful dynamic to gameplay as the cars look fantastic inside and out. Replays are truly a marvel despite some visual issues hurting the immersion. Yes, there are some things behind a seasonal DLC paywall, but that doesnt affect what is being offered at launch. Dirt Rally 2.0 feels like the true racing game to test everyones driving ability.", "date": "February 19, 2019", "grade": 4.5}