{"name": "Vane", "ref": "https://hardcoregamer.com/?post_type=post&p=323507", "text": "Video games are art; for so long has this debate circulated, with which both sides have often considered their beliefs to be the right one with us no nearer to the truth. Its an interesting debate to be had and those who side with the notion that video games are indeed art often reason that games have evolved beyond the simple confines of their mechanical processes  of being more than a jumble of 1s and 0s. That they, as objective entertainment products with some form of player input, can illicit on top of this a degree of subjective reaction, emotionally or otherwise. But herein lies the crux to many an oppositions own arguments  those who argue that video games are not art (myself included). You can of course add to a games mechanical foundation or even embolden a players engaging with the processes on show, but in no way should they replace, dare we say damage, the importance of a game being, when it all comes down to it, a physically-interactive medium by default.Listing off the numerous likely inspirations behind Friend & Foes Vane can seem indistinguishable from highlighting those unknowingly responsible for the resurgence in this decades-old argument. Theres the isolating sense of scale akin to Team Icos portfolio; the broad, sweeping vistas of Thatgamecompanys breakout hit Journey; even the unsettling undertone of Playdeads work springs up from time to time. Friend & Foes inspiration is as visible as the clear obscurity that comes to define Vanes brief four-to-five hour run-time. Obscurity, by definition, isnt a bad thing, providing what youre willing to offer up convinces its players to trudge on, no matter the intensity or how on-the-nose your intended themes may end up. Players, fortunately, neednt worry about the intended message or ideas here as the game is predominantly absent of any and all sense of story/plot/narrative  intentionally left for one to deduce or theorize in the end, let alone work out as one progresses. In theory, this approach is serviceable, if not wholly unique in an age of dime-a-dozen explorative adventure/puzzle games.Unfortunately, outside of a few glimpses of intrigue and moments that one hopes the studio would build upon, either through gameplay or presentation, Vanes only consistent streak is its horrid technical incompetency and worse, the feeling  even after a solitary sitting that is its total run-time  Vane is less interested in nailing the basics and proceeding from there. That, to bring in the earlier point, the relevancy of its gameplay and its all-round execution has not only fallen by the wayside, but has been gauged out completely in favor of something moreresonant? Its a shame then that Vane falters so easily  and willingly  at the first hurdle, because its opening pivots in such a peculiar but interesting fashion, the early promise feels more like a set-up to greater disappointment soon to follow. Once the introductory scene of violent winds tearing an environment seemingly to shreds fades off  in which the player-character, a lone child cradling some manner of a spherical object, attempts and fails to find shelter from the storm  the game then places you in the role of a crow, freely navigating the baron wastelands that act as the first major environment. Again, in theory, Vanes loosening of restrictions, not to mention the lack of clear signposting and informing the player what to do and where to go, should prove fitting for a setting of this tone. And for the first few moments, the liberty with which one has in freely exploring the emptiness around you warrants approval. Sadly, only a minute or so into ones flight and you find but the first unfortunate reveal of the games clear lack of foresight in the technical department and overall sense of reaching for the wider picture, rather than narrowing in on the many risks this style of presentation can bring.For one, the camera never really keeps to a consistent pattern for long  constantly wavering between withdrawn panoramic to zooming so tight onto your position, it can clip straight through parts of the bird itself. It doesnt help matters that the controls for flying in general are tedious at best and horrendously sensitive at worst. The most frustrating moments coming when one is attempting just to land  whether it be on the desert grounds or part of some not-so-elaborate puzzle  whereupon your feathered friend will either plant face-first, miss landing on a perch despite best efforts to slow down and carefully position ones self, or the game will meander between pre-assigned animations. Wrestling control away from the player in doing so. Flight, in the end, becomes not only a chore, but an underlining nuisance when all one wants to do is finish a puzzle so as to proceed onwards to the next component. Even then, Vanes attempts to excite, either with its puzzles further on or simply the deprived, washed-out aesthetic that is its world-building, not only fall flat, but show up the games true status as a product so utterly deprived of ideas or means to elaborate on whats already been established. Its only later on when the game introduces the concept of shifting back and forth between bird and child form to solve a litter of sparse puzzles in an undeservedly vast but empty interior  a golden pool of polygons the only means with which one can shift between forms  does Vanes eager pretensions come to the forefront. For a game that wants to bask in its desaturated color palette, its lifeless suggestions to past lore with its many broken shells and bird-cages alike, or its cinematically letterbox-aided delivery  all of which dont let up and surround you the entire length of ones playthrough  the same amount of attention unfortunately cant be said for its technical foundation, both in performance and while interacting with the environments on show.In a year that many may well consider to be the closing chapter of the PS4s life-cycle and of the eighth-generation in general, its inexcusable to find a game in 2019 struggling so frequently to maintain even 30FPS  its frequent issues with clipping, characters glitching between points and even struggling to climb over knee-high obstructions, not only an eye-sore but one that, even more bafflingly, seem almost intentionally placed. If the uninspiring level design immediately makes one begrudge the deliberately vast and long stretches of environment to run through, Vane has the audacity to make even the simple concept of moving about this world an annoyance to begin with. And if the fact one cant alter the speed/rate at which the camera rotates around you doesnt irritate, then its the almost drunken, stiff and sluggish feel to your [child] characters very movement. All the while your involvement remains limited to simply pushing forward on the analog stick, shackled down by the dictatorial slowing down of pace. The only moment wherein Vane breaks out from this fog of self-gratifying importance comes in the form of a refreshingly tactical streak of puzzle-solving requiring you to carefully roll a large sphere through a world that seems to almost react, even rebuild itself, upon your presence. The way the game even incorporates a kind of stop-motion flicker when buildings and bridges reform and collapse once more is genuinely one of, maybe the only, enticing moments to be had. Granted, movement can still feel cumbersome at points given youre heavily reliant on three other child figures to roll the sphere about the environment. Yet this stand-alone  albeit a tad too prolonged  segment is perhaps where Vane utilizes this combination of low-poly visuals, a washed-out, monochromatic palette and a vaguely-implied theme of emptiness, to genuinely great effect.Its a shame then that these moments of eager involvement, with a presentation that doesnt indulge in its own semantics too much, are not only rare, but are so easily dismissed for more of the same deliberately-sluggish pacing and progression that, in all its grand illusion to great puzzle design, ends up being frustration just to navigate through let alone figure out. Late on, a puzzle that tasks you with revealing what feels like a labyrinthine of broken stairways and obstructions alike, becomes far more tedious than it has any right to be. Objects emerging and disappearing at unpredictable moments, your player-character getting stuck between the ever-changing environment. Little of what the game attempts to offer so far as challenge feels aptly built or rigorously tested for that matter  a theme that runs rampant across a large chunk of the game and one, more alarmingly, intentionally-placed.Closing Comments:Its clear what sort of tone or manner of presentation Vane is going for despite its short run-time and undeniable vacancy of explanation. But as easy it would be to lay the blame squarely at the feet of the games obscurity or its absolute refusal to explain all but the tiniest of ideas as to its intended narrative, the reality is that Vane is an utter chore to play through. A game that offers little by way of technical competency or some inherent intrigue with the world its trying to portray that it almost seems slapped together in a hurry. But the greatest insult the game so audaciously throws without but a shred of concern for its effect is in how oblivious it is in getting the fundamentals right. A control scheme that is in one part frustrating to handle, and in another far too disengaging and sluggish for its own good, with an artistic direction and aesthetic executed far better in other releases. Were only a month in and while we may already have some notable highlights, even to those heavily invested in this branch of explorative puzzle games, Vane feels like the first dull low of 2019.", "date": "January 28, 2019", "grade": 1.5}