{"name": "God of War Ragnark", "ref": "https://hardcoregamer.com/?post_type=post&p=429522", "text": "God of War put Santa Monica Studio on the map. Since Kratos and his signature Blades of Chaos sauntered onto the PS2 in gory detail, the God of War franchise has been a PlayStation mainstay. Each subsequent entry aimed for bigger and bolder, culminating in the Greek worlds mass destruction in God of War III. How do you top that? 2013s God of War: Ascension proved you couldnt go back and find the same acclaim. So in 2018, PlayStation and Santa Monica Studio went bold with God of War (2018), a sequel that retooled the classic combat, moved the setting to Norse mythology and turned the violent Kratos into a mature father. The game was excellent, laying a foundation built upon a more nuanced Kratos trying to adapt to a new world, all while keeping his new son safe and honoring his deceased wifes wishes. God of War (2018) was a triumphant return of the franchise, and with that foundation laid, Santa Monica Studio is building upon it with God of War Ragnark. With a bigger, bolder story, refined gameplay, and more realms to traverse, is God of War Ragnark an excellent follow-up or should this adventure be sent to Hel to freeze for eternity?God of War Ragnark picks up three years after God of War (2018). Fimbulwinters grasp on the nine realms is ending, meaning the prophesized start to Ragnark is around the corner. Attempting to escape fate and avoid war, Kratos and Atreus embark on a journey across the realms to uncover long-buried secrets. The attempt to prevent war brings them into direct conflict with opposing forces, however, including Freya, Thor, and the King of Asgard himself, Odin.God of War (2018) brilliantly set the stage with its focused story. As an introduction to a new world, the game perfectly rebuilt Kratos as a changed, mature man looking to escape his violent past. That story centered around him and how his past, present and future actions affect the various characters. Though the cast was small, each character was perfectly utilized, serving as a foil to Kratos and forcing him to confront his past and learn from his mistakes. God of War Ragnark ratchets up the stakes with an equal focus on Kratos and Atreus this time.God of War Ragnark is a bolder, more expansive story that never loses key character moments. Now raising a teenage son and with knowledge about his fate, Kratos constantly pushes Atreus, thus coming off as an overly-concerned parent unwilling to listen to his child. Meanwhile, the teenage Atreus is hungry and determined to uncover the mysteries behind Loki. This dynamic sets up much of the storys drama, though the presence of characters like Freya, Thor and Odin, among others throws their personalities into the drama. Thor and Odin are handled exceptionally well, with each having distinct personalities that serve as excellent foils to both Kratos and Atreus.While the character moments and individual stories excel, so does the overarching story. The pacing is near pitch-perfect, doling out narrative, revelations, character moments and satisfying plot twists at the right moments. The storys twenty-hour runtime feels about right, with only two sections dragging down the momentum. It all culminates in a satisfying ending that feels like the natural culmination of the main narrative and character arcs. God of War Ragnarks world and design will feel familiar to anyone that played its predecessor. As Kratos, players traverse various realms to advance the story, participate in side quests or explore. Like God of War (2018), Ragnark can be as linear or as open as you want. Just here for the story? You can b-line through the plot in twenty hours without participating in a single side activity. Want to get lost in every realm? Theres up to double the amount of playtime for that.Where Ragnark vastly improves upon its predecessor is in its variety. You get access to all nine realms this time, most of which are a real treat. Of those, five feature large open spaces ripe for exploration and side activities. While none of them match the sheer size of Midgard in God of War (2018), each of these realms is unique and distinct from one another. Thats not to say all realms are created equal. Two are mainly used at specific plot moments. Muspelheim has narrative relevance this time, but remains mostly there for combat challenges. Finally, poor Niflheim is a shell of its former self and is mostly a throwaway world. While its understandable that not every realm can be given the same level of space and bounty of sidequests, it remains disappointing to see the state of some of them within this game.What is within the main realms is excellent level design, though some of it shows its age. The Blades of Chaos are available at the outset, providing different ways to traverse the environment. Be prepared to grapple, swing and rappel plenty throughout as its a more vertical experience with far more interesting ground to cover than the primarily flat areas of the previous title. That sense of verticality extends to the combat arenas, which feature different levels at which to engage the enemy. The verticality is a welcome addition that spices up both exploration and combat in fun new ways. Unfortunately, the worlds design is held back by cross-gen technology. Be prepared to slip through cracks, crouch low through crevices and open plenty of doors so the PS4 version can load the next area.God of War Ragnark further builds on its predecessor in the gameplay department. The fundamentals of that game persist, with Kratos able to chain light and heavy attacks into combos, dodge, block and parry incoming attacks, and cast magic via Runic Attacks. In a massive change from God of War (2018), Kratos kicks off the game with the Blades of Chaos, offering two different weapons from the get-go, and, like the previous game, they and the Leviathan Axe are delightfully fun to swing around. With a new set of upgrades, various new techniques are available to keep both weapons fun and interesting to play around with throughout the games length. Of course, thats not to say that Ragnark doesnt add any new wrinkles to the combat. The game is full of surprises that help spice up the gameplay, including unique gameplay segments that completely change how its played. Perhaps none is greater than the vast increase in enemy variety. God of War (2018) tended to throw the same types of enemies at the player constantly, but God of War Ragnark vastly changes that with a wide variety of new humanoid and creature enemies throughout the story that requires different tactics. There are also plenty more high-quality boss fights than the previous title, and each is fun to tackle.Leveling and gear return, though far less prominent this time. Kratos levels up by upgrading his weapons, equipping new shields and armor pieces, and upgrading those pieces. Most of this is done by scavenging the world for materials used for crafting and upgrading. Thankfully, the game doesnt make leveling Kratos a requirement to complete the story, as each main mission doles out a healthy amount of materials and items to keep pace with the plot. While its possible to over-level, the careful pacing ensures youre never truly under-leveled. Those that want to focus on story can, but those who want to dig in and configure their Kratos to best tackle combat in any scenario are in for a treat.If theres a weak link to the gameplay, its Atreus and his new mystical arrows. While his previous options opened new exploration options and were handy in combat, his Ragnark arrows feel underpowered, finicky and underutilized within the world. This is most felt with the Sigil Arrows, which are commonly used to complete open pathways and complete Chest puzzles. Its surprisingly tough to tell when they overlap and even tougher to judge if youre close enough to set them on fire. Thank goodness the companion AI is strong because the arrows companions come packing are not as fun or helpful to use as the Light or Electric arrows from God of War (2018).God of War is well known for pushing hardware to its limits. First, God of War and God of War II made the PS2 sweat. Then, Chains of Olympus and Ghost of Sparta changed the perception of how good handheld graphics could look. Next, both God of War III and Ascension utilized the PS3s unique architecture to pull off some of the biggest setpieces in the franchise. Finally, the power of the PS4 and PS4 Pro made God of War (2018) one of the best-looking games of the previous generation. God of War Ragnark continues that trend, but minimally.God of War Ragnark is a gorgeous game, delivering detailed worlds, intricate character models (especially Kratos), realistic hair, fur rendering and weather effects. What helps push Ragnarks presentation is the attention to detail in character modeling and animation. For example, youll quickly notice how the wrinkles in the face contract and how the lips tremble during emotional moments. Its impressive details like that that help push the graphical fidelity above its predecessor despite the technology still being stuck in cross-gen territory. Its not the best-looking game on PS5, but it is head-and-shoulders above the competition on PS4 and still stands as a beautiful, gorgeous title.Further elevating the presentation is the excellent cast. Christopher Judges layered take on Kratos remains a key highlight, and Sunny Suljics take on a teenage Atreus is annoying (in a perfect teenage way) and endearing. Meanwhile, Ryan Hurst delivers a surprisingly nuanced take on Thor thats both surprising, tragic and terrifying simultaneously. Honestly, its a wonderful cast turning in some truly excellent performances. Of course, its all backed up by another magnificent soundtrack from Bear McCreary, who continues to find that perfect balance between the epic yet brutal sounds of the Greek games and the Nordic elements of these new titles.Closing Comments:God of War Ragnark is to God of War (2018) as God of War II was to God of War. God of War II may not have changed much mechanically, but it made nuanced improvements to gameplay, story and level design, all while injecting much-needed variety into the enemies and environments. These improvements yielded a fantastic sequel that remains one of the best entries in the franchise. Likewise, God of War Ragnark successfully takes the foundation of God of War (2018) and makes various refinements to improve the experience. The story is bigger, bolder and filled with engrossing twists and narrative moments, yet never forgets its characters and their personal stories. Visiting the nine realms is fantastic, though the quality of each varies greatly. Combat is as rich, deep and satisfying as before, with a handful of new twists that add variety to the mechanics. The only real downside is the unsatisfying companion actions and the poor Sigil Arrows, though the AI remains faithfully competent. Its all packaged together in a beautiful presentation, that despite being saddled with cross-gen technology, still remains one of the best-looking games of the generation. God of War Ragnark doesnt change the game, but it successfully builds on its predecessors foundations to deliver a compelling, layered and engaging title thats as fun to play as it is to look at. This is one war that Kratos and players wont want to prevent.", "date": "November 3, 2022", "grade": 4.5}