{"name": "The Walking Dead: The Final Season  Broken Toys", "ref": "https://hardcoregamer.com/?post_type=post&p=322624", "text": "One of last years most heartbreaking piece of gaming news was the unexpected and untimely closure of Telltale Games, which led to the cancellation of multiple upcoming projects and the abrupt mid-season halt of the final season of their Walking Dead adaptation. For nearly two months, fans were left wondering if Clementines adventure would see a proper conclusion, when Skybound revealed the relieving news that they would be developing the second half of The Walking Deads fourth season, while bringing back many of the key members of the original development team to help see their vision to the end. While the first half of the final season has not been particularly strong, the opportunity to allow both the players and the developers to see this journey through to its possibly bitter end is one that doesnt happen often in this industry, making that an accomplishment all by itself. Nonetheless, Broken Toys continues this seasons inability to find a gripping narrative direction, as several memorable sequences are bogged down by an uninteresting ensemble cast and a drop in technical quality.While the remainder of the review will not address any spoilers for Broken Toys, important plot points from the previous episodes of the season will be discussed below. For more on the season so far, check out the reviews for Done Running and Suffer the Children.Despite the new developer, Skybound has made it simple for players to pick up where they left off four months back with a brief but necessary refresher on the cast and their current whereabouts. With several characters having been abducted by Lily, Clementine, AJ and the remaining children must strategize and prepare for their dangerous attempt to rescue them. The plot rushes along from one location to the next, with some sequences feeling less justified than others as the fourth season cast continues to underwhelm and ignore opportunities for interesting character development. Save for one memorable first-person sequence and the action-packed conclusion, the highlights of this episode most frequently came between Clementine and AJ, as the latter continues to grow and mature in a world that hides its bright spots underneath a thick layer of darkness. Broken Toys still plays to a large degree how a Telltale episode normally does, with QTE-based combat sequences being interspersed between lengthy dialogue bouts and minor instances of open exploration. There are some minor refinements to these mechanics, including an intriguing moral element within the combat and a bit more linearity to the exploration, but all in all Skybound did a solid job of recreating the mechanics that so regularly define a Telltale production.Unfortunately, while Broken Toys looks similar to the first half of the season, the animations for most characters are noticeably more rigid, particularly the mouths which can prove distracting during extended dialogue sequences. On the positive side, the top-tier voice cast has returned for the second half, with Melissa Hutchinson and Taylor Parks continuing to do noteworthy work as the voices of Clementine and AJ respectively. Closing Comments:As the final season of The Walking Dead is brought back to life by Skybound, the narrative plot continues to shamble aimlessly like the zombies that inhabit its world. A few emotional chats between Clementine and AJ and a finale-prepping conclusion makes the journey worth continuing, but Skybound will need to go above and beyond to provide Clementine the send off she deserves and make the fourth and final season one worth playing.", "date": "on January 19, 2019", "grade": 3.5}