{"name": "YIIK: A Post-Modern RPG", "ref": "https://hardcoregamer.com/?post_type=post&p=322262", "text": "When one thinks about retro games and retro-styled games, usually its going to be about genres and appearances related to 8-bit and 16-bit titles, the days of 2D platformers and detailed sprites. But as the definition of retro expands with each passing year, we find ourselves wondering how to handle nostalgia for the fifth generation of video games. It was an awkward era, with the polygonal ceiling proving tough to break through for many. And in trying to recreate it, we find that for every success like Dusk, theres a flop like Vaccine as well. Recreating the best parts of the era is a tough nut to crack, but damned if Ackk Studios isnt going to try. Their new title YIIK: A Post-Modern RPG not only embraces this era of gaming, but sets itself at the very end of the generation in 1999. Can it succeed in doing the fifth console generation justice while being a good game in its own right?YIIK essentially kicks off with our protagonist, Alex, having arrived home in the Summer of 1999 after finally graduating college. Everything seems normal in his hometown of Frankton, up until fate leads him chasing a cat into an abandoned factory. From there, he meets a mysterious girl named Semi Pak, who soon gets abducted by bizarre cosmic beings. This leads to an online message board named ONISM 1999 that tracks supernatural phenomena, a string of missing people all of a sudden, a bizarre realm between worlds known as the Soul Space and the potential destruction of the world. With the end taking place on New Years Eve as Y2K is set to hit, of course. Immediately, YIIK grabs you with a bizarre, fascinating tale and never lets go. It kind of goes with saying that the plot is the strongest point, as it channels the likes of quirky RPGs such as Earthbound. Its tricky to describe the whole story without spoilers, but the developers clearly put a ton of work into crafting an elaborate mythos for the universe. Themes of parallel worlds, transcendence, cosmic horror, loss of loved ones and destiny are all abundant, providing several twists around every corner in a strikingly clever setup. Its gripping stuff, plain and simple.Speaking of Earthbound, it also helps that YIIK masters the art of balancing its more serious aspects with a hefty dose of humor. Be it the blend of insane ramblings on early online message boards, people desperately trying (and failing) to start up a zine or even just kids excited to meet this new Jar Jar Binks fellow at the cinema thats going to be all the rage, theres a lot on display here to get a chuckle out of you. But thats not even getting into the more surreal stuff, such as enemies that are walking stop signs, sheep men and wind-up Mega Man knock-offs. Actually, the more surreal visuals and areas in general provide a ton of the charm, though it might be best to not give away some of the more bizarre sights.Stuck in with all of this insanity, though, are our main characters. And thankfully, they are also a highly-enjoyable cast as well. Along his journey, Alex will meet his old childhood friend Michael who now dabbles in photography, pacifist protestor Rory, enthusiastic anime nut Claudio, snarky musician Vella and hula hoop maestro Chondra. Again, the balance between the serious and silly is perfectly walked with this lot, giving them a ton of well-written dialogue. Its easily to relate to them, even as they battle bizarre beings beyond comprehension. Be it Alexs worries over his lack of drive, Michael feeling unprepared for the future or Rory still grieving over the loss of his sister, theres a lot to connect to. And just a lot to enjoy. Largely with Claudio, who quickly became a personal favorite due to his enthusiasm.It helps that these characters, their world and their stories are accompanied by amazing aesthetics as well. The blocky, polygonal, low-tech look is hard to pull off, but YIIK succeeds with it. It perfectly captures the cheesiness of games from the fifth generation while also keeping things colorful and attractive. The real standout here, though, is the soundtrack. Effortlessly switching between the like of peppy 8-bit JRPG tunes, creepy ambient noises and full-on vocal tracks at times, this is music that will linger in your head for a while after the game ends. Having the likes of Toby Fox and Hiroki Kikuta helps as well, making amazing contributions to the tunes. But getting back to the world as well, exploration is your standard RPG fare. Traverse the overworld, walk around towns, shop, talk with NPCs, get into monster battles, et cetera. Nothing groundbreaking, but it doesnt need to be, as its still highly effective as is. What makes things more interesting are the dungeons, intricately laid out with various hazards and puzzles, and visible enemies. Getting around them requires utilizing various items gained such as a cat that can activate long-distance switches, an amp that can blow away rocks, a skateboard that crosses ramps and more. Again, nothing revolutionary, but still fun and easy to pull off, allowing you to discover a good chunk of secrets. Heck, the cat even allows you to stun enemies or inspect chests for mimics, which can be a lifesaver.Aside from having a set of tools to assist in solving various obstacles, YIIK does have one unique trick with the Mind Dungeon. Instead of leveling up instantly, you spend experience points in the Mind Dungeon, Alexs own personal mental space accessed via phone. Here, you go down floor by floor, choosing which stats to boost based on the various doors presented. The catch is that Vella actually has a skill that allows her to banish monsters to a random floor in the Mind Dungeon. Meaning you have the option of making battles easier, but creating a chance for the foes to bite back later. It does feel at times like a few menus could cover leveling instead, but its a clever concept and allows for a few cutscenes that delve deeper into Alexs mind.You may have noticed that Mind Dungeon aside, we havent delved much into YIIKs combat so far, though. Thats becausewell, are any of you familiar with the Enjoy the Story, Skip the Game trope? Dont be surprised if YIIK ends up getting slapped with that label. The actual RPG combat is decent overall, but stands to become the most polarizing feature. Basically, it takes a cue from titles such as Paper Mario: The Thousand-Year Door and has little timing-based mini-games to determine the damage dealt. Hitting the correct areas on a spinning record, playing a small shoot-em-up, repeatedly snapping pictures of enemies, et cetera. It applies to regular moves and some special moves, and its a fun concept.In most of those other games, however, getting the timing perfect usually rewards bonus damage on top of regular damage. YIIK, sadly, does not. So its entirely possible to make a mistake and whiff an entire attack, dealing no damage. And while the variety of these mini-games is to be applauded, theres bit of inconsistency concerning who gets what attacks. Vella and Claudios attacks, for example, only require you to hold down a button for a certain amount of time. But Alex and Chondra have basic attacks that require rhythm games with at least ten successful button presses to deal any significant damage. Heck, Chondras attack is designed so that missing the final prompt screws up the entire attack. Now, these attacks become less of an issue as the game progresses, largely because you have more time to get used to it and get the rhythm down correctly. But still, the lack of tutorials beforehand means likely botching a kill and wasting PP on a first attempt. Or a third one, or a fourth one. It basically takes at least a short while to get used to the need for perfect timing. To assist, the game does provide an amount of Time Energy, where holding down a button switches things to slow motion. But its a way to easy to drain that meter quickly (unless you know exactly when to trigger it to conserve things, meaning you basically need perfect timing to make up for the lack of perfect timing) and the only way to refill it is by taking damage from enemies.Speaking of damage from enemies, a similar system is used for defense, where you have to press a button at the right time. But again, with energy draining quickly, expect a few cheap hits. Especially from those who force you to hit a button in three different areas, which feels nigh-on impossible to do without energy. There is an option to make energy unlimited, but there doesnt feel like a balance in between too hard and too easy concerning that area. In fact, that kind of sums up the flaw with YIIKs combat in a nutshell: Imbalance. Certain attacks on both sides feel more powerful/useful than others, so several skills never get used.And I hate having to spend four whole paragraphs on something like that, because despite those complaints, the combat in YIIK is still fun for the most part (one nice touch to squeeze in: like Undertale, it uses a finite amount of enemies, avoiding repetition). It could just stand from some fine-tuning. But Im not certain if fine-tuning can fix the games other notable flaw, the finale. Its not bad story-wise, pulling out a few clever stops and twists, but its awkwardly structured. Without spoiling anything, after one particularly trippy dungeon with a lot of challenging puzzles and monsters, you get what comes across as a standard point of no return warning that you need to agree to. You accept, go in and defeat a lengthy boss. So things are wrapping up now, right? No, instead the game tells you that you have to prepare for a bigger threat. And this means suddenly having to train over a whole in-game month. Each day, you pick one of three options, including having to head into town to grab gear, fight monsters and complete side quests. About ten new side quests that suddenly get introduced, in fact. And you can only do one each day, for no explained reason. But after one month of menus, leveling up and in-game dialogue, youre prepared for the final enemies, andits pretty anti-climactic. Theres only about six enemies overall, two of which you have to lose to, and the other four are pushovers.Mind you, that could be because I was several levels above what was needed, but I just dont get why this particular daily action gimmick was needed. The characters need to be prepared for the final battles, yes. But what RPG player these days doesnt know the importance and sidequests and battles for occasional experience? Why not just give us the sidequests beforehand over time, with some near the end, then yet players train at their own pace before choosing to advance? It feels like a bit of pointless gimmickry and padding, which is particularly odd for a game that lasts at least a good twenty hours.In the end, the combat still manages to be fairly enjoyable and the month-long training doesnt impede things too much, though. But considering the flaws they have, its not hard to feel at times like YIIK would have been better as a more straight RPG with an emphasis on its unique story and world as a selling point. Because despite how long Ive rambled on about them, its strengths still overpower its weaknesses. Just be prepared for a bit of frustration at times. Closing Comments:Despite a few wonky issues with combat at times, YIIK: A Post-Modern RPG more than succeeds in delivering a fascinating and unique tale that isnt afraid to get bizarre and humorous while still making you sympathize with its cast and keeping you on the edge of your seat. Between the quirky visuals, stellar soundtrack and fun gameplay, Ackk Studios managed to polish the gameplay of late 90s polygonal games while not losing sight of what made RPGs from that era fun. Its an odd trip that may confuse some at first, but is worth taking a dive into.", "date": "January 16, 2019", "grade": 4.0}