{"name": "Travis Strikes Again: No More Heroes", "ref": "https://hardcoregamer.com/?post_type=post&p=322211", "text": "Some guys can just never get a break. Roughly seven years after the events of No More Heroes II, Travis Touchdown has chosen to spend more time relaxing and less time killing people for profit. Climbing the ranks of the United Assassins Alliance doesnt have the same allure as it once did, as he now wastes away his days in a secluded trailer playing video games. It seems like Travis is living the good life, but in his wilder and younger days one of the people whos life he cut short was someone named Bad Girl. Her father Badman tracks down Travis, the two end up fighting and subsequently get sucked into Traviss ultra rare and likely less-than-legal Death Drive MK-II video game console.Travis Strikes Again: No More Heroes is the strange tale of how Travis Touchdown and Badman end up fighting through the worlds of several different video games. Being sucked into a video game world is probably every kids fantasy, but the reality is these worlds that bring us joy would be filled with terror and violence were we to actually experience them. Luckily Travis and Badman ignored their high school guidance counselors advice and followed their hearts to pursue careers in the assassination field, making these extremely-violent environments feel like a Heroes Paradise. This is not necessarily a sequel to the previous No More Heroes titles, but more of the beginning of a new chapter in the life of Travis Touchdown.As Travis and Badman are both transported into the games of Death Drive MK-II console, we get to explore the titles that are available for this demonic console. Each level offers some variation to the gameplay as the player tries to guide Travis (or Badman if they feel so inclined) to completing the game from the inside, though most of the action is similar to the beat em brawling in Traviss previous adventures except often presented from an overhead view. Each of the games that Travis enters has its own unique feel and identity while maintaining a level of cohesion within the context of the actual game. All the game worlds are populated with the some of the same NPC characters that offer Grandpas words of wisdom or new delicious ramen dishes along with enemies that have clever bug pun names like Bugstreet Boys, Bugue Bugue Sputnik or Zuckerbug. The gameplay action remains consistent at its core, though some examples of variations include running from a giant blue head in a reverse Pac-Man scenario while attacking cards to rearrange the labyrinthine neighborhood roads or speeding through a TRON-inspired VR race.The heart of the gameplay in Travis Strikes Again is a fast paced beat em up. As Travis explores each game world he will encounter many of the hostile buggy denizens and use a variety of skills and special attacks to thwart them, which this repertoire can be increased by collecting skill chips scattered throughout the game. Travis and Badman level up independently from each other so distribution of experience can be determined by the player.The levels are satisfyingly long with enough environmental variety and game-specific puzzles to offset the repetitive and sometimes grindy nature of the garden variety enemies. The boss characters are one of the highlights of Traviss game library. The dialogue between Travis and his adversary is nothing new since many games and movies have had scenes of a discussion of mutual respect before the battle type of scenario, but these are done in the context of Travis enjoying playing these games when he was young and now gets to slay his digital nemesis in a much more real way, or perhaps wondering why someone wants to fight him after bringing him so many doughnuts and coffee. The boss battles feature multiple phases and require more strategy than the rest of the cannon fodder, which serve as grand conclusions to each game world.Sauda51s games tend to be wonderfully bizarre and Travis Strikes Again does not disappoint in this area. The storytelling brings each level to life where one can see each of these original titles existing as its own game. After beating games Travis can use his motorcycle to get a glimpse into his story up to point, which isnt afraid to reference storytelling approaches that resemble a visual novel being run on an old fashioned DOS based PC. In a lot of ways Travis Strikes Again is a love letter to classic arcade and indie games. The gameplay itself has an old school arcade feel to it and one of the collectible items are T-shirts Travis can wear that feature popular indie games like Hollow Knight, Mother Russia Bleeds and Undertale. There may be a mention of something called the 25th Ward at some point too. Travis Strikes Again supports local co-op play with a single Joy-Con where one player can control Travis and another controlling Badman, which can make the journey through the Death Drive MK-II more enjoyable. For the most part the controls are responsive, though there are times when using the two thumbsticks to recharge Traviss weapon in the heat of battle doesnt always work as well as one would hope.The graphics of Travis Strikes Again are in the familiar style fans of the franchise will recognize. The standard enemy designs could have benefited from more variety, but that also plays into the running joke of palette swapped generic sheep men. Each game world has a different style that helps create the sense of actually being in these made up games and the action never gets too crazy where its hard to figure out where Travis is amidst the chaos. Closing CommentsTravis Strikes Again: No More Heroes is a welcome return of Travis Touchdown. Amidst the enjoyable gameplay is great storytelling and dialogue set in imaginative game worlds. Fans of previous No More Heroes games and Suda51 games in general will find a lot to enjoy here. Going through the different game worlds watching the story unfold through an old-fashioned computer is highly entertaining and collecting the T-shirts from your favorite indie games gives treasure hunters something to occupy their time. More still, each different game level has enough variety to keep the repetitive combat from getting stale. And who doesnt the like the idea of using a toilet as a save point?", "date": "January 16, 2019", "grade": 4.0}