{"name": "BELOW", "ref": "https://hardcoregamer.com/?post_type=post&p=320832", "text": "If theres one thing Capybara Games should be given credit for coming out of Below countless hours later, its that their five-years-in-the-making survival roguelike may well have reignited the debate on difficulty once more. And by difficulty Im referring not to physical structure or revealing of the challenge itself, but rather the presence of some manner of enticement that a game may provide so as to convince players to keep at it. Many wont deny this is a hard feat to accomplish given how varied and perhaps versatile many different players habits can be during ones playthrough, but it doesnt take long for a games restrictiveness to reveal itself regardless.There are plenty of elements one can (and will) discuss that give BELOW a peculiarly interesting stature given its reliance on gamings two most precarious directions as of late: the roguelike and the survival genre, not to mention the length of time thats passed from initial announcement, indefinite hiatus and finally eventual release. Some elements going that extra mile in reeling you back from a previous state of utter dismay and disgruntled dissatisfaction. Its this very moreish conviction in a players mind where BELOW is genuinely at its best  doing a terrific job at keeping its players hooked on each one of its procedurally-generated chambers and cavernous interiors alike, always tempting them to sink deeper in all the while always offering a swirl of peril not too far off. But despite some great use of subtlety and faith in a players intuition, BELOW often tends to slip back into the pitfalls of not one but both the genres it takes influence from. Worse, undoing the goodwill it builds for itself with a consensus that the game is primarily fixed on its own visual presentation firstand players second.Naturally, it would be easy and trivial to take this to its extreme conclusion and throw immense shade at Capybara when it comes to BELOWs presentation. That the game is somehow self-indulgent, pretentious even, caring not for its players in the same vain that walking simulators care little for actual mechanical involvement and input. And while the potentially overdrawn introduction  which finds one sweeping frame gradually zoom in on the treacherous seas beneath until one is finally fixed on the boat your player-character is riding en route to the games main setting  can be read as overblown and unnecessary, its clearly a reference to two of BELOWs key features. One, its obviously withdrawn, distant perspective that gives it a unique look  and helps it stand out above all other roguelikes, albeit in a superficially aesthetical sense  but two, the notion that this is a game deciding against any manner of hand-holding or direct instruction. Simply asking of its players for a more trial-and-error approach to problem-solving and discovery alike. BELOW doesnt always convince us this approach is viable or that its justified in its abject silence outside of a couple of introductory button prompts. Though the inability to record/save crafting recipes or simply be told what a crafted food piece will grant may be a short-term annoyance, in the long-run, BELOWs limited inventory space and moreso its insistence on readying to trip the player up  how forcibly such things like the hunger meter are thrust on players given the scarcity of food  further damages the genuinely tense build-up of atmosphere and tone the game garners. Particularly when an instakill spike trap or many a light bead (which serve as the energy for your lantern) tumble into the abyss, can come across as tasking for the pure sake of it  resulting in plentiful early/unforeseen deaths in the first couple of hours and an immediate risk of disconnect for players who might not have the patience or investment in repeated failure. One cant even throw up the argument that this is the same treatment of video game death/permadeath that the Souls games implement; unlike those games, BELOWs emphasis on learning through death feels less like gradually building up a picture of what to do and more a cumbersome allotting of busywork its rather simplistic world design just doesnt warrant.For sure, BELOWs obvious withdrawn perspective gives it a unique look and one that helps its generally unsettled vibe stand out above all other roguelikes and survival entrants alike. But what makes it work effectively, however, is in how it emphasizes the scale of ones trek, similarly to how something like the Xenoblade series illustrates the contrast between the size of its worlds and the characters that inhabit them. BELOW uses a similar approach with the end result instead intensifying the anxiety and uncertainty of exploration in of itself. Floors/chambers  covered in fog, requiring players to actively explore these floors in order to naturally uncover the layout, as much as theyre predominantly shrouded in darkness  become a lot more precarious to tackle, meaning that players must be a little more methodical with not just their very movement, but with the inventory they gradually build overtime through weapons and scavanged items alike. All of which is elevated by brilliant use of sound design (best served using headphones by the way) in even the smallest of details, such as the sound of wind blowing between chambers or the spry audio cues when a hidden item or unlockable door is nearby. The soundtrack too compliments BELOWs grievous atmosphere with a score that shifts from encompassing ambient drones, to dire synth chimes that act without warning, to a fittingly warm acoustic melody that greets players when resting at a campfire. When (and only when) the grating necessity to keep survival stats topped up briefly steps out of the way, BELOWs best moments start to flourish  when these tense decision-making moments during ones travels deep into the bowels of the subterranean interiors are at the forefront.Do you risk your inventory for the sake of the next campfire, serving as helpful checkpoints; do you veer off the main path in search of possibly helpful food/ingredients/materials despite no guarantee theyll be present; do you even go as far as to accept inevitable death and return to the central storage area of sorts for the next explorer to arrive on the island and potentially discover the previous adventurers body  the games explanation for permadeath and having to start all over from the islands shore. When you break it all down, there are a lot of good ideas sprinkled about the games average run-time, even going as far as to warrant some curious meandering at points, without the worry of survival meters gnawing at you every passing second. Its scenery and world-building is admittedly mild for the most part, with only a few brief areas that could be considered potential lore or otherwise narratively-focused, but thats not to say the game is inherently lacking in player desire to learn the true nature of this rain-soaked island. But this is perhaps as far as BELOW is willing to go when it comes to explaining anything taking place. Of the in-game rules that govern the continuous cycle of exploration, combat and inevitable death particularly. While there are plenty of instances where a keen eye or sense of logical deduction best serves the situation  an alternately-colored slab that looks reachable with a fired arrow or two  there are also scenarios and more importantly, crucial mechanics, one cant help but declare an explanation of sorts wouldve proved insightful.Does apparel reset in place after its lost from a previously fallen adventurer? Can you turn more than one campfire into a fast-travel point and if not, why? To reiterate a previous point: why arent crafted recipes detailed so that players know of their qualities and/or potential buffs? Why is water more abundant than food; why do some animals drop food items and some dont  is there some distinct measure of probability or chance the players arent aware of. There are a lot of questions to answer but BELOW sadly answers little of them, constantly offering up sequences and mechanics that if anything, work against the perilous nature of its setting. Closing Comments:After five years of waiting, though there are some frequently fantastic examples of sound used to further the tone and aesthetic, a similarly plentiful amount of contradictory design choices and unnecessarily tasking moments leaves BELOW with many rough edges. But as lacking in variety its interior designs may be and as demanding its early run-time may present itself, its the atmosphere and wonderful attention to detail that does fortunately consolidate Capybaras entrant into enough of an identity and in the end, warrant a return visit to, no matter the death count. It might not get the balance right when it comes to deciding when and when not to teach players the rules in place, but for those willing to look past these frustrations and bear the brunt of a grueling introduction, BELOWs simplified stylings and anxious trek downward offer up a decent-enough spin on survival and roguelike exploration alike.", "date": "December 21, 2018", "grade": 3.5}