{"name": "Arkanoid  Eternal Battle", "ref": "https://hardcoregamer.com/?post_type=post&p=429427", "text": "Finding a way to integrate the formalities (if you can call it that) of Battle Royale into genres outside of shooters, has perhaps been the one trend Im more than happy to see continue. Leave it to Tetris, of all games, to prove the large-scale, last-man-standing formula can slot well into even the oldest and most franchised of properties. Whether Tetris 99 was indeed an inspiration, aspiration or simply all the evidence developer Pastagames and publisher Microids needed to green-light this venture, here we have the latest decades-old name in Taitos ball-and-paddle series, Arkanoid, having its own stab at things.Albeit at a much smaller scale  in both player count, and as well get to, the sense of random emergence that competitive games of this ilk often generate  matches limited from the regular 100 player-count to but a quarter of that number. The good news for Arkanoid  Eternal Battle is that Pastagames have managed to maintain a moreish quality that has long made Taitos puzzle series such a novel but easily-appealing puzzle entry. How much of that is sorely down to this iteration in particular, rather than the staying power of Arkanoids tried-and-tested legacy, can be argued. But if nothing else, on the surface, Eternal Battle does translate the locked-in concentration on making sure your ball maintains its ricocheting trajectory into that of a more anxious, tug-of-war equivalent where the border between success and failure feels thin.The general order of events is as follows: you and twenty four other players compete in a series of rounds in an attempt to rack up the most points and maintain as high a position on the leaderboard as possible. Or as the game presents in a more illustrative and slightly-menacing way: the bluer the background, the less likely you are to start panicking about being knocked out. Clear a screen of all the breakable blocks and its onto the next one; any blocks you fail to clear in an allotted time serve as a penalty against your current total. Naturally, clearing a screen is of the utmost importance, but of course theres more at play to consider beyond just a high score and that lone paddle ball. A means by which that perilous transition from blue background to red starts to feel more intimidating. The one with the least amount of points at certain intervals ends up eliminated from the match until there are only four players left, hard as it may be to nail down exactly at what interval these drops-outs are initiated.When only four players are left, the match reverts to surviving against the boss-styled DOH antagonist of the game. But survive until the end and one would be forgiven for thinking that thats victory assured, right? Wrong; as the last survivor, youre then required to defeat DOH in a similarly-unspecified amount of time before the monolithic entity can automatically wipe you out. Only by defeating DOH can you achieve victory in Eternal Battle  anything else and you fail just as the previous twenty four players did. Its all or nothing. And in all honesty, having tried the mode out prior during the most recent Steam Next Fest, the premise did feel sufficient in what it was demanding. But thats the crucial word: did. Because being bunt here, something must have happened in-between whereby Pastagames sought it fit to up the difficulty and make victory all-but-impossible. To the point where the more I played of Eternal Battle  the more retries accrued and the hours spent repeatedly going through the same motions in hopes of achieving a true, official victory  the less I was enjoying myself.That goes doubly so for Eternal Battle overall as a package, or at least a fleeting excuse for such. Had ones issues with the climax be an isolated incident, ones feeling of deflation wouldnt be as great. But as it turns out, Eternal Battle is an intriguing starting point for what an Arkanoid Battle Royale might look like, but sadly little else. Because aside from the basic Arkanoid template, Eternal Battle doesnt quite go far enough in contextualizing those emergent moments and split-second decision-making so often a staple of Battle Royale entrants. To go back to Tetris 99 for a second, while that was still quintessentially Tetris in its structure, the key there was that the game was a constant barrage of hectic choices and determining on whether short-term tactics would, if at all, pay off. Like any shooter in the sub-genre, do you progress to victory in as low a profile as possible? Or do you go aggressive from the start, knowing youre in all likelihood painting a big figurative target on your back?I cant say that any of those tentative choices or nerves on whether Id made the right call sprung up in Eternal Battle, aside from a worry I was running out of time to rack up more points. And herein lies one of the major unforced errors: that in centering its premise on a singular objective and singular place on the screen, the notion of fighting against twenty four out-of-shot rivals strangely disappears. In Tetris 99, you could see the other boards and their scattering of attacks, defends, counters and targeted intentions. Eternal Battle, on the other-hand, settles for having a few other players screens besides yours and little else. Sure you can grab falling power-ups that when launched at the player besides you initiates a temporary debuff on them. But thats essentially it so far as tripping others up and having those same players attempt to trip you up. Meaning the risk and tension so crucial to this style of competitive play, is bizarrely watered down here.Which is a shame because as noted, Eternal Battle is not completely devoid of an answer to the question on how Battle Royale in Arkanoid may manifest and eventually pan out. For one, the emphasis on scoring points does lend itself to some brief moments of desperation. Not least when you know the board youre working on is about to be wiped and youve still got a fair number of blocks to clear. Do you play a bit riskier in an attempt to mitigate some of that impending loss or absorb it knowing that letting slip of the ball could cost you more? But thats sadly all there is in so far as mechanical depth and means to truly think methodical and strategic in the long-run. Again, Eternal Battle maintains the addictiveness of going one more match in games no longer than roughly ten minutes, but that cant necessarily be chalked up to anything exclusive to this title.Closing Comments:What feels like the foundation for something ideally more substantial lying in wait, Arkanoid  Eternal Battle can only muster up a competent, but unimaginative, spin on the Taito classic in Battle Royale form. Thats not to say that its core mode doesnt at least find a way to tempt you back for another round umpteen times over, but eventually the more you repeat its disappointingly shallow progression  and worst of all, its egregiously-difficult and frustrating final face-off  the more you feel your time is spent not cunningly plotting a course to victory, but instead merely wasted on a concept that should be better fleshed out. Eternal Battle is not without good ideas in spots, and while the effort on bringing another retro classic into the BR fold is appreciated, its far from the most emergent or compelling of takes in the sub-genre.", "date": "November 1, 2022", "grade": 3.0}