{"name": "Persona 5: Dancing in Starlight", "ref": "https://hardcoregamer.com/?post_type=post&p=318856", "text": "Spin-off games are strange and often wonderful things. Theyre a chance for fans to see more of their favorite worlds and characters outside the bounds of a traditional sequel, and theyre a chance for developers to create something that would never be acceptable within the main series. As weve seen with the likes of Metal Gear Rising: Revengeance and Pokemon Snap, many developers relish the chance to do something crazy with their popular series, and the minds behind the Persona games are no different. In a way, Persona is all about spin-offs. The series exists as a spin-off of Shin Megami Tensei, and Persona 4 had two out-of-genre spin-offs with Persona 4: Arena and Persona 4: Dancing All Night. Even so, its still funny to see Atlus revisit the idea and even improve on it with Persona 5: Dancing in Starlight. Its more streamlined than its predecessor, but still offers a great experience to anyone whos a fan of Persona or even just rhythm games in general.First off, fans of Persona 5 dont need to worry about getting a lesser experience than Persona 3 fans. Persona 5: Dancing in Starlight offers the same experience as Persona 3: Dancing in Moonlight. They have the same structure, offer the same game modes, follow the same progression, share character customization options and challenge players in the same way. They even share the same narrative set-up, so it just boils down to which characters and music one likes more.Unlike Persona 4: Dancing All Night, Persona 5: Dancing in Starlight doesnt really have a story. It just has what passes for an instigating event. The overseers of the Velvet room, Caroline & Justine, have summoned the Phantom Thieves into a shared dream for a dancing competition. It seems their sister from Persona 4, Margaret, has declared Yu (Persona 4s main character) to be the Velvet Rooms most remarkable guest and the sisters are contesting this through a dancing competition. If Joker and his friends can outdo Yus performance from Persona 4: Dancing All Night, they can win the title for themselves instead. Thats really all there is to it. All our heroes need to do is dance their hearts out and get to know each other better along the way. Persona 5 didnt have the most extensive soundtrack, but the song list in Persona 5: Dancing in Starlight still feels lacking with only 25 songs, 26 for those that pre-ordered. They all have their own distinct feel and offer a unique challenge, but many are still just remixes of existing songs, with a couple like Rivers in the Desert getting reused more than once. This would be fine if the game had a story to tell too, but it doesnt and winds up feeling short as a result. That said though, everything here is rather enjoyable to play thanks to solid game mechanics.Gameplay in Persona 5: Dancing in Starlight is more or less the same as it was in Persona 4: Dancing All Night. As the song plays, notes appear and float over to their corresponding buttons. All the player needs to do is hit the correct buttons in time with the notes. There are four main note types: single, double, unison and hold. Single requires one press, double notes need two rapid presses, unison notes require two buttons hit at the same time, and hold notes have the player press and hold its button for the duration of the note. There are also optional scratch rings players can nab with a flick of the control stick for extra points. It can all seem rather overwhelming at first, but running through the games fully fleshed-out tutorial menu ensures that even complete beginners can fully grasp whats going on. Note types, scratches, modifiers, stage clear conditions and more are all clearly explained here, and players can even practice with each input in isolation if they want. Its a great system capable of getting anyone of getting into the main game quickly and painlessly.All songs can be played on any of four difficulties: Easy, Normal, Hard and All Night. The first three follow the same basic rules and progress into ever increasing number and variety of notes. All Night mode is a completely different animal though; its faster, has more notes and breaks the established rules of the other three difficulties. Its by no means impossible, but succeeding in it requires forgetting everything learned in the other modes. Its a mode for masters and even they will want to try it at lower note speeds first. Having some support modifiers on would probably be a good idea too. Support and challenge modifiers provide players with a wealth of buffs and/or added wrinkles to their experience. Supports all make clearing songs easier and subtract from ones overall score, challenges raise the stakes and provide a nice score multiplier. Once a player gets competent, having at least a couple challenge modifiers on will go a long way towards livening up the lower difficulty levels, while supports will mostly be used to either ease ones way into the harder difficulties and make progressing certain social ranks much less tedious. In general, the Auto-Scratch and Good ratings dont break combos supports will be a dedicated players best friends.When one eventually gets tired of dancing and would like a break, they can spend some time talking with their favorite Persona 5s supporting cast if theyve met the necessary criteria. Each characters social events come with their own set of challenges and these can range from simply completing songs to wearing a number of different outfits and accessories. Theyre easy to advance for the most part, but some can be rather tedious, particularly those that require a massive overall combo number and Brilliant ratings on songs. These are of course optional and have no influence over unlocking songs, but theyre worth pursuing for those that want to know more about the Phantom Thieves and would like more outfits to play around with.These social events mostly play out as self-contained conversations with one or more characters and can focus on anything from what kind of career they want to what they like to do in their spare time. The player gets a few dialogue options, but they dont do much aside from occasionally getting some funny reactions from the others. Advancing these social events far enough also grants players access to each characters room and the chance to take on a little scavenger hunt mini-game. One basically has to scour the room for something special hidden in it, learning little tidbits about their companions as they do so. Once the item is found, even more customization options are unlocked. Its a nice feature overall, but ones mileage will vary depending on how much they like Ann, Morgana and the rest. This is also true of the character customization system. Persona 5: Dancing in Starlight gives players an incredible amount of options when it comes to customizing their Phantom Thieves. Outfits range from normal clothes to outlandish Halloween costumes, and accessories include headphones, cat ears, goofy masks, tails, a TON of glasses and even onomatopoetic text emotes. Players can even save their favorite combinations if they want. The options are just staggering and players who like this kind of thing can have a ton of fun with it; fans even more so.Persona 5: Dancing in Starlight also offers a robust options system, online functionality and even limited VR support. The options menu basically gives one everything they need to tailor their experience. English voices can be swapped out for their Japanese counterparts, everything has its own volume slider, note sound effects can be customized and scratches can be mapped to the shoulder buttons among many other options. Online functions are limited to leaderboards and then theres the VR functionality. VR functions can be summed up as simply being present. It offers no special functionality beyond allowing one to look at the character models in a 3D space, and even then only from the Collections menu. One can play the normal game with the VR headset too, but it actively makes the game harder since one must turn their head in order to see the whole display. Dont play this in VR; it just makes everything worse. Closing Comments:For an odd spin-off to an RPG series, Persona 5: Dancing in Starlight is very well executed. Its song library is more than a little sparse considering how many of the tracks are remixes, but each song offers its own challenge and is fun once one gets into its groove. Social link challenges, modifiers and character customization options keep everything feeling fresh, and the social events themselves are fun to watch for those who are already familiar with the Phantom Thieves. A robust tutorial and options menu help get players into the game and keep it tailored to their preferences, so its not difficult at all for even new rhythm game players to enjoy these games. The limited online functionality, less than bare-bones implementation of VR and lack of an actual story are a little disappointing, but not enough to ruin the experience. Altogether, Persona 5: Dancing in Starlight is great for what it is, but isnt really worth the $60 price tag for non-fans. Unless more songs are added free of charge as DLC, casual fans of these sorts of games may want to wait for a discount.", "date": "November 27, 2018", "grade": 3.5}