{"name": "The Bards Tale: Remastered and Resnarkled", "ref": "https://hardcoregamer.com/?post_type=post&p=273704", "text": "The dungeon crawler series The Bards Tale is one with a storied history. The 80s trilogy was a favorite of PC gamers in the know, with complex role playing, deep dungeon-crawling mechanics and a flexible construction set that allowed fans to follow up on the originals with their own creations. It was just danged nifty. Thats why InXiles 2004 reboot was confounding to the existing fans. Being an overhead hack and slash with voice acting and humor, it had little to do with the original creation. I also loved it. Cary Elwes played the eponymous Bard with a consistent wink and the action was challenging in a way isometric action/RPGs tend to avoid. So it was, with nostalgia for a reboot, I decided to check to see if anybody bothered to port the PlayStation 2 version to the PS4, in a manner similar to Red Faction or Dark Cloud. The answer was no. Instead, InXile released The Bards Tale: Remastered and Resnarkled, and didnt really tell anyone. Fortunately, it was recent enough that a review could still be considered timely.The story doesnt truly follow the normal beats of an epic fantasy narrative. The Bard enters a bar one evening, hoping to use his rat summoning song to trick the proprietor into giving up some cash, or at least a free drink. He soon finds himself the butt of the classic Giant Fire Breathing Rat prank. An old man takes notice and teaches him a song to summon a lightening spider, which kicks off a quest to learn new songs, which leads to a princess rescue. All of these actions are taken with great hesitation from the Bard, as he is driven primarily by greed and maybe a little bit of lust. The constant bickering between himself and the disembodied voice of the narrator goads him along, though not without copious amounts of complaining and destruction of the fourth wall.Now, the fear with this type of title would be that the humor hasnt aged as well as it could have. Its possible that Im in the minority, but that doesnt seem to be the case. Theres this running gag where the Bard constantly finds the rotting corpses of previous Chosen Ones, gullible saps who were convinced to take on the very task that the Bard is undergoing. Each discovery yields some new equipment for the Bard and is punctuated by a song from a trio of Oompa-Loompa by way of goblins, called Trow, decrying the terrible fortune beheld. Whether or not they are referring to the corpse or the Bard is left ambiguous. This is a story about the jokes. About the Bards careless stupidity biting him in the ass in more elaborate and destructive ways. Unfortunately, others have to pay the price, as well. Attempting to describe humor without ruining the jokes by robbing them of their context is difficult. Suffice it to say, the script still lands with consistency, with only a few clunkers overall. Against its action/RPG contemporaries, such as Diablo 2 or Baldurs Gate: Dark Alliance, The Bards Tale might not feel as rewarding. While other titles were about collecting and equipping from a continuing pool of better equipment found on the slain enemies, this InXile decided to forego all that in favor of a streamlined experience. Anytime a better piece of equipment is purchased or found, it is immediately equipped and the old item converted to cash. Its a rare occasion that improved gear is found, anyways. In fact, none of the stores have a sell function. Anything of value becomes coin. Even leveling up is rare. Instead of focusing on grinding for experience and loot, the gameplay is focused on using the tools available to defeat the groups of enemies. There are plenty of those, at that. The Bard appears to have a quiver filled with copulating arrows as he never runs out, is an expert swordsman, and can use musical instruments to summon warriors and monsters to round out the group to the players liking. A player that likes to fight from a distance can summon a mercenary to act as the tank. One who forgets about the parry button can summon a healing crone, or a wasp that transfers enemy health to the players team. Theres quite a variety to be had, with options opening up further as the Bard finds instruments that allows for more simultaneous summons.If reviewing the game itself, the score would be rather high. Its a good time. However, this is a remaster and should be treated as such. Unfortunately, not all is well with this update. The issues arent where one would normally expect, though. Graphically, its fine. What little prerendered video there is here didnt get touched, showing instead in a small window. Based on the age of the game, its reasonable to assume that fixing this wasnt possible for some reason or another. As most of it is in engine, this wasnt a big issue. The actual in engine stuff is just fine. The increased resolution cleaned things up quite a bit, and it appears that the models are based entirely off of the superior 2005 PC version. It doesnt display the stellar amount of care that went into the Bioshock collection, but this remaster is also being sold at a budget price. It looks good enough that one doesnt notice the age of the graphics, though it would never be mistaken for a modern title. The true problem is found in the bugs and glitches. Throughout the entire game, dialogue required for continuing the story doesnt trigger, NPCs necessary for progression wont populate, even prompts to purchase something from a store wont be available. Whenever this happens, the only option is to hard close the game and reopen it. Therefore, it is incredibly important to save often, as this scourge can appear at any time. Strangely enough, this was never witnessed in the Vita version. Solely the PlayStation 4. It is ghastly enough to be a major, unforgivable problem. I had enough previous experience with the game to realize when one of the many Bodb was showing up where required, but it could lead to a newcomer giving up before they get to see the really funny stuff.The obvious solution to this problem is to stick with playing this title on the Vita. However, that comes with a couple of warnings. First, the smaller screen doesnt handle the overhead view very well. Traversing dark areas like the plant infested first tower requires using an aggressive summoned minion to act as a canary to avoid stepping in traps. Plus, the controls were designed to take advantage of all of the Dual Shocks buttons, mean the back touch panel is used for L2and R2. Prepare to open up unwanted menus often. Closing Comments:With a patch to clean up the technical issues, The Bards Tale: Remastered and Resnarkled would be an incredible value. Its a classic title that too few people played when it was new, cleaned up just enough to be visually acceptable, sold at a reasonable price. The game itself will take around twenty hours to polish off, depending on the difficulty level chosen and the dedication employed for finding the stat boosting tokens. When approaching this title, I was fully expecting to sing its praises for being the unappreciated gem that it is. It this editions current state that cannot be done with a clean conscious. Hopefully, InXile will take the time to address the bugs. Should they do so, this would be a title worth recommending to any one with a sense of humor and a desire to play a protagonist that deserves every piece of grief he receives.", "date": "Bohn on September 28, 2017", "grade": 3.0}