{"name": "Black Bird", "ref": "https://hardcoregamer.com/?post_type=post&p=317041", "text": "Games with deep musical influences come in all shapes and styles, but an operatic free-roaming arcade shooter by way of Hans Christian Andersen is unquestionably a unique approach. Black Bird is the story of a spirit of destruction born from the body of a young girl who dies on the street, alone and neglected. After a passerby taps her body with his cane, it becomes encased in an egg, which then hatches into a small black bundle of doom. As a hatchling the bird is small and weak, but once it starts tearing through the towns defenses, it grows bigger and more powerful until its strong enough to wreak pure calamity across the land.Theres no question that Black Bird is a weird one, but its also a smart little pixel-art shooter thats bursting with personality. Each of the four levels is its own little world packed with secrets and small touches that would be easy to miss if you focus too much on the action. Hidden pots containing power-ups are buried in the earth or inside buildings, unique enemies patrol specific parts of the levels, the townsfolk have their own little routines and hidden scoring bonuses pop up just often enough that youll want to keep searching the levels to see what new opportunities turn up. And of course all this is happening with each level getting its own musical number sung in a nonsense language, complete with a boss song that picks up in tempo as you shoot through its forms. Despite being a hectic shooter with a grim story, Black Birds charm levels are off the charts.It doesnt appear all that hectic at the beginning, though. At the start the bird is a small little ball of bedraggled vengeance, shooting out a string of tiny bullets that dont seem big enough to be anything more than a distraction to whatever theyre flying towards. They get the job done, though, and any of the townsfolk or guards hit by them turns into a green gem. None of the mechanics in the game are explained beyond a screen showing that A is for shoot and X for bomb, but it doesnt take a lot of gaming experience to recognize a collectable when it shows up. Each gem you collect adds to a green ring around the bird, and when its completed, a full circle the bird evolves into a newer, bigger form with better firepower. The straight-ahead shot is joined by another bullet that drops down, and then an upwards shot to complete the full spread and the shots grow with size and power as the bird evolves. Fortunately the birds hit-box is its eye, so that extra size is impressive, but not a disadvantage. Each level is a free-roaming side-view scene, wrapping around once youve gone far enough, and the goal is to take out the watch towers to summon the boss of the area. Archers on balloons crowd the skies while police throw bullets up from the ground and most shots are either coming straight for you or carving up the screen to lower your room to maneuver. There are a few pretty bullet-hell patterns but for the most part a projectile wants to do its level best to knock off a block of health rather than be part of a geometric display. On the one hand it means you need to be careful, but those gems are calling and every time they bounce off the ground they get smaller and less helpful in filling up the evolution meter. Black Bird requires you to be careful and encourages you to go fast, and its a tricky balance to maintain.The other important balance is between speed and killing, tallied up at the end of the level. A fast time gets a huge bonus, while killing lots of people (and the game makes it perfectly clear that killing is the right word) gets a multiplier. A Superb-level speed bonus is nice, but that means you didnt kill much more than the bare minimum, so it might be better to slow down a bit and balance a Great speed with Great kill-count. Black Bird is a free-roaming shooter so you can take as long as you want, but scoring will suffer for it. On the other hand its also only four short levels and can be completed in twenty minutes, so a few practice runs to explore the area and put together the best run will pay off nicely.While deeply likeable beyond all reason, Black Bird is also filled with quirks that get tiring after a while. The first time through the game is honestly a lot of fun, and while its not particularly hard to clear the final boss once youve put in the practice, thats not the end of the story. Clearing the game opens up True Mode, which continues the tale with new events, enemies and secrets in the levels youd become familiar with. The problem is that the first time through is easy while the second is hard and theres no middle ground. There are eight different endings possible in True Mode, but good luck seeing any of them, because the levels get packed and the first play-through is better at putting you at ease than setting you up for the real fight to come. While the bullets are well-marked, enemies tend to fade into the background, making it easy to crash into someone you just didnt see. It also doesnt help that the bird has just shy of zero frames of invulnerability after taking a hit and a generously-stocked health bar can drop down to nothing in a single frantic encounter. You can shoot a power-up to make it cycle among health, speed or bomb, but its easy to lose the health just as you gain it thanks to enemies that replenish themselves almost as quickly as you shoot them down. Closing Comments:Black Bird is a wonderful, sad, strange, funny, cute and bizarre shooter that cant quite make its gameplay match the quality of everything else. Theres an incredible amount of imagination and creativity packed into every frame, whether its a villager emptying trash into the recycling bin, cows streaming out of a destroyed barn, trains chugging along the tracks or a windmill you can pump full of consecutive shots for an impressive point bonus. Each level is a toybox of shooting action, and no matter how many secret little quirks you find, it seems like theres always another hidden away on the next screen over. Its only real problem is that the first play-through is only half the story and locking the rest behind such a high difficulty wall means that even a standard ending that might make a little sense of Black Birds wonderful strangeness will be out of reach of most players.", "date": "November 5, 2018", "grade": 3.5}