{"name": "Star Ocean: The Divine Force", "ref": "https://hardcoregamer.com/?post_type=post&p=429280", "text": "There are few Japanese Role Playing Games that have continued into the modern age, yet somehow Star Ocean has become one of the most recognizable space epics in the genre. Twenty-five years of games, tri-Aces baby started all the way on the Super Nintendo and quickly picked up a following. Rightfully so, as the games featured a diverse cast of characters from various worlds in the galaxy, fast-paced combat and fascinating storylines that border on Isekai. To this day, The Second Story remains one of my personal favorite games, but theres no doubt that the series has been on a downward slope over the last few entries. The Last Hope wasnt bad, but it had a lot of issues and Integrity and Faithlessness was an utter mess. It says something that the best entry in this long-running franchise has been the now defunct Anamnesis mobile game. Tri-Ace is back at it once more with The Divine Force, hopefully reinvigorating the franchise and propelling it back into the spotlight. Unfortunately, we wouldnt be surprised if this is to be the final time the developers work on the franchise.The story of Star Ocean: The Divine Force is entirely reliant on the character thats chosen at the beginning of the campaign. Similar to old school Star Ocean: The Second Story, there are two protagonists: Raymond and Laeticia. The former is the Claude Kenny of the journey, a captain of a spaceship thats shot down on an underdeveloped planet, and the latter is the Rena Lanford, who is a princess on said planet. Whoever is chosen, the story will focus on them; that means whenever the characters are separated or pulled aside, only that one individuals interactions will be conveyed, which is a decent way to incentivize multiple playthroughs considering there are conversations and dungeons that are completely skipped (even though the outcome is all the same regardless). Our experience with The Divine Force was less than remarkable as its filled with a not-so compelling cast and a lackluster plot that deals with warring empires, incorporating intrigue with advanced civilization intervention. A lot of the issues comes down to the dull dialogue that barely helps build characters or the world at all. Most of it feels unnecessary and drags for far too long when a situation could be explained with less fluff. There are even times when the story will forcibly send you outside of a freshly-completed dungeon for a plot point only to tell you go all the way back through with respawned enemies. Its little contrivances and the bloated dialogue that damage the overall progression and any character development. While the story and characters are less than ideal, the one redeeming quality of The Divine Force is its combat system. This is a franchise well known for its fast-paced and engaging combat, which Tri-Ace continues to push forward. A characters skillset is highly customizable, allowing the everyone to create their own combos that use a specific amount of Action Points (AP). Using D.U.M.A, an AI bot, youre able to get the jump on enemies, even stunning them, which will increase these action points until youre caught off balance. Its a fascinating way to ensure that characters arent just able to spam their hard hitting attacks over and over again, giving the everyone creativity and control over their experience, and rewarding those who put their tools to good use. Whats best is that each character is unique in their capabilities; while there are some that cast magic and others that swing around a sword, each is done with a completely different skillset and mobility. There are even those such as Nina which is almost entirely a healer and support character with limited offensive capabilities. If anything shes the most powerful individual, buffing, healing and reviving on the fly. And switching between everyone during combat is made easy as its a simple click of the dpad, even allowing you to go into the menu to swap them out for someone on reserve. Suffice to say, the combat is the high point of The Divine Force that will undoubtedly keep players actually interested in-between the lacking story points.But like everything in this game, there are caveats as The Divine Force comes with dreadfully-linear corridor dungeons. While the open areas serve as a breath of fresh air for traversal, allowing you to avoid enemies and explore to your hearts content, dungeons are barely anything to talk about. There are of course some later on that create an interweaving maze, but most of them youll want to get out of quickly. On top of that, the AI companions arent too bright. Just an example of how they dont always seem to understand their surroundings: on multiple occasions weve seen characters run and stand in poisonous swamps as their health quickly drains. Characters who are supposed to be more long-ranged combatants will sometimes put themselves in melee range and harms way for no apparent reason. Tri-Ace has always created large open areas before, but nothing to the scale of The Divine Force. In between the cities and dungeons, youll find vast swathes of the world, from forests to deserts that are glimmering with beauty. Best yet, traversal has been made enjoyable, as its not as traditional as simply running from point A to point B. Theres a sense of verticality thanks to D.U.M.A. which allows characters to be hurled through the sky at fast speeds. As mentioned before, this is also used to get the jump on enemies, so I dont think tri-Ace could have found a better feature to include in this sci-fi adventure. The only real downside to these beautiful open areas, though, is that a lot of them are void of life with only small patches of fixed encounters, treasure chests and D.U.M.A. skill points to be collected. For such massive areas, they arent super dense. In addition, the scanning aspect that comes with D.U.M.A. is not the most efficient; maybe other games have trained us to simply holding down the button and everything around will light up, but you have to physically stop the character and hold down the button for a couple of seconds to scan around. Its a less-than-efficient way to actually explore, something we barely utilized in our playthrough.Along with all these issues, there are baffling design decisions. Looking past the linear nature of the campaign as youll consistently see blocked-off areas that restrict actual exploration of the world itself, the story progression is astonishingly annoying. Throughout your adventures, teammates will constantly leave the party temporarily, be it for their personal reason or more likely its tied to a specific characters story. While this wouldnt be a problem, every single time they return with all of their accessories removed, so hopefully you can remember what was equipped on every single slot. Even more infuriating is that when a character is speaking out in the world, not only are you not allowed to skip the dialogue, which sometimes goes on for far too long, but the menus and maps are inaccessible while theyre talking. Same with interactions with say storekeepers or inns. Leveling each individual character takes forever, too, as each attribute comes with a nostalgic sounding notification that takes a couple seconds to get through. It may be nitpicky, but I found myself spending twenty minutes after each crucial plot points spending skill points. When characters are earning hundreds of SP per level, allowing for many nodes to be unlocked, this endeavor can take an unnecessary amount of time, not to mention navigating the messy menu system. The presentation in The Divine Force is a mixed bag at best. On one hand, there are elements in the open areas that are beautiful, and some of the clothing shines brighter than others. Sadly, there are many times when this looks like it should have come out two generations prior. Some of the major characters, such as Midas, appear like they were pulled out a bad NPC generator while others are plastic dolls. More futuristic, well-crafted metal beveled surfaces seem way out of place because of all this. In addition, animations are stiff while in cinematics and story moments. Plenty of the issues also have to do with lighting and shaders, or lack thereof as there are times when it feels like were looking at a face with a plain texture. Its fortunate that the open world looks as good as it does, but even up close a lot of the world can look rough. On top of that, the performance takes a surprising hit, at least on PlayStation 5. This isnt exactly the most demanding game, but somehow it isnt well optimized. The framerate is horrendous even on performance mode in both cities and open areas, stuttering to an almost unbearable degree.Just like the visuals, the audio department ranges from good to dreadful. On the positive side, the soundtrack is generally well done with a handful of memorable tracks spread throughout. This also banks off of nostalgia with a ton of familiar sound effects from menu navigation to leveling up. On the complete opposite side of the spectrum is the voice acting. Its unclear whether its the script or the directing, but its hard to fathom how we can have such ear-piercing voice acting in 2022, at least for the English track. Some are fine, but others, such as one of the main protagonist Laeticia, sounds like theyre reading off the script with no spirit. The others generally just fall flat with only a couple standout additions, so youll most likely want to change to the Japanese voice track as soon as the game is booted up. On top of this, characters have to comment on the direction theyre supposed to be going on every single occasion, even interrupting character or world building dialogue along the way. They have nothing else to contribute. Its the equivalent of someone (or everyone in this case) not knowing how to make small talk, so all they ever talk about is the weather. Closing Comments:Star Ocean: The Divine Force feels drained of life. It has a strong, highly-customizable combat system along with a solid soundtrack, but theres not much praise to speak of outside of that. The two hero option is a fun gimmick we havent seen since The Second Story, only observing one perspective of the story at a time, but the problem is that there are so few compelling characters. The cast and story is one of The Divine Forces biggest downfalls, not to mention severely-fluctuating presentation values. Laeticia and Raymond are some of the stalest protagonists, lacking emotion and charm. There are also bizarre design choices that ruin the flow of progression, such as accessories being removed every time a party member is temporarily removed (which happens all the time) or not being able to interact with menus, maps or the world when theres the frequent unskippable fluff dialogue whilst traversing. Thats not mentioning the boring dungeon designs, although the traversal in the open areas itself is at least fast and enjoyable. I couldnt be more disappointed in how Star Ocean: The Divine Force turned out, to the point Id rather go back and replay tri-Aces Infinite Undiscovery. You can take solace that The Divine Force is at least better than Star Ocean: Integrity and Faithlessness as there are moments of intrigue, but theyre overshadowed by how severely underwhelming the overall package ended up.", "date": "October 26, 2022", "grade": 3.0}