{"name": "Sinner: Sacrifice for Redemption", "ref": "https://hardcoregamer.com/?post_type=post&p=314591", "text": "Even those outside the bubble  namely those who dont garner From Softwares core trilogy of Action RPGs under the Souls moniker, with immense acclaim  can still respect how effective a figurative kick up the back-side the Japanese developer gave the gaming industry to begin with Demons Souls in 2009 and more notably in 2011 with the original Dark Souls. Among everything the series as a whole brought, it was the grueling sense of challenge that at times may have felt brutal and demanding, but in reality still ended up fair, regardless of ones initial animosity. Its no surprise to find, like many a pinnacle in video games  because even for those who dont particularly like Dark Souls, one still accepts said IP is indeed an industry highlight and source of inspiration for countless  there has been a plentiful amount of blatant copycats that aim to replicate the delights and devilish trickery alike of Froms pedigree.Where most have gone the whole way in crafting a world with which to survive as much explore, a game like Sinner: Sacrifice for Redemption opts instead to focus entirely on the boss fights. Reducing ones sense of vague meandering and gradually-built head-canon to nothing more than an ensemble of encounters that overall cover as many theatric and gimmicky cornerstones as weve come to suspect from a series renowned for its dramatic, multi-phase boss battles. You neednt go the full stretch to instigate a compelling boss rush title as previous releases such as Furi, Titan Souls and last years Cuphead have demonstrated in the past. You neednt even rely on Souls formula to do that. But with Dark Star going all in on the suggestive, dark fantasy tone of those games, does it result in any better an experience? Furthermore, is Sinner: Sacrifice for Redemption even a good boss rush game to begin with?If you were to look at it from solely this angle alone, Sinners clear-as-day homage regarding the combat, the mechanics, the general presentation of things, does get a sufficient amount right when it comes to creating something thats engaging to play, as much as it is to conquer. The game doesnt offer an illustrious array of weapons or apparel to customize your character, nor does it offer anymore effort on the gravitas  from a story perspective  to its bosses. Aside from a few fleeting cutscenes and passing lines of dialogue in reference to proposed connections to the protagonist, the lone Wanderer whom is neither a silent-though-fleshed out protagonist, nor a player-avatar with which people can customize and connect to. Theres a significant amount absent in Sinner in regards to its set-up to the point it almost feels like what one is playing is in beta form or some test build ideally meant to be built on along the way. Namely the interface and how bare-bones it looks. Even the soundtrack can take a hit and come across as an unwelcome distraction, certain music tracks cutting off abruptly, looping back-around to the start point far more evidently than whats necessary. Enemy health-bars are oddly basic, in-game text simply popping up in a generic font. Its like watching another one of those made in Unreal Engine/Unity fan videos cropping up more and more online; theres a weird, almost sterile look and feel to proceedings. In a game that so evidently wants to replicate the unsettling, near-apocalyptic desaturation of the dark fantasy genre, even the arenas/settings you find yourself flung back and forth between, feel stripped back and without much reasoning.This doesnt factor into the visual design of the bosses themselves thankfully, which to Dark Stars credit do illicit a welcome variety and one that at least has a closer semblance to one of the central premises regarding the seven deadly sins  each one of the seven main foes standing as an anthropomorphic representation of each sin. The fights themselves are where Sinners eventual strengths come into view, namely the ideas posed through enemy attacks/movements/threats, as well as the means at which fights play out as bosses transition into their latter phases. Not all seven main battles end up facilitating that familiar level of adrenaline-fuelled desperation  some whimpering out into mere attack-dodge-attack-dodge formulae, even the stronger offerings on show end up suffering at points from questionable hit-boxes and off-screen projectiles players will find near-impossible to predict, let alone avoid entirely. But taken as a collective whole, Sinners boss fights, in terms of gameplay and gameplay alone, are reasonably satisfying nonetheless and are, more surprisingly, able to whip up an unexpected surprise or two  leaving players either further invested in the fight or near-despondent of the increased challenge inevitably heading their way. An added reason as to why Sinners sense of peril and precariousness of its difficulty resonates, comes in the unique leveling down mechanic that precedes each one of the seven main fights. Rather than acquiring a new skill or leveling up upon defeating a boss, players are forced to (as the name of the game alludes to) sacrifice a potentially-valuable ability or element to their character in order to even partake in the fight to begin with. The type and indeed scale of sacrifice varies, from seemingly adaptable things like the inability to use certain items, to potentially costly like a decreased stamina or health bar. Figuring out which order to tackle bosses in, though contributing a tiny portion of strategy in the short-term, can find itself mitigated by the contrast in difficulty between certain bosses.Its a shame then that this remains the only real indication of Dark Star trying to improve or simply build on the formula theyre so eager to replicate as Sinner ultimately struggles to move past the initial status of homage, in being anything more substantial or otherwise well-rounded in presentation. Particularly when, on more than one occasion, a boss fights most recognizable trait is the fact it sticks to an already-known, already done-to-death gimmick with little individuality or subversion of such standards. The hidden among a slew of similarly-looking enemies boss, the strong, large but slow boss, the quick, small and heavy on area-of-effect boss; though thankfully beaten out by its more entertaining counterparts, its evident that these such encounters are, like many other elements of the game, disappointingly lacking in substance and unable to escape the confines of their obvious templates. Closing Comments:Pleasing and genuinely tense a large portion of its core gameplay may be  particularly when it comes to considering which abilities to sacrifice, and when more importantly to enact them  Sinner: Sacrifice for Redemption falters from an otherwise lack of context and general purpose in a world that is suggestive on quick glance, but quickly reveals itself as little more than superficial decoration. A lack of detail and intent notably with its scene-setting and overall presentation too (interface especially) only goes to further limit the investment players may find in a game passionately replicating an experience, but nothing more. As commendable its combat and enemy design may be, Sinner: Sacrifice for Redemptions reliance on templates and tired tropes inevitably wears down what little (though effective) originality it houses.", "date": "October 19, 2018", "grade": 3.0}