{"name": "Luigis Mansion", "ref": "https://hardcoregamer.com/?post_type=post&p=315508", "text": "Luigis Mansion has been a beloved classic since its original release on GameCube well over ten years ago now. It was the first of its kind for Nintendo and gave Luigi much of the personality he still has to this day. It was Luigis first time to really shine on his own, but not in the traditional Mario style methods. After quite a long time the original entry has been given a 3DS port, to which many thought was odd considering the Switchs existence but was silently understood by many fans after the recent reveal of Luigis Mansion 3 coming to Switch next year .With players getting another chance to dive into the mansion once more, its time to see how it compares to the original.For those unfamiliar, the tale of Luigis Mansion follows the green mustachioed brother after he has managed to somehow win a mansion of his very own. Upon making his way there, things are immediately out of place and not just because of the scary outer appearance. Once inside Luigi begins looking around only to find that most of the doors seem to be locked. After finding one way in he discovers unwelcome visitors in the way of ghosts. Luigi is rescued by Professor E. Gadd and the two soon learn that Mario has been kidnapped. Its up to Luigi with the help of the Professor and the Poltergust 3000 to find and rescue him while continuing to explore the extremely mysterious mansion.The main goal throughout Luigis Mansion is to capture the wandering ghosts with his Poltergust and slowly advance through the endless corridors has he finds more keys. Capturing ghosts themselves is fairly straightforward at first, requiring Luigi to flash them with his light and then begin sucking them up. This plays out a bit like a mini-game with each ghost having their own amount of health. In order to suck them in best Luigi must pull in the opposite direction as their health begins to drain until it reaches zero and theyve been caught. Aside from the normal ghost enemies, Luigi is also after portrait ghosts who have escaped from their paintings. Most of these are required to capture for the plot to progress, but unlike normal ghosts arent affected by Luigis flashlight. Scanning these ghosts with Luigis handy dandy Game Boy Horror will help him get a clue as to how to capture them. In order to move on, however, Luigi must figure out how to get past them and at the end will find himself face to face with a boss ghost of the area who will reward him with a special key to continue.Although mostly a solid recreation of the GameCube original, Luigis Mansion does add a lot of new ways to play. The first of which is introduced almost immediately is the multiplayer aspect. Professor E. Gadd from the future sends back a mysterious form known as Gooigi, which a second player can take control of for local co-op play. The portrait ghosts can also be fought again at any time the new gallery mode and challenges Luigi to fight them perfectly in order to get new colored frames. Achievements also make their way into this iteration by offering simple challenges to be completed. None of them are particularly difficult, but offer a nice trophy in the gallery for completing enough of them. The big new addition is the more challenging hidden mansion which is unlocked after beating the story once. The hidden mansion is similar as far as looks, but offers a harder challenge that will keep players on their toes with more ghosts and damage to take along the way. It will take full attention to get through this tricky mansion without getting too bruised.One of the other big changes for the 3DS version of Luigis Mansion is of course the visuals. Despite being a tiny bit of a downgrade, its seen solid improvements all around. Luigis model is more accurate to his recent appearances, and the details of the mansion look better than ever when looking side by side. Performance wise it runs perfectly on the New 3DS, but we cant comment as far as the original models. A welcome addition to the 3DS version is the inclusion of actual 3D functionality. This adds depth to the mansion and gives a better perception overall when trying to capture ghosts. The biggest flaw of being on the 3DS are the controls themselves. While they work well for the most part, they arent as fluid without a true second analog stick. Even on a New 3DS with its c-stick can be awkward to deal with when wanting to aim the vacuum up and down or accurately aim at anything. The easiest way to really make it feel like the original Luigis Mansion would be with the circle pad pro adapter, but not everyone has access and it only works with the original 3DS models.Closing Comments:For someone who hasnt played Luigis Mansion before, this 3DS port is a good way to have an opportunity to dive in. Although the controls suffer a bit due to being on the 3DS, its not hugely detrimental most of the time save for a few challenging bosses. The visual upgrade is especially nice alongside the inclusion of actual 3D functionality that make for large welcome changes to make it pop. Those who still fancy the original GameCube version might not be interested if they can still readily play it, but the addition of the challenging new hidden mansion, ability to challenge bosses and local multiplayer can make it well worthwhile for those wanting to try something new. Luigis Mansion is still a great classic and fits in fairly well with all the other wonderful ports on 3DS.", "date": "October 17, 2018", "grade": 4.0}