{"name": "Warriors Orochi 4", "ref": "https://hardcoregamer.com/?post_type=post&p=314921", "text": "This has been a busy year for the malevolent forces of ancient Greece. Ever since Kratos went to northern Europe to start a black metal band, the Grecian neer do wells have been coming out of the woodwork. First we have the Cult of Kosmos doing all sorts of cloak and dagger nonsense, and now Zeus, Ares and Athena decided to take a page out of Orochis playbook and mash up the worlds of Dynasty Warriors and Samurai Warriors. Not that were complaining of course since we tend to enjoy the simple pleasures of the repetitive chaos that can be found in Musou games and Warriors Orochi 4 introduces some new elements in the latest installment of their one version a zillion formula.The story of Warriors Orochi 4 continues after Warriors Orochi 3 Ultimate, which the former is nice enough to include a story synapse of the latter during the loading screens. Zeus had observed the events involving Orochi X and the Hydra, and after all that mess was settled the characters went back to their home worlds with a convenient case of amnesia. Zeus is bored and wants to recreate this world since having the warriors from the Three Kingdoms and Sengoku period meet up again sounds fun. Some video games have stories that show video games can transcend storytelling into high art and this is not one of those games. The story is interesting enough, but really just exists to provide an excuse for a reunion between the Dynasty Warriors and Samurai Warriors to battle against supernatural forces they wouldnt encounter in their more historically accurate main games.Warriors Orochi 4 begins with a modest roster of three characters but this increases after almost every main story battle and side story, ultimately leading up to a total of 170 playable characters once everyone is unlocked. Guest characters from Warriors Orochi 3 Ultimate do not return, such as characters from the Dead or Alive franchise or historical figures such as Joan of Arc and Achilles. All Dynasty and Samurai Warriors return, along with the natives of the Mystic Realm such as Da Ji and Susanoo, along with some select members of the Greek and Norse pantheons. The design choices for the Greek gods are not what weve been accustomed to traditionally. The designs for Ares and Athena are well done with Ares having some of the coolest new weaponry, though when I look at Zeus I cant help but think of Chris Farley being turned into a steroid-devouring bodybuilder. Veterans of Warriors Orochi 3 Ultimate will feel at home in Warriors Orochi 4. Players will assemble a team of three warriors and go into battle, switching between characters to help stave off death and slaughter an endless supply of enemies in the familiar one vs one thousand formula. Players fight off hordes of enemies is the familiar hack and slash gameplay, using simple attacks and the special musou attacks when they need to clear out a lot of enemies quickly. In keeping true to the play mechanics of their predecessors, characters from the Mystic Realm and Dynasty Warriors games will have a stronger charge attack they can mix into their combos while the Samurai Warriors characters get a dash attack. Each battle lasts on average around fifteen to twenty minutes, though character level, difficulty setting and skill factor into this. The gameplay is repetitive and generally simple, but in that sense it can also be cathartic and good game to play when you need to unwind.The biggest change in gameplay is the addition of magic which is introduced early on. Each character has four different magic abilities that can be activated by holding the right bumper and pressing the corresponding face button. The least exciting of these is the ability to summon a horse, but having a horse appear underneath a character is a nice change of pace from having to chase down a galloping equine (were looking at you Samurai Warriors 4-II). Each character has normal magic that is useful for dealing rather weak to moderate damage to a large group of enemies and only uses a bit of quickly regenerating magic gauge, which can vary from sending a barrage of fireballs to waves of ice to shooting a wide beam from a sword. Charge magic is a more powerful attack that drains the entire magic gauge and requires it to be full in order to use. Lastly, each character has a unique magic spell that drains the musou gauge and the magic gauge. The addition of magic helps breathe some new life into the formula, and while there were some reservations when it was first announced, I quickly found myself constantly spamming enemies with my new found spellpower. In the same vein of magic attacks there is now a unity bomb. This attack is basically launching a mini nuclear warhead on the battlefield by using the combined powers of all three party members and the four support characters, which is a good tool to have on reserve if the battle starts to shift out of your favor. Certain characters undergo a process known as deification once they find the proper Ouroboros Bracelet that resonates with them. When in this state they undergo a transformation process and can unleash virtually unlimited unique magic.Character and weapon growth is a necessary part of progression in Warriors Orochi 4. Players will collect new weapons from the battlefield and characters will gain levels by gaining experience in battle. Because there are so many character options there is a good chance that your favorite character might not be unlocked until later in the game, but just like its predecessor, growth points are accumulated that can be freely distributed to any character the player chooses if a new addition to the roster needs to catch up. The story progresses through five chapters, each one offering several battles. In addition to the main battles there are side story missions that dont necessarily deal with the main objection of figuring out what Zeus is up to but typically lead to unlocking new characters. In addition to standard level gaining, characters will earn skill points with each level that can be spent on new abilities to make them even more powerful. Gems can be spent on camp rewards that are bonuses that benefit all members of a players party, such as increasing the experience earned in battle or getting more gems. Characters that arent being used can be sent off on training missions to gather materials and gain levels, so there is a simple kingdom management portion. Warriors Orochi 4 is an enjoyable experience on single player, mainly because the battles arent too long and the story gets fleshed out some more with each battle. Like most games of this style, the greatest enjoyment comes from multiplayer which can be done locally with a split screen or online. All story battles are available for online co-op, provided they have been unlocked through normal story mode play. There is an online code called Battle Arena which supports up to six players in three against three teams of capture the base. During the review process no one was ever online during any of the attempts to play it but I was able to complete the tutorial. Based on the tutorial it seemed like a simple game of capturing a base by standing by it. It looks like it has potential to be fun but probably not a major selling point for the game. There are no other game modes besides story and arena, and even though any completed battle can be replayed at will this seems lacking. A gauntlet mode like the one in Warriors Orochi 3 Ultimate would have been a nice addition to this package to extend the value of single player and local co-op.Warriors games are notorious for experiencing slowdown when things get too busy on the battlefield, which is especially true in multiplayer. No slowdown was encountered during the review of Warriors Orochi 4, but when deification or unity bombs were done in local co-op the enemies on the other players screen would freeze momentarily, though the other player was free to move about and attack. There were no framerate issues with the PlayStation 4 or Xbox One version and the two seemed comparable as far as performance is concerned. The Switch version looks fantastic in handheld mode but the lower resolution results in a noticeable graphical downgrade in docked mode. Aside from longer loading screens the Switch version seemed to perform comparably to other consoles. The Switch version can be played cooperatively with a single set of Joy-Cons so there is no need to purchase a separate controller, but the button remapping for using the shared controller scheme is awkward. Closing Comments:Warriors Orochi 4 is successful in maintaining the essence of the series while introducing new gameplay mechanics, making it a definite step in the right direction for the evolution of the series. The lack of additional gameplay modes is unfortunate, but that story campaign has enough content to provide a worthwhile experience on its own. Repetitive and mindless are words used to often describe these type of games, which are not inaccurate descriptions, but that is also what fans of the style have come to expect. The added magic attacks and unity bombs help make this entry feel unique among the countless other Omega Force/Koei Tecmo games while still maintaining what makes this type of game enjoyable. Warriors Orochi 4 is one of the stronger titles in Koei Tecmos extensive catalog of this style.", "date": "October 16, 2018", "grade": 4.0}