{"name": "Blue Reflection", "ref": "https://hardcoregamer.com/?post_type=post&p=273194", "text": "Adolescence, and in particular high school, can be a very difficult time in a persons life. In addition to all the physiological and psychological changes people go through, there is an increase in pressure being put in everyone as they take on more responsibilities and prepare for adulthood. This pressure comes from numerous sources such as an increase in expectation in academic performance, navigating the uncharted murky waters of dating, taking on a part time job, having an amnesiac person mysteriously appear in your room that forces you to go outside and make friends, dealing with the strange happenings inside of the Midnight Channel or traveling to an alternate dimension that is born from the collective unconsciousness of everyone in hopes that you rescue the fragment of someones psyche to save them from being destroyed by their emotions running rampant. This last extracurricular activity is the one that Hinako Shirai, or Hina for short, finds herself becoming involved in after a knee injury ended her tenure as a ballerina and steps into the role of heroine in Blue Reflection.Hina was a prodigious ballet dancer prior to her knee injury, a loss she is still coping with as she begins a new school year in a regular class. This injury destroyed her promising dancing career, but doesnt interfere with her traveling up four flights of stairs frequently for clandestine rooftop meetings. Two of her class mates, Lime and Yuzu, tell her to take charge of a cultural festival under the seemingly innocent reason of forcing her to make new friends. This is partly true, as these two are Reflectors and are aware that Hina just went through a bizarre experience where she first tasted her Reflector powers. The Reflectors are the line of defense against the Sephirot (no, not that guy) from bringing horrible destruction to the world, and sweeten the idea of Hina helping them by stating she can have any wish from the bottom of her heart granted once the threat is eliminated.Reflectors possess special powers and are able to travel to this alternate layer to reality called the Common, which is an otherworldly realm created by the collective unconsciousness of all people, and naturally have to change into skimpy frilly costumes when they visit with the first costume change featuring some elaborate magical transformation sequence complete with Barbie doll style nudity (a recurring theme throughout the game). In the Common, Hinas knee injury doesnt have any debilitating effect on her abilities and she is able to fight with some emotional based energy called Ether. Their absence in the mundane world is never noticed since time tends to freeze when these young ladies are off exorcising the Common. This is a land where they battle demons but also seek out fragments of peoples psyche when their emotions start to run rampant. People in the mundane world can go into a state of crisis when their emotions go rampant which can destroy them if not addressed. When the trio of Reflectors go into the Common they need to find the fragment, and perhaps take care of a certain task like defeating a certain demon. Once the fragment is found Hina needs to go through an epiphany in order to empathize with the individual they are trying to save, and identify what the real emotion is (i.e. it appears to be anger, but is really fear). Once this is completed they return to the real world to discuss their feelings and become friends, and after giving them a friendship ring they can be called on to assist in special battles.Blue Reflection is divided into two sections, being at the school in the real world or being in the Common. Most of the real world is spent at school, where Hina explores the school, talks to other students and plays on her smartphone. In her smartphone she can chat with other students or play a monster nurturing game called Dark Cave. If Hina can pull her head out of her apps she can talk to other students which can lead to going in the Common if they are entering a rampant emotional state or strengthen her friendship with them by correctly answering a question or doing an activity like going to karaoke. At the end of the day she goes home and prepares for the next day by either studying or taking a bath. It has a bit of a Persona like quality to it where how she spends her free time can affect her relationships or perhaps the events of the next day but is a simplified version of it. There are a lot of cutscenes in Blue Reflection, particularly outside of the Common, and while these arent bad more time is spent watching cutscenes than playing the game. Even the chats in the smartphone dont allow the player to give input, they simply watch Hinas responses scroll on the screen.The Common is where the traditional RPG elements of gameplay come into effect and transport the player to landscapes that are not of this world. Enemies are visible on the map and when engaged things shift to turn based combat. Combat in Blue Reflection is the typical formula one would expect from a JRPG with basic attacks combined with support skills and special attacks that require using MP. Overdrive can be used when the Reflect gauge is charged enough which allows a character to take two different actions during a turn which can help shift the tide of battle, and there is a timeline at the top of the screen showing the attack order to help plan out the strategy. Most battles occur in the commons except for when they battle a Sephira, singular form of Sephirot. Time is frozen so the regular citizens are oblivious to the Godzilla sized demon wreaking havoc on the world, but a unique feature of these battles is the other girls that Hina has befriended can be support characters in the battle and deliver a status buff, extra attack or heal the party.Characters dont gain experience points or level up in the traditional sense but instead gain ability points when they achieve certain objectives, and after the point is spend on an attribute like Attack, Defense, Support or Technique the character will gain a level and all their stats will increase, though the attribute they select will get a bigger boost and raising certain attributes will unlock certain abilities. The player collects various items and after a certain point the crafting menu opens up, allowing the player to create items or augment the fragments to increase their stats or unlock new abilities. As Hina completes her days and completes story objectives the game progresses through a dozen or so chapters. Most of the missions in the Common are on the shorter end of things and after playing through a few chapters the brief missions interspersed between the long cut scenes do start to feel repetitive, and the emotional conflict going through the affected character is only really explored on a superficial level.The story and game design of Blue Reflection is simultaneously its greatest strength and weakness. Working the idea of being an empath into the protector of the world from the Sephirot is an interesting idea, especially with Hinas current predicament with so much of her self identity and reason for getting out of bed taken from her. Forcing her to grasp the feelings of other people in pain, especially those who have angered or irritated her, forcing her into understanding herself along with being able to empathize with the other individuals through her own self reflection. It shows that this quest can potentially lead her to a lot of personal growth and self understanding while making new friends. The shortfall is in how little control the player feels they actually have. Most conversations where an answer can be chosen there are two choices and one answer seems to be the extremely obvious right answer. The cutscenes are effective at advancing the story and showing Hinas relation to the other characters but they are used so heavily it feels that Blue Reflection is more of something that is watched than actually played, which is a criticism that also applies to watching the conversations unfold in her smartphone instead of actively taking part in them. Overall this is an enjoyable game and they tapped into a good idea by trying to show the connectedness the main character has with the other girls at the school but this is an idea I would have liked to see them go deeper into.Closing CommentsBlue Reflection provides a unique twist on the JRPG format. Having the protagonist reflect on her own feelings of loss while trying to gain insight into other characterss feelings in order to acquire their friendship is an interesting idea. The problem is the game doesnt delve deep enough into this territory, and while this is a great design concept, it could be so much better if they took the idea further and added more depth to the characters. The mix of the real world with the Common is a good blend of environments and the gameplay in both is enjoyable but the time we spend in the Common exploring and fighting demons feels disproportionately short compared to the massive usage of cutscenes. Despite these criticisms, the overall experience of Blue Reflection is enjoyable even if it does rely heavily on yuri tropes. The high school setting, particularly what the player does in their free time and tries to befriend the other students feels like the developers took some pages from the Persona 4 book and mixed it into the Nights of Azure Atelier.", "date": "September 26, 2017", "grade": 3.5}