{"name": "FIFA 18", "ref": "https://hardcoregamer.com/?post_type=post&p=273276", "text": "Last years FIFA was an experimental entry for the storied soccer series to say the least. Featuring a transition to the Frostbite engine and an all-new single-player campaign, FIFA 17 represented a turning point for the franchise as it pushed forward alongside other sports titles in the current console generation. After such a big breakthrough for an annual franchise, the resulting follow-up the next year often tends to be a bit less ambitious, resulting in a similar or occasionally stale experience that some who bought last years version may consider passing on. While most of FIFA 18s modes do fall subject to this expected downfall, the substantial refinements to the gameplay as well as the continued focus on authentic presentation helps keep this years FIFA feeling fresh and fun.Now that FIFA has made the successful conversion over to Frostbite 3, the developers have been able to expand upon the possibilities that the new engine has to offer in regards to gameplay enhancement. The overhaul to the games animation system benefits the fluidity of each match, as users now have more control over the movement and dribbling of each of the players on the field. While some of the collisions between players can still feel somewhat wonky, most of the interactions come off as substantially more natural, leading to less confusion as to the result of any direct challenges from the opposition. Although FIFAs massive roster from players across dozens of teams is once again impressive, the minor differences that each player is designed to offer often gets lost in the heat of the moment, leading to matches that can feel rather similar to play out even if the end result is different. Nonetheless, the core action at the heart of FIFA is as deep and entertaining as its ever been, with enough improvements to warrant a second look from returning players.Following in the footsteps of fellow sports series NBA 2K, FIFA 17 presented players with a single player mode known as The Journey, which followed the early career of Alex Hunter as he attempted to secure a position in the Premier League. This year, The Journey features the return of Hunter as he continues to garner international popularity, leading to increased success as well as newfound drama as he struggles to maintain his relationships with his family, friends and teammates. While the story is often well-written and performed, particularly by lead actor Adetomiwa Edun, the events on screen arent often all that interesting or engaging, resulting in only a minor amount of motivation that arises from the central narrative. The more intriguing motivator ends up being growing the skills of Hunter, as he acquires new abilities and enhances old traits, regardless of whether the player decides to specifically control Hunter or maintain their grasp over the entire team during matches, as well as local multiplayer, a choice that does wonders for spicing up the constant flow of games. The constant repetition of matches, practices and cutscenes does little to benefit the overall experience, which is disappointing when comparing FIFAs campaign to that of other sports titles.In addition to the standard local and online exhibition matches, FIFA 18 brings back the ever-popular FIFA Ultimate Team and Career modes. FUT represents the more captivating of the two, featuring a bevy of various styles for players to compete in, by themselves or with one another, including the all-new singleplayer squad battles, which provides a near-endless amount of fictional team matchups to compete against. The microtransactions remain as present as ever, although they never feel too overwhelmingly necessary thanks to an informative post-game rewards summary. The Career mode offers differing experiences thanks to the option to partake as either a player or manager, but for the most part, the offering feels fairly similar to years past, as the added voiceless cutscenes do little to improve the ongoings in any major ways. Both modes could stand to benefit from a refined menu system, especially in regards to roster maintenance, but each mode offers enjoyable ways to continue engaging in FIFA matches.As has become a key facet in recent sports titles, FIFA 18 does an astounding job of providing an authentic presentation for each match, from including over fifty real-world stadiums packed with small details and energetic crowds to adding different overlays in the broadcasts to reflect international telecasts of the popular sport. While there are a solid amount of announcers, their arsenal of lines to choose from often seems small, with quips frequently being repeated even within the same match. Meanwhile, FIFA 18s soundtrack doesnt include many well-known artists or songs, but it does a solid job nonetheless of supplying a pleasant set of tunes while sorting through the various menus. No major glitches or framerate issues were encountered during our time with the game, plus the graphical fidelity of this years FIFA is only a minor improvement on last years already stellar visuals.Closing Comments:FIFA continues to show no signs of slowing down its dominance, as this years title further enhances the consistently enjoyable gameplay thanks to improvements to the on-field animations and varied, but realistic presentation. The core modes could have been better off with a similar amount of enhancements, particularly FUT and Careers reliance on an unnecessarily complex menu system, but as a whole, FIFA 18 will once again reign supreme as one of this years most accessible and crowd-pleasing titles both in and outside of its genre.", "date": "on September 25, 2017", "grade": 4.5}