{"name": "WRC 7", "ref": "https://hardcoregamer.com/?post_type=post&p=273192", "text": "Like most global sports, rally racing has found itself represented in the World of contemporary games by two primary, long-standing series. Where Codemasters acclaimed DiRT games intention is to draw in larger swathes of players and resulting crowds, developers Bigben Interactive & Kylotonn Racings joint venture with the official World Rally Championship series  or WRC for short  has often favoured the rigour and raw feel of the sport. Satisfying deeply-embedded enthusiasts, and thats about it. Not to say that the series has faltered on its ongoing quest to get closer and closer to the real thing, but outside the licensed brands and subtle tweaks to in-game physics, is there anything that this years outing, WRC 7, inherits to suggest this game can be enjoyed by more than those following the sport?Surprisingly so, is the short answer. The longer, more thorough and conclusive answer  much like the games fifty-or-so collection of dirt, tarmac and snow-surfaced courses  depends on how willing its players are in investing themselves with the way WRC 7s tracks are both structured and orchestrated. Orchestrated in a way intended to trip players up when they least expect it and demanding of the utmost attention from the word go. The WRC series has never really been favourable to those making their debut in the World of rally and/or motorsport and that aspect sadly isnt that much different or unhinged here. The learning curve, to some, uncomfortably steep, the best piece of advice for any newcomers is to not stand so surprised at finding your early few races tainted by a near-last place finish or a severe lack of grip with the games more-authentic approach to car handling.Whether its tackling a sloping, bumpy straight or a slew of sharp corners, WRC 7 is a game that is quick (very quick in fact) to punish those who come in with an arcade-style line of thinking. This despite the ability to instantly switch driving controls from full manual to semi-automatic and vice versa. Though its highly recommended to stick to semi-automatic if you dont want to end up imitating a crab  having to factor in acceleration, braking and the changing of gears all while controlling the actual car itself. Yet, even on the lower difficulty settings  and with semi-automatic mode changing gears for you  WRC 7 rarely gives its player the same levity or leeway to trip up and still come out of it first in timing.Theres nothing inherently wrong with this approach, primarily because the general handling and lofty amount of risk on offer  especially in the games more perilous and winding of courses, least of all when a fair few number of hair-pin corners and sharp descents are factored in  is in itself an interesting and thus enjoyable conundrum to figure out. Managing ones speed, deducing when best to brake when tackling sharper cornering (even using it to make effective sliding turns especially), even keeping the car on the track all the while avoiding the ample number of environmental hazards on show. Though the handling may differ depending on whether the course surface is dirt, tarmac or snow  not to mention the change in weather as well as subtle difference with the in-game car roster, differing models better suited for acceleration or turning for example  WRC 7 may come off as unfairly foreign or misconstrued to the wider demographic, but given time, its an entertaining distraction from the regular comfort of traditional arcade-style controls.Whether you hop into simply one quick race amidst one of the games thirteen globe-trotting regions or in fact go one further and aim to take on all four courses at one time  which comes in the form of the new endurance-styled selection that can last anywhere up to twenty minutes and does genuinely come off like a challenge of ones endurance  finding yourself weaving in, out and even in-between locales that can go from off-road to a small village and back again does garner a simpler pleasure and bring to light the odd mix of spectacle and gameplay challenge that these tracks often entail. Marked purely on the games main content, its cars and courses, WRC 7 does at least maintain that same pedigree of welcome anxiety  flaunting ones confidence at doing well, all the while that one small hump in the road not far from costing you a hefty few seconds. And even a time penalty if youre not careful.But of course the game is more than its mere stand-alone racing  be it offline or competitively with another player  which brings us to the designated Career section and as a result, the part where WRC 7 really falters in its quest to feel like a meaningful package. The idea is essentially that, starting off as a rookie driver, your aim to is to climb the professional order by way of signing contracts with one of many rally teams  each of which possess a car with strict statistics, play-styles and their own means of progressing further in ones career. Unfortunately not only do these teams lack any severe degree of individual personality and character  outside of a simple palette swap in the modes in-between garage/press areas  the career aspect comes across as severely lacking in its attempt to bring in management/sim-style mechanics. And while you will frequently be required to keep tabs on the condition of your car and deciding how much time you spend repairing your vehicle, making sure not to go over the allotted time and thus incur additional penalties, the peril and potentially hard decision-making never really materialises or feel that detrimental to ones career.WRC 7 even tries to simulate too the need to appease both the team and the media with its team-based optional objectives and the fact news/social media snippets appear on-screen from time to time. But it all comes off as mere window-dressing, helped in no way by the fact the very text is far too small to be considered important but more pressingly, how dispensable and even forgettable these supposedly critical and tactile of moments feel. Regardless of whether you manage to meet the demands and objectives laid out by your team  outside of a few mood sliders here and there, as well as the aforementioned media aspect which ultimately feels rather tacked on  though the challenges present do spice up races from time to time, the immediate result and/or fall-out of your success/failure generally lacks in its impact, meaning the games Career is but a shell of what it could be. Merely another mode to bolster the content.Closing Comments:If you needed proof that some games end up putting out what you yourself put in, WRC 7 is likely the closest the series has gotten into successfully drawing in the more casual players, all the while maintaining the series raw and challenging simulation edge. Those looking for an in-depth and sizable career mode or single-player campaign though may have to look elsewhere as outside of the change of visuals and rather simplistic management mechanics, theres little to suggest WRC 7 is brimming with such content. As foreign an affair the gameplay might feel and how steep a learning curve it initially projects, Id be lying if I said players wont find themselves mustering up the urge to play that little bit more, even after finishing in a dismal ranking. The majority of that is down to the effort put into crafting both the visuals and the sounds present, not to mention the all-round feeling that yes, you can and most likely will get better. Thus, through the risk: reward design that is its fifty-plus courses, WRC 7 does enough to instill many a repeat play, if not a longer-lasting flair.", "date": "September 25, 2017", "grade": 3.5}