{"name": "Project CARS 2", "ref": "https://hardcoregamer.com/?post_type=post&p=272898", "text": "Slightly Mad Studios live up to their name with the Project CARS series. A backbreaking package featuring a ton of lovingly rendered vehicles to race across multiple disciplines, realistic handling models and true-to-life representations of the tracks complete with astounding weather effects, its a wonder if anyone on staff gets more than an hours sleep per day considering the fact that the team is relatively small. The ambition paid off with the first title, an ever expanding package that could slake the thirst of anyone with an interest in rubber on road. It was a fantastic experience with a feel all its own. Now the studio has returned with Project CARS 2, promising a host of tweaks and improvements to improve upon an already stellar product. It biffs a couple of corners along the way, but there is plenty to be excited about.Fans of the previous game will be the first to admit that the career mode needed quite a bit of work. The menus and progression were a bit too confounding for someone that just wanted to take on the next challenge. It started to make sense with time, but the destination mode ended up becoming quick races. Slightly Mad has made great strides to improve it here. The familiar grid styled menu system is in place, but creating a racer and getting on the track feels much more streamlined. The ability to start fresh and choose from multiple tiers across the various disciplines in a clean, easily understandable way means that Career no longer feels as cumbersome. Were this all that were changed along with new tracks and cars, it would have been enough to declare this a must buy.Tweaks have been made to the handling model, as well. Previously, it took tons of practice to be able to reliably win races on a game pad. (Not everybody can afford a nice wheel.) That is no longer the case. While each vehicle still handles differently and will require a couple of practice laps to get in sync with a new conveyance, using the analog stick felt natural for steering these monsters around the track. After becoming acclimated, losing control of even the most temperamental vehicle was truly the fault of my overzealousness. The level of handling conveyed via subtle screen shaking, sound, and excellent use of controller vibration (something I usually dont even notice these days) dials the player into the zone in a manner that is fascinating. For example, the wife asked me a question yesterday and I broke concentration with the screen. Going off track, I could hear and feel just how badly I screwed up before I even looked back. I knew how far gone I was. This level of quality is, frankly, stunning. Its not that the player will want to look away very often, anyhow. This is a gorgeous game. The level of detail in the vehicles almost allows one to smell the heated rubber, while the laser scanned tracks feel authentic in a way that studios with much larger teams havent quite been able to pull off. Light and shadows play together in an enticing way, and even the crowds of onlookers look more natural than expected when glanced at. The true graphical standout comes in the form of the weather system. This game uses all four seasons, and the developer made sure to take advantage of it. During one race, it was advised that a rainstorm was coming in rather quickly. Before long, the first drops and dribbles came sprinkling down, gradually turning into a full fledged track soaking. The track went from dry to accumulating puddles that gradually grew in size as the race went on. Lap after lap, these pockets of water went from something fun to splash through to hydroplaning hazards that required care. Then there are the snow scenarios, which almost causes the player to feel a bit of a chill. I can not think of another game that uses weather so well while looking so good.Effort was also made to teach the casual racers a thing or two about the cars themselves. In games like these, tuning a vehicle to exacting specifications for the players driving style is incredibly important. It can also be daunting. The developer was kind enough to provide an engineer to give advice. Basically the player pops in and states a problem, such as wanting to accelerate faster. The engineer tells the player exactly what to do in short, easy to understand sentences. Its a perfect mixture to appease veterans while easing in the casuals. As someone who tends to stick with the stock settings for fear of really screwing the pooch, this feature is extremely appreciated. While the career mode is massive, with championships and accolades to win, manufacturer affinity to earn and multiple styles to master, Slightly Mad is also looking to up their game on the multiplayer side of things. They have managed to do so with ample stat tracking, race modes and a user friendly interface for race creation. Swapping through the variables works seamlessly, allowing whatever horrible use of a narrow track covered in slickness the most deviant and evil racer can conceive. There is an obvious desire to build a large eSports community around this title. While that will depend on the community itself, all of the tools to handle it are already in the package.With all of the well deserved praise to be heaped upon a title as ambitious and accomplished as this, a couple of issues pop up. The most egregious is the race director. These races each have rules to follow. So, if a player were to decide to skip an S curve by driving directly across on the grass, and slide ahead of the saps who followed the track, moving from fourth to first place, the director pipes in and tells the deviant to get back into fourth place within a short amount of time or be forced to take a penalty pit stop. Same goes if the player is in a clean race and decides to sideswipe a competitor into a tree (I may have some road rage issues). This is understandable and actually a cool feature that forces the player to improve based on the rules. Should that same player be passing a competitor on the inside with plenty of distance only to have the competitor veer off course specifically to ram the passer, however, the innocent player should not be given a penalty. Same goes if Ive, I mean the hypothetical racer, has managed to pull far ahead of the pack, stay on the road and drive smoothly only to be slapped with a punishment for some unknown infraction. Look, Race Director, I didnt know that was your doughnut. Sometimes, we need to just let things go Theres also a matter of the racing lines. Yes, these become less important as the player gets a better feel for the vehicle and track over time. However, when first learning it, this is an invaluable tool for proper cornering in most games. This can be a bit of a prankster in Project CARS 2. It loves to advise the player to go in way too hot in a turn, forcing the occasional major error. Other times, it errs on the side of caution a bit too much. The latter is forgivable, as this is meant to be more of a training tool, and the experienced player will have a better idea of what they can really do. Being told that the speed is fine, only to find oneself enjoying a tour of the grass can be frustrating, though.The final odd thing comes in the form of the cockpit view. This is one I feel will be a problem localized just to me, but there is something off about the field of view in cockpit mode. There are two different view modes for being inside the vehicle, but neither felt natural. As someone that prefers this perspective in racing games, it was confounding that neither felt usable in the normal sense. I ended up using a hood mounted cam most of the time, except when things got overly crowded with other racers. There, I went with a behind the car view so I wouldnt accidentally earn an infraction that I deserved. It was a simple matter to switch between the two, and its not a game breaker, but Im disappointed that I couldnt use the cockpit, as the visual representations of the different cars in that mode are spectacular. Closing Comments:Despite the Race Director that has it out for the player, and some issues with perspective in cockpit view, Project CARS 2 is one of those games that can fill an entire niche on its own. The expansive career mode will eat up the time, quick race will allow for a wide variety of variations and multiplayer is set up to be the perfect destination for the gearhead. Being a realistic racer thats welcoming to the neophyte is an accomplishment in and of itself. To do this on top of the sheer variety of gameplay that this title has is laudable. Project CARS 2 might very well be the best simulation racer on the market.", "date": "Bohn on September 21, 2017", "grade": 4.0}