{"name": "SD Gundam Battle Alliance", "ref": "https://hardcoregamer.com/?post_type=post&p=426811", "text": "Recently, getting a good Gundam premium action game in the west has been too difficult. Lets be honest here: Gundam VS looked alright but was annoying to play. New Gundam Breaker was marred by terrible controls. To be entirely honest, the last truly worth Gundam action titles that felt decent to play were the Dynasty Warriors Gundam titles, and that owes more to OmegaForce being squared away with the engine than capturing what makes the zippy suits unique. SD Gundam Battle Alliance comes close to filling that void, though, giving us hope that the perfect one will come.As far as plot goes, developer Artdink did what they could. They obviously had a goal of acknowledging and paying service to fans of the various timelines and universes in the Gundam pantheon, so they went with the old multiverse trope. A nameless pilot and their navigator is plucked off the Odessa battlefield (from the original Mobile Suit Gundam) by a mysterious AI. Turns out, the barriers between the universes are wearing out, causing breaks in the timeline to occur. The earliest example is Ramba Ral in his Gouf disappearing from the battlefield and being replaced with the Barbados from Iron Blooded Orphans. Its up to our nameless pilot to battle these anachronisms to gather the data and slot them into the correct timeline. This is all shorthand for we didnt want to leave any series out.Honestly, its not the worst way to go. In fact, the game offers a good overview of each universe for players who might follow one timeline, but havent dipped into others. The short movies in the library section serve as a great introduction to different series. For example, I am familiar with the Universal Century timeline from the original series and its sequels/prequels/spin-offs. Dont ask me about the After Colony timeline that Gundam Wing calls home. The problem with the story is that massive amounts of exposition occur during gameplay, and the dialog wasnt translated. The player needs to choose between understanding whats happening in the story or whats happening in the gameplay. Gameplay has to win. There are over sixty suits to unlock, which means that a fan is likely to find a favorite, or at least a root variant of a favorite. Each of these suits have a different feel to them, with some being faster than others. Each of the suits will either be tuned to ranged, melee or balanced combat. In practice, ranged suits tend not to be as useful as the other two styles. Enemies have a tendency to rush the player and their companions, so the additional melee and hit point power of the Infighter class is typically the best fit.Therein lies the real issue. Ranged tends to only be useful for getting a few cheap shots in before the distance is closed, leaving the player with melee. Played normally, melee offers a standard three hit combo for normal attacks and a special attack that can close distances or launch a foe. To keep the flow of battle going, its supposed to be a simple matter to spending boost to extend a combo and refill energy to keep going. In practice, this seemed to occur a fraction of the time, and I could never quite figure out what I was missing. This left the combat feeling more stunted and lacking rhythm than the developers intended. Alternatively, breaking an enemys combo worked as expected. When it didnt, I could see why. Since these are supposed to be linked to the same meter, I cannot tell if theres misunderstanding on my part, or if something was explained poorly in game. These complaints dont ruin the whole thing, though. Despite failing to chain attacks the way I would like in a Gundam battle, theres a ton of fun revisiting moments from the anime. While the mid-battle cutscenes can sometimes be rough, with texture pop in, they typically do a great job of introducing a frightening baddie that has been warped to the super deformed state, giving the military drama a lighter heart. Finding the blueprints for the suits and unlocking them makes for a fun time. With the mixed up timelines, the player never knows when theyll stumble across a favorite to use.These suits truly do serve as the highlight of the game. Each can be upgraded in four different categories: HP, Boost, Melee and Ranged. Upgrades are purchased using cash found in levels. Theres also parts that can be slotted in to boost a units strength or shore up a weakness. As the upgrading goes on, the units level will increase, reaching a soft cap that can be broken. All of this is to say that if a player finds a favorite, there are ways to continue using it throughout the game, even if other suits discovered later are better on paper. Artdink tried hard to not get in between the player and their favorite suit, and its much appreciated.Speaking of playing to the fans, the sound design is the best Ive heard in a Gundam game. Utilizing tons of music from the original series, as well as authentic sound effects, the developers tried to make this a nostalgic experience, and it was mixed together well. Graphically, it doesnt hit the same highs. This is likely due to the range of hardware that the game launched on and the developer opting to try to have the same experience on the Switch that they would have on a PlayStation 5. Closing Comments:Earlier in this review, I mentioned Ramba Ral and his suit, the Gouf. If you understood the reference, then SD Gundam Battle Alliance was made for you. Its got a ton of content for the fans while mixing things up so that its not a rote playthrough of the same storyline again. Its not a perfect, but its closer than Ive seen in a long time. For the Gundam curious looking for a robot action game, this isnt a terrible entry point, especially considering the library does a good job introducing the player to a series. As it doesnt quite scratch the itch for a general Japanese mecha through its combat mechanics and gameplay, however, SD Gundam Battle Alliance should only be considered within the confines of its source material and those who have no interest in Gundam can skip it.", "date": "Bohn on August 31, 2022", "grade": 3.0}