{"name": "Marvel vs. Capcom: Infinite", "ref": "https://hardcoregamer.com/?post_type=post&p=272257", "text": "With a few key exceptions, most video games that attempt to include characters from multiple franchises tend to be one-offs that are mediocre at best, with the thrills that result from unique characters interacting with one another not being able to sustain the often second-rate gameplay and thematically-conflicting story. One of these crossovers that has managed to stand the test of time is Marvel vs. Capcom, which has been pitting beloved comic book and video game characters against one another since the 90s. The franchise has continued to evolve into one of the genres most noteworthy over the past two decades, and on the end of the series twentieth anniversary, Capcom revealed the franchises sixth entry, Marvel vs. Capcom: Infinite, at PSX. Despite new characters and the inclusion of a cinematic story mode for the first time in the series, Infinites shockingly small amount of modes and depth puts a serious damper on this entrys enjoyability.Marvel vs. Capcom: Infinites story mode drops players off right in the middle of the action, as heroes across both universes have teamed up to take down the newly formed Ultron Sigma and their plot to rid Earth of all humanity. For those who havent paid attention to the marketing campaign, the first act of the story feels a bit haphazard as players try to ascertain just how these forces on both sides came together with no clear answers. While parts of the mystery feel enticing, it more often comes across as off-putting, and the lackluster dialogue does little to help, with the full potential of these drastically different characters interacting with one another instead being set aside for groan-worthy quips, obvious statements being shouted, and the occasional subtle nod. In the end, the story provides a moderate but disappointing amount of entertainment that is further held back by the frequent load times that separate the battles, which are an even mix of monotonous grunt encounters and more meaningful character battles. At the heart of any prominent fighting game is the gameplay that fuels all the various modes and scenarios, and Infinites mechanics provide a fun, if not particularly evolved experience. Featuring a return to two-on-two battles, Infinite allows players to take advantage of new abilities including Active Switches, which encourages players to constantly swap out their partners and further enhance their combos, and Infinity Stones, which can be activated to perform either quick, one-off abilities or more devastating limited-time attacks that can drastically alter the flow of a battle.The control system has been somewhat simplified from Marvel vs. Capcom 3, reducing the primary fighting buttons from six to four, but there are still plenty of simple and complex combos for players of all skill levels to attempt to pull off. The relatively small, but varied roster of characters all feel unique and well-designed, particularly in how their size both supplies advantages and offers counters to their opponents on the battlefield, as a well-played Rocket Raccoon could easily take down the much larger Mike Haggar with some strategic planning and execution. While the core gameplay may have a considerable amount of depth, the modes offered clearly lack any sort of extra thought or effort. In addition to the four-hour campaign that has no real sense of replayability, theres also a training arena, a Mission Mode that acts as more of an extended tutorial for each character than the name implies, and standard Battles, where players can participate in an extremely straightforward and flair-lacking arcade mode, as well as local and online fights. There are a few different ways to participate in online matches, including a Beginners League to entice rookie players into playing ranked matches, but they lack any sort of gravitas that would make these matches feel any different from the average battle and keep players coming back for more.In the period leading up to Infinites release, the fighting games graphics garnered a reputation around the internet, particularly for the faces of characters including Chun-Li, among others. While there are no longer any characters that stand out as particularly malformed, the graphics in general are rather mediocre, as most characters lack any sort of in-depth details to enhance their reputation, and the backgrounds, with a few exceptions, often remain static and dont react to the chaotic battle going down on screen. Although each character does have their own unique theme music, the standard matchs soundtrack tends to have a more Marvel-esque flair, with booming sound and grand instruments that instantly call back to any one of the heroes big screen themes. Infinite does do a solid job of making a usually inaccessible genre more easy to get into, as the aforementioned simpler controls and Mission Mode will help ease new fans into the complex action.Closing Comments:Marvel vs. Capcom: Infinite continues the franchises tradition for packing a punch with its depth and replayability, but the lackluster campaign, abysmal secondary modes and middling presentation do little to help justify the full-price tag. Those dedicated to the series and genre will likely be pleased with what the latest entry has to offer, but those outside the bubble would be better off waiting for a bigger roster, and hopefully, updates and additions to the current offerings.", "date": "on September 18, 2017", "grade": 3.5}