{"name": "Monster Hunter Stories", "ref": "https://hardcoregamer.com/?post_type=post&p=271788", "text": "When people bring up Monster Hunter, they usually think of fast-paced action with huge weapons trading blows against gigantic monsters. Monster Hunter Stories meanwhile is a much lighter approach for the series, tossing out the realistic look in favor of a cel-shaded cartoony look and a turn based battle system. Instead of a focus on merely hunting, Stories gives the series a look at the world by opening it up for players to explore. While players will still be fighting, gathering and cooking meat on the grill, Stories manages to take it in an entirely new direction without losing the dedication to the main series that has made them such well-loved titles.Monster Hunter Stories follows the journey of a young child that the player customizes from a village known for having riders, who unlike the hunters, befriend monsters and watch over the balance of nature. This character, along with friends and villagers, discover a mysterious force known as the dark blight has started taking over monsters and spreading throughout the land once again. Its up to the players character with the help of their monster companions known as monsties to explore the world and discover what exactly is causing this blight. Alongside the hero is also a strange felyne by the name of Navirou who assists by acting as the voice of the main character in most cutscenes, narrating battles and giving players tips on how monsters are likely to fight. While many of the plot points throughout Stories are predictable to anyone familiar with RPGs, it still has a light-hearted story players will be able to enjoy regardless of age.Like the main series, Monster Hunter Stories revolves mainly around its combat. The main combat is a rock paper scissors setup using Power, Technique and Speed. If players get into a head to head with the opponent, shown by a red line between them and the monster, they must try to choose the right attack to counter what the monster uses. Monsties will choose their own attacks that players have no input in, but they can tell their monstie to use a certain skill if they have enough kinship, which acts a bit like mana. Monsters and monsties will also randomly get into battles with one another that require players to quickly tab buttons or use rotate the circle pad, but when successful deal a great amount of damage. Every attack on the opponent will fill up the kinship gauge a little bit on the bottom screen and when completely full will allow the player to ride their monstie to deal more damage or pull off a devastating kinship attack. Players can also choose to use their rider skills which require some of the saved up kinship to pull off. These skills can be anything from attacks to buffs and some will change depending on the weapon the player is using, making for a good variety in battle.Battles can sometimes run long, due to the attack animations that play every time. Fortunately, players are able to speed up battles by 2 or 3 time depending on their preference and make repeat battles or grinding go by much faster. While Stories doesnt force players to grind to continue through the story, they will need to do a decent amount of fighting in order to stand a chance. If a player loses all their health in battle its not game-over yet, as each time health is completely lost the player will lose one of their three hearts. Losing all three hearts will restart the player back at town to pick up from where they left off. Luckily there are items that players can use in battle to regain hearts to keep from dying. Harder battles later in the story include challenging monsters that can give players a 1-hit KO if they dont have enough health or strong enough gear meaning some grinding, be it through quests or just fighting on the field, is required.There are four weapons players can choose from, which might not seem like many when compared to the fourteen seen in the main series. Fortunately, only having four weapons is plenty as theres still plenty to choose from. These weapons are great sword, sword and shield, hammer and hunting horn. Each weapon has its own combos that can be pulled off in battle for extra damage, or in the case of hunting horn a bonus effect. Weapons start out basic, but eventually players are able to craft weapons with elements and status effects they can bring into battle. Choosing the right weapon for a monster is important as each monster has its own weaknesses and resistances. Stories cleverly realized players might want to change weapons and armor frequently, so this can be done at any time when not in a battle instead of the more traditional Monster Hunter method of having to return to the players room to switch.As the main character is a monster rider, they will be tracking down more monsters to befriend both to simply collect all of and to help in battles. Monsters are found by going into dens, which appear randomly throughout the overworld. Once entered the players will go through a short dungeon with items and monsters along the way before finding the nest. Monsters will usually be found in these nests either sleeping or walking around, sometimes appearing after the player has gathered items or eggs in the nest area. After approaching the nest players can take back one egg, which is a randomly selected monster egg that spawns in the surrounding area. Monster eggs can be told apart by the pattern and color on the shell, but first time finding each one will likely be a surprise. Players can gather eggs multiple times before the nest runs out, and Navirou will do his best to chime in and give his opinion on the monster inside. He will comment on how smelly and heavy the egg is, with smellier eggs having better abilities and heavier eggs having more room to give the monster new abilities. Once players have made their pick they just need to leave the nest area and the egg is transported back to where it can be hatched.Not too far into the story, players unlock channeling between monsters. Every monster has ability slots, some which are filled and occasionally some that are empty. Channeling allows players to choose one monster to inherit an ability from another. These abilities can be elemental defense and attack increases, or even new attacks they wouldnt learn normally. This means if players find a monstie with a lot of available slots, theyll be able to give it even stronger attacks to help against monsters theyd normally be weak to in a fight. This channeling makes going out and collecting lots of monsties worthwhile, although the monsters with the most available slots wont be available until closer to end-game its fun to experiment with abilities early on to see what unique combinations work best.When not hunting down monsters players can take on the many subquests that include taking down monsters, collecting items or even finding certain npcs and delivering messages. While entirely optional quests often reward the player with additional skills for weapons that cant be unlocked in any other way, and are usually the best way to go about earning money as most can be repeated multiple times. There are also forge quests which act as the only method of crafting new equipment. These quests simply require the player to gather a few materials to make new weapons and armor. Instead of making individual armor pieces like in the main Monster Hunter series, players make the full set in one go. Weapons also no longer branch into others as they upgrade, and instead just get progressively stronger each time. Most gear also doesnt require many rare monster items, meaning grinding for parts is not a tireless task for the hardest to obtain drops.The visuals of Monster Hunter Stories make it one of the best-looking titles in the 3DS library. From gorgeous scenery and town settings to every character model itself, the title makes full use of the 3DS capabilities to create a bright, colorful world that truly looks in danger with the dark black and purple of the blight is seen in the area. The music is a high-point as well, with each area having its own accompanying song and in a welcome touch battle themes changing depending on what area the player is fighting monsters in. Those who enjoy using the 3D functionality on the 3DS will be pleased with the further amount of depth it adds to the world and characters.Closing Comments:For a spin-off that manages to change the core of what makes the mainline series so popular, Monster Hunter Stories does an amazing job becoming a stand-out title for the series. Theres loads to be discovered in Stories, with a perfect level of challenge for those who want to take their time or those looking to speed their way to the end-game content. While the story is simplistic and predictable, it still manages to throw in a few twists with plenty of good laughs along the way. Although it may seem most appealing to fans of the long-running series, there is plenty for any player to enjoy on their riding adventure through Monster Hunter Stories.", "date": "September 13, 2017", "grade": 4.5}