{"name": "One Piece: Unlimited World Red  Deluxe Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=271621", "text": "Of the vast library of last gen titles receiving a current-gen upgrade, One Piece Unlimited World Red might be one of the most surprising. Its secretly a decent game, yes, but its also not in the same league as something like The Last of Us or God of War. Still, the release came with great excitement from this reviewer. I played the living tar out of the Vita version and would gladly go through it again. With the Deluxe edition, though, issues that didnt show up in the previous version pop up here with a great grin upon their face and things that could be overlooked suddenly feel more important now.Anyone familiar with the One Piece series will say that its a show with drama, humor, action, and a real heart beating in its chest. Its also a series stuffed with more filler than a gelatinous lump of prison cafeteria meat. Entire seasons can go by with little affecting the overarching plot. So it is with Unlimited World. The tale here is brand new, with no impact on the series arc. However, the story told here is different from many of the filler episodes in that its actually good. Returning a newfound friend, Pato, home brings the Straw Hat pirates to a new island. In exchange, Pato promises adventure to the crew, which is an offer they cant resist. Soon after arriving, they are embroiled in the machinations of the villainous Redfield as he wishes to become the Pirate King. Since Red has the ability to create evil clones of anyone living or dead, he might actually be more worthy than other goofuses that have the same goal, but thats besides the point. The story told hews close to the feel of the anime and manga, and certainly feels like it belongs. Anyone that likes the series should play this.Theres no lack of content with which to engage either. Theres nine long-ish story episodes to enjoy, countless sidequests to take for money and experience, and nine playable characters in the main story. Fishing, bug catching, crafting, town expansion, gardening, a separate battle coliseum storyline and minigames galore abound. It really is a playground for One Piece fans that can take up twenty hours minimum depending on how complete the player wants the experience to be or how much they care about trophies. With that variety, the myriad flaws that come into play can be overlooked. They are still there, though. The biggest issue comes in the combat itself. Theres a limited amount of combos and moves to pull off, a fact that was apparent before, but wasnt as big of an issue played in bite sized chunks on a handheld. Luffie and friends seem to only have a handful of moves each, and each character tends to have one particular combo that proves to be the most useful. Some characters dont even get that. Just as in life, Brooks is pretty much completely useless. Quick swapping characters alleviates some of this tedium, but it is true tedium. Again, playing for a few minutes at a time while doing laundry or on a commute alleviates the problem.Theres also an issue with the camera. It now has a tendency to wig the heck out with no real cause. Look, Mr. Camera. Its a giant dragon and Im standing some feet from it. It should be a simple matter of putting us both into the frame. Instead, you seem to be more interested in finding out the gender of said dragon via extremely disturbing close ups. Its understandable, though not forgivable, if you were getting hung up on level geometry, but this is a large, empty room. I think you are a deviant, Mr. Camera, and not the fun kind. In the interest of fairness and comparison, I did pull out the Vita version and played through this scene again. That camera behaved. It probably doesnt creep out the ladies, either. Some problems from the original game still pop up here as well. The fishing minigame is still unbalanced, with multiple upgrades to the rod required to be able to reliably catch even low level aquatic life. Some of the quests are also akin to beating ones face into a brick wall, only to have the next be a cakewalk. Then there are the scratch cards. What should be a fun minigame is rather pointless as the coins required to scratch the spots are very rare indeed.This version does see some improvements, though. Running at 1080p and 60 frames per second, its incredibly smooth. There are no hitches or stutters in the port, which is a great. While the original didnt fall prey to this either, bad port jobs have happened, but this isnt one of them. In fact, it seems to have boosted movement speed. The hub town can be zipped across in little time due to the increased pace of Luffies stretchy rocket arm. This method of traversal really is noticeably faster when compared to the original release. Picking up speed during the dead spots during levels also appears to kick in sooner, allowing periods of nothing during a level to be bypassed with no issue. The Deluxe edition also packs every single piece of DLC from the original. For someone who skipped these last time around, this means more costumes along with some clever and unique quests to undertake. Closing Comments:I enjoy One Piece Unlimited World Red much more than our original reviewer. I love the story, building the town and taking on the challenges a bit at a time. It really is the perfect handheld game, even though it also originally released for PlayStation 3. The game in general is worth the time for fans of the series and someone just looking to play a lighthearted action/RPG. The tough part is deciding if Deluxe or the Vita version is the definitive entry. Each has their Pros and Cons over the other, not the least of which is the fact that the older versions have a lower price when compared to this gussied up version. One needs to choose if they want the complete edition or one with a less temperamental camera, if a higher framerate is worth the lack of portability. Of course, theres also a Switch version of Deluxe which has that benefit Im not quite sure where I land on that choice for myself, but this game is fun in any incarnation.", "date": "Bohn on September 12, 2017", "grade": 3.5}