{"name": "The Last of Us Part I", "ref": "https://hardcoregamer.com/?post_type=post&p=426886", "text": "Its difficult to imagine the gaming industry without The Last of Us. Naughty Dogs PS3 swan song left such an impression back in 2013 that players still talk about its characters and the ending to this day. The game also propelled PlayStation Studios along the narrative track, paving the way for hit narrative-based titles like God of War (2018), Marvels Spider-Man, Ghost of Tsushima, and Horizon Zero Dawn, among others. A sequel, The Last of Us Part II, arrived in 2020 with numerous improvements to the originals formula, though the original remains held in high regard. Despite being easily playable in its remastered form via backwards compatibility on PS5, Naughty Dog has opted to remake the original 2013 title into what they view as the definitive version of The Last of Us. Now dubbed The Last of Us Part I, does this remake capture the originals magic to justify its premium price tag or should it be thrown into a batch of Clickers?The Last of Us Part I is a one-to-one remake of the original 2013 title with most of The Last of Us Remastereds content and quality-of-life improvements attached. Boiled down to its fundamental core, youre getting the original campaign, the Left Behind DLC, some of The Last of Us Part IIs quality-of-life improvements and UI changes, as well as a complete visual overhaul. The Last of Us Part I takes place in 2033, twenty years after an outbreak transforms a significant portion of humanity into aggressive monsters called the Infected. Humanity lives in remote pockets, resorting to violence for survival. You play as Joel, a survivor forced into a hopeless world. That all changes when he meets Ellie, a young girl supposedly immune to the infection. Forced together out of circumstance, Joel must escort Ellie across the country in search of the Fireflies, the best last hope of finding a cure and ending this deadly plague.Back in 2013, The Last of Us was a masterclass in videogame storytelling, and though nine years have passed, the story remains just as thrilling and engaging as ever. The Last of Us Part I successfully recaptures that feeling of humanity the original title was able to illicit. Joel and Ellies growing relationship remains at the storys emotional center, with side characters serving as both positive and negative foils. All these years later, Troy Baker and Ashley Johnsons performances remain as riveting as ever, successfully giving life and emotions to their characters. The Last of Us Part Is story might be another zombie apocalypse story, but the characters, performances and writing continue to elevate this story above its peers. Nestled amongst the story is the Left Behind DLC, which remains a separate item and not integrated into the main campaign  serving as both a prequel and interquel. Left Behind focuses on Ellie before shes infected as well as filling in the gaps between the Fall and Winter chapters of the main game. Though short, Left Behind masterfully builds up Ellies character, and in hindsight, helps set up her character wonderfully for The Last of Us Part II.As good as The Last of Us Part Is story is nine years on, the simple fact is that this is a nine-year-old story that has been widely and readily available on PS4 and currently on PS5 (via backwards compatibility) for the majority of that time. So if youve already played The Last of Us, you know exactly what youre getting storywise. Its faithful to the original material, but the remake doesnt provide a compelling reason to return unless youre dying to relive the narrative or dont have access to the Remastered edition available in the PS+ Extra library.The faithfulness of the remake trickles down into the core design and gameplay systems. Simply put, if youve played The Last of Us Remastered, you should know what to expect. Like the original, The Last of Us Part I is divided into separate chapters with players guiding Joel and Ellie through murderous humans and creepy Infected. The game remains a third-person shooter survival title, with players deciding how to engage with enemies. Stealth and all-out-assaults, or mixing in elements of both, are viable options in The Last of Us Part I. Combat arenas are generally spacious and cater well to the different playstyles of The Last of Us. Dont expect to go prone or use different elevations to get the jump on enemies like in The Last of Us Part II. All weapons, equipment and available strategies are carried over from the original release.That isnt to say that Part IIs influences arent felt elsewhere in Part I. The menu UI and weapon upgrade animations have received upgrades more in line with Part II. The partner AI and enemy AI have also been given updates and tweaks, though wonkiness remains, including partners not following the right pathing and ruining stealth attempts. The enemy AI is improved and adds a level of variety and intensity to gunfights not present in older versions. Unlike the original, enemies in Part I will actively try and find ways to flank you, similar to Part II. Combat in Part I ends up being far more dynamic for these changes, and though it never reaches the same highs as Part IIs combat, it is a noticeable improvement over Remastered. Perhaps the best quality-of-life improvement to carry over from Part II is the accessibility options. The Last of Us Part I allows players to tinker and tailor the experience to ensure the game is playable for as many as possible. These were terrific options in Part II and its fantastic to see Naughty Dogs commitment to enabling gaming for everyone.Outside of those under-the-hood changes and DualSense features, The Last of Us Part I has no other updates or changes to the core design or gameplay. These updates bring it close to Part IIs experience without significant alterations. Still, one major omission stops this remake from being the definitive version of The Last of Us, which is of course the removal of the fan-favorite multiplayer mode, Factions. While Naughty Dog is developing a standalone Factions experience, losing the mode in Part I and offering nothing to replace it is disappointing. Its loss ultimately makes it difficult to claim this is the definitive version when The Last of Us Remastered remains more content complete.So far, theres not much that The Last of Us Part I does significantly better than The Last of Us Remastered. While the AI, UI, and accessibility improvements are outstanding, the core game remains the same except for losing Factions. The presentation, however, does change that for the better. The Last of Us Part Is visuals have been completely overhauled. While the bones of The Last of Us remain intact, textures, models and special effects have either been updated or completely remade to take advantage of the PS5.Everything in the game, from building facades to raging fires to character models, has been rebuilt with additional details. While it may not impress as much as an older title remade for PS5 like Demons Souls or a built-from-the-ground-up PS5 title like Ratchet & Clank: Rift Apart, the results are still mighty impressive, particularly when sitting the game side-by-side with The Last of Us Remastered. The result is a highly immersive, though still familiar, experience. The remainder of the presentation remains intact. Gustavo Santaolallas fantastic soundtrack sounds as good as ever. Meanwhile, the performances of each cast member remain as impeccable as they did in 2013 with improved facial and in-game animations adding additional layers to their performances. The Last of Us Part Is presentation is a massive facelift, and though it cant change the fact that what you see and hear isnt anything new, it looks at least remarkable.Closing CommentsRemaking The Last of Us was always going to be a tricky prospect due to how little time has passed since its original 2013 release. Go too hard on a reimagining like Resident Evil 2/3 and Naughty Dog would risk alienating fans of the original. Go too little on changes or new story content, and the studio would risk the project being called a cash grab. With The Last of Us Part I, Naughty Dog opted to create the definitive experience by staying as faithful as possible while incorporating some elements of The Last of Us Part II. The result is an impressive-looking facelift that exceeds the visuals of Part II, but doesnt offer much new beyond graphics. Complicating the picture is that The Last of Us Remastered is still readily available physically and digitally for a low price, or as part of the PS+ Extra library. The AI, UI and accessibility options are welcome quality-of-life improvements, but Remastereds continued playability alongside 4K and 60fps options showcase that they arent the end-all-be-all. Dont be mistaken: The Last of Us Part I remains the same excellent game that engrossed millions of players back in 2013. The story, performances and artistic vision remain impeccable and among the best in the industry. Even the gameplay and design, which Part II outclassed, remain fun and engaging despite showing some age. The Last of Us Part Is real problem is that The Last of Us Remastered exists and doesnt provide a substantial reason to choose it over Remastered given its pricing and missing content. The Last of Us remains a timeless classic, but The Last of Us Part I isnt quite the must-have definitive version of the title.", "date": "August 31, 2022", "grade": 4.0}