{"name": "A Robot Named Fight", "ref": "https://hardcoregamer.com/?post_type=post&p=270317", "text": "A Robot Named Fight may have an odd title, but its premise is solid. It combines a Metroidvania game with a roguelite in a way that manages to stand out from not only a Metroid or Castlevania game, but also games that combine those things like Dead Cells. Theres a lot of Turrican infused in the design and the overall look and feel is right out of the Turbografx-16  with a grotesque atmosphere that would be right at home in an early 90s arcade game. Its an interesting idea and one that combines several elements together shockingly well to form a game that everyone who enjoys a good action-platformer should try out.As Fight, you battle tons of disgusting organ-looking monsters that repulse and have destroyed much of your world. Youve got a basic blaster that can be upgraded with missiles, and much like a Metroid game, progress is determined by various doors. A basic door requires a single blaster shot, while other doors require either single or multiple missile blasts to open up. Enemies come at you from all sides and you can use the trigger buttons to lock yourself to either a diagonal-down shot with LT or a diagonal-up shot with RT. This enables you to not only have more freedom with your shots, but get the upper hand on enemies who can do more damage per shot while you get the high ground and blast away at them.Theres a bit of Turrican mixed in too where you need to be mindful of everything around you. While this game doesnt have dripping water damage, it does have random enemy bits falling off that can damage you slightly. This may not seem like a big deal, but when every death results in you having to restart your adventure, you start caring about every single hit that you take. Enemies dont drop a lot of health regularly, and the only way to fully restock your health in one go is to beat a boss. You can upgrade your health gauge, but cant rely on that at all times due to the game using randomly-generated level designs for each play session. That one key element to the design keeps things fresh  but also makes you a bit uneasy with each shot you take. During our first session, progress was zooming along. A boss battle was fought, the missiles were found easily, and then deaths door greeted us to a whole new world. Instead of a easy road, it was fraught with more enemies at odd angles and instead of missiles being easy to find, the slide upgrade was found. This allows you to go to new parts of the environment  la Mega Man, but can also leave you wide open to damage as you enter a room. One such area required a slide into the door to get through and led us right into a sea of enemies that nearly guaranteed a hit.Your reflexes have to be razor-sharp to do well in the game, and even with the benefit of using a blaster instead of a short-range weapon like in Dead Cells, you need to make the most of every shot. Enemies can respawn if you dont take out their host first, and that could cause you to take either needless damage or incur a few deaths before realizing whats going on. ARNF is a challenging game, but a rewarding one as well. It controls really nicely and PC-centric users who may not have played games like Metroid or Castlevania will feel right at home if they enjoyed ARES, Dead Cells or Shadow Complex Remastered. The use of the left stick to control takes a bit of getting used to  but not a lot, and having the jump and shoot buttons logically mapped to A and X helps things out immensely. The game is very easy to pick up and play, and its tough learning curve mainly involves being aware that everything in this game is out to kill you and not just get in your way. That isnt to say that its as hard as a modern-day Ninja Gaiden  but you cant expect to just blindly shoot your way to victory here. You have to be smart and think before acting, which also extends to solving small environmental puzzles as well. They arent going to be too tough  but you do need to know when blocks regenerate so you can properly climb them to gain access to old areas, or maybe even find a different path to a new part of the game.New weapons are added to the mix regularly, including a transformation ability that allows you to become a bug-like robot that moves around briskly and can still shoot with ease. Another cool one is a blast that basically destroys anything in your path  as long as its right next to you either above, below, or to your right and left. Its an effective attack and one that is very valuable when youre surrounded. The overall weapon selection is impressive and every play session is different thanks to the wide variety of weapon selection that will usually result in at least finding one new weapon during your journey. The overall button layout is nice and logical no matter what loadout you have  so you will always be able to remember things in the heat of battle without getting flustered. Visually, ARNF perfectly nails the look of early 90s 16-bit games without coming off as pandering. Its high level of detail for both the characters and backgrounds would have been right at home on a console alongside Splatterhouse  which this bears a few similarities with. Both games feature disgusting organic monsters that have a lot of ooze and viscera spewing from them. Its beautifully nasty though and while it wont be for everyone, it does get across the plight the in-game world is in. The sprite work is gorgeous and really gets across how desolate the world is. Fallen allies litter the world and you can see their sadness just based on their body positioning alone. Youre set up as the worlds only saving grace, and when you see how everyone around you has clearly given up all hope, it makes you want to do that much better for your next play session.With a Metroidvania pedigree, ARNF has a tough act to follow when it comes to music. Instead of going for something sweeping and epic, you get music that is somber, sad, and induces fear whenever possible. Unlike the original Metroid, it doesnt quite evoke isolation all that well  but you do feel a sense of dread when you hear the music shift and none of what you hear is outwardly happy. Its a sad tale and the games music reflects that perfectly. It isnt a soundtrack you will likely want to listen to for hours after playing  but is one that is perfectly-suited for whats going on in the game. Similarly, the sound effects are disgusting when they should be  with enemies splatting to their doom and leaving blood trails and spilled organs, which also make their own squishing noises. The sound design is outstanding on the whole and something that makes the adventure enjoyable despite the grim nature of the game. Closing Comments:A Robot Named Fight combines a blaster-centric Metroidvania with a roguelite and works wonderfully. It blends the sub-genre with a bit of Turrican, and much like that classic series, this one man game delivers the goods. Matt Bitners passion project is one of the finest Metroidvanias on PC and something that any action-platformer fan will enjoy. Its fast-paced, but strategic, gameplay requires you to stay on your toes at all times, while the impressive 16-bit-inspired graphics make it easy to be distracted because of how detailed they are. The ominous sound design makes you worry about every major encounter, while the overall package delivers something that manages to thrill and excite. Its a must-play for anyone who loves a challenge or who grew up adoring the TurboGrafx-16s off-kilter game library  this truly feels like it would have been right at home on a HuCard.", "date": "September 4, 2017", "grade": 4.5}