{"name": "Resident Evil Revelations HD Remaster", "ref": "https://hardcoregamer.com/?post_type=post&p=269651", "text": "The original Resident Evil: Revelations released nearly five years ago on the Nintendo 3DS. It was a solid attempt to return the series to its roots of survival horror, offering 3D graphics which made the game stand alone. Later, Capcom would bring Revelations to the other platforms including the Wii U, PlayStation 3 and Xbox 360. A game that was worth expanding its audience for, it lost a bit of its charm going to the other systems. Now the game gets a major visual upgrade with its release on PlayStation 4 and Xbox One. Every other major Resident Evil title in the last fifteen years has been released on these two systems, so why not this one?For the most part, Revelations takes place on the Queen Zenobia, an abandoned cruise ship in the middle of the Mediterranean. The story is full of terrorist plots and includes other characters, which takes away from the pace of the game. Suffering from Resident Evil 6 syndrome, the story bounces around between characters. The main game stars Jill Valentine and Parker Luciani as they investigate the cruise ship. Chris Redfield is also involved as players will take part in more action-oriented missions that eventually tie together. The good thing is that these other missions soon die off with the focus being on the ship. Revelations takes place between Resident Evil 4 and Resident Evil 5 on the series timeline.Whats great about Revelations is that return to survival horror roots. It features tight corridors, puzzles, special keys, boss fights, exploration and it feels like a true nod to the first few games. The new version on the PS4 and Xbox One features upgraded textures, 60 FPS and 1080p resolution. The player models, running on Capcoms MT Engine, look extremely detailed. The backgrounds got a boost as well, but not as much as the player models did. While the 60 FPS is nice, it takes away from the pacing of the game on the ship. It makes it feel like the players are moving too fast and it takes away from the sense of confinement on the ship. One of the aspects of Revelations that really stands out is the inclusion of the Genesis Module. This is something that was cool to use on the 3DS, but seems a little tasking not using the device. Players can scan areas and enemies for items and once 100% is accomplished, players are gifted health. This still helps with the exploration aspect as players can return to areas to check for more ammo or health. Players can also upgrade their guns with custom parts collected throughout the game.The popular Raid Mode carries over to this version, as well, offering an updated Ghost Ship map with more powerful weapons. Raid Mode involves leveling up weapons and pursuing through maps to gather supplies and take on enemies who have different variables. All of this while managing your ammo adds to a different and fun experience which may actually take players away from doing the story mode. Not to mention, this is online co-op. It also features unlocks and different selectable players to grind with. The controls in Revelations are tanky from a third-person, over-the-shoulder perspective. Players can do quick turns, dodge and melee enemies, but the inconsistency in pulling off dodges and melees can be frustrating. Its hard to tell when an opponent is dazed to pull off a melee, while dodges can be hit or miss when it may just be more beneficial to pull a 180 and run. Additionally, the knife actually proves useful as it is quick and effective when there is no ammo. Another aspect of the game suffering from Resident Evil 6 syndrome is the inclusion of the A.I. Every Resident Evil running on the MT Engine has featured an A.I. partner, and most of the time its utterly useless. Having this in RE5 was useful just because the campaign could be completed with a second player. Having it on a portable game with no co-op is just pointless. The A.I. does little to nothing to assist, and it doesnt necessarily steer enemies their way.The soundtrack is fitting in helping to set each chapters atmosphere. More hangover from this stage in Capcoms Resident Evil Journey is the bad Hollywood acting. Parker is ridiculously over dramatic and it just comes off as cheesy and takes away from the core element of the game. Seriously, when an epidemic and chaotic event is taking place, why is he hitting on a woman? If youve played the game before, youll probably skip most of the cutscenes and just cringe through the in-game dialogue. Closing Comments:Resident Evil Revelations was a step in the right direction five years ago, but has since worn out its welcome. The PS4/Xbox One versions are only retailing for $19.99 and include all DLC, but each generation its re-released makes it harder to recommend. Yes, the visuals are nice, but the 60 FPS hurts the pacing on a game that already suffers from story pacing issues. Directed by Koushi Nakanishi, the man behind Resident Evil 7, the game is enjoyable and features a undeniably spooky atmosphere, but at the end of the day, its a five year old 3DS game on its third life. If youve managed to avoid playing it this long, its worth the $20 price tag, but theres no reason to board the Queen Zenobia again for anybody else.", "date": "August 29, 2017", "grade": 3.0}