{"name": "Marvels Guardians of the Galaxy: The Telltale Series: More Than a Feeling", "ref": "https://hardcoregamer.com/?post_type=post&p=269163", "text": "Regardless of the medium, episodic storytelling has often struggled to find its footing in the first episodes of a premiere season, as the shorter nature of the chunks of plot leads to a sort of trial period, where audiences are asked to believe in the characters before the true direction of the plot is revealed. For every series that manages to overcome this dilemma and keep audiences hooked until that grand narrative reveal, theres another that is unable to sustain that level of interest, or even worse, gains the trust of audiences and then betrays that with some less-than satisfying plot choices. Telltale has encountered this type of drama several times before, with the added element of dealing with established characters from franchises that fans have come to know and love. Recently, the studios take on the Guardians of the Galaxy has been the latest series to deal with this hurdle, with the past episodes hit-or-miss humor and aimless narrative forcing the third episode to become a breaking point for the premiere season.While the remainder of the review will not address any spoilers for More Than a Feeling, important plot points from the previous episodes of the season will be discussed below. For more on the season so far, check out the reviews for Tangled Up in Blue and Under Pressure.Under Pressures finale concluded with an open-ended finale, almost embracing the feelings so far of a desultory style of storytelling that had been holding this season back. After a somewhat predictable opening sequence, however, More Than a Feeling finally shows the writing team at Telltale getting a proper grasp on this dysfunctional space family and, most importantly, their sense of humor. The strong cast of voice actors are, at long last, provided with a consistent amount of both heavy and lighter scenes that push forward both the plot and character development, most notably for the estranged relationship between Gamora and Nebula. Featuring some truly surprising reveals and some genuinely funny moments and quips, the third episode represents a breakthrough for Telltales take on Star-Lord and the gang.Its not all good news for More Than a Feeling, since despite the positive movement this episode makes for its plot, the gameplay has begun to stall and show its familiarity only a few chapters in. While the innovative mechanics implemented into the exploration parts of the episode remain as novel as ever, using them to accomplish eerily similar puzzles and tasks in eerily similar locations makes them feel wasted and repetitive. The universe of Guardians of the Galaxy is vast and varied, and Telltale constantly sending the player to space bars and ancient temples is getting hard to look past, even with the occasional referential snark from the squad. The soundtrack is starting to hamper itself a bit as well, relying more on past favorites over newer tunes that hopefully doesnt signify a lesser focus on these classic tunes for future episodes.Closing Comments:More Than a Feeling takes two steps forward and one step back, as the team at Telltale finally demonstrate their sense of direction for the season ahead in the most humorous and intriguing episode this far. The lack of diverse environments makes the gameplay seem less subtly formulaic than other Telltale titles, but the significant plot improvements bodes well for the remainder of the season.", "date": "on August 23, 2017", "grade": 4.0}