{"name": "White Day: A Labyrinth Named School", "ref": "https://hardcoregamer.com/?post_type=post&p=268634", "text": "For the longest time, tons of incredibly unique  and terrifying  Japanese and Korean doujin games were spoken of fondly by just a small niche. With unofficial or no official English release, it was tougher to enjoy some of the best these independent developers had to offer. White Day: A Labyrinth Named School is one such game which would be brought up on occasion alongside genre greats such as Yume Nikki and was originally developed by Sonnori way back in 2001. Despite its age, people loved what the game brought to the table. Its fame eventually spawned a remake for mobile platforms in 2015. The remake finally brought the title to other regions, including the US, but left much to be desired with a clumsy touch-based control scheme. Still, this sudden move to bring White Day: A Labyrinth Named School back yielded another benefit. With a totally remade version of the game out there, it could now be ported over to other platforms. Thats exactly what has happened as PQube and Arc System Works decided to go ahead with publishing it worldwide on PS4 and PC via Steam. As you might expect, this edition controls far better than on Android/iOS devices. It also features a bump in visual fidelity on both platforms. Anyone who played the original game will find that the remake introduces new scenes, reimagines ghosts, adds new endings and even brings in an additional character to the mix. Those entirely new to the experience should opt for this version as it is the definitive one (and easiest to get running on modern platforms). What exactly is White Day: A Labyrinth Named School all about? It begins with a sweet story. Protagonist Lee Hui-min is your typical high schooler  sweet, shy and in love with the popular So-young. As it is the day before White Day when the game takes place, he decides to sneak into the school to give her a box of candy away from prying eyes. For those unfamiliar, White Day is a holiday celebrated in Asian countries which is akin to Valentines Day. Unfortunately for Hui-min, this is probably the worst school on Earth to try and visit after hours. You see, the mysteries about occult events and mysterious deaths at Yeondu High School arent made up. There truly are copious ghosts haunting the halls!A few other unfortunate students also decided to sneak in on the same night for reasons of their own. So-young is also exploring, as well as Seong-a and Ji-hyeon. Each character brings her own distinct personality to the table once you encounter them. Although this is certainly far from a dating sim, the players interactions with each character will change how they feel about him. Some may grow to trust you, while others simply cant stand to spend another minute with Hui-min. Since horror games typically work better when the player is isolated, youll never end up spending more than a few minutes with the other students. Much more of the time is spent exploring solo and solving various puzzles.Ghosts arent the only enemy to contend with. Depending on the difficulty selected, they might not even crop up much at all to give players less opportunities for instantaneous death. There is one particularly insidious enemy which remains regardless of difficulty: the Janitor. As with everything else in the school, something is incredibly off about him. He doesnt simply shoo wayward children out of Yeondu High School or even detain them. Once he spots a student there after hours, he chases after them and beats them to death with a bat. Despite walking with a limp, hes capable of giving chase at an incredible pace. If you see his flashlight bobbing down the hallway, or worse, hear his warning whistle then your best bet is to run and hide immediately.Early on, White Day: A Labyrinth Named School provides a lot of freedom to simply solve puzzles at your own pace. Most puzzles are sensible and require searching out all objects in various rooms before unlocking a tip that reveals some potential next steps. Sometimes this includes using inventory items in different spots, and often requires backtracking throughout the school. Its only in the second half of the game that puzzle solving becomes tougher due to external influences. The Janitor and ghosts become truly annoying as both get in the way of pure exploration. Yes, its tense initially, but eventually becomes grating more than anything else.This is a total shame because the first half of the game is pitch perfect. The Janitors infrequent presence makes things tense without becoming overwhelming tedious. Puzzles require some thought but not incredible leaps of logic (for the most part). Yeondu High School itself proves a surprisingly realistic school setting with long hallways, tons of classrooms and an overall eerie vibe when shrouded in darkness. Learning the school layout is imperative, but fortunately the setting ensures that most floors are similarly designed. For a more authentic experience, players can even opt for Korean voice acting instead of the English tracks. Closing Comments: White Day: A Labyrinth Named School is in many ways akin to the horror games that flourished in the PS2 era. It features no option for players to directly attack enemies and emphasizes stealth to stay safe. This older style of horror makes total sense given the originals release in 2001. These trends have been creeping back into the mainstream, which makes this as good a time as any to release on PS4 and PC. Still, theres a real push and pull between wanting to love the game and finding it too annoying at points to proceed. Fortunately, the pros outweigh the cons and the journey into a haunted school is still worth taking for horror lovers.", "date": "August 22, 2017", "grade": 3.5}