{"name": "Uncharted: The Lost Legacy", "ref": "https://hardcoregamer.com/?post_type=post&p=268331", "text": "Those who played last years Uncharted 4: A Thiefs End can speak to the high quality of its send-off for the franchises snarky protagonist, Nathan Drake. The polished PS4 exclusive not only raised the bar for large-scale set pieces, fast-paced cover shooting and incredible graphics, but also kept the action grounded with a surprisingly emotional story about Drakes troubled past. So, when Naughty Dog revealed that they had plans for a piece of single-player DLC for their newest title, many wondered what direction the acclaimed studio would take now that they had wrapped up their time with their decade-old hero. At last years PSX, the team revealed the startling news that not only has that DLC become big enough to warrant its own standalone release, but that the title would star a fan favorite from the original trilogy, Chloe Frazer, alongside the more recently introduced antagonist Nadine Ross. Together, this duo take the spotlight in yet another Naughty Dog masterstroke, as The Lost Legacy combines Uncharted 4s fine-tuned mechanics and storytelling with large, open environments and a more classic Uncharted plot.The Lost Legacy takes place after the events of Uncharted 4, as Chloe and Nadine are coerced into an unlikely partnership as they race through India against the devious Asav and his army to track down the Tusk of Ganesh. New protagonists aside, one could stick that summary alongside any Uncharted game and it would feel right at home. Fortunately, the blossoming partnership between these two women help keep the tale from feeling too familiar, with their contrasting personalities and quip-centric dialogue providing an enjoyable relationship that have become the cornerstone of recent Naughty Dog titles. The well-shot and acted cutscenes bolster the story even further, as Claudia Black and Laura Bailey each deliver strong motion-captured performances that strengthen their respective characters prominence and relatability in this treasure-hunting universe.From a gameplay perspective, any Uncharted 4 player will feel right at home with the games shooting, stealth, driving, grappling and climbing mechanics, as they all feel mostly if not completely identical to the 2016 adventure. These commonalities do prevent The Lost Legacy from feeling like as much of a step forward as its predecessors, but the nearly perfected and regularly satisfying nature of them turn this notion into more of an afterthought than anything that prominently takes away from the experience.Its not all old news though, as the latest Uncharted sports a handful of new weapons, lock-picking and the largest chunk of open space in the series, allowing players a bit more freedom as to how they want to tackle multiple objectives for a good portion of the game. While the entire experience features plenty of optional conversations, collectibles and combat situations, encountering them in the open lands of the Western Ghats made the journey feel more unique and natural, making us wonder just what Naughty Dog could accomplish with a game dedicated to a fully-realized open world. Altogether, the eight hour campaign feels consistently strong above all else, while also including some of the most ingenious puzzles of the series as well as a jaw-dropping final hour.While The Lost Legacys campaign could make a case on its own for the $40 price tag, the standalone game also grants the player full access to Uncharted 4s much-improved multiplayer, including all of the new maps, modes and weapons that have been made available since last year. Most noticeably, the recently added Survival Arena mode puts a new spin on the Survival experience, providing a more condensed but challenging version of the horde-based mode. The shallow nature of Uncharted 4s multiplayer at launch has long since been forgotten, as the fleshed-out roster of modes and customizable options makes the markedly jollier side of Naughty Dogs full Uncharted experience feel a bit more welcome and justified as part of this standalone release, even if the microtransactions still do make themselves a little too present.Chloe and Nadines adventure may not have the same multi-country proclivity that most of Nathans have had, but that doesnt stop it from featuring some truly awe-inspiring environments, both on a large and small scale. Naughty Dogs attention to detail doesnt get set aside even with their new ambitions for bigger playspaces, from dirt being kicked up by the jeep to Chloe constantly pushing aside her sweat-filled hair out of her face. The soundtrack, while fitting, never really feels as prominent as it did in past Uncharted games, perhaps to better reflect the nature of the new protagonists. From a technical perspective, our playthrough was mostly problem-free, save for a few odd ragdolls and minor progress stoppages. In addition to several difficulty options, The Lost Legacy continues the series fondness for replayability, with unlockable render modes, gameplay modifiers and character skins all ensuring that any future playthroughs will feel anything but conventional. Closing Comments:Uncharted: The Lost Legacy embraces what the series has become so renowned for: placing real, relatable people in impossible situations that force them to come out better and stronger on the other side or not come out at all. Its true that the game also has incredibly refined combat and exploration as well as stunning graphics and set pieces, but without that heart at the center of it all, theres little else to stop Uncharted from falling into the abyss of mediocrity, especially with so little being done to push this particular entry forward. Fortunately, Naughty Dog has made sure that that core is as human as ever, and as a result, have produced another stellar title that stands shoulder-to-shoulder with not only some of the studios best works, but some of the industrys best action-adventure games ever.", "date": "on August 17, 2017", "grade": 4.5}