{"name": "Crashday: Redline Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=267045", "text": "The original release of Crashday in 2006 saw it receive fairly high marks, but still not quite get the respect it deserved. In hindsight, timing may have been its worst enemy then as arcade-style racers such as Flatout were already on PC, and PC and console owners had a deluge of games in the destruction/racing sub-genre to enjoy to some degree. Franchises like Burnout reached high marks and even higher sales figures and it didnt leave much of a market for games to still scratch an action-oriented racing itch. Crashday came came and went, but is now back with support for modern devices and the addition of a dozen new courses. Crashday: Redline Edition takes the action-centric gameplay of the original and tweaks it, while also bringing with it a revamped menu system.For an arcade-style racer, Crashday: Redline Edition has a healthy assortment of modes to choose from. You have a career mode that brings everything to the table with a loose plot sewn throughout it alongside the ability to choose single events from any of the available options. You can have a traditional lap race, a checkpoint race, a capture the flag mode, a point-to-point time trial where as long as you hit every checkpoint within a time limit, youre good, a demolition derby-style mode with missiles and machine guns, and a couple of modes involving bombs. Its good to have some bombs in a racing game to mix things up when youre tired of using missile and machine guns to get your way.With the bomb-based modes, you can either have a hot potato match of sorts or something akin to the movie Speed. Pass the Bomb is the former mode, where you have a small time limit for the round and you have to actively have the bomb to earn points  however, having the bomb when time expires means that you blow up. This is obviously a fate many would like to avoid unless they have some kind of weird explosion fetish, so the key is to try and get the bomb early on and then stay busy. AI rivals want to avoid you like the plague, so you need to seek them out and ram them. A good t-bone isnt just a good dinner  its also a fantastic way to pass the bomb onto a rival and blow them to kingdom come. The second bomb-based mode, Bomb Run, straps a bomb to every vehicle and sets a certain speed limit at timed intervals. Anyone who goes under that speed limit for too long gets a quick warning beep before either speeding up or blowing up. This mode is easily the biggest core challenge offered up because if you get into a back and forth collision-fest or even take a turn wrong, youre out of luck. Every second of this kind of race is a challenge, and is something that will have you mixing up your car selection because each type of race requires something a bit different.Traditional races benefit from speed, while something that is bulkier and a bit more durable might be want you want for a destruction derby-style race. Wrecking Matches are a perfect way to let off steam and really do bring car combat back into things  and with that sub-genre being dead for so long, its good to have it back in some form here. Nothing quite tops the thrill of landing two perfect missile shots to end a round. However, ramming an enemy, trapping them, unleashing a sea of bullets and then a missile comes pretty darn close.While the engine itself works great for arcade-style modes, what surprised me most was how well it worked for the core racing modes too. Even without having things like weapons to work with, you can still have an action-heavy race because you want to scrape paint with rivals and keep things moving. You can do that and not feel like a dirty racer since the AI will do that to you as well, and theres no real way to cheat in this mode. Cutting corners in a regular race wont help you since you have to hit every checkpoint. Cutting corners as a whole is risky even in a point-to-point race since you can do it  but might wind up oversteering or flipping your vehicle in the process. You can recover, sure, but you still lose a considerable amount of time due to it. Outside of racing, the Redline Edition includes a fairly easy to use track editor. Not being someone who usually dabbles in these modes, it was surprising to see just how quick it was to pick up and just start tinkering with road parts and make a quick track. A simple checkpoint race track only took about five minutes to make and its hard to ask for much more than that from editing tools. They are quite user-friendly and while a bit more in-game instruction would be nice, the menus themselves are so easily laid out that you dont really need much instruction to get a basic track done.Visually, Crashday: Redline Edition does look its core age a bit. The game has been remastered, and that does appear to have cleaned up some of the originals textures. However, this doesnt quite look on-par with AAA racing game today  and thats honestly fine. There was never a moment where the texture quality took away from the game. With that said, the car models do look quite good, with parts smashing off in real-time. The lighting effects are quite good, with different shades of blue and even pink radiating off of a silver car perfectly The games only real visual downfall is iffy-looking textures on the environments which never take away from the overall experience. The big key is that everything runs smoothly, and whether the game was being played on a typical desktop from a few years ago or a more recent gaming rig, it performed admirably.The soundtrack is full of licensed rock and fits the high-octane vibe the game gives off. In many ways, this is still a game steeped in testosterone  so playing with the volume up high and an energy drink nearby makes a lot of sense. The music seems largely indie, but not bad with some of the tracks warranting a few listens outside of the game. The sound design as a whole is impressive, with crashes and explosions all having a sense of force to them. Theres also a nice sense of vehicular size relative to others when you crash into rivals, letting you know that being hit by a smaller vehicle did less overall damage than a hit from a larger one. Closing Comments:Crashday: Redline Edition is an excellent pickup for anyone who loves intense racing action. It combines core racing with car combat and its surprising how well everything meshes together. Theres a healthy number of modes available and everything controls well, with a surprising amount of precision with things like gunplay and missile usage  even when youre speeding around the area. It isnt a visual tour de force, but remains a good-looking game consistently and never slows down even if a ton of stuff is blowing up all around you.", "date": "August 10, 2017", "grade": 4.0}