{"name": "Super Cloudbuilt", "ref": "https://hardcoregamer.com/?post_type=post&p=265176", "text": "The original Cloudbuilt offered up a blend of parkour and platforming when it was first released in 2014. Now, Coilworks and Double Eleven have brought it back with an all-new entry that takes the originals foundation and expands upon it. The originals rapid-fire pace tested gamers in ways that most platformers dont, mixing platforming with a bit of a bullet hell approach when it came to object avoidance and even puzzle games due to the planning required to do well. Its shorter stages were basically Point A to B obstacle courses with a surprisingly involved narrative  Demi is in a broken body and the stages played were simulations. They were essentially a way for her to regain some confidence and a sense of self-reliance as her real-world body would likely never be usable again. It was dark, but engrossing.That concept has been revisited with a far greater emphasis on the stages themselves. The game takes place in large, bustling levels with a lot to do and several paths to completion. Demi herself is an analog for the player as youre both thrown into this confusing situation where you have to find your way out of a shattered building, and then the narrative shifts from a stage to the plot and everything starts making more sense. The core gameplay is similar to what was featured in the first but greatly expanded upon. Running, jumping, wall-running, platform hanging and shooting are back with more variety and challenge.Demis goal here is to unravel her own personal mystery and must battle a new host of enemies compared to the last game. You still jump, wall-run and shoot  but stages are far more expansive. Instead of just being obstacle courses, you have a bit of that, but now have to avoid enemies alongside them. Before, enemies mainly took the form of landmines and other obstacles that would impede your path. Now, they actively try to kill you. This isnt run and gun-style, though, and you still have to use your gunfire to destroy things like gates and flip switches. Demis agility extends to having a slick jetpack as well as boosters that can enable super-long jumps, wall-running and vertical wall-running thanks to the boost. Combining everything together with shooting results in a lot of excitement and thrilling moments. One minute, youre jumping across large chasms and then immediately being thrown into having to topple a few enemies before scoping out your environment for either your next point of interest or hidden areas. Finding secret keys can allow you to unlock things earlier, and bump up your life bar to endure a bit more abuse if the need arises. It isnt essential, but can make a challenging game somewhat easier without making it a game-breaking element. Its a bonus and one that you really do have to earn since just going from the beginning to the end of a stage isnt going to avail you much of a reward beyond progression. Theres a lot of thrill in the exploration since theres risk around every turn.Every wall you run is likely going to be over some kind of a pit  so fear is always in the back of your mind. If you fail, you restart from your most recent checkpoint. If the in-game checkpoints arent enough for you, players can plant their own wherever theyd like as well. This is a brilliant anti-frustration feature and one that encourages players to take chances. If youre at a fork in the road, place a checkpoint and just try out each area for a bit. If you fail, thats okay  just try again on the second route and see if you have an easier time. You could find that its a tougher route in theory, but everything clicks into place and you raise your game in the process. You might even find some hidden goodies, and once you get a taste for that, youll naturally start getting more exploratory in other stages.With the original Cloudbulit being made for PC, the default keyboard and mouse configuration works well. The intricate movements for her can be done with a fair amount of ease and it feels natural. With this coming to consoles as well, one would think that built-in controller support would be solid, but it isnt. Controlling Demi with a pad is a bit cumbersome due to wonky camera controls. You would logically think that the right stick would control the camera, but it doesnt. Even if youre using a controller, you can only control the camera with the mouse  its bizarre and makes the game a bit tougher to play than it should be with a gamepad. Hopefully its an issue that gets a patch soon, because as it stands, the game is unplayable with only a controller. Fortunately, the keyboard and mouse setup works well and the mouse controls for shooting feel a bit more natural than the basic ones for the controller. Everything responds quickly and the game works about as well as the original did in that regard. Visually, Super Cloudbuilt retains the cel-shaded look of the original while also bumping up the graphics a bit. Theres more detail in the worlds and the characters than before. Animation remains a bit limited overall  but thats a good thing overall, because it makes it easier to time everything out. Demis jumping animation is smooth, as are her movements roaming around the edges of walls  so there are some flourishes thrown in at times. The environments themselves are gorgeous, with a lot of variety of the colors in the skyline. Every stage looks different and feels different as a result of just the appearance of everything.Super Cloudbuilts sound design is surprisingly strong. The narrative is told through impressive voice acting that manages to take a melodramatic story and minimize that aspect of it while driving you to Demis internal struggle. In-game, the gunfire is satisfying  with charged shots having a Mega Man-style feel of doing far more damage per blast and sounding concussive. The individual shots fired dont sound damaging, but do add up nicely and the ping of them against enemies is satisfying enough while also reminding you that charge shots are the best way to go. Musically, the soundtrack is solid  but doesnt stand out more during play let alone after it. Closing Comments:Super Cloudbuilt is an impressive upgrade from the original. The overall scope has been increased and the adventure is more grandiose than before. Demis wall-running, parkour, platforming and shooting has been enhanced. The level design has also shifted to a more exciting design focusing on exploration and more traditional stages than pure obstacle courses. The controller support could be better, but keyboard and mouse playback feels natural and intuitive enough to get the job done. The cel shading looks impressive, but its animation could stand to be smoother in parts. The soundtrack is acceptable, but nothing all that special. The final product is greater than the sum of its parts, though, and anyone seeking a fast-paced 3D action-platformer will be thrilled with Super Cloudbuilt.", "date": "July 21, 2017", "grade": 4.0}