{"name": "MotoGP 17", "ref": "https://hardcoregamer.com/?post_type=post&p=265336", "text": "Italian game developer, Milestone S.r.l., has been proficient at motorcycle racing games for multiple years. Its top series returns this year with MotoGP 17 and includes a slew of technical improvements. While the MotoGP racing series is a bit under the radar, its the Formula One of motorcycle racing. There is still a core audience that looks for a simulation for this series and Milestone is proud to oblige. Also jumping into the e-sport scene, MotoGP 17 does a few things that would be desirable in other racing games.The expected improvements for a yearly title are here. The game features all of the official 2017 MotoGP tracks, riders and bikes. This means racers can expect to compete at the Red Bull Grand Prix of the Americas, the Motul TT Assen and much more. All the major bike manufacturers are here, along with different classes of bikes. Moto2, Moto3 and the Red Bull Rookies Cup. On top of this, there are seventy (yes seventy) unlockable historic riders that all feature different bikes. There is quite the arsenal of choices here for longtime MotoGP fans.Career modes are a must for racing games and MotoGP 17 offers a few deep options. The Rider Career will allow players to create a rider, customize the bike and player livery, and pursue through a career. Riders will start with the Red Bull Rookie Cup to see if they can move up to Moto3, and then eventually to the big show, MotoGP. The most in-depth career mode is the Managerial Career. Here players can run a team, and there are quite a bit of aspects that really engulf you. Hiring a team, assigning funds for R&D, and keeping the team happy with up-to-date facilities all play a part. You will hire a teammate of your choice as they each offer different traits for their prices. The goal is to gain reputation points and earn credits and this can also be done through off-day events. Players have the choice to do PR events or other activies on certain days that provide a boost to the team. This also shows what kind of rider you are rather if you prefer the spotlight or if you are a gearhead. The Managerial Career does a ton of little things right that other racing games havent considered, and it is quite the experience. Of course, there are other game modes for quicker access. Players can compete in a single grand prix or a championship. Time Trials also exist for those looking to push the limits and set lap records. MotoGP 17 does offer splitscreen multiplayer racing, which is getting more highly desired nowadays. As for online racing, players can suit up for full or quick weekend grand prixs or go through a championship for the long haul. Most importantly, players can compete in a co-op championship online. This was introduced back on Codemasters F1 series a few years ago, and it is an important option to include in a racing game.Now that all the features are out of the way, it is time to focus on the race track. MotoGP 17 will run at 60 FPS across the board on all platforms. If you have a PS4 Pro, you can expect native 1440p resolution to be coupled with this consistent frame rate. What this does is change the feel of the races for the better, as everything on the track is extremely smooth. The A.I. was improved for overtaking, but in all honesty, it considers you an afterthought. It sticks to the racing line and wont hesitate to bump you in its effort. The bike handling is a mixed bag. Different rider positions can be selected for cornering and the technical aspect is there at higher difficulty levels, but I cant help but feel that the cornering feels like a stiff pendulum. Players can switch their views to get a more immersive feel, but the handling model could go deeper. Feeling the effects of suspension and leaning could be more prevalent. Collisions feel better in MotoGP 17 as opposed to MXGP 3. Taking corners wrong can also cause your rider to fly off his bike, so you always need momentum to keep things up. Front and rear brake can be separately applied. The options are there for a true simulation experience that does a solid job at replicating. The one option I absolutely adore is the guided tuning. Yes, all racing games have garages to set up your cars or bikes, and this does as well. But, as a racer, the engineers are supposed to ask the rider how the ride is doing. With the guided tuning, the game asks you a few questions based on what the bike is doing and where its doing it. The game will then automatically apply the changes. Guided tuning should be in every racing game.As mentioned above, MotoGP 17 will run at 60 FPS, which is an excellent feat. While not hitting 4K on PS4 Pro, it does hit 1440p. The goal was to offer 60 FPS across the board, and it may have taken a dip at 4K. However, the game does not stand out visually. The game is running on a dated engine and not the same engine as MXGP 3. It simply looks like a high-res PS3 game. The presentation pre-race is good touch and looks professional, but on the track, things can get boring. The lack of details on the tracks and the bland distances take a bit out of the feel. The bike sounds have been improved, but arent necessarily a pleasure to hear. The bikes do sound different, but honestly they sound like a modern day F1 car, which isnt good. The bike sounds becoming draining and hinder the experience during a race (not to mention the issue with the visuals above). There is no radio chatter, but there are commentators during the pre-race and that is a nice touch. The sounds of bike collisions and crashes are weak. Closing Comments:Milestone has taken MotoGP 17 in a great direction with a valiant leap. The managerial career is great, making an example of what a mode like this should be. Running at 60 FPS on all systems helps the racing experience, but the dated feel with the action on the track brings it back down to earth. The A.I. claims to be improved, but doesnt recognize your presence. The audio makes similar claims, but remains draining. MotoGP 17 is a game that looks great on paper, but only manages to do enough to please the hardcore fan of the series.", "date": "July 17, 2017", "grade": 3.5}