{"name": "Thats You", "ref": "https://hardcoregamer.com/?post_type=post&p=264720", "text": "The Jackbox Party Pack has essentially owned the market when it comes to easy to play party games that use your phone as a controller, but at E3 this year, PlayStation announced that they would be getting into the game with their new PlayLink system. It essentially works like Jackbox, but instead of going to a mobile site, an app for each of the games is downloaded. The first one to hit the market is Thats You, and while there isnt a Jackbox game with a direct correlation, Thats You gives off Quiplash vibes, with goofy themes, voting and a quirky narrator.In Thats You, you and up to five others link your phones to the game using the companion app, take a picture of yourself for your profile and name yourself. Then the narrator will run you down some of the rules and get you into the first of the five rounds of the game. Each round has a different setting and theme. One could be love, another could be camping, anothers crime and so on. The formula stays the same throughout, with essentially the same mini-games or variations on them each round.Theres seven games that constitute Thats You. In Question Game, a player picks which player would be the most likely to do or think to do the action the narrator gives. In Picture Game, a player gets singled out and the other players pick from a group of pictures depicting actions based on what the singled out player would do. In Drawing Game, players are given a picture to draw on, with a prompt based on the singled out player. In Mimic Game, players are given a picture of a person making a face and they take a picture of themselves mimicking it. In Word Game, players guess how the singled out player will finish the sentence. In Photo Game, a player takes a picture of another player and everyone draws on the photo. The Final Game has players take a selfie and then sends that selfie to another player for them to draw on it using a prompt. After half a minute, the selfies are shuffled and given to a new player to draw on, and it happens a third time. The full drawings are shown to everyone and there is a vote on which is best, just like the regular Photo Game. Players vote on their phones or tablets and are given a short supply of Jokers, which are little pop caps that can double your points if you think the other players are going to vote the same way as you. And thats pretty much it. On replays, you can get variations on which game modes will appear in which rounds, which themes youll actually see and of course which players will be selected during each round. Obviously, this doesnt sound like too much, and thats probably my biggest complaint when it comes to Thats You as a whole. Theres not a lot there when it comes to variety. Playing Thats You with different groups of friends or family each time will be fun in their own ways, but if youre going to play this with the same group of six over and over, its going to quickly get old. For now, at least, Thats You is a free game with a PlayStation Plus subscription, so its worth the download, but on October 24, it gets bumped up to $19.99 and its hard to predict how well thats going to go over.Otherwise, though, theres not much to complain about. The game is stable, its funny and the visuals are great. The narrator is quirky, sassy and contributes much of the humor to the proceedings. The idea of taking pictures and using them as the focal point for the mini-games was a great idea and hopefully more comes to Thats You in terms of free add-on content. Closing Comments:Whats great about Thats You right now is that its free for PlayStation Plus members. Itll jump to $19.99 starting on October 24, a steep price compared to the Jackbox Party Pack, which costs $24.99 and comes with a plethora of games, but its worth it for those who get in right now. The graphics are great, as they should be since theres not a lot going on visually, the narration is funny and the mini-games allow for a ton of natural comedy. Its also the first of the PlayLink games, so if this is just the beginning, then its a good sign. Thats You is easy for everyone to get in on at parties or just when hanging out with friends and shows the future of PlayLink is promising indeed.", "date": "on July 12, 2017", "grade": 3.5}