{"name": "Black The Fall", "ref": "https://hardcoregamer.com/?post_type=post&p=264639", "text": "Hello darkness, my old friend. And by that, I mean the dark, spooky, indie 2.5D puzzle platformer, typically involving the likes of small children in scary worlds, or SCSW games for short. The ones last seen with Little Nightmares and born out of the success of Limbo, which tend to be seen as a coupon to instant success on the indie scene. Out latest entry in the genre is Black The Fall, a graduate of the Square Enix Collective from developers Sand Sailor Studio, and while the protagonist may be older than expected, the game itself still has the same feeling as its peers. But more importantly, does it have the same level of quality?The setup in Black The Fall is that you are playing as Black, an old machinist/cog in the machine attempting to escape from an oppressive Communist regime by sneaking about and solving puzzles to get past various obstacles, surrounded by imagery and scenarios based on the developers own experiences from living in pre-1989 Romania. Mind you, Im pretty sure Communists in Romania didnt have access to killbots that were twenty feet tall or robot dogs that you can control with laser pointers, but then again, Im also not an expert on the history of Romania, so maybe theres something I dont know.All joking aside, the visuals are easily one of the most striking aspects of Black The Fall, detailing the horrors of such a world quite perfectly with nicely detailed graphics and classic aesthetics such as aresa with color schemes heavily focused on black, white, and red. The more sci-fi-oriented elements (with a perfect bit of a retro touch) actually provide an a highly effective contrast to the realistic decay and horrors of such a world, almost like a combination of Inside and This War of Mine. Indeed, the mixture at its best during several notable sequences and puzzles, a particular highlight being a rather gruesome boat ride you have to take while avoiding security cameras.Speaking of gameplay, Black The Fall sticks to a lot of the standards for the most part. Avoid the highlighted views of security cameras and guards (with simple yet perfect stealth mechanics), solve various environmental and physics puzzles, climb through layers of various platforms, et cetera. It feels a bit more akin to games such as Another World and Flashback, but you should still be able to get a lot of the familiar basics of SCSW games down pat. But while it may sound like youve done a lot of this before, the game still succeeds thanks to some creative and enjoyable puzzle design, the type thats at the perfect level of difficulty and encourages you to explore everything in the current area. There are even a couple of more unique twists like a platforming section entirely in the dark where you rely only on sound to learn when to jump over steam (although like The Witness, this may present difficulties for the hearing-impaired).That said, Black The Fall has at least one more trick up its sleeve beyond mere platforming, and that comes in the form of a laser pointer used to either activate certain machines or command around others, be they various beaten-down workers waiting for signals or the canine-like robot sidekick you eventually gain. Its a simple aim-and-click mechanic that works quite well, and again, it makes for some highly effective puzzles, with your little metal pooch also perfectly fitting into a cold, industrial world while providing a perfect touch of levity with its mannerisms. It is weird that your laser pointer can go virtually anywhere while youre still stuck in a two-dimensional plane, creating parts where problems could be solved instantly if Black just stepped sideways, but thats just a minor oddity.Much like Little Nightmares, though, Black The Fall opts for a dialogue-free approach when it comes to storytelling, letting its visuals speak for itself quite perfectly. But this does also mean that its completely free of tutorials, instead relying on the occasional hazard or workplace sign to provide little guides about what actions to use, and thus preparing you for later. While respecting out intellect is appreciated, this does lead to at least one minor inconvenience when you have to bring up the options menu just to learn what button turns the laser pointer off, or at worst, gets a bit tricky when it needs to point out puzzle solutions such as being able to climb on your robot buddy while theyre still attached to an electrical panel. Still, its nothing really harmful.Aside from a couple of trial-and-error moments and the aforementioned issues with figuring out a couple of controls and gameplay elements, theres only one real issue with Black The Fall: Its length. And seeing as how this is an issue thats pretty much another standard in this subgenre, I thought Id just save us all some time and create a paragraph devoted to this criticism when it comes to this game and all future ones like it:But while [INSERT GAME HERE] does do a great job when it comes to world-building and enjoyable puzzle design, there are those who may indeed be turned off by the fact that the game only lasts a few hours. Mind you, [INSERT GAME HERE] does everything it needs to do in those few hours, especially when it comes to telling a compelling story thats just the right length, yet while there are [COLLECTIBLES/EASTER EGGS/MULTIPLE ENDINGS] to add to the replayability, you still cant help but feel like it ends a bit too soon and that it leaves you wanting more.And now you may feel free to just cut that out and add it to any future reviews of spooky atmospheric puzzle platformers/SCSW games, thus saving us all a lot of time. Seriously, this genre needs to evolve a bit to help out games like thisClosing Comments:Black The Fall isnt exactly revolutionary when it comes to the world of atmospheric platformers, but it still excels in what it sets out to do. It paints a frightening image of a land deep in the grip of Communism back in the day, but never sacrifices enjoyment in order to get its message out. The visual style is striking and eye-catching, the puzzles are well-crafted and put up a perfect challenge, and everything controls almost perfectly. Its an impressive piece of work with a lot of heart put into it, and the end result is a brutal but beautiful bit of platforming that comes highly recommended. Indeed, it did end up having the same quality as its peers after all, and can proudly stand beside them.", "date": "July 11, 2017", "grade": 4.0}