{"name": "Gotham Knights", "ref": "https://hardcoregamer.com/?post_type=post&p=429034", "text": "Batman: Arkham Origins was a surprise hit when it launched in 2013. Despite a rough launch, developer WB Montreal successfully launched what would become a beloved entry in the Arkham series. The intricate level design, intense combat segments, brilliant story detailing the origins of Batman and Jokers relationship, and the best boss fights in the series made Arkham Origins a must-play. Since then, gamers have been waiting to see whats next for the studio. It turns out whats next is Gotham Knights, a wholly original project without Batman or any relation to the Arkham franchise. Instead, Gotham Knights puts players in the shoes of Batmans sidekicks as they attempt to become full-fledged heroes in a world where Batman is dead. So, is Gotham Knights a worthy successor to Batman and the Arkham series or should these knights be relegated to the shadows?Gotham Knights takes place in a world without Batman/Bruce Wayne. Following an explosive opening that leaves him dead, Batman posthumously leaves the protection of Gotham City to his proteges Batgirl, Robin, Nightwing and Red Hood. With no Batman to keep them in check, however, the criminal underworld has begun to stir, and the four heroes quickly find themselves caught in the middle of a war between the mysterious Court of Owls and the League of Shadows.WB Montreal delivers a solid narrative filled with intrigue and great character moments. The main narrative, in particular, remains interesting most of the time as the four heroes attempt to unravel the web that is the Court of Owls. The organizations relative newness to the Batman mythos and how they tie into Gotham Citys culture make for some enticing story moments as players barrel towards the credits. That intrigue persists for about three-fourths of the game until the plot pulls a complete switcheroo, replacing the Court with an overused Batman faction, killing much of the storys momentum until the end.What does fully carry the game are the four playable characters. Nightwing, Batgirl, Red Hood and Robin are fully-rounded characters both in costume and out. There are powerful, poignant moments and interactions between the characters, particularly as they each navigate their insecurities to become better protectors. While other characters like Lucius Fox, Penguin and Renee Montoya show up throughout the campaign, they mainly serve as quest givers than fully-developed characters. WB Montreal also takes a starkly different approach to villains here than in the Arkham games. Rather than frontloading Gotham Knights with a ton of villains that get little screen time, the story instead opts for three villains: Mr. Freeze, Harley Quinn and Clayface. While decent, Harley Quinn and Mr. Freezes stories dont shed new light on these characters or give them big moments like in the Arkham series and other media. Poor Clayface, however, gets the short end of the stick with few missions and even fewer storytelling moments.Gotham Knights story will keep you busy for about a dozen hours thanks to its solid intrigue, interesting revelations and poignant character moments. While an eleventh-hour twist dulls much of the mystery the game has magnificently built up over time, its still a tale worth seeing through to the end. It would have been great to see lesser-known villains pop up, but the engagements with Harley Quinn and Mr. Freeze are entertaining enough to add a few additional hours to the playtime. If only Clayface got more attention. Overall, Gotham Knights story is an entertaining romp with some hiccups holding it back. Its important to clarify that Gotham Knights is not a Batman Arkham game. While that franchise was an action-adventure title emphasizing rhythmic brawling, gadgets and stealth, Gotham Knights trades most of that to become an action-RPG. On the surface, both series appear similar but dig deeper, and youll find that Gotham Knights is a wildly different experience for better and worse.Gotham Knights splits its game time between the vast open world of Gotham City and linear levels. When in the city, players are free to roam about its different boroughs in pursuit of random crimes, premeditated crimes, landmarks, meeting with allies and collecting random collectibles. From the ground, players can zoom across the streets atop the Batcycle. Meanwhile, your grapple gun helps you zoom from building to building on the rooftops. Its undoubtedly a beautiful world to explore with a handful of iconic Gotham City locations, but it doesnt feel wholly unique. Much of this take on Gotham City is indistinct, and without the scant few iconic structures like the Iceberg Lounge or Waynetech, this could be any generic open-world city. The linear story-based missions fare much better with a pleasing level of detail, though most are relatively simple. The levels are built chiefly to facilitate Gotham Knights more direct approach to combat and are primarily flat arenas suited for brawling over stealth. While stealth is a viable option, the combat arenas make stealth more an afterthought than a true core pillar of the game experience. In general, combat and gameplay are massive shifts from the Arkham series. The melee attacks are mapped to a single button, which is tapped for quick attacks and held down for heavy attacks. Its a similar situation with ranged attacks. Finally, a simple dodge mechanic replaces the counter system of the Arkham games. On the whole, Gotham Knights combat comes off as clunky and overly simplistic at the outset compared to the Arkham games more fluid counter-based combat. Examine it further, though, and youll be surprised by how deep it is.What helps Gotham Knights gameplay stand out is its wildly different characters and the play styles they bring, and while none of the characters bring back the same level of fluidity of the Arkham games, the different play styles help make up for that. Nightwing is the most acrobatic and fluid of the group, with a wide range of dodges. Batgirl is best at singling out enemies for fierce beatdowns and can self-heal. Robin focuses on stealth and technology, providing the most Arkham-like experience. Finally, Red Hood is a slow brawler capable of dealing severe damage. Each character brings different strengths and weaknesses to the table, and each is genuinely fun to play with and easy to swap between. Two-player co-op makes playing as the different heroes even more engaging.Complimenting each character are gear and customization systems that complement the gameplay experience rather than making it a grind like so many other action-RPG titles. Earning new suits and seeing how you can customize them is a genuine joy rather than a slog. Unfortunately, the same cant be said for the Momentum Abilities, which replace gadgets. These abilities are fine additions in combat that complement each characters distinct playstyle and cant be spammed consistently to win battles. Whats annoying is how you unlock each ability. Rather than naturally unlocking them as you progress through the story, abilities and an entire skill tree are locked behind repetitive challenges youll need to keep track of consistently. Fail to, and its entirely possible to head into the final stretches of the game without all abilities unlocked. Its a terrible, grindy, unnatural system that feels more like it was designed to extend playtime than provide an engaging sense of progression. Its an element that makes Gotham Knights feel more like a service than a game.As fun as combat can be, Gotham Knights is plagued with several issues. Camera problems are consistent and leave you frequently open for attacks. The camera is at its worst when the game introduces teleporting enemies that appear in a cloud of smoke and quickly attack. A poorly-positioned camera obscured by smoke leaves you vulnerable. Even worse is the AI, which is exceptionally dumb to the point you can stealth takedown an enemy in front of another enemy without triggering them. On the plus side, the AI helps make stealth a more viable option.While Gotham Knights was first announced for PS5, Xbox Series X|S and PC alongside last-gen versions, the game launches as a current-gen only title. While the existence of the last-gen versions is felt in some of the level design, Gotham Knights presentation does look good. Gotham City, while generic looking aesthetically, is still beautifully rendered thanks to atmospheric lighting, superb-looking rain effects and excellent reflections. The best aspect of the presentation, however, is easily the fifteen different suits for each character. All are beautifully and meticulously crafted creations that suit each of the knights. Its not easy picking a favorite. It should also be noted that Gotham Knights recently set off a firestorm for not featuring a performance mode on consoles. The game is indeed capped at 30fps but suffers from frequent drops during hectic moments, fast traveling or when tons of particle effects are on-screen. While it would have been amazing to get a performance mode, something we hope to see post-launch, 30fps is serviceable for the adventure.Closing CommentsWarner Bros. Montreal took a giant risk with Gotham Knights. Not only did the studio choose to forgo using one of the worlds most famous heroes, but also the top-rated Arkham series. What we have with Gotham Knights is an original setup filled with a great central cast and an intriguing tale of young sidekicks uncovering Gothams dark secrets and becoming knights themselves. When Gotham Knights works, it works well enough. The Court of Owls is a menacing enough foe and establishes the more interesting plot threads before the carpet is yanked out from under their feet and theyre replaced with a more generic, familiar villain. Combat is clunky and progression unnatural, but the unique playstyles of the four characters combined with a well-integrated gear system offer plenty of fun. Its just unfortunate that the poor AI and camera take away from that combat. The game features a presentation that looks good, though generic, complete with performance issues. Gotham Knights has its moments of brilliance and fun, but never manages to step out of Batmans looming shadow. These knights are more than sidekicks, they just arent heroes quite yet.", "date": "October 20, 2022", "grade": 3.5}