{"name": "Nex Machina", "ref": "https://hardcoregamer.com/?post_type=post&p=262491", "text": "A lone biker tears down a road towards a confrontation with the robots, gun locked and loaded for the quest to shoot absolutely everything that isnt human. The robots need to go, having worn out their welcome long ago, and eradicating the self-inflicted menace means twin-stick blasting through dozens of arenas while uncovering every secret you can find. This is done, of course, by shooting things, because Nex Machina is absolutely focused on the action at all times and if youre going to take a spare half-second to find a bonus its going to be with your gun.Theres technically a plot in Nex Machina, something about people having been made lazy by machines that do all their work for them and now all of humanity is trapped staring at their cell phones and not even noticing that their former servants have gone all murderous. Not one single part of this scenario is explained anywhere in the game, despite some really nice animated bits used in the announcement trailer, but seeing as the game is a series of arenas that get progressively more intense as they fill up with crawling, shooting, spinning, splitting, laser robot death it never comes across as a problem. Robots are bad, youve got a gun, humans need to be saved. How much justification do you need?As a pure arcade game the basic moveset is fairly simple. The rider ditches the bike within the first three seconds to shoot robots while dashing everywhere, and after a few quick levels find a secondary weapon. Youve only got the one type of primary gun, although it does level up if you survive long enough, and though secondary weapons come in a handful of styles there arent so many that you cant learn their quirks fairly quickly. Nex Machina isnt about depth of control, its about keeping the assault running at full steam, all the time. Shoot robots, use the dash with its brief moment of invulnerability to zip through walls of bullets or enemies you cant quite clear out fast enough, and never slow down for a second. Its an incredible arcade rush that doesnt let up, and chasing after bonuses only increases the intensity. Each level is a series of arenas that lasts just as long as it takes for you to blast the last robot before it dissolves in a nexus of blue speed lines and you zip to the next area. Every arena has a secret or bonus to chase after in addition to its swarms of robots, and these range from the obvious ones such as saving the oblivious humans wandering around to figuring out which bits of the background can be shot for extra goodies. Extra lives and score multipliers are nice, but the levels also have secret areas, bonus enemies, hidden humans, secret paths, and other objectives to uncover. Most are in the same place in every time you play, giving plenty of incentive to redo each level until youve not only found as much as possible but also survived to its end without dropping the score multiplier due to a careless death.While the core game has six main worlds with around twenty-ish arenas apiece to fight through, it also comes with three game modes plus customization options. Arcade is the primary game, all six levels in order, while Arena and Single World offer different ways to attack or learn a level at a time. Single World is fairly simple, in that its all of a single level to practice and work on your score in, while Arena comes with a number of modes to play through. Arena also adds coins to the worlds, which you can use to unlock game modes and customization features for your player. It shouldnt take too long to unlock a favorite outfit, and after that the extra modes are cheap enough that youll have everything important opened up in short order. Assuming you can survive the challenge, of course.Nex Machina starts off at a reasonable difficulty but quickly ramps up in tempo, and it expects you to keep up every step of the way. Playing on Experienced (Normal) difficulty gives you 99 continues to beat the game, and while its possible to brute-force your way through the normal parts of the levels the bosses can induce a rage-quit or two along the way. Theyre all pattern-based, so learning to dance through their bullets without a scratch is just a matter of getting familiar with their attacks, but even with a nice supply of lives its easy to end up back at the start of the encounter, score multiplier reset back to a lowly x1. Its not that bosses are hard, but rather the later ones take a while to wear down and are disproportionately difficult because of this in comparison to the rest of the levels arenas. The short, punchy areas are topped off with a drawn-out slugfest and it makes for an somewhat jarring contrast. Closing Comments:Nex Machina is an utterly fantastic arcade twin-stick shooter that doesnt so much revolutionize the genre as get almost every aspect just right. The shooting feels great, the dash mechanic gives you plenty of flexibility in getting out of tight spots, all the secondary weapons are unique and useful in their own way, and the enemies never stop coming up with new ways to cause trouble. The swarms of the early levels are joined by dense bullet patterns later on, and survival means learning to use every tool youve got both offensively and defensively. Once past mere survival you can then chase after secrets, and its not until you chain the action and level knowledge together that youll get a decent spot on the leaderboards. The eye-candy keeps the quest engaging every step of the way, with light, color and voxels exploding everywhere while the framerate stays high no matter what kind of action heats up the screen. The reasons for the quest to defeat the robots may have gotten lost somewhere along the way, but when the action looks and plays this good then the mechanical carnage is its own reward.", "date": "June 20, 2017", "grade": 4.5}