{"name": "Tokyo 42", "ref": "https://hardcoregamer.com/?post_type=post&p=260402", "text": "Ah, cyberpunk. Love it or hate it, its a genre of science fiction that perfectly lends itself to the world of video games, be it either in complex narratives, fast-paced action, espionage and more. But with every passing game, it becomes harder and harder to carve out something unique, especially when the standard cliches keep popping up (ruthless corporations are a bad thing? How shocking!). But developers Mode 7 have aimed to make their new game Tokyo 42 as unique as possible by revisiting the likes of the original Syndicate and Grand Theft Auto games, then sprinkling them with an original vision of the future and modern gameplay touches and polish. And the end result of all this work iswell, a bit hard to describe, to say the least.Taking place in a futuristic version of Tokyo set entirely in rooftop cities and communities, you play as someone who flips on the news one day and discovers that theyve been framed for the murder of someone prominent. After escaping from the police, a friend helps you discover a way to infiltrate various seedy depths and prove that you didnt kill a person: By becoming an assassin, and killing several people. Whichyes, seems like a bit of headscratcher, but its explained by by having everyone on a pill that provides nanotechnology which resurrects people, thus assassins are more prominent in order to keep certain people down and because theres a larger lack of repercussions, except the guy you were framed for killing was killed for-realsies, andwell, honestly, the story becomes a blur after that, presenting interesting ideas but rarely becoming engaging, alas.That said, though, the games cyberpunk rooftop version of Tokyo certainly pops, delivering a dazzling delight of visuals. The vibrant landscapes, neon-soaked buildings, and epic art installations create superb backdrops to duel upon, and present a world worth exploring, be it for various landmarks, quirky gangs, collectibles, or unique architecture. The synth soundtrack, unsurprisingly, also perfectly accompanies things, nicely adding to the Blade Runner-inspired universe. Combine that with the neat isometric views, and Tokyo 42 definitely has its aesthetics down pat.But the meat and potatoes of Tokyo 42 are definitely the assassinations, and several of the games missions are well-crafted indeed. As is the case with open-ended design like this, you mainly have the options to either carry out contracts by sneaking in silently or going in guns a-blazing, or with an electronic disguise or two, maybe a mix of both. The game does encourage you to look for any unorthodox methods to sneak in, like leaping across moving elevators via parkour, and its largely because of this that the stealth approach is preferred, since it makes for fun and highly satisfying gameplay as you plan your route in and sneak about without getting spotted. Simplistic gameplay, but highly effective and enjoyable.That said, more straightforward combat is still enjoyable, at least when its up against a group of enemies that are spread out (too many together, and things start to resemble a bullet hell game), thanks to enjoyable twin-stick controls. It gets even better when theres a nice variety of cover in the area, because thats when things perfectly resemble a tense standoff from an 80s action film. It fact, things are at their best when the scenery allows for more unique battles, like picking off security one at a time in a hedge maze as you snoop around without trying to be seen.So when Tokyo 42 clicks, it provides a highly satisfying action/stealth experience. But when it doesnt, it can be highly frustrating. And unfortunately, several awkward design choices lead to more than a few situations with a lack of clicking.Lets get to one of Tokyo 42s biggest issues: The camera. Theres the fact that the multi-leveled areas can make it difficult to figure out whether or not an enemy projectile is in your path or not, but more notable is the way it handles scenery. Now, because this is a game set in a huge metropolitan area, theres bound to be more than a few structures that get in your path. How most isometric games would handle this is by having anything blocking crucial views to become transparent, or cut away, or just disappear altogether. And Tokyo 42 opts for absolutely none of those choices.If somethings blocking your view, the only solution is to fiddle with the camera and its eight viewpoints until the path is clear. And yet, you will still come across several situations where your view will be blocked anyway no matter what you choose, or the view will just end up being extremely awkward and unhelpful. Then theres any part that features jumping segments or having to maneuver along narrow pathways with no rails, and even with the ability to semi-pinpoint where youll land, expect more than a few cheap deaths.The other notable issue with the game is that despite selling itself as an open world title, Tokyo 42 doesnt really feel like any of its actual gameplay demands an open world. Sure, there are a bunch of different collectibles to hunt for, but most of them are just various coats and weapon skins that, given this particular style of graphics, youll hardly ever notice. And despite taking place all over the map, the side missions ring hollow as well.Typically, there are three reasons why you do side missions in such a game: To encounter more of the games cast of characters and get more immersed in its world, to gather various rewards, and/or to experience a break from the traditional gameplay with something different. Respectively, Tokyo 42 doesnt have any particularly interesting or unique characters, the cash rewards feel a bit meaningless when you can still get through the majority of the game with just a katana and a pistol that has unlimited ammo, and the side missions tend to pretty much stick to variations of the same kinds of assassinations carried out in the story.So Tokyo 42 doesnt offer that much of an incentive to deviate from the main story missionsat least not until you approach the final few levels, when the game suddenly throws an incredibly cheap, overpowered boss against you as part of the plot. This was the point where I noticed that the lone character whose set of side missions I did decide to complete showed up to provide support, and the point when I noticed that the game was very much flashing the message of Too bad you decided not to go after the side missions, because now youre screwed! Dick move, guys.And there are more than a few other flaws indeed, such as several various features that feel underdeveloped. Theres a nemesis system in play that has a rival assassin disguised as a civilian and deployed to kill you at certain times, and you have to avoid them, or even use a trained cat to seek them out and engage them in combat. A neat idea, but its ultimately meaningless, since even if the nemesis does kill you, you just pop back to the last save point with seemingly no harm done, the nemesis now having disappeared, and leaving you wondering what the point is other than having a mild annoyance.Theres also the method of earning a reputation to unlock more missions, which is only required once in the entire game, police officers that come after you if you cause too much of a ruckus, except you really have to go out of your way to summon them, and bike missions, which there are very few of andwell, the controls during the bike missions are absolutely horrendous, so less of them is for the better, actually.We havent even gotten into the enemy AI yet. I can overlook patrolling enemies not reacting in anyway to the fresh corpse of their best friend that I just stealth killed ten seconds ago, but then when youre actually spotted and they do engage in combat, they seem to shift from being hyper-competent and able to land precise shots on you to actually leaving the entire area and running around like chickens with heads cut off. This all may be rambling by now, but its just that Tokyo 42 is one of those games with a whole lot of negatives to talk about that are more interesting to discuss than the positive bits, even if the overall game is okay overall. So lets skip to the end already, shall we?Closing Comments:Tokyo 42 has a lot of potential, and moments of greatness where it can deliver satisfying action, but unfortunately gets bogged down by an annoying camera and notable structure issues and technical snafus. Theres still fun to be had in the candy-coated world of a futuristic Japan, especially when it comes to exploration and the occasional parkour, but those looking for a more focused and more effective action game would be better off checking something else instead. So in the end, its sadly less Blade Runner and more Johnny Mnemonic.", "date": "June 18, 2017", "grade": 3.0}