{"name": "Form", "ref": "https://hardcoregamer.com/?post_type=post&p=259257", "text": "With the ever expanding library of games that have made their way to VR, it can be exceedingly difficult to figure out which items are worth the time and which were just thrown together by a developer hoping to capitalize on the trend. Because of the immersive nature of the platform, titles that look decent in trailers might fail to pass muster and entries with terrible trailers can turn out to be great. Its a bit of a gamble either way. To be entirely frank, Charm Games Form had the appearance of a dull experience based on what could be seen. It looked like a dark room with some puzzles, with little else. In actuality, it is a deeply imaginative adventure whose only flaw is that it ends before it feels done.Players take the role of Dr. Devin Eli, a scientist researching a mysterious obelisk at a remote lab in Alaska. After getting clearance to engage in a risky step, he finds himself warped to dark universe with word bubbles displaying his thoughts. Itdoesnt make a whole lot of sense on the face of it. Is this new world an alternate dimension? Is it a manifestation of the good doctors subconscious? The game skirts around establishing the truth of the circumstances, leaving it open to the players interpretation. Personally, this is entirely acceptable. Having a plot that encourages contemplation after completion can be stimulating, so long as the title in question isnt covered in dripping pretension. Fortunately, Form sidesteps this risk by keeping the actual mechanics understandable and engaging. Broken down, the player solves a series of puzzles, warping from place to place when the puzzle is complete. Controls are contextual. Pulling the trigger on an object that can be manipulated closes the hand around it. If there is an item at a distance that is needed but out of reach, pointing at it and pulling the trigger draws it closer. It works almost flawlessly, with only a couple of occasions where there was a lever to be pulled but the game didnt grip it.The puzzles themselves are impeccably designed. In each portion, there is no wandering around the environment to find some random piece of detritus to solve some obscure riddle that only makes sense in the designers mind. Everything that is needed is available either around or behind the player. In essence, it is a series of puzzle boxes and machines that need to be completed, repaired, or properly manipulated to progress. Moments like placing a string of charged shapes to power a device, or pulling apart some arcane machine lends itself a tactile feeling that was unexpected. Tuning a series of light based string instruments and playing them with an electric bow was a moment for which VR was made. Graphically, Form embraces an ethereal, mechanical style. Machines are covered with mysterious symbols and elements of classical art inform the aesthetics in interesting ways. The style that makes it appear overly dark in the trailer is also what helps it pop in play. This is a game that uses darkness and lighting to a stunning degree. The vistas that the developers painted caused me to gape in awe more than once. Coupling this design with the ambient music and clanks of the machine creates one of the more memorable experiences to be had in gaming.The biggest issue that this game has is one that is common with quality VR games: length. The puzzles here were on the easy side, beginning to progressively grow more complex. It was about on the level of a warm up in other adventure games. When it starts to get really good, it just ends. Further hints regarding the nature of the experience are dropped and then the credits roll. This isnt the worst problem to have, as it is better to leave the audience wanting more, but it is also too common among the better VR games. All told, I finished this one in a little less than an hour, and that was with time spent taking in the environments and seeing if it was possible to break things. Closing Comments:Despite the fact that it is incredibly short, Form is one of those games that must be played by any aficionado of virtual reality. Through smart design and a superlative look, this it is one of those titles that can really show off how the medium can surpass gaming on a monitor. Its immersive, engaging and beautiful, setting a new standard for virtual reality and visual design.", "date": "Bohn on June 1, 2017", "grade": 4.0}