{"name": "Vanquish (PC)", "ref": "https://hardcoregamer.com/?post_type=post&p=259181", "text": "Sega has been on a roll as of late, catering to their fans to an incredible degree. Not only has the Japanese publisher been doing a stellar job localizing the Yakuza franchise here in the west, but theyve also been adapting a number of PlatinumGames on PC. We got a tease on April Fools Day with an 8-Bit Bayonetta, and then a little over a week later, Sega dropped the first game on Steam. This gave fans hope that the publisher would continue with Mad World and Vanquish, and at least at the current time, the latter has come to fruition. The fast paced, ultra-stylish shooter is back and better than ever, coming with promises of graphical enhancements and well-adapted keyboard & mouse controls. Sega has been able to quickly win back the hearts of their hardcore fans, one release at a time, but is Vanquishs PC release everything we could have hoped for or is it just a quick port job?Vanquish takes place in a futuristic landscape where a group calling themselves The Order of the Russian Star hijacks a space colony (named Providence) and uses its energy gathering capabilities to decimate San Francisco. You play as Sam Gideon, a soldier who helped create the best concept in the entire fictional world (the Augmented Reaction Suit) and works under DARPA. After the horrific event occurs, he is sent to aid Marines in order to take back Providence from a horde of Russian robots, along with rescuing Doctor Francois Candide. Theres a couple of twists throughout the incredibly short campaign, but the story is far from the most intriguing part of Vanquish. Sam Gideon is a very stale protagonist and if it werent for the Transformers/Dead Space-esque helmet animation, he may as well be a faceless super soldier. This might have something to do with the laughable B-movie dialogue, although it can be charming and unintentionally comical at times. Theres nothing remarkable or compelling in the actual plot, but some of the events and action sequences that ensure events are kept interesting. Regardless, come into Vanquish with the expectations that this is a faster paced Gears of War-type story, with burly, overpowered soldiers and over the top action, and youll find yourself entertained.Fortunately, the combat system in Vanquish is one of a kind. It retains PlatinumGames iconic slow motion mechanics seen in Bayonetta, Metal Gear Rising: Revengeance, NieR: Automata and various others in their ever-growing catalogue. How it works is a little different, as its activated when Sam is on his last legs, or when he aims down the sights while using the Augmented Reaction Suits abilities. The suits abilities are easily the best part of the combat as they ensure players will not only be highly entertained, but each battle will feel different from the last. Sam is able to get around the battlefield with ease as his propulsion capabilities are attached to his legs, allowing him to slide into cover from hundreds of feet away. You just feel so badass gliding around the battlefield, eliminating enemies in style. Unfortunately, this mechanic is finite, as when the suit begins to overheat, it puts Sam into incredible danger  and it doesnt take a whole lot to accomplish this. A simple punch or kick will overheat the Iron Man-esque suit, but at the very least, youll feel cool smashing a robot into a million pieces. It would have been nice if the suit were able to take more damage than it actually can, because one or two blunt strikes to the dome can do Sam in. Theres nothing worse than accidentally stumbling upon a hidden enemy at the end of a firefight only to have to redo the entire section again because you got too close.Outside of the suit, the gunplay has a lot of variety to it, as there are various types of weapons scattered about the battlefield, each having their own upgradable ranks. Upgrades are acquired two different ways: by finding randomly dropped upgrade nodes, or picking up a weapon while having it in your inventory with full ammo. The upgrades arent entirely unique from one another, generally doing more damage or increasing the ammunition stock, but its still an entertaining side activity. Each weapon their own creative functionalities, some shooting regular bullets while others firing different forms of energy. The only disappointment is there is no real build up to these weapons. Right from the beginning of the game, you can find almost every single one of these weapons in crates, so it never makes you feel like theres something greater out there. Being a nearly seven-year-old game, Vanquish is definitely not up to snuff with most modern games on a technical level, but there is some fantastic designs that do hold up. The core visuals have been touched up quite nicely from its original (barely) 720p resolution on the last generation of consoles. The port has been optimized very well, with our GTX 1060 being able to maintain a steady 60fps at 1440p with no problems at all. There are even a ton of graphical options to go through, from quality of shadows and textures to LOD and HDR settings. Not all is great, though, as we did notice some technical oddities that carry over from the last generation. For example, cutscenes, while being re-rendered at a higher resolution, have some strange framerate and stuttering issues. The in-game codec moments also seem to drag the framerate down to 30fps despite having control of Sam. Theres also mention online that theres a bit of a Dark Souls effect going on with the framerate, where Sam will take far more damage when youre running at 60fps versus 30fps. This could potentially be fixed with a future patch, but as of this review, it remains a problem, making the hardest difficulty almost impossible to play without some modifications to the settings. Overall, though, while there are issues, the optimization for the PC port is in the positive spectrum, especially considering the games age.Finally, as someone who personally prefers controller for anything outside of first person shooters and real time strategy games, keyboard and mouse works amazingly well for Vanquish. Because of how fast paced the combat is, having a mouse to properly aim is vital, and all of the commands are nicely tucked next to one another. Having the slide ability assigned to the Shift key is perfect as its in reach of the general movement controls, along with rolling (or Tactical Evade) being setup on the space bar. The only command that, while is in the general reach of your left hand, can be difficult to remember is the grenade swap as its placement is on the 4 key. Regardless, all commands are completely remappable, so if you dont like the default setup, youre able to change them without much trouble. Closing Comments:Even after nearly seven years, Vanquish still has some of the best combat of any action game. Its fast, its intense and most importantly, its downright fun. Unfortunately, variety isnt the games strong point. From an artistic perspective, not a whole lot changes from the beginning of the campaign to the end; everything has a sterile mechanical look to it that refuses to change. Its also criminally short, coming in between five to six hours. Granted, its non-stop action, but youll have a burning desire for even more as the credits begin to roll. Regardless, Vanquishs strengths are in its gameplay mechanics as skating around on your knees and taking down enemies with the unique arsenal is highly engaging. It helps that the PC port, outside some oddities, is done with care, with optimization being a positive component, and keyboard & mouse controls feeling natural. In the end, Vanquish isnt a perfect game by any means, but its high-octane combat makes it a must play for any action fan.", "date": "May 31, 2017", "grade": 4.0}