{"name": "Friday the 13th: The Game", "ref": "https://hardcoregamer.com/?post_type=post&p=258931", "text": "Even before Friday the 13th: The Game was announced, people had been desperate for a game just like it. After all, slasher movies offer the perfect setup for video games where the goal is either to kill everything in sight or survive an almost supernatural onslaught. Thats why we now have asymmetric multiplayer releases like Dead by Daylight out there. Unfortunately, titles such as these miss out on the potential to use slasher icons in any official capacity. Originally created under the title of Summer Camp, developer IllFonic was offered the chance of a lifetime when Crystal Lake Entertainment gave them the rights to turn their multiplayer-focused horror homage into an officially licensed Friday the 13th experience. Friday the 13th: The Game should immediately feel familiar to fans of horror movies, regardless if they adore Jason Voorhees (though it helps tremendously to be a fan of the source material). Each match begins on one of three maps based on Camp Crystal Lake, Packanack Lodge and Higgens Haven where a character is immediately killed off by Jason. All the unfortunate camp counselors scramble off in various directions and thats when players take over. Once in a game of up to nine counselors against Jason, youll spend a few to fifteen minutes scrambling for a way out or potentially kill him. There are a handful of ways to win. They involve finding the required pieces to start up a car or boat, calling in the police, defeating Jason via force or managing to evade the menace for an entire match length. Oh, or if the sometimes imperfect dedicated servers drop the Jason player from a match entirely, then youll win an unceremonious and seriously disappointing victory.Mr. Voorhees, on the other hand, only has one goal on his mind: kill everyone. Fortunately, he comes with a slew of supernatural powers to help in this effort. Thanks to Predator-style skills, he can detect nearby sounds of panicked counselors running through the woods. A rechargeable ability takes this further by outlining nearby prey in red or highlighting an entire building if at least one person has scampered inside. Theres even an interpretation of how bad guys in horror films can somehow always catch up to people despite only menacingly walking around. First is a skill which allows Jason to invisibly rush around at high speed for a few seconds. When this occurs, anyone nearby gets static obscuring their screen. As such, someone is likely to turn around and see Jason standing directly behind them once the static dissipates. Another move allows Jason to immediately warp anywhere on the map to seek out stragglers. There are variations on the exact way Jason and the counselors play. Thats because there are six different version of Jason to choose from (renditions of him span from Part II all the way to Jason Goes to Hell) and ten counselors. Each character has their own strengths and weaknesses to work with. For example, a few Jasons are actually capable of running. Similarly, counselors differ in strength, speed, stealth and stamina, though you can equip perks to help out. Players gain XP and CP after every completed match. CP is used for purchases of perks and new kill animations, while XP increases levels. Leveling up is required to unlock characters as well as new bits of clothing for them to wear. When Friday the 13th: The Game functions as expected, the game is an utter joy. The tension of being dropped in with a few other counselors and a powerful adversary is palpable. Most tend to play it safe and lock doors or set traps behind them. Jason players, on the other hand, do their best by playing mind games with others  scaring and separating them. To actually work together, find all you need to escape by car or boat, and making it out alive is a true victory. To kill off all other players as Jason similarly feels seriously awesome. Despite only lasting a maximum of fifteen minutes, some matches tend to feel much longer due to an overwhelming sense of dread.The unfortunate thing is that Friday the 13th: The Game simply isnt ready for prime time. Regardless of the platform, the game suffers from a wide variety of bugs and glitches. These include moments where button prompts spontaneously become specific and tough to actually activate as well as simple things like people clipping through doors, walls and cars or characters ragdolling in hilarious fashion. Larger issues include the dedicated servers and their limited connectivity (leading to some folks not getting into games at all). An issue like that should be resolved as the player base levels out post launch, at least. Meta-game related bugs include the sporadic ability to actually gain XP and level up. Many players currently cant level up  locking them out of unlocking new, better characters to play as. Its still unknown as to whether XP will be retroactively granted to these players once the problem is resolved or not. Aside from the XP bug, players can live with glitches. Theres also another way in which the game feels like an Early Access release, though; it lacks a real breadth of content. Why is there only one mode and three levels to play on? Why do we have to watch the same ridiculous intro video at the beginning of each match? Also, the promised single player mode did not make it in time for launch and doesnt currently have a specific release date. In Early Access, it would be easy to recommend with the confidence that the game would get the polish it needed over time. By launching as a full release, Friday the 13th: The Game doesnt inherently feature such a promise. If the developers wanted they could simply wash their hands of the game beyond server maintenance and never look back. That, of course, would make an already agitated fanbase angrier. Closing Comments: Players can absolutely see the incredible potential of Friday the 13th: The Game. When the game works without issue, it provides a fantastic, tense experience unlike other asymmetrical horror games on the market. It could just be so much better. Polishing off the bugs and expanding with additional content and modes would turn this into a title that becomes a longstanding favorite rather than something folks play for a hot minute before moving onto the next Early Access multiplayer title. To be fair, chances are well get more content and see the glitches cleaned up, but its unknown when that will be. The Early Access feel of Friday the 13th: The Game may scare away potential players and that totally makes sense. If you include yourself in that camp, then hold out until more updates roll out. Or, if you love Friday the 13th and couldnt care less about bugs, then jump right in as the playerbase is lively and ready for more survivors/victims.", "date": "May 29, 2017", "grade": 3.0}