{"name": "Deemo: The Last Recital", "ref": "https://hardcoregamer.com/?post_type=post&p=258317", "text": "If not for Limited Run Games, it would appear to most that the PlayStation Vita has been all but abandoned at this point. Releases still make their way out regularly in Japan, but the case is quite different in the U.S. Its because of all this that the digital (and upcoming physical) release of Deemo: The Last Recital in North America and Europe comes as a shock. Originally released for mobile devices, this touch-based rhythm game makes the transition to Vita mostly intact. Of course, this leaves gamers with questions as to whether they even need to snap the game up on Vita or can instead opt for its original incarnation, especially if their Vita is currently covered in dust. Deemo: The Last Recital shares the story of a young girl named Alice and a silent, almost stick figure-shaped being known as Deemo. Well, maybe its not fair to call Deemo completely quiet as he plays the piano masterfully. The two meet when Deemo is simply playing away and Alice crashes through his extremely high ceiling. Together they realize that his piano-playing causes the magical tree on top of the piano to grow. As such, Deemo must play music continuously until the tree can finally reach the ceiling for Alice to climb up and make her way back home. Its weird to see a music game try to explain its mechanics, but theres certainly no harm in it.The tree also plays a mechanic in how and when new tracks are unlocked. You see, at the very start, Deemo: The Last Recital is anemic when it comes to available songs. Fortunately, playing songs helps the tree grow, and growing helps you collect new songs. After reaching certain heights, songs get unlocked for play at three different difficulty settings. Youll definitely want to play through on each difficulty (if possible) and replay songs after getting better. This is because you gain additional points by performing better on a song in a second attempt. Playing on a different difficulty for the first time also awards a full amount of points toward tree growth. Be sure to also click around the environments when between songs, too, as occasionally songs are hidden away in different rooms. The soundtrack is a serious high point for the game. No matter what genre youre into, chances are youll find some songs representing it throughout. From piano ballads to j-pop to dubstep, youll find it all.Gameplay is about what one would expect from a classic music game. Notes fall from the top of the screen to the bottom, at which point you tap on them. Tapping right on the beat results in receiving charming notes, while being ever so slightly early or late does not. One key differentiator between this and Guitar Hero or Beatmania is that there are not specifically-defined lanes for notes to fall within. A slow part of a song may may only appear to have notes in three columns. However, as the song picks up the pace, there will now be notes falling from seven columns of varying widths. Things expand and contract as determined by the song. Despite this smart choice, a few annoying UI decisions were also made. For example, almost all notes are the same color. Its much tougher to read densely populated track note charts because of this. Some may also have a bit of trouble wrangling with the Vitas large screen. While normally the wide screen is wonderful, it provides a barrier for folks without longer fingers. Basically, if you want to play Deemo: The Last Recital while holding a Vita from both sides (presumably the normal way of holding it) then you need to strain and reach out to the center with your thumbs on a near constant basis. Theres also the simple weirdness of how song tracks feature the drollest animation possible which is nearly identical between them. It is a huge disappointment after all the polish given to the cutscenes and gorgeous song artwork on the menu. It is important to note the differences between the versions. Mainly, Deemo: The Last Recital is not simply a pure port from iOS and Android. For one, the cinematic animated cutscenes have been redone. There are also Vita-exclusive new modes included. These are the After Story, Duet and Duel modes. After Story provides a bit more of the games storyline for players to enjoy after completing the main campaign. Duet and Duel offer ad-hoc multiplayer play. Of course, it also costs $14.99 on the PlayStation Store whereas the mobile phone iteration is available as a free download. As you might expect, though, that means there are copious amounts of song DLC to purchase on Android and iOS. With that said, Deemo: The Last Recital on Vita also comes with its fare share of DLC to buy. The thing is, the base game already comes with around 100 tracks to enjoy. Its only if you want to seriously expand your catalog with dozens of additional songs that DLC comes in handy. Tons of song packs were made available on launch, most costing $3.99 a piece. Or, folks can simply go and pick up the two DLC bundles (which grant access to all the current DLC) for a combined price of $84.99. Deemo on mobile is still getting new songs, so if it succeeds on Vita then expect to see more songs find their way onto the PlayStation Store in the near future. Closing Comments:There are pros to picking up Deemo: The Last Recital on Vita. This single purchase opens you up to tons of what the mobile game has to offer without any need of DLC purchases. The width of the Vita itself, however, might inhibit comfortable gameplay for some out there when compared to thinner smartphone screens. No matter which version you play, though, theres still some gameplay design decisions which dont make total sense to music game fans. Fortunately, the highly varied soundtrack makes grinding mostly bearable as players pursue growing a magical tree to its fullest. In a rhythm gaming dearth, Deemo: The Last Recital stands as an imperfect, but mostly enjoyable, title to spend time with.", "date": "May 24, 2017", "grade": 3.5}