{"name": "Soul Hackers 2", "ref": "https://hardcoregamer.com/?post_type=post&p=426230", "text": "It has been nearly twenty-five years since Atlus released the original Soul Hackers on the Sega Saturn, with its arrival outside of Japan only coming in 2013 with the Nintendo 3DS remaster. While it saw western interest with the PlayStation 2 games, Devil Summoner hasnt exactly been the most sought-after Shin Megami Tensei series, especially after the massive success of Persona and the mainline title as of late. Still, it holds a special place in the hearts of many dedicated fans, with the hopes of seeing another more Raidou Kuzunoha or even Soul Hackers. Thankfully, the latter has come true, as Atlus has made a long-awaited sequel to the RPG classic. With such promise in a modern Shin Megami Tensei title, could Soul Hackers 2 be the best weve seen from the franchise or has it lost its charm?The story of Soul Hackers 2 is a strange beast. Its deep in theory but lacks the scope outside of its handful of characters and ideas. Its hard to follow at times, especially right from the get-go where it took hours before we even began to perceive what was going on. Its all about, as one might expect from a Shin Megami Tensei, the end of the world, or at least being on the precipice of one. Controlling the AI protagonist Ringo, players are sent on a journey through the world of Summoners as organizations Yatagarasu and the Phantom Society are warring against one another, and one man, Iron Mask, is trying to collect mysterious powers called Covenants. A lot of the dialogue drags, which is unfortunate because while it slowly expands this fascinating world, the plot never breaks out of its narrow view. The story feels too self-contained to be a world-ending threat, and only focuses on this small group of individuals with little interaction outside of Iron Mask and his powerful pet Zenon. The story ends up being more of an afterthought, which is a shame considering just how much time is spent sitting in a room and explaining whats going on in the most mundane way possible. Theres a decent amount of character development, at least, with the five having solid backstories and personalities.If youve played a Shin Megami game, youll feel right at home with Soul Hackers 2. This is a turn-based RPG with a lot of trappings weve become accustomed to. There are four party members who are able to equip demons to obtain their abilities and attributes in battle. Compared to first title, and most Shin Megami Tensei games in general, Soul Hacker 2s combat is a lot more simplified with far less interesting systems. Theres no worries about controlling demons in battle too much, and theres no actual means of negotiating with enemies. This is a boiler-point turn-based system where the focus is to find the enemys weak point and exploit it to do extra damage. Thats not to say there arent additional elements in play, such as Stack attacks, which deals increasing damage based on the number of times the enemies weaknesses are hit during a turn. Theres also effects such as healing the party or a chance to sleep the entire enemy party, but otherwise theres not much to combat itself. The one aspect Soul Hackers 2 emphasizes, and can make and break a lot of fights, is the aliments. Sleep, daze, faint and especially paralyze are just some examples of the strongest tools in any players arsenal, stopping an enemy in their tracks or weaken them in the long run. Poison is even super effective, with each tick of damage doing a substantial amount each turn.How contracts with demons are obtained other than the standard fusing methods is a little different from what weve become used to. Exploring what would be considered a dungeon, talking to one of the stocked allies that has been sent out to scout the environment net a demon for recruitment  among other things such as bringing back rare items or healing the partys HP and MP. Depending on the symbol above their head, there can be a demon to negotiate with, mainly just asking a single question or more than likely just asking for a simple exchange for their services. This can be a good chunk of HP, MP or even an item that is most certainly on your possession. This puts a bit of an RNG into demon collecting as sometimes there will be no option to recruit a demon for a long while, while other times the one that appears might be too high of a level. It takes out some of the fun with negotiating with demons where who knows if theyll just turn around and run away with whatever was given to them. At the same time, its a more efficient and guaranteed way in obtaining demons without being disappointed. Regardless of how you might think of this, the combat is one of the more redeeming qualities of the RPG, and collecting the immense number of legendary monsters is addicting. Soul Hackers 2 is unlike the more recent Shin Megami Tensei V and closer to the series roots as a corridor explorer. What we mean by that is tha, the environments are enclosed, and while theres a little bit of exploration here and there, its more or less linear. This wouldnt be a huge problem if the environments themselves werent so bland. This is a vibrant, beautiful world, but every time a new dungeon is introduced, they are muted and devoid of much color. Even the Matrix, which is essentially the subconscious of the three human party members, is the same dark purple, blocky aesthetic through and through. Granted, this is a Shin Megami Tensei game, so its typical to see a bit of a darker and more brooding setting, but theres nothing fun about exploring subways or abandoned complexes. It doesnt help that each new area, despite being relatively short, has a surprisingly wide level range of demons. This usually is within a five to ten level variant from start to finish, quickly overwhelming the player to level up at a much quicker rate. While theres a lot to do with the story dungeon and the Matrix, theres grinding whenever the next story section is reached as enemies will quickly over level the party.Visually, Soul Hackers 2 has a pleasing aesthetic, at least outside of the dungeons. As mentioned before, theyre muted and rather plain in comparison to the world Atlus has established. The cityscape is vibrant and full of life, but everything outside of that is bland and lifeless. Regardless, the anime and cyber visual style breathes a lot of life into this world, and the demons have never looked so good. It helps that the soundtrack also has some phenomenal tracks, especially the boss themes which would get anyone bobbing their heads. From a technical perspective, though, theres at least one thing that could have been better done. On PlayStation 5, the load times are surprisingly long. Maybe its just that weve become so accustomed to load times that are a couple seconds to basically non-existent, but even for a less graphically intense game such as this, going between areas takes over ten seconds in length. That doesnt sound like a lot, but it adds up as you traverse the massive city and go between dungeons and the Safe House to refresh your MP. Regardless, even with its issues, the presentation in Soul Hackers 2 is one of the more compelling portions of the experience and will keep players invested. Closing Comments:Soul Hackers 2 is a by the books turn-based JRPG that doesnt do anything particularly memorable nor offensive. The story is lacking in scope, dungeons are bland, and theres questionable design choices to tried and true systems. It doesnt help that theres less-than-stellar load times on the current generation consoles, especially considering the amount of traveling thats required. With that said, theres decent character development, a fantastic combat system and of course all your favorite demons and creatures youd expect, and then some. On top of that, the visual aesthetic (at least outside of dungeons) is tremendously vibrant, bringing your screen to life in the most enticing way possible. In the end, I thoroughly enjoyed my time with the game, but it comes with numerous flaws. Soul Hackers 2 has all the trappings of a great Shin Megami Tensei game, including heart, but lacks the substance to make it special.", "date": "August 18, 2022", "grade": 3.5}