{"name": "Portal Knights", "ref": "https://hardcoregamer.com/?post_type=post&p=256766", "text": "The debut of Minecraft led to a cultural shift for gaming. Before it, crafting games were considered a niche at best. With Mojangs legendary title, it became not only mainstream, but something that transcended the genre altogether. Since then, countless clones have hit the market  with few entries in the crafting genre trying anything new or bold. The recent LEGO Worlds added a sense of structure to everything while retaining a sandbox-style creation suite when it came to creativity. Portal Knights mixes things up even more, however, by adding in a heavy blend of RPG mechanics and character selection.The game has been available for quite some time on PC via early access, but has finally made its way to consoles. Starting out, you can craft a character from one of three different classes. The warrior excels at close-range combat, while the ranger uses long-distance weapons like bows and arrows to excel. Finally, the mage is the way to go if you prefer a magic-heavy approach to things. After choose one of three knight types, you can either explore the world, destroy the world a bit, or better yet, destroy it and then mine it for materials to make progress.As a warrior, youll start off smashing the world apart with your bare hands before getting a sword and then youll encounter fiendish enemies. Well, not so much fiendish as slime-based. Theyre a great way to learn how to properly manage your resources. Sure, you could kill them in fewer hits with the sword  but that has limited uses. If you attack with just for fists while using the trigger-based targeting system ala most 3D Zelda games, youll be just fine. Simply wait for them to jump, attack, and repeat the pattern. Conservation is key and wisely using what you have around will allow you to succeed quickly. Building up a healthy supply of most resources means that you will be able to quickly craft things like better weapons, healing items, and most importantly, portals. Portals are your gateway out of the stage, but require you to traverse an ever-increasing array of enemies to properly use. Building up a portal is done brick by brick, with your amount in-hand resetting upon death. Fortunately, death doesnt take anything from you but in-game currency, so you can die without much of a penalty and simply resume play from where you left off. Its pretty fair and the games approach to teaching you in a largely hands-off manner makes it the best way to go.The way of the warrior is incredibly difficult, as short-range combat gives you very little room to move. You do have speed on your side to some degree  but you must plan out every attack and be sure to connect whenever possible. The other character types benefit from long-range attacks, but have to sacrifice damage. No matter which type you choose, you have to use precision or else your limited attacks will be wasted. Those who prefer long-range attacks will probably want to go with a ranger or mage, but its worth trying out each type. The warriors starting area tends to be a bit easier, so while it is inherently tougher to use a short-range character, it is a better starting off point. Enemies have more predictable patterns and do far less damage to you than the fire-wielding foes youll encounter right away in the mage and ranger worlds. The crafting is among the most user-friendly out there  but not being able to pause the game definitely makes you have to think in the moment. You will need to make a little hiding spot to work on things like a bench to make better items. Youll also want to build a chest so you can store things that you may not need right away  but still want to have readily available if you need them later. Sure, a giant set of dirt blocks wont help you now, but they might be a vital component to something you need later. Core elements like water and other nutrients are also musts for long-term storage, as you dont want to fill up your far too small backpack with trivial items like that.Item management is surprisingly easy on a controller. The d-pad gives you instant access to four items, while bumpers let you move between the entire row of items and the right trigger lets you use them. Its simple and gets the job done even if it isnt quite as perfect as every item being given its own key on PC. Movement is a breeze using the left stick, but the right sticks camera movement can be a bit tough. It gets stuck behind things when youre in tight quarters, and locking the camera beyond you can leave you unable to see enemies clearly and force you to take needless damage. The aiming reticle is also a bit small, and having the camera and aiming tied to the same stick can cause some problems when youre surrounded by enemies. Visually, Portal Knights looks good. It has a clean art style that manages to both seem slick while also keeping things in line with what people would expect from a crafting game. Character models are fine, with just enough animation to work  but not so much animation that it can bog things down. The environments are all gorgeous, with a heavy dose of atmosphere thanks to the lighting. Various effects off of fire and especially moonlight give areas a unique feel to them even when the core mechanics from stage to stage arent going to change much.Musically, Portal Knights is lacking a bit. The soundtrack has a cheery and sometimes epic feel to it, but nothing really sticks with you while youre playing. Its perfectly functional music, but isnt going to be on anyones playlist after a long play session. Fortunately, the sound effect work fares better  with flames sounding like they will sear anything they touch, and sword slashes have a reasonable clank to them. Arrow shots also dart through the air with great speed, and sound as they should. Closing Comments:Portal Knights has a few shortcomings, but the overall experience is a lot of fun. Its blend of RPG-esque leveling up with crafting and a steady learning curve keep you engaged. Those looking for a solid gateway game into the crafting sub-genre should check it out  especially if they enjoy RPGs. The music does hold things back, but every other major part of Portal Knights works well.", "date": "May 18, 2017", "grade": 4.0}