{"name": "Injustice 2", "ref": "https://hardcoregamer.com/?post_type=post&p=257506", "text": "Back in 2013, NetherRealm Studios got the chance to make a new type of fighting game featuring some of the worlds most beloved heroes. Thus, Injustice: Gods Among Us was born. Combining some of the best elements of their Mortal Kombat games with new mechanics, NetherRealm gave us something new and refreshing. Four years later, the studio is back with a sequel, Injustice 2. With plenty of content, a deeper campaign and a brand-new RPG-inspired gear system, is Injustice 2 the game we deserve or should it be locked away in a Red Sun cell?Injustice 2 picks up after the events of Injustice: Gods Among Us. Supermans Regime has fallen, allowing Batman and his Insurgency to begin rebuilding the worlds societies. Soon, however, new and old threats start to arise. Black Adam and Wonder Woman hide from Batman as they plot to bring back the Regime, Gorilla Grodd gathers the remaining villains to form the Society, and on the horizon, is Brainiac who has come to Earth capture the last Kryptonians.Injustice 2s story is surprisingly darker than its predecessor with a strong opening and strong closing. The story is about seeing if two opposing forces can put aside their differences in the face of a greater threat, and its executed well at the start and close. NetherRealms writing has continuously improved with each game, and Injustice 2 is the best script yet. Its unfortunate that the middle of the plot feels like its just treading water and wasting time. Characters are rushed in and out, storylines opened and closed abruptly, and theres not even a purpose for a particular faction in the game. For example, apparently, Hal Jordan has been struggling with rage for a while, which could have been an interesting character arc had it not been rushed in and out in the span of a few minutes. Interesting arcs like this deserve time to develop, but Injustice 2 doesnt seem to want to develop any of the characters outside of Batman and Superman. The most disappointing aspect of the single player campaign is its structure. NetherRealms multiple-chapter approach to fighting game campaigns felt fresh back in 2008 with Mortal Kombat vs. DC Universe, but the studio has done little to shake up the formula and iron out its issues. Chapters consist of four fights, though in Injustice 2 a handful of chapters let players choose between two fighters. Its a neat addition, but it doesnt help that many fights still feel contrived.The campaign wont last long and can be beaten in anywhere between 3-5 hours across twelve chapters. Asides from a choice at the end of the game, there isnt much of a reason to go back and replay the story. There is so much more to do and see in Injustice 2, though.NetherRealm has fine-tuned their fighting mechanics over multiple games and their masterful technique shines through in Injustice 2. Each character comes equipped with a large variety of combos, special abilities, character abilities and super moves. On top of what each character can do, there are also environmental hazards and stage transitions to deal with (though these can be turned off). The combat is far more fluid than previous NetherRealm games, though it doesnt animate as fluidly as other games in the genre. Still, its fun, brutal and theres a lot to learn and master the combat system. Thankfully, NetherRealm has implemented the proper tools to help players of all skill levels master the games various mechanics and characters. Injustice 2 has basic tutorials that run players through all the basic mechanics of the game and then there are more specific tutorials that teach you how to perform things like characters special abilities. Theres enough here to give players the tools they need to learn, but not so much that theres no room left for experimentation in the games various stable of content.Injustice 2 is the most feature-rich fighting game to come out in years. There are 28 playable characters at launch (Darkseid is available as a DLC character at launch), which is the largest roster NetherRealm has had for their games at launch since Mortal Kombat: Armageddon. Fan-favorites like Batman, Superman, Wonder Woman, Flash and Green Lantern return alongside newcomers Blue Beetle, Black Canary and Swamp Thing. Every character feels different without anyone feeling particularly overpowered. Though some fan-favorites are missing, this is a strong roster of playable characters.The single player content is further fleshed out by the Multiverse. Its best to think of the Multiverse as the evolution of Mortal Kombat Xs Living Towers. These are randomly generated worlds populated with towers containing various challenges. Itll keep players on their toes and the rewards you can get from completing these challenges can be well worth the effort. There are also traditional towers where players must defeat a series of enemies to earn character endings. With 28 playable characters comes 28 different character endings to view. Then theres the multiplayer experience. Players can participate in ranked, unranked, and king of the hill style matches. Injustice 2 also introduces guilds, which offer all types of rewards. Testing the game on live servers yielded mixed results. We enjoyed matches with no lag and little latency, but also encountered matches with significant lag. Injustice 2s multiplayer certainly doesnt suffer from launch issues that plagued other fighting games, but it still has issues. New to the multiplayer is the automated AI battles. Upon creating a team of three characters, youll be able to pit them against other players teams. Its a similar system used in the mobile game and is an easy way to earn loot when youre not playing the game.Tying the entire Injustice 2 experience together is the new Gear system. Gear is weapons, armor, abilities, and shaders that can be unlocked via an RNG loot system. All Gear can be acquired via random drops at the end of matches, earned by beating challenges in the Multiverse or unlocked by opening Mother Boxes. What makes Gear so important, and controversial is that it not only can vastly change the look of a character but also change their stats.Each character has five gear slots, two ability slots, and a shader slot that can be filled with Gear. Simple Gear can add stat buffs like increased health, defense, and damage. However, Elite Gear, specifically Gear that forms a set, grants significant stat buffs and even new abilities. Things would quickly become unbalanced online, but NetherRealm was smart and turned off any bonuses when competing in ranked matches. All your competitors will see is the sweet looking Gear your character is wearing. Gear looks cool and is a neat addition to Injustice 2, but its also the gateway to the games microtransaction system. There are essentially two levels of currency; free useless currency and premium currency. Credits are doled out generously throughout the game and can be used to buy Mother Boxes to unlock more Gear, which is fine. However, youll need lots of Source Crystals to tinker with items you already own, and unlock the most sought after items, like the premier skins. This currency is not doled out very generously, and its not hard to see things spiraling out of control once players find they cant unlock all the cool stuff quickly without spending money. The Gear system is cool, but it is hard to shake the feeling that its only there so that Injustice 2 could have microtransactions.Injustice 2 may be running on the dated Unreal 3 Engine, but NetherRealm has crafted a stunning looking fighting game. Character models and textures are well detailed, especially considering how many different sets of Gear and shaders the developers had to make for each character. The world itself is well-detailed, though NPCs are still lacking in that department. Cutscene animations are particularly well done with the lip-syncing approaching the uncanny valley. Combat animations, on the other hand, are a bit stiff.The presentation is supported by an all-star cast that impeccably delivers NetherRealms script. Kevin Conroy (Batman), George Newbern (Superman), Tara Strong (Harley Quinn), Robert Englund (Scarecrow), and Susan Eisenberg (Wonder Woman) among others reprise their roles from previous DC projects, and they are all spectacular. This is a cast that will make all DC fans jump for joy. Closing Comments:Injustice 2 is nearly everything youd want a sequel to be. Its bigger, badder, and filled with more content than a typical fighting game has at launch. Players will have lots to do as they strive to master the 28 playable fighters through the Multiverse, online multiplayer and local versus matches. Then theres the Gear system, which gives players infinite ways to customize and outfit their characters. Still, its not a perfect sequel. The story treads water in the middle and NetherRealm still hasnt found a way to make to make the battles not feel contrived, hampering the excellent beginning and end of the game. Its also difficult to shake the feeling that the Gear system was only introduced as way to facilitate microtransactions. Even so, Injustice 2 sets a bar for the amount of content and depth a fighting game should have at launch. With a strong roster, lots to do, and a combat system that can be enjoyed by new and masterful players, Injustice 2 is the hero we deserve.", "date": "May 17, 2017", "grade": 4.0}