{"name": "Rollerdrome", "ref": "https://hardcoregamer.com/?post_type=post&p=426161", "text": "Since making a name for themselves with OlliOlli in 2013, Roll7 has established their place among other indie studios thanks to their challenging gameplay which rewards players that are willing to fail again and again for the sake of progress. Even as their games have gotten more accessible over time, the sense of speed that players need to maintain in both of the OlliOlli sequels and Not a Hero makes each level as tough to put down as they can be to finish. The British developers latest project, Rollerdrome, fully embraces this philosophy by creating a futuristic bloodsport wherein players must shoot to survive an arena packed full of enemies all while on rollerskates, with your constant momentum and newly-spawning enemies leaving little time to catch your breath. Although Rollerdromes story never goes beyond the surface level of the exploitative themes it explores, its engaging art style and adrenaline-inducing gameplay packs a ton of excitement into its relatively short but tough levels, encouraging players to replay them over and over not only to complete challenges, but eventually just to make it out alive.The main campaign of Rollerdrome takes place during the 2030 World Championships, as its organizer, the tech corporation Matterhorn, looks to distract people from its attempts to integrate their own style of policing into the cities of the world by making this years tournament more thrilling and deadly than ever before. As newcomer Kara Hassan, players must rise through the ranks of the tournaments all the while investigating which of their fellow competitors are truly trying to help you out, and which have other motivations for making it to the finals. Despite featuring a large roster of participants in the tournament, players never actually get to see another human being during the brief first-person sections that make up the plot, with the story instead being told through newspaper headlines, radio broadcasters, overheard conversations behind closed doors and other collectibles that the most curious players will dig up. As the tournament nears its end, these snippets feel like theyre building up to something greater, but the lack of opportunities to express your approval or disapproval for your competitors and Matterhorn makes the predictable conclusion feel lackluster as the story winds down without any greater message to impart to players.Right off the bat, skating in Rollerdrome nails the sense of speed and momentum through its constant motion, while also allowing players to easily perform tricks by grinding on railings or leaping off the arenas various ramps and quarter pipes to grab, spin and flip in the air. In addition to just looking cool, pulling off tricks quickly becomes essential as it refills the players ammo, with dodges offering a similar dynamic by helping players avoid enemy (or House Player) fire and also providing ammo if the timing is correct. Perhaps the biggest difference between the OlliOlli series and Rollerdrome is that its impossible to crash in the latter, no matter how hard the player may try. This may seem like an odd design choice at first, lowering the stakes in a game that boasts about its supposed level of challenge, but as the enemies grow in quantity and variety, forcing the player to nail the landing of every trick while also surviving the onslaught of dangerous attacks would quickly get overwhelming. Meanwhile, regaining health can be accomplished by eliminating enemies and collecting the green orbs that drop from them, encouraging players to find the fastest way to finish off foes in order to recover from previous missteps. Since players can quickly lose damage without realizing it and using ammo from one weapon borrows ammo from all of them, new players will need to adjust to the reliable pattern of emptying their clip upon the nearest enemies, grabbing the health they drop, performing tricks and dodges to regain ammo and repeating until the arena is clear of enemies or the health bar reaches zero. From the beginning, Kara Hassan will only have access to dual pistols, but it wont take long for players to flesh out their arsenal with a weapon being assigned to each direction of the d-pad. The pistols and shotgun have the benefit of locking onto enemies once players are close enough and facing in their general direction, but players can also pull the left trigger to activate Reflex Timing to slow the on-screen action and unload additional rounds, or in the case of the shotgun, fire more damaging slug shots if players are able to nail the timing. Players can also activate Super Reflex by pulling the left trigger immediately after performing a perfect dodge, slowing down time even further and providing a boost of damage. Unlike ammo and health, the reflex bar refills without player input via a cooldown, ensuring that its regularly available but cant be overly relied upon. More powerful weaponry will have smaller clips and force players to manually aim their shots, but the damage successful shots will deal to enemies is worth the risk. As players grow more familiar with the weapons and abilities at their disposal, the most rewarding aspects of gameplay comes from determining how you can most efficiently take out an enemy, as slowing down time while firing pistols can quickly shrink the health bar of an enemy thats trying to teleport away, while explosive barrels and well-timed slug shots from the shotgun can finish off snipers and bat-wielding House Players in a matter of seconds.Although the total number of arenas is relatively small, each new level offers different ways for players to take advantage of their verticality, as you smash through windows or glass panels on the floor to reach new areas, or locate boost pads on the floors and walls to help close the gap on a distant enemy. Each level also features ten challenges, and while players dont need to complete every single one to reach the championship, revisiting past stages to attempt its remaining challenges is a recurring part of the main campaign, as each stage of the tournament requires a certain amount of challenges to be completed. At first, this requirement isnt too burdensome, as new weapons and abilities make returning to familiar levels a welcome opportunity to boost your overall score and time of completion, while also knocking off easy tasks such as collecting five combo tokens and shooting rockets. But as the campaign progresses, some of these challenges can become a bit too needy, forcing players to pull off a specific trick at a specific part of the stage while also avoiding enemy fire, or reach a high combo total by killing consecutive enemies in a rapidly decreasing window of time. Luckily, dying after completing a challenge still marks the task as completed, allowing players to focus on a given objective while surviving just long enough to achieve it. Depending on how much you struggle with these challenges, completing the main campaign will likely take most players around four to six hours, but the most dedicated competitors who want to finish every challenge and rise to the top of the leaderboards could easily spend many more hours attempting to reach 100% completion. If thats not enough to satisfy your crave for skating and shooting, Rollerdrome also features an Out for Blood campaign, which retains all of the enemy varieties you face into the same set of stages while also increasing the overall quantity of foes and the damage they can dole out. Although the challenges for these revamped stages are now fully optional as survival is the only requirement for progress, the sheer amount of enemies that are crammed into the first group of stages is shocking, with new waves spawning in just as you feel like you may have finally reached the end. Only players who are truly able to master the sport of Rollerdrome will be able to make it to the second tournaments finals, as death will come quick to those that arent fully focused or taking advantage of the various mechanics. On the other side of the spectrum, Rollerdrome also offers generous assists that are available right from the start, including invincibility, infinite ammo and reflex time, lowering the overall game speed and removing the need to complete challenges in order to progress. Turning any of these on will prevent players from posting scores on the leaderboard, but they serve as a nice backup plan for anyone that needs extra help.From the first second of its reveal trailer, Rollerdromes eye-catching art style leaps right off the screen, which seemingly draws inspirations from comic books and games like Sable. Running at a fairly smooth 60 FPS on Steam Deck, the presentation looks just as stunning in-game both in first and third person, establishing a retrofuture vibe while also making it clear to distinguish different enemy types from a distance. The one area where the visuals dont live up to their full potential is the environmental variety, as later stages of the game borrow from the same landscapes and arena types that players have come to expect with no real surprises in store. The synth-infused soundtrack does an excellent job of matching up with the chaotic on-screen action, providing some of this years best gaming tunes that effectively capture the frantic balancing act players are performing in order to survive the bloodsport. Although there were no bugs spotted during our time with the game, frame drops did occur during the most turbulent moments of gameplay, but fortunately they rarely interfered with our ability to stay alive. Closing Comments:Rollerdrome effortlessly combines thrilling speed and adrenaline-inducing combat to create an exciting mashup of genres that will appeal to sports and action fans alike. The surface-level story, needy challenges and lack of environmental variety hinders the game from becoming something special, but in the heat of the moment, Roll7s latest creation makes it nearly impossible to not pull off epic bits of slow-motion, high-flying carnage that will leave you wanting more. By rewarding players for taking advantage of enemy weaknesses and performing last-second dodges, Rollerdrome creates a satisfying and engaging gameplay experience that will have you returning to the arena for one more round again and again.", "date": "on August 16, 2022", "grade": 4.0}