{"name": "Strafe", "ref": "https://hardcoregamer.com/?post_type=post&p=257194", "text": "The 90s were an interesting time in gaming, in that 3D was coming into its own but still a long way from maturity. Doom had set the PC world on fire with its action, and while Quake couldnt pack the body-count into the levels due to hardware limitations, it was still truly stunning tech for the time. Then everything got all serious for a few decades and it seemed like the arcade-action FPS was dead. In the last several years, though, a combination of genres hit, with roguelike elements rising to the fore thanks to games like Binding of Isaac and smaller-budget titles masking the lack of AAA-funding by using retro-styled art. This gave rise to the roguelike FPS, which focuses more on fast action than tactical thinking, and that brings us full circle to Strafe.Strafe is a purely modern roguelike action FPS decked out in a 90s low-poly, chunky textured skin. Everything surrounding the game itself is as 90s (and sometimes late 80s) as possible, but its heart is more a product of present-day gaming like Tower of Guns, Immortal Redneck, Heavy Bullets, Fancy Skulls, Ziggurat or anything else from that genre than Quake. The FMV clips in the tutorial are a great touch, and its throwback art style a lot of fun, but Strafe is a modern game through and through and a great, bloody time when its parts work together properly.The plot is all but nonexistent. Youre a scrapper on the doomed freighter Icarus taking a long trip outside of civilized space, and the ship is overrun with pasty goons ready to gnaw the meat off your bones. Kills things, dont die, collect scrap and cash along the way, and spend resources on shields, ammo, and other helpful goodies. Survive as long as possible and maybe, with a bit of practice and good luck with the gun mods, youll see the ending. Strafe is hard but beatable, but getting good enough to reach the ending is going to take more than a few runs to polish your skills. At the start of a run you get to choose from one of three weapons. The machine gun is probably the hardest weapon to use effectively, shotgun is a nice middle ground, and railgun is as close to Easy mode as Strafe gets. Spraying down a hallway with a hail of machinegun bullets seems like the best way to go but it doesnt pack the punch of the other two guns in the armament, which is a serious problem when the halls of the Icarus get crammed with goons and gun-bots in full aggro mode. The enemies stand around staring, waiting to be activated by your presence, but when whole room comes to life at once it can be hard to pump out enough firepower to stem the tide. The trick, then, is to manage the horde, picking off a few from a distance while knowing that your butt is covered. This is easier said than done, though, because the level design can get fairly ornate.Strafe is randomized, but its randomized from hand-built pieces, and these can be fairly intricate. Its easy to think your back is safe only to get a rude shock as your shields and health start unexpectedly cratering. The goons that are the bulk of the enemies are melee-only, but they move quietly so its easy to get taken by surprise. Other enemies are the gun-bots, tall goons that move quick and can dodge, and infected air vents that send out toxic orange jellyfish and shoot a spray of damaging goo when destroyed. Later areas get rock monsters, scythe-legged attacker bugs, snipers, and even robo-suited gun goons. Its a good menagerie, but oddly its at its most dangerous in the early levels.Each stage of Strafe is three levels long, and the first area is by far the most overwhelming. The Icarus is a claustrophobic rats-nest of passageways leading to more open areas, but once youre away from the ship the game opens up and, because of this, the enemy density drops. It can take a bit to get a foothold in the caverns and canyons of the second area, but odds are good if you can survive to reach it you can make serious headway towards completing a run. Theres a store in level 2 selling useful goodies, the gun-mod machines will have put some power behind your weapon (or made it kind of suck, if you take a risk on an unknown kiosk and get unlucky), and various power-ups are kicking around to boost power, clip-count, and accuracy. Couple that with more space to work with patrolled by fewer enemies and the first area is by far the biggest challenge of the game. Which isnt to say that its easy, of course. Shields and health can be decimated by one bad encounter, and its rare for either to be topped off to its 100-point maximum value. A bad monster-closet popping open at the wrong time is a great way to go from healthy to Dead Man Walking, holding on to single-digit health points while desperately hoping to find a food dispenser, secret room, or kiosk to trade scrap for shields. Its actually possible, with care and good use of the limited-ammo guns found along the way to fight back from the edge of death, and theres no question how satisfying it is to recover from the desperation of 5 health points to being relatively stable again.While Strafe is a solid roguelike FPS, its worth noting that its still getting a round of patches. I had to quit a game just before writing this because a door wouldnt open despite having found the energy canisters to power it, which would have hurt less if it hadnt been 45 minutes into the run. Most other bugs I would have mentioned are being squashed one by one, but enemies can still fire through doors. In addition to the odd difficulty balance between the Icarus and the rest of the game, Strafe also has bottlenecks at the start of its levels where its easy to get overwhelmed as eight enemies or more swarm you and theres nowhere to run that youve seen yet and can fight effectively in. Getting screwed in an area because of going in guns blazing with an assumption of invincibility is one thing, but being cornered with nowhere to go kind of sucks. There are tactics to make these fights easier, of course, but with shield and health at a premium its frustrating to take unavoidable damage. Closing Comments:Strafe falls short of greatness, but is definitely great fun. Each of the three main guns feels good to wield, and if some of the mods arent as useful as others, there are still ways to use them effectively. The secondary limited-use guns provide a welcome opportunity to change tactics when necessary and grabbing an exploding bug off the wall to use as a makeshift grenade somehow never gets old. The bloody violence is particularly well done, because not only is it fun to get your carnage on, but the bloody trail you leave in your wake is surprisingly helpful in keeping your bearings. Plus you can always shoot an enemy on a toxic orange spill and use their blood to make the floor safe again, which is awfully helpful in a gory kind of way. There are plenty of secrets, occasional hidden levels and many other goodies and bits of weirdness to find amidst the carnage and mayhem, making Strafe a fun and highly replayable action roguelike FPS that wears its love for the 90s on its blood-soaked sleeve.", "date": "May 15, 2017", "grade": 3.5}