{"name": "Puyo Puyo Tetris", "ref": "https://hardcoregamer.com/?post_type=post&p=255525", "text": "Puyo Puyo Tetris is one of those titles that became ubiquitous in the import scene. Part of this is due to the fact that the combination of the known quantities found in both Tetris and Puyo Puyo transcends familiarity to become something unique and new. Credit must be given to the accessibility found in the gameplay, which bypasses the language barrier found in the Japanese only version. That, and people who wanted to play it figured that it would never be localized since Ubisoft held the Tetris license, making the cost of releasing it westward prohibitive. This last one is why the announcement that Sega was going to bring it over was surprising but welcome. I have put an embarrassing amount of time on the Japanese Vita version, so I knew what I was getting. Even so, with a fresh set of PlayStation 4 trophies and an overstuffed package, I find myself woefully addicted all over again.Of course, everybody knows Tetris. The most destructively habit forming thing to come out of Russia short of illicit opium laced vodka, the puzzle game out of the 80s had players matching up four block shapes to clear lines, preventing the pile from reaching the top of the board. While most known from the official Nintendo licensed NES and Game Boy versions, the arcade version, as well as the unofficial Tengen NES release included an adversarial mode. Puyo Puyo, on the other hand, was adversarial from the start. Players matched beans of various colors to create groups of four or more, planning ahead to create chains of matches, causing garbage blocks to fall on an opponent. Anecdotally, most people know of this one as Dr. Robotniks Mean Bean Machine. While they are both puzzle games, the rule sets are completely different. Mixing the two together like this simply shouldnt work. Getting hands on the actual results, though, shows that there are some clever people over at Sonic Team and Sega.As a package, Puyo Puyo Tetris is stuffed with different ways to play, almost to the point where the seams are bursting. Many will start with the Adventure mode. This is the story mode that tells the tale of two universes colliding due to some overzealous popping of Puyos. Those who played the Japanese release without knowing the language marveled at the bizarre cutscenes filled with space wizards, chirping floating blobs, and various nonsensical silliness that, removed from context, was downright hilarious. After witnessing the localized Adventure, it can be attested that it still makes no real sense with context added. This is Japanese weirdness cranked to eleven. Still, once it gets rolling, it has a certain charm, and some surprisingly risque misunderstandings. Just give it until Chapter Six of the first act before deciding whether or not to skip the dialogue completely. That should be enough to decide on a personal tolerance level. Other that causing an inordinate amount of confused exclamations from onlookers, the Adventure mode serve as an introduction to all of the various play modes packed into the game. The most basic is Versus, where two or more players face off. Each player decides if they are going to play Tetris or Puyo Puyo and gets to work slinging as much garbage at each other as possible. Folks playing Tetris will have the junk build from the bottom in the form of incomplete lines, while Puyo Puyo players get hit from the top with grey beans that can only be removed by matching next to them. The goal is to force the opponent to make enough mistakes, or just plain fill their screen with enough crap, to cause them to hit the top and lose. Swap is like Versus, except there is a timer always counting down. Each time it hits zero, the board type switches from Tetris to Puyo or vice versa.Big Bang is a really interesting one. Opposing players are given premade boards to clear as perfectly as possible with as few pieces as possible. Getting these done defends against the opponents attacks with the remainder being inflicted as damage in the form of a cracked screen. Theres actually some nice, chaotic swirling effects when its time to tally up the damage, and the sound effects gives this mode the feeling of a fighting game. Then we have Party mode, which is like versus except with a heavier emphasis on being a jerk. Making matches next to specialized blocks causes the opponent to experience all sorts of different handicaps, from not being able to spin a piece or having to work with the board only being illuminated with a roving light. This is the mode designed by divorce lawyers and dentists specializing in reconstructive surgery. Its also really damn fun. Fusion is probably the mode most people think of when discussing the melding of the Tetris and Puyo Puyo. Here, players play on an oversized board with both Puyo beans and much larger Tetris blocks falling. The garbage falls from the top for everybody, in the form of grey beans. The cool thing about this is that dropping a Tetris block on them squashes them out of existence. Fusion really is a destination mode, forcing players to think two ways at once. It can also be the most challenging and interesting. Smart play reaps ample dividends, and the logic and planning that this one requires operates on a slightly higher level than the other modes.Each of these play modes can be accessed separately in the solo arcade mode as well as local or online multiplayer. While Puyo Puyo Tetris markets itself as heavily multiplayer focuses, playing against the AI still manages to be extremely engrossing. Going into Versus arcade mode and playing endurance, where the player must knock out one opponent after another, is my personal favorite destination. It seems like each AI character has a certain play style, ranging in difficulty. Both in the Japanese version as well as this, I have developed a hatred for Pipi, otherwise know as That Beeping $%^&. Seriously, the floating little guy somehow manages to wreck my $#!^ on a consistent basis compared to the other characters. Maybe its all in my head. Maybe his beeps throws me off my concentration. But man. Pi-pi-pi-piii that thing. While rivalry with the AI does work well, take the time to play it with other people when possible. The easy to understand nature of this game allows gamers of all stripes to pick this one up and have a great time ruining each others day. With the wide variety of game modes available, and how incredibly fun each manages to be, the likelihood of growing bored is extremely low. This is a title thats great for family functions as well as no holds barred bloodsports where the loser surrenders an appendage to a wood chipper. The previous sentence is preemptively approved for marketing, if anyone from PR is reading.There is one tiny little issue that prevents Puyo Puyo Tetris from receiving a perfect score: when playing straight Tetris versus Puyo Puyo, it seems like the player who chooses Puyo Puyo has a slight disadvantage. The garbage the piles up from the bottom of the board for the person playing Tetris can easily be turned around to create chains. There have been plenty of times where I took an attack from the opponent that actually gave me a perfect four line Tetris, which hurts the opponent worse. Of course, no one is forced to choose Puyo Puyo at all, but the handicap is noticeable.Also, while I havent seen it in action in person, there are reports that the Switch version looks a bit chunkier when compared to the PlayStation 4 version. Since the accuracy of these claims cannot be verified, this is simply a caveat. Through personal experience, this title is perfect for portable play. It was a stalwart companion when trapped overnight at OHare International, and lends itself to quick plays as well as lengthy binge sessions. Closing Comments:Other than one minor imbalance that could potentially be attributed to personal skill, theres no reason not to pick up Puyo Puyo Tetris. Even those who have long grown weary of the component games will find the well worn gameplay injected with new life with this melding. With no real learning curve, this is a game that allows for a meditative, self contemplating state of mind through the arranging of shapes and colors, or a frenetic and action filled battle against a dirty foe that just cheats. You know they cheat. Either way, this is a title that offers an extreme value for its price, and absolutely deserves to be added to any collection.", "date": "Bohn on April 25, 2017", "grade": 4.5}