{"name": "Outlast 2", "ref": "https://hardcoregamer.com/?post_type=post&p=255499", "text": "The survival horror genre has seen a bit of a revolution in the past few years. This is thanks in part to the P.T. demo that was released by Hideo Kojima when he was still with Konami. The fear it instilled would bring survival horror back to its roots and away from the action elements that later Resident Evil games would have and also the Dead Space franchise. The first Outlast was an incredibly scary game that took the term survival horror to its extreme. Taking place in an insane asylum, the game was too much for this author finish. More of the same comes from the newest version, Outlast 2, as it takes place in a different setting and adds a better atmosphere than the first game.In terms of survival horror game locations, some people prefer closed corridors or an outdoor setting. Outlast 2 feels like the setting that takes place in Resident Evil 4. As for the plot, you play as Blake Langermann, a journalist trying to uncover a murder mystery with his wife, Lynn. During the helicopter exploration to try and trace down a phantom factory, the flight goes down and crashes. From here, Blake is armed with his camcorder (that features night vision), batteries and bandages as you will need to film key aspects for documentation purposes. Then the ultimate game of defenseless hide-and-seek begins, except in an eerie village that is run by a religious cult.Along Blakes journey to find his wife, you will look in buildings and read some gruesome documentation while hiding from these religious extremists who love to sacrifice people. Balancing out your camera batteries is the same as managing ammunition. If caught, Blake will not take many hits until he dies, and there is a good chance you will die a lot playing this difficult game. Outlast 2 involves a good bit of trial and error to get through sections. Once again, you have been given some plain jane person who isnt necessarily athletic or some hero. The vulnerability involved with Outlast 2 is the most important aspect in instilling the fear. After playing a game like Resident Evil 7, you would be keeping up to see where your health is at or where to go on a map. Outlast 2 basically puts you in the shoes of a found footage movie. It is easy to get lost in the feeling in this game as the lighting is excellent, whether it be from the moon or a porch light. Combine this with the background music in the game, which hits heavy periods that makes it feel more than just creepy, but rather terrifying.Just like the previous version, Outlast 2 is played in the first person. Blake can somewhat sprint, hurdle, and crawl on the ground. He offers no self-defense, just a camera to zoom in and out of. When using night vision, the camera can only be zoomed to a certain point. The controls are tank-ish, and can feel even more so in an instance. When something pops up and you panic to run and hide, it really creates a terrifying feeling. These enemies offer different death animations, as well. Blake can also move objects to climb certain areas.Outlast 2 is still running on the old Unreal 3 engine, but with some enhancements. The game does look magnificent, especially the lighting, but at times it looks a bit dated in comparison to Resident Evil 7. There are some really great shots and areas to admire that really bring players into this world, and that is heavily influenced by the lighting. In the moonlight with no night vision in the woods, is certainly when this game is at its creepiest. Sheer terror cannot be completely captured if not for the audio. Whether it be the sound effects, voice acting, and soundtrack, all three of these need to come together to complete an experience. Luckily, Outlast 2 manages to stand out in these areas. The voice acting from the enemies is flat out scary and the sound effects mesh well with the soundtrack to make players feel extremely isolated in an unknown, yet hostile environment.With the setting being in an outdoor environment, one would think that in this day and age that exploration would be a given. This is not the case in Outlast 2. This is certainly a reason that this game feels like Resident Evil 4. This game is linear, definitely in comparison to the asylum from the first game. There really is no avoiding of enemies as the encounters are going to happen.The possibilities for how Outlast 2 can look on the screen are excellent. Playing the PC version on an AMD Radeon R9 280X 3GB netted the ability to run the game at 4K resolution right around 30 FPS. With this being the Unreal 3 engine, hopefully consoles can duplicate the visuals and performance. Having this game in VR would certainly do it justice. Closing Comments:Developer Red Barrels has offered an excellent step in this universe with Outlast 2. Choosing a different environment and adapting to those settings to help create a truly terrifying experience was successful. Adding some narrative to the game is a step in the right direction. The linearity of the game is detrimental, but does not kill the experience. This game has a little longer playtime than the original, but that will most likely be extended in the first playthrough due to the unfamiliarity with locations and enemies. Outlast 2 will punish and terrify at the same time; its a cruel game.", "date": "April 24, 2017", "grade": 4.0}