{"name": "NEKO-NIN exHeart", "ref": "https://hardcoregamer.com/?post_type=post&p=255408", "text": "If theres one thing that a certain segment of visual novel fans continue to eat up, its the notion of catgirls. One of the recent successes for Sekai Project has been the Nekopara series. Each volume is rather short, but comes packed to the brim with adorable humanoid cats. Perhaps hoping to strike another home run, Sekai Project more recently translated the visual novel NEKO-NIN exHeart from Whirlpool. Although a completely different property than the aforementioned Nekopara, fans of that series will find theres a lot in common between the two. Mainly, that these games are all about fantasy wish fulfillment for anyone who dreams of being doted on by catgirls.NEKO-NIN exHeart at least does the bare minimum to provide context for the unabashed silliness which follows. The story opens by very quickly explaining how shinobi clans filled with Demi-Humans are in allegiance with human families and have been throughout the ages. Now, in modern day Japan, theres far less use for ninjas. Still, two shinobi from the Fuuma tribe are hell bent on continuing this tradition. They track down their target  a teenager named Haruki  and immediately lavish him with their servitude. His reaction is akin to what most people would probably do in this situation. Instead of accepting these two mewling catgirls, Yura and Tama, at face value, hes incredibly suspicious. Haruki immediately attempts to keep them at arms length. Even when they beg him for food he hesitates due to not wishing to lead them on. After all, these ridiculous women dressed like ninjas with cat ears cant be serious, can they? As time goes on, Haruki falls prey to their adorable charm and allows them to perform their duties. It all seems a bit silly, but theyve got magic skills to blend in with passerbys and love him deeply. Of course, you should never expect to get an answer for why exactly they are so deeply enthralled with this boring, average teenage boy. Aside from their tribes pledge, they otherwise have no reason to care one bit. This is all part of the fantasy. If readers expect something more serious then they should absolutely read another visual novel instead. The unending servitude of Yura and Tama goes quite far depending on the version of NEKO-NIN exHeart youre playing. The Steam release is all-ages and therefore doesnt show any full on nudity. There are some discussions and descriptions that get slightly heated, but it actually comes across far tamer than other games. As such, fans of fanservice may find the release a bit lacking. In many ways, the Steam version makes it sound like Haruki is so chaste that all he ever does is kiss and pet his catgirls. Folks who pick up the 18+ patch or full release from Denapsoft will realize that simply isnt true. Haruki might have qualms with having cat-eared shinobi slaves initially, but it certainly doesnt stop him from having sexual encounters with both of these characters multiple times. NEKO-NIN exHearts artwork and voice acting prove the high points of the whole experience. Although the protagonist is unvoiced, both Yura, Tama and some other characters get the full voice treatment. The anime sprites are very well done and offer simple, cute animation as well. CGs follow through with the high quality artwork and there are a ton of them despite the titles short playtime. Completing the game is easy as there are only two decisions to be made. Selecting different options reveals a couple new scenes to append a few more minutes to the tale. In all, it should take most readers two to four hours to complete it fully. Interestingly, there only appears to be one ending regardless of choices made earlier on. If visuals and voice acting are the high point, then that means the rest of the experience does not quite hold up. Mainly, the writing isnt particularly stunning. This may not be the translators fault as the original Japanese release simply may not have offered much to work with. Both catgirls show no sign of character development and spend most of the time alternating between hyper happy and devoted and hyper needy. At least theres not much in the way of typos, which is often a failing point of visual novel releases on Steam. One issue currently rearing its ugly head for some players of NEKO-NIN exHeart is a matter of slowdown. This also occurred during my playthrough. At about thirty minutes of playing in a single session, the game suddenly started to chug. Attempting to get to the save menu alone took far longer than it should have due to unregistered clicks from the atrocious framerate. Its absolutely weird that a visual novel could have framerate issues, but this isnt the first title to be plagued with it. Thus far its presumed to be a memory leak issue (which is why it grows worse/apparent only after the application is left open) but Sekai Project are currently looking at the problem. Closing Comments: NEKO-NIN exHeart is not a game for every visual novel lover out there. Its squarely targeted at the audience who knows they like catgirls and seek out stories about them regardless of quality. This isnt an experience for someone looking for deep storyline, epic romance or even a lot of dialogue choices. The dull writing and technical issues dont make a great impression either. The best aspects of artwork and voice acting help smooth out the rough edges, but only to a degree. Still, if youre waiting on more Nekopara goodness to arrive then NEKO-NIN exHeart will probably tide you over for a couple hours.", "date": "April 24, 2017", "grade": 2.0}