{"name": "Full Throttle Remastered", "ref": "https://hardcoregamer.com/?post_type=post&p=254606", "text": "Full Throttle has always been something of the awkward middle child when it comes to classic LucasArts adventure games and the work of Tim Schafer. It came right after his star-making development on Day of the Tentacle and before the magnum opus that was Grim Fandango, leaving Full Throttle stuck in between to be overshadowed, despite being Schafers first work as a full project leader and designer. Sure, it still raked in the acclaim when it was released, but if you were asked to name the best graphic adventures from that era, it arguably wont end up being your first choice. But now that Double Fine has already released remasters of its aforementioned siblings, its time for Full Throttle to take the spotlight with its own remastered version. But does it indeed deserve to share the same stage as its legendary family members?Taking place a somewhat futuristic American wasteland, you playing as Ben, the leader of a biker gang called The Polecats. After an impromptu rendezvous with biker legend and Corley Motors head Malcolm Corley, Ben then finds himself knocked out by Malcolms evil second-in-command, Adrian Ripburger, and realizes that the Polecats are being set up as patsies for Malcolms murder. So now Ben has to enlist the help of a mysterious woman named Maureen and catch up with Ripburger and the Polecats, ready to dish out revenge and take on all obstacles in his path.Thus begins your standard point-and-click adventure game, albeit one where the user interface is represented by a killer biker logo that appears when on something to interact with, letting you choose which action you want to take  this may indeed be one the first adventures where a kick option is fairly common, particularly for the earlier parts. Notably, Full Throttle has a lot of puzzles that seem to require to unlearn what you know about standard adventure game logic for more direct solutions that an actual biker would use. For example, at one point we need to get a welding torch back from a junkyard owner. Okay, we have a window showing him welding in an underground area, a chimney is nearby, so if we block the chimney, then well drive himoh, or we could just knock on his trailer door and kick it down when he answers it. It kind of seems obvious in hindsight. Clever twists, though.Thats not to say that Full Throttle doesnt have its own share of traditional puzzles, and most of them are done fairly well and require you to pay attention. But there are the occasional groaners suffering from questionable choices, like having to spill a box of toy bunnies on the ground and pick them up one by one to dispense them one at a time later (why not just have Ben take one out of the box when prompted?), but there are are only a few of them. The real frustration, though, kicks in when the game gets to its two driving segments. Yes, ironically, the two lowest points in a game all about badass bikers involve driving.The first is a large section mid-way where you have Ben driving down a looping mine road, having to fight additional bikers to get some necessary biker parts in a mix of arcade combat and rock-paper-scissors where you have to utilize weapons picked up by fallen foes. This is a rather infamous part of the game, but it isnt all that bad, more that it just feels clunky, having to use the mouse to move to your bike back and forth and click when close to a foe, which basically just devolves into either button-mashing or one-hit knockouts. But its tolerable, and is helped by the fact that you can easily skip these segments with a push of the button.In contrast, one has to wonder why the demolition derby segment isnt as infamous. Its a top-down driving section with some completely ludicrous mouse controls, and attempting to use a keyboard just feels too slow. So the controls are annoying either way, and tend to get in the way of solving the puzzle in the arena (which isnt designed that better as well). If I havent said this before, then allow me to say it despite how easily mockable they may be: theres a reason modern Telltale adventures and the like tend to use quick-time events for action-oriented parts. Combat and arcade segments just never fit into the graphic adventure genre well (see also: Indiana Jones and the Fate of Atlantis, Dreamfall, Space Quest III, etc.), and Full Throttle is no exception.Full Throttle also has a rather linear structure, and much like Day of the Tentacle Remastered, ends up being shorter than you remembered, clocking in at about three to four hours long. So it may sound like while the game has some solid gameplay, it also suffers from a few fatal flaws in the form of some annoying sections. But first off, as padded as some parts feel, they only take away a small chunk from the overall experience, which has a lot of fair and challenging segments. Second, the plot is still compelling thanks to some great writing mixing in Schafers sense of humor. Finally, it earns back some major points do to the fact that it just looks and sounds friggin awesome.In terms of graphics, this may be the finest remaster Double Fine have put out so far. Like their previous titles, you can switch between the old and new versions at the push of a button, and while the original version of Full Throttle had some impressive pixel art, the remastered version almost feels like a complete overhaul at times, where entire landscapes can suddenly snap to life with glorious sunsets and various vehicles suddenly become filled with more detail. It makes quite a world of difference, and helps the games wasteland stand out even more. Speaking of which, the games Mad Max-esque world mixing science fiction and classic biker iconography is a treat indeed, with vehicle designs gleefully tricked out in cartoonish fashions, and a lot of clever details that make for some subtle world-building.Audio-wise, the voice acting is as superb as it ever was. The late Roy Conrad is still as lovable gruff and snarky as ever as Ben, and the supporting cast is almost a murderers row of voice acting legends, including Kath Soucie, Maurice LaMarche, and of course, Mark Hamill in full slimy 90s cartoon villain mode as Adrian Ripburger, stealing the show whenever he shows up. And did we mention the soundtrack, a blend of heavy metal, hard rock, and Southern country? We didnt? Thats because it doesnt need mentioning. These are some legendary tunes (especially the main themes iconic riff) given a hi-fi boost, and they sound as head-bangingly glorious as ever, fitting the outlaw mood perfectly.Closing Comments:Full Throttle may not have aged as well as its siblings, but its still a true gem nonetheless. This is largely thanks to some sharp writing, stellar and unique visuals, fun gameplay, and a kickass soundtrack. The remastered version serves to highlight and even enhance all of this, showcasing the kind of creativity Schafer and company could be capable of when at their best. Its a fitting conclusion to this trilogy of remastered LucasArts adventures (unless Double Fine can somehow get the rights to the likes of Loom or The Dig), and a rubber-burning road trip down memory lane is definitely worth taking again.", "date": "April 17, 2017", "grade": 4.0}