{"name": "The Walking Dead: A New Frontier: Above The Law", "ref": "https://hardcoregamer.com/?post_type=post&p=252009", "text": "Telltale seems to be taking its time with the latest season of The Walking Dead, as we almost neared 100 days since the first two episodes of Season 3 dropped at the end of last year. While that extra time in development can be put to good use for additional polishing and refinement, the large cast of characters and their relationships with one another that the apocalyptic adventure series so proudly advertises can be a tad difficult to remember after such a lengthy break. Nonetheless, Clementine, Javi and the gang have finally reached Richmond as the third episode, titled Above the Law, kicks off, and what awaits is a somewhat messy tale of familial and socio-political drama, with a good dosage of character development tossed in as well.While the remainder of the review will not directly address any spoilers for Above the Law, important plot points of Ties that Bind: Parts 1 and 2 will be discussed below. For more on the first two episodes, check out our review here.Ties that Bind: Part 2 concluded with the semi-surprising reveal that Javis brother David is alive and, on a more startling note, a member of the New Frontier clan. This immediately creates drama for Javi and his compatriots, as he becomes torn between the needs of his friends from Prescott, his complicated relationship with both Kate and Gabe, and his prior interactions with his tempestuous brother. The remainder of the episode feeds on this drama between these three conflicting parties, with mostly positive results as players learn some important details about new and old characters alike thanks to some intriguing flashbacks. However, the intensity of the choices in this chapter feel toned-down compared to both past episodes and seasons, which lessens the tension that does happen to be present in the episode, and some abrupt conclusions and transitions make the story feel a bit more rushed than intended. The intended progression of this season still feels somewhat unclear as well, which is rather surprising as we cross the halfway mark for this group of episodes.What separates Above the Law the most from other The Walking Dead and Telltale episodes is its lack of interactivity, as the experience clocks in at under the standard two hours thanks to an absence of explorable areas and optional conversations. While its hard to claim that the former mechanic was pined for during the playthrough, it did make for an odd realization upon completion, making us wonder if that will start to become a recurring concept for Season 3. The voice acting for the characters continues to impress, and the technical stability of this episode is at an unusually high level of polish for a Telltale production, which is indicative of a promising return from the extra time Above the Law spent in development. While, as discussed earlier, the additional wait may be a bit harmful from a storytelling perspective, its hard to ignore the sense of positivity that arises with a hiccup-free episode, particularly for those who wait for a full playthrough of the season.Closing Comments:Despite a lack of traversable areas and series-renowned stressful choices, Above the Law represents a solid and polished episode of the latest The Walking Dead season, thanks to some intriguing conflicts and character moments. While the season still doesnt feel like it quite knows where its headed next, the intermediate episode gives players plenty of reasons to continue following the drama of the Garcia brothers.", "date": "on March 28, 2017", "grade": 4.0}