{"name": "Snipperclips: Cut It Out, Together!", "ref": "https://hardcoregamer.com/?post_type=post&p=251086", "text": "Snipperclips: Cut It Out, Together! was revealed as a brand new original title for the Nintendo Switch that took people by surprise with its endearing personality. The characters, music and overall concept come off as incredibly adorable all while taking advantage of the Switch having two usable controllers for multiplayer. Snipperclips will allow up to four players at once, but fortunately all of the different modes are also playable with just two people so there isnt a need to go out and grab extra controllers for the system right away.Upon starting the game, players will go through a short tutorial that teaches them all the basic mechanics from jumping, rotating and snipping the other player. The premise of Snipperclips is a simple one: players run around as small colorful characters made of paper that have the ability to snip one another to make different shapes. These shapes are then used to help players solve a variety of different puzzles they are put up to, whether its simply trying to fit into a certain shape or helping small animals get back to their home. The levels start out fairly simple but by the end take a lot of creativity and even roundabout thinking to solve. There is no wrong way to solve a puzzle either, and it encourages looking at each puzzle from different angles in order to solve them.There are three different modes in Snipperclips. The first is world mode uses which two characters and is the only one that includes a single-player mode which has the solo player switching back and fourth in order to use both characters to solve the puzzle. This mode includes three worlds full of puzzles to solve, each unlocking after the previous one has been completed. Party mode is the second option which allows up to four players at once and includes levels very similar to the previous world levels with more challenging puzzles and a lot more cooperation needed. The third is titled blitz mode and is the only one that is competitive, allowing up to four players go head to head in three different sports themed mini-games including basketball, hockey and a dojo where the goal is simply to snip the other players out of existence. Even with a handful of different modes and challenges, Snipperclips will come off as a short game to more experienced players. It also doesnt offer too much replayability unless players are wanting to try solving a puzzle in a different way. There are no collectibles in levels and no rewards offered for beating it quickly so it does make for a very relaxed experience, although it would be nice if it gave players more incentive to go back to levels and try some different ideas. Players can unlock additional levels for other modes if they play each them to completion which will at least add a bit more to it overall.The most unique takeaway from Snipperclips is the overall style itself. Of the three main hub areas players go through, each one is inspired by different settings. The first is art inspired, with sketch paper as the background and art supplies used in various levels. Hub area two is retro video-game themed, with pixels backgrounds and characters make up the level design. The final area has a science theme, with test tubes, stars and spacecrafts making up much up the background. The paper characters players run around as are themed after paper, but with a fun variety of emotions theyll display depending on the situation. The character emotions are a small detail of course, but seeing the small paper characters look excited after solving a puzzle or disappointed when they accidentally drop something is a nice reflection of those playing along as them. Even the music, while mostly simple remixes of the main theme, never gets bothersome while playing as it always fits the level and manages to be uplifting the entire time. Closing Comments:Snipperclips gives players an overall enjoyable experience that allows them to sit down and relax while playing alone or with some friends. The puzzles start simple but get complex enough that it will take some creative thinking to figure them all out. While it may not offer a ton of replayability after every level has been beaten, it can easily make for a fun experience when showing it to someone who has never tried it out before. Someone looking to pick up a simple multiplayer title for the Nintendo Switch to sit down and enjoy with a friend need look no further than Snipperclips: Cut It Out, Together!", "date": "March 21, 2017", "grade": 4.0}