{"name": "Ghost Blade HD", "ref": "https://hardcoregamer.com/?post_type=post&p=250449", "text": "There are many different types of moods that can be satisfied through gaming. Sometimes, a player just wants to relax and enjoy a good story, so they might pop in a visual novel or a lightweight RPG. Other times, there might be some aggression that needs to be channeled into a safe venue, so a visceral shooter or beat em up is in order. The shmup genre is perfect for those interested in rendering their eyes bloodshot and their hands twitching wrecks of their former selves. The thing is, despite the ability of the genre to deliver an experience not seen in other titles, the short length and perceived difficulty of the titles leaves the entire class of games in a corner, labeled niche. Hucast has decided to tackle this, attempting to create a budget priced, vertical bullet hell style shooter that would serve as a good entry point for newcomers to the genre. Ghost Blade HD is the result.The thing is, vertical bullet hell pretty much describes the experience as a whole. There really isnt anything interesting or unique about the five level experience on offer here. The player starts off by choosing one of three ships before diving in. Each ship has a slightly different style of shot, mostly seen in the spread of the projectiles streaming from the players ship. From there, one or two players shoots down wave after wave of enemy aircraft, turrets, and land based vehicles. The actual combat does require a small amount of on the fly strategy. Holding down the regular fire button sends out a weaker spread shot that covers a certain amount of screen based on the ship chosen at the beginning. A second fire button is used to focus the ordinance to directly in front, creating a more powerful spray but slowing down the ship. Then there is the bomb which is most often used to grant temporary invincibility. Its not particularly powerful otherwise.The simplicity of the combat really isnt too much of a problem. Again, this can be seen as a welcoming entryway to the entire genre. The bullet patterns themselves are extremely fair. Looking at the screenshots, one might be forgiven for believing that some of it looks intimidating, but on Easy and Normal difficulties, they move slow enough to not be too much of an issue. Honestly, this ease of play made me feel like I was selling myself short in my talent for the genre, as I tend to brute force these quite a bit as I learn the levels. Here, it wasnt until I started playing on the Hard difficulty that I began feeling truly challenged. The real problem with this offering is that it is just so achingly generic. Imagine walking down the aisle in the store. Lining the shelves are premium, name brand offerings labeled Raiden, Darius, or even the fabled Radiant Silvergun. Next to all of this is the store brand offering in white packaging and black letters. Inside that package, one would find Ghost Blade HD.The thing is that this game is truly devoid of any real personality. The enemy design is extremely cookie cutter. Here is a series of bland starships that could be from anywhere. Below, there is a row of dull gray tanks. The boss for this stage? Yeah. Its a building. It doesnt do anything besides spit bullets, something the property owners really had to work at to convince the contractors to install. It really is tanks, ships, and turrets, with the occasional spinning blob of nonsense thrown in. Its not exactly painful to look at, beating out Teslapunk, but it doesnt invite repeated plays, which is a huge downfall in this genre. Compare this to something like Deathsmiles, another short genre entry that invites return plays through its plethora of interesting monster and background designs.Equally generic is the electronic music. Due to needing to dig as far into this review as possible, I have put quite a few hours into this one, including a two and a half hour sitting, where I beat the game quite a few times. Even so, there is not one track that sticks to mind. I cannot remember how any of the tunes went, as they lack any real hook. Frankly, that seems odd. After listening to a few tracks countless times in a small amount of time, something should remain. Closing Comments:For its price and what its trying to do, Ghost Blade HD isnt the worst time. Navigating mazes of instant death in the form of the projectiles does have an inherent value. Its just that there are so many better examples of the genre available across all platforms. If the player is looking for something to ease them into this type of game, this will fit the bill. The bullet pattern design does play fair. The real worry is that a newcomer might play this and wonder what all the fuss is about. Already indoctrinated fans will just find themselves bored in short order.", "date": "Bohn on March 15, 2017", "grade": 2.5}