{"name": "The Legend of Zelda: Breath of the Wild", "ref": "https://hardcoregamer.com/?post_type=post&p=250235", "text": "The Legend of Zelda has come a long way from its original 2D roots on the NES, making the first leap to 3D on the N64 and now the latest installment offering a full open world experience for players to explore. Breath of the Wild is the first Zelda title since Ocarina of Time to drastically shake up the traditional formula that players had become accustomed to in the best of ways. Linear progression is thrown out the window in favor of a world that wants players to turn over every rock in order to find everything it has to offer. While the Zelda series traditions may have grown a little stale to some they were always made into enjoyable experiences, its clear to see this was the most ideal direction the series could have possibly gone.Breath of the Wild begins with Link waking up after having been asleep for a hundred years, only to find the world around him in ruin. Having no memory of his past, he sets off to trying to remember who was and help stop the calamity that has begun to rise again. After making his way out into the world, Link discovers that four great divine beasts are under the control of Calamity Ganon and he must travel to all four in the corners of the world in order to restore them to their former state. Along the way, Link will begin to uncover pieces of his memory while slowly remembering what he was fighting for and who.Right from the beginning Breath of the Wild sets itself apart from previous 3D Zelda titles. Instead of a drawn out opening explaining every last control, the tutorial section can be considered the Great Plateau area. After the brief cutscene of Link waking to a mysterious voice, players are given control to gather a few items and learn how to climb before heading outside. From here players are presented with a key objective point but are free to explore, discover treasure, weapons and even start fighting enemies without wasting time. Once players have activated their first tower, which fills in their map for that region, they will be introduced to shrines which act as small challenges for Link to overcome. There are well over one hundred of these scattered throughout Hyrule, each rewarding Link with a Spirit Orb that can increase his max health or stamina if he collects four. Once the first four are completed on the Great Plateau, players are given a glider that allows them to leave in any direction to explore the rest of Hyrule. One of the first noticeable changes to this Zelda title is the inclusion of multiple weapons, armor sets and rune abilities. All the weapons in Breath of the Wild, save for one, are breakable and will require players to pay close attention to battles to be certain theyre not running out against stronger enemies. Fortunately, its easy to pick up a weapon from an enemy in the middle of a fight and use it against them as well as making sure they cant use it against Link any longer. While the weapons found early on will break fairly quickly, most gear from stronger enemies and treasure chests will last Link a good amount longer. There can be some item management issues with weapons early on, as Link is limited to how many he can carry at once. It would have more convenient if when opening a chest when Links weapon inventory was full it let players swap out between them right there, but instead it requires players to manually go into the inventory and drop an item before they can open the chest and grab the weapon. Fortunately the ability to unlock more inventory slots appears fairly early, but will require Korok seeds hidden throughout Hyrule to obtain.Every piece of armor Link discovers has its own defense stat and each piece can be upgraded using certain monster materials. Armor isnt just for defense either, as many armor sets come with unique abilities. Some will make Link immune to the weather, while others can increase his stealth or swimming speed. Once Link has unlocked the ability upgrade his armor, he might have the chance at unlocking an additional skill if all three pieces of a set are worn at once such as complete immunity to fire. Many of these skills can also be obtained through cooking as well, but the food and potions only last temporarily. Many different armor sets can be bought from villages, given to Link as rewards and even found in treasure chests scattered throughout the world. Link also no longer receives key items in dungeons used to complete puzzles and is instead given Rune abilities that allow him to manipulate metal, create bombs, stop an objects movement and even create ice pillars from water. These abilities arent just used in puzzles either, as they can be incredibly useful for fighting enemies or getting to otherwise difficult to reach locations throughout Hyrule. The sheer size of Hyrule makes it easy to wander off from the current objective, but fortunately there is an easy way to get around and check on things that might have been overlooked. Links main tool of getting around is his Sheikah Slate which allows him to fast travel between shrines and towers he has activated. Players can set a total of five light markers that will always appear on the mini map and up to a hundred mini icon markers which can be seen on the full map. While some players might enjoy going point to point to move ahead as quickly as possible, stopping to explore an area briefly can be extremely rewarding. Every hill and mountain top is hiding some sort of secret waiting to be discovered and each enemy camp will help Link gather some treasure or new equipment to help throughout his journey. Hyrule is incredibly large, but because of the depth put into every area it never feels empty. Theres always something to be found even if its not outright visible.Puzzles have always been a big part of uncovering secrets since the original Zelda title and Breath of the Wild truly shines brightest when it comes to its puzzles whether its in shrines, dungeons or just out in the open field. Aside from the combat shrines, which simply require Link to fight an enemy, none of these puzzles ever feel too similar and instead have their own twist on what players are capable of. Some puzzles will require Link to use stormy weather to his advantage, while others might need him to find ways to navigate special fires to a location without letting it burn out. Most of these puzzles dont even make use of more than one or two enemies at a time and instead focus purely on solving what is right in front of Link. There hasnt been a Zelda title so far where the NPCs and enemies felt so alive in the world. During his travels Link will encounter all sorts of other characters, many of which will supply him with optional sidequests for rupees or rare items as a reward. If one of these characters is out in the open field, Link might find them trying to fight off enemies and can help for an additional reward. If its raining these npcs that are out in the open will be seen running to the nearest shelter to stay dry, its a small touch but makes them feel like they are really interacting with the world just like Link himself. Enemies also have react very lifelike in the world. During night, enemies will be found asleep with their weapons in their camps and Link can sneak up on them in order to get in some damage before they wake up. Some enemies can even be found riding wild horses to chase down Link with he is spotted, forcing him to try and attack them or hide until they lose interest.The art style in Breath of the Wild uses an enjoyable combination of cel-shaded character models in a semi-realistic world. This art style is not only incredibly charming in its presentation but it easily makes important locations stand out very well while traveling through the various forest and mountains. Music takes a back seat while doing normal traveling, instead favoring natural noises and occasionally playing soft music in accordance to the changing time of day or area Link is in. The subtle progression into music will instantly alert Link to what is going on around him, if the music begins to get tense or loud theres a good chance he has been spotted by an enemy. When Link stumbles upon some ruins, the music will be mysterious and it might be his chance to search around for a hidden shrine. The atmosphere hits its mark in every situation by combining the soft look of Hyrule with the well timed musical pieces that bring it together. Closing Comments:The feeling of adventure has always been present in Zelda titles, but none of the previous titles have offered the same immense feeling of freedom as Breath of the Wild. The huge world offers hours upon hours of exploration that is well worth it, but will always show the way to continue moving forward in the story at any time. Each puzzle is more satisfying to complete than the last, while enemies present a well-balanced difficulty that must be overcome by using Links equipment as thoughtfully as possible. Nintendo has opened the door to a brand new experience for this beloved series, and it is easily their most enjoyable yet. Whether new to the series or a long time veteran, The Legend of Zelda: Breath of the Wild is the perfect balance of challenge, adventure and fun that shouldnt be missed out on.", "date": "March 14, 2017", "grade": 4.5}