{"name": "Stranger of Sword City Revisited", "ref": "https://hardcoregamer.com/?post_type=post&p=249733", "text": "An early draft of this review was a link to the original version of the games review and a small note listing the changes. Upon submitting this Steve threw several pieces of heavy office equipment at me and screamed some unintelligible nonsense, though I did catch something about only needing one monkey with a typewriter to randomly duplicate my work. This was a sign I had to actually write a real review, which was met with the collective lamentation of readers everywhere.Stranger of Sword City Revisited is an old school dungeon crawler (Editors note: take a shot every time the phrase old school appears in this article. Hardcore Gamer assumes no liability for any mishaps that happen as a result), and the first thought of seeing a few new additions being tacked on in a buy the whole game again fashion opposed to simple DLC, the natural reaction is this is the era of Street Fighter Twos all over again. Stranger of Sword City Revisited, however, is a complete overhaul to the base game that is more complicated than just a patch with some new classes and extra dungeons.How the player arrives at Sword City is some flight departing Japan to visit Alaska ended up taking an ill advised detour that somehow ends up crashing in an alternate dimension. In Sword City the earthlings are known as Strangers (hence the title, and this must be a return visit). This alternate dimension has some moon gravity going on, so these people are able to wield and wear ginormous weapons and armor, so this game receives some points for at least trying to provide a logical explanation for the typical JRPG character equipment appearance. Take that SOLDIER wannabe Cloud for example. The boy doesnt even look like he lifts and he swings that eighty pound buster sword like its nothing. While visiting Sword City, the Strangers are tasked with slaying the resident demons in exchange for being parasitic mooches the hospitality of the locals. The plot of Stranger of Sword City Revisited is indeed one with potential to be interesting, but its laid on rather thin. Playing this game for story is like the excuse of claiming to have a popular mens magazine for the articles, there may be some interest there, but we all know what the real attraction is. In this case, it is the old school dungeon crawling and combat. And like old school RPGs, the player is free to make custom characters that combine races and classes that might not be the brightest. Ever try playing a certain well known tabletop RPG with a halfling tank fighter or dwarven acrobat thief? The player is free to make this boneheaded character designs and subsequently die repeatedly. Thankfully, permadeath is not really much of an issue in this revamped version so there is less risk in experimenting with more challenging character builds, though it may be more practical to stick with race/class combinations that work well together given the games difficulty.Stranger in Sword City Revisited has the player wandering around various locations in a first person perspective and going into turn based battles, also in first person. Oddly enough, spending time in Sword City felt very similar to Ray Gigants gameplay, though the overall tone was very different and there was much greater character and party customization in Stranger, but like Ray Gigant it caters to the lazy dungeon crawler with the auto travel system where clicking on a map destination will whisk the player there without the inconvenience of manipulating the thumbstick. The battle system is nothing new, typical everyone takes their turn with different actions against the enemy, who will quite often beat the snot out of the players party. Keeping with the old school theme (Feeling good, yes?) the battles are about as merciful as Joffrey Baratheon, but in a fun way and not in a I want to use the screen as firearms target practice type of way. Stranger of Sword City Revisited does bring a lot of changes to the old game, and those include three new classes, the Clocker, the Freeman and Puppeteer. The Freeman cant be brought into battle, this class just hangs out at base and helps with bonuses for money gains and recovery time, I didnt get a chance to try it but I see game breaking potential with the proper manipulation of this class. The Clocker is mostly a support class, it can increase time for the party and slow time for the enemy, along with some wizard and cleric spells. The Puppeteer is the why are you hitting yourself class. This class doesnt get to do any direct attacking, but can be a lot of fun for messing with enemies and making them be the instruments of their own demise.There is a new guard counter system that allows planned counterattacks against enemies, though it is cautioned to not rely too much on that. There are also new enemies and items. Certain limits, like those put on class changes or the amount of rare items that can be equipped have been removed which allow players to build their ideal super characters with the best possible gear. There are new dungeons waiting in the New Game Plus feature. There are new spells, talents, and traps laid by monsters with their new behavior patterns. Pretty much everything has been redone to make this feel like a different game while still being the same game. Closing Comments:Stranger of Sword City Revisited is an improvement over the original release, making this the version to play if Stranger of Sword City is a title on your radar that you havent gotten to yet. Stranger of Sword City Revisited is an intelligent old school dungeon crawler and is among the better games that have attempted to utilize this style in recent years. For fans of old school dungeon crawlers, this is a must-play title. The tricky part is, is this worthwhile for someone revisit that has completed the original version? The changes are many, and they do improve the overall game quite a bit, but Stranger of Sword City was not a short game, and revisiting it for those who completed the first game would probably be limited to only the most die hard fans. Old school.", "date": "March 13, 2017", "grade": 4.0}