{"name": "Live A Live", "ref": "https://hardcoregamer.com/?post_type=post&p=425420", "text": "In the early to mid 90s Square was synonymous with great RPGS on SNES. With strong entries from Final Fantasy alongside Secret of Mana, Chrono Trigger and Secret of Evermore, Square developed many RPGs that fans of the genre still talk about today. But because JRPGs catered to much smaller niche audience back then, only a handful of games actually made it to the States. Some were released as remakes or remasters several years after the fact while some still havent received a proper western localization. 1994s Live A Live is one such game where up until a few days ago was only available as a fan-translated ROM. But now its out officially, remade with a 2D HD facelift to keep up with modern aesthetics while still keeping its 16-bit appeal.The most noteworthy feature of Live A Live is that unlike most JRPGs of its era the game doesnt begin with a set protagonist. The player instead is free to select one of seven different scenarios. Each chapter takes place in a different time and place with a different protagonist. The differences are not limited to the character and setting as with the different objectives there are different ways the player needs to approach them which makes each chapter feel like its own self-contained game. That is until the end chapters when things come together, but for the sake of spoilers we wont discuss how that happens.There isnt a correct order to play the chapters, so its up to players as to how theyre approached. You could do chronological or just based on which scenario is most appealing. The length of the chapters varies, but a couple hours seems to be about the average length for each. The seven starting chapters are Prehistory, Imperial China, Twilight of Edo Japan, The Wild West, Present Day, Near Future and Distant Future. The final chapter becomes available after clearing these seven, and there are multiple endings depending on the end game choices. Part of what made Live A Live so groundbreaking isnt just the different chapters, but how each chapter plays so differently than each other. The Present Day scenario is like Street Fighter II if it was a turn-based RPG and is nothing but a series of fights. Contrast that with the Distant Future, where battle is virtually nonexistent. Apparently language didnt exist in prehistoric times so this chapter plays like a traditional RPG but without any dialogue. The Wild West is a dramatic scavenger hunt while Imperial China has the player taking on the role of a Kung Fu teacher. Twilight of Edo Japan gives the player the choice of violence or stealth. Lastly, the Near Future adds a mind-reading ability.Battle in Live A Live is similar but different to other turn-based RPGs. Combat takes place on a seven by seven grid. Every character has a different set of moves, but theres no mana pool or anything like that to limit frequency of use or any sort of resource management. Different actions do take longer to execute so figuring out how a move will effect the flow of battle is a consideration, but beyond that theres no limiting factor to using your favorite attacks over and over again. Its a unique system, blending a strategic grid with an active time/turn based system. The way the system is set up encourages experimentation and strategy without limits. An example of such is one character can focus on healing, another does powerful attacks against a single enemy while the third character unleashes low damage but large area of effect attacks that inflict additional damage by poisoning the grid where the enemies are. The complexity and innovation of how this system was in 1994 might not be fully appreciated in 2022, but the important thing is that combat is much more enjoyable and engaging than traditional turn-based menus. Its a clich to say somethings greatest strength is its greatness weakness, and while saying that in this case would be hyperbole, the sentiment does fit. With each chapter being so different from one another, some are clearly more fun to play than others, and that statement would have even more weight on repeated playthroughs. Some of the chapters are legitimately fun while others do better as showcasing unorthodox approaches to gameplay or storytelling. The Wild West paid tribute to western films and had a great showdown for the final battle, but gameplay of finding various items in empty buildings was an interesting idea but would likely feel like a chore in subsequent playthroughs. The same could be said for the Distant Future, which does a great job of creating a tense claustrophobic environment similar to the film Alien with interesting character arcs, but wondering back and forth in the space station can quickly get tedious. Prehistory is the silliest of the chapters. With no dialogue the characters have to rely on animation and slapstick humor to convey the story which ends up being an entertaining and creative way to work around it. The use of weaponized poop and other bodily functions would either enhance the humor or detract, depending on the individual playing.Some of the other chapters more experimental features are more fun to play around with. Twilight of Edo Japan gives the player the choice to go on a killing spree or take a stealth approach. The ability to hide in plain sight is a fun to sneak around the guards who seem confused when they could swear they heard or saw something but the player has safely vanished in the shadows. Sneaking around in crawlspaces in the ceiling allows the player a nice vantage point to see whats going on the castle below, similar to a mechanic when sneaking around the Blackbird in Chrono Trigger. The mind-reading ability in the Distant Future worked well, both as a narrative device and as a gameplay mechanic which helped make that chapter one of the stronger ones. One downside to Live A Live being released now is that the impressive level of innovation doesnt have the same impact that it would have 28 years ago. Compared to other SNES games in 1994, Live A Live is truly ahead of its time. Its unique approach to the battle system, the multiple interconnected chapters and the willingness to partially reinvent the gameplay for each chapter sets it apart from its 16-bit contemporaries. The influence of this title can be seen later games such as SaGa Frontier and Chrono Trigger which clearly have Live A Live DNA in their coding. But even this far after the original release and certain aspects feeling dated, like all classics it holds up well enough to still be worth experiencing today. By modern standards some chapters feel too short and more story/character development would have been nice, but this was an ambitious title for the time of its original release. Some of the dialogue seems like it would be out of place in 1994, and knowing Nintendos standards from that era a good chunk of the dialogue would never fly on the SNES. But it does make one wonder how much the modern translation deviates from the original Japanese version.The redone graphics look great and frankly I would love to see more classic 16-bit RPGs get remade in this style. The character sprites look similar to the original pixelated incarnations, though higher quality. The backgrounds look much more realistic and modern without deviating too far from the original. The reworked score sounds amazing, but theres no option for the original soundtrack. Personally this isnt a big deal, but there may be some who played the Japanese version who would like the option just for contrasting. The voice acting isnt great but it doesnt do much to detract from the overall experience. One irritating bug is a problem with the autosave where the feature would stop working. I did have to replay some of the game during the review because of this. What happens is when the game autosaves theres a spinning indicator on screen for a couple seconds. If you see that image stop spinning and stay in the background of the screen, that means the autosave feature crashed. If this happens to a manual save, then close and restart the game and it should work again. This only happened twice during the review, but its something to be mindful of. Closing Comments:Live A Live is one of the most unique games we never got to play in 1994. The level of innovation and creativity that went into its design might not have the same impact this far after its original release, but retroactively we can see the influence this title had on several other classic JRPGs. The approach of using multiple characters and eras to weave a story together made for a game that was unlike any other game in the genre. The battle system was another innovative take on what was common, blending a tactical grid with an active time turn-based system. Live A Live is a hidden gem from the 16-bit era, a truly unique experience that holds up well today. Expectations should be tempered to account for some gameplay elements that will seem dated, but this is a title that should be mandatory for any fan of classic JRPGs.", "date": "July 26, 2022", "grade": 4.0}