{"name": "Chasm", "ref": "https://hardcoregamer.com/?post_type=post&p=307703", "text": "Chasms road to completion has been a long and winding one  but its a journey that has paid off for both the developers and players alike. First announced in mid-2013 via Kickstarter, the final game is here after half a decade and with that comes a bit of trepidation. A lot can change in half a decade  especially in a fast-moving genre like gaming. In that time, Shovel Knight has changed indie gaming forever while Metroidvanias have sprung up like wildfire thanks to things like Dead Cells and Hollow Knight. Its easy for a game to be lost in the shuffle and yet that hasnt happened with Chasm.Chasm checks all the boxes for a Metroidvania in terms of its progression of the player character, but does so in a way that isnt often done. In most games, you start off super-powerful and then lose your powers due to some unforeseen circumstance. Here, you start off as a young knight with no real experience and so your journey as a player is reflected far more accurately in your character. You have no major experience with the core mechanics before youre thrown in  at least theoretically. Realistically, running and jumping around the castle area does teach you how the physics work and getting your first sword allows you to learn how much range it has and how much time it takes to land a strike.The game design is very much like Mega Man X in that regard, where you are gradually taught things without an obvious tutorial or worse  magical fairy to annoy you every few seconds like Ocarina of Time or even latter-day MMX games. This organic approach to learning how the game works blends in perfectly with a Metroidvania approach and allows the player to learn at their own pace while still feeling like theyre making good progress. There are a lot of different ways to approach a game like this and there arent any true wrong ways. Since your goal is to uncover a mystery with a town and its mines, with a side goal being to find everyone in the town who is trapped in the mines, you can approach that in a few ways. You can choose to explore more and be rewarded with new allies to buy things or learn things from  or put a self-imposed challenge in place by avoiding them and going without their perks. This means you will be limited in what you can do and you wont be able to use things like magic, but will get a tougher experience out of it if you so desire.You can also choose to avoid enemies and try to battle bosses with magic, but try and avoid taking damage to give yourself as hard a time as possible with them. Conversely, going through and trying to kill every enemy to rake in the XP and get more money allows you to have an easier time with everything. Every time you level up, your HP goes up and your health is refilled. Normally, you would have to find either a save point or slay enemies for health pickups like food or your traditional cavernous hidden meat slabs. There is, however, a definite thrill that comes from going through a large section of the map only to near death and then see your XP gauge roll over right as your HP gauge nears it end, signalling that not only have you gained a level, but your health is refreshed and better than ever. One way to add challenge is to avoid money and then you will have a minimal upgrade to your weapons. These arent commonly found in the wild and have to be purchased, so you restricting your weapon power is an option  although not one that is recommended for those new to the genre. Even veterans will probably want to have one playthrough on normal to just get acclimated to how the game fully works before throwing more challenge onto things, but with several save slots available, you can really do whatever you want. Having some slot for a normal run and then do another concurrently with some restrictions in place is surprisingly fun.Chasm controls like a dream and feels perfect with an Xbox One controller. The picture-perfect d-pad on it makes the precision platforming as easy as possible and much like classic Mega Man games on the NES, there will be times that jumps can only be made with you being on the last possible pixel of a platform to land them. Chasm offers up a fair challenge from beginning to end, but none of it comes from poor controls or bad game design. The key to success is to learn how the game works and master its mechanics. The proceduarlly-generated rooms and Metroidvania gameplay mesh perfectly together. Its a strange combination in theory since Metroidvanias rely heavily on backtracking, but things wind up working out just fine thanks to Chasm doing every single thing it sets out to so well. Visually, Chasm features a lush pixel art style that would be right at home on a 32-bit 2D game. With so many games over the past decade going for an 8 or 16-bit look, having 32-bit-level art and color depth gives its world a richness most games lack. Many 2D games also limit animation to just showing what is critical for movement and attacks  but Bit Kid went a step further and showcased the struggle of your young knight on his journey thanks to expressive body language. Hell struggle to move forward against wind and heavy snow, and simply having the elements take a tole on his movement adds a level of realism to the goings-on that is rarely seen in a Metroidvania.Musically, Chasms soundtrack is intense but also somber when it needs to be. You have booming drums to signal combat, while serene guitar plucks build up a serene atmosphere before giving way to a haunting rhythm. The sound design evokes the original Metroid with a sense of hopelessness along with wonder  but without a sci-fi tinge to things. Sound effect work is also strong, with each weapon type sounding as it should. A powerful sword slash leads to a brassier sound than a small sword, while arrows flung at enemies snap through the air at a breakneck speed. Closing Comments:Chasm is one of the finest Metroidvania games ever created. While the games developmental journey was longer than expected, the wait was well-worth it. Every aspect of the game shows that a great deal of care was put into it and the attention to detail for the core gameplay pays off in spades. There are many different ways to play Chasm and all of them result in an unforgettable experience. It plays like a dream, looks stunning and features an atmospheric soundtrack that makes every new room both exciting and terrifying.", "date": "August 4, 2018", "grade": 4.5}