{"name": "Dystoria", "ref": "https://hardcoregamer.com/?post_type=post&p=247958", "text": "Nostalgia is a powerful feeling. Reminding people of better times and ideas has been a growing trend in the entertainment industry. Whether it be games, music, movies, conjuring emotions from a better era seems to sell. Developer Tri-Coastal Games wants to bring out the 80s futuristic sci-fi in you with its new game, Dystoria. This six-axis arcade shooter can be a simple level progression game or it can challenge minds and bring players back for more. The look and feel add to Dystoria as it combines elements pulled from Tron mixed with Asteroids. If retro shooters and 80s synth music tickle your feathers, then this game will be right up your alley.Dystoria does have a story and premise behind it. The story is pulled straight from any 80s sci-fi B-movie. The main character has been selected by aliens to compete in an arcade game. Chosen as one of the smartest beings in the universe, the idea is to compete against the other beings to see what the supreme one is. There is a home base on the spaceship where messages can be read from a green screen computer, but more importantly, this is where ships can be purchased and upgraded before jumping into the game.As for the game itself, the developers have focused on the six-axis gameplay aspect. This means that the ship is attached to any surface, despite the game making it look like players can fall off the edge. This means players will have to adapt to certain angles and surfaces to take down enemies and progress through levels. Players need to collect neurons and orbs on each level to progress. Destroying enemy ships with your blasters will allow for the collection of ship parts to buy other ships. Players can quickly progress through a level and return to perfect the level later. The six-axis aspect allows for exploration as each additional level gets more difficult. There will be separate areas that are not attached to the current area that will need to be explored, which is done through teleportation. The game also features bombs which can blow up glass to gain access to other areas or unlock items. Bombs can be used for destroying enemies, however doing so does not allow for ship parts to be collected. There are different ways to strategize each board.While the concept of the six-axis is cool, there are some technical issues with the controls. Attempting to play with a DualShock 4 controller initially, the game recognizes the controller, but does not implement it on the game. Every time a board starts, I had to go in and set a controller and the game would recognize it as a generic controller. Also, a keyboard input was needed to actually start the level each time even though I had already setup the controller. This became frustrating and needs to be patched. I eventually went with the mouse and keyboard route, but the sensitivity of the mouse needed to be adjusted. Lastly, while not being a technical issue, some enemies fly overhead. The game does not allow for players to shoot up or down or even look up or down. This was probably by design, but it does take some getting used to. The retro look is captured in Dystoria. As previously mentioned, its a combination of Tron and Asteroids. The level boards look to be pulled from Tron and the enemies, the way they blow up, and the sound effects feel pulled from Asteroids. Tri-Coastal Games pulled a lot of elements from other franchises such as Super Mario Galaxy and Descent. The ship view can be changed to first person and the weapons on the ship change the look with the upgrades. These can range from laser cannons to missile launchers. The game runs smooth, but the graphical options are limited and set to a few preset options.It is one thing to capture the look of something, but to capture the sound completes the circle. Tri-Coastal Games excelled at doing just that with Dystoria. The 80s synthwave soundtrack further adds to the atmosphere that is on display. The music truly is amazing. The sound effects date back to 80s arcade games as they are simple and distinct. The enemy sound effects are generally used to help identify nearby enemies that cannot be seen. Explosions and gun shots will all be familiar to those players who favor this old genre. Closing Comments:Dystoria will expand and challenge your mind with its six-axis gameplay element as players will be forced to approach aspects of the game differently than they would logically. Technical issues and adjustments to the controls can hamper the experience, but once comfortable, players will settle into an experience straight out of a sci-fi movie from 1982. This game seems simple at first glance, but offers a good bit of depth and replay value if one looks to master the game. The addicting gameplay will make the player want to master each level. Dystoria offers more as a puzzle game with elements of an arcade shooter.", "date": "February 24, 2017", "grade": 3.5}