{"name": "Berserk and the Band of the Hawk", "ref": "https://hardcoregamer.com/?post_type=post&p=247502", "text": "There have been plenty of great adaptations of the Musou formula of various licensed franchises. Gundam and the first Fist of the North Star were fun, as was One Piece. The anime IPs worked well, but developer Omega Force showed them up with the quality of their Musou take on game specific IPs like Dragon Quest Heroes and Hyrule Warriors. Even dismissing the licensed products, the Romance of the Three Kingdoms based Dynasty Warriors 2 kicked it all off, and gives the loyal ample of reasons to return. The fact of the matter is that the series, as ridiculously prolific as it is, has plenty of different quality entries for all sorts of varying tastes. That is why the following statement should be taken as salient as intended: barring one glaring omission, Berserk and the Band of the Hawk is the best of the Musou games.The game takes its name from the focus of the Golden Age arc of the anime, a trilogy of movies that chronicles the life of protagonist, Guts, before he became the antihero star of the long running manga and anime series, though it does continue the narrative after the events of those films. When it starts out, Guts is a wandering mercenary who is only in it for the violence and the cash. Even young and relatively inexperienced, he is as much of a force on the battlefield as he is a douche in his personal interactions. Still, the potential he shows in battle catches the eye of Griffith, leader of the Band of the Hawk, who conscripts Guts into service at sword point. This might not seem like a particularly unique set up but, as anyone who has seen the Golden Age Arc can attest, it is a story with real depth, with believable character growth, well made action scenes, and one of the most heart wrenching final acts in to be put to screen.There is a reason that the anime is spoken so much in the review for the game: Omega Force has made ample use of the source material to fill in for the cutscenes. This comes across as a copout budget cutting method initially, as they are only using previously created work to tell their narrative. The developer does create some CGI recreations of some sequences though, as well as fill in additional dialogue that was not in the source material, giving characters like Pippin and Judeau a bit more personality. For the most part, this works to create the most coherent and driving narrative that the Musou games have seen, with the exception of one edit to the movie that made no sense. While this doesnt affect the overall game or the score itself, this particular edit was a bit jarring. Immediately prior, there is an extended scene from the movie where a major character is, ahem, turning the radio dial of a fully clothed female that is shown in full. Immediately after, that same character is being whipped by the king. Some might argue that this was done to reduce the amount of editing needed to remove nudity, but the game version of the videos already see any stray naughty bits inelegantly painted over, which is more distracting than just going with the initial source anyways. It really was just a singular poor choice that stuck in my craw for reasons that cannot be explained.Gameplay wise, Band of the Hawk is exactly what fans of the Musou series could want, with much more gore. Using the story to set things up, the gameplay recreates the battles found in the source material with gusto. Its mostly familiar to action fans, with light and heavy attacks. The Musou gauge is replaced with a Frenzy meter that gets progressively stronger as it is used and refilled in a single battle. The is also a Final Blow move that gets filled by making kills while in Frenzy Mode. Think of it as the $%^& you button, as it can wipe out dozens of enemies, including the tougher officers, at once if properly timed. There is also the return of sub weapons to use with a simple shoulder button tap. There is a range of effects that they can have, like the stunning throwing knives, but the primary purpose appears to be centered around prolonging a combo. The biggest change might not seem like much, but its huge to this Musou vet: there is no more jump button. In most previous series titles, the jump has omnipresent, but rarely used. Jump attacks where impractical if not part of a premade combo, and there is no real platforming. Its like a rather long vestigial tail; its there, it can be wagged, but its out of place and kind of weird (no offense to my tailed friends). Now we have a dashing move mapped to the button. Far from being superfluous, it truly opens up the combat. Foes that overuse block are no longer the annoyance that they once were. The block can be broken with a strong attack or circumvented with a dash and back stab. This new move is especially fun to use on the giant bosses. The fact is that it changes up the Musou formula while still feeling well in place.It wouldnt be Berserk if there wasnt blood, and that is something that Omega Force made sure to include by the gallons. Pretty much any hit that lands causes a few gallons of claret to go flying. Its pretty ridiculous, to the point where the player is left wondering how these people are still standing, seeing as how about five peoples worth of sanguine serum was just forcefully drawn from their body. People literally get cut in half, helmets go flying from defeated foes, and the player character is progressively covered with more gore as the battle goes on. Its incredibly satisfying, and adds to the feeling of being in the midst of a giant battle. It could be argued that the over-the-top unrealistic gore increases this feeling as it sells the chaos more effectively. Accomplishing specific tasks during combat, such as destroying a series of catapults, also convey the success and how it affects the battlefield in a more immediate and convincing way. Bank of the Hawk really does have the best battle system of the Musou lineage.There is one thing that holds this game back from receiving a perfect score, or rather the lack of one thing. Musou, from Dynasty and Samurai Warriors, and on through the series history, has been a staple of my co-op gaming time. With friends and family, I have achieved victory on untold numbers of battlefields. Berserk and the Band of the Hawk is missing this feature, which is to its detriment. It can be understood that Guts goes it alone very often, so removing this from the primary story is understandable. However, allowing players to team up for the brutal, plotless Endless Eclipse mode to attempt to clear the most floors of the tower would have not only been acceptable, but extremely welcome. This isnt the first time that this omission has been made, but missing this hurts the package as a whole. Closing Comments:There are so many reasons to pick up Berserk and the Band of the Hawk. Fans of the series will get a chance to play through their favorite battles and see supporting characters get some additional fleshing out. Musou fans will be able to experience one of the most fully-realized series entries that captures the essence of what makes them great, all while telling a top-notch story. People who have never experienced either will be able to check out one of the most grisly titles to hit the market rendered in an accessible, entertaining way. The lack of multiplayer holds Berserk and the Band of the Hawk back from being the greatest Omega Force title, but players who are okay with this will find an experience that both captures the soul of the source material as well as one of the purest, most hyperviolent, titles to hit the market.", "date": "Bohn on February 21, 2017", "grade": 4.5}