{"name": "Ride 2", "ref": "https://hardcoregamer.com/?post_type=post&p=247006", "text": "The original Ride was something we thought had great potential when it was first released a year and a half ago.It combined exciting racing action with a sim-centric approach that was approachable for those new to motorcycle games. Long load times and a fairly bland menu system held it back, though, and the overall experience fell short of being truly great. The sequel has finally arrived on consoles now, but does it rectify the faults of the original, or does it fail to fix what didnt work before?Unfortunately, the overall story of Ride 2 remains one of unfulfilled potential. The core racing game has seen some major improvements though and they are worth noting and praising. The existing racing action worked well enough, but Ride 2 expands on the original with things like leaning in manually to allow you to take turns at a slightly faster rate of speed. This allows those seeking high risk, high reward racing action to get just that. The most important part of a racing game is how everything feels on the track, and fortunately, Ride 2 succeeds far more than it fails. The original game felt mechanically fine, but lacked a sense of passion during races. There wasnt much excitement and simply passing your rivals didnt elicit much in the way of emotion. Ride 2 solves that problem by making AI riders a bit more aggressive  but not doing so at the expense of the core experience. Your rivals will pose a minor threat to you just being being on the track, but they wont actively go after you beyond getting in your way if you try to nudge them off the track.Being able to be a bit more aggressive here than before feels great. In the original game, any physical contact could send you flying. Now, that could still happen  but it isnt going to happen right away. You have some leeway to get physical, rub bikes with another rider, and maybe knock them off. While racing in the ultra-intense Macau track, youll encounter a series of short back-to-back hairpin turns that force you to not only master tight corners, but also provide you with a chance to take risks. During one race there, we were able to knock two rivals off their backs with one slick move and just narrowly avoided being taken off the bike. Having this kind fast-paced action across both the season and quick race modes helps the overall experience quite a bit. The world tour mode is still a too grind-heavy for our tastes, however, taking far too long to make a lot of money and build up your bikes or customize your rider. However, you can minimize your buffs and gain very little for it. Its surprising to only get a 1% boost in credits for taking away rewinds  so why even bother offering such a small boost? If it was 10%, it would be easier to consider nixing that buff. When youre only losing a 1% bonus, its worth just keeping that feature on so you can undo a single mistake and not lose five minutes re-racing the track.Ride 2 controls easily, with a logical setup that is easy to remember at all times. The rewind function could be improved a bit, though. As it stands, you wind up with something that is easy to use in theory with bumpers rewinding and then face buttons taking you exactly where you want  but the transition from the rewind screen to the race itself is jumpy and makes it harder to time. The only way to compensate for this issue is to go a few major moves or a second before your intended cutoff time and then continue from that point. Otherwise, you will wind up wasting the rewind and having to start all over again. Ride 2 fixes much of what didnt work about the first game  but doesnt do much for the load time problem. Lengthy load times make the trip from menus to a race a tedious one. Nearly every menu you encounter has at least a few second delay  not counting menus with voiceover work adding even more time. This issue was baffling before and it remains so today. Its hard to tell if its just poor optimization or a lack of caring, but theres no valid reason for a game to take around a minute to load menus in 2017.The online component is about as robust as it was before  so its not a huge upgrade for those who played that one, but will be noteworthy for those that didnt. Players can choose to race any of the over 200 bikes available on any track in the game. You can choose either single races or compete in a full championship. I would set aside an extra hour or so for an online championship just to ensure that you have plenty of time to race in case someone drops out and has to be replaced frequently. Online play is largely lag-free, although we did experience a couple instances of players teleporting around the track very briefly. This only gets in the way of the game if youre trying to actively pass them. Then youve effectively just wasted your time chasing a ghost when you could have been positioning yourself better on the track. Still, that issue didnt crop up much and the experience is fun even with those issues cropping up occasionally. Visually, Ride 2 is a step up from the original game bound to PS3/360 technology  but its not a mind-blowing difference. Fortunately, racing games are a genre that can remain impressive even on older tech, but you can tell that modern-day hardware isnt being pushed to its limits with the game. Bike details are plentiful, but nothing here quite tops even Forza 5s level of detail on cars and paint. The real stars of the show in Ride 2 are the tracks and environments as a whole. While many games feature international races, very few make the locales truly feel like theyre part of that area. The Project Gotham Racing series excelled at doing that, and while this isnt quite on par with that, it does do a respectable job of showing things like local bridges and landmarks to build the mood and make each racing location feel different.Musically, Ride 2 doesnt do much and features somber, fairly bland music. It fits the menus well enough, but doesnt elicit any excitement. The voicework in menus works well at conveying what youre doing, but is clinical as well. Luckily, the sound effect work is strong and racing against a crowded field sounds as exciting as it should  especially if youre using a helmet or cockpit view alongside a good set of headphones. While using Astro A30s, you can get a better idea of where enemies are at and focus on the track instead of looking at the on-screen indicator arrow  allowing you to get a slide edge and stay ahead that much longer. Closing Comments:Ride 2 doesnt do everything it could have to become the premiere motorcycle racing game on the market, but it comes far closer than the original. The racing action is more intense than before, but the core game is still held back by a bit by long load times. The online play remains solid, so anyone who enjoyed the originals online play will find more of that to enjoy here. Anyone who felt that the first game was a world of unfulfilled potential will find more to like here. The core action is far better and there is more to enjoy than before. Its a well-crafted game and well-worth buying for anyone who enjoys fast-paced sim racing and has a passion for motorycles.", "date": "February 19, 2017", "grade": 3.5}