{"name": "Flywrench", "ref": "https://hardcoregamer.com/?post_type=post&p=246695", "text": "How good are you at swearing? Do you just trot out the old standbys and call it good, or maybe combine them in new and interesting ways? Do you pull in different animals and people to create a family tree that would appall Dr Moreau? Does the air actually catch on fire from an incendiary verbal torrent? If not, then Flywrench is here to help.Flywrench is a simple game. One control stick and two buttons are all thats needed to guide whats supposed to be a small ship, but is actually just a straight, slightly boxy line through a maze of hazards. One button turns the ship red, causing it to flap its ends like a bird, while the other turns it green and makes the whole thing spin rapidly. A red line across the path can be cleared by flapping through it, green lines needs to be spun past and pink is death no matter what you do. There are a number of subtleties to the moves that need to be taken into account for when the levels start getting properly difficult. Plain non-active white movement has no vertical capabilities but is nicely responsive for the horizontal. Flapping can either be used to rise up fast or drop quickly, depending on whether you push up or down on the gamepad, and hitting it too fast can give a rapid accumulation of momentum that will send you flying into the mazes ceiling. The spin move lets you bounce off the yellow walls without exploding, but youve got no movement capabilities once its triggered beyond any momentum you started with. Put it all together and a level can be cleared in seconds.Or rather, put it all together and youve obviously practiced the run several times, because Flywrench is that special kind of evil that only the simplest games can manage. Getting to the point where a level takes seconds involves a good amount of time spent dying, and thats not quite so quick a process. Restarting is instant, but when youve died in a section twenty times running it can take a while. Start off at the left of a level, flap a few times to get some height, start spinning and push to the right so that, when you go through a series of green barriers, the fall doesnt see you plummet into the pink floor below, slow down at the end of the passage and do nothing so you can sink through the white barriers, clear the level. Thats in the early stages though, and things get rapidly more complex. Every set of twenty-ish levels is a planet on the way to the sun, and each planet introduces a new mechanic. Pluto is simply for movement and learning the ins and outs of the red flapping motion and how it interacts with red barriers. Neptune introduces the green spin move, Uranus is pink (ha!), and then there are heavy gravity areas, turrets, switches, etc. Thankfully you dont need to clear every level to unlock the next planet, which is a relief when frustration gets high. Most levels are short and simple but need a strong mastery of the controls to get through, and depending on personal mood it can create either mind-shredding frustration or a zen-like calm acceptance. When its the latter then each failure is a learning experience, trimming away the mistakes bit by bit to create a perfect run thats deeply satisfying.Frustration, on the other hand, causes an ugly feedback where even a hard-earned victory is met with grudging relief. Flywrench is an excellent game that would have been right at home in an arcade cabinet of the 80s, but you really need to be in the right frame of mind to enjoy the punishment it hands out. Closing Comments:Flywrench is a deceptively simple challenge that requires nerves of steel and a vast reservoir of patience if you want to see everything it has to offer. When the game clicks its a fantastic challenge, with the difficulty offset by the short levels that make you feel like a pure ninja master when cleared. The simple art communicates all the necessary information instantly, which is incredibly important for this kind of game, and if you dont like the color scheme there are several alternatives to choose from. The soundtrack is particularly good, featuring a large number of electronic artists whose music fits the style perfectly. Theres even a time trial mode for those who have gained mastery beyond the status of mortals, or at least mortals who dream of placing decently on the leaderboard. There are a huge amount of levels that put Flywrenchs mechanics to the test, and reaching the heart of the solar system will take every scrap of patience and skill a dedicated player can muster.", "date": "February 16, 2017", "grade": 4.0}