{"name": "Giga Wrecker", "ref": "https://hardcoregamer.com/?post_type=post&p=246361", "text": "In at least one comment concerning Giga Wrecker, Ive seen people genuinely surprised that Game Freak have actually developed games outside of the Pokmon franchise. While one may chalk a mistake like that up to ignorance, it is understandable, since most of their non-Pokmon stuff has consisted of either relatively smaller games that became cult titles (Drill Dozer, Mendel Palace) or ones that never even made it out of Japan originally (Pulseman, Mario & Wario). And while Game Freak will always be associated with developing the adventures of Pikachu and Co., Giga Wrecker finds themselves venturing out with their first worldwide independent release as both a developer and a publisher, with a more action-oriented sci-fi title that splices in some puzzler DNA. So can Game Freak end up adding yet another notch to their belt of cult classics, deliver something even more legendary, or find themselves winding up in scrap heap instead?Set in a far future where the world has been conquered by evil robots (do we ever have any sci-fi stories where robots turn out to be more benevolent than predicted instead of more evil?), Giga Wrecker finds you playing as Reika, a girl that has been held prisoner by the robot empire for three years, only to find herself freed by a mysterious white-haired girlwho promptly shoots off Reikas arm, intending to kill her and claiming that its for the good of the human race. She soon gets saved by a mysterious doctor, though, who proceeds to augment Reika by replacing her missing arm with a mechanical one that has the ARCHEARms Creating and Handling Effect), allowing her to attract and carry around scraps of metal and mold them at whim to her advantage. With this power, Reika sets off into the robot armys production facilities to get some answers and dismantle the machine menace once and for all.It may not sound like the most exciting story at first, and some oddities and typos in the English translation may not help, but Giga Wreckers tale is a nifty one indeed, and manages to fit in a few twists along the way (especially when time travel is introduced). But he real highlight here is the world the story takes place in, or rather, how incredible it all looks. The designs of the characters, enemies, and bosses all feel like theyd be home in a game such as Mega Man Zero, and thats meant in the best way possible. Entire environments and backgrounds are detailed with various machinery strewn about in surreal ways and filled with a vibrant variety of colors, and enemies are simultaneously both imposing and colorful, showcasing their personality nicely. Speaking of which, the bosses are a delight indeed, putting up a nice challenge and giving you enough time to learn their patterns and weaknesses, making for some of the games most memorable parts in the end.Focusing on the meat of the gameplay, though, Giga Wrecker is a unique combination of a metroidvania game and a physics-based puzzle game. You have the traditional parts where you run, jump, smack enemies around, and access terminals in order to unlock doors leading to new areas, which are always enjoyable (even when things are a bit vague about where to go to next), but these parts are broken up by segments where you have Reika navigate a screen full of various obstacles by gathering metal with the ARCHE and using it in various ways to cut, smash, or knock down whatever is needed to progress, be it something as simple as creating a ramp to take you up to an out-of-reach platform, or something more complex like having to create a path that allows a laser to be redirected into a lock, or having to craft a swinging platform out of a rock attached to some ropes that you hit with a makeshift rubber ball. These puzzles are indeed quite varied, fun, challenging, & easy to restart should things go wrong, thanks to a small time travel portal.All that said, while Giga Wrecker definitely has its more cerebral parts, the combat is just as much of a highlight. After ripping up some robots or reducing some structures to rubble, you press a button to attract all the scrap metal in the vicinity to Reika, creating a Dead Rising 3-style junk ball that floats right near her, ever-increasing (though the game is seemingly fickle at times over which metal pieces can be drawn in). Aside from creating a really cool visual image (because running around which a giant weaponized ball twice the size of your enemies that creates a satisfying impact on a mechanical face is always fun), you eventually unlock abilities that mold the scrap into various tools along the way, such as swords, javelin, or drills, allowing for ways to access new areas or new methods of attack that are fun to experiment with. You can also strengthen Reika and these abilities by gathering nanomachines from certain wreckage that turn into skill points to spend on a skill tree, which is always welcome, even if nanomachines get handed out like candy (with the reset points in particular allowing you to easily grind without even knowing it).But after all that, in the end, one of Giga Wreckers greatest strengths is still that it uniquely blends in elements of physics puzzlers. Unfortunately, one of its weaknesses is that it blends in elements of physics puzzlers.Yes, if youve ever played a psyhics-based game in a similar vein such as Quantum Conundrum or Poly Bridge, youll know the kinds of issues that can occur. Pieces falling or rolling away from where you want them to go when they drop, moments where you solve a puzzle and then wonder if what you did was really the intended solution, annoying bits such as those. Oddly enough, while the physics are still fine when it comes to carving off chunks of rock or bouncing around thanks to more rubber, there are some slip-ups when it comes to the platforming physics, due to what appear to be some awkward hitboxes. More than a few times, you may find yourself trying to jump onto an angled surface you created, only to find yourself somehow phasing right through it and into a bottomless pit.Also, itd be remiss to not note that Giga Wrecker has a level editor as well, and an easy-to-use interface allowing you to browse several custom-made levels to try out for additional challenges. Its a fun idea for an extra that definitely helps to lengthen the games replay value a biteven if, as expected, a good chunk of these user-created levels seemingly only exist to provide easy solutions to certain achievements. A level that sticks tens of the same basic enemies in front of a giant laser beam to active? And you get an achievement for killing fifty enemies with stage gimmicks? You dont say?Closing Comments:Giga Wrecker has the attractive presentation and unique blend of genres that make for a cult classic, with only a few slip-ups getting in the way of true greatness. But even as is, its a terrific game with some clever ideas that also puts up just enough of a fight in every area to end up both challenging and fun in perfect amounts. Feel free to file it alongside Drill Dozer and Pulseman in the category of stylish action platformers that you need to check out, and keep it in mind when looking for a killer puzzle game as well. Either way, you really cant go wrong with Reikas post-apocalyptic adventures.", "date": "February 13, 2017", "grade": 4.0}