{"name": "Tales of Berseria", "ref": "https://hardcoregamer.com/?post_type=post&p=245297", "text": "If theres one franchise that has taken advantage of Square Enixs lengthy development cycles, its the Tales series. When games such as Final Fantasy take forever to see the light of day, Bandai Namco is releasing a new Tales game every year. Heck, 2014 saw three games published in North America and Europe, provided you count a port of a former Wii-exclusive. Among the anime fighting and brawlers, the Tales series has become one of the biggest modern franchises from the Japanese giant, so its not surprising they would want to share it with the rest of the world as soon as possible. Despite being a couple months late compared to its Japanese counterpart, Tales of Berseria is actually one of the fastest turnarounds in the franchise, hopefully setting a standard for the series moving forward. Taking place in the same world as Tales of Zestiria, only a thousand years prior, Tales of Berseria finds a way to stand on its own with a colorful cast of characters and a compelling story. Considering how the last few games have had less than stellar stories, mainly due to their generic and overly typical anime stereotypes, Tales of Berseria is a breath of fresh air we havent seen since Tales of Vesperia.The plot of Tales of Berseria revolves around Velvet Crowe, a young girl who only wants to protect her younger brother Laphicet who has come down with a serious illness. Unfortunately, things turn dark as someone close to Velvet betrays her and sacrifices Laphicet in some demonic ritual. From here, Velvet gains a mysterious dark power that allows her to devour anyone and anything in her path as she swears revenge on the antagonist, Artorius. The problem with the story is that it takes roughly twenty hours before things begin to pick up. Its an incredibly slow rollout, even by Japanese Role Playing standards, where the characters refuse to change from their one sided motivations and the plot is but a glimmer in the distance. After a turning point, though, things begin to pick up and Tales of Berseria unravels into a rather intriguing plot, almost convincing you that Velvets selfish desires are that of an antagonist, despite her attitude slowly evolving from a lone wolf into a more open individual. The story is more about family than anything else, not just blood-related but the strong bonds Velvet forms with others. Even some of the smaller characters, ones youd expect to never see again in other RPGs, have their time to shine throughout the campaign. There are a couple faces, such as Bienfu, you will completely forget is along for the journey as their input, while impactful for character development of specific individuals within the main cast, is minimal at best. Regardless, this is a surprisingly memorable tale with a colorful cast of characters, despite the main antagonist rarely being more than a mention in the background. Its a little more mature than weve come to expect from a Tales game because the premise isnt your typical save the world plot; its a revenge tale where Velvet will kill anyone who stands in her way  or at least thats what she says. A slight complaint against Velvets character is that all talk as shes more forgiving than her demeanor leads on to be. She constantly conveys she wont hesitate to kill, yet she spares the vast majority of characters she comes across, and even makes friends with quite a few of them. There are times of selfishness that will end up getting others killed, but shes more aggressive than she is heartless, coming nowhere near anti-heroes such as God of Wars Kratos or Asura from Asuras Wrath, two individuals who wouldnt hesitate to eradicate endless lives.Moving past the story, the fluid combat of past Tales games make the transition into Berseria rather nicely, but not without a couple of changes to the formula. If youve played a Tales game in the past five years, the core gameplay mechanics will feel very similar, as youll have free reign over movement and actions on the battlefield, while also pulling Zestirias energy meter to set up combos. The difference is primarily that the Hidden Artes and Martial Artes are merged into one customizable button mapping section. This allows controllable characters to be able to cycle through custom-made combinations without any limitations. It does take some time and experimenting to find the best move set for each character, especially considering new Artes are unlocked at specific levels, but it ensures youll have an incredibly diverse selection of controls that are designed to work around your way of fighting. You could focus on being a powerhouse, dealing as much damage as possible, or ensuring each move flows into one another perfectly.Skills also work drastically different than they have in the past. Looking all the way back to Tales of Vesperia where you have FP that will allow you to enable specific skills, or Tales of Zestiria where equipment combinations will grant you bonuses, these have been shelved in place of permanent mastery. Essentially, players will need to wear different pieces of equipment, be it unique weapons or universal armor, each with a specific value assigned to them. Fighting through battles will slowly fill up a bar that will unlock a Master Skill permanently for that character. This can be element-type damage reduction or attack bonuses; it all depends on the gear. Its a rather clever way to ensure each character wears every piece of equipment they come by, even if its isnt the best option available. This is a more than welcome addition, especially considering substitute allies obtain experience out of battle. Unfortunately, this also ties into one of the more frustrating complaints of Tales of Berseria: equipment management. Equipment drops like crazy from battles as players will find themselves overburdened with so many duplicate gear. These items are meant to be disassembled at a shop in order to level up other, better gear. Some weapons or armor will have better skills attached to them, and these can be broken down into even more rewarding enhancement items. Its a necessary cycle to grant bonus attributes and even specific effects in battle. The problem is that, after getting through a dungeon, its becomes a chore to go to the local shop to unload everything in your inventory. Weve had upwards of twenty minutes just comparing pieces at the shop to either sell or dismantle. Its an incredible annoyance that should have been better streamlined to better accommodate the players time and patience.We also recommend playing Tales of Berseria on Hard. Normally wed never suggest going into a game two modes above the default difficulty, but Normal and even Moderate are a complete joke. Without even grinding and simply running through the story while encountering the majority of monsters in each area, Moderate had very few difficulty spikes, never really showing a sign of a challenge. Looking past the difficulty woes, Tales of Berserias biggest sin lies within its dungeons. Whoever has been designing Tales dungeons for the last few years needs to do something drastic, as theres nothing memorable or creative here. For the first thirty hours, everything is mind numbingly straightforward with no puzzles to be found. Theres just corridors connected to open monster rooms connected with other more corridors. After the thirty-hour mark, there are a couple of dungeons that contain puzzles, if you can call them that, which feel designed for children. For example, eat a specific color apple to pass through a barrier, or light torches to open a door. That is the extent of puzzle solving Tales of Berseria will challenge you with. Its fortunate that the story is compelling enough to progress through, otherwise this would be nothing but a tedious grind. Closing Comments:Thanks to the distinctive story and a number of improvements to the overall combat, Tales of Berseria ends up being one of the better Tales games in a while. With that said, this accomplishment isnt exactly the most difficult hurdle to overcome considering the last decade hasnt been too kind on the series. The problem is just how slow-paced and one-note the early goings are. It takes more than twenty hours before the plot begins to manifest into something slightly more than a revenge tale, and item management is a tiresome and tedious process that should have been better implemented. The most disappointing part, though, is the straight forward and uninspiring dungeon designs. Everything is formulaic with few branching paths, and even when there are puzzles added thirty hours in, they are some of the weakest and most child-friendly puzzles youll find in any adventure. Tales of Berseria has tremendous heart, but if it werent for the intriguing plot and colorful cast of characters, it would just be another average RPG.", "date": "February 4, 2017", "grade": 3.5}