{"name": "Warriors Orochi 3: Ultimate Definitive Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=425099", "text": "Out of the countless Musou games that have been released over the last couple decades, Warriors Orochi 3 is a contender for being the best one. Its original western release for PlayStation 3 and Xbox 360 in 2012 and got two subsequent upgraded releases as Warriors Orochi 3 Hyper and Warriors Orochi 3 Ultimate. Given this history of revisions it shouldnt be too surprising that Warriors Orochi 3: Ultimate Definitive Edition was recently released for PC, but it still came out of the blue. Most diehard Warriors fans probably have this already, and newer fans to the genre may be wondering why this new port of a decade old game is worth playing.Warriors Orochi 3: Ultimate Definitive Edition includes all the updates that were included in Warriors Orochi 3 Ultimate, which consisted of a Duel mode, Gauntlet mode, some new stages and additional characters from other games such as Ninja Gaiden, Dead or Alive and Soulcalibur. This Definitive Edition adds new options that are specific to the PC format, including several settings for display resolution along with mouse and keyboard support. Lastly, it includes over 500 pieces of DLC that is comprised of extra scenarios, music and costumes with the vast majority being costumes that would cost a small fortune if purchased piecemeal on previous versions.The new features are nice inclusions but come with caveats. The increased resolution options go up to 4K, though for some reason its default resolution is 640 x 360 whenever its started on a new platform. This resolution looks terrible, so the first thing that should be done when playing is to set the resolution to the highest setting your individual setup can handle. Trying to set it above your displays maximum setting will bring it back to 640 x 360. Mouse and keyboard support has been added which is a nice option if anyone wants it but for this type of game mouse and keyboard is terrible. Mouse and keyboard is great for first-person shooters and role-playing games, but for third-person action a controller just feels more natural. Extra scenarios and stages are always a nice addition, not that this title was hurting for content. The costumes are a mixed bag. Some of them look cool, like alternate sets of armor and forms that include angel wings while a few of them are silly. But since this is a game where 3rd century China and 15th century Japan merge to join forces with demons helping them jump through time to fight a giant hydra, I suppose there arent any hard rules about clothing period consistency. Warriors Orochi 3 takes place after the defeat of Orochi in Warriors Orochi 2. Things are back to normal in China and Japan where all the characters seem to have had a Men in Black flashy thing style memory wipe. A giant multi-headed serpent known as the Hydra appears and ushers in cataclysmic destruction with its demon minions. Kiyomori Taira is back from the dead while Da Ji has also reappeared, enslaving the remaining warriors through mind control. Hanebei Takenaka, Ma Chao and Sima Zhao are about to become Hydra snacks when Moon Princess Kaguya appears from the mystic world to save them. In order to the defeat the Hydra they need to build an arsenal of a powerful weapon called Yashioori. Given the current circumstances this is rather impossible, but Kaguya can work time travel magic, so assembling an army of 145 characters and several units of the Yashioori suddenly becomes more feasible. The story itself gets interesting as the game progresses, but in reality its an excuse to bring all these characters from different game worlds together for Musou mayhem.Some say that if youve played one Warriors game youve played them all, which is kind of half true. The one versus a thousand format is present, and the bulk of the game is spent hacking hundreds or thousands of enemy warriors to death. In Story mode the player will create a team of three characters and rotates whoever they want to control. Theres an option to bring all three characters out at once while two are controlled by AI or just have one character out while the others rest up. Theres a base that serves as a central hub where in between battles players can craft weapons, level up their characters or host a tea party to strengthen the warriors bonds with each other. Duel mode is where players can battle each other in three on three combat. Musou Battlefield is where players can make modifications to existing stages. Theres some debate between whether Warriors Orochi 3 or Warriors Orochi 4 is the superior game. Its entirely subjective and there are a few elements, such as magic, where Orochi 4 did improve on Orochi 3. One element that does tip the scales in Orochi 3s favor is Gauntlet mode. This is a mode where the player selects a team of five characters that descend into a labyrinth of stages that grows ever more difficult as they try to make their way to the escape point. This mode provides additional challenges for players who completed the main story and want more, and if they play through the Gauntlet long enough they will find challenges for even the most built-up characters.Warriors Orochi 3: Ultimate Definitive Edition holds up well. Every Warriors game follows the same basic template but tries to have enough unique features to maintain its own identity, and even after initially launching a decade ago this is still a contender for best Musou game. Watching familiar stages from Dynasty Warriors and Samurai Warriors get twisted and warped by the Hydra was nice redesigning for long-time fans of the series and the Mystic realm in the later chapters helps make the game feel like its own world and not simply a mash up of two main franchises it borrows characters from. The pacing of the story, length of stages and just general mayhem of all the different worlds colliding make this a simply enjoyable action game. The graphics still look great but even with the higher resolution settings, theres no denying the age of this title. A decade after its release its natural to wonder as to why Tecmo Koei decided to launch Warriors Orochi 3 on PC now and not say five years ago when it was ported to Switch (in Japan) or eight years ago when it came to PlayStation 4 and Xbox One. The theory for this is the Steam Deck. On my PC Warriors Orochi 3: Ultimate Definitive Edition runs just fine with the only issue is sometimes the screen has too many enemies on it and some of them temporarily disappear, which is a thing in just about every Musou game in existence. Aside from that minor criticism the game runs perfectly on PC, and its performance on PC is what will be used in calculating the final review score. Steam Deck is a different story.Starting up Warriors Orochi 3: Ultimate Definitive Edition on Steam Deck will let you see the first two splash screens and then nothing but grey emptiness as the game refuses to load. This was initially disheartening for obvious reasons, but not all was lost. Going into the settings and running Proton  Experimental with the game it will work, for the most part. Some of the FMV cutscenes seem like theyre running ever so slightly slower than usual and sometimes the background is replaced by the rainbow of colors that would be on TV screens of channels whos broadcast day has ended. This visual bug was more humorous than upsetting, but it also only happened during character selection, title screen and some loading screens. Overall with Proton Experiment the game is 90 percent fine, but hopefully some patches will improve compatibility in the near future. Closing Comments:Warriors Orochi 3: Ultimate Definitive Edition is a game that lives up to its definitive edition claim. Story and Guantlet mode can provide hundreds of hours of entertainment. The included DLC content can add up to a small fortune on other platforms, so its inclusion here is appreciated. This is arguably the best Musou game and having owned the Xbox 360 and PlayStation 4 versions, it can be confidently said this is the best version of Warriors Orochi 3. But its also debatable if theres enough content here to justify buying if it someone owns Warriors Orochi 3 Ultimate on another platform. Aside from a few extra stages most of the bonus content is either music or character cosmetics which isnt going to be substantial enough for most people. It seems like having access to it on the go via Steam Deck would be the biggest selling point, but at the current time theres some stuff that needs to be ironed out for that platform.", "date": "July 19, 2022", "grade": 4.0}