{"name": "Hakoniwa Explorer Plus", "ref": "https://hardcoregamer.com/?post_type=post&p=306717", "text": "Retro style graphics in indie games is far from a rare occurrence. Whether the choice to go with a 16-bit style is done for budgetary reasons or as a deliberate choice to invoke nostalgia, there are countless examples of throwback titles floating around and titles like Axiom Verge and Shovel Knight show that compelling gameplay trumps fancy graphics. Invoking nostalgia is also a sound marketing tactic, since people tend to enjoy things that remind them of their childhood, no matter how traumatic it may have been. Hakoniwa Explorer Plus is one such game where the initial inspection indicates this looks like something from my youth, that is until some tightly toned tentacled twerkin tush terminates my characters life. This is not how I remember games looking on the NES.Hakoniwa Explorer Plus is an action RPG that combines old school voxel graphics with a modern pervy edge. The game begins in a tiny woodland village called Firsttown that harkens back to RPGs and adventure games from the late 80s or early 90s, except the residents happen to have names like Milf and Dilf. Talking to these towns folk is when it becomes clear how weird this title can get. A stray cat is fascinated by part of the female anatomy and some nice woman warns the player of monsters outside of town that melt the clothing off of girls, which seeing the naked girls gets the boys excited (Editors Note: Cant say shes dishonest). The player can sneak up on the townsfolk to grab some booty and there are some rather hilarious dialog sequences that can occur, its just a good idea to be somewhat mindful of them since how they perceive the player can influence interactions with them or make the shopkeepers refuse to provide service, plus they may fight you if you really make them mad. A girl inside the players house named Sukumizu cant say what she does for a living but will fight you if you call her an idiot. Sukumizu serves as a guide for the player, but as tempting as it may be it is advisable not to touch her butt.Leaving the town and venturing out into the world by crossing Firstbridge this looks like a typical old school isometric action RPG except the enemies are monstrous forms of cute sadistic girls with the occasional demon treasure box falling from the sky. Instead of hacking away their limbs their clothing can be hacked away or dissolved, highly suggestive though nothing too explicit is shown. The boss battles are larger, more suggestive variations of the provocative scantily clad she monsters though some of these battles can be quite humorous, such as a boss lamenting that her posterior is the only spot that was programmed to be vulnerable. There are also some narcissistic reasons for why the main villain wants to destroy the world, but we wont ruin the joke here. Hakoniwa Explorer Plus is clearly a game that tries to sell itself with provocative content and doesnt take itself too seriously. Games like this tend to raise some red flags since there have been a few games that use these tactics to distract the player from the fact the game is not good, but fortunately this doesnt fit into that category. It has some issues but its easy to get your moneys worth of enjoyment out of this. The explorable inventory is tiny to begin but by exploring and talking to the various townsfolk the player will learn the location of more dungeons and explorable area will become larger. The artistic direction of each area is varied enough to keep the game visually interesting (Editors Note: Right, its the environments that your eyes are drawn to). There isnt much of an epic memorable story here, just keep taking on quests from townsfolk and killing boss beast buxom babes, but to help compensate for going light on the story there is some entertaining fourth wall breaking and other humorous moments in the game.The game mechanics are an area that could have used some tightening up. As an action game the player needs to quickly and nimbly move about the levels, fighting enemies and jumping about. Maybe this can be adjusted with some fine tuning but the character movements feel like the voxel world is really just a fancy design cover for a Slip N Slide. The hit box detection on enemies seems like it can be finicky. These control issues didnt make progressing through the game impossible or even that difficult but did take away from the enjoyment, preventing the overall experiences progression from good to great. There are a variety of weapons to be collected such as swords, staffs or bows to name a few but each weapon has a finite number of uses regardless of whether it hits anything or not. This means the player will spend a lot of time repairing or swapping out weapons which puts a halt in the action. The good news is weapons and repair kits are plentiful enough where it is unlikely to run out of either but the beginning inventory is woefully small. Some weapons have added effects, such as no experience gained so that is something to be mindful of while selecting gear. Hakoniwa Explorer Plus does excel in the area of its retro-style presentation. The pixel art succeeds in paying homage to the games of decades past with character designs that are equal parts sexy and silly. The soundtrack, which can be purchased with the game varies between whimsical and dramatic, with some of the tunes having the tendency to get stuck in ones head after playing. There isnt a great deal of depth to the gameplay, but for a simple straight forward action RPG the simplicity doesnt prevent the game from being enjoyable.Hakoniwa Explorer Plus is an enhanced remake of, wait for it, Hakoniwa Explorer. The original Japanese version was free but this version is still affordable on virtually any budget and comes with a few changes. The amount of items has greatly increased to well over twice the original amount, and the ability to select different difficulty levels and the characters gender have been added. The game content has expanded to include thirty percent more maps and forty percent more enemy creatures, along with many new dialog options with villagers and five new tunes to the soundtrack. Certain status ailments can effect items, such as burn status will cook raw meat. Sukumizu can hold onto extra items for you now, but Evil Sukumizu is also more powerful so try to stay on her good side. Lastly, the world of Hakoniwa Explorer Plus is no longer one with one static weather pattern as changing weather has been added to the world map. Closing Comments:Hakoniwa Explorer Plus is entertaining but isnt extraordinary once you get past the novelty factor of the half-naked killer demon girls. For RPG standards the story and gameplay are enjoyable but shallow. The game doesnt provide much of a challenge, and while that may sound like a criticism, it isnt that detrimental if the player just wants to see the different areas and bosses and enjoy the humorous moments. The moments of enemies breaking the fourth wall, silly dialog and the ludicrous motivation for the fake final boss for trying to destroy the world and the way to thwart that to unlock the true final boss are amusing. Hakoniwa Explorer Plus is a simple game that provides simple fun, and if expectations are kept in check, theres a lot of fun to be had with this title.", "date": "July 27, 2018", "grade": 3.5}