{"name": "Atelier Shallie Plus: Alchemists of the Dusk Sea", "ref": "https://hardcoregamer.com/?post_type=post&p=243371", "text": "Someone unfamiliar with Gusts overarching Atelier series could be forgiven for believing that they are generic cutesy-poo JRPGs with a crafting emphasis. That was my view of the franchise before playing the updated Vita port of PlayStation 3s Atelier Shallie. That was also precisely what I was wanting as I downloaded the game to my portable in preparation for a extended weekend visit with the in-laws. Escapism fun and a ready made excuse to ignore the in-laws? That sounds magnificent. Well, the visit went smoother than previously imagined and the game was deeper and more interesting than the series gives itself credit for.Just like the original PS3 version, Atelier Shallie Plus: Alchemists of the Dusk Sea takes place in a world that is finding water becoming more and more scare. Previously rich oases are drying out and people are going thirsty. Plus, no water means no beer. No beer means no reason for living. (Love you, wife.) It becomes incumbent on a pair of of alchemists, both nicknamed Shallie, to discover the cause and solve the crisis. The two each have a separate campaign that can be selected after the prologue. While their stories do intersect at parts, they also diverge, making a play through both worth while, especially for trophy hunters.The heroines themselves are a bit heavy on the tropes. Shallistera is the daughter of a tribal chief who is said to hold great, but latent, talents. She is introduced on a boat on its way to a likely starting point in the water crisis investigation. In actuality, she is more of the sage doofus character class that will save the world, but probably on accident. Shallotte is more of the straight up dingbat without the trappings of being told that she will accomplish great things. She is also the one I chose for my playthrough, though I intend to get through the other. Shallotte might be gratingly ignorant, but she is also incredibly earnest, working through her flaws and struggling to become a better alchemist and, in turn, contributor to society. Still tropey, but more endearing. While the plot does struggle under its own formula, it still manages to be interesting enough to pull the player along from point to point. This is helped by the structure. Divided into chapters, progress is made by completing life tasks. These can range from picking up assignments at the Union for gold, clearing out a region of monsters and items, cleaning trash, and more. It seems like everything that is accomplished contributes to some other overarching goal, allowing the player to feel like progress is being made at a breakneck pace even if the story is stagnating.The alchemy itself is a point of interest. There are many titles where the crafting system feels designed to pad out play time and nothing more. When a franchise is designed to make it the linchpin, like the Atelier series, it can be cause for concern. See the fact that this is the first entry that I have touched. However, Atelier Shallie handles crafting in an elegant way. Its deep enough that alchemy abilities come into play, allowing the player to tweak and fine tune how an item will turn out, while preventing the system from becoming too dense, collapsing under the weight of its pretension. Playing Shallie Plus makes me regret avoiding the series before. There is a satisfaction to be earned from hunting down the proper ingredients to craft a fresh piece of armor for a teammate. Monster Hunter fans will recognize this, but the crafting here feels lessannoying than Capcoms action franchise. Besides, some people might prefer the JRPG turn based combat found here. One item of note that was pointed out in our initial review was the graphics. It was mentioned that the character models were exemplary while the environments were lackluster. This is a conclusion that I can agree with for the most part. The characters designs are absolutely gorgeous, taking a tone similar to a Victorian anime with heavy fantasy influences. Each costume is impressively textured, showing a remarkable amount of care. The environments suffer in the comparison. Utilizing more bland cookie cutter areas, they see some benefit in the Vitas OLED screen, but they do feel a bit uninspired.As far as whether or not this edition is worth the double dip, that can be tough to dictate. On one hand, most of the new content appears to be heavily loaded in later parts of the story, making Plus a more frustrating time for vets who just want to get to the novel stuff. This is especially relevant as the additions to this edition are meant to close out the Dusk story arc in style. On the other hand, it has been long enough that it could be argued that the Vita release provides the perfect excuse to start over again. Mileage, of course, may vary. Closing Comments:From personal experience, it can be said that Atelier Shallie Plus: Alchemists of the Dusk Sea is the perfect place for series newcomers to start. The various areas of character improvement built into the systems here means that it feels like the player is always making rapid progress, even when completing the most mundane of tasks. Coupling this with an interesting, if not revolutionary, story makes for an engrossing game that would have dug its hooks even if it were not the only digital escape hatch provided for a trip to the in-laws. PS Vita is one of the most important destinations for JRPGs on the market and Atelier Shallie Plus is another major reason why.", "date": "Bohn on January 17, 2017", "grade": 4.0}