{"name": "Rise & Shine", "ref": "https://hardcoregamer.com/?post_type=post&p=242627", "text": "This dilemma may have already been posed when we last reported on the release date of Rise & Shine, but theres always a difficulty in making a game thats an homage to, parody of, or draws heavy inspiration from the world of video games as a whole. After all, one misstep and you wind up with an improper tribute or an example of the type of mediocrity that you wanted to poke fun at in the first place. So an action-packed platforming game taking place on an entire planet revolving around video games that runs on a lot of gaming logic has the possibility to go very wrong. So does Super Awesome Hyper Dimensional Mega Teams ode to the classics avoid any pitfalls, possibly even leading to a gaming classic about gaming itself in the process? Lets find outOur story centers around Rise, a young kid existing on the peaceful planet of Gamearth, home to several friendly video game characters living in harmony. But when the evil space grunts from the planet Nexgen attack, Rise suddenly finds himself being given a talking gun named Shine from a dying legendary hero, and so the two must team up to bring Shine to where his legendary weapon status can unlock the key needed to defeat the invading grunts. As you can can tell from the fact that our enemies come from a world named Nexgen, the satire isnt exactly subtle (and gets a bit blatant near the end). That said, the game never overdoses on video game references alone, nor truly relies on them for their story. And the dialogue between our characters is well written, with a lot of them getting in some good lines. There are also some ideas introduced such as gods in this world being guides, or in other words, the players, which help flesh out the world of Gamearth a little.And indeed, Gamearth is a world definitely worth defending, even for just how pretty it is alone. Mind you, most of it is in ruins at this point, but its pretty nonetheless. The backgrounds are absolutely gorgeous, brimming with several cool details and Easter eggs, as well as a variety of color that makes everything a true sight to behold. The character designs are also quite cute, even when it comes to the sinister machines attempting to rip you apart. And even then, Rise has a nice variety of death and respawn animations to delight you in a weird way. And this isnt even getting into the larger bosses that fill the screen, which are a true highlight. All in all, a feast for the eyes with several neat shout-outs.Of course, it goes without saying that a run-and-gun platformer like this needs to have some solid action, and Rise & Shine definitely shows off some skill in that area. It starts off simple, but then you get two different types of ammo to play with, regular bullets and energy blasts, and with certain enemies more vulnerable to one than the other. So in the midst of a huge firefight, you have to quickly deduce what bullets work best, and having to switch between them in time, all while a variety of foes descend upon you. You also get Not a Hero-style 2D cover-based shooting to work with, which much like in that game, works out surprisingly well. And the bosses mentioned before put up quite the fight indeed, a lot of them being cleverly designed and definitely worth tackling. If the goal was to emulate the older NES classics like Contra while still throwing in their own twists, then I would say mission accomplished, for the most part.In between the moments where you blow enemies to smithereens, though, Rise & Shine does manage to shake things up a little by featuring some puzzles requiring you to properly master the two other types of bullets you can pick up, those being remote controlled bullets and grenades. The grenade puzzles basically involve proper timing and aiming, as you set then to detonate in time to trigger some switches or hit weak spots, which are done well. The remote controlled puzzles are more of a highlight, though, as you navigate a bullet through a series of radio fields to reach a goal without hitting anything or getting shot down, which have the perfect level of trickiness and control surprisingly well. It definitely shows the the gameplay has some nice versatility to it, so these bits are welcome additions.But aside from the ammo-based puzzles, Rise & Shine does feature some other incredibly clever gameplay ideas as well, especially when it takes advantage of its video game universe setting. At one moment, a puzzle requires you to get past a gate that zaps you to death by having it kill you, then waiting for Rises skull to roll past it so that it can respawn in a new area. Or in possibly my favorite moment, during a puzzle boss where Goomba expies are constantly spawning, which can kill you instantly. After attempting to shoot them with bullets while switching to the energy blasts needed elsewhere proved to be tricky, I discovered the best way to deal with these enemiesis to just jump on their heads. After all, they are Goombas (sort of). Its moments like that when the game full embraces its setup, and really gets creative.So basically, when Rise & Shines various elements comes together, it really fires on all cylinders. Unfortunately, it ends up firing a few blanks as well. Some notable ones would be a bit of awkwardness at times when aiming, notably during any segments that involve lots of enemies and/or parts where the action is zoomed out a bit. Its in those moments when you have to spot where Shines laser sight is aiming while paying attention to a cloud of enemies and bullets coming at you (and its a tiny sight at that) where things get annoying. Not exactly helped by another blank involving a few cheap hits as well. Rise does have a health meter that regenerates, but since most attacks deal enough damage to kill him in one or two hits, certain enemies feel like they have an unfair advantage.As an example that highlights the two previously-mentioned flaws, one of the enemies that appears is a ridiculously tiny drone that zips around and releases a bunch of tiny bullets. Which wouldnt be too bad if the bullets were spread out, but instead they get released in one giant cluster, so the end result is still basically a blast that kills you in one hit. Combine this with a target thats almost the size of one of Shines bullets, and you get a recipe for annoyance, especially when they show up during the final battle and boss fight.And speaking of which, lets get to the biggest blank that Rise & Shine fires, one that isnt as fatal as a blank was to The Crow, but one that still manage to harm the games overall quality nonetheless: Its short. As in, two hours long, possibly even less if youre a skilled player. Now, a short game isnt necessarily anything bad. Heck, I can name several games just as long that still managed to satisfy. So whats the issue here? Well, the problem is that just as Rise & Shine has set up all of its mechanics, introduced enough interesting gameplay ideas and puzzles, and truly set the plot into motion, it just sort of abruptly skips to the climax.In fact, it almost feels like there are a few levels missing, because the final parts see a notable sudden difficulty spike (not helped by having only one checkpoint in them). Actually, I suppose I should say that the game lasted two and a half or three hours instead of two, but that final part felt so cheap and full of artificial difficulty that I refuse to acknowledge it towards the overall length. But yes, compared to other games where things still feel like they were properly built up, explored, and all came together in the end, Rise & Shine spends too much time building things up, and it doesnt give its best ideas enough time to see their greatest potential. Even the whole guides concept seems to get dropped by the end, wasting some potential interest. there are some optional targets to hunt down and shoot as collectibles for a little replayability, but they still didnt feel like too much of an incentive to replay things.Closing Comments:Despite its brevity ultimately doing some notable harm to it, Rise & Shine is still ultimately a solid platformer for the most part, one that has a lot of cute callbacks to classic video games while still having its own unique charm, along with some impressive graphics and nifty ideas sprinkled throughout. The action gets nice and intense, and save for the end, puts up a meaty yet fair challenge. So while it isnt exactly the greatest at skewering gaming culture while also honoring it, its still an overall good game, and one that may indeed be worth checking out. At the very least, you get another chance to kill the Duck Hunt dog again, just in case you still couldnt get enough of that before.", "date": "January 13, 2017", "grade": 3.5}