{"name": "The Walking Dead: A New Frontier: Ties That Bind", "ref": "https://hardcoregamer.com/?post_type=post&p=241250", "text": "For a franchise that has become most synonymous with its appearance on television, The Walking Dead has been successful across several mediums, including video games. Despite a few failed attempts over the years, Telltales take on The Walking Dead series has been a shining modern example at licensed gaming done correctly, with the first season back in 2012 being critically acclaimed for its powerful and emotional episodic tales. The second season began at the tail end of 2013, and while its sophomoric slump was unavoidable, it still managed to take advantage of what worked well in the year prior, and keep players invested in both old and new characters alike. Now, over two years after the end of season two, the first two episodes of the third season have been released simultaneously, with a new subtitle, a new protagonist, and plenty of lessons learned from the studios other series produced during that time. While Clementines presence still reigns supreme anytime shes on screen, Telltale has provided a strong and intense start to Javiers journey in Ties That Bind thanks to an improved presentation and its focus on multiple storylines.With A New Frontier only appearing on current-gen platforms, Telltale has admirably set up a relatively simple process to transfer Season 2 saves, which helps not only players looking to play on the updated version of last gens consoles, but those who would rather transfer across brand lines as well, helping out those who had a different primary platform four years ago. While most of the decisions that carry over are solely relevant to previous protagonist Clementines storyline, Ties That Bind starts off with Javier Garcia and his extended family, as they come to terms with their apocalyptic future in a chaotic opening that highlights the episode. As a whole, the opening hour does a solid job of introducing the Garcia clan and their surprisingly light-hearted approach to their bleak future. Some unfortunate choices sends Javi, the Garcias, Clementine, and some new allies down a twisting path, and while most of the outcomes of the first episode have all been seen before, Telltales compelling presentation techniques helps the intro from feeling like more of the same.The second part of Ties That Bind sees more of a return to form for The Walking Dead, offering some of the most panic-inducing choices seen in any Telltale game. Clementines presence throughout the series is a key aspect of the pressure behind those decisions, as her complicated backstory during the time in between seasons is slowly unveiled through playable flashback sequences. Telltale does a great job of making her stand out amongst the supporting cast, bringing out the best, and worst, in Javier and his new band of assorted survivors, resulting in an intense cliffhanger that finally shows a sense of direction for the remainder of the season. While the gameplay in both episodes is largely unchanged from seasons past, the graphics have certainly received a boost, adding more detail and smoothness to a similar art style. Some technical issues are present as well, with semi-frequent frame drops and freezes ruining some of the more intense moments of the episodes.Closing Comments:Despite numerous success stories from Telltale over the past few years, the studio seems rather content with sticking with The Walking Deads roots in its newest season, with no new gameplay mechanics or story themes being introduced. This doesnt prevent Ties That Bind from being a strong season opener, however, with the second episode in particular offering some truly intriguing events, characters, and choices for players to stress out over. While the third season will be unlikely to re-entice those who fell off after the second season, those who yearn for the emotional scenes and depressing themes of Clementines journey will find plenty to appreciate in the first two episodes of A New Frontier thanks to Telltales high-quality storytelling skills and presentation.", "date": "on December 28, 2016", "grade": 4.0}