{"name": "EA SPORTS PGA TOUR", "ref": "https://hardcoregamer.com/?post_type=post&p=439845", "text": "For years, EA had its feet firmly planted for PGA games until the last generation started. Having Tiger Woods as the cover athlete every year was a draw alone. Much like the PGA Tour trying to find their player, EA tried with Rory McIllroy as a cover athlete and a lot of promise. The series was shortly abandoned and it took nearly eight years for the company to release a new PGA title. EA SPORTS PGA TOUR is the first true next generation golf title that is complete with the best aspects of what the PGA offers for fans. Unfortunately, despite hitting all the checkmarks to attract golf lovers, the overall experience lands in the rough.Now that theres competition in the golf video game space, there are two clear ways to go thanks to the release of EA SPORTS PGA TOUR. One has more of a focus on a golf game with customization options that gets a roster filled with celebrities. The other, being this game, has a much more focus on specifically providing a true PGA Tour experience. This is highlighted most by offering the best PGA Majors and courses for fans of the sport. This starts with The Masters, which hasnt been available in video game form for ten years. There are thirty courses in total with two fantasy courses added with even more to come. Courses like Kiawah Island (complete with ocean sounds), Augusta National, Pebble Creek, Wolf Creek and more are all LIDAR scanned for realistic detail. This is the place to play the courses that fans watch on Sunday afternoons on CBS, which is no doubt the biggest draw for this game.EA SPORTS PGA TOUR also includes 22 licensed playable golfers at launch. This includes both PGA and LPGA players and while youll see the #1 ranked golfer in the world Scottie Scheffler, Jordan Spieth and Lexi Thompson, for example, scrolling through the roster is underwhelming. Jon Rahm, who just won The Masters and has been a major player in recent years, is missing. Others like Rickie Fowler, and of course, Tiger Woods are not on the roster. What makes this worse is plenty of players show up on the leaderboards that are recognizable. EA is planning post launch roster additions and the availability here is at least solid enough currently. Its also nice to see that each golfer has a rating in the game and helps with local multiplayer matchups. The major attraction to this game are these two aspects as the game goes a bit south in terms of its depth. The course selection is important, but the overall lack of customization options hurts. Players can create up to only four golfers with the goal of taking each one through a career and leveling them up to be competitive. There are also no course customization options either, but again with a course selection this deep of the best courses on the tour makes up for that as players will be able to specifically learn each course. In this way, the newest game throws back to those original EA PGA titles.Creating golfers is limited, but the facial details are there. These golfers can be used in any mode, but this works best if you have siblings or friends who want to create themselves and work on getting their golfer up to par. Unfortunately, that will be a long road as the Career Mode included doesnt intertwine with multiple players and golfers can only unlock XP through the Career Mode. This mode provides the ability to choose to start in Amateurs, Korn Ferry Tour or jump right to the PGA Tour. There are quests to complete along the way, but these are more long term such as making cuts at Majors that provide XP boosts. The goal is to improve the golfer and other than playing through events, thats the jest of the Career Mode. While its multi-year, that means XP becomes more difficult to obtain the more you level your golfer. Upgrading golfers includes unlocking shot types as you allocate skill points to Power, Driving, Accuracy, Short Game and Putting. I will say taking out your low-level golfer and going back and playing with Scheffler is night and day, so upgrading is important. Rewards are also provided as there are a good bit (almost forty) of licensed clothing apparel and equipment. Swing animations, shot shapes and ball trajectory can also be customized with the golfer. Each PGA golfer actually has their own swings implemented into the title to better create separation and style from each golfer. The game offers twenty different shot types that are rated at different tiers such as Bronze, Silver and Gold with some Epic put in there. These twenty shot types are broken down between Driving, Approach, Short Game and Putting. The game doesnt do a good job of providing insights to what exactly each shot does, however, and the shot previews arent consistent. This is where the problem with the gameplay begins.Frostbite powers EA SPORTS PGA TOUR and from a visual standpoint, its stunning and simply blows away the competition. What it lacks is the consistency in shooting and the ball physics. This may come down to the golfer rating of each, as playing with high level golfers seem to net a better result, but there are too many times where shot placement makes no sense. I had to enable the full shot preview to see where the game intended to actually put the ball as what the game provides in terms of a cursor isnt right. Rather than learning how to approach shots from a golf perspective, youre adapting to what the results of each shot will be and actually hoping for the best. The wind swirls and I didnt even realize this until I put the full shot preview on. EA brought in analytics technology with Pure Strike Powered by Official PGA TOUR Shotlink and Trackman Data. This is to allow for realistic outcomes based on those individual unique golf swings that were mentioned above. What I question is why I hit chip or pitch shots straight on, but they still tend to go left or right? Or why I place the cursor in an area I want the ball to go, but it ends up shanked? What is great that EA brought back was the Perfect Hit animation on drives, Heartbeat Moments and the ability to spin the ball while its in the air. This time, however, theres a meter tied to how much spin can be put on certain shots. Dont get me wrong, the game is fun to play, but the inconsistencies in shooting create a lot of frustration. The issue with the overabundance of analytics doesnt make the game as approachable for casual players due to its difficulty and that frustration from shot inconsistency, and Im only playing on Pro.This game has been delayed and EA is still pushing post-launch content. There is a 3-click mechanic coming in mid-May for the title and with additional golfers and courses on the way, it really seems EA wanted to make sure this got out in time for The Masters. Although I will say I did enjoy having the tournament on one television and playing this game on the other. Other game modes include Challenges, Tournaments, Competitive and Social Online Matches and a Private Match for online friends only. The Challenges include updated live ones where you will take a PGA pro and relive moments. EA has already posted Masters moments from over the weekend, which is cool and adds some to the experience. The online modes are lacking, though. The Competitive and Social modes are essentially the same thing, but the design is limited. There are no lobbies and no setup options; rather the game provides short holes at random courses to play. It supports up to sixteen players that will golf at the same time with the other players on the course. Unfortunately, the rooms only filled with a handful of people at the most. Theres no crossplay which would open up the rooms. The Tournaments have players playing at their own pace to set a score much like the older titles. This is where the microtransactions in the game, however, come into play. The online play itself is consistent with no hiccups, and thats a positive.The nearly-forty licensed products in the game are all simply aesthetics including the actual golf equipment. The Tournaments have BUY-INS, which is absurd. There are different tournaments that last longer and some are free, but the fact that some of these tourneys have buy-ins that require real money is concerning. Licensed clubs can be purchased alongside shafts, balls and more, but theres no attributes. If you want that Taylormade Driver, it isnt going to improve your golf game. Its simply a aesthetic and a big miss in the game as the competition offers different attributes for every club purchased as changing shafts and balls also affect shooting. These are also only meant for your created golfer so you cant put any of what you purchased on a PGA golfer. The otherside of this aspect is that players cant go in and just buy the best clubs in the game, which eliminates the pay-to-win idea. Lastly, EA SPORTS PGA TOUR doesnt require an internet connection to access quick play, but it does for everything else. Theres no point to force this for the Career Mode. Frostbite stands on its merits as EA SPORTS PGA TOUR is utterly gorgeous across the board. You wont find any low resolution textures anywhere and the courses are lifelike. Really the only aspect of the visuals to nitpick is that the trees dont move much when its windy and some far away visuals have objects pop in. Otherwise, the varying grass, water, reflections and basically everything else is top notch. The player models look detailed and the clothing has ripples and wrinkles that help add a level of realism, but the clothing also doesnt move with the player. The elephant in the room is that the game is currently capped at 30 FPS on consoles with a promise of a 60 FPS patch coming later. This would actually tremendously help gameplay as swings are currently timing-based.The crowds are lively at each event and also manage to be detailed. Strangely, there are no crowds when playing online and the game is awkwardly silent. The overall presentation is different for each course and does a great job of creating a broadcast feel. The commentators help add to the atmosphere and do a solid job with dialogue. Little cues such as birds chirping, the sound of the ocean, planes flying by, etc all add to perfectly replicating whats watched on television during an event. The one thing missing is always the few people who yell things like get into the hole or something of the sorts, just that added layer of detailed audio you hear during events. One thing that majorly lacks in the presentation is the lack of replays and some score overlays. The lack of replays is bothersome if youre hoping to see that last shot you just made. Otherwise, this is a prime example of why sports games need more official television broadcast overlays. Closing Comments:The most welcome aspect of EA SPORTS PGA TOUR is the PGA aspect itself. Having the biggest courses on the tour with more to come is the driving force behind the game. Offering PGA Tour pros with individual ratings and some detailed separation with the shot animations and other analytics from Shotlink and TrackMan adds major diversity between golfers. The beautifully-detailed courses and golfers will attract any PGA fan. Its the lack of depth and the gameplay inconsistency that ultimately hurt the return of the franchise. Some of these issues can be mitigated in the future and adding 60 FPS will be a major addition on consoles. The Career Mode is shortsighted and the microtransactions with a focus on aesthetics and forcing players to spend actual money to buy into a tournament is disappointing. Adding to that is the requirement of an internet connection to access 90% of the game. The lack of customization options also hurts, but what EA SPORTS PGA TOUR offers best is a solid single player PGA game with the ability for excellent couch multiplayer. While this game teethers more on being a successor to Rory McIllroy PGA Tour rather than the Tiger games of years past, EA has brought in a good bit of those original design implementations and modernized it for todays hardware. While it still needs more polish, EA SPORTS PGA TOUR is fun to play and EA shouldnt give up on the franchise.", "date": "April 07, 2023", "grade": 3.5}