{"name": "Arizona Sunshine", "ref": "https://hardcoregamer.com/?post_type=post&p=240484", "text": "The zombies have risen and destroyed the world again, as they do on a near-weekly basis. Per BAU procedures, humanity has been transformed into a shambling mass of brain-hungry corpses and the survivors can only hope that death doesnt come in too terrible a form. Youd think wed be used to it by now, but every apocalypse comes with stories of survivors desperately fighting the odds until theyve been so traumatized and scarred by the experience that the zombies seem cute and friendly in comparison. Unless youre basking in a comfy cave in sun-drenched Arizona, as it turns out, because then a perky attitude covers up the constant fear of death and helps keep survival an upbeat, if lonely, experience.Arizona Sunshine is the story of a lone survivor who hears a brief moment of an actual human voice on his radio and promptly leaves the well-protected safety of home to investigate. Hes named every zombie he comes across Fred and has become fairly chatty with them, seeing as hes got nobody else to talk to. It doesnt stop him from using the Freds as target practice, of course, but at least hes friendly while blowing their brains out the back of their skulls. Armed only with a pistol and a positive attitude the survivor heads up the path along the river and onto the road in search of someone who can actually talk back.There are, of course, a few problems along the way, in the form of plentiful zombies who jump down from cliffs, crawl through cracks in the rocks, and come racing from every direction when they hear a sound. The survivor tries to keep quiet but between the crack of the gun when dispatching random roamers and the beeping, grinding, and occasionally musical old machines its hard to keep a low profile. Hes going to have to shoot a couple graveyards-worth of the undead on his sunny afternoon walk, and theres no forgiveness for sloppy gunplay. The action of Arizona Sunshine is almost, but not quite, a VR shooting gallery. Each of the controllers is a gun and you aim and shoot manually, with no handy targeting reticle to magically place the bullet. While you only start off with a single handgun it doesnt take long to find a second, and theres plenty of ammo for the two if you keep an eye out for it. Eventually you find a machine gun, grenades, and the wonderful stopping power of the shotgun. Ammo is limited in how much you can carry but as a rule you should have plenty for each encounter, and restocking along the way isnt hard. You can only carry four guns at once, two in hand and two at holsters on your hips, and ammo is held on your belt.The ammo belt is a surprisingly strong presence in a firefight. Each gun holds a set number of shots, with a modern handgun having a nice clip size while the revolver only holds the expected six bullets, and the shotgun has an ammo clip on the side showing its three shells. Once empty the gun just clicks uselessly, so youll need to hit a button to eject the clip, then bring the gun to your waist for a fast reload. When the action heats up its easy to lose track of which gun has how many shots left, but the life of a zombie apocalypse survivor isnt supposed to be easy and the reload forces a moment of thought into what might have been mindless shooting otherwise. Keep an ear open for the empty-ammo click, aim carefully, and soon the zombie wave subsides and you can continue on your way. You wander the levels by teleportation, pushing up on the control stick to place a circle and left or right to change the facing direction when you land, then hit A to instantly pop over to the new spot. While its hard to do this when facing down a horde of zombies its not impossible, and sometimes (rarely) its smart to run away rather than stand still and get eaten. The teleport target wont let you go around obstacles in a single placement, so youll need to take a short walk in two or three hops, but for the most part movement is straightforward and completely nausea-free. Youll want to do more than head straight to the next goal, though, because ammo is tucked away everywhere.Most free-roaming games let you explore the cabinets and drawers along the way and Arizona Sunshine is no different, but thanks to good use of touch controls youre reaching out and pulling things open. On the one hand its a nice touch of semi-real-world interactivity, on the other you need to line up right so that when open you can see inside, and the movement system is clunky in tight spaces. It also doesnt help that things with doors almost always want to open right through your face, which can take a bit of getting used to. The interactivity also extends to a handful of objects in the environment, such as basketballs, cans, large rubber duckies, and a few other items, but it doesnt apply equally to things youd expect to be able to move. Picking up the extras do much of anything, but theres an inconsistency to what you can play with thats a little odd. Thankfully its not the point of the game, and after a few areas you wont be bothering with anything that isnt directly tied to new guns or more ammo. Closing Comments:Arizona Sunshine is a decent take on the zombie shooter, hardly revolutionary, but using its tech to good effect. The gunplay is a load of fun thanks to the VR controllers, essentially making each encounter a test of your real-world aiming skills. The standout features are the setting, with its sun-drenched environments, and the surprisingly well-written main character who bounces between humor and fear without overdoing either. The weakest part, though, is a cave area that just goes on too long, but the rest is an adventure through a number of environments that are just lengthy enough to explore without wearing out their welcome. Like a lot of full-VR adventures out currently, the central campaign is fairly short, but extra modes in the form of a zombie-rush horde and co-op multiplayer options help expand the games lifespan. Arizona Sunshine brings clear blue skies and a breath of fresh air to the zombie genre, and while its not a revolution, the game shows theres still a little life left in blasting an undead horde into a splattery mess.", "date": "December 23, 2016", "grade": 3.5}