{"name": "Capcom Arcade 2nd Stadium", "ref": "https://hardcoregamer.com/?post_type=post&p=424800", "text": "Capcom has undoubtedly churned out a massive library of classic arcade games. Last year they released a compilation of over thirty arcade games spanning three decades of gaming. As many games as there were in the collection, there were notable exclusions that fans wanted added. Some of them got their wish as Capcom Arcade 2nd Stadium is another collection of 32 games spanning multiple genres and decades. But like the real arcades that used to be popular fixtures in strip malls, a compilation is only as good as the game selection. With so many heavy hitters included in the first one the question is whether the 2nd Stadium is worth your quarters.Capcom Arcade 2nd Stadium is virtually identical to Capcom Arcade Stadium, save for the different game library and going with a pink background color instead of yellow. The player can adjust the individual settings on each game. The particulars vary between games, but these include items like difficulty level, number of points to get an extra life, game speed and so forth. The displays can be stretched into full screen or into letterboxed viewings with the original 4:3 aspect ratio. There are multiple save states to record progress across the multitude of games and a rewind feature to go back a few seconds if a mistake a made. The invincibility DLC that was one dollar on the original Stadium is now available as a free download.32 game are included in this collection which include 1943 Kai (1987), Avenger (1987), Black Tiger (1987), Block Block (1991), Capcom Sports Club (1997), Darkstalkers: The Night Warriors (1994), Eco Fighters (1994), Exed Exes (1985), Gun.Smoke (1985), Hyper Dyne Side Arms (1986), Hyper Street Fighter II: The Anniversary Edition (2003), The King of Dragons (1991), Knights of the Round (1991), Last Duel (1988), Magic Sword (1990), Mega Man: The Power Battle (1995), Mega Man 2: The Power Fighters (1996), Night Warriors: Darkstalkers Revenge (1995), Pnickies (1994), Rally 2011: LED STORM (1989), Saturday Night Slam Masters (1993), SonSon (1984), Street Fighter (1987), Street Fighter Alpha: Warriors Dreams (1995), Street Fighter Alpha 2 (1996), Street Fighter Alpha 3 (1998), Super Gem Fighter (1997), Super Puzzle Fighter II Turbo (1996), The Speed Rumbler (1986), Three Wonders (1991), Tiger Road (1987) and Vampire Savior: The Lord of Vampire (1997).Mega Man 2: The Power FightersA difference between the 2nd Stadium and the original is how the games are purchased. In the original the player had the option to either purchase the complete collection or choose from three different bundles that represented an era of games. Instead of offering bundles, with 2nd Stadium players can now choose between purchasing the complete collection for $39.99 or each individual game for $3.99 apiece. Doing the math its better to just spring for the full bundle unless youre only after a handful of games. It is also worth noting that six of the ten games included in Capcom Fighting Collection, released last month, are included in Capcom Arcade 2nd Stadium, which may be a factor in determining the overall value of purchasing both collections.Much like last years predecessor, Capcom Arcade 2nd Stadium has a collection that spans several genres, though fighting, beat em up and shooter covers the majority of the titles. Magic Sword and King of Dragons are good titles whose absence was noticed in the original Stadium. The Street Fighter Alpha series is also a nice inclusion as that particular branch of Street Fighter doesnt get too much attention. Collections like this a great to revisit old favorites along with some decent games that were missed the first time around. Prior to this collection I never played arcade Mega Man games and they ended up being an interesting twist on the blue bomber, maintaining signature elements of the series while transforming it into an arcade friendly one on one fighter. Eco Fighters was another new experience, which was a creative take on the horizontal flying shooter that Capcom has shown a mastery of crafting.King of DragonsThe majority of games in Capcom Arcade 2nd Stadium are worth playing. There are a few that dont hold up too well and without nostalgia goggles it may hard to see the appeal. Street Fighter II is one of the greatest and most influential fighting games ever made, but the original Street Fighter is only worth playing for historical context. Some games like Black Tiger were more interesting in seeing it as a technical precursor to Magic Sword. Some of the older games might not be as engaging without nostalgia goggles, but are still interesting to play if for no other reason than to observe the evolution of gaming. A complaint that will come with any collection, as there was with the first Stadium, is that there are still many great games missing. Area 88/UN Squadron, Alien vs Predator, Dungeons & Dragons: Shadow Over Mystara and a number of games involving Marvel Comics and the word versus spring to mind, though those might be earmarked for a third Stadium. But even with regard to all of that the games curated here comprise a great collection of arcade games.The graphics and sounds of the original arcade games are faithfully preserved in this collection. The modern quality-of-life improvements such as the rewind feature can be useful to get past difficult areas and the save state is great for being able to return to complete a game later. Having access to unlimited virtual quarters makes it theoretically possible to beat any game thats considered unfinished business, though some games like 1943 Kai dont allow continues on the final level, at least on the highest difficulty setting. Access to dip switches is also a wonderful feature so players can customize the games to make them as difficult or easy as they wish, along with adjusting display settings and game speed in some cases.Eco FightersClosing Comments:Capcom Arcade 2nd Stadium shows that Capcom has created so many memorable arcade games that it takes more than one collection to hold them. The variety of games that span decades and genres provide something for everyone, though fighters and shooters seem to occupy most of the real estate in this arcade. Whether this collection is used to revisit childhood favorites or discover games before ones time, there are opportunities for dozens of hours of entertainment. Options like being able to adjust to the display to either fill the television or create the illusion of an arcade cabinet are nice modernizations, as is the ability to adjust difficulty and other settings of each game. For retro gaming fans this collection is the next best thing to having a dedicated room filled with arcade machines.", "date": "July 14, 2022", "grade": 4.0}