{"name": "I Expect You To Die", "ref": "https://hardcoregamer.com/?post_type=post&p=239622", "text": "The hardest thing about creating a virtual reality game might just be ensuring that the experience is one that truly makes sense for the space. So far, some titles on PSVR do not feel like they need a headset to be played and would in fact be better without one. On the other hand, were now getting games like I Expect You To Die which truly make good use of VR headsets. Now available on both Oculus Rift and PSVR, this is one game that should be played by VR diehards as well as folks newer to the whole virtual reality thing, because the games concept is ingeniously simple and lends itself perfectly to fantastically fun gameplay. Players assume the role of a spy who must infiltrate locations, carry out their mission, and not die. Of course, given the name of the game, players should be aware that theyre absolutely going to be killed copious times throughout. Each level presents itself in an escape the room fashion. Basically, you receive a brief synopsis of your goal and an idea of the location. Youre totally on your own with how to actually interact with objects and complete this task, though. This is where things get hilariously amusing. For example, the very first level situates you inside a car. One of the very first things you might do is find the key and start it up. However, the car will then require a retina scan and fry you with a laser when this fails. Death comes suddenly in I Expect You To Die  and thats part of the charm. If done wrong, these frequent death states would seem cruel and annoying. Fortunately they were created with care and feel silly rather than punishing. Players are unlikely to keep dying in the same exact way because those quick deaths teach them to avoid certain actions. As they learn about the constrained environment, they figure out what not to do as well as how to circumvent otherwise deadly circumstances. Its this quick learning mechanic which ensures that players want to solve I Expect You To Dies puzzles. Theres a real excitement to playing the role of a spy and figuring out how to outsmart the enemy. And heck, sometimes doing a thing you know is deadly can be amusing just to see the result.After a handful of failed attempts a solution to the puzzle usually becomes clear. At that point, executing it may require a few additional failures before finally getting it perfect. Then its time to move onto the next one. The biggest letdown of I Expect You To Die is that theres simply not enough of it to go around. After just a few levels the game ends, leaving folks jonesing for additional stages. Heres hoping that additional ones might be released via DLC in the future. At the very least at least the game received a full version at all instead of just remaining a demo/beta on Oculus Rift in the past. The PSVR version of I Expect You To Die works with both DualShock 4 and Move controllers. While Move controllers seem a more fitting way to play the game, the motion controls actually feel less precise. This trouble revolves around the unfamiliarity many gamers likely have with Move controllers. You must use their buttons in order to push and pull objects in the environment, which ends up being a bit tougher than it honestly should be. In comparison, anyone who uses a DualShock controller regularly should have no trouble manipulating objects with ease.Closing Comments:It can be hard to find a good entry point for virtual reality gaming when some titles are quite complex and others feel like the VR component is unnecessary. Fortunately, I Expect You To Die crafts an experience that is enjoyable from beginning to end. Not only that, but it never feels like its using virtual reality as a gimmick. The perspective is required to truly get you in the dangerous lifestyle of a secret agent, puzzling away at how to best carry out their mission. If youre looking for a seriously unique puzzle game to spend a few hours with, I Expect You To Die is a great choice for PSVR owners.", "date": "December 13, 2016", "grade": 4.0}