{"name": "The Little Acre", "ref": "https://hardcoregamer.com/?post_type=post&p=239656", "text": "If asked at random what thoughts come to mind when hearing the words video game, most people would probably list off things such as action, explosions and guns. What most people wouldnt think to say is heartfelt, funny and connecting. As anyone who consumes video games daily understands, there are a variety of games with fantastical places to see that might go unnoticed to the average person. The Little Acre is one such game, with more heart in its world than most people could ever imagine and a reminder why games of its type are so important.It can be easy to forget that some of the best games of our time, especially for audiences of the younger variety, might slip by without so much as a second thought. It is also important to understand that games come in all shapes and sizes and The Little Acre is worth every moment of its short tale. Think of any fairy tale one could imagine and this is what The Little Acre is for video games. It shows that even in a medium bogged down with games of violence, blood and adult themes in general, there are stories to be told for everyone. A nod to the magic that can be storytelling in video games even without crawling through dungeons while fighting dragons.The Little Acre is simple through and through, and thats a good thing, presenting an easy-to-digest story that is immediately engaging without being convoluted. Starting out, The Little Acre opens on another morning for father of a quaint farm household, Aidan, whom makes it quite clear that he does not want to wake Lily (his daughter). This is a simple tutorial of the point and click adventure that awaits, and all Aidan needs to do is get dressed so he can begin the day. Aidans clothes are of course scattered about the room. It quickly becomes figuring out how to go about getting Aidan fully dressed while remaining in bed. This manages to teach the ease of point/click, with some light puzzling thrown in, while also having Aiden be quite vocal about everything being interacted with so its easy to understand what he will and wont do while being engaging. Such a simple scene really sets the tone while laying a solid foundation for just what The Little Acre is all about. It doesnt need any bells or whistles to tell its story and it just wants enjoyment to be taken from the adventure about to unfold.After getting dressed in bed (impressive), The Little Acre proceeds to open up more, and as Aidan begins to prepare Lilys breakfast, it slowly revealed that not everything might be right with the household. As Aidan goes about his morning it becomes apparent that his father (Lilys Grandfather) is missing, and not in the he went for a walk to town way, hes missing. The thing is, besides being a farm house, there is also quite a bit of gadgetry and science equipment occupying said household. Namely, Aidans fathers room and the shed out back, which just so happens to be where adventure awaits and the other part of the game is revealed.When beginning the tale of The Little Acre, it presents a visual style not common in the realm of games, which is animation. Every scene in The Little Acre is hand drawn which creates some wonderful moments, giving it the feeling of a true folk tale. In Aidans curiosity/concern to find out where his father is, he stumbles upon a machine, which in its best description is a pod of some sort that looks like any sci-fi pod imaginable. Before even getting near the pod, however, he goes to finally wake Lily. She is an adorable bundle of sleep still waking up, Aidan of course treating her with the greatest of love and compassion a father can show. After having woken Lily, Aidan makes his way back to the pod. Through a series of events, Aidan steps into the pod being immediately transported to another world, which is where the flip-side of the coin takes place.The Little Acre begins strictly 2D while letting the characters occupy a optical 3D space, being transported to the other realm though The Little Acre switches to an isometric style of play, giving it more body where there might be none. By combining these two opposing styles, The Little Acre is able convey a story of two worlds, which are easy to differentiate. It also allows for comedic moments that only hand-drawn animation can bring (think Looney Tunes or just about any cartoon ever). There is something invincible when portraying cartoon quality characters; they just cant be hurt in the same way. Its also for this reason that The Little Acre is telling the story it wants to tell. Pewter Games Studios knew exactly what they were doing when making this game, crafting a world where every detail has been lovingly paid attention too.With Lily now awake, she goes about her morning, thinking Aidan might just be busy with something else. She begins groggily making breakfast (shes the epitome of a morning sleeper), soon realizing her father is taking a little too long with whatever he might be doing. Concerned she sets out to find out just where Aidan might have gotten off to. If Aidan is sweet than Lily is adorable, and of course Dougal (whom hasnt been mentioned), the dog, is lovable too. Lily is quite the opposite from her father and is an explosion (in the best of ways) waiting to happen. I imagine she is easy for kids to relate too, while adults can also understand the patience needed for just having a child to take care off. Especially with Aidan being a single father, while looking after his grandfather. And this is where the core of The Little Acre lies.The Little Acre is about family, and how important those we love are, whether they are with us or not. Lily is concerned for her father and her grandfather, but she puts on a brave face none the less. She is a child that makes her own adventure and like any child has a colorful imagination filled with fantastic worlds. The Gnome outside the farm house, for instance, is revealed to be a spy which reports to Aidan if Lily wanders to far from the home. Adorable, right? Dougal is her trusty companion, who is less helpful than helpful in a way only a dog could be. And there is something fishy about all of grandpas science equipment. Lily of course sets out on a courageous adventure into the unknown after her loved ones, finding things I wont reveal here along the way. Dont worry, this is a family tale after all, so it doesnt have anything drastically tragic or overly adult.The world of The Little Acre itself is something to be praised. The Little Acre combines only the best in art design with narrative direction. The voice acting accompanied by the sound design and musical score creates an atmosphere that will draw anyone in. Voice acting can make or break a game, The Little Acre manages to show that even Indie games can have top notch voice actors. All of these components that make the game so special present something else too. The game is distinctly Irish. This is a game set in 1950s Ireland, after all, but to see such a culturally-driven game is a treat. Pewter Games Studios is presenting their Irish roots by way of sharing a uniquely lovingly handcrafted tale. Every single aspect has been distilled to perfection.Closing Comments:The Little Acre has a lot of heart, presenting a one-of-a-kind magical tale that rivals Disney/Pixar. Tales for children are important, and those that adults and children can take part in together are even more important. The Little Acre weaves a tale that welcomes anyone to be a part, telling the story of family and the joy and sadness that can come from loving those we care about. It manages to have expert comedic timing (I found myself laughing constantly) while also being grounded in the reality of loss. It also doesnt focus too heavily like other media seems to do on the more tragic moments, conveying perfectly what loss is without being overwhelming. The Little Acre is worth every minute; I only wish I could have stayed a little longer in its wonderfully handcrafted world. The tale is a good one, but cut short, and I was ready for more.", "date": "December 13, 2016", "grade": 4.0}