{"name": "Steep", "ref": "https://hardcoregamer.com/?post_type=post&p=238909", "text": "The ambition that drives the core of an experience like Ubisofts Steep is nothing short of impressive. Creating a full explorable facsimile of the Alps and cramming it full of activities to undertake and challenges to master is not a task of for the unfocused mind. The fact that it was successfully done in a graphically-striking fashion impresses. That isnt to say that Steep manages to hit every note that it attempts, though. Indeed, it is a heavily flawed experience with flashes of brilliance.Normally, I would give a rundown of a story, real or imagined. There is no such tale to be told or that can be woven here. There is a mountain range and the player takes control of a heavily-caffeinated XTREME sportsperson. This avatar is dropped on the snow and given the opportunity to prove themselves by winning events. This isnt to say that the game doesnt attempt to create weird narrative moments, such as following a guide while the mountain spells out some hippy-dippy nonsense about the flow of the hills or whatnot, but this isnt a story driven game and its actually the better for it.Instead, this is a game about the events themselves. The four activities here are divided across skiing, snowboarding, paragliding and wingsuiting. Each of these have their own challenge sets, typically involving either beating a time or a high score. While it is possible to lament the lack of variety in event types, the sheer wealth of courses available keeps things interesting for the skiing and snowboarding portions. Zipping through the tight spaces created by small groupings of lodging, or getting the most out of open hill littered with snowdrifts feel different and provides much needed variance. The racing and trick challenges for these sports could have supported the game on its own and might have been better if it had. The high score challenges center around tricks as well as narrowly avoided high velocity make out sessions with the foliage. A great degree of control for steering is afforded, utilizing the right stick for carving the snow or slowing down with the left stick handling general maneuvers. The tricks, such as they are, tend not to work so well. When coming up on a jump, the player needs to hold the trigger well in advance. In order to successfully launch, the player lets go well in advance of when it feels natural. It took way too long and not a small amount of the breaking of ingraining gaming instincts to reliably jump off a ramp, but I was finally able to do it. Getting spins and barrel rolls to work is still a matter of blind luck, with success reliant upon the whims of whatever mountain moon god the game was trying to tell me about during the previously mentioned segment.These are easily the best segments, though. Despite their flaws, there is enough fun and enjoyment to be gained to overlook the issues. The same cannot be said for the wingsuit and paragliding challenges. Flying with the suit should be loads of fun, as achieving high score runs requires staying low to the ground and threading through trees and chair lifts. In practice, its a matter of dropping until close to the ground, then continually holding back on the left stick while using the right stick to juke to the left or the right. Trying to do any different results in a lower score or a face plant. Usually a face plant. The paragliding isnt much better. These are typically slow drifts along a path, hitting predetermined checkpoints or performing stunts that dont translate as well to the videogame. These sections are slow and ponderous. At least they have the benefit of showcasing the admittedly striking graphics.Let there be no mistake, Steep does offer up some lovely scenery to enjoy. From the swaying of the evergreens against the grays of the rocks and the pristine snow, to the rugged cabins and sheds that are discovered during runs, this is a graphical showcase. While there is some screen tearing during some of the brief cinematics, this is a great title to show off a new gaming rig or fancy television. The fact that jumping from location to location or restarting an event is instantaneous, the bedrock technical chops are well on display. In typical Ubisoft fashion, there are some bugs to go along with the graphics. Its not uncommon to have spawning issues. In one particularly egregious instance, I was attempting to perform a paragliding challenge. Each time I attempted to start it, I found myself embedded in the side of the mountain, with the cloth sticking out of the rock like a GoPro branded tree. As restarting is instant, I kept trying and finding the same result. After attempt number ten, I moved to a different event and completed it, and returned later to find myself in a completely different place with the event start circle directly in front of me, right where it should be.Still, this isnt a terrible experience. There are goals to reach and medals to win, and many of them are quite enjoyable. Each event won or meta challenge completed either unlocks new customization options for clothes or gear, or tacks on experience points to level the player up, opening new events. Regarding the clothes, there is a huge wealth options to earn and since there are different outfits between the air and ground stuff, tons of ways to make the ugliest avatar to show off on the online server. Regarding that online thing: unless Steep is being played with like minded friends, it doesnt matter at all. Sure, its a simple matter to group up with random players during natural play, but at no point is there a real reason to do so. The challenges dont really have the type of competitive element that would make beating randoms an entertaining prospect, and due to the free flowing nature of the games structure, everyone is going to want to flitter off to do something else in short order. Neither bad nor good, the online is just kind of present.One item that really should be mentioned is the soundtrack. Ubisoft needs to keep whoever curated this employed, because they know what they are doing. Filled with a variety of unknown (at least to me) acts, it spans hip hop, rock, electronic, and more. Normally, with a range like this, I would find myself going in to disable as much of the music outside my preferred genres as possible. Not so here. The music that was lined up here exudes a creativity and style that both fits the game and is interesting to hear. Plus, the one band I did recognize, The Birthday Massacre, is awesome and needs more attention. Closing Comments:Steep is not a perfect game. Two of the sports types are a total wash and even the good ones have flaws with the trick system. Even so, the playground that Ubisoft has introduced is gorgeous, with unique landmarks to race past and tons of screenshot worthy moments. There is a good game hiding among the issues, but its one that most players might not discover. It doesnt top the best snowboarding game ever made (Amped 3), but it does provide plenty of reasons to continue traveling the Alps. Should the trick system and technical issues be resolved in a sure to occur patch, Steep will become a must play. In its current state, however, its best to approach with caution.", "date": "Bohn on December 8, 2016", "grade": 3.5}