{"name": "OneShot", "ref": "https://hardcoregamer.com/?post_type=post&p=238347", "text": "At first glance, OneShot seems like the standard puzzle/adventure game done a thousand times over. Start peeling back the veil, though, and whats underneath is an experience that will make one question their relationship with games to the core. For something so adorable, this experience sure carries some weight around, the resulting product one that will seep into the mind, not letting go. Ive been attached to characters before, give me enough time and like any gamer I could easily compile a cast of characters that have come to mean the world to me. Its when a game forces the player to realize that maybe they arent playing the character at all that things start to get weird, in the best of ways.Starting out in OneShot, the game introduces Niko, an adorable person who looks like a cat. OneShot pulls off a wonderful trick, starting the player out as Niko, but the player is not really Niko. Niko is his own being and this is where the game shines. Games that break the fourth wall are becoming more common place and thats a good thing. The way OneShot manages to break the fourth wall, though, is something else entirely.What started out as an adventure game quickly turned in to me caring for Niko in a way I never thought possible. Niko awakens in a small bedroom only to find there is no light. Not really a problem, but the first puzzle is quickly revealed so as to allow Niko out of the room/house he is in, while figuring out why there is no light. After some quick puzzle solving, the first of many, Niko finds The Bulb, a massive lightbulb that glows all on its own. This item is the pinnacle of the whole game and the player must be careful with it, while proceeding on the adventure Niko and player are about embark on. As stated, this is not the players adventure, but rather a duel quest, where players will question the very reality around them and possibly wonder if the trials encountered are more than they seem. For it is up to the player to guide Niko, working together to help get Niko home while fixing the world both the player and Niko are now involved with, if one can even do both. It is revealed that the player is a god, at least by the standards of this world. Niko is not from this world either and he makes it abundantly clear that this is not his world, he just woke up in it, and would very much like to go home. Its heartbreaking and like many a great pixel game, OneShot effortlessly conveys emotion. Niko is just a kid, after all, and he understands this.Niko is a brand all his own. Possibly his best feature is his personality. He is present in a way many adults could learn from, while also maintaining a child-like sense of the world. Its the way he questions things around him, while also looking to the player for guidance. Niko doesnt question things out of ignorance, but instead out of genuine curiosity about the situation he has found himself in, while also becoming quite emotional at times. I couldnt help but speak truthfully because of how personal the questions he asked were framed even if they were such simple things as, do you have a Sun in your world? He questions/comments with a curiosity and truthfulness only a child can convey. It didnt take long for me to become attached to Niko and make sure he safely found a way home. Unfortunately, finding a way to get Niko home proved more difficult than thought possible. The world, while three areas large and simple in design, is more than it seems. OneShot manages to break the fourth wall in more ways than one. Niko has a computer in his room and throughout the journey the player will encounter computers with Niko. Its what happens when a computer is used that is astounding. There is more at work than stated and unraveling the mystery that is OneShot is pure joy. For when a computer is booted up, another entity, one of two, always rears its head. Both know the player is trying to get Niko home, but unfortunately both are on opposite sides. Most frightening is what one of the entities seems capable of: using ones own computer against them.This game of hide and seek the program in OneShot plays with the player is diabolical to say the least. Its even more frustrating that the entity will strike up conversation with the player and Niko isnt aware, as he is deaf to the chatter. OneShot becomes truly about saving Niko at whatever cost. I still question if some of the choices I made were correct. The game does warn the player of how certain choices can affect the game permanently, making them question everything. The world of OneShot is a deep well. The inhabitants that make up the world are interesting and just seem to be getting by like anyone else. The world of OneShot is also dying. It is here the importance of the bulb comes too light (pun totally intended). It is revealed early on that the bulb is the new Sun for the world the player/Niko are in. Journeying to the center of the world is key, bringing the player through three unique areas, each with their own biome and way of getting by as their world slowly dies around them. Seeing the different walks of life is heartbreakin, but one will encounter a wonderful cast of characters along the way (some not so wonderful), which makes for a diverse journey. It also creates a sense of thoughtfulness about the world that most games cant convey. It is after all dying and the objective of the game is to replace the sun (lightbulb). Its this anchor of thought that can also be the players undoing. By the end of OneShot, I had to genuinely sit at my computer for a good five minutes before proceeding with the final moments. It was tense to say the least.The ambiance of the whole affair is hauntingly beautiful. The score of OneShot matched perfectly with the mood of it all. Each area having an appropriate-feeling theme which set the tone. OneShot almost seems like a dream at times and the sounds of the world matched with the visual cues of the game convey this feeling fully. This is a game about questioning ones reality, after all. Maybe it is all just a dream, whos to say. The player isnt the only one who can dream, after all. Closing Comments:OneShot makes players question the reality that surrounds them. Is it just a game or is there more to it? The commentary on player/game relationship is enough for a standalone piece, which we may very well write. OneShot pulls players in with poise and wit in a way most games can only dream of, offering up the best an adventure game can offer. With a character that can easily be understood and cared for, OneShot creates an unforgettable adventure while hiding secrets that could very well be missed. What awaits in OneShot is well worth anyones time.", "date": "December 7, 2016", "grade": 4.5}