{"name": "Xanadu Next", "ref": "https://hardcoregamer.com/?post_type=post&p=236831", "text": "Nostalgia is easy but can be hard to justify. There were a lot of terrible games mixed in with the good ones, but by sheer volume spread out over fifteen years there was a lot to look back on fondly from the PS1/PS2 era. Xanadu Next is an action/RPG that can hang with the bet of those games, primarily because it came out right in the heart of the PS2 era. It was originally for Windows PC, although Japan-only, but somehow made an appearance on N-Gage in the US and Europe. The PC version has been given a tiny little upgrade to run on modern systems and, while its obviously a graphics refugee from a decade ago and desperately needs better controller support, Xanadu Next is a brand-new nostalgia trip that would have justified the fond memories.A former knight and the young scholar hes guarding are tracking down the mystery of a castle that appears in the lake mists, its bell ringing out across the waters. After settling into a room at the inn in the islands only town, the knight starts poking around the recently-discovered nearby ruins. The entire island is covered in the run-down remains of an ancient history, but the town gates are locked so a simple tutorial dungeon is as good a place to start as any. After finding the relic in the heart of the ruins, though, the knight is cut down by a mysterious rival, left for dead and only barely surviving thanks to an iron constitution and the intervention of the local priestess. Hes now living on borrowed time, and if the knight doesnt find the legendary Dragonslayer sword then its all for nothing. Grim as the outlook may be, hes got enough time to explore all the islands secret dungeons and learn its mysterious past, which might allow survival provided the apocalyptic evil from Xanadus past doesnt wake up.Thats something to worry about later, though. The knight just got his head handed to him (almost literally) by someone far less powerful than a demon, so the first thing to do is level up a bit while exploring the island. Xanadu Next is an action RPG with light puzzle elements, so leveling up means hitting a whole lot of monsters with sword, axe, bludgeon, or the occasional blast of magic. Every defeated monster adds to the weapon proficiency skill, which starts at zero for each one but can raise all the way up to 200%. Each weapon has a skill built into it, and when equipped at a low proficiency youve got full access to the skill for as long as youre wielding it. Get to 100% and not only does the overall damage with that weapon raise but the skill is permanently added to the knights available arsenal, with the disclaimer that you can only have four skills running at once. The four slots also include magic, so its important to choose carefully. Having a couple of passive skills that run silently in the background, maybe with one increasing gold and another enhancing damage when attacking from behind, is all very nice, but sometimes you just need to blast out a string of fireballs or gain a little room with a spin-attack. Every magic spell and active skill can be used a set number of times before it runs out of uses, but a good nights rest back at the inn or finding one of the rare save points tops them off again, good as new. After a few lively rounds of monster-beatings its time to level up, which isnt as instantly-useful as it normally is. The level is just a number until you hit the church to allocate points, six per level to spread out over five stats. It doesnt sound like much but each point is a significant upgrade in the statistics strength, and another step on the way to better equipment. Each weapon, shield, helm, and body armor has a requirement that has to be met before it can be equipped, so if youve found a killer sword with a Strength requirement of 20 while youve only got 18 points in there then it needs to be saved for later. There arent that many different types of weapons and armor, but they show up just often enough that each level-up should allow a new piece of equipment. This is important because it directly affects how you grind the dungeons.Each new area has new monsters, and as expected theyre bigger and tougher than before. In one of the last sections of the game I went from only worrying about receiving 20-30 HP per hit in the previous area to 130 or more, and monsters went from taking two to three swings of the blade to roughly ten. It requires a major shift of the mental gearbox to go from traipsing through the baddies with barely a care in the world to carefully aggro-ing one at a time, leading it away to a quiet spot in the room to engage in a multi-hit duel of swing and avoid before calling out the next monster for more of the same. By the time I was done the dungeon I was back to taking 30-40 points per hit, with enemies again being dispatched by two or three hits. Every new dungeon sees this dramatic rise in effectiveness, and while its a bit exaggerated theres no denying that raining doom on the formerly-deadly beasts that had been making life difficult is far more fun than it should be. One dungeon leads to another, often connecting in surprising and very helpful ways, with new items and abilities dropping by at a good rate, and the occasional boss fight keeps you on your toes. The basic game is a great action/RPG with just enough puzzles and story to keep it from being a mindless bash-fest. The only real problems, in fact, are the volume of bugs and how utterly terrible the gamepad support is. Xanadu Next was initially designed mouse-only, and while moment-to-moment gameplay works perfectly fine, it all falls apart when you need to access the inventory. In order to switch out a spell in the middle of battle (for the times when your elemental choice starts working against you) youll need to hit the Y button to open the menu then drop to the mouse to switch things out. The menu opens in the right third of the screen, and the action doesnt pause while the menu is open. You cant, of course, run around and use the mouse at the same time, but maybe its nice to have an emergency exit from the menu? Or maybe its just a clunky, inconvenient system.Other bugs and issues are common as well. The in-game options menu doesnt actually have any graphics settings, so youll need to set them in a pre-game menu that I have to admit I didnt notice for the first couple hours of play. 30FPS at a 640480 resolution didnt make for a particularly attractive gaming experience. Bumping it up to my monitors native resolution, on the other hand, revealed a problem with the Storage menu, where the arrows for banking money back at the hotel room dont line up with their on-screen position. Seeing as you lose half your non-banked gold on death thats a bit of a problem, although the arrows for the money transfer light up when it thinks the mouse is over them so you can fake it. Other problems involve getting rooted to the ground after finishing up a conversation, unable to move until you talk to the villager and get the exact same text again, and enemies that sometimes spaz out when trying to track you. Somehow Xanadu Next manages to feel like a terrible PC port despite having originally been a PC game. Closing Comments:While Xanadu Next is buggy and its menus just plain busted for controller use, the rest of the game is a wonderful trip through a classic JRPG world. The story starts small and the area to explore is a single island, but clever use of interconnecting dungeons makes it feel much larger. The entire quest is easily twenty or more hours long and that doesnt even include chasing after the bonus dungeon. The combat is lively, enemies plentiful and puzzles show up frequently enough to keep you on your toes. Special consideration has to go to the soundtrack as well, which is easily one of the years best. Xanadu Next never had a chance to find an audience outside of Japanese PC gamers and the N-Gage user base way back in 2005, but it deserved far better. Its a little jagged around the edges and could use a pile of patches, but every issue has a simple workaround, leaving the heart of the game to shine as an action-RPG classic thats no longer lost in an obscure corner of gaming history.", "date": "November 28, 2016", "grade": 4.0}