{"name": "Steins;Gate 0", "ref": "https://hardcoregamer.com/?post_type=post&p=236575", "text": "The exponentially-increasing output of visual novels in todays digital-strong market shows that the genre has seen an almighty surge in recent years. To those already clued up and know, relatively speaking, what theyre getting themselves into, this poses itself as a wealth of content to invest ones time over. For anyone outside of the bubble though  specifically those who have never dared to even dip their toe into the vast ocean the genre has now become based purely on output  this is less a case of substance and more a case of quality. Like all genres, visual novels are just as guilty for confining to self-made standards as they are genuinely trying out new ideas and focusing on entirely new themesto mixed results.Once in a while theres a crossing of paths between long-serving followers and curious [if cautious] newcomers that satisfy both camps in both substance and end result. This has happened only a couple of occasions for myself, the example-newcomer to all this. Saya no Uta being one of them and Katawa Shoujo the other more surprising incarnation of that old saying: never judge a book (or a novel) by its cover. Or by the amount of young girls on show. Steins;Gate in June of 2015 (which was then the PS3 ports release period) is the third of these notable inclusions in an ever-growing list of games with grand misconceptions blown to irrelevantly tiny pieces by a narrative both interesting to explore and effective in its delivery.November 2016 sees a direct follow-up and true sequel (as the developers refer to it) to the last of these notable examples with Steins;Gate 0. Direct in every sense of the word, it sees players/readers pick up (prologue aside) only a few months after the closing moments of the originals ending. Or at least one of them; an importance to take not of, 0 makes it canon that main protagonist Rintaro Okabe was unsuccessful at saving fellow lead Kurisu Makise from dying and the opening moments deliver quite the conflicting, though effective, shift between Okabes loss and his salvation via the events quick unfolding in the early periods. The main one being that Kurisu now exists, in the very broadest sense, as an AI avatar in an experimental program dubbed Amadeus. Best/worst of all, Okabe now has access to this AI version, referred to in-game as Amadeus Kurisu, at any time of the day  itself translating across into gameplay terms, allowing the player to contact Kurisu at any point upon acquisition. Similar to the previous games, players can communicate with other characters via text upon receiving notifications during the tale. Picking from a list of options to start will lock the conversation down a certain path until the contact ceases and the player can resume the main games tale. And like its predecessor, 0 shows little (if any) hesitation at tackling less-than-traditional themes during the main story  be it emerging fields of science, time-travel, the relevance of AI and all the moral debate that comes with it  alongside the more traditional that is love, friendship and consequence.From the off, 0 plunges players straight into the meat of its main subject matter without little build-up yet does so in a way that doesnt complicate or otherwise confuse readers. Thereafter, Steins; Gate 0 shifts between character relations (the bulk of the gameplay landing in Okabes lap) and fleshing out the series wider lore of an impending war (the not-so-lavishly titled World War Three, set to cripple all corners of the globe in the mid-21st century) and while some character-based scenes can generate a smile, more often than not its Okabes struggle with communicating with an artificial replica of his former love interest that will carry most of the players attention through. More deservedly the attention to detail put in the characters profile this time round  clear signs of mental fatigue a welcome visual touch to his now-drained, traumatised personality. As will the ocassional flash-backs and even flash-forwards to a war-ravaged Earth in the future and the events, technically, preceding the entire series as a whole  of which, like many of 0s notably dramatic scenes, are provided with their own visual backdrops and artwork. Alongside contextual profiles for certain characters in particular situations  as opposed to simply having one or two standard static poses save for the moving of a mouth during speech  0 makes a notable effort to make the potentially laborious act of reading through endless passages of text feel a little more engaging. Theres no denying that the [now] series staple visual aesthetic, with its watercolor-esque backdrops and vibrant nightlife visuals, help breathe life into the more outdoor scenes. Though there are some ocassional mishaps that do break the immersion: stills of people looking less like genuine members of the general population and more like separate layers slapped onto the imagery, as well as the odd misspelling and, even odder, misplacement of terminology with certain words (the game offers a helpful glossary of terms which players can look up at any time during the story). But for the most part, scenery and environments vary enough to make the story feel as its naturally progressing.Even still, some of the original charm and tension in scale seems to have waned in the follow-up here and while the sudden shift in tone at points does keep players on a bit of an edge as to what potentially could be around the corner, a lot of what comes from character-orientated scenes  particularly when offering up exposition or fleshing out relationships  feels a little too padded out and at points reliant on classic Japanese cliches and tropes to give the illusion of complexity. As noted, Okabes later conversations  especially with Amadeus  are probably the highlight of all of 0s dialogue and offer an interesting light on a characters rise from initial despair into accepting whats required of him. And due in part to the games overall back-and-forth between light-hearted (if bordering on safe) use of secondary characters and the main characters internal struggles, the overall deliverance of the story comes off sufficiently balanced, albeit not quite having the same impact as the previous title. Closing Comments:Fans will be satisfied with how the tale running through Steins;Gate 0 is told with a narrative that rarely stands still in the present without coming off confusing. That said, the originals degree of tension and regret over gameplay decisions are lost a little here and because of it, 0  despite its successful transitioning, coming off more like a second half to a much grander tale as opposed to a totally sectioned-off story  often finds comfort in retreating to old techniques and former narrative inclusions to fill in the rare instances of figurative gaps. Even still, those who grew to empathize and connect with the main characters struggles will find plenty of emotional tribulation here and as a result, Steins;Gate 0 can still confidently call the interesting fusion of scientific and romantic storytelling its own.", "date": "November 22, 2016", "grade": 3.5}