{"name": "ENIGMA:", "ref": "https://hardcoregamer.com/?post_type=post&p=236395", "text": "Steam is filled to the brim with visual novels and many of them are tailored to attract a certain type of reader (i.e., people looking to get a good dose of fanservice). Games without such obvious intentions are often cast to the wayside and left for more devoted genre fans to uncover. If you consider yourself a member of the latter category then its time to take a look at ENIGMA: by Uzumeya. The story begins in an unlikely, but immediately gripping, way, with townsfolk whispering about the death of one young man and the terminal illness of another. Chester is that man and he has just around a month left to live.Despite being surrounded by uncaring gossipers, Chester is mostly at peace with the reality of his impending death due to the mysterious disease known as Enigma. Things take a turn for the strange when he wakes up one day after having washed up on the shore of a small island. Carlyle is such a tiny island that hes never heard of it and nearly all of its population have never explored beyond its shores. Fortunately for Chester, he is immediately saved and befriended by Colette. This young woman lives with her brother in a charming cabin and seems more than willing to assist a total stranger. Her brother Lauro, on the other hand, wants nothing to do with aiding a strange man within the confines of their own home. Its a sensible concern, but one that Chester manages to overcome due to his incredibly friendly personality. Of course, not even this serene atmosphere will spontaneously cure Chester of his ailment. Because the disease does not make itself visually apparent, however, no one knows right off the bat that their new friend is about to die. That is, except for the town herbalist Greta. Not only does she immediately know Chesters dying, she also introduces him to a forest filled with white trees on the island. For as long as she can remember the townsfolk have referred to that forest as Enigma and believe that it gains sustenance from death. Thus begins an even greater mystery. How is it that these two totally distinct locations are experiencing something they call Enigma and what does this mean for everyone? This connection is to be uncovered throughout the multifaceted, emotional storyline of ENIGMA:.Aside from this overarching mystery, there is a ton of attention given to developing our main cast. With multiple endings for three characters youll truly start to get a feel for folks like Lauro who initially have one note personalities. Chester in and of himself is a great protagonist. Most games would probably play him as a very desperate guy looking for any chance of survival. Instead, Chester actually seems completely content with his truncated lifespan. He jokes around with others and may just be the most cheerful character of them all. Of course, thats not to say making peace with death has turned him into a complete comedian, as he certainly shows a nuanced personality at times. Visual novel players are likely accustomed to going through a game multiple times in order to get a true ending. ENIGMA: is one such title which features nineteen different endings. That might sound like a tremendous amount, but completing the game is actually far from unattainable. This is possible because each run through takes a maximum of two hours (often much less). In total, completing the game takes anywhere from around ten to twenty hours depending on your reading speed. Fortunately, a skip feature is included to allow incredibly abbreviated replays just to get to different endings. In an odd misstep, there is no slider for speed of auto text. Instead you can choose from a few preset speeds, none of which are likely ideal for anyone.Different paths open up organically in ENIGMA: which may confuse some people initially. For example, playing through the game fresh only offers a few choices throughout the route. After completing them all it may seem that theres absolutely no way to get any other ending. However, at this point you must then restart entirely (rather than loading from a save point) and choose a new option which appears at the very beginning. Then, after making the same choices as prior playthroughs, a new route opens up. Youll want to keep notes on what choices youve made per route as otherwise you might waste time redoing the same one. The routing may confuse or annoy some, but there is a guide available online if you absolutely dont want to risk any repetition. With that said, players should absolutely aim to acquire every ending. Aside from the on point writing, players will also collect a treasure trove of CG artwork. Some is adorable while other visuals are honestly creepy. Even so, the artwork throughout ENIGMA: is of impeccable quality. The same holds true for the soundtrack, which is equal parts melancholic, enigmatic, and dramatic. All purchases of the game (via Steam and MangaGamer) include a mini soundtrack. This only includes the opening and closing songs, but is still a nice free addition to the package.Closing Comments:ENIGMA: is a surprising visual novel in how well it brings together humor, mystery and drama. It takes skillful writing to make this work as well as it does here. The strong cast of characters, unique concept and setting ensure that it doesnt feel like something weve ever read before. Each path proves interesting in its own way and makes a complete playthrough seriously worthwhile. The only problem with this is that some players may find themselves confused or temporarily stuck on their path to completion. Fortunately, the true end is worth the effort so please seek it out if you give ENIGMA: a try.", "date": "November 21, 2016", "grade": 4.0}