{"name": "Killing Floor 2", "ref": "https://hardcoregamer.com/?post_type=post&p=236161", "text": "The success of the original Killing Floor is one of those stories that brings hope to the industry as a whole. Starting off as a humble mod for Unreal Tournament 2004, it saw a full release as a stand alone product in 2009, earning accolades and a legion of fans. The cooperative multiplayer focus was balanced in a way that even the most unskilled player can contribute something to teams success, even if its just acting as a monster magnet, allowing other teammates some much needed breathing room. Developer Tripwire Interactive knows that they have a good thing going and have been hard at work on creating a worthy follow up. With Killing Floor 2, they have succeeded.Taking place across myriad maps in Europe, the plot, such as it is, centers around a monster outbreak unleashed by some dinguses at a corporation known as Horzine. The scientists there thought that the continent needed more red in its palette, and this was probably the easiest way to do it. It didnt take long for the infestation of the creatures, known collectively as the Zed, to spread. Now, it is up to a handful of survivors to cull the swarm and survive. Certainly not the most original plot. Good thing it doesnt matter. The actual gameplay breaks down into mowing down waves of Zed across huge maps. Intended to be played in groups, players start a match predesignating the amount of waves to fight, and get to work. Between each wave, players run to a supply point, purchase ammo, armor, and weapon upgrades, and work together by setting up choke points by closing and welding doors shut. The timer counts down to zero, and its time to tackle the next wave.Were it just this alone, the Horde Mode type gameplay would wear thin. What keeps the game fresh is found in the classes. Designated Perks, there are ten different classes that a player may select before going into battle. Each one feels entirely unique, requiring different strategies to effectively use. For example, the Commando Perk is excellent at taking down weaker Zed. Using automatic weapons, its a simple matter to pop off head shots, or just lay indiscriminate fire into an oncoming swarm. The bigger Zed types, like the hulking Flesh Pounder, tends to stymie a Commando as his rifles are relatively weak. There are other benefits to the commando class, such as the ability to mark invisible Zed, allowing everyone else on the team in range to see them, too. Each of the Perks have benefits and drawbacks like this, making for a unique game of push and pull. A sense of progress is introduced to each class, too. Every perk levels up independently from using their talents and weapons. So, taking the Firebug perk into the field, the player will earn Firebug experience points when burning down a Zed with a caulk gun styled flamethrower. However, that same Firebug can earn XP for other classes. Sealing doors earns Support XP and using a found RPG earns points for the Demolitionist. This is really useful as each level increases the usability of the Perk, adding extra damage or decreasing reload time. This isnt factoring the extra bonuses awarded every five levels. Using the Commando as an example again, once the player reaches level five, they can select between a larger magazine capacity or reduced reload. The choice is never locked.While the overall mechanics are in place, they wouldnt mean a thing if the actual feel of the gameplay wasnt up to snuff. Tripwire managed to nail this, too. Playing with many different Perks (and obviously finding the Commando to be an early favorite), I have yet to find a weapon that wasnt fun to fire. Each firearm feels like a force of nature being unleashed, including the weapons of last resort, like a pistol or a knife. Truly, Tripwire allows each player to feel as though they are cutting their own unique swath of destruction while still working as a group to succeed as a whole. Part of the empowerment is the triggering of Zed-Time. After landing a headshot, there is a chance that a brief slow motion mode will occur, allowing players a better look at the dynamic gore and take out more Zed in rapid succession. The bonus works for the whole team, so if somebody is playing Rambo across the map and triggers it, everyone else will also get the benefit. These periods also highlight just how danged good the game looks. Each of the enemy classes show a disturbing level of detail. Take the stupid Flesh Pounder from earlier. Where the machine meet the biological is rendered in disgusting detail. The crisping of a burning monsters skin convinces to a revolting degree. Tripwire has taken the Unreal Engine and done things that wouldnt have seemed possible previously. Anyone who enjoys a good splatter flick will find themselves in a twisted version of heaven here. Especially as the viscera that is spilled will remain there for the entire match.Even with all of the many, many maps to be found here, the gameplay could get stale over time. This possibility was counteracted while the difficulty system. While the Zed do see the expected hitpoint and damage buff when jumping up the difficulty ladder, they are also bolstered in a much more intriguing way: they get smarter. On harder difficulties, enemies use their skills more effectively, and a more prone to stalking and boxing in a stupid player attempting to go rouge. A screamer might use her shriek whenever possible on normal mode. Take the difficulty to Hell On Earth, and she might instead wait for a grenade to be thrown, using her scream to diffuse it, or use the level design to sneak up on the player temporarily disable them. They are also more efficient about dodging. The increased intelligence makes it so that no match feels the same. There is also an adversarial multiplayer mode, where players can control Zed and attack a team of humans. Unfortunately, I was not able to find a match for this during the pre-release press period. Whether or not its good or bad wouldnt really affect my score, though, as the PvE works so danged well.The cosmetic item marketplace should be briefly discussed. In short, players will find weapon skins and wearable items during matches. This can be used or broken down into crafting materials to create new items. There is a microtransaction storefront for this stuff, too. Normally, I would be vehemently opposed to this and pitching a fit. In this case, I am not. Tripwire is releasing a deep, gorgeous, AAA level game at a reduced full asking. This is before even bringing sales to the mix. If a company wants to put this level of care into a title, and then reduce the expected asking price in exchange for including a marketplace for cosmetics, I can deal. It seems like a fair enough compromise. I will never use it, but I will also not fault Tripwire for trying to find a happy medium between what is profitable for companies and fair to players.In the interest of being meticulous, there are a couple of small items to point out. For one, Killing Floor 2 is a multiplayer game. Anyone not playing with a team will find the gameplay tiresome n short order. A huge appeal to this game is using the differing Perks together to create a frenzy of flying flesh. Also, there are numerous characters to select, and each can use any perk. While the perks are memorable, the characters themselves are not. Theres gasmask guy, the dude in chainmail, a biker (I think), and hmm. For a game that puts so much emphasis on customizing the look of the player character, it would have been nice if there were more variety. I fully expect to see tons of the gasmask dude during future play, as he is the one legitimately interesting player character design. Closing Comments:The best indicator that this game has legs can be shown through this (admittedly) anecdotal evidence: when playing Killing Floor 2 online outside of the designated review meet up times on the PlayStation 4, I was still able to find a game with other players. A title that hasnt seen public release (for that platform) still had their servers filled with people who had already been playing the game to death. And I was with them, also wanting more. This illustrates the grotesque pull that Tripwires labor of love has in spades. Killing Floor 2 is dangerously habit forming. There is always something new to level up, some new difficulty to master, a new way to mess up the piles of biomechanical flesh. Whether with a pick up game or a group of friends, Killing Floor 2 mainlines cathartic bliss.", "date": "Bohn on November 18, 2016", "grade": 4.5}