{"name": "Destroy All Humans! (PS4)", "ref": "https://hardcoregamer.com/?post_type=post&p=234708", "text": "High definition remasters are nothing new and 2016 has continued to bring the HD makeover treatment to numerous games. Games like Modern Warfare and Skyrim were immensely popular in their heyday so seeing some AAA titles get a fresh polishing and reissue should almost be expected. Lesser known titles do not receive this treatment as often, though the PlayStation 2 and earlier games would be the ones where the improvement is most noticeable. Destroy All Humans! is one such title to receive this treatment. No one knows more about HD remasters than I do, and this is definitely an HD remaster. Believe me, believe me. While its success elevated it well outside the shadows of obscurity, it also never attained blockbuster status, which could partly be attributed to its launching in 2005 just a few months shy of the highly anticipated next-gen console known as the Xbox 360.Destroy All Humans! centers around an alien invasion from the Furon Empire, and if the title doesnt make this clear enough these little grey men do not have the friendliest of intentions when they visit our planet. The two aliens on the mothership that are causing problems for Earth are Orthopox (aka Pox) and Cryptosporidium-137 (aka Crypto, aka Cryptosporidium-(137+number of player deaths)), the latter being the player controlled alien. The invasion takes place in a fictional version of America in the 1950s, which is a convenient setting since the government and media can blame Cryptos wake of destruction on communism while denying the extraterrestrial invasion. The mission objectives expand as the story progresses, but initially Crypto wants to rescue Cryptosporidium-136 from captivity in Area 42 while Pox wants to harvest enough brains to stock a zombie buffet due to the fact human brains contain Furon DNA in its pure form.Crypto begins his adventures on Earth in a farm where he attempts to ascertain what the dominate life form is. He figures out it is the humans on his second guess, though in his defense the grazing cows do have a certain air of authority about them. During this initial stage is where we have to suffer through the standard tutorial, which consists of dialog windows abruptly interrupting Poxs attempts at explaining the very topic of said dialog boxes. Tutorials must not have been as streamlined back in the era when this was originally released. The good news is the tutorial section is not terribly long, and once we get on the other side of it the more action oriented parts are actually quite fun. The story progresses through mission completion, which are assigned by Pox on the mothership but the player is free to revisit earlier areas to collect items or just go on a random killing spree. The campaign is very linear in structure but there is the freedom to ignore the main objectives to engage in minigames or go on a rampage. Though Destroy All Humans! is much smaller in scope there is an obvious Grand Theft Auto influence, so much I could try to be witty and call this game Grand Theft Alien but I have a feeling I am a decade too late in making that joke. In addition to the freedom to roam the open world causing mayhem, the more trouble Crypto causes will trigger this titles version of a wanted meter, drawing attention from law enforcement, the military, and ultimately a government entity known as Majestic.Most of the fun comes from the variety of ways Crypto can bring about destruction to our civilization. He has a few different weapons that unlock as the game advances such as an ion bomb, but at the beginning he is only equipped with a zapper that electrocutes people and a standard issue alien anal probe that somehow can cause its victims head to explode for easy access for brain harvesting. How a fully charged anal probe can lead to a head exploding doesnt make a whole lot of sense unless the individual suffers from a form of rectal cranial inversion syndrome, in which case this attack being effective against in game politicians makes perfect sense. Being an alien gives Crypto another weapon, which would be his saucers death ray and abduction rays. The abduction ray can pull a person off the ground and if you have a sadistic streak it can be fun to fly around flinging the human about. The death ray is what the name implies, this can be useful for taking out vehicles and buildings. The saucers weaponry is called upon for certain missions, but also for minigames where the objective is to destroy as many buildings as possible in a time limit. The Furon are an advanced race, so in addition to better weapons Crypto has some augmented mental capabilities that grant him special powers. There is a stealth element in Destroy All Humans! that requires Crypto to use the holobob, which is where he can project a hologram of a person over himself as a disguise. The stealth aspect is not all that developed, its simply a matter of don the disguise and run away from people who saw him assume the disguise. The more fun abilities allow Crypto to read peoples minds, put them to sleep, or throw them at another person. In the levels that take place in a farm setting, Cryptos psychokinectic powers allow him to take cow tipping to the next level.Overall Destroy All Humans! is a fun game but it is not without its issues. This is most likely a symptom of its time, but there are no check points in missions, so if you get to the last step of a level and fail you need to return to the mothership and start the whole thing over again. The biggest challenge from the mission is usually not based on the games difficulty but more so from the game not being clear as to what exactly Crypto needs to do. One mission requires an agent to be hypnotized and taken to the saucer for questioning. Hypnotism only gets him so far, and after a while I gave up on trying to beat the mission the way it was advised and just used the psychokinectic powers to carry him where he needed to go. There was another mission that required so many things be bent within a time limit, and the hardest part about that was figuring out what button opens up the bend option. None of these unclear objectives are too taxing to figure out, but clearer direction would not have hurt. Destroy All Humans! is very light in tone, and uses humor to underscore much of the destruction and violence contained within. The world is presented in a very wholesome Leave it to Beaver manner peppered with other references to the 50s. Communism and its inherit unAmerican ways are a common topic of conversation in the game and often used as the cover up for whatever mayhem Crypto is causing. Crypto himself is an amusing protagonist, though I have not seen anyone try to emulate Jack Nicholson this hard since Christian Slater.Upon booting up Destroy All Humans!, the old PlayStation 2 logo appears on the screen, with the intro cinematic presented in glorious SD resolution and the classic 4:3 aspect ratio, just in case there is any doubt that you are playing an eleven year old game. After we get past this, we see that the update for the rest of the game has switched to this newfangled 16:9 aspect ratio and that this game really did receive the HD remastering treatment. The remastering actually does look nice; the character models show their age, but the upscaled resolution smooths everything out, making this look much better than if one were to play the original PlayStation 2 version. Closing Comments:Destroy All Humans! shows its age under the coat of HD makeup, but still holds up well. Some of the missions suffer from lack of direction or being too repetitive, but I would be lying if I said blowing up tanks and burning down buildings wasnt enjoyable. This is not the deepest GTA-inspired game on the market, but its sense of humor and simple but fun game mechanics make it a worthwhile title, especially for those seeking a title filled with unlimited potential for wanton destruction and carnage. There are quite a few good ideas here and if they were fleshed out some more this could have been something truly exceptional. As a remastered title, this will remind players of how fun a lot of games on the PlayStation 2 were, but it will also put into perspective how far games have come since that era.", "date": "November 9, 2016", "grade": 3.5}