{"name": "Memorys Dogma CODE:01", "ref": "https://hardcoregamer.com/?post_type=post&p=234743", "text": "Sekai Project is a visual novel publisher known for bringing tons of visual novels to English-speaking audiences. Some of these games have only been possible due to Kickstarter. Last year, they launched a crowdfunding campaign for Memorys Dogma by Liz-Arts and ended up with nearly $90,000 in funding for development. Eventually the choice was made to break the game up into episodic pieces as a means to get people invested in the world without having to wait even longer for the full visual novel. Memorys Dogma CODE:01 is out now and provides a look into the sci-fi world which Liz-Arts conjured up. The story begins on a surprisingly dark note. Were introduced to protagonist Hiroki as he wakes up in a hospital bed. The cause for his stay? Hiroki had attempted suicide as a result of his close friend Sorano dying earlier in the month. According to reports, she herself committed suicide leaving everyone in her life distraught. Hiroki and his other friend, Kakeru, arent so sure that she would actually do that  and suspect that something else may have caused her untimely death. Fortunately, in this futuristic version of Japan, theres actually a way to still talk to Sorano. Theres a place known as the Connect Center which temporarily stores peoples memories after they have died. These memories, along with advanced algorithms, allow grieving friends and family to talk to the recently deceased person as if they were still alive.Hiroki and Kakeru set off to the Center with plans of more than simply seeing their friend one last time. Thanks to his highly specialized technical knowledge, Kakeru decides to snag a copy of Soranos memory bank and take it home. Of course, the security of the Connect Center arent happy about this and take steps to catch the duo. Thus begins a highly dramatic  and sometimes fantastical  tale in the lives of these young friends. Memorys Dogma CODE:01 is certainly not the first game to toy with these types of themes, but it veers into some fantasy elements on the way, which may disappoint hard sci-fi fans. On the other hand, players just looking for a new visual novel may enjoy the ride regardless.Its important to acknowledge where much of that Kickstarter money likely went. Memorys Dogma CODE:01 has complete voice acting from known names in the Japanese anime industry. This is readily apparent  the voices are both of high quality and provide excellent, emotive performances. This is incredibly important given that the storyline is chock full of dramatic experiences. The artwork also works well, with clean sprites and attractive backdrops. CGs are fairly common and add the extra excitement needed to scenes. With that said, Liz-Arts didnt go quite so far as to create animated sprites or anything like that. Throughout the storyline players are presented with about a dozen choices. Most of these choices are actually meaningless in that they do not push you down one path or another. However, there are about five choices which result in players either staying on the path or falling off into a bad ending. Fortunately, a bad end isnt a huge deal as the game will rewind back to a state right before the fateful wrong choice. As such, you dont have to obsessively keep saving (as its impossible to save once a choice pops up).Despite being an episodic release, Memorys Dogma CODE:01 ends in a way that actually could be believed as a closing point to the entire story. Sure, there are a lot of questions left unanswered and theres still a call to action for our protagonists. However, it does not leave readers hanging on a cruel cliffhanger ending. Playing through takes around seven to ten hours depending on reading speed. Since there are not multiple paths to explore there is also little reason to replay the game either. The only time that might make sense is if CODE:02 takes years to release, in which case catching up on the original story would be sensible. The thing about the story is that it spends so much time moving from one dramatic event to another that we barely get to learn about the characters. Were supposed to care about Hiroki, Kakeru, Sorano, and others, but never get real reasons to do so. Basically players are meant to emphasize with Hiroki and understand his ridiculous actions without ever learning much of anything about these supposedly tight-knit friends. There are a few times characters recollect better times, but theyre very small in between deadly circumstances. The storyline, despite a few plot holes, provides an interesting ride  but its missing a dose of humanity.Closing Comments: Memorys Dogma CODE:01 provides an intriguing start to an episodic visual novel. Unlike others, it also provides a rather meaty look at the world rather than just an hour long glimpse. The only problem is that the story its telling depends completely on players caring about the characters and their plight. With the lack of focus on developing the protagonists as actual people, theres a disconnect between the games highly-charged scenes and failure to endear the cast to players. Hopefully well see increased focus on characters and their relationships in the next chapter as thats what needed to turn an average visual novel tale into something special.", "date": "November 9, 2016", "grade": 3.0}