{"name": "Kings Quest Chapter 5: The Good Knight", "ref": "https://hardcoregamer.com/?post_type=post&p=232883", "text": "The reintroduction to Sierras classic Kings Quest has been one fraught with a strange mix of quality. From entries that nailed every point to ones that felt like a slog, there simply wasnt a consistent standard when it came to the gameplay. Fortunately, the story always managed to pay off with humor and some truly touching, even depressing, moments. The time from the first chapter, A Knight to Remember, to now with The Good Knight has been long indeed. One could argue too long to do an episodic series justice and keep the emotional tenor fresh in mind before continuing the tales of King Graham. The delay was, of course, due to the small team at developer The Odd Gentlemen. Still, even though it couldnt be helped, it undercut the heft of the overarching story moments. Fortunately, they got the timing right for the last chapter. Not long after the gut punch of a closer from Snow Place Like Home, the cap to the series has been released and the game is so much the better for it.This final chapter centers around old King Graham as he tells the tale of his last adventure. Feeling listless and and useless as time goes on, he dons his feathered cap to take one last jaunt into the unknown, despite the protestations of his loving wife, Valanice. The timing turns out to be fortuitous as one final evil must be defeated with wit and bravery for Daventry to be truly safe for generations to come. The issues come in with Grahams ability to even tell the tale, as he seems to be having issues with relaying the story to his granddaughter, Gwendolyn.The latter actually becomes a clever theme to the puzzles. While the last chapter focused on bog standard line and switch puzzles, the unreliable narrative conceit serves as a unique way to challenge a players mind. To give an early example, a fire must be extinguished. To get the tools to do so, the player explores the country side, coming across the meeting spot of the bridge trolls from the first chapter. Graham tries to remember what was built there since. To solve the puzzle, the player must first remember that it was a sandbox, and pick up a bucket. After, leave the area and return, only to try to remember again. Recall that its a fountain, and the bucket can be filled. Various puzzles that take poor memory into account permeate this episode, and the unique mechanic makes the solving more interesting. (Though, it must be admitted that a couple seem to rely on random wandering to luck into what the designers had in mind.) Editors Note: As a word of warning, please skip to the closing comments if you are not caught up through chapter four. As with the prior entries in this reboot, the puzzles tend to serve as the gameplay element gluing together what really makes the entire endeavor worthwhile: the story. The previous episode closed with the (expected) revelation that King Graham was on his death bed. The Good Knight doesnt shy away from this. There are no Hail Marys. No deus ex machina nor magical elixir to solve this. This chapter fully embraces this, and in doing so, explores facets of impending death both for the afflicted and their loved ones. For the most part, this is done in an elegant and mature fashion, save for one ill advised prat fall that wildly missed the mark. Giving players this tone for the finale does force some introspection. The target audience for this type of game, those who have played the original, are aging. One or more parents or grandparents are likely to have passed on, and often times emotions can linger. The story in The Good Knight provides a proper outlet for dealing with some of this.Ample credit for selling the tale, of course, goes to Christopher Lloyd as Old Graham. He captures the character with much grace and heart, helping sell moments that might seem overly sappy. He has been a boon to the entire series, and is worth every cent that was paid. However, the true star of the show is one that went unrecognized by this reviewer up until this chapter: Maggie Elizabeth Jones as Grahams granddaughter, Gwendolyn. This relative unknown actor brought to life a young girl entranced with her grandfather and his tales of heroism. The way this young lady handles her idols impending demise sells the story better than many high profile actors could have done. She is the person who holds the entire bittersweet conclusion together. Closing Comments:As one who appreciates the value of avoiding spoilers, writing this review was difficult. There are many aspects to this final chapter that I really want to talk about, but feel that it would ruin the experience for players just trying to find out if they should deal with the series close. The short answer is yes. For those who have been waiting until all the entries have been released before deciding if its worth picking up, please know that the Kings Quest reboot is absolutely worth the time. It has its peaks and valleys, but the art, voice acting and tales of daring have coalesced into a strong overall package. While Chapter 3: Once Upon a Climb is my personal favorite out of this bunch, the closer might actually be the objective best, wrapping everything up in a bittersweet fashion.", "date": "Bohn on October 30, 2016", "grade": 4.0}