{"name": "Exiles End", "ref": "https://hardcoregamer.com/?post_type=post&p=232703", "text": "The sky is blue on a day with clear weather. Water is an essential component of human life. The sun will expand and engulf the Earth in give or take five billion years, ending all life on Earth provided we dont do that to ourselves before then. Video games in the early 90s looked and played different than their modern counterparts. Now that we have some obvious facts out on the table, lets examine that last one while we take a gander at Exiles End, an adventure game that does such a fine job of paying homage to PC adventure games of that era of gaming one would swear it was a recently unearthed relic from the Mesozoic era, with carbon dating likely to indicate 1991.Exiles End seems like a Metroidvania and does share similarities with that subgenre but it shows more influence from old adventure games like Another World and Flashback. Everything about the production Exiles End goes to great lengths to emulate PC games of 25 years ago, from the graphics to the soundtrack to the game mechanics. The game begins with cutscenes of a crew on some ship with dialog text explaining that a lot of the crew are not happy that Jameson (the played character) is on the crew because of some blunder he made. Something goes wrong that leads to everyone abandoning ship via escape pod, and we gain control of an unarmed Jameson whose suit is in need of getting powered up again.This begins the exploration of this two dimensional planet. Jameson is unarmed so he is defenseless against the hostile creatures that look like giant worms, and without his suit being powered up falling from a high altitude can hurt or kill him. This helpless way of beginning is an interesting story device, since being defenseless after being marooned on an alien world after crash landing an escape makes a lot more sense than walking out of the crash guns blazing. There is a minimap that can help with navigation, but since this is an unknown world and Jameson is separated from his crew there is no direction given on where the player is supposed to go. There are branching paths but finding the right way to go is never too difficult. Oftentimes the area you need to travel to is the only one that is accessible based on current inventory, or in some cases an area that is not supposed to be explored yet is accessible but it is very dangerous. For example, if you find an area that has a lot of mean dudes with guns shooting at Jameson and you have not found a weapon for yourself, you are probably not supposed to be there. Typically the ability you acquire will give you an idea of where you are supposed to go, whether it be repairing the shock absorbers or acquiring the double jump mechanism.The gameplay of Exiles End is a balance between exploration, platforming, puzzle solving, and combat. It takes a while before Jameson has any means to defend himself so he needs to survive by dodging or tricking creatures and people that want to harm him. It is fun to eventually get to kill your enemies, but that approach is not always the most realistic option. Tricking them is sometimes the safer option, and it can be almost as fun.Exiles End is pretty forgiving when it comes to respawn points, allowing the player to continue at the beginning of whatever screen they died on. The flipside is that it is not forgiving when it comes to health. First aid kits are rare and only one can be equipped at a time and random health restoration drops from enemies are uncommon. Whatever state your life bar was in when you died is exactly where it will be after the respawn, so if you are down to being one hit away from death expect to be there for a while. Remember this game is old school, and old school does not forgive easily. As stated above, this is a very faithful homage to adventure games of the early 90s, which means taking the good with the bad. The 16-bit graphics, lack of voice acting, and soundtrack MIDI sound exactly like something from that era of gaming. Questionable hit detection and control responsiveness are also exactly how they were in most of these games, where some jumps require exact positioning or being damaged by a stationary enemy because Jamesons foot grazes the end of its tail are things that occur. Depending on your mindset this can be a good thing, because it does add authenticity to its recreation of this era of gaming without putting on a rose tinted filter.Part of why Exiles End succeeds at recreating the feel of retro games is they brought on veterans from this era to work on it. The score was composed by Keiji Yamagishi, whose resume includes the NES Ninja Gaiden, Tecmo Bowl, and Captain Tsubasa. The initial impression I had when the first areas music kicked in was this sounds like a perfect mix of an 80s sci fi flick mixed with a harder industrial edge, which not only fit the environment perfectly but sounded good in its own right. The art was created by staff who worked on Secret of Mana, First Kiss Story, and Mother 3. The cutscenes, which are reminiscent of the NES Ninja Gaiden trilogy were created by OPUS. To clarify, this is the OPUS we would associate with Half Minute Hero and not the penguin from Bloom County. Closing Comments:Exiles End is so successful at being old school that you could probably convince someone this really is from 1992. Other throwback games like Shovel Knight or Axiom Verge add modern elements to their recreation of the late 80s and early 90s, but Exiles End is true to era to its core. For hardcore fans of games like Out of This World, this is a must play title, as well as for those who love adventure games from that era. For everything Exiles End gets right about why adventure games from 25 years ago were great, however, it includes all the blemishes exactly as they were. Even though the target audience of this title are people who are nostalgic for the early 90s but want a new game from that era, there is enough good about Exiles End that make it enjoyable beyond just that niche group of gamers.", "date": "October 29, 2016", "grade": 3.5}