{"name": "Diaries of a Spaceport Janitor", "ref": "https://hardcoregamer.com/?post_type=post&p=231822", "text": "Diaries of a Spaceport Janitor isuma janitor simulator? No, not necessarily just that. Look, this is going to be a tough one, because this is one of those games that doesnt exactly lend itself easily to traditional game reviews. Heck, Im still unsure what genre it can truly be classified as or if it even defies genres. So at the very least, I can say that this something unique, with quirkiness also being a major selling point. After all, it is a game based around picking up alien trash. But much like other games about performing seemingly mundane tasks like Papers, Please, theres something weirdly compelling about Diaries, something that kept me coming back again and again. It is indeed an odd potential gem lying underneath a coat of grime.The setup, as the title may have tipped you off to, is that you are a janitor (described as a girlbeast) on a spaceport attempting to earn enough money with their menial job in order to finally move away to a better place. So begins a routine of setting out, finding trash, burning it with an incinerator, playing the lotto, grabbing some food, deciding to sneak into a sewerdungeon and suddenly finding yourself cursed to have a floating skull hover above them while it screams for all of eternity, visit the bank, pray, you know, a standard day for a janitor. But the skull thing is a bit of a bother, so you have to help lead our janitor on a quest to find the slab pieces they needed to help break the curse, searching high and low for what you need in an epic adventureor you can just ignore the skull and keep doing your job. Whatever suits you best.Weirdly, one would almost say that Diaries of a Spaceport Janitor resembles Animal Crossing a bit when it comes to its gameplay. After all, the majority of it does involve traversing the local village (or spaceport, in this case), performing everyday tasks, browsing the market for supplies, and making small talk with the locals, among other things. It is indeed meant to resemble everyday life a bit, to the point where it feels like the game is meant to be played for short bursts on a daily basis (and where it actually earns you an achievement for doing so). One of the things you even have to do before heading to bed each night is fill out a diary entry with happened to you during the in-game day, hence the title. And like Animal Crossing, it really does start to feel nice and relaxing after a bit.Theres also a surprising amount of emphasis on religion, superstition, and luck. The world you inhabit has nine different goddesses to worship, each with their own shrine you can pray to or leave an offering. Each one has their own area of expertise  money, medicine, strength, et cetera  and yet its told that true wealth comes from a worship of all them, yet you also have to make sure that you dont just stick to a routine and pray to the same ones over and over each day, which is frowned upon. Not only does something like this encourage variety and exploration (as some shrines are tucked away), but it does contribute a lot to the games world-building, even down to the designs of the goddesses, which wouldnt be out of place in various mythologies.As mentioned, though, luck plays a big part in things as well, and treating the goddesses kindly results in gaining even more of it (along with avoiding local superstitions like not stepping on spirals, to name an example). This comes in handy not just for finding rare trinkets thrown on the ground and playing the daily lotto (which rewards items of different rarities), but also in navigating the sewerdungeons, another area essential for the story. Here, things oddly switch to a first-person perspective as you navigate a maze while being hunted by a specter, which gets pretty intense, especially seeing as how youre unequipped for such dangerous exploration. But it does help put things into perspective, seeing how youre essentially playing as a bystander in a world where several others are on massive quests instead, as evidenced by some of the humorous descriptions about adventuring attached to items you find. Things just sort of get weirdly deep and introspective after a while.Control-wise, things handle nicely, with camera movement and interactions easy to control. And things move at a leisurely pace, giving you enough time to browse the various markets. While you are paid for picking up trash and incinerating it, with each piece on the ground clearly visible and highlighted as you walk by it, the real name of the game is scouring for rare goods. Each vendor has their wares laid out in full sight, and its up to you to find one who pays top coin for the stuff you find just lurking on the ground. As the old saying goes, one mans trash is another mans treasure, but you also need to balance out work and playing the market, since you dont want to waste any time with a sure thing burning trash by frantically seeing if anyones buying the goblet you found. But again, even if you just want to pick up garbage, thats fine. Whichever strategy you choose for living out your in-game life, the game nicely accommodates it.Visually, in another case of odd comparisons, Diaries of a Spaceport Janitor almost resembles The Amazing World of Gumball, in the way that it nicely blends together such a diverse-looking mix of colorful and odd alien characters with differing styles. They are all rendered as 2D sprites amongst a 3D backdrop, which looks quite impressive in motion. Everything is also joyful and vibrant, with various locales, scenery (giant swords and ziggurats naturally being rather striking), and even the variety of garbage you find really capturing the hustle and bustle of an outdoor market perfectly. Even little details like the items you store away being scattered around your apartment are cute. Mind you, the constant blips and bleeps coming from everyone take some getting used to, since you mistake them for various actions or effects at first, but its balanced out by a terrific and upbeat soundtrack, especially during the weekly festival.That being said, getting used to your home constantly feels like it takes getting used to. Why you arent given a map of any kind to navigate with is a bit of mystery, leading to several moments where you find yourself lost. The best you have are some colored arrows on the ground and previously-mentioned landmarks to help guide the way, but it still doesnt come in handy when having to search for a cheap jam kiosk when in need of food and a gender kiosk when you need to gendershift in order to avoid sickness. The latter is especially notable, because while it attempts to come across as a humorous take on the issues with navigating gender identity in modern society, all it did was make me cuss whenever the screen got distorted and I needed to drop everything and go hunt for a kiosk, which felt spaced out too far (though points are earned back for allowing me to have Susan Sarandon as a gender).Speaking of getting lost, it would help if the world gave you a bit more to do in it. As enjoyable and quirky as every character you come across is, their dialogue is still limited, and it feels like there was a missed opportunity to be able to do more in terms of world-building with it, impressive as the spaceport is. The landmarks and goddesses paint part of a picture, and its a gorgeous part indeed, but the rest is built up through the descriptions of the various trash and trinkets you find. As noted, they are funny, but I would have liked to have more to interact with, especially when the battery in your incinerator runs out and you need more to do for the rest of the day. On that note, though, I could do without world-building in the form of the redscarves mercenaries, who only seem to exist to take a chunk of your credits away whenever you get too close to them. Seriously, screw those guys.Closing Comments:Diaries of a Spaceport Janitor is described as an anti-adventure game, and almost defies any sort of judgement as such, since it feels like it deviates from the norm in more than a few ways. Lord knows if any of the ramblings you just went through can even accurately describe such an experience, if they even scratched the surface. Its a strange, retro-styled beauty that needs to be played to be experienced. And while it may be confusing at first (figuring out the various rules and mythology is mostly done through exploration, for better and for worse), it doesnt take long to get hooked and the end result is a trash-based odyssey of near-psychedelia.", "date": "October 27, 2016", "grade": 4.0}