{"name": "Sid Meiers Civilization VI", "ref": "https://hardcoregamer.com/?post_type=post&p=232448", "text": "Sid Meiers Civilization VI, from Firaxis, is the latest installment in the storied Civilization franchise. The game begins with almost all of the features in Civilization V and adds new concepts and twists on classic elements of the game. The new concepts introduced work extremely well and the twists on classic elements are so well done they make one wonder why things werent always done in this fashion. This game seeks to give new players a jumping on point in the series while providing fans with a new experience and succeeds on both fronts. It draws on the best aspects of the Civilization franchise, refines and explores them in new, frankly superior, ways and produces a complete, well-tested and incredibly fun experience on launch.Civilization VI is, of course, a turn-based 4X (explore, expand, exploit and exterminate) game in a historical setting. For those unfamiliar with the Civilization franchise, the game begins with a settler who can build a city and a guy with a club. As the game progresses, you build more cities, more soldiers and develop technologies that will take you to our current level of technological development. Assuming you are successful, you will take a simple nomadic tribe and turn it into a post-industrial empire with aircraft carriers, nuclear bombs and the ability to reach another planet (though that is where the game ends). You will also meet other civilizations who are trying to expand and develop their empires. You will interact with them, trade with them and go to war with them using the military units you produce in your cities.Civilization VI is not a historical reenactment, more closely resembling Peabodys Improbable History from a Rocky and Bullwinkle cartoon. Despite the marketing which seemed to take itself seriously, this game is all about cartoony fun in a historical setting. You can end up developing your civilization in strange and lopsided ways. This makes possible some great gameplay diversity. The gameplay is also rather smooth, though it can take some time between turns. There are also a lot of little touches which are very useful and neat, like news and intelligence reports which keep you up to date on the progress of the other civilizations and the old map style background instead of grey fog-of-war. In previous Civilization games, I often found myself making extremely detailed plans and carrying them out over long periods of time with the occasional distraction or annoyance from the other civilizations in the game. Civilization VI requires a more reactive playstyle. Instead of long-term plans, the order of the day seems to be immediate reaction and exploitation of opportunities. This is not caused by random events or the like, but simply by the amount of new opportunities I was being presented with. This had a lot to do with the new enhancement to the technology system which rewards you with reduced research times to technologies by completing certain actions. You may have planned to be a peaceful alliance builder, but as you defeat a barbarian attack, military technologies and militaristic civics became a better investment, causing you to move in those directions. I never felt asleep at the wheel just waiting for one progress bar or another to finish so I could move onto the next phase of my plan. While many of the systems are borrowed from previous games in the Civilization franchise, the flavor, experience and style are all its own.Civilization VI, like all proper 4x games, is about systems. These are the crowning jewel of the game. There are lots of systems that are all extremely refined and work well together. While most systems have been refined somewhat, the real highlight has been behavior based technological development and the government system. The diplomacy system has been restored after taking a holiday in the Beyond Earth expansion. The classic system of trade anything for anything, as long as the parties agree, has been restored to good effect. You dont seem to be able to trade technologies, in favor of Research Agreements, presumably for balancing reasons. This is understandable, though tech trading could be more this for that, even if you couldnt immediately develop your civilization by a millennia overnight like in Civ 4. There are still City States which you develop relationships with over time, either by accruing influence points or accomplishing missions for them. They give you bonuses for the number of influence points you have and will join the civilization with the most influence over them in wars. This system works well and gives players another opportunity to develop their civilization through means beyond conquest. The production system is mostly standard fare. You can produce what you want per city based on the amount of production a city generates from tiles, buildings, etc. There is no automation here which is unfortunate and not even a queue which is rather confusing. That said, the situation seemed to develop so rapidly that my choices always seemed to be governed so much by my situation in the moment that I didnt really notice it.A major change from previous games is the introduction of districts. Districts require a certain kind of tile near the city and are built by the citys production. If you want to build, say, a bank in your city, you need to first construct a Commerce District where the bank will be housed, unless you have one already. This system seems at first to be mostly an aesthetic choice, which would have been fine because it makes the cities look more interesting. The district system, however, has been rather well integrated into the game. It affects combat and wonder construction and makes cities specialize in certain roles which works extremely well and gives each city their own flavor to a degree that didnt exist in previous Civ games.The military system has been refined from the simple one-unit-per-tile system to something that combines elements from the old stack system, again to great effect. You can now attach certain types of units to your troops as support to enhance their abilities, like a siege tower for better city attack. You can also join units together into stacks of a certain size once you develop certain technologies. Attached and joined units work well and are interesting to think about strategically and tactically. Battles seem more realistic than in older games. Modern units rip though older ones which is a good fix because everyone used to roll their eyes when a guy with a club held off a tank brigade. The trade system is borrowed from Civ 5 Brave New World and works great here which is positive since the system had been rather broken and heavily patched in Beyond Earth. There is still a good deal of scrolling required in trade management which could have been easily resolved by adding sorting to the list by total yield and type of yield as well as some filters. This didnt ruin the experience, however. The religion system has really been kicked up a notch in Civ 6. Missionaries/apostles/inquisitors now debate (fight) each other. This creates an entire religious sub war. You can send your missionaries into an opponents territory, converting their cities and attacking their missionaries/apostles. They can also defend themselves and send their missionaries into your territory. Again, this works really well and adds an element of warlike gameplay to religious civilizations.The espionage system has been borrowed from Civ 5. You can build spies once you have a certain level of technology (modern tech), tell them which city to go to and have them perform a mission from a predefined list (like sabotage production). This system works fine but it made me wonder why they didnt do what they did with missionaries to spies, like in older games. They could have also added the units earlier (there were spies in ancient times after all), adding another strategic layer to the game like in older Civilization games where spies were available almost from the outset and what they could do developed with technology. At first glance, the technology system is your classic Civilization fare, a simple narrow tree of technologies from the wheel to nuclear fusion. No technology wheels, no wide tree-few choices system from Alpha Centauri, no wide tree large amount of choices from Hearts of Iron IV. This seemingly simple system, however, has been refined for fun and diversity. Technologies rarely require multiple other technologies as a prerequisite, allowing for wildly lopsided technological development. This system gets even wackier because you get large technological bonuses based on what you do. For example, you get a boost to Masonry if you build a quarry. This might make a higher level technology as easy or easier to research than a lower level technology, creating odd historical situations, but thats kind of the point. While this is not the deepest tech tree in a Civilization game, it is one of the most fun and opens up exciting possibilities.The government system is another highlight of the game. While there are only nine government types, there are dozens of different policies that can be implemented. The number of policies you can implement at once is limited by which government type you choose, but the number of policy sets possible is very encouraging to game diversity. The policies themselves range from simple +10% wonder production to much more complicated policies affecting trade, government, military and great person generation and seem somewhat balanced, allowing for a huge variety of play styles. You gain access to new policies by developing your Civics Tree.The culture system is now centered around developing your Civics Tree, a new companion to the technology tree. Just like the technology tree, it unlocks units, wonders, tile improvements, etc., but also the policies you will use in your government. It uses culture the same way that the tech tree uses science and can allow for some lopsided but fun development paths if your tech and civics levels begin to diverge. With so many developed systems working together, Civilization 6 builds complexity and depth from combinatorics, not lists. With potentially three different religion characteristics (out of about a dozen or so), ten different government characteristics (out of a few dozen) and now, district selection, the number of different combinations of government, religion and city purpose are so deep, and the gameplay so reactive based on behavior, that its unlikely two games will ever be the same. More than that, it should be said that these various system work together like an orchestra to produce a single cohesive experience out of the various subsystems. Your government type is a function of your cultural development. Your technological development and trading strategies are a function of your government type and so on. Lose a spy performing a dangerous mission in a foreign country? Use the diplomacy system to trade their spy or some gold for their release. Almost every system affects and is affected by every other system. This is one of the leading factors contributing to the dynamism and exploit the new opportunities youve been given playstyle which makes Civ 6 such a unique addition to the franchise.Of course, Civ 6 does have some problems, many of which persist from previous iterations and some of which seem to just be odd design choices. First of all, the AI behaves like Civ AIs behave, not very smart, but fun to play against. It seems as though the AI will actually get smarter at higher difficulties, but there are also handicaps to bonuses and the like. When it comes to strategy game difficulties, having the opposing AI get better but with the same gameplay mechanics and values is always something looked for strategy enthusiasts. Having the game play differently and all the numbers changing for each difficulty setting makes it hard to progress. The lack of good autonomous systems also is a misstep. You have to micromanage every single city, which admittedly makes more sense here because of the district system, but the option would have been nice. Automated exploration is also rather timid. Your explorers will freeze in panic and ask for instructions every time the see a barbarian unit instead of, you know, going around them or in the opposite direction which can get annoying to have to deal with if you are focusing on other things. A lack of sorting and filtering in build and trade menus is another confusing omission, though, with so much dynamism, not as much of a problem as it otherwise would have been. Civ 6 desperately needs a better Civilopedia. It is hard to search and there are no embedded links, requiring menu navigation to get from one concept to another. This removes one of the key strengths of the series because theres a lot of concepts here and it can be hard to figure out what everything does, how it does it and why which is odd for a Civ game. Of course, after a couple of playthroughs, this becomes much less of an issue.The music, as usual, is good, but it is repetitive, especially the constant refrain of danger music in combat that is lopsided. Also, the ruler animations can get annoying. They load a busy animation which requires two or three separate load times just for a ruler to say they dont like the player. I like animated rulers, but they seem overused here. It would be better if there were animations for your first roads and things like that rather than just leader chit-chat. Firaxis would be well served by checking out YouTube for some of the animations early in the series which added a lot of universe building and gave us a ground level view of our civilizations. That said, the wonder construction animations in Civ 6 look cool and its great that they take place directly on the map.Speaking of the map, there are some useful map overlays here which are essential to the modern 4x game. These could have been thought out a bit better, adding military strength for example. Another missed opportunity is the lack of a night view. They have the ability to change the time of day in the game which you can see during the wonder animations and this looks great but thats the only time you can see it which is disappointing. Another legacy issue from Civ 5 is that the game ends rather suddenly, with very little to no build-up. Beyond Earth did this much better, but AI behavior didnt seem to change. In older Civilization games, the AIs tended to gang up on you if you were about to win, basically serving as the endgame. Without it, Civilization ends not with a bang, but with a whimper. There also seems to be a small technical issue. At least twice the game wouldnt close properly, requiring restarts. As glitches go this one isnt the worst, especially if youve got a second monitor with task manager configured to appear there. The Civilization franchise had been falling prey to a particular bit of publisher greed: taking a popular game, improving its graphics, removing its features and then selling it as a full-priced game while most of the features the fanbase had come to expect from the series were portioned out as rather costly DLC. The last two base games felt hollow upon release: Civ 5 being eventually filled in with DLC and Beyond Earth continuing to feel like an empty experience. The single unit per tile system and hex grid of Civ 5 seemed to be the biggest change and this seemed more like a restriction and a minor design choice rather than new features. Meanwhile, they had removed so many systems from Civ 4 that it seemed like an indisputable leap backwards. Civ 6, unlike so many games in todays market, works well and is a complete product on release. Much of that comes by beginning with most if not all of the features of a fully DLCed Civ 5 (trade, religion and espionage available at launch). There are also a good number of civilizations to choose from, with a good deal of diversity between them. With the civilization packs as a big part of Civ 5s DLC strategy, I was expecting limited choices here, but I doubt people will be disappointed at all with whats available at launch.Civ 6 is not realistic. In my first game, Galileo created a steampunk society in 1260. That is awesome, however, and fits well with the cartoony look. This game is not for people trying to learn a lot of real specifics about history or geography (use Europa Universalis IV, Hearts of Iron IV, etc for that), but its not trying to be. Its a fun sort of what-if with historical places and things. Kind of like Xena: Warrior Princess or Jack of All Trades in that it uses history out of context and time/location to tell a fun story (but maybe I just have it on the brain since one of the leaders looks and acts like Xena, not that thats a bad thing). Development can get wacky, but that leads to a diverse set of experiences. There are, however, new wonders and great people and works to look up on Wikipedia later which can lead to serious sessions of learning. Children, especially those who havent been exposed to this sort of stuff, will find lots of things to inspire the imagination and future learning. Their parents, however, should keep a close eye on them because this game shares the highly-addictive qualities of its predecessors and bedtimes may need to be aggressively enforced. To be clear, this is not a game for simpletons. There are many complex systems working together and a great deal of strategic depth. If youre looking for a more historical experience, you will be better served better elsewhere, but if youre looking for a fun, very well put together game in a historical context with historical themes, Civ 6 will serve you well.Civ 6 is a remarkably well put together game. It doesnt seem to require additional in-fill or systems that the audience has come to expect so this would be a great opportunity for Firaxis to try some new things and expand the scope of the series. Gameplay designed to take place before or after the main line of the game would be very welcome. Perhaps they could expand the early game in having the nomadic tribes around longer, developing agriculture while they wander around the map looking for the best places to settle. Conversely, adding future technology, units, etc. would fit with the cartoony feel and inspire the imagination. Firaxis would have to look no further than the Civilization: Call to Power series for a fabulous set of futuristic technologies and mechanics. Another potential addition could be lunar colonies and colonies on Mars, since thats where the game ends. It would be a great deal of fun to vie for control of the red planet and/or the moon with your competitors. In any case, Civ 6 is the perfect base for experimenting with the series and hopefully they take great advantage of that (without ruining whats already great) and not just sell new civilization packs. Closing Comments:Civilization VI takes all of the elements from the Civilization franchise, improves on them and produces one of the most unique games in the series. It innovates heavily without removing any elements that players have come to expect. While the cartoony and less than historically accurate feel of the game wont appeal to everyone, this idea is very well executed and with so many options and different ways to develop, the replay value is extremely high. In this modern era of releasing half-finished games, games that should have spent additional months in testing and outright fraud, Civilization VI proves that it is still possible to put together a terrific full experience on launch. Veterans of the series, newcomers and children will all find a great deal to like here. The Civilization franchise is now 25 years old and much has happened to the genre in the meantime. Civilization VI couldnt be a more terrific love letter to the franchise. The dynamic and reactive nature of the gameplay, while maintaining and refining all of the elements that make Civilization the game that it is, creates a distinctly new and fun experience in a much-beloved setting.", "date": "October 26, 2016", "grade": 4.5}