{"name": "Titanfall 2", "ref": "https://hardcoregamer.com/?post_type=post&p=232065", "text": "Was there ever a game more hyped than Titanfall? Respawn Entertainments debut game was a great showcase for the unique gameplay the studio wanted to create, but it fell short just about everywhere else. No single player campaign, limited customization and an overall lack of content ended up turning the player base away rather quickly. Now, we have Titanfall 2, a sequel that aims directly at fixing the originals nagging issues. With a campaign and revamped multiplayer, should players standby for titanfall?Titanfall 2 immediately sets itself apart from its predecessor in that has an actual single player campaign rather than the multiplayer focused campaign of the original. Taking place a few years after the original, Titanfall 2 opens with the Militia successfully driving the IMC off the majority of their planets. One day, the Militia discovers the IMC have set up a research facility on Typhoon. Fearful of what the IMC may be up to, the Militia launch an all-out assault on the planet. You are Jack Cooper, a Militia Rifleman 3rd Class with dreams of becoming a pilot with the help of renowned pilot, Captain Tai Lastimosta. During the initial assault, Lastimosta is killed in action. With his final breath, Lastimosta names Jack the pilot of his Titan, BT-7274, commonly referred to as BT. Together, it is up to Jack and BT to discover the IMCs plans and put a stop to them and their hired goons.Titanfall 2s story isnt very original. There have been plenty of narratives spun about how two unlikely people are paired up and must cooperate to overcome an obstacle, but its well-told. The relationship between Jack and BT is the heart of the campaign and Respawn has cleverly pulled it off. Titanfall 2 deliberately isolates Jack and BT from any other humans, giving them only each other for company. Through contextual actions that pop up on screen, players can speak with BT, or completely ignore them and establish a bond with the Titan. BT may be a robot, but a combination of smart writing and great voice acting make him feel more like a real person than the rest of the supporting cast. Those looking for a long campaign might be a bit disappointed. Titanfall 2s campaign is comprised of eight chapters (nine, if you count the tutorial), which will last around six hours depending on the difficulty. There are collectible pilot helmets to go back and collect, but there are no additional modes or anything. Thats not to say that those six hours arent any good. In fact, theyre exquisite and each chapter has its own reason to go back and replay it.Titanfall 2s unique wall-running and jumping mechanics lend themselves to unique mission structures. Respawn Entertainment utilizes this by crafting gameplay encounters that incorporate multiple play styles. The wide open areas allow players to take the battle up high, constantly dodge by jumping from wall-to-wall, or just run in guns blazing. Want to snipe? There will be a weapon cache around the area filled with snipers. Want to jump around with a shotgun? Youll be able to find one of those. Just want a trust assault rifle? There are those too. While Titanfall 2 has plenty of setpiece moments, these more open areas allow players to create their own setpiece moments. While the Titans dont have access to the verticality a pilot has, BT does offer players a lot of variety. As a Vanguard-class Titan, BT can equip the weapons and abilities of the different Titan Chasis. All players have to do is tap the right button and choose from any of their unlocked Chasis. You can quickly wield the sword of the Ronin Titan to deal with up close enemies and then quickly switch to Northstar to snipe enemies in the far off distance.The gameplay that defined the original Titanfall has been refined and tuned for the sequel. Wall-running and double-jumping are simple to pull off, and pros will quickly be able to chain multiple wall-runs together to pull off some truly remarkable feats. These slick mechanics not only work well in the single player campaign but also transition nicely into the multiplayer. Titanfall 2s multiplayer has been retooled to fix many of the issues of the first game. Like the original, players can take a primary weapon and an anti-Titan weapon/pistol, having to choose whether they want a pistol or anti-Titan weapon. Of course, there are a lot more changes that make Titanfall 2s multiplayer a more robust experience. The customization system has been completely rebuilt to accommodate a large amount of content. Players can rank up different assault rifles, sniper rifles, light machine guns, submachine guns, shotguns, and anti-Titan weaponry. Each weapon has different skins, attachments, and sights to unlock. On top of all this, players can now assign different tactical options to their classes. The Grapple option gives players a grappling hook, Stim gives a short burst of speed and faster health regeneration, and Holo Pilot creates a holographic version of yourself. Likewise, the six different Titans can be customized with perks and skins to make them feel more unique. Its a much more robust system than the original game. While there are more weapons, options remain limited. In total, there are four assault rifles, four submachine guns, three light machine guns, three sniper rifles, two shotguns, four grenadiers, four pistols and four anti-Titan weapons. Regarding maps, Titanfall 2 offers a good variety ranging from natural landscapes to destroyed cities. Theres plenty of variety here, but not all maps were created equal. The best maps are the ones that allow players to easily chain together wall-runs and double jumps to create momentum (see if you can find one tomorrow). Thankfully, the majority of the maps are like this, and it running around them can be a blast. However, there are a few maps that break the experience. Homestead, which features wide open fields, is probably the worst. Titanfall 2 is all about momentum, and when something messes it up, it hurts the magic of the game.A total of eight modes are available at launch. Old favorites like Attrition and Pilots vs. Pilots return alongside new modes like Bounty Hunt and Amped Hardpoint. AI bots and Titans are now restricted to certain modes. While players will encounter plenty of AI in Bounty Hunt and Attrition, they wont in Amped Hardpoint or Last Titan Standing. Likewise, a mode like Pilots vs. Pilots wont feature any Titans. Theres something here for any player when they crack open the game. For those who want to play all the game modes, theres a Variety playlist that cycles through the different modes. The multiplayer is much improved. Titanfall 2 keeps the addicting momentum-based gameplay of the original and throws in a whole lot more content. Its easy to see the fun and well-balanced multiplayer having staying power. All gameplay was tested on live servers, so it looks like the game should work well at launch.Titanfall 2 is built using a modified version of the Source Engine and is an improvement over its predecessor. Environments are bigger and more detailed. While the original games maps were mostly industrial, Titanfall 2 takes many of its maps outside. Detailed water flows through the environments while lush vegetation covers the ground and walls. Source is still an older engine, and perhaps Titanfall 2 might have looked better running on Frostbite 3, but that wasnt the goal. Titanfall 2 is built to be fast all while running at a solid framerate. The fact that it manages to do that and look good at the same time is more than satisfactory. The sound design is particularly good. Guns and explosions sound powerful, and a nice OST accompanies the story. Matthew Mercer (Jack) and Glenn Steinbaum (BT) deliver stellar performances, and the rest of the cast doesnt do a bad job either.Closing Comments:Titanfall 2 takes what works with the original and builds on it. The same addicting momentum-based movement system is back and its still fun to use. Built on top of this is a campaign that, while not the most original, manages to create a relationship that feels genuine with a unique mission structure that embraces the movement system to create unique gameplay scenarios. Then you have the multiplayer that may not have as many weapons as some other games, and a few maps that dont play to the games strength, but still manages to produce hours of fun. Titanfall 2 breathes new life into the concept and has solidified it as a franchise. Now, lets all standby for titanfall.", "date": "October 24, 2016", "grade": 4.5}