{"name": "Sports Bar VR (PSVR)", "ref": "https://hardcoregamer.com/?post_type=post&p=231742", "text": "Pool Nation VR brought the world of a virtual sports bar to your living room with room-scaling VR and it has arrived on the PlayStation VR in a stripped-down form. While much of the content has been retained, the method of delivery has been changed  with mixed results all around. Translating something meant for an entire physical room to be walked around to a far shorter area and then factoring in using Move controllers has changed things up from the original game. Instead of having a room to explore, you can move around slightly within the cameras frame and then use menus to navigate or kind of pull yourself through the room with both Move controllers.Sports Bar VR has a reasonable lineup of virtual sporting games offered up. Bar favorites like pool and air hockey are here alongside skeeball  which loses something without the ever-dangling carrot of tickets to redeem. A giant virtual novelty comb wouldve been a nice reward. Some games make the transition to small-scale VR better than others. Pool is a fidgety mess using two Move controllers. Normal pool is tough enough with bad coordination, but trying to play it with two Move controllers in the air without a physical surface to judge distance on makes things nearly impossible.I had to look around quite a bit to make sure I had things lined up, and things eventually worked  but not perfectly. Darts fares a bit better  with the replication involving you holding the Move ball by your head, flinging things forward, and then kind of hoping you hit the target dead-on. I was happy to get reasonably close and this doesnt quite fare as well as Shenmue darts even if the execution is far more accurate to the real-life activity. Skeeball also handles well, and having things mimic the real-life action is definitely the best way to go about things.Air hockey has been a favorite of mine for many years and fares well here too. It lacks some of the charm of having friends cuss one another out for smacking their fingers with the puck  but it does the best job it can to replicate things and since you dont really need 1:1 movement to do well, you can just move things around vaguely and still succeed. The look and feel of the in-game bar is fairly good  with some of the best texture work so far. This really comes in to play when you adjust the height of the pool table and see all of the little details on it. The wood grain actually looks realistic, which is a change from the Vita-esque texture quality in many PSVR games  although the patrons do have a bland look to them. Fortunately, with the focus being on the games themselves, things work out well enough graphically. Closing Comments: Sports Bar VR is the most social PSVR game of the bunch and benefits from playing it with your TVs speakers and having friends around you. Alternating from one person to the next allows for everyone to have fun and enjoy their preferred game. So if one person in the group loves pool, but the other loves skeeball, and someone else prefers air hockey, they can all wind up having a blast. Its got its fair share of control issues, though, and trial and error is going to be the key to finding just the right setup for you. Its finicky, but worth your time if the concept intrigues you.", "date": "October 23, 2016", "grade": 3.5}