{"name": "Tumble VR (PSVR)", "ref": "https://hardcoregamer.com/?post_type=post&p=231309", "text": "The poor PlayStation Move never stood a chance on PS3. Fortunately, these goofy-looking wands are getting a second chance with the advent of PSVR. One of the few excellent PS Move titles back in the day was Tumble by Supermassive Games. Theyve since completely updated the already enjoyable puzzler experience with Tumble VR. Currently available exclusively for PSVR headset owners, this rendition of Tumble takes the core concepts and expands upon them with many more puzzles of different types. Of course, many missed out on the original title thanks to completely discounting the PS Move. So, whats this thing all about? Tumble VR is a puzzle game with a focus on motion controls to make gameplay more direct. For example, one of the puzzle types simply asks players to create the tallest tower possible via a limited assortment of blocks. The higher it goes, the better medal they receive. Setting up your block tower, however, isnt as easy as moving an analog stick and pressing buttons. Instead, its entirely up to you to position each and every block carefully using the DualShock 4 controller. While the core motion-controller gameplay made sense for PS3, the PSVR opens up a greater amount of immersion. Now youre seeing the space and tower directly in front of you, and are more capable of judging how well/poorly your block masterpiece is working out. This is far from the only gameplay mode in Tumble VR. Also included are modes which have players creating bridges, attempting to simply stack as many blocks in a small space as possible, destroying towers for points, and much more. Each mode makes players think in different ways, which keeps each puzzle an exciting new challenge. As with many puzzle titles, the vast majority of puzzles are locked by default. Only after getting enough medals do further areas and harder ones unlock. And boy, do they get tough quickly. Despite the simple concepts behind each puzzle type, there are always new and cruel ways that the game manages to amp up the difficulty. For example, they might give you tons of oddly-shaped blocks for building, or set off an earthquake every few seconds. A local multiplayer mode is also included. Thanks to the PSVRs breakout box, the headset player gets their own view while the TV set outputs another image of the scene. The VR players goal is simply to build a tower of blocks. On the other hand, the non-VR player must do their best to sabotage the whole thing. Every few seconds they receive a random item to mess with the other persons blocks and force them off the small building platform. While fun in the short term, its really the single player which shines in Tumble VR.Unfortunately, one key issue has dampened the experience tremendously for myself and some others. Sometimes, the DualShock 4 controllers position in game goes totally wacky. You may be holding the controller as still as possible in your hands only to find it shifting forward and backward on its own in-game. This of course can wreak havoc when carefully building something. If you let go when the controller freaks out then a block may end up slightly or completely out of place. In the worst case, it may lead to toppling your entire structure. Given that this is not an issue with most other PSVR releases in my current setup, it seems that this may be a weird software issue for Tumble VR which a patch can resolve. For now though, its totally an annoyance when the problem crops up. Closing Comments: Tumble VR improves upon the original Tumble with all manner of new puzzles and a cute versus mode. Its also a game which makes total sense for playing within the PSVR. Theres something about placing blocks with your own hands that just feels better than other puzzlers. The caveat, of course, is if your controller also exhibits the weird shakiness in-game from time to time, which makes it totally annoying rather than an amusing experience. Heres hoping that a patch will resolve this issue for any players currently dealing with it. When working as intended, Tumble VR is a great, brain-teasing way to spend time in VR.", "date": "October 18, 2016", "grade": 3.0}