{"name": "Rez Infinite (PSVR)", "ref": "https://hardcoregamer.com/?post_type=post&p=231127", "text": "Chances are, if youre seriously into games then youve heard of Rez before. Over the years, this single game first hopped to Xbox 360 after a successful Dreamcast/PlayStation 2 launch and is most recently on PlayStation 4. Some may wonder why this darn game keeps being re-released. The thing is, despite being fifteen years old at this point, the gameplay and style still fit right within the modern gaming landscape. One question which many were asking around the debut of Rez Infinite is if this latest edition was truly necessary. After all, virtual reality is swarming with brand new games and experiences. What good would it do to bring a retro release forward into a fancy new headset? The amazing thing is that Rez Infinite not only works exceptionally well in VR, it feels as though this is how Rez was always meant to be played. Did Tetsuya Mizuguchi have virtual reality in mind all those years ago when initially developing the title? Its honestly shocking how well everything works. For those who havent played Rez before, the game is effectively an on-rails shooter with distinctive vector styled visuals. The player must target enemies, shoot them down, and occasionally collect items to level themselves up. Aside from changing the protagonists form, these give you additional leeway to get hit a few times before failing out of an area. At the end of each of the five levels is a boss battle. The simple concept plays smoothly and generally allows for a greater focus on the mesmerizing visuals and exceptional music.Even if gameplay isnt the main focus, Rez Infinites PSVR version improves on it immensely. Now instead of moving the analog stick to aim you can simply move your head. Though this may sound a little cumbersome or tiring, it hardly feels that way in action. Instead, its akin to having precise mouselook control in the game. After all, the reticle only moves so fast via analog, whereas it can be immediately moved wherever the player looks. Those who dont wish to move around too much can still use analog control for aiming. The most incredible bit of wearing PSVR while playing is being able to turn completely around to keep tabs on a persistent, gigantic boss. What was once controlled via specific cinematic camera angles is now up to the player to determine. Thematically, Rez Infinite is meant to take place inside a computer. This concept pairs perfectly with the launch of PSVR. Right now, the more realistic titles are being scrutinized because the lowered quality of visuals of PSVR (compared to PS4) is so easily perceptible. Thats not the case here. The stylistic design of Rez just looks plain good regardless of if youre playing in a headset or just via the console. Seeing the final area rendered in VR, though, is a total trip (in a good way). Tracking seems pretty spot on with PSVR as well, allowing every quick movement to be reflected onscreen. The only issue appears to be a potential for screen drifting to the left or right. It remains to be seen if this is more of a game issue or hardware/setup problem. Rez Infinite is not simply yet another port. Sure, all five stages (as well as the Lost Area) are included and generally the same as they ever were. Whats new is a stage called Area X. Before release, many assumed this would be a new level designed to look and feel just like the original game. Thats not the case at all! Instead, this Unreal Engine 4-powered area is an incredible proposition for what Rez 2 could be. Instead of hard line vectors, everything is rendered as tons of tiny glowing particles. Gameplay is also modified to remove the on-rails concept. Instead, theres just a spacious, space-like environment to explore. Looking within the headset determines which way youll fly next. Bosses are designed to take advantage of this, forcing you to look all over the place within VR to keep pace. Its gorgeous, enjoyable, and very much worth unlocking by playing through all of original Rez first. Closing Comments:Its impossible to deny the allure of Rez Infinite. Those who were previously fans are set to have a sublime experience within the PSVR headset. Sure, theres no Trance Vibrator attachment, but being immersed entirely in Rezs world is an almost religious experience in and of itself. Anyone brand new to the game is still likely to enjoy their time thanks to the resplendent visuals and magnificent soundtrack. Gameplay was never too difficult, but now its even easier to keep pace with swarms of enemies thanks to motion-controlled targeting in the VR edition. Rez Infinite stands as one of the best games of the PSVR launch lineup and absolutely deserves a spot in your PS4 library.", "date": "October 16, 2016", "grade": 4.5}