{"name": "The Sims 4: Seasons", "ref": "https://hardcoregamer.com/?post_type=post&p=304396", "text": "Marking the fifth expansion after many real seasons of DLC, Sims can now enjoy year-round appropriate weather just like their real-life counter parts in The Sims 4: Seasons. Hitting a good stride of yearly content, The Sims 4 isnt running out of steam, yet, and while it took time to get to Seasons, its well worth it now that the seasons of sims lives are in full swing. With The Sims 4: Seasons comes a slew of compelling changes that add depth to The Sims 4 were it had been lacking; Seasons would be fun to play even without the other content (though it does help).Once Seasons has been implemented in game, The Sims 4 waste no time putting that yearly weather to work asking immediately what season the player would like to start in. Pick a favorite season or save the best for last, once that seasonal cycle gets going it wont matter either way. What seemed to be a relatively short cycle when starting Seasons, allotting one week in game time to each season, proved to be just enough time to get comfortable with all the seasons in planning for the next cycle. A simple feature for Seasons, but an important one, is that the seasons can be set to seven days, fourteen days or thirty days. It means living out ones favorite season(s) and skipping those dreaded months, whatever the time of year.If The Sims 4: Seasons gets one thing right, its the feeling of each season. What really makes each individual season stand out is, of course, all the things to do and changing of the leaves, but The Sims 4 has gone above and beyond in getting the mood just right for each season. Just playing through summer feels hot, as a warmer tone sets over neighborhoods matched by nights of heavy summer thunderstorms and heatwaves blanketing the streets. The frigid winter air can be felt rattling through bones as cool blues set into the nooks of warm homes with the fall of first snow, watching it steadily build through the season. No matter the season, The Sims 4 nails the aesthetic and atmosphere of each one and is almost reason enough to jump on this expansion, but The Sims 4: Seasons has more to show than just the yearly weather. As with any piece of Sims content, comes jobs, furnishing, gags and the plane-strange in the best of ways feeling that The Sims 4 can bring. Having new dynamic weather is fun, but it means making sure Sims are dressing appropriately for the yearly weather. Maybe a Sim is heading out into the frigid night for a drink? Well make sure to dress them in warm clothing or otherwise they might freeze to death, which applies vice-versa for summer heatwaves. Now that seasons are in Sims lives, if they dont dress for the weather, there is more than one way that theyll kick the bucket. Two new outfits are now a part of Sims wardrobes: warm and cold weather outfits. When changing clothes for these weather types the game will let you know what clothing constitutes as what. It adds for some fun new looks and keeps Sims from dying; a win-win (note: while the raincoat will keep a Sim dry, it wont keep them from getting hit by lightning).Keeping up with the changing of the seasons can be a lot to manage, not only for the changes they bring, but the holidays too; thats where the calendar comes in. The calendar might be the most important feature for Seasons, displaying days left in a season, who is busy on what days with appropriate times and has every holiday/birthday booked marked with some holidays even making appearances at random. It just wouldnt feel like true seasonal cheer with out the appropriate holidays and while The Sims 4 is pulling from what it knows in real-life, The Sims 4 holidays might honestly be better. Who doesnt want to celebrate Harvest-Fest or receive a visit from Father Winter during Winterfest (yes, its a lot of fest)? Maybe none of these holidays work and a personal holiday sounds better? Well, just add it to the calendar. Pick any day and create a unique holiday for whatever the celebration. Holidays even come with activities for Sims to accomplish based on if they enjoy the Holiday or not. It adds fun flare and gives reason to bust out the decorations. The addition of home decorations isnt the fullest its been in an expansion, but that hardly matters when each season is as fully realized as can be. The main draw for home decorations in Seasons is being able to decorate for each season, giving Sims homes life that adds even more of a touch to an already stellar seasonal flavor. Plus, certain home decorations might be more beneficial than they let on; take for instance the Scarecrow that if talked to enough eventually comes to life and will garden for Sims  now thats handy, especially with the all new Gardening career paths.What Sims expansion would be complete without a few new jobs? The Sims 4: Seasons adds two new jobs, both focused around any Sims plant-caring needs. Sims can now become a floral decorator or for the more scientific sims the path to a career in botany is ready and waiting. With the addition of both these jobs comes an overhaul on gardening in general, meaning more dynamic gardening while simplifying it all. Growing plants is easier to understand and do (especially with that scarecrow) and while Ive personally only steered down the floral career path, Im sure the botany path is just as fun. Closing Comments:Participating in my Sims lives without The Sims 4: Seasons is unthinkable now. Seasons is by far one of the better expansions to grace The Sims 4, adding a tremendous amount of depth where The Sims 4 was lacking without realizing it. Its exciting playing through each season, watching the leaves change from greens to reds, falling off and then budding anew. The Sims 4: Seasons connects Sims more than ever to their player counterparts, and now that Sims have holidays to look forward too and birthdays marked down on the calendar, theres a foundation in their lives where there once was none. Playing with Seasons gives a certain sense of play that wasnt their before and much like each passing day I cant wait for the changes Seasons brings to my Sims lives.", "date": "June 29, 2018", "grade": 4.5}