{"name": "Gurumin 3D: A Monstrous Adventure", "ref": "https://hardcoregamer.com/?post_type=post&p=230553", "text": "Gurumin was originally released in 2004 on PC for Japan. A few years later it would see release on the PSP and make it westward, and finally made its worldwide release on PC just last year. The most recent updated release of this title is on 3DS and it does an outstanding job feeling right at home on the Nintendo handheld. There are a lot of great games in the Nintendo eShop and Gurumin is one that should be added to everyones game library.In Gurumin players take on the role of a young girl named Parin, who has been sent off to live with her Grandfather in a mining town. Parin is excited to make friends, but quickly discovers that no other children live in this town. Just as shes about to give up looking she runs into a monster who she at first mistakes to be another young girl, but this monster quickly corrects her and says they can only be seen by children. The monster invites her back to her world and Parin decides to go along, hoping to make some friends. Tragedy soon follows as the monster village is attacked by phantoms who destroy the village and kidnap her new monster friends. With no time to waste, Parin takes a legendary drill from the monster village and sets off to save her friends and stop the phantoms.The story, while simple, is still incredibly charming. As Parin makes her way through saving her friends, more story is uncovered beneath that as she starts to learn just who these phantoms are and what theyre really after. It is also worth noting that Gurumin has multiple endings, depending on how many dungeons are completed before taking on the final area. Gurumin also includes a total of five difficulty settings, but only two will be available to start. Different rewards will also be available for each difficulty, making it worth playing through multiple times. The overworld map at the beginning is blocked by a mysterious mist caused by the phantoms, so Parin heads to the only available dungeon where things finally kick off. From the towns to dungeons, Gurumin is filled with great looking textures and environments. Even areas that are somewhat similar still feel unique, and each separate zone is vastly different from the last. The camera will usually follow Parin from behind, but can be manually rotated using the L and R buttons, or if playing on a New 3DS the nub can be used to freely control the camera. The camera will occasionally get stuck if the character is in a corner or small space, but it will usually fix itself pretty quickly.Parins weapon of choice is the legendary drill and using this fearsome weapon allows her to break down pillars, rocks, and even walls. If her drill is upgraded it can even dish out some powerful attacks. Parin will spend time running between the monster world and the mining town, where she can purchase items and equipment. Extra equipment can be purchased in the mining town, which each piece being able to upgrade to give her resistances to certain area obstacles or even help her find items and money in each dungeon.Gurumin offers a good level of challenge for any player, with many hidden secrets and challenges in each dungeon. After each level is completed its scored on how well the player did, this score is judged on on treasures found, enemies defeated, and how long it took to complete. Depending on that ranking, Parin receives a medal which can be exchanged for money or special equipment to help her out. It might take a few tries, but completing each dungeon with the highest ranking is worth going back to find every last secret and defeat all the enemies.Gurumins soundtrack is easily one of the most enjoyable to listen to while playing. Each song not only fits the atmosphere of each dungeon and area, but might have a player stopping just to listen to the entire thing before continuing. None of the songs ever feel repetitive or boring, theyll boost enthusiasm tenfold and make every level even more enjoyable. All the characters are also fully voiced, giving life to every villain and friend alike. While the lip-syncing can look a little wonky at times, this isnt at all unusual for games dubbed in English.The bosses in Gurumin were surprisingly tough at times, even on normal difficulty. The phantom bosses often feel like they have a bit too much health, especially early on if Parin hasnt gotten any defensive upgrades. These bosses arent incredibly predictable either unless they shout something before their attack, but this makes them a bit more interesting to fight since there is never be a strict pattern to follow in order to get the most damage on them. Each boss fight does also offer a unique experience and challenge, as unlike a lot of basic enemies its not possible to button mash in order to win.The only sound related issue with Gurumin is heard when a player is going between screens. When entering a doorway, the music will almost always stutter briefly. This really only starts be a pain when going in and out of doors frequently, otherwise its not a very annoying issue. There is also some noticeable frame rate slow down when the screen gets filled with enemies or cluttered with magic attacks. The slow down wont usually last long and wont be too much of an annoyance unless it occurs during one of the many platforming segments, but it does briefly take away from the otherwise seamless gameplay. Closing Comments:Gurumin not only offers a great challenge, but makes players want to go back and find every last hidden secret and collectible. The graphics, sound and music all look and sound great on the 3DS. If there is even the tiniest bit of interest in Gurumin, it is absolutely worth picking up. While it may appear to be aimed mainly at younger audiences because of its cute style, all ages will be able to enjoy it to the fullest. It is easily one of the best 3D action platformers available on the 3DS and is more than worth the price. While it may seem cute and easygoing, there is quite the monstrous adventure waiting in Gurumin 3D.", "date": "October 14, 2016", "grade": 4.0}