{"name": "Shadow Warrior 2", "ref": "https://hardcoregamer.com/?post_type=post&p=230580", "text": "Editors Note: This article mentions a piece of the ending of 2013s Shadow Warrior.Shadow Warrior 2, much like its reboot predecessor in 2013 and said reboots original version in 1997, is not for the easily offended. If toilet humor or ultra-violence doesnt equate to dumb fun for you, then this isnt your type of game. Theres a segment of the gaming population, however, who appreciates self-aware stupidity (read: anyone who enjoyed Doom earlier this year), so if you fall into this contingent then youre in luck. In a nutshell, if you combined 2016s Doom with a lighter version of Diablo IIIs loot system and a whole host of South Park humor, youd wind up with Shadow Warrior 2. It might not do everything perfect, but considering the general seriousness of all of the fall releases this year, Lo Wangs return provides a healthy dose of lunacy, stupidity and a hell of a good time.Quantifying fun in a video game review is one of the toughest things for a writer to do, and its a practice thats generally frowned upon. My idea of fun could be very different from yours, but in general, if youre the type of person that enjoys playing games, the difference between a serious game and one thats hoping to simply be a blast is somewhat obvious. If you go into Shadow Warrior 2 hoping to be moved by an emotional story thatll make you contemplate your mortality, then disappointment is soon to follow. Its for this very reason that the mentality you go into this particular title with is imperative. Shadow Warrior 2 aims to put as much chaos and filth as possible on your monitor and in your ears, and its an absolute blast as a result. Then again, if youre playing the second iteration in a series with a narrative that continues across sequels, the hope is that youd understand what youre getting into.Shadow Warrior 2 takes place five years after the plot of Shadow Warrior, with our favorite foul-mouthed hero Lo Wang existing as a meager mercenary in a world now infested with the demon goddess Ameonnas Black Rain. After taking on a job handed down from mechanic/soul-channeling blacksmith Master Smith, Wang sets off to rescue Kamiko, a young half-demon scientist responsible for creating the popular drug Shade. In the process of rescuing Kamiko, we learn that her body has degraded thanks to a demonic curse, which Smith solves by placing her soul and consciousness inside of Wangs mind. As you might expect, this creates a dynamic similar to that between Wang and Hoji, with the constant bickering and snide comments between Kamiko and him make for a whole host of face-palm inducing dialogue. A host of demonic favorites from the previous title are prevalent featured, notably Ameonna, Gozu, Mezu and Xing, but it isnt totally necessary to recall past events to play Shadow Warrior 2. Of course, Shadow Warrior as a concept is meant to have you shaking your head in astonishment thanks to its self-aware stupidity, and thankfully developer Flying Wild Hog put a whole host of zany narrative content to keep players entertained throughout what is a pretty meaty campaign.The core loop in Shadow Warrior 2 is not unlike Destiny, albeit with a more standard cooperative system that well dive into later. Players get all of their missions from a main hub, which also plays host to shops players can use to buy and sell weapons and upgrades. After getting your loadout setup the way youd like, youll access a map containing every side mission and story mission that youve unlocked up to that point before teleporting to the mission start area. Where Shadow Warrior 2 is more successful than Bungies massively popular shooter is that every mission is given enough context to give players a tangible reason to move forward. Whether youre attempting to stop the publication of a demon sex tape, obtaining the ingredients to become the next great Shade cook or locating Kamikos massive demonic body, everything youre doing feels like it has purpose. Granted, in practice, youre always going to be killing a ton of demons, humans, bugs and robots for some pretty ridiculous reasons, but it never feels like youre repeating the same thing over and over again. Shadow Warrior 2s loot system and procedurally generated environments are definitely major factors in why this sequel surpasses its predecessor, but it wouldnt be right to talk about these items without mentioning the star of the show here: combat. If youve played Shadow Warrior, then you know that its basically everything that you want out of a twitchy first-person shooter. From the more than seventy weapons, to the ability to double jump and air dash infinitely all the way to the insane amount of gore, Shadow Warrior 2 takes everything that makes a first-person shooter exciting and reckless and packs it into every encounter. This is absolutely not the type of game where you want to be sitting behind cover hoping that you dont take damage. The average fight here involves strafing and dashing around your foes, switching from guns to swords to melee weapons in order to get an advantage on your foes, all while utilizing demonic powers to heal, stun and sneak around your foes. Oh, and lest we forget, Shadow Warrior 2 follows up on its predecessors industry-leading first-person swordplay with a massive arsenal of weapons and a procedural damage system that allows the angle of your slashes to actually effect how an enemys body falls apart. In short, cut someone across the stomach and theyll split in two. Its brutal and over the top, but frantically sprinting around swinging your sword like a madman feels unlike anything else in the genre right now.Easily the biggest change that Flying Wild Hog made for Shadow Warrior 2 was the addition of an action-RPG-style loot system. Not only will you obtain some of the craziest weapons youll find in a first-person shooter, but youll also constantly pick up augments for said weapons, as well as your armor and power-set. These upgrades might range from an increase in damage, fire rate or critical hit chance, or they could allow you to place a heavy weapon as a turret or make your explosive ammo stick. Its awesome to see a game get both really granular in its statistical upgrades while still feeling accessible and fun. Make no mistake, theres definitely a bit more inventory management than you might expect in a goofy gorefest, but once you dive in headfirst into equipping elemental upgrades onto your weapons and combining gems via crafting, this system begins to shine. Oh, and lest we forget: there is a persistent leveling system with skill points that can be assigned to a massive array of character updates. As strange as it is to say, Shadow Warrior 2 scratches the same itch that games like Diablo and Borderlands do, all without losing the charm that made fans wild for Wang in the first place. Whereas Shadow Warrior was a linear shooter in every sense of the phrase, Shadow Warrior 2 opts to open things up a bit. While it isnt a traditional open-world title, every mission takes place in an open area full of alternate routes, multiple elevation levels and a variety of secrets and hidden powerful enemies. Whats more, all of these stages, with the exception of set-pieces designed for the main story, are procedurally generated, so theres enough variety here to go back and free roam to farm loot. Granted, Im not sure that Shadow Warrior 2 has the legs of procedural-generation hallmarks like Spelunky and The Binding of Isaac, but considering how gorgeous these environments look, its pretty awesome to see things change up a bit from experience to experience. These procedural elements also translate over to enemy and item placement, so the issue of going back to roam around an area only to find the same enemies in the same places is not a factor. To top this discussion of variation and replay value off, Shadow Warrior 2 supports cooperative play with up to four players, and whenever you load in a save, you have the option to open your play session to other players and scale difficulty accordingly. Because of the dumb fun factor at play here, the idea of jumping in and chopping up some demons while having a conversation is as awesome in practice as it sounds.Despite being an absolute blast to play and being surprisingly good looking, Shadow Warrior 2s one downside is a notable number of technical annoyances. Shadow Warrior 2 is by no means broken, and anyone reading this should absolutely give it a shot, but it could use another patch or two to really shore up the final package. The biggest complaint that can be levied here is against the loading times, which even on capable PCs can stretch upwards of a minute. An attempt to load in a cooperative game with a player on a mid-range PC resulted in a loading screen that never ended, as well as a crash on the other players end. Though there are a whole host of graphical options at play, its not uncommon for the framerate to start chugging after around a couple hours of play, which can be remedied with a reboot. Shadow Warrior 2 is also host to some occasional bugs, with bizarre lighting flickers during cutscenes and some awkward lip syncing popping up here and there. Finally, if youre a Steam Link user, you should know that after about ninety minutes of play, you might not be able to hit sixty frames and will likely experience full crashes. Considering that Ive used the exact same Steam Link setup for portions of around a dozen reviews this year without this issue, its hard to ignore such an technical aberration. Closing Comments:Putting aside the technical complaints, Shadow Warrior 2 is legitimately one of the best shooters of 2016 thus far. From its quick, snappy gun and sword combat to its satisfying Diablo-style loot system, this is the type of game that players will find themselves coming back to whenever theyre seeking a good time. Yes, its blatantly trying to be offensive in the dumbest ways possible (lest we forget, your characters name is Lo Wang), but its self-awareness has a way of bringing a smile to your face. Completely changing up the structure of a sequel is always a risky move, but Flying Wild Hog should be commended for nailing its goal of making a deeper, replayable, more open shooter. On top of all of this praise, its one of the finest examples of how to make a procedurally-generated game not feel like youre playing through a repetitive algorithm like a certain ambitious space exploration game. Its an absolute joy to report that the Wang is back and better than ever.", "date": "October 13, 2016", "grade": 4.0}