{"name": "Gears of War 4", "ref": "https://hardcoregamer.com/?post_type=post&p=229354", "text": "Ten years ago, a little company by the name of Epic Games, formerly that of Epic MegaGames, created something no one thought would be as revolutionary as it was. Their third-person shooter project ended up pushing the genre to a whole new level, setting the bar for a slew of games over the next decade. We are of course talking about Gears of War, a franchise thats now as synonymous with the Xbox brand as Halo. After purchasing the intellectual property nearly three years ago, Microsoft Studios went to work building a studio in Vancouver led by former Gears of War Executive Producer, Rod Fergusson. While the trilogy behind the Marcus Fenix and the Locust was neatly wrapped up, the world of Sera continues with various struggles, and this time with a new generation characters to follow. Gears of War 4 is the start of a whole new saga, and while its difficult to bear the weight of a franchise as large as this, The Coalition has done an admiral job setting things up.The story takes place twenty-five years after the events of Gears of War 3 where there has been, for the first time in a long time, peace all around the world. The Locust army has been eradicated and now its up to everyone to pick up the pieces and rebuild. Sadly, not everything is peachy as the once beloved COG that fought back the forces of evil for so long and essentially help save the world, are now more of an oppressor. Their word is law whether you like it or not, and will constantly enact their own form of justice based on preliminary assumptions. They have created robots to quickly and efficiently build settlements for people to live in, but they also have equipped them with weapons, something that doesnt go well with their shoot first, ask questions later mentality. The COG arent the only thing to worry about now as there are also crazy environmental hazards popping up, such as Wind Flares, which are essentially giant tornadoes that produce insane winds and constantly rain down lightning strikes. Suffice to say, while one problem was snuffed out twenty-five years ago, theres still a lot to be worked out in Sera. While this seems like a setup for an exciting plot, theres a lot plaguing the narrative of Gears of War 4. Mind you, this isnt really a series well known for its deep and meaningful stories, but there are still some nagging questions that could be better explored. One of the bigger issues is that its hard to grasp the current state of the world. The first act introduces us to these giant settlements that are being built for people, but you never really interact with anyone outside of Jinn, whos basically in charge of the new robot COG army. The first Gears of War did a good job portraying the state of humans outside of the system, trying to make it on their own, whereas the second game was able to show us the COGs side of things. Here, theres a quick village you can walk around in, but even then, its almost immediately goes into a defense mission. Theres no real sense of what has happened over the last twenty-five years outside of new mechanical revolution. Where are the people? What happened to the COG soldiers now that the robots are more efficient killing machines? How has the world adapted to being in a time of peace? Gears of War 4 feels like its trapped inside a small, contained box with no windows to see the outside world.The other problem is character building. This might have to do with the short campaign, which we clocked in just under seven hours on the normal difficulty while only obtaining a handful of the collectibles. There are three new characters to play as: JD, Kait and Del. JD is Marcus Fenixs son and essentially Nathan Drake, constantly cracking wise, but when things hit the fan, he puts on his serious face. Kait is like a moody teen who never really blossoms into anything more than yelling were going to save my mother. Finally, Del is well hes just there. Its telling that I forgot his name early on and only remembered it a few days after completing the campaign; thats how much of a contribution he is to the story. Theres just not enough time to get to know everyone, be it their relationships or history, as the bullets dont stop flying. To a certain degree, this means the campaign is action packed from start to finish, but The Coalition could have taken a step back to build some of the characters better. It doesnt help that there are two, potentially three emotional moments throughout the campaign, and only one of them is truly earned. Moving on to the gameplay portion, if youre familiar with the mechanics of past Gears of War games, youll feel right at home. Youll be roadie running through various corridors, hopping over barricades, pumping thousands of rounds into bullet sponge enemies, and maybe chainsawing a few of them in the process. This is the Gears of War weve come to love over the past ten years. That being said, there have been improvements to the overall flow of combat to make things more streamlined and enjoyable. For example, while in cover, if someone is directly on the other side, youll be able to drag him over and put a knife through his skull. Same goes with jumping over the cover; instead of being in a vulnerable situation, a quick leaping kick will leave an opponent open for a brutal execution. When successfully pulling this off, its immensely satisfying, but be careful; later on in the campaign, enemies are fully capable of doing the same to JD and his friends.Theres also a slew of new weapons to play with. Because this is twenty-five years after the events of Gears of War 3, technology has advanced relatively quickly, with robots and, for a lack of a better word, futuristic weapons being easily accessible. Theres still the Lancer, Gnasher, Hammerburst and various others at your disposal, but its the new kinetic weapons that make things interesting. For example, the EMBAR is a charged up sniper, the Overkill is an automatic shotgun, and our personal favorite, the Enforcer is a fully automatic SMG that tears through machinery with ease. Theres also mining equipment that feels pulled straight from Dead Space, such as the Dropshot, which propels a grenade forward to dig into the ground, and the Buzzkill which throws out ricocheting saws that will rip through anything and everything. Some weapons dont make an appearance because of obvious reasons, such as the Gorgon submachine gun, the One-Shot heavy weapon, the Scorcher Flamethrower, and various others. Some of them can be found in multiplayer, but for timeline purposes, they seem to be scrubbed from history. Suffice to say, while some weapons have been removed, they make way for some far more intriguing additions. The new set of weapons goes to serve the improved destructibility thats spread all across the world of Sera. Very few objects in the campaign are unbreakable, as a hail of bullets will generally pick apart most geometry. Best yet, there are various spots where, breaking down a small barricade can lead to a rather exciting fireworks show of destruction. Most of the time these are placed during Wind Flare events, which are a huge factor to combat, curving specific projectiles and even pushing anyone who tries to stand still. Unfortunately, a lot of combat shows how little The Coalition wants to move away from the Gears of War formula. For example, the new enemy, The Swarm, are similar to the Locust in almost every respect. The Juvies are quicker and more agile Wretches while the Swarm Drones are well, Locust Drones with new skins. They even come out of holes in the ground, but instead of being Grub Holes, theyre now Nests. Fortunately, they do serve a purpose, as once theyre plugged up, they can be used as trench cover. While a lot of the enemies resemble that of the Locust, there are some newer ones, such as Pouncers, Snatchers and Carriers, which act as unique and exciting additions. When one of them make an appearance, you know there will be trouble.One of the most disappointing aspects of Gears of War 4 is the implementation of Horde Mode mechanics into the campaign. This doesnt occur too often, three times to be exact, but they become increasingly tedious. Now granted, Horde is one of the best parts of any Gears of War game, but its only fun because its a four-player cooperative experience that can last hours on end. While having to set up limited defenses around a perimeter in order to defend a specific location can be a nice change of pace the first go around, after the second and third time, it becomes incredibly monotonous. Its like another Xbox exclusive, Sunset Overdrive, where the core progression and mission structure is highly entertaining, but for whatever reason, tower defense-esque mechanics were spread throughout the campaign. If these were optional, they wouldnt be that big of a deal, but they are sections of the story that become dreaded. At the very least, the final event does throw the full accumulation of enemies at the team, but even then, its something best handled in Horde instead of a campaign that doesnt mandate cooperative play. This brings us to what Gears of War has essentially become best known for over the last eight years: Horde Mode. While the campaign is a bit of a disappointment, its this cooperative experience that will keep players coming back for more. This mode is all about surviving waves upon waves of enemies as they become increasing more difficult as you progress. It goes up to 50 stages, and youll need a team of five coordinated individuals to get anything done, as even a fifth of the way through can be a challenge. Players will have access to a Fabricator, which can generate any defensive item you can think of, be it an automated turret or barbed wire fence to help slow down the oncoming hordes. In order to build these devices, when players complete a kill on the field, they will drop Power points that need to be deposited back in the Fabricator, and the higher you progress, the more capable and expensive these defenses become. These machines dont last forever, though, so this is where the specific classes come into play. For example, the Engineer can help repair anything damaged at a cost, the Heavy brings a bigger arsenal and a bonus to turrets, the Scout collects double Power, the Sniper allows for weapon upgrades, and finally the Soldier is just a standard class with little benefits. With ten maps and five different classes to level up, Horde mode is better than ever and is the shining highlight of Gears of War 4, provided you have friends to play with.Just as theres a cooperative experience in Gears of War 4, theres also a competitive one, as well, and its just as exciting as ever before. Making their return are Team Deathmatch, Guardian, Execution, King of the Hill and Warzone, with three new modes added to the fray: Dodgeball, Escalation and Arms Race. Dodgeball has similar rules to well, dodgeball where each team of five is given one life a piece, but if they get tagged, or rather killed, they need to sit out and wait for someone on the other side to be eliminated before respawning. It can be an intense match where even a five-on-one can be turned around in an instant. Escalation is essentially Annex but with a twist. Players will need to occupy rings across the map and hold them as their point meter will climb. The first to a certain value or the first to gain control of all rings will win a round. The catch is the respawn timer will continue to increase every round, causing death to be a meaningful factor; so while early on you may throw caution to the wind when trying to capture zones, later on, a simple mistake can mean the match. Through our time with multiplayer portion prior to launch, Escalation ended up being the most nail biting mode out of everything available. Finally, one our personal favorites is Arms Race. This mode is by far the most unique out of anything as, every three kills a team obtains, they will cycle through an assigned pool of weapons from strongest to weakest. Its a race to the finish as, the quicker a team gets ahead, the more of a disadvantage they become weapon-wise. Its a fast paced and gripping multiplayer mode thats a welcome addition to the already impressive lineup. If youre someone who enjoys the competitive side of Gears of War, theres a lot here to be happy about here.Closing Comments:Gears of War 4 shares similar parallels to Halo 5: Guardians; it has some of the most entertaining cooperative and competitive multiplayer modes available, but its narrative is lacking. Its not just the short length, but rather the closed off world building and insignificant character development. It says something when you cant remember the name of one the characters that stays with you for the entirety of the campaign. That being said, there are some absolutely enthralling moments throughout the adventure that will leave you on the edge of your seat and grinning from ear to ear. Even with some ill attempted implementations of limited Horde Mode mechanics, the campaign is an action packed adventure from start to finish that doesnt skimp on the exciting set pieces. In the end, it all comes down to the multiplayer as Horde is still one of the best modes available in any game, turning a simple wave based survival experience into something much more. Thats not mentioning the competitive side of things as there are three fantastic new additions that should vary up combat in exciting ways. Dont go into Gears of War 4 expecting a thought provoking story; go into it for its action packed scenarios, superb multiplayer experience and top tier shooting mechanics.", "date": "October 6, 2016", "grade": 4.0}