{"name": "Aragami", "ref": "https://hardcoregamer.com/?post_type=post&p=229108", "text": "Be it the necessity for strategy, the will-he-wont-he tension garnered from an AIs FOV, even something as basic as winding round environments like a snake (trust me no pun intended, that was literally the first metaphor that came to mind), Aragami pays homage to a time when the stealth genre was all about the sumptuous joys of getting from A to B even if, back then, the technical feats were a lot less organic. But its with notable entries like Chaos Theory, Snake Eater and even contemporary newcomers like Dishonored thatve cemented stealths continuing love of improving, even reinventing itself beyond the mere act of simply memorizing enemy patrol routes. Lince Works may, deliberately, be stripping back from all that organic evolution and scale of player liberty, but it goes without saying that even at its most simplistic on a structural and design stand-point, Aragami is a fascinating look-back on classic stealth  revamped for a post-modern, concurrently-nostalgic era of games.Aragami puts you in the shoes of an oriental undead warrior, resurrected by a mysterious maiden who tasks you with rescuing her from the clutches of the Kaiho  a well-equipped, brute-force army, imbued with the power of light. Fortunately, by fitting contrast, title character Aragami is reborn with the power to manipulate shadow  meaning that the slinky, ninja-like elegance present in the characters animation is even more graceful thanks to the ability to blend into shadows and become (aside from close proximity) invisible to the human eye. Be it teleporting between two shadows (regardless of the surface or even height in certain aspects) or even creating shadow on a whim, Aragamis greatest strength is, unquestionably, in its ability to make this most classic of takes on a renowned genre, feel fresh again thanks to this core mechanic of shadow manipulation.Of course you still have your perfectly-disguised enclosed spaces with their allotment of corners, waist-high objects and, obviously, patrolling guards but Lince Works level design still shines at points with its fractured displacement of light and dark, making movement feel as much like escaping a labyrinth as it is constant enemy surveillance. Later chapters especially show a satisfying degree of inviting (warranting even) player experimentation as levels become more elaborate and the seductive allure of secret routes and hidden paths become a necessity as opposed to an optional nicety in solving its, admittedly safe and at times artificially-lengthening, objectives. Naturally it wouldnt be a stealth title without a degree of challenge and sense of impeccable odds and Aragamis core mechanic makes sure to balance these perks with consistent risk, your shadow-manipulation working essentially like a meter that depletes with every use. Nearly all of your characters abilities are governed by this one bar, be it carving out temporary shadows that slowly fade back out of existence or even jumping from one shadowy area to the next. For those who arent careful and  as the games loading screens delightfully offer up  plan out both the use and inevitable recovery of shadow energy, will find themselves flung back to the start many a time over. Yet for a game that on early chapters, structures itself like those classic of block-by-block stealth sequences, Aragami does a great job at not so much masking its somewhat simplified structure, but translating its supernatural premise of light and shadows into gameplay terms  repurposing the concept of sneaking into something thats both interesting to tackle and more importantly, very enjoyable to get right. More so when you accidentally slip up  getting spotted and thus activating the designated alert status  and mustering the right amount of finger-twitching, button-pressing to flee from one safe shadow to the next, using ground, walls and mountable surfaces to outmanoeuvre enemies.Thus, for a game that could be confined, in premise, to simply keeping out of close-range and out of AIs line of sight  preventing you from recovering lost energy until youre back in the comfort of the dark, even punishing you should you veer too close to strong light sources by draining your meter  theres a surprising level of self-awareness Lince Works show in recognizing that stealth should be as much about a willingness to experiment with navigation, as it is about merely timing your movements well. As mentioned, later chapters open up with a greater emphasis on verticality in its level design and its here that Aragamis fusion of considered movement and careful stealth fittingly stands out. Be it the Deus Ex-style underground tunnels, building interiors that cut through the more wider (and prone to vulnerability) spaces, even the necessity to sneak across rooftops at the expense of possibly being picked off by a long-range archer.Those keen to take the more non-lethal, undetected (and thus more challenging) run as I did on my first-playthrough, will relish the games variety of potential path-carving while at the same time not explicitly, blatantly making its more secretive of routes blatant, thus maintaining that sense of accomplishment in when actually discovering it. Coupled with its sharp, cel-shaded art-style  which gives player-characters and even the World itself a striking clash of crisp foreground color and watercolor-like backdrops despite the ocassional low-resolution texture and low-polygon chunk of the environment  Aragamis more methodical and elegant pacing befits the all-round considered use of space which itself expands even into the very user-interface  all of which is carefully and wonderfully encased in the player-characters cape. Its hard not to repeat the Dead Space comparison when Lince Works do a great job at putting all player inventory and statistics into such a small space meaning the on-screen moments are left to the environment and the gameplay on show. Sadly not all of Aragamis core components deliver the same kind of free-flowing elegance portrayed through either the gameplay or the all-round aesthetic. And while [game engine] Unitys ocassional hiccups when loading up assets on entering a new area can be passively waved off, the same cant be so charitably offered for some of the visual and audio cues provided both in and out of cutscenes. Whether its the stiff facial expressions to some characters or the way dialogue constantly flickers or even cuts off completely  both main characters and enemy conversations horribly off-sync with the dialogue at times  those who look a little deeper into Aragamis pre-programmed sequences will find a fair few rough edges. Frame-rate can also see an unfortunate dip in quality with some chapters slipping to the low-40 range playing on PC and at one point  specifically during the final boss  where it can drop to as low as 20FPS when a lot is actively happening on-screen.Other, though smaller criticisms, lay with the gameplay mechanics themselves. One of which is the manner at which selecting shadowed regions to jump between (of which can only be accessed if at a close-enough range) can at points be a struggle to activate  at times requiring the most minute of positioning, which doesnt help when one is suddenly spotted. It can become increasingly frustrating when its a wall thats been attempted to mount only to have your character either fail the jump or die altogether. Another frustration is the progression of certain acquirable upgrades which, based on their position, are oddly placed to say the least. A notable example, regardless of your play-style though more pressing if you decide to go non-lethal: the fact a decrease to the shadow meters recharge time is locked behind what many would consider as a more lethal-focused perk, comes across as an odd oversight. Closing Comments:Despite the occasional dips in performance  be it visually or aurally  and the rather unavoidable slip-ups with its 3D animation not quite flowing as majestically, Aragamis methodical and gracious pacing offers an interesting tale on stealth based on more than just the merits of its unique shadow-manipulation mechanics. With a sharp art-style, a delicately-chosen color palette and an intricate touch to level design  that, bound together, makes impressive use of space and layout to feel as much a self-administering challenge in of itself to explore and pick apart, let alone merely navigate  Lince Works take (as much lofty addition) to the classic stealth formula does a commendable job at paying homage without simply retreading tired-old ground.", "date": "October 5, 2016", "grade": 3.5}