{"name": "Deus Ex: Mankind Divided  System Rift", "ref": "https://hardcoregamer.com/?post_type=post&p=228732", "text": "It has been just over a month since Deus Ex: Mankind Divided hit store shelves and already Square Enix is not only releasing brand new story content for the game, but charging for it. When other RPGs such as Dark Souls 3 and The Witcher 3 take close to half a year before new content starts rolling out, or even Destiny which is basically an annualized franchise at this point, Eidos Montreal is wasting no time getting the ball rolling. The first is more of a throwback to Human Revolution than anything else out there as Adam Jensen is approached by former colleague Francis Pritchard, a somewhat egomaniac individual who worked for Sariff Industries under their cyber-security division, who is in need of some help. Since Jensen is in Prague, it only seems right to help an old friend, even though that means breaking into another Palisade bank and hacking into their servers to recover valuable information. While this brings Jensen to yet another location with a plethora of possibilities, System Rift seems to suffer from a lot of the problems Mankind Divided had.Access to System Rift can be found in Jensens Stories, a subsection in the main menu instead of integrated right into the core experience, and this can be a bit puzzling. The big concern with a piece of DLC coming out so quickly is whether or not that content could have been implemented as a side quest. The answer isnt entirely clear as the location Jensen heads to in the world is brand new, but quite limited in scale. It could have easily been added as an optional train ride, similar to that of one of the earliest missions in Mankind Divided. Its a very sectioned off location, to the point where Jensen doesnt retain any of his abilities, and is instead left with a handful of praxis kits and weapons. To a degree this brings out the best in System Rift as our protagonist becomes far more vulnerable, especially if youre used to a supped-up, post-game Jensen, so working around the limitations becomes a thoughtful challenge. At the same time, it would have been great for everything that occurs in System Rift to count towards the overall progress, as in the end it feels unnecessary. Similar to Mankind Divided, the biggest problem with System Rift is the story. It does incorporate everyones favorite Pritchard and even brings in The Breachs ShadowChild in a small visual role, but other than the catering to Human Revolution fans, theres not a lot of intrigue surrounding the plot. Pritchard approaches Jensen in hopes of obtaining help accessing servers within a new Palisade location so he can steal some information, but nothing ever goes as planned. Surprise surprise, Palisade isnt the shining beacon of hope theyre made out to be, but we already knew this from playing through the main campaign. Whats here is well written and acted, but theres very little that expands the Deus Ex universe that we didnt already know.Probably the best part of System Rift, though, is the multi-floored Palisade office thats constantly being patrolled by armed guards, with some office workers spliced throughout. This is an interwoven location that requires a good amount of skill to get through, and even more so, contains plenty of exploration potential. After getting past this, though, things drop off a bit. The next areas are a little more unique as everything is heat sensitive, but it fails to utilize on the massive possibilities. There are simply turrets and drones that are setup to catch intruders, and blind to anything that radiate immense heat. Theres conveniently placed barrels and panels on the ground that hide Jensen from these mechanical death machines, but it would have been far more intriguing trying to avoid humans, some equipped with goggles that pick up only heat, and other regular guards. It seems like a wasted potential that could have led to some frantic moments. Jensen also goes into a terminal, taking over an avatar to solve a number of puzzles, similar to that of when Jensen had to impersonate Jim Miller in the story. This is one of the more interesting portions of the DLC, having the utilize a certain ability to uncover invisible platforms, but its over far too quickly. Closing Comments:System Rift is a short but sweet experience. Mankind Divided itself wasnt incredibly lengthy, but when you take into consideration the last piece of post-release DLC we received in the Deus Ex universe, The Missing Link, this is far less appealing. The core content will run roughly two hours in length, with exploring every room and area extending the playtime by another hour. Fortunately, the general setup is well done. One of the biggest issues with Mankind Divided was the quest structure and progression, as the only mission that left a mark was Golem City. If this was somehow implemented within the main game, it would have been one of the more memorable missions. Thats not to say its without its flaws, though, as the latter section felt underutilized for the amount of potential there was there and the story lacked any satisfaction. Had Eidos Montreal added an extra couple of sections or puzzles, System Rift could have been something great.", "date": "September 30, 2016", "grade": 3.5}