{"name": "Sonic Boom: Fire and Ice", "ref": "https://hardcoregamer.com/?post_type=post&p=228092", "text": "Sonic Boom: Fire and Ice is the third game to be released in the Sonic Boom series. While Fire and Ice isnt reminiscent of the original Sonic games, it does encourage players to explore as well as play through stages in the quickest time possible. Fire and Ice has also done its best to fix some of the complaints players had with the previous 3DS title, while also trying to make it as enjoyable as possible.Fire and Ice does not offer much of a story for players to get invested in. While Sonic games have never needed much story to make them fun, this one in particular is forgettable. The story has Sonic and friends chasing down a mysterious robot called D-FEKT, while also trying to figure out the cause of huge fissures appearing around the world. In the midst of chasing down this robot, Eggman makes appearances as a minor antagonist. Instead of trying to fight the Sonic team, he continually challenges Sonic against various robots, trying to prove once and for all that Sonic is not the fastest thing in the world. The story has no real impact on the levels themselves, besides leading to the occasional boss fight against large robot enemies. While the dialogue might occasionally get a chuckle out of older players, its likely only younger audiences will find enjoyment in the simple story. Fortunately for those who dont want to sit through cutscenes, players are able to skip them and jump right into the stages.The main newest addition in this Sonic Boom title is the fire and ice abilities, highlighted in the title. While playing through levels, players can press either the L or R buttons to switch between having a fire or ice element surround their character. These help to solve environment puzzles that appear throughout the various stages. If the player should come across a water platform, they can use the ice element to freeze and run across it. In the same way, players can change to the fire element and melt ice that blocks their path. Its a nice addition to the otherwise linear gameplay, as players have to pay attention to what is ahead so they arent stopped by spikes or walls in order to continue moving forward at a fast pace. There are five different level types experienced while playing Fire and Ice. The main two are side-scrolling levels that have you either participating in a race against Eggman or running through a more traditional 2D Sonic layout. While the races can only be played as Sonic, the other 2D levels can be played as Sonic as well as any of his friends. While it may seem quickest to just run through a level as fast as possible, players are encouraged to explore as every character and look for collectible items and challenge zones. Levels will typically have 2 or 3 different types collectibles that are used for additional bonuses in-game for players who collects all of them. Some of the bonuses include unlocking the soundtrack, new hammers for Amy to use and bonus artwork of the characters.The characters available in most levels includes Sonic, Tails, Amy, Knuckles and Sticks. Throughout the main side-scrolling levels players will switch between these characters and use their unique abilities in order to access secret areas. Sonic blasts through blockades, Tails can fly and use a blaster, Amy uses her hammer to to slam down pillars, Knuckles digs through certain areas of dirt and Sticks throws her boomerang to hit switches and collect far away items. This setup, however, led to one of the key flaws in the overall level design. Each character is given their own introduction level, which teaches you about their special abilities. Outside of these levels all the characters, aside from Sonic, end up only being used to access secret areas which makes them feel shoved to the side in favor of Sonic. It would have helped add to the variety if these characters were given more levels geared towards their abilities instead of focusing entirely on Sonic. Three of the five level types available are optional and dont need to be completed in order to progress through most of the story. In two of these level types, players will control Tails in either a submarine or boat as he tries to find a collectible card before the time limit is up. The fifth level type has you playing as Sonic in a third person perspective as he runs through a cave while avoiding obstacles. These third-person Sonic levels only allow you to move left and right, collecting coins and trying to reach the end. While the Sonic levels can be quite enjoyable, the Tails levels typically felt slow-paced and tedious when compared to the fast-paced stages.Even with the optional levels, Fire and Ice is incredibly short. If a player goes through without searching for the collectibles, they could likely beat it in just a couple hours. Another big issue is that before long the side-scrolling levels start to feel a bit stale. While the flow of levels tends to make them satisfying to play through, there isnt much variation between levels to keep them feeling fresh. Even later levels dont seem to get more difficult, but instead just extend the length of each stage. There are also a handful of boss fights, which has players automatically switching between Sonic and one other companion while fighting a robot enemy. These are incredibly easy, however, as the bosses all have very predictable attacks. The music in Sonic Boom did a good job fitting the atmosphere of the levels as you played through them while also being pleasant to listen to, but none of the tracks stood out as being particularly memorable. The 3D function is also enjoyable in each stage, making the background details pop more with the 3D turned on while playing and adding more depth to the surroundings. While the details and backgrounds are very appealing, they tend to get overlooked as players find themselves speeding through levels and focusing on whats ahead.As stated previously the multiplayer was unable to be tested for this review, but players can still purchase items that are used for multiplayer since they can also be used in the single player racing levels. In each stage players can collect an ore called Ragnium, which is used as currency, by defeating enemies and challenges. With the Ragnium, players are able to purchase racing bots to challenge Eggman in the various racing stages. Aside from the bot parts, Ragnium can also be used to buy concept art from the Sonic Boom television show and games. Closing Comments:Sonic Boom: Fire and Ice has a forgettable story and some rather tedious, but optional, side missions. While the main 2D levels can be fun, they start to feel repetitive before long. Even if players go out of their way to find every collectible, the overall game length is too short. There was clearly work put into improving from the previous Sonic Boom titles, but it still leaves a lot to be desired in order to make it feel more like a solid Sonic title. If SEGA wants to continue the Sonic Boom series and be successful, they will need to be willing to add a little more variety, as the fire and ice arent quite enough to mix up the formula.", "date": "September 28, 2016", "grade": 3.0}