{"name": "FIFA 17", "ref": "https://hardcoregamer.com/?post_type=post&p=228398", "text": "Annualized sports games are nothing if not safe. Year in and year out, they more often than not take what is given to them, add a few bells and whistles and push out something that feels more or less like last years model. Theres reason for this, no matter how large a team is or how much money is throw at them, most sports games are made on nine month timetables which the quickest turnaround youre find for any game, big or small, in the industry.If you look at the history of FIFA franchise, every years iteration has a few tweaks and added elements here and there, but nothing that has messed with the formula too much. Last year saw the addition of womens international teams, but nothing has really transcended the game since the introduction of FIFA Ultimate Team in 2009. This years new single player narrative mode simply titled, The Journey, is the biggest step forward for the franchise in a long time. Taking inspiration from the NBA 2K series and combining it with a campy but still lovable sports story has made FIFA 17 the something that the series hasnt been in the past few years: fresh.The Journey isnt something that was haphazardly thrown together to check off a box on some arbitrary stat sheet about what sports games should or shouldnt include. Instead, it is an incredible ode to the cheesy sports films of yesteryear. Outside of NBA 2K, single player game modes in sports games have been a little stagnant for the past few years. And when the onus is on EA to put as many resources into its money making, microtransaction laden online game types, its uplifting to see them put together a well crafted story mode. Much like in Tony Hawks Underground, The Journey allows you, as the 17-year-old Alex Hunter, to control his career and how it effects his relationship with his family and friends. From signing an endorsement deal, to working hard in training to make the starting 11, The Journey does a great job of making the grind of becoming a world class player both captivating and endearing. Mixing in subtle RPG elements and a Mass Effect style choice wheel, gives you the ability to make Alex feel like your own, while still seeing his dreams of becoming a football legend play out. The gameplay in FIFA 17 hasnt changed too much from last year and thats not a bad thing. FIFA continues to be the quick arcady rush of fun it has always been, while still allowing you to bypass the nuance and munition that comes with an overly realistic depiction of the game. Certainly this years edition of PES far and away surpasses FIFA when it comes to faithfully recreating the ins and outs and feel of moving the ball around the pitch, but thats not really what FIFA is striving for. FIFA is attempting to make playing a match of virtual football as exciting and action packed as it can. Its why so often you see one pass cut through the entire midfield. Not because that actually happens all too often in real life, but because its fun to counter attack, pick out a man and put them through on goal. While all of this might seem like its taking away from the realness of a football sim, its replacing that authenticity with more fun, high paced action.Along the same lines, there has also been a few noticeable changes in some central mechanics. The way set pieces are put together has been altered in a way to give you more control over free kicks and corners. Awkward situations, where a chance might fall victim to curling a ball too close to the keeper, have been remedied for the most part and offer you more chances to be creative from set pieces. While this might seem like change for changes sake, its these little variations that make FIFA engaging to play for a full 90 minutes.The insertion of the Frostbite engine into EA Sports titles as a whole hasnt had too much impact on the overall gameplay, but it has made animations and character models look much better than in years previously. In the Premier League specifically, player faces are filled with expression, that make celebrations after goals and replays of crunching tackles feel more vibrant than ever. Some players from other leagues on smaller teams dont get the same kind of treatment and do at times look a bit dead in the eye, but this number is far outweighed by the number of players who look excellent.Presentation in FIFA 17 is actually one this years biggest let downs. Despite having the licenses to nearly every league in the world, EA Canadas choice to focus on only the Premier League leaves a lot of clubs from smaller leagues around the globe in the dust. Out of the number of stadiums, the vast majority are Premier League clubs, which if you want to run a season with say an MLS club takes a lot of feel out of derby game when youre forced to play in a knockoff stadium. This lack of heart and soul goes double for the commentary team of Martin Tyler and Alan Smith, who it seems took the year off, as the spit out the same lines that have been present in the game for the past few years, only changing it up ever so slightly for a anecdote about last year, that only serves to break up the audio monotony that Tyler and Smith provide.Online modes have been left unchanged for the most part. Solo and co-op seasons havent had any renovations, while FIFA Ultimate Team has seen a few bright developments to make the game mode more friendly to those of us who dont want to shell out real life money on packs. The Draft, which was introduced last year, has seen itself influence other parts of the game, including the Squad Building Challenges which have you building teams under certain conditions for prizes. Its a small thing, but for those of us who like to chemistry aspect of FUT, being able to earn rewards for build unique teams adds another element to the fun of collecting cards.Closing Comments:By and large, sports games are an easy year in and year out moneymaker for a lot of companies who have a stranglehold on their market. From the MLB to the NFL, it wouldnt be too surprising for these franchise to just rest on their laurels and watch the money pile in. This is what makes FIFA 17 so special; instead of churning out the same old rehash of last years game, EA Canada has chosen to add a whole new element to their soccer sim. From the fast fluid gameplay, to Alex Hunters story, FIFA 17 puts together everything into what has to be the most complete package of football that weve seen to date.", "date": "September 28, 2016", "grade": 4.0}