{"name": "Sushi Striker: The Way of Sushido", "ref": "https://hardcoregamer.com/?post_type=post&p=301715", "text": "Originally revealed back at E3 2017, Sushi Strikers saw a bit of a mixed reception during its announcement at the time. Some were confused about it, otherwise were upset it was so heavily advertised as a brand new series for Nintendo while some saw the potential in the unique sushi-puzzle combination. The title saw a good amount of silence after that, but finally reappeared with an announcement trailer towards the beginning of this year to much more welcoming reception along side the inclusion of the title being released on Switch and the previously announced 3DS. Now that players have gotten to see the sushi in full action, just how well do the puzzles work out for this striking entry to Nintendos library?A good many years ago, war broke out in the world between the Empire and Republic. The Empire wished to keep the wonderous, delicious taste of sushi to themselves while those of the Republic wanted to share it with the world. While both sides fought long and hard, the empire eventually won and locked the secrets of sushi away for themselves. Many years later Musashi, a young child who has grown up in an orphanage, is out gathering food for the other hungry children when she meets a mysterious man by the name of Franklin who offers Musashi sushi to eat in exchange for their time. Having never tried sushi, Musashi immediately falls in love with the delectable taste of fish and goes along with Franklin with the hope of feeding it to anyone they can. Unfortunately soon after Franklin is captured by the Empire for being a sushi striker, leaving Musashi behind. Left all alone, they hear a voice calling to them and follows it to a shrine where a Sushi Sprite by the name of Jinrai. He informs Musashi that they are a Sushi Striker, and capable of participating in sushi battles with his assistance. The two join forces to help save Franklin, and continue the journey to feed sushi to the world.Sushi Striker is very simple to start, as puzzles are simply based on matching similarly colored plates on moving conveyor belts as quickly as possible. Musashi can connect any sushi plates that are touching or have no others between them, and can build up a combo for seven seconds or until the sushi plate touches the edge of the conveyor. After that, all of the sushi is eaten and then collected in a stack in front of Musashi. These plates can be thrown at the opponent do damage them, and the match will continue until one or the other has lost all of their health. The trick is that each opponent will have their own unique set of sushi sprites just like Musashi, who offer different abilities during battle for them to counter. Some will offer a temporary shield, others will deal direct damage and some may even put up a wall that cannot be penetrated until a stack of plates is a certain height. Higher stacks of sushi will do more damage, in addition to some plates having a higher damage output than others. Its all about quick thinking, but there is a good amount of build up to more difficult levels for Musashi to get used to.Progression is entirely level based, with each one offering a more challenging opponent than the last. Musashi and their sushi sprites receive exp after a win or defeat, with leveling up increases sushi strength and health. Defeating an opponent also rewards stars and a rank that are given based on overall performance. Stars are earned by completing objectives in the much, such as defeating the opponent under 95 seconds, while the rank is simply based on score. The highest possible is an S rank, while the lowest is a D, but doesnt hinder progress if receiving a low score. The stars are worth collecting in each world, as at the end if Musashi has collected enough they will unlock bonus levels that will lead to a special reward when completed. As players progress they will unlock new items to help them during each fight. Some will heal Musashi once if they fall during battle, while other equitable items will increase or decrease the speed of the sushi to help accurately increase the combo. Towards the beginning players also begin earning sushi they can choose as their favorite, which will in turn give them even more bonuses during fights. There is even an item that will increase the score at the end of a fight, at the cost of half Musashis health making for an extra hard challenge. With a wonderful amount of variety, there are tons of ways to approach combat and decide what works best for each person.Outside of regular sushi battles, there is also the puzzle hut which challenges players to quickly make just give moves and eat all the sushi on the small arena in order to defeat the opposing robot. Time decreases every round, but winning enough in a row will reward Musashi with a prize to take with them. Musashi can also visit the Sushi Sprite Shrine where a maiden there will bless them with a Striker Rank. Musashis rank will increase as they complete triumphs, which are a bit like achievements for meeting certain requirements. Increasing ranks will also give Musashi new gears to use which helps the flow of battle in their favor. This same area is where players can play locally or online to challenge friends after unlocking them through the story progression, which offers normal or chaotic modes for those seeking to improve their skills in sushi mastery.Cutscenes in Sushi Striker are generally played out in wonderful visual-novel style dialogue boxes with the characters interacting above it. During important moments there will be a fully animated cutscene that seems straight out of a Saturday morning cartoon. These are so wonderfully animated that it momentarily feels like watching a cute childrens show before it ends and starts the sushi fighting once more. Aside from the backgrounds in some scenes, nearly everything is lovely 2D art that fits wonderfully and comes across as delightfully pleasant. Add that with an enjoyable soundtrack that matches well with the cartoon vibe and it creates a wonderful setup all around.Like most puzzle titles, Sushi Striker does suffer a bit from feeling a bit repetitive after a while. While there are some good ways to mix things up, every match feels very similar without too much variety overall besides increasing difficulty. It can also feel a little bit grindy at times, as going back and playing old levels is occasionally required to level up sushi sprites and Musashi in order to feel prepared enough to move forward. Fortunately replaying levels tends to be worthwhile in order to earn more achievements, but for those wanting to push forward quickly to unlock multiplayer it can be a bit slow. Those playing on Switch will also notice that docked controls dont feel as fluid compared to handheld mode with touching, which is fine for many but can be a bit disappointing for those who prefer to play on the big screen.Closing Comments:Sushi Striker is a new type of puzzle title that is fast-paced and requires a great deal of accuracy along with many different strategies. There is no wrong way to play, with many different paths to becoming a strong Striker that can challenge those who stand in the way of sushi. Theres a great level of challenge to be had, but it lends itself well to those who might be beginners to this sort of puzzle entry and eases people into every new mechanic along the way. With a wonderful cheerful story and plenty of enjoyable moments, Sushi Striker: The Way of Sushido is a near-instant classic for the puzzle genre and an absolute treat to play.", "date": "June 10, 2018", "grade": 4.0}