{"name": "Neon White", "ref": "https://hardcoregamer.com/?post_type=post&p=424234", "text": "This Sunday marks the beginning of Summer Games Done Quick 2022, a charity event showcasing some of the best speedrunning that the world has to offer, all for a good cause. During the runs and in between them, well get looks at all of the various strategies and tricks used by speedrunners, providing a little education for those who might wish to give speedruns a try. I never thought I could do it myself, if only because Id never find the time to devote so much attention to a single game. But after playing Neon White, the new game from Annapurna and developers Angel Matrix and Ben Esposito, Ive learned thatI still wouldnt be good at professional speedrunning, but darned if this game isnt 200 MPH blast of sheer action that didnt make me feel like I could dabble in speedrunning while playing it.Its likely just a coincidence that Neon White dropped during the same month as SGDQ, but if it were deliberate bit of marketing, then whoever decided on this bit of synergy deserves a raise (it would be shocking if it didnt appear as a sponsor during the event). A first-person action game with an emphasis on speed, gunplay, precision and parkour, the game has immaculate level design, with each stage (or job) designed to have you looking for all of those strategies, big or small, in order to same time. A jump up the stairs here, an enemy defeated with a different time-saving weapon there, all designed to have you figuring out how to perfectly shave that second or two of your run time so that you can earn a new medal. The end result is this combo of action, shooters, platformers and puzzle games all wrapped up in a beautifully-insane anime style and plot that makes for one of the years most unique experiences.The game follows our title character, a sinner plucked out of Hell known as a Neon and chosen by Heaven to help get rid of a demon infestation, competing with other Neons for a shot of the grand prize of being able to remain in the resort-like holy afterlife. White finds things taking a turn for the strange when they enter with amnesia and cant recall their past life, however, followed by encounters with other Neons who claim to know him. And then theres the Frankenstein-like returning champion, Neon Green, and the fact that Heavens resident Believers seem to be a bit on the sadistic side, and eventually White finds themselves using the competition in order to find some answers as to whats going on. To help get some of these answers, White will have to talk with his old crew  now known as Neons Red, Yellow and Violet  as well as some of the local angels, such as Rax the bartender and Mikey, the big boss who hands Neons assignments. To do so requires collecting presents, which only appear in levels after completing them once and earning a bronze medal. Theyre all hidden away, though, which is where Neon Whites focus on speedrunning basically enters the out of bounds area, having you save weapons for certain points in order to have the skills necessary to backtrack and/or divert from the normal level path in order to find the present in each level. The end result is a series of fun challenges leading to unlockable dialogue events, items for Whites room, past memories and even more levels in the form of sidequests (providing even more fun challenges).But to emphasize just how masterfully Neon White weaves speedrunning into its gameplay, one only has to look at the other medals one can earn by beating certain times in each levels. Get a silver medal, and you unlock a ghost version of White from your last run the moves alongside you, allowing players to try and race to the end against themselves. Gold medals, meanwhile, not only instantly increase your Neon Rank  necessary in order to unlock new missions as the game progresses  but also unlocks a hint located in the level, marked by a floating symbol, giving you a clue about where you can go to shave off a few seconds. Finally, the Ace award  the top honor  unlocks the leaderboard. Thats right, unlike most games which already put you on the leaderboard after each level, here its something earned, as if to say great job finishing that level in a flash, now youre ready for the big leagues.Neon White simply excels in crafting a fast-paced action game around speedrunning, with quick levels  most lasting under a minute  that are still filled with so many Eureka! moments as you realize how you can possibly zip through things quicker each time. But even without a hefty emphasis on speedrunning, Neon White would still be an astonishing action game on its own. The main hook is that each weapon you can use is represented via Soul Cards you can find in each level, which grant you new guns that can either be fired until ammo runs out or burnt up in order to have White deploy a special movement/attack still. And knowing when and how to use each weapon in the nick of time is the key to successfully making it through each level alive. Each level is beautifully crafted around all of these skills, with their Soul Cards (and occasional ammo) either dropped by various enemies or laying around along the way. Your arsenal grows to include a submachine gun that lets you do a ground pound, a shotgun that turns you into a fireball dashing in the direction of your choice, a rocket launcher that becomes a zipline, and more. Theyre all a blast to play with, but dont think that you can just fire them all willy-nilly, since one wrong move can waste a weapon and prevent you from, say, double-jumping up to a necessary ledge. You also have to figure out how to kill all the demons in a stage in order to unlock the exit, so you cant just rush through it or hoard weapons as well.The end result is that each new stage in Neon White relies on experimentation, having you burst out, get your bearings and likely die several times as you try and figure out all of the steps needed to blast away all demons in an efficient manor and get to the end in time (likely to the demons themselves, which come in a nice variety and have some impressive attacks that help create a worthy challenge). Maybe youll try and take it slow and figure out each step one bit at a time before any big runs or just charge right out of the gate guns/katana-a-blazing. Either way, each stage is the perfect size to provide a ton of action in what eventually becomes a short burst over time, and the Hotline Miami-style speed at which you can restart means that youre back into the fray in a flash after each death.It helps that even just moving around feels like a dream, with White moving at this perfectly swift speed, even gliding around (almost literally when on water that speeds them up, even), with many successful leaps even feeling like a grand flight, especially after a good rocket jump or ascent off of a newly popped balloon demon. Combined with the way you have White perfectly shoot anything to a sort of rhythm that you eventually have to nail down, Neon White has this graceful charm to it perfectly blended alongside its psychotic cast and mounds of bullets that go flying through the air, almost as if it were some sort of bizarre ballet. But no ballet is complete without stellar music and Machine Girls soundtrack is a delight. This might seem like an overly-narrow superlative here, but it truly is the exact music you would think of when figuring out what would play in the background of a lightning-fast gunfight between assassins and demons with Heaven as its backdrop. Its a perfect blend of late 90s-style pulse-pounding electronica, mixed in with this perfectly shimmering feel to it all, this divine blend of hyperactive chaos and chill serenity that somehow ends up working, a true delight for the ears and easily some of the years best music in video games. Backing up that auditory feast are the stylish visuals, which uniquely depict heaven in this somewhat vaporwave-ish feel, coming across as less of the typical utopia you might expect and more of a land filled with yacht clubs and luxury condos, all painted with with these calming color schemes. Naturally, this helps out cast of masked killers stand out more amongst them, and the demons even moreso, consisting of jet-black figures with glowing primary colors. It ends up perfectly highlighting the action even further, and also provides good visual highlights when it comes to spotting just where to go next.The story in Neon White is also an interesting one, filled with more than a few twists and turns as things progress. But even more story bits are are found during the more visual novel-inspired portion available in the central hub, providing a break as you use whatever gifts youd gathered to raise Whites Insight level for a character and unlock little bits of dialogue and a few key memories. A lot of them are charming, funny and well-written, boosted by a likeable cast of characters with great voiceover work (as an OK K.O. fan, points in particular for bringing in Ian Jones-Quartey in full Radicles mode to voice Neon Yellow).In terms of flaws, theres virtually almost nothing to complain about. There were a few cheap deaths, and my decision to play it on the Steam Deck meant using analog sticks that didnt give the same precision as a mouse at times, but again, things move so quickly and restarts become so instant that these rarely ever became a problem, especially when you hit that zen-like mode and get truly sucked in by the elegant chaos (and lest you think it moves too quick, theres well over enough content here to put any playthrough well into double-digit hours). Neon White is a gem of an action game, and the feeling you get when you score an Ace medal on your first try after honing your speedrunning skills throughout the game is the cherry on top. Closing Comments:Neon White isnt just a contender for the title of years best action game, but also a fascinating blend of genres, all mixed together to create a truly unique delight. The stellar level design, swift platforming and gunplay, and the terrific challenge in figuring out the optimal demon extermination route work together in harmony to make it a true heavenly delight, all set to a soundtrack that wont be leaving the heads of players anytime soon. Neon White isnt just a speedrunners delight, but a delight for any gamer in general, and it would be foolish to pass up something so sublime.", "date": "June 24, 2022", "grade": 4.5}