{"name": "Halcyon 6: Starbase Commander", "ref": "https://hardcoregamer.com/?post_type=post&p=226182", "text": "The ongoing popularity of the Star Trek franchise is something of an interesting phenomena. While the recent movies have been entertaining, observers note that they really dont capture the tone that garnered the series its fanbase in the first place. The realm of video games has treated the setting much worse, with a focus on blasting chumps. There are a few exceptions to this rule, but a series faithful video game is few and far between (fair note: I have not played Star Trek Online beyond a demo, something that will be rectified in the coming days). Developer Massive Damage, Inc saw the hole and are plugging it admirably with Halcyon 6: Starbase Commander.To say that the title draws its inspirations from elsewhere is completely fair and something that the developer readily admits. There is the exploration of Galactic Civilizations, the combat of a deeper JPRG, the base building ripped directly out of recent X-Com titles, all of which is informed by some sweet, sweet diplomacy. Frankly, the title feels like the aftermath of many sessions around a coffee table that featured numerous utterances of Wouldnt it be cool if It plays like the game someone always wanted to make.The game starts off with a tutorial that also sets up the story: humanity has discovered an artifact left by a precursor race. In the process of researching this technological boon, a base was erected around it. Through experimentation, a rampaging alien race bursts forth, laying waste to the vast majority of humans at the base, leaving the few lone survivors to put the pieces back together and survive on their own. The process of this tutorial is one of the few weak points of this title. The developer took great pains to keep the interface plain and understandable, and the buildable star ships are named after the class they would take in a typical fantasy game, such as knight, rogue, or paladin. Still, after selecting the starting officer to man the one available ship, little is done to explain exactly how to get more officers and how to exploit their talents. Admittedly, this does get figured out after a bit, but it requires a tad more fussing with the systems than should be required before it becomes clear. The same goes for the advantages of evacuating an estranged mining facility versus leaving the colonists there. Why would a player be compelled to lose an avenue for much needed resources by evacuating is something that is still not understood after hours with this title. Strange, as it felt like basics of exploring the nearby systems and gathering resources was a bit over explained. Even so, the tutorial isnt the worst. Its just somewhat less than ideal.The actual mechanics of the game soar with the stars, though. Players are left to their own devices to explore nearby stars, discover resources, transport them back to base, and close up portals that enemies open near friendly planets. These periods of resource building leads into the base building, which looks like an 8-bit version of X-Coms system. There are various areas to be explored and cleared out for use. When an officer is assigned, it will take days for the task to be completed. It could result in a ground based confrontation with aggressive critters, a moral dilemma that requires a player choice, or nothing at all. Once the spot is opened, a new facility can be built.This isnt to suggest that Halcyon 6: Starbase Commander is lacking direction. Oftentimes, story based elements pop up. Pirates might need to be cleared out of a local solar system, or a few alien races might stop by, one after the other, to convince the humans that the others are being sneaky. This is where the most interesting elements emerge. Diplomacy might seem simplistic, with reduced numbers of responses available when speaking to a representative of an alien race. This hides a much deeper system in play, though, as players need to learn who to count as friends and which species is looking to plant a knife in the back. Charming writing, stuff that is humorous without descending into lol, were so funny pandering makes each interaction incredibly interesting.Eventually, though, things do devolve into fisticuffs. (Lasercuffs?) The battles are turn based affairs that are typically very easy to win. The best advice is to assemble a fleet containing science, tactics, and an engineering ship, and keep them repaired. Should players do this, then battles are a simple matter of learning the enemies weakness and using the officer skills that exploit it. With the exception of the tutorial, there was never a time when it seemed that the fleet was doomed. Some ships might have reached critical status, requiring mid-battle repairs, but that was the worst of it. Its possible that extreme luck played a factor, but it seems unlikely. Closing Comments:Despite a few small details holding it back, Halcyon 6: Starbase Commander is one of those titles that cannot be recommended enough to fans of 4X games, JRPGs or space-based science fiction. So much attention to detail was poured into the game, with enough moving parts working together, that it feels like a sprawling epic rather than the indie title that its low-fi graphics might imply. Being a title loaded with humor, action and more than a small amount of reverence for its inspirations, Massive Damages title is one of the deepest indie titles to emerge this year.", "date": "Bohn on September 14, 2016", "grade": 4.0}