{"name": "DOGOS", "ref": "https://hardcoregamer.com/?post_type=post&p=224438", "text": "Theres an important difference between a challenge and a roadblock. A challenge is a difficult section of game that the player has most of the tools to get past, while a roadblock is one where its necessary to attain an entirely new skill level to progress. The perception of which is which tends to be down to player perseverance, but if the challenge is too hard and lasting too long it can become a roadblock even if the player eventually gets past it. Whether thats the fault of the player or the game, or even if its actually a fault at all, is a debate for another time, but a roadblock can have a major impact on how even the best game is viewed. DOGOS usually plays near the border between the two states, but when it falls on the wrong side it doesnt mess around.DOGOS is a free-roaming overhead-view shooter where youve got a plane armed to the teeth going up against an alien occupying force that isnt short on defenses. The Zeetnuk not only hold the planet but have built up a powerful military force in bases around the world, all the better to oppress humanity from. Desmond Phoenix is a member of the resistance and hes gotten ahold of an experimental top-secret fighter that would have been part of an unstoppable squadron. Due to a well-timed Zeetnuk attack on the development labs theres only the one untested unit left, because of course there is, and now its time to escape, regroup, and take the fight back to the invaders.The game opens simply enough, with a damaged aircraft flying down a canyon that auto-scrolls past. Steering is done with the right stick, rotating the level around you, and once past the initial short canyon section the left stick takes over strafing movement in all directions. The aircraft always points up and the level rotates around it, which takes maybe a minute and a half to get used to before becoming second nature. Fire with one trigger, drop bombs with another, and expend limited-use special weapons with a shoulder button. Theres no combo system to learn or complicated scoring method to master, but rather straightforward fight against an aggressive alien horde. It doesnt start out all that overwhelming, of course. A few nimble enemy ships and a couple of tanks are all youll see on screen at once during the early stages, and they just shoot bullets in a straight line now and then. Towers that activate when you get near shooting homing balls of energy show up next, followed by tanks that segment the screen with bullets, bigger aircraft with more firepower, laser-walls requiring proper timing to get past, and plenty of other ships, tanks, and traps in the alien armament. Levels quickly go from being able to be completed with maybe a single life lost to taking multiple continues on the first time through to complete, as both the number and type of enemies increases in a very satisfying battle to fight through.The levels themselves are equally creative, and while they tend towards high canyons connecting open arenas the action takes place in a nice variety of locations. Mountains and rivers, a lake with islands, deep underground in a lava-lit cave, open ocean with small mountainous islands, and of course the necessary alien base all look fantastic thanks to excellent art design moving at a super-smooth framerate. The enemies that populate them are equally detailed, and everything blows up in pyrotechnic displays ranging from pleasingly crunchy to how am I not taking damage from this white-hot fireball inferno? Venture into a an alien encampment with a full supply of three homing salvos and the air gets thick with laser fire, swirling missile trails, and firey alien carnage. Its a feedback loop thats hard to resist, and when DOGOS is blasting on all cylinders it plays as good as it looks. And then come the bosses, and here things take a turn for the worse. As DOGOS goes on the difficulty ramps up, which is to be expected, but bosses tend to be a marathon with no health bar to give you the slightest idea how far youve run. The levels have reasonably-spaced checkpoints that you can continue from on Game Over, but bosses have to be beaten on a single set of three lives. For the earlier bosses this isnt an issue, and even the longer run on level fives dual-form boss isnt so bad after learning his patterns, but level eight holds a monster thats game-stopping. This was almost a very different review, and if Id been playing for my own entertainment Id probably have quit after the 20th attempt or so, but bloody-minded determination and a desire to write this up properly won out in the end, albeit just barely.At the start of the level eight boss fight youre teleported to the middle of an arena where Warcore circles around behind a series of columns with an energy barrier running between them. Its constantly firing but the columns give you a break from the attack, and to begin with youve got no idea of where it is. Accidentally flying into a line of bullets is a matter of bad luck because of this, and it can cost a life before the fight begins. Shooting Warcore between the columns enough times causes him to enter the arena and break out one of his four attack patterns, and dealing it enough damage makes it go back behind the energy barrier to shoot at you from the arena outskirts again. You need to see each attack pattern twice before hes dead, and shoot it enough when its behind the wall to lure it out again. So four attack patterns twice, plus a behind-wall series of attacks between each one, means Warcore has 16 attack segments to clear on three lives. On the plus side there are a few popcorn-enemy ships darting about the arena most of the time with semi-decent odds of dropping a health-up, but on the other hand theyre also shooting back and are pretty decent at dodging. One of the optional level goals is for beating this boss under 10 minutes, which is maybe a bit much when taking into account how much practice it will take to clear and that the level getting to it is already a pretty good challenge for that stage of the game.And then Warcore eventually died, allowing progress to several excellent levels past it. The subway chase was an exciting encounter that made a great change of pace, and the next levels after focused on lots of enemies and meaty combat, as well as awarding the final two powerful weapons. The problem is that the amount of time spent on Warcore, aggravated and frustrated and just wanting it to go away so I could get back to the bits worth playing, made for a brutal roadblock instead of a good challenge. Theres a second ship to play as that Ill never bother testing out, because the one save file will get overwritten and fighting that boss again is right out. Honestly, with as much practice as I had it shouldnt be too hard to get past it again, but getting there was unpleasant enough that I just dont feel like bothering.Closing Comments:DOGOS is close to being a fantastic free-roaming shooter and only held back by a few small issues and a giant glaring one. A tank that shoots bullets that do no damage but reverse the controls? Thats an enemy made from the bad kind of pure hatred and spite, but theyre fairly scarce and go down with a few bombs. The giant underground fortress they start being a real problem in, on the other hand, is the kind of difficult that feels great to take on, with experience and skill being required to clear the barrage of firepower the enemies bring to the party. Levels are nicely lengthy without overdoing it, filled with set-pieces and plenty of different enemy types arranged in a way that will kill a careless player dead in seconds but reward careful flying and a little strategy with hard-won victory. The difficulty is offset by checkpoints set reasonably far apart, making you sweat for each one gained without (usually) requiring superhuman skill to attain. The boss fights just take too long, though, and did I mention Warcore feels like a toll gate with the price set far too high even for the great levels beyond? DOGOS is mostly great and a little bit broken, but if you bring a giant helping of perseverance to its more troublesome sections theres a fantastic, great-looking shooter trying to blast your heavily-armed experimental final-hope-for-humanity gunship into a smoking shower of red-hot shrapnel before you do the same to it.", "date": "September 10, 2016", "grade": 3.0}