{"name": "Seasons After Fall", "ref": "https://hardcoregamer.com/?post_type=post&p=225026", "text": "Theres often a debate in popular culture as to whether or not video games should be considered art. I feel that this debate is fairly stupid, of course games are art. If everything from a car to a well-cooked meal can be considered art, then games fall into this category. But like cars and food, just because a game looks beautiful doesnt mean that it fulfills its other primary functions, which is being enjoyable beyond its aesthetic appeal. Seasons After Fall is the prime example of a game that puts form over function. The artwork and presentation is absolutely stunning; its lush, hand-painted art style combined with a soundtrack filled with swelling orchestral strings sets a perfect tone for a game where you play as a fox who scampers around a lush forest. Where Seasons After Fall comes up short is in the actual gameplay parts, which are lacking any real challenge. When its all said and done, Seasons After Fall ends up feeling like a talented artist decided to make a puzzle platformer, rather than a talented game developer decided to make a piece of art. In Seasons After Fall you play as a newborn seedling, who begins its life deep under the I dont know, its not entirely clear, it looks like the ocean but maybe its inside a plant. Anyway, once you make your way to the surface you find yourself in the middle of a lush forest where a disembodied voice criticizes you for being late, introduces you to a fox, then orders you to entice the fox into a trap so you can possess its body for your own uses. I found it strange that the game has you controlling the fox against its own free will (the game makes this point several times), it feels a bit out of place that a game with such a light, halcyon (look it up) tone would have, what is essentially slavery as one of its main story points. Once youve taken control of the fox, the disembodied voice tells you that you must gather the fragments of winter, fall, spring, and summer. Each fragment is held by a guardian, which are giant animals that are scattered around the game world.This is the basic setup for the games story, gameplay, and character progression. With each new season fragment, your fox gains the ability to change the environment to that season, doing so unlocks previously inaccessible paths or allows you to manipulate environmental elements in new ways. So if you come across an impassable river during the spring or fall, changing it to winter allows you to walk across its now frozen surface. The ability to change seasons is the games primary method of solving puzzles, and while its interesting at first, in the end it comes off as feeling very under-utilized.The obstacles in Seasons After Fall never feel like puzzles that need to be solved, rather they all come off as a binary situation; you either have the proper season to progress further or you dont, this combined with the lack of enemies makes Seasons After Fall lack any sense of challenge making it feel like a walking simulator rather than a true game. The other problem with the gathering of the four seasons is that it feels like the prologue to the actual game. Once all four are collected the game does give you an overarching mission to restore balance to Nature. But it doesnt feel like theres enough to do, once the final season is acquired, the game has you revisiting all of the locations that youve already seen and explore previously inaccessible areas. These areas do have a few new things to find in the end, but it feels like an unnecessary retread of stuff youve already seen. All of these factors come together to make Seasons after Fall a game with shallow gameplay, that feels unnecessarily padded.Where Seasons After Fall really shines is in its presentation; everything from the art, to the music and voice acting is masterfully executed. Aesthetically, Seasons After Fall nails it; the hand drawn art style really puts you in the shoes of an innocent, childlike entity who is exploring an incredibly ancient world. The animations when shifting seasons are beautifully rendered, even after the umpteenth time, theyre still a marvel to look at. The sound pairs perfectly with the visual style; orchestral swells from the games string quartet and the wonderful voice acting are enough to keep me interested in the game. This is Seasons After Falls greatest accomplishment; the ability to keep players engaged with its style and presentation alone is an accomplishment that few games can lay claim to.Closing Comments: Seasons After Fall is unique in that its beautiful artistic style almost makes you forget about the lackluster gameplay. While its far from perfect, it still manages to be an enjoyable experience, especially for those who treat games as an experience rather than a task to be completed.", "date": "on September 9, 2016", "grade": 3.5}