{"name": "Mother Russia Bleeds", "ref": "https://hardcoregamer.com/?post_type=post&p=224337", "text": "If theres one thing thats readily apparent about Le Cartel Studios Mother Russia Bleeds, its that it clearly draws inspiration from the infamous ultra-violent Hotline Miami games. This side-scrolling beat em up not only allows you to gruesomely murder more soldiers, junkies and BDSM pig creatures than you ever could have dreamed of, but it also has the same psychedelic lunacy that made Hotline Miami so great. While theres a lot to love about what Mother Russia Bleeds does, its core gameplay isnt necessarily strong enough to carry it to great heights. Its wonderful that an gore-heavy pixelated beat em up can come out in 2016, but the simplistic nature of this particular combat system bogs down what could have been a truly special game. Still, what Mother Russia Bleeds lacks in engaging gameplay, it makes up for with insanity, atmosphere and some gorgeous 2D art.Mother Russia Bleeds sports a premise that lends itself to its title. Players take the role of one of four members of a gang of highly capable, but largely ridiculous fighters who are almost immediately kidnapped. Upon getting access to a mysterious drug, these gypsies escape and seek sweet sweet revenge against their captors by doing what anybody would do in their situation: beating up everyone in sight. Oh, and in case that wasnt captivating enough, the drugs distribution is being controlled by the mafia and has ties to the Russian government. In this blood-fueled eight-stage campaign, players traverse through increasingly tense and bizarre environments, all while dealing with sporadic hallucinations thanks to heavy drug use. From a stage where you fight a character that looks and acts surprisingly like Overwatchs Roadhog in a gimp mask to hurling grenades at a wall of Russian soldiers with riot shields, Le Cartel has made sure that those coming to Mother Russia Bleeds for a zany, messed-up story about murder, drugs and revenge will be satisfied. Its not hard to imagine that years down the line, players will be picking up Mother Russia Bleeds on the cheap during a Steam sale just because of how cool its concept is. Anyone who has played a Streets of Rage-style beat em up will feel immediately at home in Mother Russia Bleeds. In a nutshell, youll start on the left side of the screen and move to the right, with waves of enemies stopping your progress until you slaughter them all. When you think about it, youre not really covering all that much distance in any of Mother Russia Bleeds stages (each would probably be a twenty-second Mario level), but thanks to prevalent single-frame battles, each will require anywhere from ten to thirty-plus minutes of your time. The combat system as a whole isnt all that complicated, with players having access to commands for punching, kicking, dodging, grabbing and jumping. Each character also has a syringe with three doses of the mafias powerful drug, which can be used to heal, revive fallen comrades or initiate the damage-multiplying Berserk mode. Listing all of the mechanics out makes the gameplay in Mother Russia Bleeds seem a bit more complicated than it actually is. In practice, youre going to be mashing the punch and kick buttons, pounding fallen enemies into the ground, refilling your syringe and dashing around monster closets. Sure, theres enough enemy variation at play here to keep every battle from feeling the same, but the lack of a more complex attack arsenal holds Mother Russia Bleeds back.The gypsy fighters themselves even feel oddly similar to one another. Aside from basic cosmetic and size changes, each character only really differs in their damage-speed ratio. Le Cartel deserves credit for creating enough variety in each stages enemies to prevent its gameplay from feeling too stale, but each encounter has enough repeat foes to cause one to quickly forget said variation. Thankfully, playing Arena mode grants anyone who reaches the tenth round in a given arena the chance to unlock new drugs. While this does add to some of Mother Russia Bleeds replay value, the real draw here is how bizarre the world is, and for that reason, it feels like the type of game that most players are going to play through once and then put down. So much of what this world has going for it is its sheer shock value, and after a single playthrough, that weird feeling in the pit of your stomach stops appearing. Then again, if any game, much less a 2D beat em up, can inspire feelings of shock and laughter in its players the first time through, then its worth paying attention to. Its worth reiterating that the general vibe here is the biggest draw, so much so that its occasionally tough to pay attention to some of the text-based dialogue or combat. Try taking a look at the image below and tell me it wouldnt be tough to find time to revive my two fallen AI comrades. Easily the single-worst aspect of Mother Russia Bleeds is its AI. Specifically, computer-controlled fighters seem to be averse to reviving teammates during tense moments. Theyll certainly find time to bring you back from the dead when no other enemies are around, but theres something especially frustrating about being taken out of the action while your AI teammates lose a boss battle. The addition of a command to summon an AI teammate over to revive you when youre down would do wonders here, because taking bots into your game with you feels like more of a way to increase character density rather than a useful strategy. Speaking of those boss battles, they range from some of the best parts of Mother Russia Bleeds to some patience-testing sequences of repetition. Its great that Mother Russia Bleeds is a tough game, but there are certain elements that feel designed somewhat poorly. For instance, a late game boss battle tasks players with using sledgehammers to beat down a massive missile-spewing, fire-breathing tank. If you play on normal difficulty with three bots, youll not only wind up being the only fighter who thinks to attack the boss, but youll also be the only one who knows that standing under a missile is not a good idea. Having your entire squad wiped due to dumb AI is deflating and takes away from some of the more exciting moments of Mother Russia Bleeds.Mother Russia Bleeds deserves recognition for being one of the best looking pixel-art titles weve seen in some time. Hyper Light Drifters unique color palatte and bizarre design still give it the edge, but those who wrongly believe that pixelated titles are somehow less gorgeous than games with other art-styles should play through Mother Russia Bleeds. Every pixel looks like its been perfectly placed, and every animation contributes to the general chaos happening on screen at any moment. Granted, its occasionally difficult to find your character on screen if youre playing with three other people (or three AI), but games like this thrive on being as crazy as possible. Though I played Mother Russia Bleeds on a relatively high end PC, its worth noting that it never dropped a frame below 144 frames-per-second, even with four characters, so theres some definite party game potential here on a host of different machines. On a more specific technical note, I had some pretty notable input issues when attempting to use an Xbox One controller and a Steam Link. Again, this is only going to apply to a small segment of the player-base, but having to restart the application multiple times in order to play Mother Russia Bleeds in the living room was a bit of a downer. Closing Comments:Mother Russia Bleeds succeeds in being a self-aware play on the edginess in video games. As interesting as its concepts, art design, themes and general aesthetic are, issues with its combat and AI hold it back from being the indie darling it clearly has the potential to be. Perhaps this would have been a game better suited for another genre, as theres such a stark contrast between its peaks and valleys. Mother Russia Bleeds is probably the strangest 2D title since Dropsy, so if youre the type of person who wants their pixel-art to be shocking, then this is the game for you. Its a shame that so much of the moment-to-moment combat feels like an exercise in button-mashing, as theres a weird dichotomy in such an interesting world playing host to somewhat uninteresting gameplay. Still, anyone looking for drug-induced 2D violence is going to have a hard time passing Mother Russia Bleeds up.", "date": "September 8, 2016", "grade": 3.5}