{"name": "The Turing Test", "ref": "https://hardcoregamer.com/?post_type=post&p=223163", "text": "As we get ever closer to an era of AI  and likely the resulting singularity  as well as our own impending demise as a species, our appetite and lust for creativity in science fiction, in all mediums, has increased evermore. While films in recent years have offered up a relative assortment of interesting and visually-striking (if mediocre in narrative) premises, puzzle games have evolved more prominently into their own self-contained, existentially-focused debate on these such themes  covering both intelligence and humanitys very fate. Naturally, a self-declared state of wit has been crucial, in gameplay terms, for as long as the puzzle genre has existed.But whether the narrative running alongside has taken a comedic turn, like [obvious choice] Portal, or instead chooses to cement its philosophical leanings like in The Talos Principle, narrative-driven, first-person experiences have, for better or worse, taken to the principle not all lifes puzzles can be so easily solved with a simple move of a block or flick of a switch. Pneuma: Breath of Life, the 2015 title by Bulkhead Interactives former incarnation, Deco Digital, while not the most complex or content-packed of puzzle games, did at least provide a momentary spin on the interaction between player and player-character. A reasonable, but flawed, effort when all was said and done. A year later  and countless more in-game  and The Turing Test, from the off, feels like a much more grounded affair for the newly [re]incarnated Bulkhead Interactive.Despite perhaps the head-numbing foray into the semantics surrounding AI, morality and the like, Bulkhead make it resolutely clear theyre not to repeat the mistakes of yonder by sacrificing puzzle design for philosophical babbling. Because for all its momentary counter-counter dialogue between main character Ava Turing and her AI assistant, TOM, The Turing Test makes sure above all else that its the puzzles that resonate. And resonate they most certainly do. The Turing Test takes us all the way to the mid 23rd century; Ava Turing, having been awoken from cryosleep, is instructed to investigate the disappearance of an Europa-based crew within a facility located on Jupiters moon that, in its squarely-rigid floor-plans and brightly-lit interiors, makes certain nods to 21st century endeavours from a 1960s/70s perspective. Within this facility lie sterilely-minimal rooms with puzzles that need to be solved  not unlike the hyper-cleanliness of Portals aesthetic admittedly  with doors that need to be unlocked in order to progress further into the base. To do this, players are equipped with the Energy Manipulation Tool (or EMT for short), a gravity-gun style device that allows you to transfer energy spheres between generator-style conduits and, later down the line, other devices such as gravity cranes and moving platforms. Though early challenges in the games first couple of chapters will primarily involve one type of energy source  transferring power from multiple floor positions and spatial perspectives, including from out one locked-out room to another  the game shakes up the formula in pleasant amounts to consistently feel both fresh and inviting. Be this adding new elements or requiring the player to figure out and thus trigger set sequences in the right order. Whats more, theres a dazzlingly instantaneous and upbeat pace to The Turing Test; both character movement and interaction with objects feels pleasantly quick and for those who can get it fairly quickly will find themselves, like me, soaring through each room (at least in said early chapters).Playing this on PC  and bolstered at max settings  The Turing Tests retro-futuristic art direction and scene-setting really comes into its own, yet the games charity with movement doesnt end up damning or otherwise deter from the careful crafting Bulkhead have clearly put into the environments on show. But its Bulkheads refined focus on puzzle design and the balance it strikes with its narrative that is the definite stand-out  offering the latter in just right the doses at just the right time, both the games story and its gameplay work superbly in tandem and seldom feel intrusive on one anothers placement. While each new room will offer a introductory new line of dialogue between Ava and Tom  be it responsive or rather more philosophical in some cases  its the respite in-between chapters, that take the form of the games story, that allow players the opportunity (if they want it) to delve deeper into the mystery of whats taken place, or simply ignore it and carry on if they so desire. Mid-way through each chapter, a series of optional puzzles off the beaten track will also help further the tale  as well as providing some further head-scratching gameplay-wise  with audio logs that shed light on the base crews disappearance, motives and eventual revelations. While most of these optional logs are delivered reasonably well, the game remains prone to the occasional flat delivery of dialogue. Whats more, the fact audio logs are not subtitled (like the rest of the games dialogue strangely) means the frustratingly mumbling quality to the recordings may mean players will miss specific details or entire sections of speech. Had this been a story-led experience, the shortcoming on the sound design front might have been far more damaging on the all-round experience. Fortunately this is not the case and even the games minimal, neo-classical score of delicate piano tracks at time do add a bittersweet unrest to further the games overall themes. It matters little that audio tracks will just suddenly stop looping once finished as the puzzles to be found  and subsequently solve  in The Turing Test are cleverly arranged to invoke experimentation but ultimately rely on ordering set elements and, at times, well-timed movement.What makes The Turing Test work as a puzzle game isnt so much the complexity of its puzzles  or how long players are required to invest in each one  but how it instead asks of the player to use their own ingenuity and assumptions on what they find to catch on to the games preset rules and boundaries. Even when it drastically shakes things up and does so (without spoiling anything here) in quite a satisfying way at points  the principle in reading the environment remains the same and Bulkheads faith and confidence in player-made investigation registers at just the right moments to make solving latter puzzles especially feel more triumphant than they should perhaps, realistically, feel. It all makes sense come the end of each enclosure, but given the initially presumed impossibility, the game has both an elegance and a grace to the way it makes players feel, least for a time, smart. Closing Comments:Whether youre in it for the gameplay or find yourself drawn in by the looming mystery that steadily simmers over in due course, The Turing Test (minus the occasionally hard-to-decipher audio) is a smartly-structured and delicately-arranged puzzle game that knows its boundaries and leaves it to the player to fill in the missing gaps. Bulkheads balance between narrative subtext and gameplay content is a fitting step-up from Pneuma and it shows a studio, having learned from previous experiences, now full of confidence in not just their work, but of the players decision-making on their way to unravelling the games mystery. The Turing Test, like Talos before it, fascinates in its World-building as much its subject matter, but thankfully avoids the pitfalls of hammering its interests on the players head. Those eager to find the next great first-person puzzler: Bulkhead have something thoroughly deserving of your attention.", "date": "August 29, 2016", "grade": 4.0}