{"name": "Onrush", "ref": "https://hardcoregamer.com/?post_type=post&p=300821", "text": "Off-road racing games have fallen out of favor the past decade despite games like Pure and the Motorstorm franchise not only being critically acclaimed but also selling well too. Pure was one of the most action-packed and polished off-road racers out there. Motorstorm was focused more on pure mayhem and lacked polish in some areas, but never ceased to provide thrilling action. In that same time frame, however, Codemasters has also become one of the greatest racing game developers of the modern era  with franchises like GRiD and DiRT showcasing a wide variety of racing styles. Onrush feels like the culmination of their journey as a racing game-centric developer  and the addition of many ex-Evolution Studios members hasnt hurt either, as the final product is finely-tuned and infuses Motorstorm-style action with a touch of Burnout and a bit of GRiD too.The idea of Onrush is simple  youre part of a team that is out to topple the other team and get more points. Points are scored by taking out dummy enemies, boosting, chaining boosts, taking out enemies, or given the race type, going through a series of gates while doing all of those things. Each race is divided up into three rounds and the first team to win two out of the three rounds (or three out of four) emerges victorious for the race as a whole. It adds a more traditional sports-like element to a genre that usually doesnt have it  and its a mechanic that works shockingly well. It gives you the same kind of thrilling come from behind sensation a victory does in a traditional racer where youre in last to start a lap and win at the end  but its actually more rewarding here thanks to how everything is executed. In a normal racing game, you get a podium finish and thats it. Its fine, but unexciting most of the time unless you get some fireworks or something to make the event seem grandiose. Codemasters has usually been good about making this come to fruition, with DiRT Showdowns pyro being the best example.Onrush rewards the entire team after a race with Overwatch-like stats, replays and rewards. If you wind up starting a race with a vehicle you dont like, you can also swap out your vehicle for a different one after you get taken down or crash. Its interesting to see hallmarks of another genre blended into a racing game, but its great to see how well they work out in Onrush. The in-race team-based mechanics allow you to not only double-team opposition for takedowns if needed, but also share your boost with your allies  or they can do the same for you. Non-stop boosting is rewarded with points and the team with the most points at the end of a round wins, so its beneficial to use teamwork whenever possible. The boost operates with two levels  basic boost that sends you forward at a fairly fast rate of speed and onrush boost. This one requires you to fully build up your boost gauge over the course of a race and youll generally only be able to fire it off twice at most per race. It rockets you forward and is the best overall way to reliably take down your AI rivals. You do have fodder you can destroy too  but theyre a lot like the bots in Titanfall. They exist to provide a basic learning experience and arent going to put up a challenge. Your rival racers will attack you, pounce on you and gang up on you whenever they can. Scoring takedowns works much the same way as Burnout  with a variety of different types available. You can attack from behind and shove them into something, attack from the side and wipe them out or throw them into something, or dive onto them from above during one of the many ramp sequences.Each takedown is rewarding and its even more gratifying when you use the onrush boost to do it. That propels you at such a fast rate of speed that not wrecking is a huge accomplishment and one of the first signs the game is clicking is that you feel a sense of pride when that happens. Its a challenge to stay on-course, but a fun one and having that sense of power does add to a sense of speed that is sorely lacking from most racing games. You do feel like youre a hair way from being out of control  but you arent. Its just a matter of being mindful of your surroundings and carefully evading objects. Its tough, but doable and youll be threading the needle many times in just a basic race when you and a group of racers try to go through a single pipe or jump off the same ramp. Onrush never stops providing thrilling action and its fast pace never slows down either. The game moves at a rock-solid framerate throughout, with a variety of dazzling visual effects blaring at almost all times thanks to the ever-present boost mechanic. The vehicles themselves look solid, while the environments are more of a mixed bag. Water effects are impressive for things like splashing and reflections  but ground textures are artificial and stand out as not having much depth when you use the photo mode. Onrush also makes the cardinal mistake of making racing games by showcasing character models, which like with F-Zero GX many years ago, show some flaws in the graphical design that would be hidden if they werent visible given how they lack detail.Onrushs sound design is outstanding  with a diverse soundtrack of both somber rock and faster-paced stuff. The roar of engines surrounding you  especially when amplified by boosts and super-charged boosts also gets the blood pumping. Rubbing paint with rivals sounds visceral and the impact of takedowns, especially from above, is devastating. As a result, the combat-centric side of things is rewarding and makes every takedown achieved feel like an accomplishment. Closing Comments:Onrush is the finest off-road racer ever made. The core gameplay is fast-paced and does everything that made the Motorstorm series great, but with far more refined controls. Having things like Burnout-style takedowns from a variety of angles keeps you on your toes at all times too. The healthy array of modes keeps things fresh, while the team-based structure to the game means that you can be an essential part of your teams victory without having to be an all-star. You can carve a bit of a niche out for yourself in different ways and get more out of this game than a traditional racing game. Its a great-looking and sounding experience and a must-buy for adrenaline junkies with a penchant for off-road mayhem.", "date": "June 5, 2018", "grade": 4.0}