{"name": "Sonic Origins", "ref": "https://hardcoregamer.com/?post_type=post&p=424096", "text": "Sonic Origins is the latest collection of the Blue Blurs greatest 2D hits. Sonic the Hedgehog, Sonic the Hedgehog 2, Sonic the Hedgehog 3 & Knuckles and Sonic CD are all included in the bundle and are probably both looking and playing better than ever before. Such a collection of games shouldnt cause controversy, yet controversy surrounds this release anyway. Not only did Sega de-list the standalone versions of the member games from most online storefronts, but also made strange decisions regarding pre-order bonuses. The question regarding Sonic: Origins isnt whether or not the games included are good (they are), but whether this collection is worth the $39.99+ price tag and the overall loss of the ability to buy these games on their own. It may be for some, but most likely wont think so.The main attractions of Sonic Origins are, of course, its collection of Sonics greatest hits from the 90s. Each game plays just as well as they always have and have been well-adapted to fit a 16:9 aspect ration in Anniversary mode. This and infinite lives are actually the key features of Anniversary mode, with players earning Sonic Origins special coins to spend in the Museum rather than the old extra lives and continues. Those wanting a more retro experience can still play the all the games in Classic mode, though, which presents them in their original 4:3 ratio and reinstates the old lives and continues system. Both modes also allow players their choice of some combination of Sonic, Tails and Knuckles at each games start.Visually, all of Sonic Origins member games look crisp regardless of which mode one opts to play in. The difference isnt terribly apparent in the normal levels, but its dramatically clear in the special stages for Sonic the Hedgehog 2 and Sonic CD. Both have benefited greatly from the remastering process, with Sonic the Hedgehog 2s special stages getting the most significant bump in quality. What was once just a super-pixelated attempt at pseudo-3D is now clean and slick. Its still primitive as far as 3D goes, but old fans will likely find themselves just as wowed by it now as they were by the original so many years ago. Its in its presentation that Sonic Origins shines. The game is stuffed with loving visual and musical flourishes that lead one to think that the team behind it put their all into it. The main menu is a collection of islands representing the different games and extra modes and each are populated by various Badniks and animals. Well, they are if one bought the right extra pack, but more on that later. Menus are all bright, cheerful colors and smoothly animated, and the main theme does a fantastic job of making this collection feel like a celebration of everything Sonic. The Museum mode adds to this by bringing even more music, illustrations and videos into mix, all of which most fans will likely find interesting at the very least. The game looks all around fantastic, which helps considering that there isnt all that much here in terms of new gameplay content.Indeed, those hoping for something new will likely come away from Sonic Origins feeling somewhat disappointed as Missions, Boss Rush and Mirror modes represent the sum total of it. Boss Rush and Mirror Mode are exactly what they sound like; the former challenges players to defeat all of a games bosses without taking a single hit, and the latter flips the stages horizontally. Both are likely interesting enough for a time, but most players will probably spend their time in the Missions instead. There are fifteen missions for each game with difficulty ratings ranging from one to five stars.Each focus on one specific challenge like say Use the Bumpers to reach the goal within 1:00! All are short and allow for quick retries, so players likely wont get annoyed even at the more difficult challenges; quite the opposite actually. There might be more missions in the game, but that depends on whether or not one bought the correct extra content pack. This is where the unfortunate side of Sonic Origins comes into play. As many Sonic fans are no doubt aware, Sega made a series of strange and cynical choices in regard to Sonic Origins. The most controversial being the companys decision to de-list Sonic Origins member games from most online storefronts. If fans didnt already buy them, then Sonic Origins is now the only way to play these games on most platforms. The other odd choices are focused around content seemingly cut out of the game just to have extras to sell as DLC.Such extras include: an early unlock for Mirror Mode, a letterbox pattern, a camera angle in the main menu, 100 extra coins, an animated character for the music menu, extra sound tracks for said menu, Difficult Missions and Characters in main menu (which must refer to the creatures populating the islands). After seeing most of this so-called bonus content, its amazing that Sega would carve it out and attempt to sell it for an extra four to five dollars. Its all nice to have, but isnt nice enough to be worth another charge on top of an already iffy $39.99 price tag. Seriously, this is all stuff that should just be in the game from the outset. Closing Comments:Sonic Origins does a lot right. It looks and sounds wonderful, all the games look as good as they always did if not better in some cases, and theres new stuff here for older fans to enjoy. Heck, theres even new courses for Blue Spheres fans. It looks the part of a collection that celebrates the best of Sonic, yet it doesnt manage to justify that price tag. These are all old games now, and the versions available here arent all that much better than the originals. Considering that past Sonic collections offered more games for less money, its hard to say that this one is worth it. Ultimately, Sonic Origins is a well-polished wrapper for old games that were, until recently, available at much lower prices. Unless one is a real super fan, this is a collection thats better-grabbed on sale.", "date": "June 21, 2022", "grade": 3.5}