{"name": "No Mans Sky", "ref": "https://hardcoregamer.com/?post_type=post&p=220959", "text": "No Mans Sky doesnt live up to the hype.There. Now that we have that proclamation out of the way, we can get past talking about the media blitz and ensuing excitement that surrounded the game for years. Reviews are meant to give readers an idea of what makes a game good or bad in the eyes of its reviewer, so to bring the pre-launch opinions of others into the mix seems, well, silly. Of course, it wouldnt be a No Mans Sky review if there wasnt some bit of flavor text about its pre-release hype. Despite the fact that those lofty expectations essentially made fans sound like eight-year-olds dreaming of the perfect game, realists out there realized that there was absolutely no way for Hello Games to live up to the pressure that was placed upon its collective shoulders. From this point forward, this review is going to analyze what No Mans Sky actually is, rather than what gamers far and wide thought it would be.So what is No Mans Sky? To sum it up in a single sentence, its a fascinating, but fairly rote survival game with a number of issues that takes place in a procedurally-generated universe thats actually universe-sized. No Mans Sky is the biggest video game ever, and the sense of scale that comes with such a title manages to always feel magnificent. Theres a sense of wonder that comes with discovering a new planet, and its peaceful ambiance makes it a pretty awesome pick for that game that you repeatedly play before going to bed. If this review ended here, perhaps youd think that No Mans Sky was the best video game ever, rather than a title whose issues keep it firmly in the fine to good range. The combination of a maddening inventory system, a lack of diversity in its gameplay loop, significant quality of life issues and technical follies prevent it from being the game that it had the potential to be. Still, if No Mans Sky is a glimpse into the future of video games, then sign me up immediately. The idea of reviewing a game like No Mans Sky is daunting, to say the least. Its impossible to talk about every aspect in great detail in under 20,000 words, but luckily any analysis of this particular game can be easily summed up with top-down analysis. No Mans Sky is awesome on a macro level and gets consistently worse the more you move towards the micro level.Youd be hard pressed to find a cooler game on a macro level than No Mans Sky. Taken from a more academic point of view, the sheer scale of what Hello Games created is a nothing short of a marvel. Theres something special about the idea that you can visit literally anything that you see in the sky, so Sean Murrays vision of a game that captures the wonder he felt as a child whilst dreaming of being an astronaut discovering new worlds. Ignoring the concept of boredom entirely, No Mans Sky is a game with limitless content. If youre someone who just wants to fly around, check out some weird creatures and pretty vistas and find a planet that no one else has, then this is going to eat your life for months. For everyone else, No Mans Sky is the perfect peaceful distraction from any other games you might be playing. Its easily the most ambitious use of procedural generation this medium has ever seen, making it easily the most fascinating title in years. Of course, ignoring ones capacity for boredom when talking about content means nothing; a limitless universe can exist in practice, but when what youre doing inside of it loses steam, limits become very real.In general, No Mans Skys relaxing nature and sense of wonder are genuine draws, and would be celebrated in a world where details are ignored. Unfortunately, thats not the world we live in, and thus the moment-to-moment gameplay of No Mans Sky is going to be a real turn-off for a wide array of gamers. If youre someone who hates the idea of survival games with heavy emphases on mining, crafting, inventory management and meter monitoring, then this is not the game for you. Granted, this isnt the type of survival game where some random player can run up to you and steal everything you own, so youre free to experiment at your own pace. While your main goal is to find your way to the center of the universe, No Mans Sky has a core gameplay loop not unlike Minecrafts Survival mode, albeit with a whole host of notable differences. Every new planet presents resources to gather, enemies and wildlife to fight off or ignore and an array of bite-sized buildings to explore and aliens to interact with. No Mans Sky is a survival game through and through, so if the idea of searching for Plutonium in order to complete the crafting recipe for a coveted item sounds like your cup of tea, then this is the game for you. No Mans Skys luster begins to fade a bit when it becomes apparent that while its universe never ends, the actual things you can do within it end rather abruptly. A typical sequence of events begins upon entering a new star system, where youll land on the first planet you see. Your screen will be awash in color, and a quick scan of your environment upon breaking through the planets atmosphere reveals an alien monolith in the distance. After landing at the foot of the monolith, youll wander to a point and push the Square button in order to trigger a paragraph of obtuse, but interesting text before being granted a new word in one of a handful of alien languages. Youll run, gather Carbon, Plutonium, Heredium, Zinc and Thamium9 in order to put together a Warp Cell to fuel your way to another star system. Before leaving you might stop at a building with a trading station and sell a few items, meet a sentient being whose language you dont understand or find new crafting formulas. After that, youll hop in your ship and take off to a new system and start the process over again.Now, obviously there are more activities in No Mans Sky than the ones mentioned in the paragraph above, as well as a light narrative hook, but outside of some bizarre discoveries here and there, youre going to be a doing a lot of fairly rudimentary activities over and over again. The core gameplay loop here is definitely far less thrilling than its concept, but that doesnt mean that there arent real hooks to No Mans Skys gameplay loop. Theres something oddly satisfying about finding the material you need to craft a cool new piece of gear, or finding a new ship with a bigger inventory in the middle of nowhere. The problem is not one of satisfaction, but that the moment-to-moment gameplay of No Mans Sky is simply okay and never anything more. The entire time youll be waiting for something more interesting to happen, creating a carrot on the end of a string that isnt really there. Make no mistake, the fact that the only challenge here is figuring out how much time you have makes for a very relaxing experience. Still, any hopes of having the one game that you can play forever will probably need to be put on hold. While No Mans Sky is absolutely incredible when you think about the nature of its procedurally-generated universe, its also a pretty classic example of the clash between the benefits and costs of relying heavily on algorithms to build a game world. Those who are saying that planets are mere palette swaps of one another are being a bit hyperbolic, but there definitely isnt enough environmental variation here to satisfy the long term needs of most. Every planet in No Mans Sky has a single style of terrain, a uniform weather pattern and the same sets of flora and fauna at every point. Sure, there are caves, hills and valleys, but if you were hoping to walk from a rain forest to a snow-covered mountain, then youre out of luck. Because of the lack of variance in both your activities and the planets themselves, its already pretty standard practice to bounce around from planet to planet until you find a winner. Despite the beauty constantly on display, No Mans Sky always feels sort of artificial, reminding you that youre merely a spec in a simulation rather than an explorer discovering wondrous worlds.Anyone who knows anything about No Mans Sky knows that youre going to spend a great deal of time fiddling around with your inventory, which, as it stands, is perhaps the biggest issue here. Managing perpetually cramped exosuit and ship inventories is the biggest challenge to be found here. While theres something to be said about a game that forces the player to make tough resource decisions is neat, its something thats holding back how enjoyable No Mans Sky has the potential to be. Upgrade slots, key items, loot and resources all take up the same spots in each of your inventories, which forces prioritization, but also makes moment-to-moment gameplay an occasional slog. Clumsy Destiny-style interface aside, No Mans Sky has an inventory that doesnt show crafting recipes if its full, creating painful situations where you sell off items without knowing if you need them. Months down the line, we may see a new inventory system-UI combination that makes gaining upgrades and gathering resources more enjoyable, but as it stands, its enough of an inconvenience to warrant quite a few complaints. Those coming to No Mans Sky hoping for a deep narrative are going to be disappointed. At the very beginning of the game, players are given the choice to explore towards the center of the universe on their own or accept the guidance of a mysterious AI force known as Atlas. Having chosen the Atlas path and followed it throughout my trek, No Mans Sky has a core story thats bizarre enough to drive you forward, but it always feels like an afterthought. The core loop here is based upon exploration rather than flying from system to system to gather Atlas Stones. While the actual writing in the text-based exposition segments is fantastic, moments of guidance and explicit detail are few and far between. Its one thing to have a very open-ended narrative hook in a short game, but No Mans Sky is so expansive that it feels like the story itself is barely there. This is not the type of game that you play for the story, which is somewhat obvious, but that does create a motivation problem. Its not great to ever have players wondering why theyre doing something, as thats the first step to putting away your game for good. If you treat the Atlas path as something you do on the side, as opposed to your whole focus, youll have a far better time than someone who simply tries to mainline the story.No Mans Sky plays host to a bevy of other quirks, both good and bad, that feel worthy enough to mention, but dont necessarily need detailed explanations. For instance, you can name everything you discover, from planets, to points of interest all the way to animals, allowing other players to step foot on whatever silly nonsense you come up with. There are some stability issues on PlayStation 4, with three application stoppages occurring during my play time. Add this to a lack of a dedicated ability to manually save whenever you please, and you dont have to be a genius to envision some pretty major progress loss occurring. Some of the procedural animal designs are so dumb that its impossible not to laugh, so anyone who finds the idea of dog-headed snakes flying through the sky hilarious is in for a good time. Finally, the PlayStation 4 version of No Mans Sky has some notable technical shortcomings, with blatant texture pop-in constantly flooding the screen and an occasionally unstable framerate. Combine this with a really narrow FOV and a wonky, control scheme you cant customize (outside of the Accessibility Menu), and its tough to argue that the console version of No Mans Sky isnt a little clunky. Closing Comments:Despite the sheer amount of complaints that you can throw at No Mans Sky, its still a breathtaking experience that teases the possibilities of the mediums future. Yes, there are parts of it that feel like an Early Access survival game, from its clunky inventory system to its lack of a true manual save system, but Hello Games deserves praise for creating a game this massive. A great deal of this review tore into No Mans Sky for some of its obvious flaws, but it has the hooks of something addictive. Whether its upgrading your ship or discovering a planet loaded with rare goodies, there are some moments that tap into your sense of satisfaction. In general, the good in No Mans Sky outweighs the bad, but there are enough minor annoyances and curious decisions here to hold it back from being something special.", "date": "August 16, 2016", "grade": 3.5}