{"name": "New Retro Arcade: Neon", "ref": "https://hardcoregamer.com/?post_type=post&p=220366", "text": "Once upon a time, gamers went to magical places known as arcades. There they were free to cluster together in dimly lit rooms and feed quarters to arcade machines. Playing a co-op multiplayer game alongside strangers, or battling against one, were commonplace as were friendships formed over playing games together. Unfortunately, something happened to all but kill off arcades in the 90s. The advent of powerful home consoles and PCs made it such that people no longer needed to spend innumerable coins at the arcade. Instead they could simply play these same titles at home. In the modern era weve seen a slow revival of the arcade concept via barcades and the like, but its never quite what it was back then. Many still have no opportunity to step foot in a real arcade, which is where virtual reality comes in. Developer Digital Cybercherries first flirted with the idea of a virtual arcade when they created New Retro Arcade as a fun, free download for Oculus Rift development kit owners. The response was immense. People were absolutely enthralled by the experience and desperately wanted the team to add more. Well, theyve been hard at work since then upgrading this base concept into New Retro Arcade: Neon. Now the game works with Oculus Rift and HTC Vive headsets as well as for folks who dont have any VR headset at all. It includes two modes: the classic version which many previously experienced, and the enhanced arcade that shows off various new and upgraded features. The allure of checking out a cool digital arcade is immensely tempting, especially within virtual reality. At first glimpse, everything about New Retro Arcade: Neon seems absolutely perfect. The moment you arrive in the arcade you hear music, see bright neon lights and rows of arcade machines just waiting to be played. Beyond this selection of arcades are other forms of entertainment, such as a two lane bowling alley, whack a mole game, punching bag and even a few of those carnival-style basketball hoop shooting games. Then you start to notice the more dingy parts of this arcade recreation. There are beer bottles, soda cans and cigarette packets scattered on every table and strange stains on the floor. Despite the clutter, at the start, youll find the arcade completely empty. There is actually a multiplayer mode which helps inject some much needed life to the place, but with its own restrictions.The more one wanders through the arcade, theyll quickly discover some other rooms down a hallway. Beyond the main arcade lies a mini theater. By popping in a VHS (mapped to a YouTube video URL or file on your computer) it will theoretically begin to play that video in-game. Beyond this room lies the final area  a VIP room. Theres not much VIP about the place, but it does offer more goodies. Here youll find two dart boards, an air hockey table, and retro console hooked up to a CRT TV. It might not be the largest arcade out there but it still feels like theres a lot to explore and enjoy here. Initially, New Retro Arcade: Neon excites, but digging in deeper reveals some issues with the current content.One of the largest issues is the fact that nearly all those arcade machines out on display do nothing in and of themselves. Pop in a coin and youll basically be greeted with a message that a ROM needs to be inserted for anything to happen. Yep, players are advocated to grab ROMs off the internet somewhere to play games in this retro arcade. To be fair, thats what many have been hankering to do, regardless of its legality. An issue with this implementation is that only certain emulators are supported. To get this all set up you also need to utilize an out of game utility known as the Arcade Builder. This is also whats used to assign videos to the in-game VHS tapes. While getting ROMs setup isnt so hard once you know what to do, it appears that video mapping is far less stable at this point. Sometimes youll set things up perfectly, save changes, pop into the game, and be unable to watch what you just specified.Playing MAME or consoles on the arcade cabinets within New Retro Arcade: Neon has a definite allure, but many want to play with their friends. Thats where online multiplayer comes in  or where it should have, if it were technically feasible. Yes, there is an online mode where you can run around the arcade with friends or strangers. But the emulator cores do not support two player on one game nor do they allow for others to even see the game youre playing locally. Digital Cybercherries created two arcade-style shooters which can be played online (Aimbot and Zombie Problem II) but neither of these hold a candle to true arcade classics. Where multiplayer currently shines is in competing against others at bowling, darts, or any of the other hands on games available. Its also just plain hilarious to see floating headsets with hats meandering around your arcade.Right now, New Retro Arcade: Neon makes the most sense for people with a HTC Vive. This is because of the action-oriented games like air hockey, basketball, or darts. Playing with a standard controller or keyboard and mouse suffices, but it simply feels much more natural with a Vive wand. Once the Oculus Rift Touch controllers launch then the two experiences should be about equivalent. Since launch, the developers have been working to push out patches to fix launch bugs and other complaints. Theres no doubt the game is improving, but there are some things theyll not be able to fix via patch. Many people expected the concept of digitally hanging out with friends in an arcade to be ideal, but the reality doesnt quite measure up to our memories yet. Closing Comments:New Retro Arcade: Neon had everything going for it, including a tremendous amount of goodwill thanks to the original proof of concept on Oculus Rift. While this paid version adds new features and more reasons to play, theres still a feeling that something is missing. A small arcade with only two games by default is hardly mind-blowing, though getting accustomed to running ROMs in virtual reality is still neat. Playing around with friends is cute, but with just a few things to do theres little reason to keep going online week after week. Perhaps the team will be able to add more multiplayer-focused content post release which retains players in the long term. New Retro Arcade: Neon realizes an immensely cool idea but that idea alone requires further refinement to become a must-play.", "date": "August 10, 2016", "grade": 3.0}