{"name": "Gal*Gun: Double Peace", "ref": "https://hardcoregamer.com/?post_type=post&p=217826", "text": "Its a plot as old as time: boy is unpopular in high school, boy gets shot with an overcharged love gun that makes him irresistible to the fairer sex, boy has to confess his true love to someone and win her over before the day is out or be doomed to be alone. Like we havent seen this in games a million times before. Sarcasm aside, there is no denying that a huge factor of the allure surrounding the Gal*Gun series is the weirdness component. Stuff like this might be popular in Japan, but it is absolutely unusual to Western audiences. Even watching the opening scene caused another staff member to comment that he is probably now on more than a few government watch lists.The story of Inti Creates Gal*Gun: Double Peace alluded to before centers around Hodai, an affable but unpopular lad who becomes the target of an elite angel in training. Her job is to get him love. Needless to say, she screws it up. This is due to becoming distracted by a mischief causing demon named Kurona. So, Hodai is given the run down, and he finds himself ducking unwanted advances from the other girls as he works to win over the lass that he most desires. (This is chosen by the player, requiring multiple playthroughs to see everything.) There are two extra wrinkles, though. First, the girl of his choice is not affected by his overblown charisma. He must win her by showing kindness and being helpful with whatever task they are trying to accomplish. The second is that Kurona has infected many of the females with little, adorable demons that make them extremely interested in being dominatrices.Still, Hodai is not helpless. With the normal stages operating like a rail shooter, his dripping sexual machismo also affords him the use of a pheromone gun. This allows him to shoot oncoming girls, causing them to experience ecstasy. The player who is quick to scan the target can discover their weakness, which can be head, torso, hips, or legs. Hitting the proper spot earns the equivalent of a head shot. That previous sentence almost ended in a horrible, inappropriate pun around the term head shot, for the record. Damn standards of decorum. Anyways, the demon possessed lasses need to have the demons shot off before they can get a taste of the little death. As these levels go on, players can become overwhelmed. Fortunately, there is a way to clear out rooms by using Doki Doki Mode. Hit the button, and select the girls to be taken in (up to three), and get whisked away to a focused mode where the player must find where the lasses liked to be rubbed or lightly touched, using either analog stick and square on PS4 or the touchscreen on the Vita, to fill up a happiness bar. Filling all the bars earns success, and they drop a Doki Doki Bomb, causing the remaining onscreen girls to gush. In happiness. (I meant happiness, dammit!).During these stages, there are also secrets and items to be found for fulfilling requests. Finding a wanted backpack, for instance, will result in bonus feathers that can be used to purchase power ups in between levels. These include groin guards to take less damage to the jewels, and ear plugs to help with the damage that can be caused at ranged from girls firing solidified confessions of love at the player. There are other stages that involve physical contact. For example, one girl gets stuck in a window, and must be relaxed to get her out. The player scans here body to look for icons to shoot, and hearts to rub. Get enough of these, and the player will be asked to rub the touchpad or screen a specific way. Doing this three times clears the stage.It should go without saying that this really isnt a game that encourages play on a bus ride or airplane trip. Despite the fact that everything is presented in a way to tickle the funny bone as opposed the (yeah, this isnt getting through) bone, someone unfamiliar with the game glancing at the screen would result in an uncomfortable conversation at best. Plus, the long loading times on the Vita version makes it more of a slog when compared to the PlayStation 4 version.With the added Mom Mode that converts the screen to look like an old-school RPG should someone walk in during play (which is more of a joke than a requirement), the PS4 is the better version overall. The question as to whether or not Gal*Gun: Double Peace is a worthwhile title to play period is another question. My personal answer would be yes. I love rail shooters to the point that I have subjected myself to the excruciating Heavy Fire series. Im even eyeballing the notoriously awful Rambo game. So, having a game that scratches that itch with a healthy dose of self awareness and humor works great for me. Its fun, and it makes me laugh for the right and wrong reasons.There is also an interesting debate that could be had around the concept and portrayal of girls in the game. Some might balk at the options given. For example, the scene involving the lass stuck in the windowsill features a choice, with the options ranging from think hard for a solution to lay down a drum beat on her ass. If someone wanted to find a game to be a scapegoat for gaming cultures famously poor behavior towards women, this would be it. The thing is, unlike some titles that have a character telling the heroine that she is lesser because she is a woman and she just agrees, this game isnt intended to be disrespectful in a mean spirited sense. The women here can and will smack down the male, and none of the heroines that receive characterization are helpless. That is just my two cents. A more thoughtful discussion can be had from both sides of the argument, and both can bring up great points. Closing Comments:It should be confessed that I told my boss that I would play this game while rocking panties. This did not happen as my wife did not want to share and I was too cheap to buy some in my size. So I probably didnt play this game the way I should have. Still, even failing to experience this game in the proper way, I have to confess to enjoying it quite a bit. It actually made me laugh out loud and manages to retain its charm even after the novelty of the weirdness wore off. Being a game that requires quick reflexes and a tolerance for sexually-charged humor sets it apart from the other titles that vie for gamer dollars. So, it is with great bravery I will stand up and say this loudly: my name is Alan Smithee and I like Gal*Gun: Double Peace.", "date": "Bohn on July 22, 2016", "grade": 4.0}