{"name": "Mobile Suit Gundam Extreme VS Force", "ref": "https://hardcoregamer.com/?post_type=post&p=217488", "text": "Gundam is a series that owes its popularity to its longevity. From the outside, that same longevity is also its curse. Without a true guide, one simply doesnt know where to begin with the series history and extensive lore. As an example, a simple experiment can be conducted. Find someone unfamiliar with the series and sit them down in front of episode one of Gundam Wing. The deluge of questions will cause both the subject and the experiment conductors eyeballs to melt. Bandai Namco seems to realize this and tried to set up their latest game, Mobile Suit Gundam Extreme VS Force, in such a way that even series plebeians can follow along.Starting up the single player mode introduces the player to two virtual navigators. They explain that the player is taking the role of a time travelling AI. See, humanity is on the precipice of destruction, and the only way to survive is to evolve. The AIs function is to travel back, and take the role of key figures from the vast Gundam universe. As the player completes missions using these characters, their understanding of that person increases, improving the data gathered for evolutionary purposes. This is all long hand for saying the character levels up and gains new passive perks, like increased range. As the player accomplishes various tasks in missions, such as clearing it quickly, they will be awarded Haro Medals, which increases the amount and strength of the units that can be brought into the battle.With the baseline of these systems overlaid on top of an arcade series, the result should be a quick, snappy game that provides an endorphin rush during the battles, but allows for some depth with these trimmings. The mission types themselves have some variety to them, such as defeating a small group, strategically capturing bases around a map, or taking on a giant ship before it can crash into the players home base. It should be perfect fit for a portable system. In practice, though, the battles are plodding and a bit irritating. This comes down to the feel of the controls and movement of the suits. Part of Gundams appeal is in the quickness and high mobility of the mecha. These things can zip around, strafe and lay down some fire while looking badass. In this game, the navigating the larger maps is an arduous, painstaking affair. The capture maps, for example, require the player to travel for a minute or more after a respawn before getting back into the thick of things, even when making liberal use of the boosters. For those familiar with the 90s era Mechwarrior games, they tend to move at about the pace of an ASN-21 Assassin. There will be quite a bit of plodding back, too, as the lock on system is atrocious. In battles with numerous enemies, it is often advisable to select the either the closest or most threatening enemy in the vicinity. During play, though, this would never be the one chosen when hitting lock on. It seemed to always select an enemy that is off camera, doing their own thing while the players Gundam is riddled with lasers and sword slashes. Using the right stick to switch targets does help, but typically requires some time until the correct one is selected. One the desired target is chosen, a new enemy has made hash of the player and its time to respawn and traipse back. It would be easy to ignore the lock on system, but the enemies are frequently more nimble than the player. The only way to reliably land a ranged or melee hit is with this function. The issues with combat is further compounded by the frequency of getting stun locked. It seems like every other attack that the enemy lands will knock the player on their ass. During my time with this title, I spent more time on my back than Axl Rose on a particularly stringent whiskey bender. It got to the point where I just didnt even want to bother anymore. There never seemed to be a reliable strategy to counteract the issues, whether trying a mission with a different suit, or attacking the map a different way.One could argue that these issues occurred because of a failure to use the command system effectively. Hitting the left bumper does bring up a map where AI teams can be ordered around along straight paths. In theory, this would allow some strategy as the player feints with one group while pushing earnestly with another, and then falling back to base as needed. This falls short in two ways, though. First, its only available on certain missions, which is a shame as this function also allows access to spending force points to repair the player and teammates, alleviating frustration. Also, ordering the AI to do anything other than hunkering around the home base or ship that must be defended results in a pretty reliable loss. The opponent AI will make a beeline for the endgame and destroy it if it is not swarmed with every available unit.The game does feature an online mode, which has all the makings to be entertaining. To my frustration, I was never able to establish a game during testing, other than one that disconnected halfway through. I dont believe it was a rage quit on the other players part, as it was most certainly anyones game at that point. What little I was able to play seemed lag free, and had the potential to be more enjoyable than the campaign. To put it succinctly, dont snag this to play online with random people. Should there be an established group meeting up, the mileage that this game has built in does improve greatly. Closing Comments:Somebody who just picked up this game would probably express some confusion regarding the issues raised in this review. Early missions actually make a great impression, as they are perfectly paced, offer challenge and encourage experimentation with the wide variety of suits that open up early on. Unfortunately, it doesnt take too long for the issues to become glaring. The single player campaign becomes a miserable mess where the only real path to succeed is to ignore the features that are supposed to add depth. Picking it up for multiplayer is something that can only be recommended to the most dedicated Gundam fans with a preexisting group of like minded people, but even for fans there are better series titles available.", "date": "Bohn on July 20, 2016", "grade": 2.5}