{"name": "Daydreamer: Awakened Edition", "ref": "https://hardcoregamer.com/?post_type=post&p=217186", "text": "Everyday life is generally boring, so it is not uncommon to drift off into a daydream where I can imagine myself going on Spaceman Spiff style adventures killing many strange alien creatures. Or least when I was younger, we wont get into what my daydreams consist of these days. Now try to imagine the reverse scenario, where mundane everyday life is an ongoing dream and the reality is you are being kept in a state of suspended animation by alien lifeforms that conquered the world and nearly drove humanity to extinction. This is not the plot of the next Matrix movie, but of Daydreamer: Awakened Edition.It is clear the dream is dead when the protagonist, who will be henceforth referred to as Jamie, is sitting in a classroom talking to a giant creature that resembles an elephant trunk. Jamie learns that the human race has been wiped out by an invading alien race. As the lone survivor, she has been stored as a trophy of the conquest of Earth, a memento of the species they exterminated. The scene cuts to Jamie in one of those cylindrical clear casing with its life sustaining fluid draining and finds herself in the remnants of this world that is now occupied by alien creatures and deadly robots.Daydreamer is a throwback title to the 1990s, which includes the elements that made those games great but also the elements that made them infuriating. There is a tutorial that is blissfully brief and helpful though not entirely necessary. No time is wasted in throwing Jamie into the heat of things where she is shooting and platforming for survival against brown creatures that have large teeth and no eyes. Since this is an old school experience, there is no regenerating health or checkpoints every five seconds. Most levels have a checkpoint somewhere in the middle of the level and one at the boss, but thankfully the levels are short enough having to start from scratch after a poorly executed jump isnt too aggravating. Luckily Jamie has some powers that assist with navigating the broken and bizarre world in which she has awakened. She is able to create a temporary barrier and teleport across gaps that are too long to safely jump across, probably a side effect of being kept in suspended animation in that tube. Traversing moving platforms that are intermingled with spike traps and flying enemies can become less taxing with her slow time ability. Assuming she had human friends, all of them are dead and are of no help to her, but she can get pets to help her There are a variety of animal pets to choose from that provide different types of assistance. She starts with a turtle that can be summoned to heal damage, but a personal favorite was the pet cat that somehow is able to fly around and provides extra fire power. The cat meows a lot while doing so, so its hard to tell if the cat is hurt by shooting bullets or if just wants to be fed. The developers were able to realistically recreate the random and nonsensical way in which cats meow and you can never figure out what they want.Getting back to where this game succeeds and fails as an old school platforming shooter, first and foremost it is enjoyable in the way those types of games are. The action is fast paced, Jamie is always fighting something or running and jumping. Those floating stationary platforms and moving platforms that really make no sense in the realm of real world physics but fun to jump about in video games are all over the place. The multitude of weapons and powers Jamie has at her disposal give a feeling of power, whether they are being used against hordes of peon enemies or against the large boss monsters. Jamie can carry up to four different guns at a time, and these can range from flame throwers, helix shots, spread guns, and hand held nuclear explosions that Jamie is somehow immune to. Daydreamer has all the action one would expect in an arcade shooter of yesteryear. The controls could have benefited from a little more fine tuning. Nothing is ever so bad that it makes the game unplayable sometimes directing attacks and low crawling enemies or using wall jumps to leave the life restoring hotel room do not happen as smoothly as one would hope.The visuals in Daydreamer are fantastic. Overall the creatures design is creative and they look like they have a tactile component to them because of how high quality the sprites are. The appearance of the giant rabbit with deadly eye lasers makes me want to pet it. To contrast the levels that look like a cold industrial wasteland, there are other levels with happy looking clouds that have to be an homage to Super Mario Bros.It may be a long one, but Daydreamer can be completed in a single session. Most levels can be completed in ten to fifteen minutes, and for trophy hunters there is one that can be earned for completing the game in under two hours. It does have five difficulty levels, including Ranked which is where you compete against other players online for quickest time and highest score, but this also serves as the hardcore mode where there is only one life to live. Closing Comments: Daydreamer: Awakened Edition plays like an early 90s platformer but looks like it belongs in this console generation. It does contain some of the frustrations of games from that era, but it also gets it right when it comes to what made those games memorable. The art style and creature design is among the highlights; the graphics are what made me take interest in this game and the gameplay was good enough to maintain it. With so many retro-style games using 16-bit graphics, its nice that we are getting some titles that illustrate what an old school game with modern graphics could be. It might not break any new ground, but those looking for an old school shooter should take a look at this title, which is well worth the asking price of ten bucks.", "date": "July 18, 2016", "grade": 3.5}