{"name": "Pokmon GO", "ref": "https://hardcoregamer.com/?post_type=post&p=216689", "text": "Even with all its flaws, Pokmon GO has taken over the world. Well most of it, since its still not available in a lot of countries, but still, Pokmon GO has become a phenomenon in a matter of days, which is not only a testament to Pokmon, but also to Nintendos sidestep into the mobile space. Miitomo was alright, but it seems this new augmented reality game from Niantic is the one that captured the attention of the mobile audience.What Pokmon GO does right is that it captures the nostalgia of those whom have played the original games and also captures the sense of exploration and adventure that Pokmon has always been about. These feelings are amplified when using augmented reality, which means that the game uses the camera on your phone to overlay the Pokmon you are trying to catch into the real world. It is kind of a gimmick, but the fact that you are catching Pokmon in your backyard or at the mall down the street is just so hilarious and fun. The act of actually catching, training and battling your Pokmon are all simple tasks. To catch a Pokmon, just tap on it when it pops up on your map. Youll go into an AR mode where you throw Pokballs at the creature until its caught. Training is more like leveling up, as youll just feed your Pokmon the candy that you get from catching them. This makes catching every Pokmon in sight extremely beneficial, because even though you already have seventeen Pidgeys, their candy will work to level up your Pidgeottos and Pidgeots too. Battling, for now, can only be done at gyms, where youll fight the Pokmon that were left there by other trainers to defend the castle, so to speak.While the main elements of the game are all simple, they really dont have to be deep because you are running around town with your friend(s) to do it. They let you focus on the social aspect of it all and that is Pokmon GOs biggest strength. Recent statistics from Fluent have shown that 70% of Pokmon GO users say that the app has made them more active, 60% have used social media less because of it, and 57% of users say they visited a new store or restaurant just to find Pokmon.People on Twitter have been raving over the apps usefulness as a way to reduce social anxiety, too. It has been great for me to see people around my hometown walking around  with their phones out, sure, but they are with someone and they are talking. Personally, Ive talked to at least ten strangers whom were also using the app and nothing was awkward because we had a common interest immediately. In this regard, Pokmon GO is a masterpiece, and as the app gets refined, I can see it becoming more and more a force for social interaction between young adults.Pokmon GO needs a lot of refinement, though. Its battle system, its lack of a useful tutorial and its many bugs keep it from being a great app as a whole. It crashes often, its GPS is wonky and sometimes the little Pokball that spins as it loads just doesnt stop and you have to quit out of the app and start over. This can be frustrating, especially in situations where you are trying to get steps in to hatch an egg or when a Pokmon that youve been searching for gets away because you were booted to the home screen.Battling gyms, while exciting when you become the leader, is somewhat lacking in its current state. It turns into a tap-to-win type game, where you tap the enemy as many times as you can. A battle system more attune to, or a complete copy of the original games would have worked just as well, and it begs the question why they chose this tap system over the one we already know and love. This and many more features have already been discussed, but until then, battling will seem a bit boring.Closing Comments:At its core, Pokmon GO is one of the first popular AR games and another Wii-like success for Nintendo, but its riddled with bugs and comes up short on some of the biggest tenants of the Pokmon franchise. Pokmon GO pushes people to go outside, explore their town and interact with others, and thats what gives it its potential. After a couple updates, Pokmon GO might be one of the coolest, most socially constructive games ever. Mobile seems to be a good place for Nintendo, especially since this is only their second foray into the space. Its exciting to think of what Pokmon GO could become and if you havent downloaded it already, do it. Its free, there are no ads and even people who dont know what Pokmon are have been having a good time with it.", "date": "on July 17, 2016", "grade": 3.5}