{"name": "Star Wars: Knights of the Old Republic II: The Sith Lords (Switch)", "ref": "https://hardcoregamer.com/?post_type=post&p=423268", "text": "A long time ago in a galaxy far, far away, Microsoft dealt a crushing blow in the console wars that set their enemies in Nintendo and Sony scrambling to maintain their galactic dominance. While the two rival forces were struggling to maintain their position at the top of the consoles after Microsofts Xbox hit them with some surprise exclusives, the new console doubled down on the success of KOTOR with Star Wars: Knights of the Old Republic II: The Sith Lords. The Star Wars sequel helped ratify the claim that Xbox was a new console brand that has serious staying power, but eighteen years later with the console wars still waging between the three different empires, this Sith Lord has betrayed his Xbox master and Switches over to Nintendos current gaming platform.KOTOR II takes place five years after the events of the original, which is still in the ballpark of 4,000 years before any of the Star Wars movies. The new protagonist is a Jedi knight who was exiled from the Jedi Order, who will henceforth be referred to as the Exile. As if being exiled wasnt bad enough, the Exile begins the game under heavy sedatives on a cruiser being delivered to a crime syndicate known as the Exchange who put out a large bounty on live Jedis. During the Exiles escape the player encounters Kreia, who after forming a Force bond with the Exile takes on a mentoring role.The events of the first KOTOR will vary largely among players. Such as whether or not someone was a Jedi or Sith, male or female. Theres a point early one where the player is involved in a conversation where matters pertaining to KOTOR are discussed. This is an opportunity to fill in the blanks to create a galaxy molded by the choices the player made in the original or offer up an alternative account of what happened to see how relevant those actions were to the the Exiles story.Being as this is a Star Wars game, interplanetary exploration and assembling a rag tag crew of allies is a major component of the adventure. Most of the characters who join the Exile are new to the KOTOR universe, but a few familiar faces show up among the group of meatbags. One of the strengths is how everyone has a developed personality and different goals and alignments, making player choices actually matter as far as group cohesion goes. Pleasing everyone in the crew is impossible, but as the Exile advances more toward the Light or Dark side of the Force, bonds with certain members will strengthen or weaken. Most of the planets the Exile travels to are new destinations, but returning to Dantoonie and Korriban will show the toll that Malaks war has taken on these familiar environments.Like its predecessor, this is based on the d20 Star Wars tabletop role-playing game. The Exile can choose one of three different Jedi classes and build their skills and Force powers to fit the type of character thats best for their playstyle. KOTOR II places heavy emphasis on story and exploration, so a lot of time is spent talking to the varied NPCs throughout the worlds and getting involved with their affairs. Because choice is a major component of KOTOR, the Exile deals with these situations can have many varied results, much to the delight and dismay of party members. Combat is fought in real time where the player issues commands to one character while the other two active party members are controlled by AI. Switching party members is quick and easy, and sometimes necessary since the AI isnt always the brightest. This battle system works well for this title, but given that the game will be of legal voting age before the year is up, it does feel primitive compared to modern iterations of this format. This shouldnt bother KOTOR veterans, but those experiencing it for the first time may find it feels like a relic.KOTOR II is a great RPG but doesnt quite escape from the shadow of its predecessor. The story is great, and having three antagonists helps distinguish it from the original. The graphics and gameplay dont show any major improvement over the original, though arguing that 2004 graphics should be better than 2003 graphics in 2022 seems silly. The story and how player choice can change the narratives direction is the main reason to play and does give considerable replay value to the title. Depending on if the the player chooses to have the Exile walk the path of Jedi or Sith can drastically change events in the game, so like the original, its recommended to complete at least two playthroughs for the full experience.Though not recommended, KOTOR II can be played without experiencing the original without having the player feeling lost. The Switch port looks like the original release, but the visuals were given the HD touch up. Its a product of its time so the character faces and models still look how they did but in higher resolution. It was not available during the review, but post-launch The Sith Lord Restored DLC will be available for free in the eShop that includes a bounty of bonus content, the highlight of which is a bonus mission starring HK-47. When KOTOR II was originally released on Xbox, personal experience was bogged down with many bugs and several instances where the game actually crashed. I can thankfully say that the review playthrough on the Switch did not suffer from a similar bug infestation.Closing Comments:Star Wars: Knights of the Old Republic II: The Sith Lords had a tough act to follow, but does an admirable job of creating the next chapter in the Old Republic. As a sequel it fails to surpass the high standard set by the original, but its still a great game and a must play for Star Wars fans. The story is one of the stronger ones in the Star Wars universe and the ability to mold it through player choices is the main attraction in KOTOR II. The dated mechanics and graphics benefit a lot from nostalgia goggles, but it holds up well enough where newcomers can still enjoy it and find it a worthwhile adventure.", "date": "June 8, 2022", "grade": 4.0}