{"name": "PixelJunk Monsters 2", "ref": "https://hardcoregamer.com/?post_type=post&p=300384", "text": "Its hard to believe that its been over a decade since Tikiman made his debut protecting his Chibi children from the vile monsters that have invaded his realm. PixelJunk Monsters has been entertaining players ever since its initial release, receiving some expansions and reissues, but never got a proper sequel until now. The original was praised for its challenging but accessible approach to the tower defense formula, but even the best made games show their age after a decade. PixelJunk Monsters 2 ushers in a new age of Tikiman, with shinier new graphics and a fully-rendered 3D world where he must keep his defenseless Chibis safe from myriad horrors.PixelJunk Monsters 2 is not one of those games that has a great deal of story development. The player takes on the role of Tikiman, who uses a combination of Tiki magic, gold coins and gems to weaponize trees by turning them into defense towers to protect the Chibis, which look like miniature versions of Tikiman. Ideally all Chibis should survive each level, but as long as at least one survivor remains the level will be considered successfully completed. At least, a partial success that will open up another level within the area.PixelJunk Monsters 2 is divided into five areas, each with three levels. As expected, once level one is completed level two opens up. The tricky part is to move to new areas the players need to have a certain number of rainbow fragments and these are obtained by completing a level with no casualties. Completing a level is easy, even on the hardest of the three difficulty levels. Completing a level without any Chibi fatalities requires some skill and strategy, even on the easiest of the three difficulty levels. The challenge is actually part of the fun in figuring out the best way to complete each level, though it can be frustrating when youre on the penultimate wave of enemies and one fat bat happens to get past your defenses and takes out a Chibi. There are several different monsters that will be making their way through each level, but they all fit into one of two types: ground or airborne. Tikiman has three different categories of towers he can build, which are ones that target ground enemies, airborne enemies or both. As is the standard rule of video games, the ones that target both tend to be less effective than the specialized weapons are at their specific type, but have the advantage of being able to attack anything. Finding the right balance between the weapon locations and which types work best in each area takes a bit of trial and error but there are some interesting combinations to be had.Tikiman has a limited arsenal at the start of the game, and some types of weapons require both gold coins and gems to construct. Gold appears from killing enemies or randomly knocking coins out of trees, which is also where gems come from but they are much more rare. Early on Tikiman is restricted to cannons for ground monsters, anti airguns for airborne and ballista for both but more options can open up. If Tikiman can save up some coin and gems he can construct a bee hive, which will unleash swarms of patrolling bees. The tesla weapon has a slow rate of fire but covers a wide range and is powerful, so putting an ice cannon in front of a tesla-guarded choke point can spell disaster for the enemies. The levels are done through a series of waves of monsters until the final wave when the boss monster shows up. The waves of monsters start out predictably enough and follow the same path for the first few waves but soon figure out there are other paths. This requires some scrambling of Tikiman to put up defense towers in new areas and may have to scrap the current ones for some quick coin. This can get hectic on harder difficulty levels but again the fun lies in the fast paced challenge. The boss looks like one of the Easter Island heads after being exposed to Hulkifying doses of gamma radiation. The bosses release their own swarms of enemies and can fly if they feel like it so having a diversified defense system is key.The music of PixelJunk Monsters 2 isnt bad but it does repeat its looping cycle too quickly and too often. The graphics on the other hand are a standout feature, where the claymation-inspired visuals make everything look real. Playing through this made me want to touch Tikimans mask on several occasions. No one wants to go to a luau alone and PixelJunk Monsters 2 supports local co-op multiplayer for two and online multiplayer for up to four. Resources are shared during co-op so communication is key for success and the co-op mode does not affect the players online ranking. Closing Comments:PixelJunk Monsters 2 is a lot of fun either because of or despite its simplicity, though trying to collect all the rainbow fragments to progress to new areas can get frustrating as obtaining those requires perfection. PixelJunk Monsters 2 doesnt do anything to revolutionize the tower defense genre, but what it does do is provide an enjoyable experience based on a tried and true formula. Someone skilled at tower defense games could probably complete all maps on the default difficulty in five or six hours, but trying to save all Chibis across all difficulty levels will take substantially longer. PixelJunk Monsters 2 is straightforward enough to be enjoyed by casual gamers, but trying to perfect it on the highest difficulty will provide a worthwhile challenge to the hardcore gamers.", "date": "May 26, 2018", "grade": 4.0}