{"name": "The Quarry", "ref": "https://hardcoregamer.com/?post_type=post&p=423309", "text": "If youve read any of the reviews of the Dark Pictures Anthology games by this writer over the past few years, you may have gathered that it becomes harder and harder to write new critiques of a series that sticks to the formula established by the developers biggest hit, Until Dawn. Not that these types of games arent fun, but Supermassive havent exactly innovated much over time. So I was a bit excited to see that their latest game, The Quarry, was seemingly going to switch things up a bit in small yet notable ways. Everything about it seemed to have another horror classic in the making this time around, but did we get another true bone-chilling blockbuster or just another low-rent b-movie?The Quarry is the story of nine teenage camp counselors who, after a successful summer at Hacketts Quarry Summer Camp, find themselves stranded for one extra night after one particular individual decides to sabotage their ride in order to have one last shot at their summer love. Camp head Chris Hackett isnt exactly pleased with development, and urges the remaining counselors to just hunker in for the night. They decide to say screw it, though, and hold one last party, which goes well until an awkward game of Truth or Dareand then goes south even further when mysterious monsters appear in the woods, followed by what appear to be crazed hunters soon afterwards, followed by an attempt to try to survive until morning.Now, that may initially sound like the game is little more than an Until Dawn sequel with the serial numbers filed offand I wont deny that it gives off those vibes, especially as the plot advances and the gameplay becomes familiar. I had discussed the gameplay tweaks in The Quarry in an earlier preview, but now having experienced the full game, they come across less as tweaks and more like the Taco Bell approach to things. You know, the same batch of ingredients, just rearranged in a different way. The combat sections with the shotgun are basically a different form of choices to make, the Dont Breathe mechanic to avoid detection is similar to controlling ones heartbeat in other games and just has you waiting for red lights to vanish, the collectible tarot card visions are now delivered at the ends of chapters instead of immediately, and you only get to choose one vision, etc.But theres nothing wrong with such an approach as long as the game is still fun, and The Quarry still delivers in that area when it comes to gameplay. Plus, the subtle changes still lead to some more streamlined and improved gameplay thats easier to get into, and there are improvements in certain areas, like giving players wider areas to explore at their own pace with more camera control, making it easier to hunt for bits and pieces to examine, collectible clues for various mysteries (which are admittedly not as impressive compared to Supermassives other stuff) and a new type of collectible, evidence, that can alter the ending.Looking back on it, while The Quarry still delivers good gameplay, be it through QTEs or exploration, the focus here seems to be more on crafting your dream horror film, further emphasizing what you want to check out and what choices to make, giving you time to figure out what might lead to the counselors living or dying, whatever you desire. The unlockable Movie Night mode (gained after one successful completion of the story) is proof of that, allowing you to not only watch versions of the story where everyone lives or dies, but letting you customize each characters personalities in order to decide how theyll behave when it comes to actions and decisions. Honestly, I would have preferred a way to just certain key choices and let me see what would have happened, but its still a nice touch.The Quarry starts out with a strong story as well, with our cast being a nice little motley clew of classic teenage slasher fodder. They have well-crafted, intentionally goofy dialogue, the kind thats cheesy yet charming, and each of them gets to show their hidden depths and insecurities at certain points, delivering a little for insight for a while. The cast is also clearly game for things as well, with Brenda Song as Kaitlyn and Grace Zabreskie as between-chapter fortune teller Eliza being particular highlights (for those here for David Arquette, though, he sadly barely gets to do anything after his initial appearance early in). The style and atmosphere also perfectly lean into the 80s horror film aesthetics, with cool touches like VHS fonts and mock video store covers for the Paths taken in the menu, and Hacketts Quarry is a visually impressive camp overall. So things got off on the right foot.You may have noticed, however, that emphasis on how the plot starts out strong. Because while The Quarry is still a good game and has a nice air of mystery surrounding everything as things advance for a while, there was something about the story as the end got closer and closer that felt unsatisfying. For one, there were a number of questionable character actions and plot holes that started to pop up, both in hindsight and as they appeared (including one blatant part which came up while explaining the storys timeline that actively made me go wait, what happened at the camp during all of that?? and never got addressed again). Granted, no story is one hundred percent perfect (especially in horror films), but it felt like the writing was having trouble justifying some of the scenes and plot elements it had introduced earlier.The bigger problem, though, is that without spoiling anything, the ending feels like a massive letdown. All that happens is a look at what characters ended up living and dying, then a voiceover epilogue featuring none of the playable characters. Thats it. No look at the characters or any satisfying end to any of their arcs or culminations of their hidden depths, no look into the toll the nights effects have taken on everyone or reactions to any later deaths, be they playable or NPC, no scenes with the remaining survivors meeting up, even. Its just who lived and who died, meaning The Quarry ends with little more than the equivalent of flashing your high score.But I guess what bothered me more about such a letdown is how many of the plot points and paths that appeared along the way just sort of dropped off without any actual conclusions. Oooh, Ryan found a mysterious vial after dealing with one of the hunters, andoh, it never comes into play. Jacob found Emmas bracelet on the ground, setting up a possible moment for them to bond over andit never came. What about the love lives of all of the other counselors? Never going anywhere. It felt baffling how a lot of plot points never concluded properly. Even the changes in relationships between characters marked by Kenny will remember that-style messages never lead to anything this time around, save for one character. But after looking over the choices made and the Everyone Lives path in the Movie Night mode, I think I figured out what a big problem might be.At one point, I had successfully created a distraction with one character that help avoid them being captured. Once another character who was captured ended up alone in the woods at the end with nothing happening, however, that felt awkward. And then I realized that both these characters needed to be captured in order to get together and hook up, and as such, I would need to mess up on purpose in order to get the first character captured. And as such, I realized that The Quarry had fallen into a possible trap that such choice-heavy narrative games are prone to, namely that the most interesting plot points, developments and twists are locked behind failure. I realize that a lot of people say that a good horror movie requires at least some characters to die, but this feels like being punished for making the right decisions. Even the the Everyone Lives path in the Movie Night mode leads to the same non-impactful ending. It ends up being a letdown, especially considering it started out strong, meaning that this would-be horror classic got sabotaged by its third act.Closing Comments:The Quarry comes close to being Supermassives strongest successor to Until Dawn yet, but sadly stumbles when it comes to delivering a satisfying finale as the story fails to hit the high marks it sets up early on with its mystery. Still, for those looking for a satisfying horror game, graphic adventure or interactive movie to have a few thrills with, theres more than enough here to deliver a satisfying experience, largely thanks to nicely-honed gameplay and a cast of likeable characters. Give it a whirl if interested, if only so you can play director even further once you finish it and try to find something new.", "date": "June 8, 2022", "grade": 3.5}