{"name": "Highway Blossoms", "ref": "https://hardcoregamer.com/?post_type=post&p=214943", "text": "Once upon a time, finding any visual novel on Steam was impossible. Now, there are hundreds vying for attention on the storefront  not to mention an increasing amount of genre titles on consoles. Its undoubtedly the best time ever to be into visual novels for English speakers. It also appears to be a fantastic year in particular for fans of yuri visual novels. Yuri, for the uninformed, is a Japanese term used to describe relationships (typically of a romantic nature) between women. From titles such as Kindred Spirits on the Roof to The Sacrament of the Zodiac: The Confused Sheep and the Tamed Wolf, were in the most yuri-focused year yet and this love train shows no signs of slowing. Highway Blossoms is the latest release in this subgenre and is worth a playthrough.Highway Blossoms stars two unexpected protagonists. The first, Amber, is driving through the American Southwest on her way to Coachella in a ratty old RV. While zoning out on a long stretch of highway, she catches a glimpse of someone stranded on the side of the road. This helpless traveler turns out to be a young woman by the name of Marina. With her car totally out of gas and nowhere else to turn, she seeks aid from Amber. Although a bit perplexed by the whole situation, Amber goes to purchase gas only to get caught up in something much bigger. The gas attendant lets on that there is a modern day gold rush going on and that people everywhere are seeking the treasure described in a prospectors old journal.Despite reservations, Amber decides to search for the gold since this was actually Marinas goal  and she still has time to kill before the festival. The end result is a short but sweet story which follows the two women on their treasure hunting road trip through North America. Along the way, the duo meets up with an oddball trio of treasure hunters who plan on finding the hidden gold first. Although there are no other notable characters in the storyline, this group makes for quite an amusing (and occasionally, insightful) bunch. The focus on an American rather than Japanese setting is also unique as far as western-developed visual novels are concerned. Its thanks to this focus that developer AlienWorks is able to effectively portray famed locations in Utah, Arizona, and the like with a great deal of respect for their natural beauty.This splendor is effectively transferred into the visuals. Backdrops of national landmarks and parks manage to evoke some of the awe that they command. It also leads to a lot of unique background CGs to keep players entertained visually. Character sprites also look quite good with a variety of facial reactions and poses to keep them lively. There is one odd choice with regard to the graphics, however. It appears that there were multiple artists working on the CGs. The end result is that Highway Blossoms doesnt feel entirely cohesive from a visual standpoint. Then there are anomalies such as Marinas hair color going from blond to dark pink across various pieces of artwork. It also appears there are some graphical issues at the moment that occasionally overlay two character sprites directly on top of one another instead of next to each other. If purposeful, it looks weird.The good thing is that, as far as writing is concerned, there is very little to criticize. Amber and Marina might at first seem rather simplistic characters but are developed surprisingly well over the four to six hour playtime one spends with them on their journey. Theres also a really distinct sense of style from the writer which is able to shine through in part because no translation work needed to be done. Theres always a fear with translated visual novels that something is lost in the process of localization, but thats not the case for original English works! The writing is a great asset as it carries the tale and definitely makes Highway Blossoms stand out as a more believable yuri tale than most. Yes, even when theres the wholly unbelievable aspect of a modern day gold rush with riches simply waiting to be found.Every so often scenes appear to be rushed, but for the most part the flow works very well in Highway Blossoms. One thing to note is that this visual novel is of the kinetic novel variety. This means that you dont make any dialog-based or other choices throughout, meaning everyone gets the same exact story and ending. However, there is a tad bit of replayability in the form of Goofball Mode. One version of this mode adds childish one liners and isnt really all that worthwhile. The EZ Mode, however, while equally corny, is a funny bit and only takes about a minute to read. Finally, there is an adult patch freely available for folks who want to see some 18+ content  or want to see the complete version.There are only two adult sequences in the game (although more may be coming in the future). Both feature full nudity, although neither overstay their welcome or come off as too eye-rolling. Theres no real loss had from ignoring the adult patch, either. You can still easily feel the relationship progress between our heroines even without this patch installed. Finally, its important to note there is no voice acting in Highway Blossoms. Instead, were treated to an acoustic soundtrack. Its a great selection of songs except sometimes they cut off entirely leaving scenes in total silence. Moments such as these draw player attention away from the storyline, albeit not for long.Closing Comments:You do not have to be a fan of yuri to dig Highway Blossoms. In fact, it seems like this is exactly the kind of visual novel to use as an introduction to yuri for those unfamiliar with or unsure of these games. Even with the adult patch enabled, it doesnt feel as though the game cheapens the concept of blooming lesbian romance. Unlike some cringe-worthy games, the characters feel developed and not as if theyre simply jumping into relationships willy nilly. The storyline is sweet, sometimes saddening, and makes AlienWorks a developer to keep an eye on in the future.", "date": "June 30, 2016", "grade": 4.0}