{"name": "Mighty No. 9", "ref": "https://hardcoregamer.com/?post_type=post&p=213820", "text": "Mighty No. 9 is the Mega Bloks of video games. Anyone whose childhood took place around the turn of the millennium will instantly recognize the punchline that was/is Mega Bloks. The idea behind all of the hatred that swirled around this dud-gift of a brand is rather simple: you love LEGOs, you wanted LEGOs and receiving Mega Bloks was a slap in the face. Getting literally zero LEGOs was better than receiving any Mega Bloks, as theyre essentially the equivalent of your parents trying to convince you that Safeway Cocoa Nuggets are the same thing as Cocoa Pebbles. To put it simply, Mega Bloks are depressing. Theyre a sign that your parents or family members knew what you wanted but decided that saving a few bucks is more important than making you smile. If you were a Mega Bloks kid, Im terribly sorry, but your childhood was terrible.If the Mega Man series is the LEGO of pixel-perfect action-platformers, then Mighty No. 9 is, sadly, Mega Bloks. Its shocking to think that what feels like a store-brand imitation of one of the greatest franchises in video game history came from the man who designed the Blue Bomber himself. Theres nothing exceptional whatsoever about Mighty No. 9, which is perhaps the most damning criticism that you can throw at it. Neither a good game, nor a trainwreck, Comcepts biggest game to date finds a way to be playable while still missing the mark on everything that made those original NES Mega Man titles so fantastic. Kickstarter backers have every right to be upset with what theyve received, as Mighty No. 9 feels shockingly by the book, with none of the class-leading level design, notable weaponry or engaging challenge that made games like Mega Man 2 and Mega Man 3 all-time classics.Players take the role of Beck, or Mighty No. 9, a humanoid robot with the power to absorb the abilities of any other robots that he defeats. If this sounds familiar, thats because Mighty No. 9 makes no attempt to hide the fact that its basically a Mega Man game. Players fight eight other robot masters, each with their own stage, in order to gain their powers and use them to eventually bring down a big-bad at the end of a multi-stage finale. On one hand, sticking so close to the traditional Mega Man formula gives Mighty No. 9 the sense of familiarity that fans of the Blue Bomber have been seeking for years. By not straying from this same framework, however, every one of Mighty No. 9s shortcomings becomes immediately evident to anyone who has played through one of the titles it so clearly is trying to imitate. Aside from the fact that certain enemies feel like cheap knock-offs of foes seen in Capcoms iconic series (the final boss feels like the wimpy younger sibling of the original Mega Mans Yellow Devil), every stage varies in quality from bland to infuriating. Theres a shocking lack of enemy variation on display here, with the same handful of enemies showing up in every stage, no matter the circumstance. One of the hallmarks of the original NES Mega Man titles was that every stage felt unique, with distinct enemies, layouts and thematic elements that were unforgettable. Contrarily, every aspect of Mighty No. 9s level design is forgettable and by-the-books.Mighty No. 9 is unique from a gameplay perspective thanks to its dash/combo system. The right bumper of your controller of choice grants Beck the ability to endlessly dash, with the length of that maneuver dependent on how long you hold the button for. Not only does this allow you to make your way through a level quickly and get over longer gaps, but this ability can also be used to absorb enemies that have accrued enough damage. Depending on the color that a given enemy glows after hitting their breaking point, Beck will gain a power-up that increases his attack, defense or speed. Add this to Mighty No. 9s take on the E-Tank, which is gained by absorbing enough foes, and this system certainly has some merit. In a vacuum, Mighty No. 9 feels pretty decent to play, but the settings youre tasked with playing within are uninspired as best. Even when theres a decent gameplay variation thrown into the mix, like chasing Countershade through his looping stage (essentially turning the level into one big boss fight) or passing through a floor-free section where dashes increase altitude, these interesting ideas disappear just as quickly as they arise. Mighty No. 9, despite its relatively tight gameplay, also suffers from a ledge-grabbing mechanic that sometimes simply doesnt function. Nowhere is this more infuriating than in Brandishs highway stage, where grabbing onto a car above an instant-death street feels completely hit or miss. Mighty No. 9s bosses vary from interesting to downright boring, the latter of which is notably damning for a game whose inspiration has so many thrilling boss encounters. The aforementioned Countershade fight is a notable departure from the standard arena fights that fans expect, but having to trudge through a fairly bland stage while avoiding sniper fire is the equivalent of eating an index card with a dollop of chocolate sauce on top. The final boss, which can be cheesed through by using Brandishs sword power to completely negate damage during the first stage, is shockingly boring, and it wouldnt be surprising to see a great deal of players give up on trying to beat it whatsoever. Perhaps the biggest flaw with Mighty No. 9s boss progression is that the stage select menu literally tells you which powers can be used to exploit weaknesses. Not only does this completely destroy the gleeful sense of discovery that made the original Mega Man titles so exciting, but it babies the players to the point where the proceedings feel even more rote. On top of everything, the powers that you gain arent utilized in other stages until you reach the penultimate stage, the Robot Factory, diminishing the sense of reward that was so essential to Mega Mans boss system. Whats wore, players can completely break the combo system through the use of Cryospheres weapon, which freezes enemies in place after a certain number of hits. Theres little reason to use anything other than the standard blaster or this ice-based weapon, making every stage feel exactly the same.Without further ado, lets get to perhaps the most controversial element of Mighty No. 9: its visuals. When Mighty No. 9s Kickstarter was first revealed, the world thought that it was getting a really good-looking 2D title, and while we are used to seeing games receive visual downgrades, theres certainly no precedent for a title to receive a downgrade so severe that it feels like stock Unity assets are being used. Cutscenes (a screenshot from one of which can be seen below) take place in completely empty areas and lack any semblance of animation, outside of characters wiggling back and forth. To say that the production values on display here are lackluster would be putting it likely. When you take a look at the various stages on display in Mighty No. 9, things dont get much better, with the dreaded combination of visible aliasing and flat textures joining forces to create an eyesore. Mighty No. 9 would have looked awful on last generation consoles, so the idea that it looks drab on current generation systems and, in the case of this review, a high-end gaming PC, is disappointing, to say the least.The last couple of delays that Mighty No. 9 received were a result of its online multiplayer components, something that no Mega Man fan ever asked for. This forgettable side-content all takes place in blue arenas that all look exactly the same, and a significant lack of players hanging out on the PC servers make it extremely difficult to find a match. When you do eventually dive into a multiplayer match, theres literally nothing that a second player adds to the mix, as both players are essentially just moving through the level independently of one another. There are a number of solo challenges that can be tackled outside of the main campaign, and while some of these will test your skills, they feel like they have been shoveled into the package to prevent players from either asking for a Steam refund or trading in their physical copies.Closing Comments:If you backed Mighty No. 9s Kickstarter, this next sentence is going to sting a little, despite the fact that its something that youre well aware of by now. The phrase that best describes Keiji Inafunes infamous spiritual successor to the classic action-platforming franchise is aggressively mediocre. In fact, Mighty No. 9 is such an average video game that reviewers could give future mediocre games a Mighty No. 9 out of ten and it would serve as a perfect indication of their quality. Despite spending eleven hours messing around with every element present in Mighty No. 9, this is something that was evident from moment one. All jokes aside, when you consider the hype and attention surrounding Inafunes return to the 2D platforming realm, the fact that this is what weve received is nothing short of a massive disappointment. From its bland level design to its boring Playmobil-style aesthetic, Mighty No. 9 is a testament to everything that can go wrong with a crowd-funding campaign. Considering that Comcept is already talking about making a sequel, this likely isnt the last weve seen of this store-brand version of the Blue Bomber. Maybe Mighty No. 9 2 will be the Mega Man rebirth we so desperately desire, but at this point, Inafunes attempted return to glory is a bona fide swing and a miss.", "date": "June 23, 2016", "grade": 2.5}