{"name": "Dragon Fantasy: The Black Tome of Ice", "ref": "https://hardcoregamer.com/?post_type=post&p=210783", "text": "When reflecting on any franchise whose longevity has crossed several consoles, the evolution of the franchise can show a level of growth in which latter entries only have the faintest echo of their predecessors. Dragon Fantasy, a series that is a mere two and a half games has already shown a level of growth that covers approximately a decade of progress from the 8-bit and 16-bit era. The original Dragon Fantasy was an 8-bit adventure patterned after the NES Final Fantasy and Dragon Warrior titles. It was an enjoyable retro style game but showed greater potential than what was actually delivered. Dragon Fantasy Book II progressed in leaps and bounds beyond the original, adopting a 16-bit graphic style and drawing influence from classic SNES RPGs such as Secret of Mana and Chrono Trigger. Keeping the originals cast of characters and tongue in cheek sense of humor, this was an improvement on the original in every way. Dragon Fantasy: The Black Tome of Ice is an enhanced re-release of Book II.The story is a continuation from the events of Dragon Fantasy. The plot draws on many RPG tropes in terms of pacing and events but does so in a humorous way. There are subtle nods to other celebrated games of the genre, as well as a few pop culture references thrown in for good measure, one of the better ones being Professor Frink. Once again the main protagonist is the bald headed, ginger bearded Ogden, the 46 year old once legendary hero who lost his hair in a battle with a dragon at age 16. He was enjoying his retirement from adventuring with a cushy job for the royal guard when an attack by the Dark Knight forced him back into the adventurous life of heroism when he was still living in the 8-bit world. Playing through the original will naturally enhance the enjoyment in the new and shiny 16-bit world, but aside from missing out on some references to the original it is not required to appreciate The Black Tome of Ice. The married monsters Mr. and Mrs. Rock are back in the sequel and still attack our heroes by crying in their chardonnay or complaining about marital issues. They are joined by new comers such as David BowElf, who upon defeat battle exists stage left. In the world of Dragon Fantasy, enemies simply do not attack or get defeated, instead their actions are given humorous descriptions.The battle system has been completely rebuilt and improved. Gone are the random battles that seemed to occur approximately every three steps and has been replaced by a system modeled after one of the best of the SNES RPGs, Chrono Trigger. Enemies are visible moving about the map, and getting too close to them or touching them will start up a turn based battle. In these altercations proximity plays a role as many special attacks and magic spells are based on area of effect as opposed to the popular target one or target all method. This adds a layer of complexity to battle strategy, where targeting one specific enemy with a spin attack could make a fight with many enemies over in a matter of one or two turns. The Black Tome of Ice is Dragon Fantasy Book II with a few upgrades. We are not talking about a brand new completely rebuilt from the ground up super HD reissue, but this is an improved version nonetheless. For starters, the developers made life easier for completionists by adding a bestiary to track defeated and captured monsters, so no longer will those who suffer from Video Game Completion OCD hear their inner voice ask the paraphrased Pokemon slogan Did I catch em all? The Thieves Guild has a local office set up in most of the major cities to alleviate the backtracking associated with checking off the bounty to do list. Instead of having to track down the person who assigned a bounty, this provides a convenient way to turn in an assignment and collect the reward.A difficulty slider has been added to the settings menu, so whether one wants to breeze through the game for the humorous storytelling or create a more arduous challenge this setting can make it so. The combat and storytelling has been tweaked to make the overall experience run just a little smoother, along with an extra boss being included because when it comes to big bad boss monsters in RPGs the more the merrier.When one searches the web for information on Dragon Fantasy Book II the search typically yields two constants: praise for its brilliance in paying homage to the 16-bit era of RPGs, and the complaints about numerous bugs. Muteki programmers outfitted themselves with an arsenal of Raid and used a capture net on the Orkin Man to enlist his services to eliminate the bug infestation on this otherwise fine game. Due to time constraints I was unable to deliberately seek out every possible scenario to find any survivors of the digital bug hunt, but none were encountered during the course of the review playthrough. With games being released with enough bugs to resemble the mostly forgotten television short Joes Apartment, it is refreshing to see that while this game initially had an infestation problem the developers took the necessary steps to correct the problem.On Sony consoles The Black Tome of Ice for PS4 is included in the cross buy with the PS3/PS Vita Dragon Fantasy Book II. It does share the same trophy list so dont expect another platinum if youve already completed it, but this is the superior version so if youre looking to replay this adventure or already purchased it and havent gotten around to playing it, this is the recommended version. The 3DS makes use of the second screen without reinventing the game. During adventuring the second screen serves as a basic map of the area. In battle touch screen controls may be implemented though inputting them through the traditional method is still possible.Dragon Fantasy: The Black Tome of Ice is the definitive version of Dragon Fantasy Book II. It is a love letter to 16-bit RPGs with its tongue firmly planted in cheek. It may not surpass the fan favorites of that era, but it is a worthy homage and recommended to anyone who is a fan of old school RPGs. The production value results in what can be taken seriously as a quality RPG even though this title does not take itself seriously at all. Finding the perfect blend between parody and tribute is difficult, but here we can see that feat has been achieved. The leap in quality in the sequel compared to the first entry is comparable to the transition that Final Fantasy made when it graduated to the SNES. With this in mind, hopefully Black Tome is not the final book in the world of Dragon Fantasy.", "date": "June 10, 2016", "grade": 4.0}