{"ref": "https://www.gamespot.com/reviews/gauntlet-review/1900-6415890/", "date": "September 29, 2014", "game_name": "Gauntlet (2014)", "text": "In some sense, the world already has a series that carries on the Gauntlet legacy; it's called Diablo, and clearly, it's done all right for itself over the years. That said, while Diablo is accessible, it's not the kind of game you'd have found swallowing up quarters for quick 10-minute sessions back when arcades were still profitable. As such, there's room in the current landscape for something far less ostentatious.The Gauntlet reboot wants so very badly to be that game, and on some level, it is. The formula has changed little since the 1985 original. You have four classes: warrior, valkyrie, wizard, and elf, and after a short introduction to the controls and the personalities--there's some mild but enjoyable Terry-Pratchettesque banter between the heroes throughout--you walk through a door, down a hallway, and then jackhammer the attack button into oblivion for the next six hours, laying waste to skeletons, cave monsters, trolls, and sorcerers. When you're done clearing enough rooms of them, and you've collected enough keys, eaten enough meat, and stolen enough gold, you find the exit. You rejoice. You repeat. The first stages of nu-Gauntlet almost give the impression that the game requires just as little thought as its arcade forebears did. The good news--and the bad--is that this is not the case. Like the best of the best in this genre, Gauntlet does surprisingly solid work making each of the four characters play wholly differently from each other. The warrior is a straight top-down brawler; the valkyrie is a defensive, reactionary, strategic class; playing the elf is like playing a twin-stick shooter; and the wizard is an escapee from a real-time role-playing game, whose attacks involve two-button combinations that change spells from simple fireballs and beams of ice to full on cyclones summoned up to level the playing field. Put all four characters in the same level for some cooperative adventuring, and you've got a field of absolute chaos the likes of which you rarely see. Yes, you can still shoot the food. And yes, the game and your teammates are even snarkier and angrier when it happens.And therein lays the problem. As much as Gauntlet wants to be the freewheeling alternative to other, more complex dungeon crawlers, it also seeks to deepen its decades-old gameplay, but does so in all the wrong ways. Ideally, a game like this would allow the player to slice and dice through enemies in one or two hits, but when all four classes are involved, even the most basic enemies, like the skeletons and mummies roaming the first stages, require putting some arduous work in. If friends are joining you, the challenge contributes to the sense of teamwork that naturally occurs when you have four different skill sets in play. If you're playing solo, you're guaranteed to play each level a few times over because an average grunt was able to demolish you in three hits, and you didn't kill enough enemies to earn a skull coin, the game's elusive version of a continue. All four characters have their own special versions of crowd-control skills--the warrior has a Zelda-ish spin attack, for instance, and the valkyrie throws her shield, Captain America-style--but the expected catharsis of taking out entire fields of your enemies in one fell swoop is nowhere to be found. Most of the time, you're stuck with standard attacks, and none are as precise or as free-flowing as you'd hope.Yes, you do have the ability to level up your characters. You can either buy new gear from the shopkeeper in the hub, or by use of a mastery system which rewards you for everything from killing a certain number of enemies with specials to getting yourself exploded. Pursuing mastery rewards gives Gauntlet a jolt of fun, but the rewards are slow coming, and should you perish during a stage, the game takes away the gold you've collected. And thus the stuff you could really use to get past that hard stage is out of reach until you clear the stage without it. Such cruel, cruel irony.The end result is a game that seems stuck in an uncomfortable middle ground, harboring more intricacy and challenge than the Gauntlet pedigree implies, but too bare-bones of a package to stand tall next to the action role-playing games currently competing for your time. The new Gauntlet has charms, and teaming up to take down the endless hordes is one of its most gratifying ones, but in a game like this, you shouldn't have to fight so hard for your right to party."}