{"ref": "https://www.gamespot.com/reviews/super-meat-boy-forever-review-cant-stop-wont-stop/1900-6417629/", "date": "January 6, 2021", "game_name": "Super Meat Boy Forever", "text": "Every aspect of Super Meat Boy Forever is frustrating in some way or another. It's a runner, so you have to time your jumps and don't have the liberty of setting yourself up perfectly before taking on a puzzle. And despite putting you on a treadmill, its levels demand incredible nuance and precision, which you'll hone through failure after failure after failure. Super Meat Boy Forever will kick you in the teeth and expect you to stand back up, flash a bloody grin, and go after it again. And that's exactly what happens. Though the jumps may be challenging, Forever's incredibly precise controls give you all the tools you need to stick the landing. The runner format is different, but it opens the door for new and interesting types of complex puzzles that spawn new, captivating varieties of spectacular yell-and-throw-your-controller platforming.Like in the real world, time has passed in the Meat Boy universe. Meat Boy and Bandage Girl, whom he saved in the original, have settled down and had a baby, Nugget. In Forever, Nugget is kidnapped, so Meat Boy and Bandage Girl go after her. (You can play as either one from the very beginning.) The story has no material effect on your gameplay, but the short cartoon cutscenes find ways to grab your attention all the same with a webtoony out-of-left-field story chock-full of references to video game canon, adorable woodland creatures, cuddly animals, and the adorable little Nugget, who often proves too adorable for even her captor to ignore.The cutscenes are thus an entertaining reward for hard-earned progress. Following in the original Super Meat Boy's footsteps, Forever lays out levels sprinkled with bottomless pits and buzzsaws that require quick thinking and quicker reflexes to escape. At the same time, it's a very different game. Meat Boy or Bandage Girl constantly runs forward, and you simply control when they jump, slide, or punch. By necessity, the levels take on longer, more horizontally oriented shapes to accommodate the new system. Despite those changes, Forever still retains the essence of Super Meat Boy. Though automated movement theoretically seems like it would make the platforming less satisfying, since you aren't in complete control, Forever's challenge is just as captivating.Forever's finely tuned controls give you precise control and a wide range of motion even with only a couple of inputs. Even though you control all three moves with just one button and the left analog stick, there is incredible nuance to each one. Holding down the button will get you different sized jumps. You have to slide to hit enemies without jumping. Punching in mid-air extends your jump, and landing a punch in the air lets you do it again. It is not enough to press the right button at the right time; you have to be able to feel how far you're going to jump based on how long you press. Exploring and internalizing your controls so that they're second nature is a telltale sign of mastery in most platformers, but it's a prerequisite in Forever.You don't need to push an analog stick to the right, but somehow that seems to make every little bit of the game less forgiving. Forcing you to move and react at the game's pace rather than your own makes hopping simple gaps and traps requires precise timing. More complex combinations of obstacles feel like puzzles and, unlike in Super Meat Boy, you now have to solve them on the fly... or after dying a few dozen times. (Luckily, Forever only needs a second to reload after each death.) Make no mistake: Though levels generally operate from left to right, the path is not always straight through. Many levels have sections where you'll need to jump back off a wall and double back within a room to find your way through the nightmare maze in front of you.Forevers worlds feature familiar themes, like a clear-cut forest and a broken-down hospital, each world has its own unique quirks--enemies and obstacles that add new complications to your path. For example, in the hospital you'll find ghosts, which you'll need to punch mid-jump three times, often consecutively. The ghosts are a problem--you can't jump past one if you don't hit it--but they also create opportunity. Since punching an enemy launches you forward and landing a punch resets the attack, the ghosts allow you to leap across long gaps or bypass traps. Every enemy and many of the traps feature some kind of ~close a door, open a window~ set of mechanics that encourage adaptation and make every hop feel like a calculated decision.The precise pathing and tight puzzles feel all the more impressive when you take into account that the levels are procedurally generated on a playthrough-by-playthrough basis. Even after checking out multiple variations of the first world, I can't say how the levels are remixed from save to save, but puzzles and pathways flow from one area to another without seams. The precision involved, particularly when you consider how demanding these levels can be, goes well beyond what I've come to expect from procedural level design in most games.The design is not without its hangups, however. In a couple of spots, I found that certain enemy mechanics were not so intuitive, making it hard for me to find the way forward. Without a specific, bespoke moment to demonstrate how they worked, the runner mechanic became a serious puzzle-solving liability. Though you're frequently confronted with areas where you aren't exactly sure exactly what buttons to push, the path from point A to point B is pretty clear. But when the signal isn't clear, you can face a truly confounding moment, where it seems as if your constantly running character has run out of road. That can taint the competitive frustration that builds in you over the tough gameplay with anxious anger, and sour the whole game. These moments are few and far between--it happened twice in my playthrough--but the procedural element means it could happen to you more, or not at all.If you can navigate through those less-than-stellar confusing bits, the vast majority of Super Meat Boy Forever feels like clear sailing. Upholding the spirit of Super Meat Boy, it is pure platforming at its most demanding and most thrilling. Forever feels simple because of its controls, but its tough-as-nails levels are perfectly complex, pulling you through and knocking you down with clever challenges. Like Meat Boy himself, the fun, frustration, and motivation never really stop. It builds and pushes you through until you press every button perfectly. You just keep playing and trying and dying until you've had enough. And when you're finally finished, if you've really put everything you had into the game, you might even feel a little runner's high."}