{"ref": "https://www.gamespot.com/reviews/midtown-madness-3-review/1900-6114413/", "date": "May 17, 2006", "game_name": "Midtown Madness 3", "text": "The Midtown Madness series is a collection of racing games that takes place in wide-open representations of real cities. The game puts the focus on getting to the finish line rather than putting it on how you get there. The 2D version of Midtown Madness 3, the first of Microsoft's properties to hit handsets, does an admirable job of capturing its source material's frenetic driving action. Unfortunately, even if the gameplay is a blast, the ride is altogether too short to keep less casual driving game fans on the road for long. Since when were ambulances supposed to cause accidents? Midtown Madness 3 consists of three basic gameplay modes, all of which take place in the famed City of Lights--Paris. The first choice, career mode, is split up into two submodes: paramedic and delivery guy. In paramedic, you're behind the wheel of an ambulance. You have to dash all over the city, picking up patients and bringing them to the hospital before your time limit expires. You get to drive a Mini Cooper in delivery guy, where you must race a rival delivery woman to a series of drop zones. The second major mode, checkpoint, is a straightforward series of races through a number of ordered checkpoints (surprise!) against two other drivers. Blitz, the final gameplay option, is another basic race, except that you can take your route of choice through the checkpoints, which are all present on your radar at the beginning of the race. Each of these major tasks--paramedic, delivery guy, checkpoint, and blitz--comprises four missions/races, representing a grand total of 16 different levels. You're assigned your vehicle for the first two tasks, but you have a choice between the ambulance, the Cooper, and two unlockable sports cars in checkpoint and blitz. Each of these cars has an appreciably different feel, top speed, and mass. For instance, the ambulance has the lowest top speed of the four, but it's big enough to knock traffic out of the way without even slowing down. Minis, on the other hand, are extremely nimble, which is good, because if you run into anything, you'll come to a crashing halt. It's a lot of fun to switch up your ride between levels to see which vehicle will give you an optimum time or provide you with a bit of extra challenge. The game's driving mechanics are generally very good. Your car zips around with a nice sense of speed; cornering works pretty well; and the controls are simple to a fault. There are some occasional troubles with getting hung up on walls, especially when you're trying to take shortcuts through narrow alleyways, but this is a minor blemish on a solid gameplay model. All the action in Midtown Madness 3 takes place from an easily viewable, wide-angle overhead perspective that is always centered on your car. Your heads-up display is attractively laid out and presents a lot of useful information, such as your timer, your speed, a large map in the lower right-hand corner, and how many checkpoints you have remaining. The game's graphics aren't spectacular on the Nokia 6600, but they are clean and very functional, and they offer some nice touches, like flying trash bins and the like. They also run smoothly and at a fast clip, which is the most important graphical characteristic for this type of game. Sound is less remarkable, though. There are some good driving and crash effects, as well as a few looped menu tunes, but overall, the sound's not likely to drop your jaw. However, it's perfectly serviceable. This game's fun, but only for a little while. Midtown Madness 3's major problem, and it's a fairly serious one, is that the game is entirely too short and easy, and it lacks both depth and replay value. There are 16 levels, but the only levels in which you'll be remotely challenged involve a few of the ambulance missions, which you may need to try two or three times. All the levels take place on essentially the same large map, and the gameplay simply doesn't change much, no matter what your objective is. It's certainly nice to have several cars to choose from, but it doesn't make that much of a difference in the game's ability to hold your attention. Additionally, damage modeling of any sort is conspicuously absent. As a result, you can drive like a maniac and cause any number of wrecks without any real consequences, apart from slowing down. Given that the rest of the game's driving physics feel great and are fairly realistic, this comes across as a noticeable omission. In all, Midtown Madness 3 is a fun, well-designed offering...for about an hour. Most players who know anything about driving games will blaze through this one very quickly, mainly because of its lack of content, and they won't really feel compelled to come back. Midtown Madness 3 keeps track of your fastest times, which could provide some ostensible reason to keep racing, but there are no online scores or shadow-racing components to be had. On the other hand, if you're more of a casual gamer looking for an easily accessible experience, and you aren't very concerned with the length of your experience, Midtown Madness 3 may be a good pick."}