{"ref": "https://www.gamespot.com/reviews/jeremy-mcgrath-supercross-2000-review/1900-2619222/", "date": "May 17, 2006", "game_name": "Jeremy McGrath Supercross 2000", "text": "Dirt-bike games compose a decidedly niche genre, but that genre will be growing soon. Mat Hoffman and Dave Mirra will soon receive their own licensed BMX games, but Jeremy McGrath did the same thing back in 1998. Now the 2000 revision of Jeremy McGrath is being released, but unfortunately, not enough has changed for it to really compete with the new guys on the block.Jeremy McGrath's 2000 edition is what you might expect from a 1995 version, had such a thing existed. It features all the standard racing-game trappings: Single race, tournament, and time trial modes are all on hand, as well as a freestyle mode for doing a few Tony Hawk-inspired tricks. You can also create your own tracks through an intuitive, but limited, track editor, and a ~custom rider~ option lets you change the name, number, and uniform of your rider. There's nothing very new or exciting about all of these options - it's just racing with dirt bikes, after all.Of course, those who are into BMX would be thrilled by the prospect of racing a bumpy dirt track on a motorbike. Supercross 2000 doesn't effectively provide that experience, though. There are racing games that provide a gritty, realistic feeling, and there are racing games that gloss over the realities of physics in the interest of smooth gameplay. Supercross 2000 falls squarely into the latter category. All that's really required to place highly in a race is a steady accelerator finger and the ability to steer coherently around the track. Falling off of your bike is all but impossible, even when landing a wild jump at some impossible angle or plowing head-on into a wall at top speed. Though you can select a rider and set various aspects of your bike, like tire grip, such variables have little bearing on the actual outcome of the race. In a nutshell, there's no technique or finesse involved in playing the game.Supercross 2000 isn't anything special in the audio-visual department either. Frankly, it's getting harder and harder to appreciate PlayStation graphics in the age of the Dreamcast and the PlayStation 2. Only the rare PlayStation game contains graphical niceties sufficient enough to really catch the eye, and Supercross 2000 isn't one of them. The game would perhaps be visually palatable if not for the substandard frame rate, but alas, it's a little too jerky to really be pleasing. Jeremy McGrath's music and sound aren't anything special, either. The game's pop-punk soundtrack might be annoying if it wasn't covered up by the constant grating buzz of motorbikes.Jeremy McGrath is an unfortunate example of what happens when sports games fall into a rut. Though the yearly update to such a game may make some improvements to the standard formula, no changes have been made to Supercross 2000 that would really validate a purchase by any but the most hard-core fans. Given McGrath's rather unrealistic gameplay, even they might not find a lot to like here."}