{"ref": "https://www.gamespot.com/reviews/g-force-review/1900-6214994/", "date": "August 7, 2009", "game_name": "Disney G-Force", "text": "With proper training, guinea pigs can be impressive secret agents. They can learn to speak to humans, wear jetpacks for improved mobility, and even wield powerful whips in their tiny paws. Just don't expect them to carry guns. The PSP version of G-Force uses many of the same environments and enemies as its console siblings, but it strips the adventurous rodents of their precious firearms. The lack of powerful, long-range weapons limits the appeal of combat, creating repetitive and often frustrating battles against aggressive kitchen appliances. You can only whip an angry toaster so many times before the thrill fades away. However, when you take a breather from the fighting, the game picks up, relying on deft platforming segments and rewarding exploration to make sure these pint-sized heroes carry their weight. Although the game drags at times, G-Force is still a fun adaptation of the blockbuster movie. For the majority of this 10-hour-plus game, you play as Darwin, the field leader of G-Force. A nefarious being has tampered with the delicate circuitry of everyday kitchen appliances, causing them to attack their owners with merciless force. There is a surprising amount of story interspersed with the action; unfortunately, it's not particularly interesting or humorous. Every few minutes you'll have a brief back-and-forth with your support team, and though these exchanges point you in the right direction, they aren't entertaining and crop up far too often. These interludes don't muddle the action too much, given that you can usually jump around while your objectives are being laid out, but be prepared to put up with a number of groan-worthy puns and cheesy one-liners during the course of your quest. When you aren't stuck in overly long cutscenes detailing the fate of these adaptable rodents, you run around large 3D environments, using your jetpack to reach otherwise inaccessible objects and cracking your trusty whip to take down all attackers. Combat was the highlight of the console versions, taking advantage of a diverse array of enemies and some lethal guns to keep the fighting fast and fresh. But with your guns unceremoniously stripped away in this portable edition, the wild and wooly combat loses its exhilarating appeal. You need only mash the square button to take down most attackers, and though Darwin flips and spins with style, the lack of different tactics or weapons to play around with quickly drags these parts down. As you get deeper into the game, the appliances develop more advanced combat techniques, but this only replaces the monotony with frustration. Flying blenders are equipped with fast-moving missiles, and when you get surrounded by these adversaries, the game borders on cheap. Darwin has no long-range weapons and limited combat mobility, so trying to fight your way out of a room with projectile-slinging enemies is aggravating. At least the platforming is a lot more interesting. Much of the game has you hopping across precariously placed cardboard boxes or gliding up to cramped air ducts, and the smooth controls make it fun to just run around the environments. There are plenty of hidden passageways with collectible discs, and though your only reward for finding these items is unlockable concept art, it's still satisfying to try to uncover all the secret nooks. Because you have a jetpack on your back at all times, your jumps have impressive lift, and you can even use this boost on the ground for a speedy dash. The obstacles are also situated to take full advantage of your jumping prowess. It's a good thing running and jumping is fun because you'll spend a fair bit of time wandering around for your next objective. You can call up your radar at any time to point you in the right direction, but this feature varies between painfully obvious and maddeningly vague. For instance, sometimes you'll be told to ~run up the stairs,~ which couldn't be easier. However, other times, you'll be told to ~enter the second air lock~ only to find out later, after much fruitless experimentation, that you actually need to destroy nine harmless robotic arms before you can move forward. There are also a number of computers that must be hacked before you can proceed, and although this minigame is fun at first, it quickly overstays its welcome. It plays like a rhythm game, with notes dropping from the top of the screen, and you must tap the appropriate button when it reaches the bottom. At certain points of the game, a few of these are crammed in quick succession, and it's boring to do the same thing over and over again to progress. Microwaves are deadly to pacemakers and computer mice. The hacking minigames give you access to the most novel aspect of the game--the ability to control those rampaging appliances yourself. During certain sections, you must command a razor-shooting paper shredder, an ice-melting microwave, and other useful tools, which provide the moments of variety G-Force desperately needs. Although there is little challenge in these sections, it's a lot of fun flying around as the devilish blenders that have tormented you so often and using their missiles to take down a horde of intelligent machines. Savor these moments because there aren't any other cool sections to break up the jump-and-whip action. Without any boss battles to speak of or any other elements to mix up the pace, you'll spend the vast majority of the game going through nondescript government facilities without anything noteworthy happening. G-Force is able to stay interesting because the platforming mechanics are so well done, but a little more variety would have gone a long way. G-Force is an inconsistent adaptation of the blockbuster movie. Younger players should get a kick out of scurrying around the environment, using the jetpack to sprint across the ground, reach high-up places, and hunt down hidden discs. But the combat isn't nearly as thrilling and relies on just a short-range whip for the entire game. The lack of variety is also distressing, although the sections where you can control an evil appliance are fast and rewarding. G-Force may not be able to stand up to the consistently fun console versions, but this is still an engaging adventure that should keep players occupied for more than 10 hours of rodent action."}