{"ref": "https://www.gamespot.com/reviews/dance-central-spotlight-review/1900-6415864/", "date": "September 10, 2014", "game_name": "Dance Central Spotlight", "text": "If the two Rock Band sequels were products of a rhythm game arms race, each installment growing heavier with added features and increased track counts, then Dance Central Spotlight is a move in the opposite direction. Here, Harmonix has pared its stylish Kinect dancing franchise down to its most essential elements, ditching the time-traveling story mode of Dance Central 3 in favor of a renewed focus on the dance routines that sit at the very heart of the game. But it's slimmed down in other ways, too, with a $10 core game serving as the gateway to a musical storefront brimming with reasonably priced songs to build out your own customized library. What's left is a lean but immensely enjoyable dancing game, one that goes out of its way to remove the barriers between you and shaking it on the dance floor.Dance Central Spotlight is more akin to a downloadable starter pack than a full retail product. The core game comes with 10 songs, a genre-spanning assortment of recent hits that ranges from the soulful pop of Lorde's ~Royals~ to the infectious house rhythm of David Guetta's ~Titanium.~ Every one of these songs carries on Dance Central's tradition of excellent choreography, with inventive dance routines and lively animations bringing each song to life. But where Dance Central Spotlight differs from its predecessors is in the amount of content each song provides.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Dance Central Spotlight - Video Review Whereas earlier games offered one routine per song, which then layered in tougher moves as you climbed up each difficulty level, Dance Central Spotlight goes a step further. Actually, make that several steps. See, every song in the game now offers that same primary routine with four difficulty settings, but now you also get two alternate routines as well as much more strenuous cardio and strength exercise routines. These aren't mere variations; they're entirely different dance numbers. As a result, each song has become its own rabbit hole of grooving and shaking, giving you an enormous incentive to dive right back in as soon as the music's over so that you can continue to experience those new moves.That said, the dancing itself is the same as ever. You follow cue cards scrolling along the screen, attempting to mirror the game's impossibly hip assortment of playable characters as they shimmy and shake in various ways. No matter how well you do, it's tough not to find a smile creeping across your face. From the vivid presentation to the consistently outstanding choreography, the simple act of dancing makes Dance Central Spotlight some of the purest fun you can have on an Xbox One.But there is one irksome quality to the game's tried-and-true formula. Do well and you'll see the screen explode in a fireworks display of light and color, with score combos and star ratings going out of their way to tell you just how hard you're nailing it. But botch a move and all you get is a red outline on your character's limbs--the same feedback system that's been used since day one.That minimalist feedback has always been nice because of how non-invasive it is, allowing you to keep having a blast even if you happen to be making a real hash of Rihanna's latest single. But in Dance Central Spotlight, it's a bit at odds with itself. That's because Dance Central Spotlight's progression system requires you to unlock new dance routines by collecting flawless performances on various dance moves. Generally speaking, this system is pretty forgiving; there are so many dance moves to collect that you never really hit a brick wall in terms of progression. But in those instances where a trickier dance move just doesn't click with you, it's hard to tell exactly what you're doing wrong.Nonetheless, other improvements to the dancing experience ease the process of learning new moves. Now you can pause mid-song and jump into a quick practice mode, running through a move over and over again--even slowing it down if you prefer--until you feel comfortable with it. Once you've got it, you can pick up right where you left off. No need to jump out to the main menu and launch a separate practice mode.In fact, Dance Central Spotlight is pretty light on extraneous game modes altogether. There is a neat little fitness mode that lets you design a custom playlist of routine types, set the overall length of your dance session, and then see how many calories you've burned according to your height and weight. But beyond that, there's the song store and little else.But even without the delightfully silly story mode and assorted minigames of its predecessor, Dance Central Spotlight's core offering still delivers a tremendous value. For a mere $10, you get an album's worth of songs that all feature five distinct routines to learn. What's nice is that each song you buy from the store--which run for $2 each, with some bundles offering a small discount--also offer the same generous assortment of choreographies. So whether you end up spending another $10 or $40, the library you assemble gives you plenty of ways to shake it while simultaneously reflecting your own musical tastes.Indeed, Dance Central Spotlight feels like an admission that sometimes you just can't be all things to all people. Rather than beef up the feature list, Harmonix has taken the opposite approach: it's slimmed down the game, offered way more value, and removed the obstacles between you and just getting out there and dancing. It's a different take on Dance Central, but the party is just as fun as ever."}