{"ref": "https://www.gamespot.com/reviews/naruto-ninja-destiny-review/1900-6188194/", "date": "March 21, 2008", "game_name": "Naruto: Ninja Destiny", "text": "Naruto: Ninja Destiny is a shadow clone of a shadow clone, namely, the Naruto: Clash of Ninja fighting games. Whereas those console fighters were a little better than average, Ninja Destiny offers considerably less. For $30, you get a game as bare and skinny as the sexy jutsu. If you're a young Naruto fan you'll probably eat it up, but anyone else will find this game way too shallow to take seriously. The Ninja Destiny story covers the plot of about 100 episodes with a minimum of effort. The stage is set by a wall of text explaining that the final round of the chunin exams are about to begin, and everything afterward is revealed as bad text dialog between unmoving portraits of the characters. Not only is this a sad and anemic approach to telling one of the most beloved stories in manga history, but it also contains a lot of spoilers. You've probably already seen the first 100 episodes if you're reading this review, but if you haven't, this game may be the worst possible way to find out what happens. What's a Rasengan? Wait, no, don't tell me! In return, it offers an hour-long story mode, a 30-minute single-player battle mode, individual matches, and the ability to fight another player wirelessly, provided that you both have copies of the game. In about an hour and a half, you can completely finish Ninja Destiny on the default difficulty. Things get trickier on the difficult setting, but that's mainly due to the fact that the computer opponents hit you on the ground more, and use special attacks more liberally. Still, most of the 16 characters need to unlocked before you can use them, and collecting them can be tough enough to keep determined Naruto nuts busy for awhile. If a friend also has a copy of the game, you might be able to squeeze another couple of hours out of it. However, you should note that squeezing hours out of a game doesn't necessarily mean having fun. Indeed, Ninja Destiny's combat system is so simple it makes thumb wrestling seem nuanced by comparison. You have two attack buttons, a jump button, a special button, a block button, and a teleport-behind-your-enemy button. You move your character with the D pad. If you mash the attack and teleport buttons, you can beat any enemy on Normal difficulty without even looking at the screen. Kick it up to difficult, and the game becomes a little more engaging. Why the game even includes a block button is a mystery when you can just as easily teleport. Of course, teleporting costs chakra, but its debit is repaid with one landed punch. If you land four or five in a row, you'll build up enough chakra for a special jutsu, which in some cases can knock off more than half of an opponent's life. These, by the way, are not interactive. Neji kicks butt. This game does not. The game becomes slightly more tactical when you're facing a human opponent due to the six random power-ups you can choose from during any given match. These are displayed on the touch screen and confer bonuses such as doubling the damage you deal or reducing the damage you take by 100%. You're still constantly trying to teleport behind one another while mashing the attack buttons to build up a special attack, but at least the power-ups give you extra buttons to push. The graphics aren't terrible. The 3D models animate smoothly and even benefit from some stylish shading, but they aren't very detailed, either. The backgrounds are also pretty bare. One level takes place on a completely featureless grass lawn, with a couple of brown hills in the background. The dirty, garbled music is fortunately very easy to fix by yourself: simply turn down the volume. We've seen that Naruto: Ninja Destiny resembles a shadow clone with its lack of staying power, and we've talked about how, like the sexy jutsu, it is thin and bare. On the default difficulty, you can literally play it without looking, but the harder difficulty provides a better challenge. Most ninjas would likely be looking for something more in their destiny than this game has to offer, but it beats getting assassinated while you sleep."}