{"ref": "https://www.gamespot.com/reviews/nascar-thunder-2004-review/1900-6075617/", "date": "September 23, 2003", "game_name": "NASCAR Thunder 2004", "text": "In its latest horsepower-packed ode to stock cars, NASCAR Thunder 2004, Electronic Arts journeys to a PC world blissfully free of a solid competitor. Papyrus' groundbreaking NASCAR Racing series quietly departed earlier this year--an unfortunate and much-mourned victim of spiraling licensing costs--and games like Hasbro's NASCAR Heat are now just a distant memory. To EA's credit, it hasn't stood pat. Enlisting, for a second year, the services of Image Space, the same team responsible for EA's critically acclaimed F1 Formula 1 simulation, it has upgraded and clearly improved upon last year's questionable NASCAR Thunder 2003. Yet it hasn't quite raised the bar high enough to make any serious sim driver forget about the NASCAR Racing series. As it sits, NASCAR Thunder is a competent game that looks like it's only going to get better as time goes on. The track textures at venues like Martinsville are absolutely stunning. If you've ever delved into the Papyrus series, you'll immediately be familiar with the general drill. The game seeks to replicate the real-life NASCAR experience, sporting some 23 tracks from the top-level Winston Cup circuit and one welcome old-timer: the hazardous circa-1950 Daytona beachfront course. It features 60 current and legend NASCAR drivers, including present-day stars like Tony Stewart and venerated old-timers like Richard Petty, Bill Elliott, Cale Yarborough, and the late great Dale Earnhardt. Players can partake in test sessions, single events, and full seasons, and they can choose from a plethora of difficulty and realism options, making the racing as difficult or as relaxed as they wish. New for 2004 is the career mode, which introduces such elements as team management, sponsorship hunting, and long-term strategy. Complaints about last year's edition ranged far and wide, particularly from those who'd experienced its console counterpart and wondered why perks like tutorials, quickie racing challenges, and car detailing didn't make it to the PC port. Indeed, the game initially attracted a good deal of attention from ~arcade~ racers, who expected a wilder, more multifaceted experience but were disappointed when they didn't find it. At the same time, simulation fans weren't particularly enamored by the reasonable yet somewhat lackadaisical physics modeling. In the end, NASCAR Thunder 2003 seemed to alienate both camps. This year, there's little doubt NASCAR Thunder is moving even further toward the simulation realm. For better or worse, it once again excludes a number of the amenities found in the console version. This year's PC iteration does not incorporate the console's 11 fantasy tracks, nor does it feature goodies, like bonus rewards, Speed Zone minigames, or the Michael Waltrip-hosted Lightning Challenge--all of which can be accessed on the Xbox and PS2 editions. Why we can't have both a believable ride and arcade fun is unknown, but NASCAR Thunder has clearly established a distinct PC-only path and seems bent on gunning for the Papyrus crown. To reach that plateau, ISI and EA must do one thing, above all else, and that's to believably mimic the physics of a real stock car. Sure enough, one of the most noticeable upgrades is just that. Though not quite up to Papyrus standards yet, the lively and convincing vehicle dynamic is almost as impressive as that of ISI's F1 sims. Perhaps more importantly, it blows away the physics modeling of any other stock car game currently on the market. In NASCAR Thunder 2004, ISI has built a twitchy, realistic car model that demands your attention at all times lest you find yourself eating the wall or the bumper of another vehicle. Certainly, at its most difficult setting, the game forces you to keep your eyes on the road and your hands in a state of perpetual, subtle motion as you struggle to moderate the powerful beast underneath you. The effect of cold versus warm rubber is especially interesting. ISI may have gone a bit overboard in this respect, but the truth is that oval racing would be a bit dull without such intrigue. However, all is not yet perfect. The aerodynamics model, for one, needs fine-tuning. When real NASCAR machines draft each other at superspeedways, like Daytona and Talladega, both the lead and trailing cars take advantage of the corresponding speed boost. Yet in NASCAR Thunder, only the trailing cars benefit from assisted acceleration. Thus, a drafting train will run at the same speed as a car running solo, and that's just not right. Another readily apparent quirk is the game's overly sensitive wheelspin coding. Even with a 700-horsepower powerplant driving them, the tires of a Winston Cup car do not light up in third and/or fourth gear. Yet they certainly do in NASCAR Thunder. Players can toggle on a number of driving aids, like traction control, ABS, and steering assist, but extreme realism fans will have to bite the bullet on this one. NT2004's AI drivers are normally quite patient and are not prone to hazardous judgment errors. Contrarily, cars do respond nicely to garage modifications. In fact, gearheads can spend hours tinkering with caster or track bar adjustments in an environment strikingly similar to that of F1's vehicle setup component. Alternately, mechanical newbies can simply select one of three default setups--grip, race, or qualifying--and head straight for the track. Those who want to take it just a bit beyond the basics, without diving into the detailed mechanical minutiae of their actions, can do so by manipulating a quartet of sliders that adjust overall balance, stiffness, acceleration, and top speed. The game's graphics engine is generally top-notch, particularly if you have the horsepower to run this baby at 1024x768 resolution with 4X anti-aliasing and high detail levels. Above you, the skies are alive with cloud movement. In fact, the chance of a sunny day growing heavily overcast is very real indeed. Although it doesn't feature the compelling sun glare effects of NASCAR Racing, NASCAR Thunder's lighting and shading effects are impressive nonetheless. The depiction of tire smoke is particularly impressive. The very first thing you'll probably notice when you initially jump behind the wheel is the incredibly dramatic representation of the racing surface. In NASCAR Thunder 2004, the asphalt looks and feels fast and dangerous. Heavily detailed textures seem to jump right off the track at you, and the sheer sensation of speed, as you fly over the rubber- and oil-stained racing groove, is unparalleled. Furthermore, your car jostles over the bumps and irregularities, sending credible tactile sensations back to you via the game's solid force-feedback engineering. The view from inside the NASCAR Thunder cockpit is just as convincing as that of Papyrus' NASCAR Racing. Clearly, ISI has also taken great pains to upgrade circuit accuracy. Tracks like Watkins Glen--which bore little resemblance to its real-life counterpart in NASCAR Thunder 2003--are now depicted far more faithfully and accurately. The actual cars are improved too, now looking every bit as attractive as anything Papyrus ever concocted, both inside and out. All four manufacturers (Chevy, Pontiac, Ford, and Dodge) are represented, and the subtle differences between each is carefully modeled. On pit lane, animated crews perform up to EA's usual impressively realistic motion-captured standards, and the various stalls are busy places indeed during scheduled pitting sessions. Damage modeling is solid but not spectacular. Body panel damage is easily accrued and seems convincing until you realize you've seen that same dent shape over and over again. Parts do fly off, on occasion, but not enough for fans of Papyrus-style carnage. Stressed engines smoke and sometimes burst into flames, yet tires rarely blow due to overheating. Instances of heavy wall contact may leave your engine relatively unscathed, or it may inexplicably destroy it. However, fans of true mayhem may feel somewhat underwhelmed. For reasons unknown, NASCAR Thunder 2004 instantaneously turfs you off the track and back to the race menu the moment it detects serious car damage. Moreover, the replay halts at precisely the same time. Accordingly, you can't cause a massive multicar wreck then sit back and watch the continuing havoc unfold. Certainly one of the game's most annoyingly flawed components is its new career mode. To begin your career, you enter a Winston Cup season with an undeveloped car and the tidy sum of 4 million dollars. Through sponsorship income and race winnings, you attempt to fund time-sensitive R&D projects to bring your machine up to speed. You then build faster cars from this knowledge and experience. Your initial car is so slow, however, that you won't stand a chance of finishing anything but dead last when running against 100 percent AI opponents. This situation does not change markedly as time goes by. This is a terribly unrealistic implementation of a promising gameplay premise. In the real world, no team would enter the Daytona 500 in a car that's certain to be lapped by the first pit stop. Granted, you can always downgrade the AI strength to give your starter car a fighting chance for a top-30 finish, but doing so means you'll begin wasting the competition when you ultimately do manage to buy your way to a faster machine. Sadly, the AI strength slider can't be changed in career mode after you've initially set it. Furthermore, the game won't allow you to run a second career until the first has ended. Apart from the aforementioned drafting issues, NASCAR Thunder's AI drivers are credible. They deliver a consistent challenge and--when adjusted to suit your individual skill and experience level--offer a solid and entertaining on-track battle from green to checkered flags. Both their speed and their aggression levels can be tweaked at will, but even when set to fully aggressive, they aren't suicidal and won't try to drive right through you to gain a spot. However, individual drivers do not react emotionally to incidents as they purportedly do in this year's console version. They do not exact horrible revenge after you've mistreated them nor do they appear to form friendships. Happily, NASCAR Thunder delivers an adequate soundscape. Engine notes are certainly convincing, although they're a bit synthetic when compared to the wonderfully guttural motor growl of NASCAR Racing. Tire squeal is believable and informative, but crash effects are weak. Spotters and crew chiefs are verbose and revealing, though a bit slow to respond. The most notable difference between this and the Papyrus game is the audible feedback from competitor engines. Anyone who's ever raced in the midst of a NASCAR Racing pack, as it hurtles through a fast-sweeping turn, will remember that amazing reverberating roar of a thousand engines cascading from all around. NASCAR Thunder doesn't yet capture that amazing sensation. Though you aren't compelled to access it, the NASCAR Thunder garage is a deliciously complex ad potentially beneficial place. The game's multiplayer component is satisfactory, offering support for up to 16 drivers via LAN and online. We connected easily to several Internet sessions from within the game and were pleasantly surprised at the smooth frame rate and generally lag-free experience. That said, on more than one occasion we'd watch opponent cars warping through walls and other scenery elements. Furthermore, the advertised Gamespy support was inactive. This will, hopefully, be remedied by the release date. When Papyrus departed the PC racing scene, it was a sad day indeed for those who believe the best stock car racing is realistic stock car racing. Whether NASCAR Thunder will ever reach the lofty heights of its Papyrus predecessor remains to be seen. Certainly EA has made it clear that the game will continue to target the simulation crowd. In its current form, NASCAR Thunder is a promising and, at times, fully captivating exercise that may soon attain the magical NASCAR Racing status. Until then, it's certainly the best thing going for fans of an authentic NASCAR experience. The very first thing you'll probably notice when you initially jump behind the wheel is the incredibly dramatic representation of the racing surface. In NASCAR Thunder 2004, the asphalt looks and feels fast and dangerous. Heavily detailed textures seem to jump right off the track at you, and the sheer sensation of speed, as you fly over the rubber- and oil-stained racing groove, is unparalleled. Furthermore, your car jostles over the bumps and irregularities, sending credible tactile sensations back to you via the game's solid force-feedback engineering. The view from inside the NASCAR Thunder cockpit is just as convincing as that of Papyrus' NASCAR Racing. Clearly, ISI has also taken great pains to upgrade circuit accuracy. Tracks like Watkins Glen--which bore little resemblance to its real-life counterpart in NASCAR Thunder 2003--are now depicted far more faithfully and accurately. The actual cars are improved too, now looking every bit as attractive as anything Papyrus ever concocted, both inside and out. All four manufacturers (Chevy, Pontiac, Ford, and Dodge) are represented, and the subtle differences between each is carefully modeled. On pit lane, animated crews perform up to EA's usual impressively realistic motion-captured standards, and the various stalls are busy places indeed during scheduled pitting sessions. Damage modeling is solid but not spectacular. Body panel damage is easily accrued and seems convincing until you realize you've seen that same dent shape over and over again. Parts do fly off, on occasion, but not enough for fans of Papyrus-style carnage. Stressed engines smoke and sometimes burst into flames, yet tires rarely blow due to overheating. Instances of heavy wall contact may leave your engine relatively unscathed, or it may inexplicably destroy it. However, fans of true mayhem may feel somewhat underwhelmed. For reasons unknown, NASCAR Thunder 2004 instantaneously turfs you off the track and back to the race menu the moment it detects serious car damage. Moreover, the replay halts at precisely the same time. Accordingly, you can't cause a massive multicar wreck then sit back and watch the continuing havoc unfold. Certainly one of the game's most annoyingly flawed components is its new career mode. To begin your career, you enter a Winston Cup season with an undeveloped car and the tidy sum of 4 million dollars. Through sponsorship income and race winnings, you attempt to fund time-sensitive R&D projects to bring your machine up to speed. You then build faster cars from this knowledge and experience. Your initial car is so slow, however, that you won't stand a chance of finishing anything but dead last when running against 100 percent AI opponents. This situation does not change markedly as time goes by. This is a terribly unrealistic implementation of a promising gameplay premise. In the real world, no team would enter the Daytona 500 in a car that's certain to be lapped by the first pit stop. Granted, you can always downgrade the AI strength to give your starter car a fighting chance for a top-30 finish, but doing so means you'll begin wasting the competition when you ultimately do manage to buy your way to a faster machine. Sadly, the AI strength slider can't be changed in career mode after you've initially set it. Furthermore, the game won't allow you to run a second career until the first has ended. Apart from the aforementioned drafting issues, NASCAR Thunder's AI drivers are credible. They deliver a consistent challenge and--when adjusted to suit your individual skill and experience level--offer a solid and entertaining on-track battle from green to checkered flags. Both their speed and their aggression levels can be tweaked at will, but even when set to fully aggressive, they aren't suicidal and won't try to drive right through you to gain a spot. However, individual drivers do not react emotionally to incidents as they purportedly do in this year's console version. They do not exact horrible revenge after you've mistreated them nor do they appear to form friendships. Happily, NASCAR Thunder delivers an adequate soundscape. Engine notes are certainly convincing, although they're a bit synthetic when compared to the wonderfully guttural motor growl of NASCAR Racing. Tire squeal is believable and informative, but crash effects are weak. Spotters and crew chiefs are verbose and revealing, though a bit slow to respond. The most notable difference between this and the Papyrus game is the audible feedback from competitor engines. Anyone who's ever raced in the midst of a NASCAR Racing pack, as it hurtles through a fast-sweeping turn, will remember that amazing reverberating roar of a thousand engines cascading from all around. NASCAR Thunder doesn't yet capture that amazing sensation. Though you aren't compelled to access it, the NASCAR Thunder garage is a deliciously complex ad potentially beneficial place. The game's multiplayer component is satisfactory, offering support for up to 16 drivers via LAN and online. We connected easily to several Internet sessions from within the game and were pleasantly surprised at the smooth frame rate and generally lag-free experience. That said, on more than one occasion we'd watch opponent cars warping through walls and other scenery elements. Furthermore, the advertised Gamespy support was inactive. This will, hopefully, be remedied by the release date. When Papyrus departed the PC racing scene, it was a sad day indeed for those who believe the best stock car racing is realistic stock car racing. Whether NASCAR Thunder will ever reach the lofty heights of its Papyrus predecessor remains to be seen. Certainly EA has made it clear that the game will continue to target the simulation crowd. In its current form, NASCAR Thunder is a promising and, at times, fully captivating exercise that may soon attain the magical NASCAR Racing status. Until then, it's certainly the best thing going for fans of an authentic NASCAR experience."}