{"ref": "https://www.gamespot.com/reviews/xenoblade-chronicles-3-review-masters-of-war/1900-6417921/", "date": "July 26, 2022", "game_name": "Xenoblade Chronicles 3", "text": "The premise of Xenoblade Chronicles 3 is a bit unusual, but it sets the stage for a 100-hour epic through a fascinating world with strong characters and rewarding combat. Xenoblade Chronicles 3 may stumble from time to time, particularly in its dialogue, but its ambitious premise pays off with a heartfelt conclusion. It takes place in the world of Aionios, where two warring nations--Keves and Agnus--are locked in an endless struggle for resources. These resources are quite literally a matter of life and death. When a soldier is killed on the battlefield, their life force powers the opposing faction's Ferronis, a giant mech that doubles as a base of operations. The life force of fallen soldiers is imperative for one side to succeed over the other.The population of Aionios is bred to fight, and that's it. From an early age, they are subjected to rigorous combat training and expected to fight for a 10-year term. If they survive their life term, they are whisked away by the all-powerful queen in motes of light. However, most soldiers don't last 10 years. This is where the protagonist, Noah, comes in. Noah is an Off-Seer, a flutist tasked with sending off fallen soldiers through music.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Xenoblade Chronicles 3 Video ReviewThe world of Xenoblade Chronicles 3 doesn't follow the same rules as the previous entries in the series, and it's better for it. The unusual setting gives players a fresh perspective to explore familiar themes. A major one of these is sacrifice, and how it can radically affect the trajectory of someone else's life. While Xenoblade doesn't always tackle these deeper themes with finesse, it's hard not to get swept up in the drama of it all once the story gets rolling.Despite the interesting premise and initial setup, Xenoblade's biggest roadblock is how it onboards players. Developer Monolith Soft really throws you into the deep end, and the lack of a proper codex gives the game a real sink-or-swim feel at the outset. The early hours are bogged down by JRPG jargon like Flame Clocks, Off-Seers, Ferronises, Interlinks, Orobouros, life terms, Levnises, and so on. The game makes a noble attempt to lay down the foundation of the world with a poetic opening cutscene, but that only scratches the surface. You can rewatch important cutscenes from the main menu, but those only account for a fraction of the story. A lot of detail ends up in text-based dialogue you can't rewind, a quality-of-life feature that I've come to expect from a JRPG of this size and scope.The story really doesn't come into its own until about halfway through the first chapter, when you've been introduced to all six party members. The characters are really what hold Xenoblade's narrative together. Some of them don't make the best first impression, but by the end, I cared about each and every one of them. Since their entire lives are built around fighting, there's a genuine sense of curiosity that informs the party when they break away from that cycle of killing and explore the world with their newfound perspective. This gives way to emotional reveals, lighthearted banter, and some compelling backstory.A highlight is Eunie, the hot-headed and foul-mouthed party healer. She isn't given much screen time early on, but as the story unfolds, she takes on a much more active role. She isn't afraid to call out injustices, and she regularly teases Lanz, the light-hearted, sword-wielding brute, for his shoot-first mentality. It's a fun dynamic, but what makes Eunie truly memorable is how she pieces together the unknown parts of her backstory along with the player, and how it informs her character as the story progresses. There's a particularly heartfelt optional scene near the end of the game that really shows how far she's come over the course of the journey.Many of the game's themes are embodied by these characters as well. Lanz struggles with sacrifice and the ripple effect that it can have on people. Mio, the cat ear-adorned Off-Seer, reckons with time and whether a person who only has 10 years can truly make a difference. These themes are generally interesting, especially when you factor in the unique state of the world. Occasionally, however, the writing undercuts some of these themes by over-explaining or revisiting them a few too many times. It doesn't ruin the story, but it does cheapen the message from time to time.Of course, Xenoblade Chronicles 3 has its fair share of plot twists as well. I won't spoil them here, but some are fantastic and recontextualize the entire series, while others are painfully predictable. The predictable twists aren't necessarily bad, but the party's reactions to these moments are frustrating because they'll spend minutes belaboring something obvious that you saw coming a mile away.What really elevates the story is how it weaves together loose ends from Xenoblade Chronicles and Xenoblade Chronicles 2. New players can still enjoy the story, but long-term fans of the series will really appreciate the direction the plot takes. According to series director Tetsuya Takahashi, the idea for Xenoblade Chronicles 3 has been in the works for nearly a decade, and it shows.As much as I enjoyed the story, Xenoblade's moment-to-moment dialogue can be pretty rough. It's hard to say whether the localization or the writing itself is at fault, but it's difficult to overlook. Characters frequently state the obvious, the Nopons' speech pattern is still grating, and some lines are so weighed down by the in-game terminology that they lose their meaning entirely. Even as someone who plays JRPGs regularly, I found the dialogue overwritten at best and cringeworthy at worst.At the very least, the English voice acting is a bit stronger this time around, especially for the main party members. This makes some of the worst lines of dialogue a bit easier to stomach. There are still some weak performances, but those are usually relegated to side characters who don't have much screen time.The combat in Xenoblade Chronicles 3 is the sharpest in the series. Like previous games, Xenoblade adopts the combat style of an MMO, but adds the flair you might expect from a single-player RPG. Each class has a standard auto-attack and five unique Arts tied to cooldown meters. As you progress, you will unlock more classes, more Arts, and more equipment slots to fine-tune your party composition.Xenoblade Chronicles 3 may stumble from time to time, particularly in its dialogue, but its ambitious premise pays off with a heartfelt conclusionIn total, there are 23 classes, each with their own playstyle that can be mixed and matched across your entire party. For example, Eunie may start as a healer, but you may find she's more effective as a one of the five different defender classes. As you level up classes with specific characters, they unlock Master Arts, which the character can use regardless of their class. There are some restrictions, but this allows characters to dabble in tactics that may not be intended for their chosen class. I am well over 120 hours in now and I am still unlocking new Master Arts, leveling up different classes, and uncovering powerful new tactics.It's a lot to manage, especially if this is your first Xenoblade, but once it clicks, it's hard to stop thinking about. At face value, you can boil down the combat to meter management, but that wouldn't do it justice. There's a tactile rhythm to it that builds with every attack and expands with every combo. Eventually it crescendos into an incredibly powerful Chain Attack that halts the battle entirely before giving way to an explosive ending. These moments don't happen by chance, though. Positioning is key, timing needs to be impeccable, and forethought is a must. If a party member is knocked unconscious and there isn't someone to pick them back up, the Chain Attack will fall flat and you'll have to start the entire process over again.Thankfully, if there's a mechanic you don't understand, Xenoblade Chronicles 3 has a deep and ever-expanding ~Tips~ menu. Every time a new mechanic is introduced, whether it be in or out of combat, that tutorial pop-up is filed away in the menu. I wish this menu had better sorting features, but its a welcome addition, considering that once you closed a tutorial pop-up in Xenoblade Chronicles 2, it was gone forever.While the combat itself is fantastic, the real satisfaction comes from experimenting with different party compositions and streamlining various loadouts. My favorite moments in Xenoblade Chronicles 3 are when I'd get swept by a boss, adjust my party composition, and rain hell on that same opponent in a second attempt. It's a brilliant loop that really hammers home the depth, strategy, and malleability of the combat. If you notice that your tanks are having trouble pulling aggro, you can tweak their loadout, or you can create an entirely new tank build with a different subclass. It's an empowering system that can be endlessly modified.The menus themselves are also a huge improvement over Xenoblade Chronicles 2. Flipping between different characters, changing classes, and swapping Arts is a frictionless experience. And if you're the type that wants to spend as little time in menus as possible, there is an ~auto-load~ feature that automatically kits out a party member. While this is a welcome alternative for those who may not want to manually equip every character, it didn't always yield the best results. When I did auto-load a character, I typically had to go in and make some adjustments based on the class I chose. But at the very least, this feature gave me a baseline I could work with.Exploration also feeds into progression. Resources scattered throughout Aionios can be used to craft stat-boosting gems, cook meals, and complete side quests. While side quests offer material rewards such as money and accessories, they also improve the party's standing with various colonies, which is tracked in the Affinity Chart. As you explore more of the world, you will come across more colonies. The more colonies you assist, the more passive buffs Noah and his party will unlock. These buffs range from faster run speeds to increasing the duration of meal effects.What makes Xenoblade's exploration so satisfying is how often it connects to everything else, both in terms of narrative and gameplay. You might be collecting resources to craft a specific gem, but you notice that some of the resources you've collected could also be used to complete a side quest. Completing that side quest could improve Noah's relationship with a specific colony, which could unlock a new buff that makes getting around Aionios even easier. If you can get around the world more efficiently, then, in theory, you can scavenge quicker, allowing you to complete more quests and craft better gems.Additionally, some of Xenoblade's best moments can be missed entirely if you don't take the time to soak in your surroundings. Hero Quests, activities marked with yellow exclamation points in the menu, are fully voiced quests that introduce a new class and party member. Some heroes are introduced during the main quest, but a majority of them start as inconspicuous side quests. Monolith Soft's character design really shines in these Hero Quests. Not all of the hero characters are as cool as Gray--the mysterious gun-toting bandit--but they are all given backstory and offer new classes, some of which can dramatically shake up your playstyle.As well-thought-out as these systems are, though, the setting itself is what really steals the show. Xenoblade Chronicles 3 pushes Monolith Soft's open-world design even further than past games. The areas you explore are massive, colorful regions teeming with life both big and small. Monolith Soft's mastery of scale is on full display here once again. Awe-inspiring landmarks like the Great Sword can be seen from around the world, formidable beasts that tower over your party roam the plains, and vibrant ecosystems stretch into the horizon. The world of Aionios is a sight to behold and a testament to the environment artists at Monolith Soft.This is all accompanied by another beautiful score from Yasunori Mitsuda and Manami Kiyota. The music confidently swings from haunting lullabies to sweeping orchestrations that flawlessly match the mood of a scene or the tone of a region. The flutes are also more pronounced this time around, giving the music a more intimate feel when the scene calls for it.Despite Xenoblade's apparent beauty, it's hard not to feel as though the Nintendo Switch's hardware is holding it back. Watching grass fill in just meters in front of you is hard to ignore; beautiful vistas are soured by poor draw distances, and some rough textures make bland side characters even blander. These issues are present whether you play docked or handheld.More noticeable are the lengthy loading times and unstable frame rates. While both of these issues don't persist throughout the entire game, there were a few isolated incidents that are worth noting. During one fairly standard side quest, I was hit with one to two-minute-long load times between each conversation. Additionally, much later in the game, I was hit with a few load times that were so long I almost restarted the game because I thought it had crashed. Typically, the load times are pretty snappy, so these moments really stood out. There's also a specific area much later in the game where the frame rate takes some noticeable dips. As it's optional, there's a good chance you may not even find this area, but the 30 or so minutes I spent there were rough. I don't think any of these issues should turn you off from Xenoblade Chronicles 3 entirely, however.Xenoblade Chronicles 3 feels like the game Monolith Soft has been trying to craft for years. While its dialogue could have used an extra pass, it more than makes up for it with its wonderful story and superb combat. It's rare for a JRPG to hold my attention for a 100-hour runtime, but Xenoblade Chronicles 3 did it with confidence."}