{"ref": "https://www.gamespot.com/reviews/sonic-rivals-review/1900-6162953/", "date": "December 8, 2006", "game_name": "Sonic Rivals", "text": "If there's one thing that Sonic does well, it's running really, really fast. It makes sense then that Sega would put the feisty hedgehog in a racing game that lets him do what he does best. That's exactly what Sonic Rivals is, and while it certainly has plenty of fast, exciting moments, it also has a lot of frustrating moments. But despite its flaws, Sonic Rivals is a fun game that puts an interesting twist on the classic Sonic gameplay. Sonic is back, and thankfully he brought his running legs. The story in Sonic Rivals is pretty nonsensical. Sonic's enemy, Dr. Eggman, has developed a special camera that he can use to take pictures of people and turn them into trading cards. After Eggman turns both Tails and Amy into cards, it's up to Sonic to rescue his friends. But before you can defeat Eggman, you have to catch him by running through six different worlds and defeating the handful of bosses that he throws your way. Sonic isn't the only one after Eggman, though. Knuckles, Shadow, and Silver all want a piece of the mad scientist as well, so it becomes a race to see who can get to Eggman first. The game consists of a series of one-on-one foot races through typically fast and twisted stages. There are six worlds in the game, most of which have two acts and a boss battle. There's a green hill area, a theme park area, a high-tech laboratory, and more. Your goal is to run from left to right and be the first across the finish line. The levels all look good and feature some classic Sonic design elements such as huge loops, corkscrews, speed boosters, and spring-loaded platforms. The game isn't quite as simple as that, because there are a lot of hazards in each stage as well. There are pits to fall into, enemies to hit, and spikes to poke you. You also have to contend with your rival, who will jump on you and assault you with power-ups such as fireballs and ice blasts. You can get power-ups as well, which can be helpful, but there are only a few in the game, so there's very little variety to the power-ups. It's quite satisfying to hit an open stretch of track and just run really fast, which makes it all the more frustrating when obstacles are thrown in your way to trip you up. It's a problem because you're usually moving so fast that you won't see the obstacles until you're running into them, which means that you'll usually have to run a race several times before you beat it, just to memorize where the hazards are. There are also a ton of blind jumps in this game, so when you're running along at top speed and the ground disappears, you just have to hit the jump button and hope for the best. When you fall in a pit or hit an enemy, you'll lose some of the rings you've collected, but even if you don't have any rings, you'll simply be reset back on the track. There are no lives or continues, so you can run a race as many times as it takes you to beat it. The artificial intelligence in the game also isn't very good. Your rival will always be either right behind you or right in front of you, no matter how well you're doing. It works just like the rubber-band artificial intelligence prevalent in many traditional racing games. If you start to slow down and do poorly, your rival will do the same. If you freeze your rival with an ice blast, he will be slowed momentarily but will inexplicably catch up within seconds. There are boss battles in the game as well, and you have to compete with your rival to be the first to destroy the boss. Each time you hit the boss you get a point, and whoever has the most points when the boss is defeated wins. Most bosses take only about five hits to kill, so these stages typically don't last very long, and they're much easier than the racing stages. Aside from the story mode, there is a challenge mode and a cup circuit mode. The challenge mode has you racing the same stages from the story mode, except you have specific objectives to complete in addition to winning the race. You have to collect a certain number of rings, hit your opponent so many times with a power-up, finish within a certain time, and more. Most of the challenges aren't difficult, and you'll complete most of them within the course of an average race. Again, the hardest part is winning the race; all the ancillary challenges are easy. The cup circuit mode is more racing on the same few levels, except instead of single races you're going for the best two out of three. Aside from that, it's just like the other two modes. Whether you're racing in story mode, completing challenges, or racing in a cup circuit, you'll earn trading cards. Some cards don't seem to serve any purpose other than to be collected, while other cards will give you things like new outfits to wear. With 150 different cards to collect, it will take you a long time to find them all. You can also trade cards or wager cards in the multiplayer races. The game supports up to two players via an ad hoc connection, and both players need a copy of the game. You can do head-to-head races or cup circuits. In our experience there was a bit of lag, even when sitting only a few feet away from our opponent. With a game that moves as fast as Sonic Rivals does, even the slightest amount of lag is very noticeable and problematic. In addition to Sonic, you can play as Shadow, Silver, and Knuckles, and each one plays just a little bit differently. Aside from the lag in multiplayer games, Sonic Rivals runs very well and looks good. The sense of speed is great, and the large, 3D levels are full of exciting twists and turns. The graphics are all bright and charming, and they remain true to the cartoonish Sonic design throughout. The frame rate is steady, which further helps maintain the sense of speed that Sonic is known for. The game sounds good as well, with upbeat music that fits each stage. You'll also notice some familiar sound effects, like the trademark ~ding~ that you hear when you collect a gold ring. Sonic Rivals is a fast and fun game, but it can also be frustrating. The trial-and-error process required to make it through a race can get very tedious. When all you want to do is run really fast, the unseen hazards that slow you down can be aggravating. But if you're willing to put up with some punishment, you'll have fun running through the long levels in the game. There aren't many of them, though, and as a result, the replay value takes a hit. Still, Sonic Rivals has enough fun moments to make it a decent game to take with you on the go."}