{"ref": "https://www.gamespot.com/reviews/la-pucelle-tactics-review/1900-6096486/", "date": "May 7, 2004", "game_name": "La Pucelle: Tactics", "text": "La Pucelle: Tactics is yet another strategy role-playing game about teenage, French-named, anime-style, exorcist demon-hunters. If only we had a penny for every one, right? But yes, it's true, this strangely named game from the makers of last year's cult favorite, Disgaea: Hour of Darkness, has an unusual concept. It plays pretty weirdly, too; it's a slow-paced game with its own, unusual logic, though it bears obvious resemblance to Disgaea as well as other strategy RPGs like Final Fantasy Tactics. Given that, and given that it's chock-full of geeky anime humor and corny melodrama, La Pucelle has its sights set on a specific audience. It's a good game for that crowd, although they may be disappointed to learn that La Pucelle actually predates Disgaea (it originally released a couple of years ago in Japan), and that it lacks some of that game's refinements and better features. Nevertheless, if you enjoyed the colorful look and core gameplay of Disgaea, then La Pucelle: Tactics is easily recommended. La Pucelle is a precursor to last year's Disgaea: Hour of Darkness, and bears a lot of superficial similarities to that and other strategy RPGs. The young star of La Pucelle: Tactics is a hot-tempered girl named Prier (say ~pree-yay~), who's supposedly a demon hunter, but really, she's more of an exorcist. She and her younger brother and their straightlaced tutor embark on a quest that spans more than 10 chapters' worth of turn-based tactical battles (which are generously interspersed with lengthy cutscenes using the same colorful, smoothly animated little characters you'll see on the battle screen). The story and characters are all very anime, and they're especially suited for the specific subset of anime fan who would appreciate all the super-duper cute character designs, including enemy foes that often look more like stuffed animals than like dangerous opponents. Last year's Disgaea, with its netherworld setting and cast of strange, demonic cohorts, probably has a more appealing premise than this game does--but that's just a relative comparison. The truth is that the two games share an unmistakably similar style. This one tries harder to tell a cohesive story, which means you'll spend more time watching the story unfold. La Pucelle: Tactics is not a fast-paced game, nor is it easy. Each time you attack an enemy in the game, the action cuts from the standard isometric perspective to a side-screen view in which you see your characters exchange attacks with the bad guys. These little sequences don't take very long on a one-off basis, but over time they serve to significantly slow the pace of the battles. There can come a point at which La Pucelle: Tactics becomes frustratingly sluggish, especially if you find yourself having to replay certain scenarios. On the other hand, if you put up with and get used to the flow of the action, you'll be fine. Nevertheless, certain aspects of the pacing just should have been better, both in and out of the gameplay. Should you fail a mission, you may need to sit through a lengthy introductory cutscene again. Though much of the dialogue is recorded in speech, there are significant pauses between lines that makes you want to skip over these cutscenes. At least La Pucelle incorporates the same system as last year's Disgaea, in which enemies' turns are resolved simultaneously--your foes will move as a unit during their phase, rather than one by one--which speeds things up a bit. 'Cute' is the theme of the game's graphic design. Fans of quirky anime are going to find themselves right at home here. Like Disgaea, La Pucelle bears a lot of superficial similarity to other strategy RPGs, but also like Disgaea it has some pretty odd, unique twists. The turn-based gameplay is basically straightforward: You can have up to eight friendly characters on the battlefield, and you may move them in any order you like when it's your turn. When you issue an attack command against an enemy, you may opt either to resolve the command immediately or hold off till the end of the turn. This is so you can set up combination attacks by positioning your characters adjacent to each other before they strike. You can do more damage to your enemies by attacking them from behind, from the sides, or from higher ground, and enemies also typically have some sort of elemental affinity that makes them vulnerable to certain types of spells. This is all pretty standard stuff for strategy RPGs. One of the game's main twists is the dark portal/dark energy system, which is reminiscent of (and a precursor to) a similar but better system in Disgaea. Here, you'll find little colored portals scattered around each map. These can be ~purified~ and thereby destroyed, granting your character experience points (doing so can prevent enemy reinforcements from pouring in every few turns). Additionally, dark portals often generate trails of dark energy across the map. This energy has debilitating effects, but your characters may stand on the trails and redirect the flow of the energy in 90-degree increments, ideally channeling it onto enemy units. Then, by purifying the attached portal, it's possible to damage those foes. What's more, if you succeed at making the dark energy form a large circuit (that is, you connect the flow of the energy back to the source in a rectangular shape), then by purifying that energy you can invoke a ~miracle~ spell that will grievously damage any foes inside of the circuit. It's a complicated system that adds a puzzlelike element to the maps, but since you'll often be worrying about just holding your own against the bad guys, it's not practical to try to do anything too interesting with the dark energy. There are some interesting strategic possibilities in La Pucelle, but the best way to win is to level up a lot. A better concept in La Pucelle is how you can force most any of your foes to join your party (exceptions include the boss opponents you'll square off against from time to time). You need to use your main characters to repeatedly ~purify~ the foe, which costs you your turn, but each time you do it you increase the chances of the enemy joining you once it's defeated. The system works well and it is self-balancing. Stronger foes are naturally harder to purify, especially since they'll be pounding away at you each turn as you try to accomplish the process. Eventually, you can purify a foe to the point at which it will definitely join you, but sometimes it's more practical to spend a couple of turns trying to do that, as it will increase your chances. As soon as you've successfully swayed a foe, you can deploy it in battle (provided you don't already have eight characters engaged in the skirmish). All of that makes La Pucelle: Tactics sound like a strategy game, but remember, it's also part role-playing game. What this means in practical terms is that strategy often takes a backseat to the pure repetition of the role-playing style of battle. Even if you've got strategic skills that would make Sun Tzu jealous, if your characters aren't at a sufficiently high experience level in this game, then there's just no way they're going to beat certain enemies. Besides, the enemy artificial intelligence here is not very intelligent at all--the bad guys are simply strong. As in Disgaea, what this game allows you to do is replay any of the scenarios you've previously finished, so you can theoretically spend lots and lots of time leveling up your characters by fighting the same enemies over and over. And this truly is the best strategy to getting through the game's tougher missions. This game definitely has that old-school console, RPG mind-set whereby, if at first you don't succeed, spend a few hours leveling and then try again. Combine that mind-set with the slow pacing of the battles and you've got yourself a game that demands time and patience. Incidentally, you can't save your progress during battle, which is a bit unfortunate. The chapters are organized as a series of skirmishes, which you can often choose from in a nonlinear order, so it pays to save your progress in between each one just in case. The presentation of La Pucelle: Tactics has a lot of charm to it, but it isn't exactly state of the art. The menus and entire game engine are clearly the same as what's used in Disgaea; if you played that game first, this one will look eerily similar. As in that game, the characters here are expressive, often amusing, and smoothly animated, but during battle, they tend to get clumped together to the point where it can be difficult to discern who's on whose side. The 3D maps themselves also aren't particularly special, though La Pucelle also features some nice hand-painted artwork during the course of the story. Altogether it's a modestly good-looking game, featuring some brightly colored special effects and some cheap-looking ones, such as how defeated characters simply vanish. If you only play one game this year about teenage French exorcists, play this one. As for the game's audio, La Pucelle's bombastic soundtrack is reminiscent of Disgaea's, but some of the short, upbeat music loops here are the sort of stuff that can drive one mad after a while, especially when coupled with a slow-paced game. The sound effects are nothing special and the English voice-over is about on par with what you'd find in a dubbed anime, so it fits with the overall tone of the game. The mixing of the voice-over often sounds a bit off, though, as sometimes the voices are noticeably muffled or otherwise too quiet. La Pucelle also optionally lets you switch to the original Japanese language track, which is a nice touch. La Pucelle: Tactics isn't terribly deep from a strategic standpoint. But there's a lot to it. It's got a lengthy quest and can keep you busy for a long time--exploring the game's chapters, searching for secrets and side quests, and aiming to get each chapter's best possible ending (since there are multiple ways to get through each one). And though it's not quite up to the level of Disgaea, it does share that game's same high-spirited style--one that's undeniably Japanese (what would you expect from a developer called Nippon Ichi?), and therefore rather uncommon on these shores. It's not the best way for newcomers to get acquainted with this style of gaming, but fans of anime and other strategy RPGs are naturally going to like La Pucelle. What's more, if you succeed at making the dark energy form a large circuit (that is, you connect the flow of the energy back to the source in a rectangular shape), then by purifying that energy you can invoke a ~miracle~ spell that will grievously damage any foes inside of the circuit. It's a complicated system that adds a puzzlelike element to the maps, but since you'll often be worrying about just holding your own against the bad guys, it's not practical to try to do anything too interesting with the dark energy. There are some interesting strategic possibilities in La Pucelle, but the best way to win is to level up a lot. A better concept in La Pucelle is how you can force most any of your foes to join your party (exceptions include the boss opponents you'll square off against from time to time). You need to use your main characters to repeatedly ~purify~ the foe, which costs you your turn, but each time you do it you increase the chances of the enemy joining you once it's defeated. The system works well and it is self-balancing. Stronger foes are naturally harder to purify, especially since they'll be pounding away at you each turn as you try to accomplish the process. Eventually, you can purify a foe to the point at which it will definitely join you, but sometimes it's more practical to spend a couple of turns trying to do that, as it will increase your chances. As soon as you've successfully swayed a foe, you can deploy it in battle (provided you don't already have eight characters engaged in the skirmish). All of that makes La Pucelle: Tactics sound like a strategy game, but remember, it's also part role-playing game. What this means in practical terms is that strategy often takes a backseat to the pure repetition of the role-playing style of battle. Even if you've got strategic skills that would make Sun Tzu jealous, if your characters aren't at a sufficiently high experience level in this game, then there's just no way they're going to beat certain enemies. Besides, the enemy artificial intelligence here is not very intelligent at all--the bad guys are simply strong. As in Disgaea, what this game allows you to do is replay any of the scenarios you've previously finished, so you can theoretically spend lots and lots of time leveling up your characters by fighting the same enemies over and over. And this truly is the best strategy to getting through the game's tougher missions. This game definitely has that old-school console, RPG mind-set whereby, if at first you don't succeed, spend a few hours leveling and then try again. Combine that mind-set with the slow pacing of the battles and you've got yourself a game that demands time and patience. Incidentally, you can't save your progress during battle, which is a bit unfortunate. The chapters are organized as a series of skirmishes, which you can often choose from in a nonlinear order, so it pays to save your progress in between each one just in case. The presentation of La Pucelle: Tactics has a lot of charm to it, but it isn't exactly state of the art. The menus and entire game engine are clearly the same as what's used in Disgaea; if you played that game first, this one will look eerily similar. As in that game, the characters here are expressive, often amusing, and smoothly animated, but during battle, they tend to get clumped together to the point where it can be difficult to discern who's on whose side. The 3D maps themselves also aren't particularly special, though La Pucelle also features some nice hand-painted artwork during the course of the story. Altogether it's a modestly good-looking game, featuring some brightly colored special effects and some cheap-looking ones, such as how defeated characters simply vanish. If you only play one game this year about teenage French exorcists, play this one. As for the game's audio, La Pucelle's bombastic soundtrack is reminiscent of Disgaea's, but some of the short, upbeat music loops here are the sort of stuff that can drive one mad after a while, especially when coupled with a slow-paced game. The sound effects are nothing special and the English voice-over is about on par with what you'd find in a dubbed anime, so it fits with the overall tone of the game. The mixing of the voice-over often sounds a bit off, though, as sometimes the voices are noticeably muffled or otherwise too quiet. La Pucelle also optionally lets you switch to the original Japanese language track, which is a nice touch. La Pucelle: Tactics isn't terribly deep from a strategic standpoint. But there's a lot to it. It's got a lengthy quest and can keep you busy for a long time--exploring the game's chapters, searching for secrets and side quests, and aiming to get each chapter's best possible ending (since there are multiple ways to get through each one). And though it's not quite up to the level of Disgaea, it does share that game's same high-spirited style--one that's undeniably Japanese (what would you expect from a developer called Nippon Ichi?), and therefore rather uncommon on these shores. It's not the best way for newcomers to get acquainted with this style of gaming, but fans of anime and other strategy RPGs are naturally going to like La Pucelle."}