{"ref": "https://www.gamespot.com/reviews/mlb-15-the-show-review/1900-6416090/", "date": "April 6, 2015", "game_name": "MLB 15: The Show", "text": "Rites of spring come in many forms. Winter snows finally recede. Flying-V formations of geese arc overhead. Opening Day arrives for Major League Baseball. And the latest edition of MLB: The Show arrives to let us know once again how great a sports video game can be.In an unsurprising case of deja vu, Sony has done its usual fantastic job with MLB 15: The Show in the decade-old franchises second release for the PlayStation 4. This is a typically brilliant depiction of the grand old American game that subtly refines the entire experience. It is not groundbreaking, nor a tremendous advancement in sports games, in part because the series has already been to the mountain. This has long been one of the most consistently great sports series of all time, so the refinements are valuable but subtle, like slightly improved pitcher-batter confrontations, new directional hitting mechanics, lifelike crowds, and the distinctive look of shadows as they creep across the field from April through October.Though there are no stop-the-presses moments, MLB 15: The Show remains striking, mostly for its natural feel. This is baseball distilled to its purest form and spiked with just the right amount of big-league glitz, courtesy of the usual modes of exhibition; franchise (now with GM goals, so you can be canned for not getting the job done, and corporate sponsorships, so you can make money for your tight-fisted owner in the process); the always-compelling Road to the Show career simulation; and the revamped Diamond Dynasty option, which is loaded up with new card-collecting frills and annoying microtransactions. Real equipment has been added to the game for the first time this year: Say hello to the corporate thrill of seeing Louisville Slugger emblazoned on bats and gear sets where you buff skills with special Wilson gloves, Nike shoes, a range of real big-league bats, and even ritual good-luck totems. Yes, the role-playing influence is as cheesy as it sounds, but at least Sony has exercised some restraint, so youre not kitting out a third basemen with the Spikes of Speed or a +5 Vorpal Bat.Duels between batters and pitchers are incredibly tense, reflecting real life whether youre familiar with being at the plate or on the rubber yourself, or are a couch potato seasoned from watching games on the tube every summer. Pitchers are smart, able to pick up on weaknesses and make you look like a fool by trailing stuff outside that you can never seem to lay off. At the same time, you can battle effectively, getting your bat on those annoying outside curves and changes so you can at least stay alive to see another pitch.When Im hurling, Im doing everything I can to paint corners and make hitters whiff at stuff in the dirt. When Im hitting, Im all Ted Williams focus, locked so intently on to my TV screen that the house could burn down around me. I lost hours and hours of time as a budding third-baseman phenom in Road to the Show, which is made even more absorbing by the games realistic hitting. Alien abductees have clocked less missing time than I did during the week after MLB 15: The Show was released.Significant changes on the diamond are tough to point out, however. Players now visibly dog it when they mess up at the plate. Swat a nubber back to the mound, and the batter regretfully lumbers down to first amidst a chorus of shouts to run it out, presumably from the first-base coach and the poor lunks in the stands who paid good money to see their heroes go all out at all times. As neat as this can be to watch, visually depicting ballplayers weakly sauntering down the first-base line doesnt significantly affect gameplay, though it adds a couple of ticks to the realism meter (and maybe a couple of ticks to the real-life anger meter about how much big-league stars have lost touch with baseballs roots).Directional hitting produces more of an impact. The default hitting mode now includes the ability to try and send the ball in a particular direction. Simply move the left stick one way to pull, the other way to push, down to keep the ball on the ground, and up to send it into the air when youre looking for a sac. The mechanics are simple enough; Getting them to work is another story. Its difficult to put serious wood on the ball whenever you use the left stick to emphasize the point. This culminated in a spectacularly awful directional batting drill during Road to the Show where I hit three balls out of 20 to the requested zone of the field.Swat a nubber back to the mound, and the batter regretfully lumbers down to first amidst a chorus of shouts to run it out.Fielding has been adjusted so that there are few magic plays where the ball pops into a glove or a player contorts himself in Cirque du Soleil fashion. You can almost always see the ball go right into the glove on grounders, and then see said ball realistically transferred to throwing hand for a laser strike across the infield. This translates into smoother mechanics when youre actually making plays, particularly when it comes to those aforementioned grounders. Fly balls remain a point of contention, however: It continues to be way too easy to get turned around, shuffle your feet, or moonwalk, and turn a routine pop-up into a heart-stopping adventure.Visuals have been enhanced in a number of understated ways. Players look almost photorealistic, to the point where you can readily recognize just about every player in the majors from a distance. There are a few lingering exceptions, however. Jose Reyes beard--ugly at the best of times, anyways--looks like it was daubed on with magic marker. Shaggy hair tends to stand out on players, giving them an anthropomorphic Sonic the Hedgehog look from behind. Eyes can still have a disconcerting popped-up appearance, though you see this more with randomly generated players like the minor-league schlubs than when doing time in AA ball during Road to the Show. Stars like cover-boy Yasiel Puig, Clayton Kershaw, and Jose Bautista dont suffer from this unfortunate fish-eye effect.Animations are almost entirely lifelike, whether youre looking for a realistic flip of the bat after a whiff or a big turn around first when digging in for a double. The only weirdness, again, tends to take place during fly balls. One moment youre lazily settling under a ball, and the next youre sliding back and forth like a zombie extra in Thriller. But for the most part, MLB 15: The Show looks like a real baseball broadcast. This is particularly noticeable between plays, with balls being casually tossed to one another underhand after force-outs. Something so minor doesnt add a ton of value to gameplay, but it certainly adds a lot to the overall experience of playing a complete, lifelike MLB ball game.Stadiums look incredible, with shadows that fall realistically on players shoulders and lengthen across the field as twilight descends on Mudville. Crowds are the best that I have ever encountered in a sports game, and I found myself frequently getting lost in my surroundings when playing a Road to the Show career. I eventually turned off base-running because I was regularly getting picked off as I daydreamed on first, looking around at the busy crowd, amazed at how lifelike the setting was. And not only do the fans look like real individuals, they act like real individuals, too: You observe everything from hardcore nuts waving flags, to bored kids, to a couple consisting of a woman who never stopped talking and a guy who was clearly watching the field and paying no attention to anything she was saying.Crank up a good surround system and you are transported to ground level in a stadium, with cheers, random abuse and encouragement, and comments from other players all punctuated with the whoosh of fastballs giving you chills and the crack of solid hits echoing like gunfire. A new Inside the Show radio report feature has been added to keep you in the know about whats happening across the Majors. It consists of a dry rundown of whos hot, whos not, whos on the trade block, and so on. But it is also heavily detailed and just the sort of added immersion that keeps franchise play more involving. I particularly loved it because it felt old-fashioned, which appealed to the traditional baseball guy inside me who likes nothing better than listening to games on the radio even when I have the option of watching on a big high-definition TV. Matt Vasgersian and his booth crew may be as adrenaline-inducing as warm summer rain, but they provide information and atmosphere by walking the fine line between canned chatter and throwing out numbers. I should mention the new ability to port saves from MLB 14 into the current game, which has been too long in coming. Also new is Diamond Dynasty mode, although its as fussy as these card-collecting modes of play in sports games tend to be. I was also disconcerted at how Diamond Dynasty emphasizes micropayments. The in-game Stubs currency is too hard to earn through in-game feats. I played for about six straight hours in one of my first play sessions, then dropped out to the menus to fool around with Diamond Dynasty and found that I still hadnt earned enough points to buy even one lousy 1,000-Stub pack of cards.MLB 15: The Show is starting to feel as familiar as that old pair of cleats you throw on every spring for another year of slo-pitch beer ball. That said, baseball is the most hidebound sport on the planet. If real life evolved as fast as the game that Abner Doubleday didnt invent, wed all still be swinging from trees, not for the fences. This slow-and-steady approach to game design makes each iteration of the game comfortable, but it also makes for fantastic baseball sims that you can always count on, and that are always improving in subtle ways. In gaming, in baseball, and in life, thats rare and valuable, even if it does make for a predictable rite of spring."}