{"ref": "https://www.gamespot.com/reviews/dice-review/1900-6135808/", "date": "October 14, 2005", "game_name": "DICE: DNA Integrated Cybernetic Enterprises", "text": "Here's a bit of trivia to impress your friends: D.I.C.E. stands for DNA Integrated Cybernetic Enterprises. That jumble of words translates to a bunch of generic anime kids who shout incoherently while completing all kinds of nonsensical missions from atop their mechanized dinosaurs. At least, that's what Bandai's latest licensed anime-turned-video game would have you believe. Regardless of the validity of the license, D.I.C.E. the game is a dull, repetitive, and often frustrating experience that should be avoided. D.I.C.E. stands for Dis Is Crappy Entertainment. D.I.C.E. is an organization of kids who are somehow the answer to all the problems of the universe because they are expert dinobreaker pilots. Dinobreakers are large robots that take the form of various dinosaurs like the T-rex, pterodactyl, and triceratops. There are nine different dinobreakers in the game, and each one is also able to transform into a vehicle at the drop of a hat. This is handy, because in order to save the universe from utter destruction, you'll have to do a bit of racing. Although, most of the time you'll use your dinobreaker to engage in combat with insidious enemies such as frogs, dragonflies, Vikings, and robots. Some dinobreakers are better than others when it comes to combat, but all of the mechs are strictly melee fighters. There are plenty of tail whips, head butts, and claw kicks to go around, but you'll also have the assistance of a satellite bot. There are several different types of satellite bots--some shoot missiles, others shoot lasers, and still others fire beams (yes, there is a difference between lasers and beams, apparently.) These satellite bots sit by your side and you can command them to fire at will, or you can hold the circle button to designate specific targets. Each satellite bot has a different weapon and a different targeting pattern, and you'll rely on them quite heavily. The story in D.I.C.E. is so thin that it might as well not even be there. Basically, the satellite bots that everyone has been using to make their lives easier are made of a rare and mysterious mineral called ~shell.~ Since the satellite bots have become so popular, everyone is trying to get their hands on the precious mineral, and some people are using underhanded means to secure as much shell as they can. Some scientists and a sentient artificial intelligence find out that shell is actually not a mineral, but a sort of living fossil that could unleash all kinds of destructive power if not handled properly. Of course, all the shady characters (including the cleverly named D.I.C.E. rivals, B-D.I.C.E) peddling shell on the black market aren't really concerned with safe-handling procedures. The story really has no bearing on the game, because the 16 missions are pointless and uninteresting and they're recycled over and over again. In one mission you have to track down a poacher who is hunting an endangered species on a remote planet. For some reason, in order to catch the poacher you have to fight through a half-dozen screens of multicolored frogs, as well as fish that spit deadly flower petals at you. In a later mission, you'll have to go to an artificial Tron-like world to fight the computer brain that is controlling the place. A few missions later, the computer brain invites you back to do it all over again, and you agree to go because it's good practice for the other missions. So, you fight the exact same mission and boss all over again, which is especially lame because it isn't even fun the first time. Other missions are shamelessly rehashed as well, and none of them are fun to play. You can transform from a dinosaur into a vehicle, and somehow it isn't fun at all. Most missions are divided up into half a dozen or so different areas. Each area is a small room or section of land that is filled with enemies or a few simplistic puzzles. Usually you just have to defeat all the enemies in the room to move on to the next area, which invariably contains the same exact enemies in the same exact environment. Only this time, there are a couple of tougher enemies thrown in to make it feel like you're progressing ever so slightly. At the end of each mission there is usually a boss, but for all the missions in the game there are only about five different bosses that get reused over and over again. The fighting in these missions is repetitive and tedious, and you just hit the square button repeatedly to perform the same short combo in hopes of hitting any nearby enemies. If you take too much damage while on your dinobreaker it will overheat, which for some reason means you have to get off the machine and run around trying to avoid enemies, since you take more damage when in your regular human form. If you take too much damage this way, you'll die and have to start the area over again. The fighting is awkward enough, but it doesn't help that the dinobreakers move like clumsy mechanized drones. Granted, that's how a huge robot dinosaur probably would handle in real life, but it's just frustrating because you're constantly fighting the controls to get your dinobreaker to go where you want it to. To make matters worse, some levels have you clunking around on ice. So in addition to being slow and clumsy, you also slide all over the place. But that isn't even the worst of it. There are actually some platform-jumping sections in the game, which is the last thing you want to see when you have a hard enough time controlling these dinosaur mechs on the ground. As mentioned earlier, there are some vehicle challenges as well. Sometimes during a mission you'll have a simple driving challenge like hitting a switch and then racing along a precarious path to an open door before it closes. Other than that, you'll also need your vehicle form to participate in some actual races. The races seem like an interesting idea (even if they don't make any sense in the context of the game), but they are so poorly executed here that you'll actually look forward to getting back into combat. For one thing, the top speed of your vehicle is about equivalent to that of your average riding lawn mower, and the engine sounds about the same. You do have a boost button at your disposal, but there are rarely any good opportunities to use it, as the tracks are so poorly designed for racing. The racetracks are filled with 90-degree turns, and since there are no side rails and your vehicle has a terrible turning radius, you'll often fly right off the edge of the track even when you don't use the boost. When you do fly off the track, you'll spawn back onto it, and then immediately you'll be thrown off your dinobreaker as it begins to overheat. As you not only have to wait to get back on track, but also to get back on your vehicle, a single crash will cost you several seconds and, in turn, will usually cost you the race. Most likely you'll fall off the track several times each lap, which turns the whole racing experience into a frustrating mess. The production values for D.I.C.E. are entirely unimpressive, even for a game based on a C-grade anime series. The textures are smeared and flat, and the environments are empty and full of hard edges that give the world a completely generic sci-fi look. There are only a few types of enemies in the game, and none of them look cool or menacing. You'll see the frame rate drop frequently when you're fighting several enemies at a time, though it does recover fairly quickly. The dinobreakers look shiny and detailed, and their swinging tails and bobbing heads animate fairly well. The dinobreakers look pretty cool, but everything else just looks dull. The sound in D.I.C.E. ranges from weak to annoying. While racing you'll hear the same tire-squealing noise constantly, even if you transform into your dinosaur form and try to run the track. You'll also hear the same grunts and gasps from the characters as they fight, and all of the weapon noises are generic and subdued. The dialogue in the game is fully voiced, but the voices don't lend any personality to the characters. The music sounds like something you've probably heard in an elevator before, and you could play this game all the way through without ever noticing it. Even if you are the world's most dedicated D.I.C.E. fan, you'll want to avoid this game. It is obviously intended for a younger audience, but there are a ton of other, much better games that cater to kids, which is all the more reason to leave this one on the shelf. It will take you five or six hours to complete the game, and you can replay the missions to collect coins and purchase new satellite bots and training missions. But none of that is worth the effort. There's a two-player versus mode available, but sharing the problematic gameplay with a human opponent doesn't make the experience any more appealing. If you're a big fan of the anime then you'll get much more satisfaction watching reruns on the Cartoon Network than you will playing this game."}