{"ref": "https://www.gamespot.com/reviews/lego-indiana-jones-the-original-adventures-review/1900-6191972/", "date": "June 2, 2008", "game_name": "Lego Indiana Jones: The Original Adventures", "text": "Now that Traveller's Tales has conquered a galaxy far, far away, it has set its sights on giving a Lego makeover to a more terrestrial franchise. Lego Indiana Jones: The Complete Trilogy lets you reenact the key scenes from the first three Indiana Jones movies, with a blocky twist only Lego can provide. The idea of children's building toys pasted atop action-packed adventures may seem strange--and seeing a Lego monkey is rather unnerving--but the enduring charm of the movies is the perfect foundation for some small-scale tomb robbing. The surprise is, even without a nostalgic-powered handcuff fastening you to these stories, the seamless co-op and clever puzzles should be enough to draw even the Indy ignorant into the experience. Like the Lego Star Wars games, Lego Indiana Jones is primarily a puzzle-solving game with light combat and platforming elements. While the core experience remains largely unchanged from the previous games, the puzzles are constructed in a much more intelligent and logical manner this time around. Previous Lego games had bewildering sections that would stump even seasoned puzzle-solving veterans, not to mention frustrate casual fans who were just looking for a Star Wars fix. Those tricky sections still exist in Lego Indiana Jones, but now they have been relegated to the bonus missions. Though you'll still spend the majority of your time trying to figure out how to open locked doors or cross perilous pits, the pacing is never halted by overly complex solutions. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Lego Indiana Jones: The Original Adventures Video Review 1 It's a shame Lego camels cant spit. Even though the adventuring is more streamlined this time, the obstacles you'll encounter are quite diverse. Every level seems to throw a new trick your way that will continually keep you on your toes. The most amusing puzzles involve the severe phobias with which certain characters are cursed. Indiana has no fear swinging across molten lava with his whip or leaping over spikes while being run down by a giant boulder, but if you put a snake in front of him, he'll become nearly catatonic. The boss battles also provide a unique twist in every encounter. From having to figure out how to hurt a man who can regenerate his health to fighting against someone who won't stop jumping, these encounters serve as a fun diversion you'll have to solve quickly, lest you find your Lego head popped clean off. Other sections have you using elephants to cross mud, driving a motorcycle while being chased by a group of bikers, and trying to get a monkey to part with some dynamite. There is also a nauseatingly awesome mine cart ride in The Temple of Doom section that, though brief, is quite exhilarating. Though the puzzle aspects alone are enough to make Lego Indy worthwhile, the humor makes it enjoyable even for people just watching the action. The silent cutscenes take you through the journey in a much sillier manner than Steven Spielberg originally envisioned. No, you won't see the Lost Ark melt some unfortunate Lego person's face, but you will see Indy's father fall asleep (because he's old!) and even the Harrison Ford look-alike donning a blonde wig to deceive a foolish guard. The humorous touches go beyond just the cutscenes; there are funny nods all around you. If you have time to marvel at the decor when trying to escape from a burning castle, you might see a painting of the Sphinx with a Lego head. Traveller's Tales also included a few references to its previous Lego games. You can see soldiers wearing Darth Vader masks, Belloq mocking C-3PO, and a clever homage to Hoth hidden away in one level. It's worth playing the levels a few times just to pick up on all the references, but there is a much more tangible reason than that: They are jam packed with hidden goodies. It's actually impossible to get all the bonus items your first time. There are a number of different character-specific traits, so you'll have to unlock Free mode to see all that every level has to offer. The different traits help keep the tasks varied throughout the game. Indiana has his trusty whip, which can not only help him swing across gaps and grab objects from far away, but can also bring the ladies closer (and steal a quick kiss). There are also scholars who can decrypt hieroglyphics, smaller-sized characters who can squeeze through tiny spaces, craftsmen equipped with a wrench or a shovel, and bad guys who can enter secret Thuggie doors. You'll be lucky to finish 50 percent of this game your first time through, so it's overflowing with replay value. Not everything is perfect in Legoland, though. The artificial intelligence is particularly awful. You'll need your AI-controlled pal to help you solve puzzles sometimes, but you'll find your pal less than willing in a few cases. This can be solved either by inviting a friend to play through the game with you (the best option) or plugging in a second controller to move both characters yourself. Trying to coax the AI to do your bidding can be an exercise in frustration, though. The fighting can also get repetitive, especially when a swarm of enemies continually runs at you while you're trying to solve a particularly complex puzzle. Bosses are usually protected by a troop of soldiers, making them more difficult to defeat. Finally, the jumping portions can be very inconsistent. It's not always possible to judge how far away you are from a platform, which leads to many untimely deaths and arduous retries. None of the flaws destroy the enjoyment, but it's disappointing to see the same problems from the previous Lego games rear their head once again. I'm like a bad penny, I always turn up. The three versions of Lego Indy are nearly identical. The game looks best on the PS3 and 360, but the simple aesthetic works quite well on the Wii. The Wii version does let you use motion controls, but you'll probably ignore that option after it takes you five minutes to dig up a buried treasure. Though it can be fun to snap the controller like a whip if you're feeling feisty. You really can't go wrong no matter which Indy you choose. Lego Indiana Jones serves as the expected progression from the Lego Star Wars games. The great pacing, humorous cutscenes, and challenging-but-not-cheap puzzles make this the most enjoyable Lego game yet. It's not the hardest game, but it has enough hidden goodies to make you play through more than once. Both newcomers and diehard fans of Traveller's Tales' previous Lego offerings will find plenty to enjoy here."}