{"ref": "https://www.gamespot.com/reviews/ultimate-fighting-championship-throwdown-review/1900-2876655/", "date": "May 17, 2006", "game_name": "Ultimate Fighting Championship: Throwdown", "text": "Crave's games based on the mixed martial arts competition, the Ultimate Fighting Championship, have already appeared on the other current consoles. The series got its start as a refreshing Dreamcast game that had the pick-up-and-play appeal of a typical fighting game while still remaining reasonably true to the sport. Now the GameCube is getting its turn with a UFC game. Fans of the previous games in the series will find little new here, but if you've been holding out on buying the game until it came to the GameCube, then this rendition of Throwdown should serve you just fine. UFC offers a number of different modes of play, all revolving around short, brutal bouts between two opponents. The arcade mode simply pits you against all the different fighters until you lose a fight. Championship mode breaks up the proceedings by weight class. Tournament mode lets you set up elimination-style tournaments for up to eight players. Exhibition mode is for setting up any fight you want for two, one, or no players (you can just watch the computer go at it). Training mode gives you a chance to practice your moves. The career mode is the deepest mode in the game, giving you the opportunity to design and create a rookie fighter and take him up through the ranks. You'll choose from different skin tones and trunk styles, and you'll be able to assign a fighting style and earn moves as you progress. The sparring in this mode earns you points that can be spent to raise your fighter's abilities in a few different categories, such as stamina, punch, kick, and wrestling. The fighting in UFC Throwdown combines the four-button scheme from Tekken with the regenerating life meters of a boxing game. You have to worry about your stamina, which drops every time you execute a move and gradually recovers when you stand still. Losing stamina is the same as losing life, so punching a whole lot sets you up for a fall in the form of a one-blow knockout. So it's important to know when to back off. The rounds are short enough that this rarely becomes an issue with the professional fighters, but early fights in the career mode require you to think about your stamina an awful lot, making for an interesting tactical twist. The Tekken-style button scheme assigns one button to each of your limbs. Pushing certain buttons simultaneously allows you to catch punches or kicks with countermoves, shoot in for a takedown, or duck out of the way. You can also execute submission moves by hitting the two left or two right buttons, but it's really quite easy for the opponent to mash out of a submission attempt, so it's rare to actually land one and cause a tap-out, but in theory you can use these moves to end a match at any time. The game's AI is passable, but like most any fighting game, UFC Throwdown is really at its best when played by two people. The GameCube controller doesn't help, however. The game tries to assign button shortcuts to the analog triggers, but the fact that the analog triggers don't do anything until clicked all the way in makes timing counters with them a frustrating experience. You're better off merely trying to adapt to the GameCube's face buttons, something that won't be terribly easy for veterans of the series. Visually, UFC Throwdown looks good overall, but certainly could have looked better. The character models are OK, and they animate pretty well. The ring also looks passable. However, the game is very light on visual effects, and overall it has a stripped-down, empty feel to it. Even the menus look half-finished somehow. The soundtrack brings the overall presentation down a few notches. The menu music is grating, the referee voices occasionally jumble up a bit, the fighter voices are unconvincing, and the crowd noise mostly consists of weird gorillalike chanting. True to the real-life sport or not, the crowd noise is incredibly annoying and is bad enough to make you just mute the whole game. The fighting is fun, but the presentation problems do get in the way just enough to become an issue. Add to that the inability to skip the long-winded post-fight judging and game-over sequence, and the usual problems encountered when playing most any fighting game on the GameCube's specialized controller, and you're left with a game that's already been done better on the Dreamcast, as well as the Xbox and PS2. If you've never played another version of UFC, and you think you can get past the controller problem and other issues, then there's a good deal of multiplayer fun to be had with UFC Throwdown. Otherwise, any other version of this game--except for the atrocious release for the original PlayStation--would be a significantly better choice."}