{"ref": "https://www.gamespot.com/reviews/ultimate-fighting-championship-throwdown-ps2/1900-2869200/", "date": "January 28, 2004", "game_name": "Ultimate Fighting Championship: Throwdown", "text": "UFC: Throwdown for the PlayStation 2 marks the return of the Ultimate Fighting Championship to a Sony system, although those who remember the disappointing UFC game for the old PlayStation may be skeptical about this release. Fortunately, UFC: Throwdown follows in the footsteps of the better games in the series' history, featuring responsive gameplay, good graphics, and a formidable roster of fighters. Yet the most significant addition to this version of the game is a career mode that lets you create your own fighter, which adds plenty of stand-alone value to the sort of game that's previously been best suited to two players. In the Ultimate Fighting Championship, two men enter the confines of the octagon, and their goal is to make their opponent tap out via submission or pummel him into unconsciousness. The gameplay in UFC: Throwdown makes use of a control scheme similar to that of the Tekken series, where each of the gamepad's four face buttons corresponds to a limb, and combinations of these buttons perform special techniques, such as punch and kick counters and shoots. Shooting in on an opponent to perform a tackle, a body slam, or other takedown is how fights are taken to the ground, where the Ultimate Fighting Championship games' fighting system shows its thoroughly unique nature. When on the ground, fighters are placed into either the top or bottom position, with the top fighter having the advantage of leverage and thus the ability to put more force behind his punches. Here, fighters can reverse positions, throw punches, or attempt submission maneuvers. When a character is caught in a submission hold, he has a brief instant to attempt to fight out of it. Otherwise, his entire health meter diminishes instantly, and the fight is over. That's how UFC matches are quite different from those found in traditional fighting games--someone can come from behind with a tap-out victory at seemingly any moment. These fighters can compete in single exhibition matches, an arcade mode that challenges you to defeat as many fighters as you can in a single streak, player-made tournaments, and a UFC mode, where the athletes face off to see who will come out on top. UFC: Throwdown features many of the fighters who have made the Ultimate Fighting Championship the popular spectacle that it is in real life, including cover athlete and light heavyweight champion ~Huntington Beach Bad Boy~ Tito Ortiz, heavyweight champion Josh Barnett, and ~The Iceman~ Chuck Lidell. Stalwarts from UFC history are also available, such as Dan ~The Beast~ Severn, and Mark ~The Hammer~ Coleman. Also making the cut are notable newcomers to the UFC games, such as B.J. Penn, Dragon Ball Z jujitsu stylist Carlos Newton, ~The King of Rock 'n' Rumble~ Elvis Sinosic, and ~The Phenom~ Vitor Belfort. The roster is composed of 28 fighters before the hidden characters are unlocked, and in the end, just about everyone will be able to find a character with a fighting style that suits his tastes. The graphics in UFC: Throwdown are of relatively high quality. Certain aspects of the game's visual presentation nearly match the quality found in the Xbox and GameCube UFC games. The fighters are generally well animated and show off plenty of fine detail, especially in their faces. The fighters' likenesses are quite a bit more impressive than their body structure, though, which seems a bit more blocky than in the other UFC games. The fighters' arms also appear to hang off their bodies at awkward angles during the ring entrances, and this is likely attributed to the game's use of hand-made animation, as opposed to motion-capture. The entrances do look solid as a whole, thanks to the excellent tale-of-the-tape presentation, the accurate ring introductions performed by Bruce Buffer, and the streaming video audiences that cheer and wave as the fighters make their way to the octagon. Postfight replays have been tweaked in this version of the game, in that a film-exposure effect is used to emphasize submissions, while motion blur puts extra ~oomph~ into knockouts--although the reverberating of the fighters' screams of pain during these replays can be grating on the ears, as can the harsh clanging and banging noises of the game's menus. There is little music to speak of in the game, save for that played during ring entrances, so UFC: Throwdown's audio presentation could just as easily be replaced by music on your stereo, if you were so inclined. All the matches take place in the octagon. If you've played other UFC games before, then you'll find that UFC: Throwdown's claim to being a worthwhile investment is its fleshed-out career mode, which in reality is the game's thorough create-a-fighter mode. Upon beginning a new career, you are assigned a neophyte fighter and are allowed to select his size, appearance, name, and fighting style. You begin your career with only the paltriest of techniques in your repertoire--a few basic punches and kicks. In order to learn new moves, you spend skill points that are used for challenging computer-controlled opponents to fights with specific victory requirements. For example, to master a triangle armbar technique, for jujitsu stylists, you may have to knock out your sparring partner from the bottom of the guard position. In order to master a new takedown, you make have to take your opponent to the mat five times in a single round. Some of these challenges can be fairly brutal, such as those that require you to submit an opponent without sustaining any damage. But there is no penalty for failure, so you can attempt a challenge as many times as you like. Once you've expended your skill points for a fighting style's current set of selectable moves, you must then defeat five sparring partners to qualify for the tournament, after which you gain more skill points, a new ranking, and the option to learn techniques from a new style. So, for example, you can have a new fighter learn the basics of kung fu for two levels, then graduate to jujitsu in the fourth level to obtain some much needed submissions, and then begin training in pit fighting at the fifth level for knockout power. These custom fighters can then be exported to the main game's modes, where they can be put to the test against the legitimate UFC fighters. The action on the mat can get pretty intense. UFC: Throwdown's career mode shows off the impressive artificial intelligence that should keep players of nearly all skill levels entertained. In the beginning ranks, sparring partners will only put up the most basic of defenses and will often give in to submissions. In the higher ranks, CPU fighters will counter strikes, reverse positions, and even put you in their most dangerous submission holds. UFC: Throwdown plays nearly identically to previous games in the series--most notably UFC: Tapout for the Xbox and the original Ultimate Fighting Championship for the Dreamcast. While the control, animation, and graphics are solid, those who have already picked up a game in this series may not find enough in the new career mode to warrant picking up another extremely similar game. However, if you haven't played any of the UFC games before, or if you've been waiting for the series to come to the PlayStation 2, then Throwdown makes a fine introduction. Postfight replays have been tweaked in this version of the game, in that a film-exposure effect is used to emphasize submissions, while motion blur puts extra ~oomph~ into knockouts--although the reverberating of the fighters' screams of pain during these replays can be grating on the ears, as can the harsh clanging and banging noises of the game's menus. There is little music to speak of in the game, save for that played during ring entrances, so UFC: Throwdown's audio presentation could just as easily be replaced by music on your stereo, if you were so inclined. If you've played other UFC games before, then you'll find that UFC: Throwdown's claim to being a worthwhile investment is its fleshed-out career mode, which in reality is the game's thorough create-a-fighter mode. Upon beginning a new career, you are assigned a neophyte fighter and are allowed to select his size, appearance, name, and fighting style. You begin your career with only the paltriest of techniques in your repertoire--a few basic punches and kicks. In order to learn new moves, you spend skill points that are used for challenging computer-controlled opponents to fights with specific victory requirements. For example, to master a triangle armbar technique, for jujitsu stylists, you may have to knock out your sparring partner from the bottom of the guard position. In order to master a new takedown, you make have to take your opponent to the mat five times in a single round. Some of these challenges can be fairly brutal, such as those that require you to submit an opponent without sustaining any damage. But there is no penalty for failure, so you can attempt a challenge as many times as you like. Once you've expended your skill points for a fighting style's current set of selectable moves, you must then defeat five sparring partners to qualify for the tournament, after which you gain more skill points, a new ranking, and the option to learn techniques from a new style. So, for example, you can have a new fighter learn the basics of kung fu for two levels, then graduate to jujitsu in the fourth level to obtain some much needed submissions, and then begin training in pit fighting at the fifth level for knockout power. These custom fighters can then be exported to the main game's modes, where they can be put to the test against the legitimate UFC fighters. UFC: Throwdown's career mode shows off the impressive artificial intelligence that should keep players of nearly all skill levels entertained. In the beginning ranks, sparring partners will only put up the most basic of defenses and will often give in to submissions. In the higher ranks, CPU fighters will counter strikes, reverse positions, and even put you in their most dangerous submission holds. UFC: Throwdown plays nearly identically to previous games in the series--most notably UFC: Tapout for the Xbox and the original Ultimate Fighting Championship for the Dreamcast. While the control, animation, and graphics are solid, those who have already picked up a game in this series may not find enough in the new career mode to warrant picking up another extremely similar game. However, if you haven't played any of the UFC games before, or if you've been waiting for the series to come to the PlayStation 2, then Throwdown makes a fine introduction."}