{"ref": "https://www.gamespot.com/reviews/grand-prix-3-review/1900-2620421/", "date": "May 17, 2006", "game_name": "Grand Prix 3", "text": "NASCAR may reign in the US, but Formula 1 is the worldwide king of auto racing. The F1 season ranks second only to soccer's World Cup and the Olympics in TV sports viewership. Not surprisingly, game companies have been quick to offer F1 racing simulations to fans of the motor sport, including Electronic Arts' recently released F1 2000 and Eidos Interactive's F1 World Grand Prix. These games have their strengths, but they still haven't earned the status of Geoff Crammond's Grand Prix II, which was released in 1996 and is still considered to be one of the few truly superb F1 sims because of its combination of excellent graphics, detailed realism, and great gameplay. Fans still speak of it reverently, which is why its new sequel, Grand Prix 3, was so highly anticipated. It's finally available, and while it may not be everything that Grand Prix II players hoped for, it's still a reason for F1 fans to rejoice. Installing Grand Prix 3 is simple enough because the full installation is just 320MB, but getting your controller configured is a different matter. You'll need to calibrate it in the game, even if you've already calibrated it in Windows. Oddly, the game doesn't recognize the third axis of your controller; if you use dual-axis pedals or a separate throttle on your joystick, you're out of luck. A patch to fix the problem has been announced. The controller configuration menu itself is a bit convoluted, and the same holds true for the game's menu system in general. There are some annoying oddities in the labeling and layout of the menu items that, at least at first, will have you leaping back and forth to find the options you want. Fortunately, the menu items feature detailed pop-up tooltips. Grand Prix 3's graphics are amazing one moment and embarrassing the next. When you first boot the game, it will choose the optimal settings for your system, and it does a decent job of configuring itself for reasonable frame rates. Later you can easily switch the resolution and tweak many detail settings to your own preference. The opening video and credits are stylish and effectively help you get into the game, as do the great full-screen background photos that grace the menu pages. These background shots are also appropriate to the individual menus; for example, behind the sound menu, you'll see a picture of McLaren driver Mika Hakkinen plugging his ears. On the track itself, the graphics quality varies widely. The cockpit is excellent: The steering wheel LCD readout, gearshift warning lights, and other indicators are all carefully detailed. The actual car models are also well detailed, from the individual wheel spokes to the varied sponsor logos. When cars collide or crash, individual pieces will shatter and fly off. But it's the game's weather effects that really steal the show: Rain can start to fall partway through a race, and you'll see dim reflections in the puddles. As cars race ahead of you, they'll spray mist that partially obscures your view. You'll even notice the track start to dry on the common racing line. Sometimes it will rain on one part of the track but not on another, as in the recent German Grand Prix. These weather quirks call for vital tactical decisions: On one occasion, I was leading a race through Spa when it started to pour on just part of the track. With the race nearly done, I didn't want to lose time in the pits switching to wet-weather tires. Not switching tires worked for Rubens Barrichello in the German Grand Prix, but I was no Barrichello: I spun out on a slick curve and ended up in fifth place, which was a frustrating but fun way to lose. Despite these strengths, the game does have some pretty serious graphics flaws. The trees look pixelated and poorly shaded. The shadows are also too blocky and too dark. Distant objects will sometimes oddly pop in and out of view as you approach, and you can sometimes see through barriers. Spectators in the stands look more like repeated rows of colored dots than like actual individuals. Your pit crew in Grand Prix 3 is also composed of bitmaps that look bad compared with the 3D polygonal graphics in the game. Yet the game's biggest graphics flaw is that without an extremely fast system, you'll have to crank down most of the detail settings to retain any sense of fluidity and speed.Just as the graphics quality varies widely, so too does the sound. The music is effective, particularly the intro movie theme that starts in a minor key and builds to a crescendo when the lights go green. The game's sound effects are generally varied and colorful. Your engine's whine is forceful instead of weak as in many other F1 sims. Shifting gears, locking wheels, skidding into the gravel pits, and crashing into barriers sound realistic and weighty. But oddly enough, when I hit a nearby car, it was silent as it flipped up off the track and tumbled into the wall, spraying wheels and wings as it went. What's worse is that you don't hear cars approaching during passing attempts. Another flaw is the lack of radio traffic between drivers and their pit crews. Unlike in F1 2000, you won't hear your team updating you on the race situation; instead, you'll just get blocky typed messages at the top of the screen. The graphics and sound can be very frustrating, but the game isn't really about eye candy; it's about gameplay, and that's where it excels. You can select from four different race types: quick race, practice, full race weekend, or full championship season. The 16 tracks, all featured in beautiful overhead previews, can be configured for variable rain or sunshine. Starting grid position, practice time limits, number of laps, and other options are easily changed. Grand Prix 3 is a FIA-licensed product, so you'll get to choose actual drivers, but you're stuck with the 1998 teams. Cars all use the same model, but you can allow for the possibility of different component breakdowns to add to the realism. To suit your skills, you can toggle driver aids like steering assistance and computer-controlled gear shifting. With all the aids selected, the car practically drives itself, which makes the game accessible to novices. Grand Prix 3's physics are realistically challenging. Snap spins, wheel lockups, and over- and understeer are all simulated. You'll need a lot of practice to handle the car on the hardest difficulty settings: At first, it feels like you're trying to steer a rocket across an ice rink. Rain also has a real effect on handling - it's not just for show. Meanwhile, computer-controlled drivers will protect their lines, outbrake you, and provide aggressive competition. However, the computer's artificial intelligence does have flaws. When I spun through a tight corner on a narrow section of the Monaco circuit, I came to a stop in the middle of the road, blocking other cars. Since there wasn't room for those behind me to pass, all the cars just kept banging into me repeatedly. When a single F1 gearbox alone can cost over $100,000, that just wouldn't happen in real life. It's that sort of leading-edge technology, coupled with incredibly powerful engines, that lets real F1 cars blast down straights at 200mph. Nevertheless, F1 racing is a very subtle sport where times are measured in thousandths of a second. Highly precise tweaking of the car is a must, and Grand Prix 3 also excels at letting you do this. Before each race, you can change your pit-stop strategy and tire selection based on rain probability. On the car setup page, you can opt for preset optimal car configurations, or you can create your own and save them for future use. Wing angles, brake bias, gear ratios, suspension, and more are all highly configurable. Make no mistake: While it can be fun for beginners, at its heart, Grand Prix 3 is a hard-core simulation. Multiplayer competition is available over a LAN, serial cable, or direct modem connection. Unfortunately, there's no true Internet play with an in-game server browser. The game wouldn't recognize my cable modem, either. Grand Prix 3 also has an unusual multiplayer mode, where you and your opponent take turns driving different cars on the same computer, while the computer drives for the player who's sitting out. Grand Prix 3 is hardly perfect; in fact, the menus, graphics, and sound can be really disappointing at times. Nonetheless, the game is definitely more than the sum of its parts. All the small details that add to the realism clearly show that it's a labor of love created by true F1 fans, and the realism and complexity only add to the fun, instead of defeating it. The huge number of options creates great diversity and replay value, although the options can be a bit difficult to deal with for the novice. Grand Prix 3 isn't a masterpiece, but if you can live with some of its shortcomings, it'll prove to be a challenge that you can keep coming back to.Just as the graphics quality varies widely, so too does the sound. The music is effective, particularly the intro movie theme that starts in a minor key and builds to a crescendo when the lights go green. The game's sound effects are generally varied and colorful. Your engine's whine is forceful instead of weak as in many other F1 sims. Shifting gears, locking wheels, skidding into the gravel pits, and crashing into barriers sound realistic and weighty. But oddly enough, when I hit a nearby car, it was silent as it flipped up off the track and tumbled into the wall, spraying wheels and wings as it went. What's worse is that you don't hear cars approaching during passing attempts. Another flaw is the lack of radio traffic between drivers and their pit crews. Unlike in F1 2000, you won't hear your team updating you on the race situation; instead, you'll just get blocky typed messages at the top of the screen. The graphics and sound can be very frustrating, but the game isn't really about eye candy; it's about gameplay, and that's where it excels. You can select from four different race types: quick race, practice, full race weekend, or full championship season. The 16 tracks, all featured in beautiful overhead previews, can be configured for variable rain or sunshine. Starting grid position, practice time limits, number of laps, and other options are easily changed. Grand Prix 3 is a FIA-licensed product, so you'll get to choose actual drivers, but you're stuck with the 1998 teams. Cars all use the same model, but you can allow for the possibility of different component breakdowns to add to the realism. To suit your skills, you can toggle driver aids like steering assistance and computer-controlled gear shifting. With all the aids selected, the car practically drives itself, which makes the game accessible to novices. Grand Prix 3's physics are realistically challenging. Snap spins, wheel lockups, and over- and understeer are all simulated. You'll need a lot of practice to handle the car on the hardest difficulty settings: At first, it feels like you're trying to steer a rocket across an ice rink. Rain also has a real effect on handling - it's not just for show. Meanwhile, computer-controlled drivers will protect their lines, outbrake you, and provide aggressive competition. However, the computer's artificial intelligence does have flaws. When I spun through a tight corner on a narrow section of the Monaco circuit, I came to a stop in the middle of the road, blocking other cars. Since there wasn't room for those behind me to pass, all the cars just kept banging into me repeatedly. When a single F1 gearbox alone can cost over $100,000, that just wouldn't happen in real life. It's that sort of leading-edge technology, coupled with incredibly powerful engines, that lets real F1 cars blast down straights at 200mph. Nevertheless, F1 racing is a very subtle sport where times are measured in thousandths of a second. Highly precise tweaking of the car is a must, and Grand Prix 3 also excels at letting you do this. Before each race, you can change your pit-stop strategy and tire selection based on rain probability. On the car setup page, you can opt for preset optimal car configurations, or you can create your own and save them for future use. Wing angles, brake bias, gear ratios, suspension, and more are all highly configurable. Make no mistake: While it can be fun for beginners, at its heart, Grand Prix 3 is a hard-core simulation. Multiplayer competition is available over a LAN, serial cable, or direct modem connection. Unfortunately, there's no true Internet play with an in-game server browser. The game wouldn't recognize my cable modem, either. Grand Prix 3 also has an unusual multiplayer mode, where you and your opponent take turns driving different cars on the same computer, while the computer drives for the player who's sitting out. Grand Prix 3 is hardly perfect; in fact, the menus, graphics, and sound can be really disappointing at times. Nonetheless, the game is definitely more than the sum of its parts. All the small details that add to the realism clearly show that it's a labor of love created by true F1 fans, and the realism and complexity only add to the fun, instead of defeating it. The huge number of options creates great diversity and replay value, although the options can be a bit difficult to deal with for the novice. Grand Prix 3 isn't a masterpiece, but if you can live with some of its shortcomings, it'll prove to be a challenge that you can keep coming back to."}