{"ref": "https://www.gamespot.com/reviews/gripshift-review/1900-6163890/", "date": "June 22, 2007", "game_name": "GripShift", "text": "Originally released in September of 2005 for the PlayStation Portable, GripShift was an interesting albeit flawed platform/driving game, and it's now available as a downloadable title for the PlayStation 3. Developer Sidhe Entertainment has gone back and addressed many of the original game's problems, most notably the handling, which is much better now. Unfortunately it also removed some content, such as the track editor and bonus games. As a result, anyone who spent time with the original game won't find much value with the PS3 version, but anyone looking for an enjoyable puzzle/driving/platformer might find GripShift an enjoyable way to pass the time. The first courses are simple, but they quickly get more complicated. GripShift is best described as a cross between Super Monkey Ball and TrackMania. As in Super Monkey Ball, the elevated tracks have you navigating mazelike courses, while others involve racing against one or more competitors, much like in TrackMania. In the game's challenge mode you choose from a handful of cars with varying attributes and then head out to the course, where you'll collect objects, avoid hazards, and try not to fall off the track in an effort to get to the finish line before time expires. There aren't difficulty settings per se, but the game starts you off on tracks rated for beginners and you'll need to finish courses and win credits to unlock the easy, intermediate, hard, and insane tracks. There are well over 100 tracks to open up, and earned credits also unlock new songs, cars, skins, and wheels. You're awarded credits based on your finish time, how many stars you collected, and whether or not you found that course's hidden GS icon. The initial tracks are rather straightforward, and it's fairly easy to collect all of the stars and the GS icon and finish in the allotted time all in one run. The tracks become more difficult by adding jumps, moving platforms, magnets, TNT, crushers, teleporters, and a variety of other objects into the mix, and as you progress you'll likely have to pick and choose your goals, because there's not time to accomplish them all in a single run. This means you'll end up replaying many of the courses at least once to earn all possible credits. While the original GripShift quickly became difficult due to an uneven learning curve and unwieldy controls, the PlayStation 3 version is much friendlier. For starters, the cars handle much better. Because they can still be controlled in midair (you can even change directions midflight), the cars don't feel much like actual cars, but at least now they're responsive. But as was the case in the PSP version, there are instances where you don't have as much control over your vehicle as you'd like, and the camera often makes it difficult to see where you need to go (particularly on multitiered levels). Sixaxis support has been added, but it's limited to pitching your car forward or back while in the air, and it defaults to off, which is a good indication of its usefulness. GripShift is also more beginner-friendly this time around, and while it can be frustrating at times (especially during the races), it doesn't have the same rage-inducing qualities of the original. The game is at its best when it doesn't get too convoluted. The courses that have multiple branching paths, teleporters, and hover areas just aren't as fun as those in which the challenge comes from narrow roads, loops, and big jumps. However, a number of things the game still does poorly keep it from reaching its potential. Once again, despite the crazy premise, the game has almost no personality. There's no reason given as to why you're doing what you're doing, and the cars and drivers aren't very interesting. But key among these issues is the racing, which is downright poor. There's a full racing mode that has single races as well as tournaments, but you get your fill of the lousy racing in the game's challenge mode, so there's little reason to try it here. While the cars feel faster than before, they still aren't all that speedy--a big problem in an arcade-style racer. The weapons on the track--rockets and TNT--are uninteresting, and unless you use them on a loop, they're ineffective. The elastic artificial intelligence makes for some maddening finishes where you lose simply because you got hit with a rocket mere feet from the finish line. Often you can race the same race over and over with the same frustrating result. There's an online multiplayer mode, but we were never able to find anyone online. Even if there were people playing, the racing is simply not one of the game's strengths. Zooming around picking up stars isn't always as easy as it looks. For a downloadable game, GripShift looks nice. It runs in 720p, looks very crisp, and has a nice draw distance and some decent lighting effects. And the frame rate, while not blistering fast, is always consistent. The remixed course designs are creative, even if their settings often aren't. Some of the less interesting ones take place in or above a desert or snowy area, but there are some that have a haunted-house vibe to them, even some tracks that have dinosaurs chillin' on the sides. The audio isn't bad, but like the rest of the game, it isn't all that interesting. Your driver will yell lame catchphrases from time to time, and the cars sound like, well, cars. The soundtrack features a surprisingly large number of trance/dance/hip-hop songs, and they're not too bad. But they're not that good, either. While still flawed in many areas, GripShift on the PlayStation 3 isn't a bad game, and it's certainly more enjoyable and accessible than its predecessor. Sure, the presentation leaves a lot to be desired and the racing is lousy, but the puzzle stages are fun, and you get tons of content for your 10 dollars."}