{"ref": "https://www.gamespot.com/reviews/cossacks-the-art-of-war-review/1900-2862230/", "date": "September 5, 2002", "game_name": "Cossacks: The Art of War", "text": "Cossacks: The Art of War is the expansion pack to last year's Cossacks: European Wars by GSC Game World. Cossacks is a real-time strategy game set in Europe during the 17th through 18th centuries. What makes the game particularly interesting is that it focuses on epic-scale historical events and the nations that forged them. The Art of War continues on this theme by adding new campaigns, historical battles, and two new nations. While the expansion doesn't drastically change the core elements, its additions to the gameplay make Cossacks much more enjoyable by opening up more strategic options.The Art of War's new content will keep any strategy fan busy for quite a while. There are five new campaigns, which will place you in command of notable historical figures like King Frederick of Prussia or Algerian pirates in the Mediterranean. Each campaign spans several missions and will take you all over Europe as you proceed. If the campaigns weren't enough, there are also new single-player missions and new historical battles to fight. Bavaria and Denmark have been added to the roster of playable nations, but curiously enough, neither is featured prominently in any of the new missions. At any rate, these are very similar to every other European nation in the game. There are also new units in The Art of War. The majority are ships that you can build once your nation advances to the 18th century. They make naval battles much more devastating and stress importance of dominating the seas if the map has water.There are numerous new options to select when starting a new battle. First of all, you can now select a difficulty rating when playing campaign missions. Being able to adjust the skill level of the opponent makes the campaigns accessible to both new players and to those with a lot more experience. Anyone should enjoy the new customization options in launching a random map, though. There is a huge list of choices to select from. You can start the game with an army, or with cannons, or perhaps you'd just like a swarm of peasants. There are also other types of choices, like starting in the 18th century or having the whole map revealed. You can disable the capturing of peasants and buildings and also choose to not let players build cannons and defensive structures. One of the more interesting options is peacetime. The host can select a length of time when players can build up their economy and military with no pressure. What prevents you from attacking someone else? If you attack someone during peacetime, your attacking units will be destroyed instead. Another noteworthy addition to single-player random maps is that you can now choose teams for the computer opponents. That way, you can enjoy a large-scale battle by yourself without having to worry about seven nations demolishing you within minutes. With all of these different options, players are bound to find a game type that they can enjoy.Once in the game, you'll find that there are lots of gameplay improvements. The most drastic change is that each artillery depot can now field only five cannons at a time. An artillery depot will not let you build a sixth cannon if it has already produced five that are still on the battlefield. Since there's an exponentially increasing cost associated with constructing multiple buildings of the same type, this effectively limits the number of cannons you can have in an army. It helps prevent stalemates when players avoid attacking for fear of losing their entire army, and it more accurately represents that artillery was expensive to create and maintain.Other improvements are seemingly simple yet strategically important. Units can now be ordered to guard other units or patrol an area. Both of these options are best used to defend units that can be captured, such as cannons and peasants. Artillery now has the ability to attack the ground to ward off incoming forces threatening your borders. Formations have been tweaked as well. You can group formations to act as a single entity. Now you won't have to constantly arrange your units individually on the battlefield. You can also replenish formations that have suffered losses, but it's not entirely useful considering the massive losses of life in the later parts of the game.There are a few areas that The Art of War did not change, some of which are a bit disappointing. The game's graphics and sound have not improved since the original game, but that's not that big of a deal. The game still looks good--nothing is more satisfying than being able to see thousands of pikemen on the screen, marching into battle. The absence of unit acknowledgements is still disappointing, but at least cannon fire is still as thunderous as ever. Some AI issues weren't addressed, and they can make the game vexing. The computer is still inhumanly efficient--teaming up with a computer player will make you realize just how cheap the AI can be. Also, when you try to capture the AI's structures and cannons, it will still destroy most of them right as you're about to gain control.The Art of War may not make a whole new game of Cossacks, but that's not a bad thing. With The Art of War, Cossacks becomes an even better real-time strategy game for fans of the genre or the historical period. The fully featured control scheme puts many competing games' control schemes to shame, and the developer was wise to improve upon that even further. The new random map choices add a near-limitless variety of gameplay options for gamers of any skill level, and the new campaigns and missions will keep you playing even longer. All of this can be had in a low-priced $19.99 expansion, so there's no reason why an RTS fan should skip this title. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Cossacks: The Art of War Video Review"}