{"ref": "https://www.gamespot.com/reviews/gears-of-war-2-review/1900-6200486/", "date": "November 3, 2008", "game_name": "Gears of War 2", "text": "The original Gears of War became an action genre classic thanks to its incredible graphics, cinematic presentation, and solid cover system. The sequel repeats this formula, and though it introduces new weapons, enemies, and environments, it remains an incredible yet familiar experience. The 10-hour campaign is rambunctiously entertaining, with clever set pieces and epic confrontations that punctuate the exhilarating stop-and-pop gunplay. The multiplayer offers more significant upgrades, with four new modes, 10 new maps, and support for up to 10 players instead of eight. These things make for a package with significant longevity, and though Gears of War 2 ultimately refines more than it innovates, it still deserves a place in any action fan's collection. Marcus Fenix and Dom Santiago return in Gears of War 2, heading underground to bring the fight to the Locust. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Gears of War 2 Video Review Gears of War 2 picks up the story six months after the end of the first game. The Locust are so powerful that they can sink entire cities from below, whereas the humans are becoming even more desperate thanks to the spread of a disease called rust lung. With fears that the last city of Jacinto might fall, it's down to Marcus Fenix and Dominic Santiago to take the fight to the Locust in a desperate last stand against their alien foes. Survival is at the centre of Gears 2, but there's also personal drama, with themes such as family, death, and even love interwoven into the grand plot. This sheds some light on the characters and the universe, and though it ultimately uncovers more questions than it answers, the game has a much grander premise than its predecessor. In terms of gameplay, Gears 2 is fundamentally the same as the original game, but fans of the series should be able to spot some key refinements. The cover system has been honed so that you cling more accurately to surfaces, and the weapons have received subtle alterations to make them even more balanced than before. The revival system has also been tweaked considerably. Not only can your AI teammates heal you if you're injured, but now you can also tap A to crawl toward them more quickly when you're injured. This makes the game a lot fairer in terms of difficulty and allows for some heart-pounding moments as you race to your teammates to avoid a fatal curb-stomping from the opposition. Gears of War 2 introduces more backstory to the characters and the universe, but it ultimately throws up more questions than answers. Although the assault rifle is still the go-to firearm for the duration of the campaign, there are plenty of other weapons to play with. New to the Gears universe is the flamethrower, which doesn't have a great range but is excellent for dealing with groups of enemies that get a little too close for comfort. Then there are the heavy weapons, which stop you from being able to roadie run but make up for this with their immense power. The mulcher is a high-calibre chain gun that can cut through even the biggest enemies in a single burst, whereas the mortar rains down a shower of explosives from afar. Grenades have also seen improvements; you can stick them to surfaces so they become proximity mines, there's a new model that gives off noxious gas, and the smoke grenade delivers a concussive blast that knocks surrounding players off of their feet. All of these new weapons are great fun to use, and crucially, they're well balanced for use in multiplayer. The first Gears of War was brutally over-the-top in its violence, and the sequel manages to take this even further. You now have four ways of executing your enemies, all of which are mapped onto the face buttons of the joypad. X performs the standard curb-stomp, B delivers a quicker blow to the back of the head, and Y flips your foe over for repeated punches to the face. Finally, the A button lets you grab the wounded enemy to use as a meat shield, affording you some protection until you decide to finish it off with a neck-break. The signature chainsaw move has been adapted so you cut upward from the crotch if you approach from the rear, and if two players ready their saws, they enter a duel that's won by whoever taps the B button the fastest. These new additions improve on the already gritty and satisfying melee combat of the original Gears of War and make close-quarters combat even more gruesomely rewarding. Gears of War 2 has a considerably different look from its predecessor. Whereas the first game was characterised by derelict cities and crumbling monuments, a good portion of the sequel takes place in huge outdoor spaces and underground caverns. You'll see fluorescent lights, snow-capped mountains, and enemies so big you'll actually need to get inside them to destroy them. There are also more vehicle sections, and though they can be a bit fiddly to use, these segments are thankfully short and infrequent. The traditional stop-and-pop gunplay still makes up the majority of the campaign, and it's a raucously enjoyable ride that you'll want to play again and again. The new game modes add more variety and longevity to the Gears multiplayer. Gears of War 2 is best when played with friends, and the entire campaign now features drop-in support and independent difficulty levels for two players. The competitive multiplayer has also been substantially improved and now offers more players, maps, and game modes to select. Warzone, Execution, Assassination, and Annex modes all make a return, along with King of the Hill, which was introduced in the PC version of the game. There are also three new standard multiplayer modes called Submission, Guardian, and Wingman. Submission is a variation on Capture the Flag, but here the flag is a civilian who you carry to the checkpoint using the meat-shield technique. The hostage also carries a gun and is hostile to anyone who comes close, making for a really great twist on the traditional CTF game mode. Guardian is a team-based game with a designated leader; keep the leader alive and everyone else can respawn, but if the leader dies then that privilege is over. Finally, Wingman splits players into teams of two, with the emphasis on working together to kill and revive. You've probably seen these game modes before in other games, but they fit perfectly into Gears of War 2 and add even more variety and longevity to online play. Thankfully, the benefits of being the host online have also been lessened, making the online experience much fairer across the board. The final multiplayer mode is called Horde, and it's the most addictive and challenging take on Gears yet. It could be described as a cross between single- and multiplayer, in which a team of five COGs take on wave after wave of Locust enemies. As long as one player stays alive at the end of each round, the entire team respawns and the game keeps going, with progressively bigger and more difficult enemies. It's an incredibly tense and exciting game mode, and despite the steep difficulty curve, it's highly rewarding to play with friends. Gears 2 is also accommodating to new players and those without Internet connections, with five training missions and bot support for every multiplayer mode except Horde. The bots are surprisingly good at replicating human players, and they make great practice for people who have never played the game online. Gears of War 2 includes a total of 10 new multiplayer maps, plus a code to download five remastered maps from the original game. The new maps take inspiration from the locations in the campaign, whereas new environmental effects change some of the maps as you're playing. For example, Hail features razor-sharp rain that gradually kills anyone out in the open. Furthermore, Day One has a huge emergence hole in which a beast can take swipes at any surrounding players. Finally, Avalanche is completely transformed when a snowstorm hits, turning it from a multitiered level into one flat plane. These environmental effects don't feature in every map and game mode, but they definitely liven up standard deathmatch-style multiplayer game types such as Warzone. The sequel introduces training missions and bots that you can play in nearly all of the multiplayer game modes. The original Gears of War was a spectacular-looking game, and the sequel maintains this high technical and artistic quality. Instead of pushing for increased visual fidelity, the graphics engine adds a couple of other dimensions to the presentation, with walls that crumble under gunfire and dozens of enemies onscreen at once. These new features don't necessarily affect the gameplay, but they look good and help add to the dramatic scale that the designers have chosen. The new organic capabilities of the Unreal Engine make for one particularly memorable level in which you literally have to kill a giant enemy from the inside. Gears of War 2 also has impeccable sound design, with terrific voice acting, meatier weapon effects, and another beautiful cinematic score. Gears of War 2 has a lot in common with its predecessor, but the new environments, darker storyline, and epic scale certainly have a lot to offer fans. The new weapons, melee attacks, and co-op options make for a campaign that you'll want to complete a number of times, and the new multiplayer modes give the game variety and longevity. Simply put, Gears of War 2 is a superior shooter that no action fan will want to miss out on. Gears of War 2 has a considerably different look from its predecessor. Whereas the first game was characterised by derelict cities and crumbling monuments, a good portion of the sequel takes place in huge outdoor spaces and underground caverns. You'll see fluorescent lights, snow-capped mountains, and enemies so big you'll actually need to get inside them to destroy them. There are also more vehicle sections, and though they can be a bit fiddly to use, these segments are thankfully short and infrequent. The traditional stop-and-pop gunplay still makes up the majority of the campaign, and it's a raucously enjoyable ride that you'll want to play again and again. The new game modes add more variety and longevity to the Gears multiplayer. Gears of War 2 is best when played with friends, and the entire campaign now features drop-in support and independent difficulty levels for two players. The competitive multiplayer has also been substantially improved and now offers more players, maps, and game modes to select. Warzone, Execution, Assassination, and Annex modes all make a return, along with King of the Hill, which was introduced in the PC version of the game. There are also three new standard multiplayer modes called Submission, Guardian, and Wingman. Submission is a variation on Capture the Flag, but here the flag is a civilian who you carry to the checkpoint using the meat-shield technique. The hostage also carries a gun and is hostile to anyone who comes close, making for a really great twist on the traditional CTF game mode. Guardian is a team-based game with a designated leader; keep the leader alive and everyone else can respawn, but if the leader dies then that privilege is over. Finally, Wingman splits players into teams of two, with the emphasis on working together to kill and revive. You've probably seen these game modes before in other games, but they fit perfectly into Gears of War 2 and add even more variety and longevity to online play. Thankfully, the benefits of being the host online have also been lessened, making the online experience much fairer across the board. The final multiplayer mode is called Horde, and it's the most addictive and challenging take on Gears yet. It could be described as a cross between single- and multiplayer, in which a team of five COGs take on wave after wave of Locust enemies. As long as one player stays alive at the end of each round, the entire team respawns and the game keeps going, with progressively bigger and more difficult enemies. It's an incredibly tense and exciting game mode, and despite the steep difficulty curve, it's highly rewarding to play with friends. Gears 2 is also accommodating to new players and those without Internet connections, with five training missions and bot support for every multiplayer mode except Horde. The bots are surprisingly good at replicating human players, and they make great practice for people who have never played the game online. Gears of War 2 includes a total of 10 new multiplayer maps, plus a code to download five remastered maps from the original game. The new maps take inspiration from the locations in the campaign, whereas new environmental effects change some of the maps as you're playing. For example, Hail features razor-sharp rain that gradually kills anyone out in the open. Furthermore, Day One has a huge emergence hole in which a beast can take swipes at any surrounding players. Finally, Avalanche is completely transformed when a snowstorm hits, turning it from a multitiered level into one flat plane. These environmental effects don't feature in every map and game mode, but they definitely liven up standard deathmatch-style multiplayer game types such as Warzone. The sequel introduces training missions and bots that you can play in nearly all of the multiplayer game modes. The original Gears of War was a spectacular-looking game, and the sequel maintains this high technical and artistic quality. Instead of pushing for increased visual fidelity, the graphics engine adds a couple of other dimensions to the presentation, with walls that crumble under gunfire and dozens of enemies onscreen at once. These new features don't necessarily affect the gameplay, but they look good and help add to the dramatic scale that the designers have chosen. The new organic capabilities of the Unreal Engine make for one particularly memorable level in which you literally have to kill a giant enemy from the inside. Gears of War 2 also has impeccable sound design, with terrific voice acting, meatier weapon effects, and another beautiful cinematic score. Gears of War 2 has a lot in common with its predecessor, but the new environments, darker storyline, and epic scale certainly have a lot to offer fans. The new weapons, melee attacks, and co-op options make for a campaign that you'll want to complete a number of times, and the new multiplayer modes give the game variety and longevity. Simply put, Gears of War 2 is a superior shooter that no action fan will want to miss out on."}