{"ref": "https://www.gamespot.com/reviews/neverwinter-nights-hordes-of-the-underdark-review/1900-6085189/", "date": "December 8, 2003", "game_name": "Neverwinter Nights", "text": "Hordes of the Underdark is the second expansion pack for BioWare's popular Dungeons & Dragons role-playing game, Neverwinter Nights. The original was a combination of a single-player role-playing game, an editing tool to create your own custom adventures, and a multiplayer role-playing client. Sure enough, Hordes makes additions in each of these areas. The expansion's substantial single-player campaign should last most players 15-20 hours, and while it doesn't have many surprises, it does offer some worthwhile new features that Neverwinter Nights fans should enjoy. Hordes of the Underdark takes place in the perilous depths beneath the Forgotten Realms. The expansion's single-player campaign picks up the story where the previous expansion pack, Shadows of Undrentide, left off. You're still a lone adventurer, though you're now in the town of Waterdeep--a major city in the Forgotten Realms setting--which is under attack by the titular hordes of the Underdark. You end up descending into these cavernous regions to discover and halt the source of the attacks. Thankfully, you don't have to go it alone; you're rejoined by several traveling companions from both the original Neverwinter Nights and Shadows of Undrentide--including the cackling kobold bard Deekin. This time around, you can recruit up to two followers to join you (instead of having only one as in the previous games) so that you can actually have some semblance of a well-rounded adventuring party. However, having a larger party can be both a blessing and a curse. Although the extra firepower is welcome in the challenging confines of the Underdark, you still don't have direct control over your followers. This means that, just like in the previous game, they'll occasionally charge after a large group of monsters you may have hoped to avoid or ambush, or they'll sometimes get lost or end up too far away to help. However, a larger party means that you can better compensate for your own character's weaknesses. Additionally, Hordes lets you manipulate your henchmen's inventory, and it lets you direct their paths of advancement. Several of the characters who join you are ~multiclass~ characters who follow more than one profession, so you can direct them to advance in certain classes in favor of others. The expansion pack offers some other interesting features, such as all-new professions for your own character to specialize in. Hordes offers several new advanced prestige classes, like the champion of Torm, the weapon master, and the red dragon disciple. (The latter eventually grows a pair of wings and even gains the ability to breath fire.) All classes can benefit from the use of the gatehouse, which is an interdimensional hub area that your character can jump to and from at will. The gatehouse is especially useful because, when used in conjunction with magical rogue stones, it lets your character establish a recall point. This means that you can jump back to the gatehouse to rest and recover from injuries sustained during some difficult exploring. Then you can return to the dungeons with fresh legs. Early in the game, your character also recovers a djinni bottle, which contains a portable merchant. This allows you to quickly and easily sell off all of those heavy magical treasures you'd otherwise be carrying around. As you might expect from a game that lets your characters advance to the godlike experience level of 40, you'll pick up quite a bit of impressive loot in Hordes, and you'll fight off a number of formidable adversaries. Fans of the Forgotten Realms can expect to tangle with just about every single adversary you'd expect to find in the Underdark, like beholders, mind flayers, umber hulks, driders, and plenty of drow elves. It seems safe to say that the Hordes campaign is probably the toughest Neverwinter Nights adventure yet (player-made modules notwithstanding). Even if you don't already have a powerhouse character from the previous games, the expansion lets you start out with a level-15 character. Thankfully, the game is paced quickly enough for your character to grow in power so that he or she can more effectively take on the next challenge. Despite the fact that you will face some truly epic battles in Hordes, you may feel like you're facing the same sorts of straightforward hack-and-slash fights that you saw in Neverwinter Nights and Shadows of Undrentide. You'll fight a small group of enemies, and you'll be able to sustain more damage--but so will they. When the dust finally settles, you'll loot a +3 longsword rather than the +1 longsword you would have picked up earlier. You may also find it odd that you can routinely waltz into a dungeon and find piles of high-level loot lying around on the ground. Furthermore, it's doubtful you'll find Hordes' puzzles to be terribly enjoyable. As in many of BioWare's other role-playing games, several of the new game's puzzles require you to perform such uninteresting tasks as flipping a bunch of switches in the correct order or going on a scavenger hunt. However, if you've been playing BioWare's role-playing games for some time, this sort of thing probably won't bother you in the slightest. In fact, you'll likely have a decent enough time fighting your way through the Underdark in the meantime. The expansion pack adds all-new prestige classes, exceptionally high epic levels, and new content for the editor. Hordes also adds all-new Underdark tilesets, creatures, and objects to Neverwinter Nights' already-powerful editor. At launch, servers running the expansion weren't 100 percent compatible with players who didn't already own it, though BioWare is currently working on patching this issue. This incompatibility is unfortunate, but it's clear that the addition of the expansion's new tileset, objects, and creatures--along with the new prestige classes and magical items--will provide a strong foundation for all-new player-made adventures for months to come. We also encountered occasional stability problems and infrequent crashes on setups using ATI Radeon graphics cards, though we experienced no problems on setups with Nvidia GeForce cards. These problems can be annoying, but they're reportedly rare. Hordes also looks and sounds good. The expansion's new underdark areas and monsters are well done, though, like the graphics from the original game, they seem somewhat blocky and lacking of detail--particularly when viewed from up close. This is especially true of the cinematic cutscenes in the campaign, which occasionally feature key characters who are speaking--or bobbing their heads while gesticulating stiffly. Unlike other recent RPGs, such as BioWare's own Knights of the Old Republic, Hordes lacks facial animations or lip-synching. The expansion also reuses some sound effects and music from the previous games, though its new speaking characters deliver their lines competently. Hordes also features a great deal of all-new music that seems much more sweeping and appropriately epic. Ultimately, Hordes of the Underdark is a solid expansion pack that adds a substantial single-player campaign and interesting new options for multiplayer enthusiasts."}