{"ref": "https://www.gamespot.com/reviews/primal-review/1900-6023672/", "date": "March 24, 2003", "game_name": "Primal", "text": "At the beginning of Primal, a hulking demon assaults the lead singer of a heavy metal band just after his show, making off with him to who-knows-where and leaving his girlfriend unconscious and at death's door. Jen, who looks like she'd go out with the lead singer of a heavy metal band, is rushed to the hospital, and she eventually awakens from her coma, thanks to a diminutive gargoyle named Scree, who urges her to follow him into a strange, chaotic alternate reality and to help restore balance both to that world and to hers. Jen's not terribly interested in playing the heroine, but she'd definitely like her boyfriend back. That's where you come in: Primal challenges you to help Jen and Scree help each other as they explore big, seamless environments, solve puzzles, and battle enemies. This action adventure game features some excellent production values, between its outstanding graphics and first-rate voice acting, and it also has some clever twists and original ideas. At the same time, Primal isn't a fast-paced game, and its core gameplay and mechanics aren't always much fun since there's a lot of legwork involved and a lot of locked doors. But it's still a showcase game for the PlayStation 2 and one that will particularly appeal to fans of other occult-themed action adventure games, such as the Soul Reaver series by Crystal Dynamics. Jen and Scree make an unlikely yet likable duo as the main characters of Primal. Primal is played from a third-person perspective, where you'll control either Jen or Scree. You can switch between the two at any time by pressing the Select button, and generally, the character you're not controlling will do his or her best to follow the other one around. The catch is that Jen can reach places Scree can't, and vice versa, but the two need to stick together somehow. This results in gameplay reminiscent of the artful action adventure game ICO, where the main character had to help a frail girl through treacherous environments, only here neither character is a liability: Jen quickly learns some fighting moves, while Scree's stone hide makes him all but impervious to harm. But the majority of Primal isn't spent fighting enemies; it's spent figuring out where to go next, getting there, and getting past whatever obstacles prevent further passage. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Primal Video Review These obstacles take many forms, though many of them take the form of locked doors or other doorlike devices that need to be activated somehow. You'll use teamwork to get past these. Scree can scale some vertical stone surfaces, so often he'll be able to climb right over a wall that's in the way and then open a door from the other side so Jen can get through too. Or, Jen might find a narrow crack in a nearby wall, one that she can slip through but that's too small for Scree, and then find a way for her companion to meet up with her. The two have other powers. Jen gains the ability to transform into several different demonic forms during the course of the game, such as one that has sharp claws and powerful legs and another that can swim. Scree can possess inanimate stone statues and absorb the life force of defeated enemies, which Jen can then use to replenish her own health. All in all, Jen and Scree make a pretty unusual pair of protagonists, and likewise, the puzzles in the game are integrated well enough into the environments that they usually seem natural rather than contrived. You'll explore a dangerous world, but there's more exploration than danger. The world of the game is certainly one of the main attractions. Loading times rarely kick in as Jen and Scree explore vast stretches of otherworldly scenery, mostly by traveling on foot. You can save your progress just about anywhere and at any time, and teleport checkpoints are strewn throughout the land, allowing Jen and Scree to quickly return to areas they've already visited. Despite the massive size of the game's world, Primal does a pretty good job of helping you not get lost. Pressing the Start button brings up a fairly detailed map that usually points you to where you need to go next, although there's a brief yet mildly annoying pause before the map pops up. Also, while playing as Jen, you can always hit the triangle button to ask Scree for advice on what to do next. Scree's one-line answers will help keep you on the right track or put you back on it if you've strayed from your course. Primal is a fairly linear game, but backtracking is always an option, though rarely a necessity. You'll probably find yourself stumbling through areas you've already visited as you try to figure out how to proceed, but if you pay attention to Scree and to your map, you should be fine. When you get right down to it, most of the game's puzzles are actually rather easy. The combat is also rather easy, and it's one of the weaker points of Primal. Jen has slightly different abilities in each of her demon forms, but still, combat is mostly just a matter of mashing on the attack buttons. Once the average enemy has lost all its health, it stands there dizzy for a moment so that you can press two attack buttons simultaneously to finish it off. It's all rather clunky and doesn't look particularly good either. You'll automatically target one enemy at a time, so landing your blows isn't the problem. It's that the combat requires little skill or timing, so whenever you have to fight multiple enemies in a row, you'll feel like the action is there just to slow you down. Controls in Primal aren't all that great anyway. Your character will automatically interact with the environment when possible, such as by jumping across a narrow chasm or climbing up on a ledge. Other times, you'll literally run into a wall and nothing will happen, because you mistakenly thought that that's where you were supposed to go next. Despite the impressive level of detail in Primal's environments, they can somehow still seem sterile, because you can't do anything in them unless you're supposed to. As Jen, you can't even wind up and attack unless there's an enemy in range. Primal's combat isn't one of the game's highlights, and fortunately it isn't all that frequent. The game's camera perspective can also lead to some awkward moments as you try to get your bearings. You can center the camera with the R1 button, or rotate it manually using the right analog stick, but you'll still find yourself controlling the main characters from odd angles occasionally, which aggravates the issue with the sluggish controls. For better or worse, though, these situations are rarely dangerous. You can't fall off cliffs or anything like that, and enemies usually won't gang up on you even though you'll usually be fighting more than one at a time. So at times, Primal becomes transparent, like a scenic tour of a cool-looking video game world. Since the game isn't all that challenging, fast-paced, or interactive, it can get boring. Thankfully, Primal looks and sounds really, really good. Even when the gameplay doesn't have you on the edge of your seat, you'll still be curious to see what new area or witty exchange of banter between Jen and Scree lies ahead. Primal's graphics are remarkable both from an artistic and from a technical standpoint, and they feature some of the sharpest textures and special effects to date on the PS2. The game's big environments stream seamlessly together, and being able to run from one end of these imaginative areas to the other is pretty impressive--it's just too bad that the map couldn't have been persistent onscreen, since the only real interruption to the gameplay you'll experience is during your frequent visits to the submenu. The characters appear bump-mapped, so Jen's faux-leather halter top looks authentic, and Scree's skin looks as tough as rock. The characters' faces are also expressively animated, and many of the other characters they'll meet on their journey look equally as good. Ambient lighting and realistic weather effects round out what's by all means a superb visual presentation. The occasional but rather severe bit of slowdown during heated battles and the unspectacular prerendered cutscenes are all that tarnish Primal's visuals. Superb graphics and voice acting make Primal a showcase game for the PS2. The game's eclectic soundtrack has you listening to heavy metal riffs in combat one second and haunting choir and orchestral sounds the next as you continue exploring. Most of the music plays softly in the background, and actually, the combat theme is a bit abrasive compared with the game's otherwise moody and low-key audio. Primal has some pretty lengthy story sequences, so it's great that the dialogue is delivered so well by the game's two main leads. Jen and Scree are likable even from the start, and despite the dark subject matter of Primal, the two are often amusing. Some bonus features, such as a behind-the-scenes video with the game's two main voice actors, become unlocked as you play through Primal and go out of your way to uncover a few hidden items. The game itself is quite big and has some terrific scenery and memorable characters. Primal's actual gameplay isn't quite as polished or engaging as the game's presentation, but overall, Primal is still easily recommended to those who enjoy exploring their games and not just plowing through them. The combat is also rather easy, and it's one of the weaker points of Primal. Jen has slightly different abilities in each of her demon forms, but still, combat is mostly just a matter of mashing on the attack buttons. Once the average enemy has lost all its health, it stands there dizzy for a moment so that you can press two attack buttons simultaneously to finish it off. It's all rather clunky and doesn't look particularly good either. You'll automatically target one enemy at a time, so landing your blows isn't the problem. It's that the combat requires little skill or timing, so whenever you have to fight multiple enemies in a row, you'll feel like the action is there just to slow you down. Controls in Primal aren't all that great anyway. Your character will automatically interact with the environment when possible, such as by jumping across a narrow chasm or climbing up on a ledge. Other times, you'll literally run into a wall and nothing will happen, because you mistakenly thought that that's where you were supposed to go next. Despite the impressive level of detail in Primal's environments, they can somehow still seem sterile, because you can't do anything in them unless you're supposed to. As Jen, you can't even wind up and attack unless there's an enemy in range. Primal's combat isn't one of the game's highlights, and fortunately it isn't all that frequent. The game's camera perspective can also lead to some awkward moments as you try to get your bearings. You can center the camera with the R1 button, or rotate it manually using the right analog stick, but you'll still find yourself controlling the main characters from odd angles occasionally, which aggravates the issue with the sluggish controls. For better or worse, though, these situations are rarely dangerous. You can't fall off cliffs or anything like that, and enemies usually won't gang up on you even though you'll usually be fighting more than one at a time. So at times, Primal becomes transparent, like a scenic tour of a cool-looking video game world. Since the game isn't all that challenging, fast-paced, or interactive, it can get boring. Thankfully, Primal looks and sounds really, really good. Even when the gameplay doesn't have you on the edge of your seat, you'll still be curious to see what new area or witty exchange of banter between Jen and Scree lies ahead. Primal's graphics are remarkable both from an artistic and from a technical standpoint, and they feature some of the sharpest textures and special effects to date on the PS2. The game's big environments stream seamlessly together, and being able to run from one end of these imaginative areas to the other is pretty impressive--it's just too bad that the map couldn't have been persistent onscreen, since the only real interruption to the gameplay you'll experience is during your frequent visits to the submenu. The characters appear bump-mapped, so Jen's faux-leather halter top looks authentic, and Scree's skin looks as tough as rock. The characters' faces are also expressively animated, and many of the other characters they'll meet on their journey look equally as good. Ambient lighting and realistic weather effects round out what's by all means a superb visual presentation. The occasional but rather severe bit of slowdown during heated battles and the unspectacular prerendered cutscenes are all that tarnish Primal's visuals. Superb graphics and voice acting make Primal a showcase game for the PS2. The game's eclectic soundtrack has you listening to heavy metal riffs in combat one second and haunting choir and orchestral sounds the next as you continue exploring. Most of the music plays softly in the background, and actually, the combat theme is a bit abrasive compared with the game's otherwise moody and low-key audio. Primal has some pretty lengthy story sequences, so it's great that the dialogue is delivered so well by the game's two main leads. Jen and Scree are likable even from the start, and despite the dark subject matter of Primal, the two are often amusing. Some bonus features, such as a behind-the-scenes video with the game's two main voice actors, become unlocked as you play through Primal and go out of your way to uncover a few hidden items. The game itself is quite big and has some terrific scenery and memorable characters. Primal's actual gameplay isn't quite as polished or engaging as the game's presentation, but overall, Primal is still easily recommended to those who enjoy exploring their games and not just plowing through them."}