{"ref": "https://www.gamespot.com/reviews/fear-extraction-point-review/1900-6160558/", "date": "October 26, 2006", "game_name": "F.E.A.R.", "text": "Halloween is a fitting enough time to release F.E.A.R. Extraction Point, the expansion to last year's creepy first-person shooter. Like its predecessor, Extraction Point puts you in the boots of the ~point man~ of the military's First Encounter Assault Recon team. Think of it as the Pentagon's equivalent to The X-Files, only with really big guns. In F.E.A.R. you battled an army of cloned supersoldiers, their crazed leader, Paxton Fettel, and Alma, a little girl straight out of Japanese horror movies such as The Ring. It all made for an intense psychological experience, even while you were caught up in some of the best virtual firefights ever seen on the PC. Extraction Point once again dumps you in the middle of a deserted American city, where you have to battle an army of clones while dealing with the paranormal. Extraction Point offers up a lot more of the same, though there's not anything particularly wrong with that if the action is as good as it is here. The plot could be described as a five-hour epilogue to the campaign in F.E.A.R. You begin amid the wreckage of the Black Hawk helicopter that was ferrying you to safety. From that point, you must fight to get to the extraction point, where yet another helicopter will ferry you to safety. There's no grandiose story to save the world or anything like that, which is a refreshing change for a shooter. Getting to the chopper is going to require a lot more of the run-and-gun that you experienced in F.E.A.R., as you once again have to battle the army of replicants that dogged you throughout the original game. Apparently Fettel now has Alma-like powers, which means that his corporeal spirit still remains, even though he clearly died during F.E.A.R. This also means that, for the most part, there's not a lot of new stuff here. You're once again battling the same kinds of foes with mostly the same types of weapons in lots of dark and deserted levels. Extraction Point introduces a subway level and some new office interiors, but for the most part one empty corridor looks just like another. There are also a few new weapons you can play with, like the bullet-spitting chaingun and deployable gun sentries that you can stick on walls and floors, but for the most part you'll rely on the trusty assault rifle, submachine gun, and shotgun that got you this far in the first place. Thankfully, the killer gunplay and advanced artificial intelligence featured in F.E.A.R. remain completely intact in Extraction Point. Firefights are a lot more memorable in this game than they are in most first-person shooters because they're incredibly visceral. Bullets fly, objects are knocked over, showers of sparks erupt everywhere, choking clouds of gun smoke fill the air, and bodies slump everywhere. The replicants that you battle are incredibly smart and tough for computer-controlled bad guys, as they're constantly maneuvering to try to get a better advantage on you. In fact, some of the battles would be darn near impossible if not for your character's enhanced reflexes that let you kick in bullet time for short bursts at a time. Aside from the familiar replicants, you'll also encounter a few other types of foes, including the armored walking tank and the invisible assassins that you met in the original game, as well as a strange, seminvisible spirit reminiscent of the figure in Edvard Munsch's painting, The Scream. Amazing firefights are just part of the F.E.A.R. formula, however, and Extraction Point has plenty of the effective horror that was seen in the original game. Extraction Point works because it doesn't try to terrify you with grotesque demons and monsters. Those have been done to death in games, anyway. Instead, Extraction Point is an exceptionally creepy experience. The game continually messes with your senses, and you'll see and hear things that will raise your hackles. Sound is incredibly effective, as each little noise can send you spinning, ready to start blasting. Shadowy figures dart in and out of the edge of your vision, and objects rattle ever so subtly to draw your attention. Developer TimeGate deserves plenty of credit for maintaining the intensity of the original game, even though veterans of F.E.A.R. are already used to some of the atmospheric tricks of that game. You get a few new toys to play with in the expansion, though you'll mostly rely on your trusty assault rifle and your ability to slow down time. The overall campaign lasts only about four to six hours. That's about par for most shooter expansions, and anything longer probably would have felt too long. Even with its intense action and atmosphere, Extraction Point definitely feels as though it's beginning to drag on. Part of that could be the sense that there are only so many replicant battles that you can fight before they all start to feel the same, but the bigger issue is that the plot doesn't really go anywhere. What few questions the game raises are barely answered; the act of constantly battling to get to a rendezvous point is so overused that one of your teammates even cracks a joke about it; and the ending turns out to be disappointingly bittersweet. Unfortunately, when you're done with the single-player campaign, that's pretty much all there is to Extraction Point. That's because the multiplayer component of F.E.A.R. has already been split off from the single-player game, and it's been made available on the Internet for free under the name F.E.A.R. Combat. You don't even need to own F.E.A.R. or Extraction Point to play it. That means there's not a lot of replay value in this expansion. You won't miss much if you don't play Extraction Point, but if you do like your action and horror blended together and you liked the original game, you should give this one a try."}