{"ref": "https://www.gamespot.com/reviews/trackmania-turbo/1900-6416391/", "date": "March 28, 2016", "game_name": "Trackmania Turbo", "text": "The Trackmania games have been thrilling PC racers for a while now, but sadly absent from console systems. Thats been a shame since its hefty focus on pure arcade-style racing is a perfect fit for big screen TVs and control pads. Thankfully, the latest in the line, Trackmania Turbo, has hit the PlayStation 4 and Xbox One, and the result is as fun as fans of the series could have hoped. The games unique focus on time trial racing gives it a distinctly refreshing feel from the Forzas and Need for Speeds of the world.Trackmania Turbo, like all the games in the series, isn't about competitive racing. Instead, everything is based on beating track times. In the beefy single-player game, for instance, the goal across the 200+ tracks is to score a medal by besting specific speedrun times. Capturing the gold can be an uphill fight, requiring countless retries, while getting a bronze is usually something even more casual players can manage.If youve never played a Trackmania game before, this focus on time trials might seem odd. Stick with the game, however, and such misgivings slip away amidst the horde of insane, frequently gravity-defying tracks and fast-paced arcade racing. A good racing game masters the balance between sheer intensity and fun, plastering a smile on your face while still requiring intense concentration. Trackmania Turbo hits this mark with aplomb.The tracks tend to be short bursts of obstacles, hair pin turns, and loop-to-loop-filled joy. Lasting barely a minute or two, theyre as creatively designed as they are challenging. Mostly, however, these courses are fun, even if they often dont make a shred of real-world sense. This emphasis on short tracks and time-based challenge, as opposed to directly racing other cars, give Trackmania a real pick up and play, casual air.Standard arcade controls apply. Powerslides are vital, so learning to tap the brakes and hit the gas is standard protocol. The general handling is far from realistic, but the game doesnt go quite so far as to let you steer your car in the air. Unrealistic though it might be, the cars are responsive and precise, requiring finesse.Trackmania Turbo spreads its tracks across four different environments and five different difficulty-level themed tournaments. The more traditional stadium setting offers up vaguely Formula 1 landscapes done up in the insane style of the game. More exotic locations like the Lagoon Rollercoaster sport prototypical racers across beautiful mixes of track, dirt, and water. The Canyon and Valley tracks focus more on off-road buggy action, especially as the tracks ramp up in difficulty.Tracks usually offer multiple checkpoints, allowing you to easily jump back to them should something bad happen. With the press of a button, you can opt to either return to the last checkpoint or simply and instantly restart the race entirely. This is a vital feature when going for the gold medal, where even the slightest misstep means precious seconds off the clock.All the locales look great, although Trackmania Turbo still doesnt reach the visual heights of graphic heavyweights like Project Cars and Forza 6. The cars in particular have nowhere near the level of definition and detail of other more serious racing simulations. The game hits the middle ground of visual fidelity between the animated driving fantasy of Mario Kart--which the tracks are frequently reminiscent of--and Need for Speed. The solid framerate and superb sense of speed--especially in the first person mode--more than make up for any overall lack of details though. Trackmania is also just crying out for a VR patch, which Ubisoft has said will be coming around in time for the PlayStation VR and Oculus Rift launches.Trackmania Turbo still doesnt reach the visual heights of graphic heavyweights like Project Cars and Forza 6.Aside from the annoying commentary, which repeats itself far too often, Trackmania Turbo offers some beefy bass and revving car sounds. The soundtrack is a bit like a light version of EAs license-heavy tracks, offering a smattering of techno stylings, but the entire audio landscape really sounds most like the classic arcade racing machines.The meat of the single-player game is the overall tournament mode, which provides hours and hours of speedy fun. For players who prefer to play at home with friends, however, Trackmania Turbo sports a surprising variety of local multiplayer modes. Up to four can compete for the best time in the split-screen mode, for instance, or you can all take turns in the hot seat mode. Most hilarious (and weird) is the double driver mode. Catering to the logic that if one driver is good, two must be better, this relationship testing mode tasks two players with driving the same car.To perform this amazing feat, players must mirror each others steering to get through the track. Theres actually a whole tournament devoted to this play mode, although its hard to imagine too many players getting that much mileage out of it. Still, it offers a hilarious alternative to standard multiplayer.Online play is a hefty portion of the overall Trackmania experience, but like the rest of the game, its far from a typical experience. The average Trackmania bout covers multiple tracks with lots of other drivers on the course at the same time. Other players are essentially just ghost cars, however, so you cant run into them. Each race is active for a certain period of time and within that time, the goal is to get the best possible track time. As soon as you reach the finish line, you simply pop right back to the beginning of the track to do it again until the timer runs down.This is simply one of the most entertaining arcade racers on the market.The game constantly lets you know where you stand and frequently restarting the race entirely after a mishap is a common, and necessary, tactic to stay on top. The ghostly nature of multiplayer manages to alleviate any frustration from vehicle collisions while still maintaining a constant sense of competition. This system also allows for an absurd number of players to be involved in a single online tournament--even on launch day, there were easily 70+ cars in each race.Trackmania Turbo rounds out its feature set with its track builder. This easy-to-use tool lets you make tracks to your hearts content thanks to a fairly straightforward, simple interface. Make a track, then validate it by taking it for a spin to make sure it works. When youre happy with the results, you can send it out into the world. Additionally, the game itself can build new tracks on the fly, so even if you burn through those initial 200, theres still endless road to cover.Trackmania Turbo really isnt much different than the rest of the series. It looks better and offers console players a chance to get in on the action, something not seen since the Wii version, but is largely the same game its always been. For racers who live for direct competition, the time trial focus of TM might be too off-putting. Otherwise, this is simply one of the most entertaining arcade racers on the market for both experienced and more casual gamers.Trackmania Turbo is featured on our list of the best PS4 racing games."}