{"ref": "https://www.gamespot.com/reviews/red-alert-3-uprising-review/1900-6206585/", "date": "March 23, 2009", "game_name": "Command & Conquer: Red Alert 3 - Uprising", "text": "How does a developer take such a gleefully joyous experience as Red Alert 3 and morph it into lifeless mediocrity? It's a question that you'll wrestle with as you struggle through the real-time strategy game's first expansion pack, Uprising. Some valiant attempts to retain the original's cheery, cheesy charm are all but lost in a murky sea of generic, poorly constructed missions that are either insipid or infuriating. There's certainly a lot of content in this single-player offering, what with four bite-sized campaigns, a smattering of new skirmish maps, and the dozens and dozens of scenarios that compose a new mode called the Commander's Challenge. Yet it's hard to call Uprising a good value, even at its low price point, when so little of it is actually fun to play. If there's one individual you can't fault for Uprising' lifeless meanderings, it's the blustery Ric Flair. He and a few other new personalities join some returning ones, but the histrionic, live-action magic of Red Alert 3 is muted here, a testament to the hammy energy of George Takei, Tim Curry, and J. K. Simmons that erupted from the original. The less-enthusiastic Gemma Atkinson, and newcomer Holly Valance as a smarmy anchorwoman, simply can't compete, and a bizarre performance from Julia Ling isn't so much melodramatically cheesy as it is a bit insincere and embarrassing. Even the fantastically inelegant Ric Flair, appearing in the new Commander's Challenge mode, can't muster these troops into action. The real storytelling highlight is found within the unusual Yuriko campaign, which breathes humanity into the Empire's quietly creepy commando. The gameplay has lost its spark as well. Red Alert 3's greatest claim to fame, cooperative gameplay, has been jettisoned completely to make room for too many ho-hum, derivative puzzle-type objectives, the kind that have long plagued mediocre strategy games. All too often, you are handed a small group of units and pressed into a very specific tactic, a contrivance that was less mundane with a co-op commander at your side, but now feels quaint at best, and at worst, frustrating. Given that Uprising requires very specific tactics in these instances, you may need to save and reload a few times until you get a handle on these highly scripted events. For instance, as the Soviets, your first encounter with the Allied cryo legionnaires (one of Uprising's new units) will likely be disastrous because you won't be ready for their icy attack until it's too late. In another sloppy, heavily scripted sequence during the Allied campaign, rocket angels may pummel your MCV before you're even aware that you've been provided your own rocket troops to counter them. Should you lose, the continuing voice-over indicates that the mission is continuing, even as a competing one signals your defeat. And twice during the game, you are instructed not to engage units that you actually must engage if you have any hope of succeeding. Red Alert 3 lovers who wanted a greater challenge may enjoy the occasional punishment, but anyone looking for more of the original's brand of joyful action will be alienated by the slapdash nature of the missions. Almost as if to counter the derivative mission grind, Uprising features an entire campaign that breaks free of RTS conventions. Here, you take control of Yuriko, the Empire's commando unit, and take her dungeon crawling, using her four psionic powers to wreak havoc. The campaign is a stripped-down action role-playing game. With Yuriko's main attack, you can demolish entire buildings, whereas four additional abilities let her shield herself, unleash a formidable psychic blast, brainwash enemy infantry into fighting on her behalf, and pick up objects and enemies and fling them at each other. It's over quickly and not all that satisfying. Granted, it's cool to rip up entire swaths of enemies and fill the screen with colorful particle effects. Yet the gameplay feels too watered-down. There is no onscreen minimap (you need to hit the escape key to view the map), two of the three levels take place in the same unimaginative environment, and you can't zoom in to get a better look at the action. It can be a bit tactical, particularly during the final boss battle, but it isn't strategic enough to work in the context of an RTS, and it's certainly not as engaging as a good action RPG. The campaign was a good idea, but it doesn't feel as tight as it should, particularly in light of Dawn of War II's far superior foray into that hybrid realm. Standard strategic gameplay within the campaigns succeeds better, though not having a co-op commander to join you keeps large battles from feeling as grand and sweeping as they did in Red Alert 3. However, there are some nice highlights. Defending a central base with the help of century bombers and cryocopters is enjoyable, and some of the new units fit in nicely, such as the Soviet's awesomely named mortar cycle. Perhaps the most impressive new unit is the Empire's giga fortress, which is great fun to watch in action. When gliding through the air, its powerful beam slices through units below, and in its five-armed floating form, its barrage of rockets makes short work of flying foes. You get to put these powerhouses to good use in the Empire campaign, in which objectives are stacked against you and the giga fortress's potent missiles are a great boon. In skirmish games, they don't feel properly balanced, which is also the case for several other imposing additions. Of course, balance would have been more important in a multiplayer skirmish, but even with a good number of new single-player maps to play on, these overpowered units make battling the AI less enjoyable because it isn't as satisfying when you win, and it's frustrating when you lose. Here is a case where water and electricity do mix. Nevertheless, many of those new maps are designed well, and you get to play on them not just in individual skirmishes, but also in the new Commander's Challenge mode. Here, you start with a small group of units and unlock more by battling your way from one mission to the next. Some of these missions are fun, and properly countering the scripted legions of enemies is enjoyable. However, the demanding later levels require a good bit of trial and error, and completing them requires very specific tactics, particularly if you wish to clear them under par time. Fortunately, the computer's predictable behavior makes it easy to steamroll through many of the earlier missions. Even with its shortcomings, this mode is the most satisfying way to play Red Alert 3 Uprising, giving you tangible rewards in the way of new missions and units as you progress. Red Alert 3 Uprising may have abandoned most of what made its predecessor great, but it does retain all of the glitchy pathfinding and occasional animation jitters. Thankfully, Electronic Arts didn't abandon its commitment to great music, delivering some terrific new tracks to complement the visual mayhem. It's just too bad that in almost every other way, Uprising struggles to merely preserve the delights of the franchise, let alone improve them. In Red Alert 3 Uprising, compelling chaos has been bafflingly bulldozed to make room for tedium."}