{"ref": "https://www.gamespot.com/reviews/valkyrie-elysium-review-putting-the-mid-in-midgard/1900-6417977/", "date": "October 12, 2022", "game_name": "Valkyrie Elysium", "text": "Names hold a lot of power, particularly in the world of entertainment media. When the name of a beloved franchise is attached to something, it brings a lot of things with it: nostalgia, excitement, and perhaps most importantly, expectations. Valkyrie Elysium is no different: It bears the name and lineage of an RPG series known for daring, experimental gameplay and storytelling that's fervently beloved by a loyal group of fans. Unfortunately, this middling action-RPG that the Valkyrie titling is attached to bears little resemblance to the bold, beloved games that preceded it.The story of Valkyrie Elysium, set up during a brief cinematic at the beginning, takes place smack-dab in the middle of Ragnarok, the end of the world foretold in Norse mythology. Odin, the All-Father and highest of the gods, has been mortally wounded in a battle with Fenrir and requires the strength of souls to restore his power so that he can revive the dying world. To accomplish this, he summons forth a Valkyrie, the legendary vessel of the gods who leads chosen souls to glory in Valhalla. Valkyrie is tasked with purifying wicked souls, finding the worthy to bring to Odin, and recovering sacred treasures. But, as you might expect, all is not entirely what it seems, and Valkyrie faces a conflict between her duty as a servant of Odin and her increasingly conflicted emotions.If you've played the original Valkyrie Profile, you'll recognize many very similar story beats here--but without the emotional weight or interesting character drama. The transformation of Valkyrie from devoted, single-minded soldier to conflicted heroine doesn't feel genuine: We're simply told that she's becoming more empathetic to humans with little evidence to back it up. The Einherjar--fallen warriors who Valkyrie recruits to aid her in battle--have some interesting backstories, albeit told in a haphazard, disjointed means that's supposed to inspire curiosity and mystique but only leaves you confused until you read their profiles and play some side quests.With the story being a non-starter, it's up to the gameplay to carry Valkyrie Elysium. Sadly, while the combat does have some interesting ideas, it's bogged down with dull exploration and some puzzling design choices.Valkyrie Elysium is divided into chapters, with each chapter presented as one long stage with various enemies and gimmicks Valkyrie must overcome. And when I say long, I mean it: You're looking at 1-2 hours on average for each chapter. (There are generous checkpoints, at least.) This might be okay if there were anything interesting to see in these areas, but there really isn't. The levels are obnoxiously large and primarily consist of lots of ruined buildings, random foliage, rocky cliffs, water, and more destructible boxes lying around than the local post office. There are barely any NPCs to give any sort of life to the world, either. Instead you'll hear random snippets of character dialogue from flowers called Hollow Blossoms and Verdant Blossoms, which serve as collectibles (and, in the case of the latter, are vital to unlocking the true ending). These would be a great way to build upon the world mythology if the world actually felt interesting, but as a substitute for having actual characters, they fall totally flat.The combat engine is a bright point among all the dull disappointment. The combo-heavy action sees Valkyrie using a mix of weapon strikes, Divine Arts magic spells, and fast movement skills to deliver a divine purification beatdown to the undead. Accompanying her are the aforementioned Einherjar, who she can summon to act as NPC assistants and grant her elemental affinities. An element- and weapon-based weakness system rewards you for exploiting vulnerabilities with extra damage and stun states that leave enemies completely incapacitated for a brief period--useful for both crowd control and dealing damage to foes with big healthbars. As the game progresses, you can spend earned souls and gems on skill and weapon upgrades that unlock new attacks, counters, and maneuvers, giving you a continuous supply of interesting new attacks to experiment with.But alas, even the great combat engine feels meaningless when you figure out that the strategy of ~see enemy, determine elemental weakness, summon appropriate Einherjar, follow up with Divine Arts to break and stun, execute combo on defenseless foe, repeat on next enemy~ works for the vast majority of encounters. Even the bosses fall to this basic battleplan fairly easily--though with an added step of ~stall until their post-recovery stun immunity fades~ inserted. The handful of battles where you can't use this strategy effectively--like the ones where Einherjar use is restricted--feel a lot more exciting and challenging as a result.There are lots of other puzzling decisions. Why no minimap? Why have a tether skill for field movement and puzzles that require summoning Einherjar when they're so rare and arbitrarily placed? Why do I have to replay a whole ungodly long chapter if I missed a Verdant blossom I want to collect? But ultimately, they're minor annoyances compared to the main problem: Valkyrie Elysium is a mostly technically competent game weighed down by the dullness of its story, setting, and strategy. There are glimmers of fun in the combat and some of the dialogue--the rare mid-level Einherjar banter is always welcome--but it's not enough to overcome stifling mediocrity. Valkyrie Elysium is a mere pretender to the glory of this series' past endeavors."}