{"ref": "https://www.gamespot.com/reviews/metal-slug-3-review/1900-6099494/", "date": "May 30, 2004", "game_name": "Metal Slug 3", "text": "In 2004, it's kind of odd to see a 2D video game that's not being presented on some sort of portable device. While most have traded in their hand-animated sprites and parallax-scrolling environments for rag-doll physics and pixel shaders, SNK has remained a diligent practitioner of 2D gaming and has continued to cultivate a passionate following for it. Metal Slug 3, which has just been ported to the Xbox, may be a 4-year-old arcade game, but if you've never experienced the unique Metal Slug brand of frantic side-scrolling action, it's probably one of the freshest, most exciting games to hit the Xbox in a while. From a technical standpoint, this is a superb version of Metal Slug 3, and in some respects, it's even better than the original. However, when taking it out of its native arcade environment and bringing it to a home console, SNK has made some specific choices that make this already challenging game difficult to a fault. Do not approach Metal Slug 3 unless you are prepared for a serious challenge. Amazingly, the manual for Metal Slug 3 reveals an absurdly serious backstory concerning a series of wars, alien experiments, and weirdly specific details regarding internal backbiting within military subdivisions. None of this really comes across in the game, though, which comes across as rather humorous as you send your soldiers up a vicious and nearly endless stream of enemies. As you run, swim, and fly from the left to the right, you'll fight some seriously ridiculous enemies. Aside from the fatigue-sporting soldiers in Morden's army, who have a penchant for grenades, bazookas, and what appear to be handmade bottle rockets, you'll battle abominable snowmen, the undead (in both zombie and mummy forms), oversized crustaceans, insects, and plants, as well as a decent cross-section of aliens. And that's not taking into consideration the massive, screen-filling bosses you'll face at the end of each of the game's five levels. You'll start off with a simple handgun that you can fire in any direction and a handful of grenades, but you'll regularly find high-powered limited-ammo weapons to help you make short work of the opposition. These weapons range from the simple and practical heavy machine gun to the goofy Iron Lizard, which essentially acts as a ground-hugging missile. For those not in the know, the title Metal Slug refers to the tank and tanklike vehicles that you come upon periodically in the game, and Metal Slug 3 includes no shortage of powerful, silly-looking vehicles for you to pilot, including tanks, power suits, jets, submarines, and helicopters, as well as a camel, an elephant, and an ostrich with Vulcan cannons strapped to them. The slugs really bring a lot of variety to the gameplay, since each essentially has a unique set of controls. The Metal Slug studied at the school of Contra, but it goes in its own direction with its wacky nature and rather high level of difficulty. Metal Slug 3 isn't for scrubs, and with a single shot putting an end to your hero, the game requires you to bring your A-Game for the entire ride. However, once you get attuned to the game's nonstop pacing, the skill-based gameplay is incredibly enjoyable. Generally speaking, arcade games don't run as long as your usual console game--they are, after all, intended to be played while standing in front of an arcade machine rather than while resting cozily on your couch. This poses a challenge to publishers that want to bring their arcade games home. They have to either add in a bunch of new content to make up the difference or figure out some way to stretch things out. Metal Slug 3 does a little bit of the former by including a few bonus modes that you can unlock by finishing the main arcade mode. ~Storming the UFO Mothership~ puts you on the other side of the fight as one of Morden's troops, and ~Fat Island~ challenges you to bulk up by defeating enemies and munching on the snacks they drop. The game also features Xbox Live support, though disappointingly, there's no actual play--there's just an online leaderboard--though if you have a buddy and a second Xbox controller, you can still enjoy some good two-player action locally. Playing Metal Slug 3 in the arcade with a pocket full of quarters, you could beat the game in about an hour. But the Xbox version introduces a twist to the game's existing continue system that makes finishing the game a nearly impossible task. The structure is basically the same as the arcade version, giving you between three and five lives--a setting you can adjust in the options menu--and whenever you run through your allotted number of lives, you have to use a continue, of which you are given four. However, unlike in the arcade version, every time you use a continue, it starts you back at the beginning of the level rather than where you last died. It's understandable that SNK would want to extend the playtime of Metal Slug 3, but there are significantly more elegant means. Both Ikaruga and the Time Crisis games are perfect examples of a good way to add extra legs to relatively short games. They start you off with a meager number of extra lives and gradually reward you with more as you continue to spend time playing the game. The continue system in Metal Slug 3, however, simply leads to unnecessary frustration, and ultimately, it will probably lead to players giving up on the game sooner rather than later. There's a certain artistry and craftsmanship necessary to create a visually compelling 2D game. This is something that has really faded away since 3D took prominence, but it's plain as day that the artists behind Metal Slug 3 haven't lost their touch. Since the main hero characters and a lot of the enemies have appeared in past Metal Slug games, there's a lot of recycling going on in Metal Slug 3, but all of the new environments and enemies look really nice. The ironic part about the game's graphics is that the game moves so fast it's easy to completely miss the level of detail that goes into a lot of the animation. One of the minor perks that Metal Slug 3 enjoys from being on the Xbox is an improved frame rate. When it originally appeared on SNK's NeoGeo arcade hardware, Metal Slug 3 suffered from some ridiculous slowdown, and it was rare to see the game running at full speed during the intense boss fight sequences. But now, the game barely skips a beat during these sequences, which is a really nice touch. This is, without a doubt, the best-looking Metal Slug game to hit anything other than the NeoGeo. Metal Slug fans can look forward to hearing the announcer mispronounce ~rocket launcher!~ once again. Metal Slug 3's sound does a solid job of backing up the visuals. Most of the weapon fire, announcer voice-overs, enemy cries, and various explosive sound effects employed by the game have appeared in previous Metal Slugs, but they still sound good and will probably be kind of comforting to long-standing series fans. The background music brings back a lot of old Metal Slug themes and introduces some new high-energy pieces as well. All of it sounds really crisp, and as you play through the game a few times, you'll undoubtedly have certain themes sticking with you after you put down the controller. The fundamentals of Metal Slug 3 are all really excellent. You'll be hard-pressed to find another 2D side-scroller with such detailed environments and smooth animation, and the gameplay is the dictionary definition of frenetic. So, with all this going for it, it's a real shame that the brutal continue system introduced in the game's conversion to the Xbox makes the game overly uncompromising. If you are prone to throwing controllers out of frustration, you may want to approach Metal Slug 3 with caution--for the sake of your controllers and your loved ones. It's also a fairly short game that won't have a lot of lasting value for most players. However, if you can get past that and endure the continue system, you'll find an awesome side-scrolling experience unlike anything else on the Xbox."}