{"ref": "https://www.gamespot.com/reviews/mr-driller-2-review/1900-6123345/", "date": "April 29, 2005", "game_name": "Mr. Driller 2", "text": "Even though Mr. Driller 2 is new to us, Namco actually released it in Japan more than four years ago. That explains why the graphics, the audio, and the overall selection of play modes seem weak by today's standards. Nonetheless, it's still an addictive puzzle game that's both easy to learn and challenging, which means that puzzle fanatics should be able to look beyond its faults and appreciate the beauty that lies underneath. Drill to the bottom, but don't get crushed or run out of air. The concept is simple. Susumu, who's better known as Mr. Driller, is a dude in a space suit armed with a drill. The levels are long shafts filled with multicolored blocks that are stuck together to form various shapes. Using the directional pad and the button of your choice, you can aim the drill at a shape and destroy it. The overriding goal is to dig your way to the bottom of the shaft before Susumu runs out of air. Extra air capsules are scattered at random intervals throughout the shaft, and it's a good idea to mosey over to them once in a while to refill Susumu's oxygen tank. You also have to be strategic in your digging, because any blocks that were once supported by the pieces you remove will fall down. Falling blocks will stick to other blocks of the same color, and will subsequently destroy them if you manage to form a structure that's at least four blocks in size. However, structures that don't get destroyed in a chain reaction will fall until they land on the mass below, and then they could possibly crush Susumu if you don't move him out of the way. Luckily, you can drill in any of the four major directions and move Susumu out of the way using the directional pad. What makes Mr. Driller 2 fun is that it's easy to play, and yet it's also challenging in a hectic sort of way. You constantly have to move and drill sideways to get out of the way of falling blocks, but doing so causes more blocks to fall, which in turn keeps you moving downward and sideways at a frantic pace just to avoid being crushed. At times, the blocks that don't cause chain reactions will get stuck somewhere above you, giving you a brief moment of rest before you start down the shaft again. Meanwhile, the constant depletion of air from Susumu's oxygen tank ensures that you won't lollygag for long. Ultimately, how long you stay interested in Mr. Driller 2 will depend primarily on how much you enjoy playing it, because the overall selection of play modes doesn't enhance or extend the experience that much. There's a mission mode that has four stages of increasing lengths, an endless mode with three difficulty settings, and there's a time attack mode that offers 20 puzzles of increasing complexity. The harder stages are tough to beat, but most people should be able to work through all three modes within a day or two. On the upside, the cartridge does keep a permanent record of high scores and best times, which should make puzzle fans happy. There's also a time-attack-style link mode that supports two players, which is nice if you know someone else with a copy of the game. Mr. Driller 2 is also very much behind the curve when it comes to graphics and audio. The animation is fairly basic, although some of it is very funny, particularly when Susumu turns blue when he's about to run out of air. The different blocks are made up of solid pastel colors and they shatter in a very simple way when you destroy them. The background graphics and block skins change every 500 feet or so, which means you'll get a change of scenery at least three times during a level. As for the audio, there isn't much more to it than some chintzy music, a couple of forgettable shatter effects, and a voice clip of Susumu yelling ~lucky!~ whenever he grabs an air capsule. The intro and ending sequences contain full spoken dialogue, which is impressive, albeit mostly irrelevant in the grand scheme of things. It's fun to play, but don't expect much in the way of graphics, audio, or extras. Puzzle games do need to be cut some slack when it comes to graphics and audio, and, to some extent, the overall selection of play modes as well. In the case of Mr. Driller 2, however, we know that Namco could have done better. Mr. Driller 2 was originally released in Japan in 2001. A year later, the company published a sequel, Mr. Driller Ace, which offered two extra play modes and four-player multiplayer support, and it was much improved graphically. There's no telling if Namco will ever publish Mr. Driller Ace here, but if you have the option of importing it, you probably should do so instead of picking up the somewhat inferior Mr. Driller 2. If importing isn't an option, at least Mr. Driller 2 carries a comfortable budget price tag. Mr. Driller 2 is worth owning simply because the core game is fun and challenging. However, if aspects like graphics, audio, and variety of play modes matter to you, you may want to pass on it."}