{"ref": "https://www.gamespot.com/reviews/scooby-doo-night-of-100-frights/1900-6074644/", "date": "September 5, 2003", "game_name": "Scooby-Doo! Night of 100 Frights", "text": "Scooby-Doo! Night of 100 Frights is an easygoing adventure game that manages to perfectly duplicate the look and feel of the cartoon series on which it is based. Although this isn't one of the finest-looking games for the Xbox console, those who are even remotely familiar with the characters and stories in a typical Scooby-Doo episode may still get a kick out of it. A lot of what's in the TV show is in the game. There's the gang chatter, Velma losing her glasses, and Shaggy overusing the word 'zoiks.' The story revolves around the gang's trip to a seaside mansion that is owned by one of Daphne's college buddies. As Shaggy points out early in the game, the mansion is haunted. Soon after the game opens, Shaggy, Fred, Daphne, and Velma disappear, for a variety of reasons, leaving you in control of Scooby-Doo--the tireless talking pooch known for such timeless phrases as ~ruh-roe~ and ~Scooby dooby doo!~ As you explore the more than 80 different levels, in and around the mansion, you'll find yourself in situations reminiscent of events that you've probably seen in episodes of the cartoon. Twenty of the show's most memorable villains make appearances in the game, as do a number of familiar guest cast members, like Tim Conway and Don Knotts. Scooby's basic actions are fairly standard. You can run, jump, and bash monsters. You can also talk to friendly characters that you'll meet in the story. The inventions, scattered throughout the mansion, give the game most of its depth. They allow you to dig for treasure, walk through tar, fly across long distances, and perform actions that Scooby couldn't normally accomplish. In the course of solving the case, you need to track down eight of these inventions and gather hundreds of Scooby Snack items in order to access all areas of the mansion. Even though some of the gameplay feels generic, the Scooby-Doo license never seems pasted on. The majority of areas in the mansion include the typical sorts of situations you've come to expect from 3D platformers--namely, switch puzzles, platform jumping, slippery surfaces, rope swings, and the occasional battle against a boss character. However, these situations are representative of the kinds of things Scooby would do in a typical episode of the show. The game also does a nice job of varying the presentation of these situations in order to keep them fresh. Sometimes you'll navigate an area that is fully 3D and allows for unlimited exploration, while at other times your movement is limited to the horizontal or vertical axis and involves leaping over pits or outrunning a rampaging flood. Visually, Scooby-Doo! Night of 100 Frights has a grainy and washed-out look that resembles the sloppy artwork of the cartoon show. The backgrounds and textures aren't exceptionally detailed, but the fact that they genuinely resemble settings from the show compensates for the lack of technical horsepower. The character animation is also pretty good, especially for the 20 or so familiar Scooby-Doo monsters you'll encounter. Every last detail is accurate, right down to the lip-syncing and clothing. The camera perspective can be pretty annoying at times, since the viewpoint tends to shift unpredictably and often fails to reveal dangers lurking just outside your field of vision. While Night of 100 Frights is new to the Xbox, it actually made its debut on Sony's PlayStation 2 almost 15 months ago--in May of 2002. THQ should have used the interim time to improve the game in some significant way, either by including additional levels or by upgrading the game's modest, albeit tolerable, visuals. Instead, the Xbox game is simply a carbon copy of the earlier PS2 and GameCube versions. This point is relevant for a number of reasons. Chief among them, the game looks like a run-of-the mill PS2 game from 2002. Graphics tend to improve from year to year as developers become more familiar with a console's capabilities. This not only puts Scooby-Doo! Night of 100 Frights far behind the curve, when compared to the majority of Xbox games, but it also puts Scooby-Doo! far behind a number of recent PS2 games as well. If you haven't played the game before, or are picking it up as a gift for someone else, the dated visuals probably won't pose a problem. Those of you who already own the game for the PS2 or GameCube should steer clear of the Xbox version, however, since there's nothing new or exciting to justify a second purchase. Not even 480p progressive scan support, which has become quite commonplace in Xbox games nowadays. Swinging from chandeliers is a common practice in the game--not that it's a bad thing. The audio is somewhat low-key, although appropriately so. The soundtrack is quiet and spooky, though there are a few humorous overlays; they include ghosts and bats that caterwaul in the distance and a laugh track that pipes up every time Scooby uses one of the professor's inventions. During boss battles, there are sing-alongs that feature the game's voice actors, much like you'd see in an actual Scooby-Doo cartoon from the 1970s. Generally speaking, there is a lot of voice-over work in the game. THQ was smart to recruit the same set of actors from the recent made-for-video Scooby-Doo releases. Their performances provide a level of authenticity that's absent from so many other cartoon-licensed video games. For a variety of reasons, Scooby-Doo! Night of 100 Frights will appeal most to young children and to diehard fans of the cartoon show. It's not a particularly lengthy game, but the 10 to 15 hours of first-run play time should suit the intended audience just fine. Above all, the game's story and characters are just as entertaining as an episode of the TV show."}