{"ref": "https://www.gamespot.com/reviews/true-swing-golf-review/1900-6142778/", "date": "January 23, 2006", "game_name": "True Swing Golf", "text": "Considering Nintendo's knack for imbuing virtually any activity it sees fit with a wealth of charm and personality, and developer T&E Soft's prior success with golf in its densely packed Swing Away Golf for the PlayStation 2, it's kind of surprising just how bland and bereft of features True Swing Golf for the Nintendo DS is. The game's employment of touch-screen controls for aiming and swinging had the potential to at least make for a novel experience, but clumsy implementation makes them a liability rather than a blessing. True Swing does the bare minimum to be called a modern golf game. Before you hit the links, though, you'll have to choose your in-game avatar. Since True Swing doesn't feature the likenesses of any real-life golf pros, nor does it have any real character creation system to speak of, you get to choose from eight different boilerplate character models, and either a ~cool~ or ~wild~ attitude for your character, which will dictate how your character reacts to the action out on the course. From here, you're dumped into the game's main menu, where you can choose from a rather meager set of gameplay modes. True Swing doesn't bother with novel rule sets, training minigames, or an extensive career mode, opting instead to keep your options pared down to just match and stroke games. You can play on a random course in the quickplay option, or you can go into the specific match and stroke menu options to specify the course. You can also specify the length of the game, tee placement, and whether you'll play on the original course or a mirrored version, and in the match play mode, you can set the prowess of the CPU. Both modes are competent, but other than for the love of the game, True Swing gives you no compelling reason to play through the straight match or stroke modes--no cash prizes, no stat increases, no new courses, nothing. If you want to improve the abilities of your avatar, you'll have to go into the championship mode, which puts you into a standard series of increasingly challenging courses against increasingly competent competitors. On a gameplay level, it's not much more compelling or inventive than the stroke or match games, but winning in the championship mode will open up additional courses and net you cash that you can take to the game's pro shop. Here, you can dress up your golfer with new tops and bottoms or buy performance-enhancing clubs, balls, gloves, or shoes. The quantity of gear available in the shop is quite limited, and all of it has a bad, low-fashion look to it. If going to the country club by your lonesome lacks appeal, True Swing features the same match and stroke games in a multiplayer format. Up to four players--off a single copy of the game or with individual copies--can play at a time, though the course options are much more limited in the single-cart game. Like the single-player components in True Swing, the multiplayer components work well enough--they're just completely predictable. True Swing's implementation of touch-screen controls doesn't help make the game any more fun, either. While the top screen gives you a polygonal first-person view of the course, the bottom screen gives you a flat 2D perspective, and you use the stylus on the bottom screen to choose your clubs, line up your shots, adjust your spin, and swing at the ball. Swinging the club is done by simply drawing a line toward the ball, and how you draw the line determines the quality of your shot. The length of the line determines how far back your golfer pulls his or her club, the speed at which you draw the line determines the speed of your golfer's swing, and you can also draw or fade your shots by aiming for the sides of the ball. It's a fine system in theory, but there's virtually no nuance to the touch-screen controls. Once you line up your shots with the aiming reticle, a marker appears on the lower screen, taking all of the guesswork out of figuring out how much power to put behind your shots. With its highly specific speedometer, it initially seems like the game is taking great care to determine the speed of your swing, but after a few games, you'll realize that regardless of how much you try to vary the speed of your shot, it will almost inevitably end up traveling at roughly 70, 90, or 110 miles per hour. There's also no way to choose any type of shot other than a full swing, which means that the shape of your shot is always determined by which club you're using. The same basic concept of drawing a line to swing the club applies to the putting mechanic in True Swing, though it takes away the speed factor and adds a guideline on the upper screen that makes the entire short game achingly easy. All you have to do is line up the shot, check against the guideline on the upper screen, and repeat until the guideline is lying on top of the cup. The game also employs a grid of arrows to give you a sense of the green, but with the guideline in place, it's pretty superfluous. Hopefully this doesn't preclude the arrival of Mario Golf on the DS. The game's rather generic presentation doesn't do much to distract you from the meager gameplay options or the poorly realized swing mechanics, either. The polygonal view that you're given on the top screen gives you a pretty nice view of the game's rather nondescript courses. Your golfer will appear on the top screen when you're actually swinging, and the swing animation itself looks pretty nice, but you'll probably be too focused on performing your actual swing to notice. The character models themselves look particularly square, making it all the more unfortunate that the game seems to present a lot of up-close shots of the golfers at the end of a hole. The sound design in True Swing is just as unremarkable, layering appropriately laid-back elevator music with swing and golf clap sounds. For a game from a publisher and a developer that have both done some interesting and accomplished things with the game of golf, True Swing comes out surprisingly flat. Last year's Tiger Woods PGA Tour for the DS was admittedly a flawed product, but there's still no one good reason to pick up True Swing Golf instead of, or even in addition to, Tiger."}