{"ref": "https://www.gamespot.com/reviews/nhl-hitz-pro-review/1900-6075739/", "date": "September 24, 2003", "game_name": "NHL Hitz Pro", "text": "Midway's NHL Hitz series is only a couple of years old now, and already the company has endeavored to give it a massive overhaul. Earlier this year, Midway announced that it would be completely revamping both its arcadelike Hitz and Blitz series with more simulation-styled gameplay. At the same time, Midway wants to maintain the fast-and-loose style and pace characteristic of both series. NHL Hitz Pro is the first result of this experiment, and, thankfully, Midway has not ~done its hockey series wrong.~ The game is an excellent blend of the two styles of play and has enough options, on either side, to appeal to hockey fans of any sensibility. Above all else, the game is just a lot of fun. NHL Hitz Pro includes a number of simulation elements never before found in the series, like, for instance, realistic rules. For those who have never experienced the NHL Hitz games, the previous Hitz titles were arcade hockey games through and through, featuring exaggerated hits, blazingly fast gameplay, and lots of scoring. Given the change of focus in the series, the default gameplay settings in Hitz Pro aren't nearly as different as you might expect. The initial speed is a bit slower, and the icing rule is turned on, but otherwise, most of the same distinctions apply in the default game. However, you do have the option of switching from the default mode over to the Hitz mode--which is the arcade game in its purest form. You may also switch over to the pro mode, which features the same rules and regulations found in a real hockey game, including penalties, offsides rulings, line changes, and strategies. The default mode and the Hitz mode definitely feel the most natural. On the other hand, the pro mode, while definitely accurate, feels a little bit off by comparison. This is simply because the movements and actions of the players on the ice don't really compare with other simulation hockey titles on the market. There are a wealth of different gameplay options and sliders you can alter so that you can specify exactly how arcade- or simulation-based you want the game to be. Therefore you shouldn't have any trouble finding a comfortable setting. Hitz Pro does feature five-on-five hockey, instead of three-on-three as in previous years, but, unfortunately, there is no option of reverting to the old way. However, fans of the previous games will find that having more players out there certainly doesn't detract from the experience, because the Hitz mode plays just as well with five men on the ice as it did with three. Plenty of painful-looking body checks make this a really hard-hitting game of hockey. The controls for Hitz Pro aren't really different from previous Hitz games, which means there are buttons used to pass, deke, shoot, guard the puck, turbo, dump the puck, check, and stick check, depending on which side of the puck you're on. Whether you're playing the pro or Hitz mode, pretty much all of the actions are the same in that they're quite exaggerated. Checking is incredibly overpowered, so even the little guys can send players flying. The big enforcer types can completely destroy an opponent by knocking him flat on his back or through the glass and into the stands. The game's deke move is actually just a spin move, but when timed properly, it can cause you to bypass a defender, or, in some cases, it can trip him up when he's going in for a hit. Hitz Pro does offer one new shooting feature in the wraparound shot. To perform a wraparound, you need to get one of your players behind the opposing net. Then you press the shoot button. Your player immediately tries to wrap the puck around the net and past the goalie. It's a really nice addition, and it actually gives you one of the best depictions of a wraparound shot found in a hockey game. NHL Hitz Pro features most of the same modes as last year's game, like exhibition mode, season/playoffs mode, a new version of hockey school (hosted by former NHL coach Scotty Bowman and a number of current NHL superstars), and a revamped version of the franchise mode. The new franchise mode, like last year's, puts you in control of your own team, giving you the ability to name both your team and your players. You can also customize the appearance of your team, which adds another level of personalization to the mode. You can fine-tune the gameplay to make it more or less realistic, and any hockey fan should be able to find a sweet spot somewhere. Once you create your team, you basically set out to take on 15 other bush-league teams in a quest to make it to the NHL. As you play each game, you have a specific challenge set that must be accomplished during the game. These challenges range from recording a shutout to winning every fight in the game to getting three assists with one specific player. Completing these challenges allows you to improve your team's overall status and to unlock ~hero equipment.~ Hero equipment is essentially a stats upgrade for any player on your team you choose to give it to. You'll unlock things like Lemieux's gloves, which increase your skating and shooting abilities, and Domi's helmet, which increases a player's aggression levels. Once your team has completed the circuit, you can use that team in the game's season mode. One unfortunate omission in this year's game is the minigames mode, which a lot of people rather liked, but is no longer available. The effective replacement for minigames is pickup hockey. This is basically a miniaturized version of the game that takes place on a frozen pond, in a city park, or in a parking lot. Each location features two set teams who battle it out. In the parking lot, for instance, a pair of roller hockey squads go at one another, and in the city park, it's an all-out brawl between two groups of blue-collar types. Here, you basically set how many goals you want to play to, and the game is on. This mode isn't quite as original or interesting as last year's minigames mode, but it's still really good--especially in multiplayer. Hitz Pro doesn't feature the deepest level of hockey gameplay around, but it's still a whole lot of fun. As far as presentation goes, this is the area where NHL Hitz Pro falters a bit. For the most part, the game does look very good. The player models are less exaggerated and look more realistic than ever before, and all of the game's menus and stat overlays are equally pleasing to look at. Animations are just as wild as ever, with players on the receiving end of brutal checks flying face-first into the ice. There are some pretty awesome-looking contextual goal-scoring animations, like one where a player dives to hit a rebound with his stick and attempts to edge it into the net. Unfortunately, the game has some pretty heavy frame rate problems, especially during cutscenes and replays, where the chop can get very ugly. The Xbox and GameCube versions of the game are about on par with one another, but there are a couple of notable differences. The Xbox version looks cleaner and brighter overall, but the frame rate problems are actually less prevalent on the GameCube version, though they do still exist. The game's audio is on par with the graphics--meaning it's good but not great--and consists of typical sound effects and some random, yet decent, licensed music. Commentary is provided by the team of Tim Kutzrow and Harry Tienowitz, and, like in most Midway sports titles, it's usually pretty amusing stuff. NHL Hitz Pro offers some new simulation options, but these really aren't what the game is all about. The gameplay of the arcadelike modes is still really great, and the extensive roster of modes for play make this a great package for any arcade hockey fan or simulation hockey fan looking for something a bit different. If you enjoyed any of the previous installments of NHL Hitz, NHL Hitz Pro is right up your alley. NHL Hitz Pro features most of the same modes as last year's game, like exhibition mode, season/playoffs mode, a new version of hockey school (hosted by former NHL coach Scotty Bowman and a number of current NHL superstars), and a revamped version of the franchise mode. The new franchise mode, like last year's, puts you in control of your own team, giving you the ability to name both your team and your players. You can also customize the appearance of your team, which adds another level of personalization to the mode. You can fine-tune the gameplay to make it more or less realistic, and any hockey fan should be able to find a sweet spot somewhere. Once you create your team, you basically set out to take on 15 other bush-league teams in a quest to make it to the NHL. As you play each game, you have a specific challenge set that must be accomplished during the game. These challenges range from recording a shutout to winning every fight in the game to getting three assists with one specific player. Completing these challenges allows you to improve your team's overall status and to unlock ~hero equipment.~ Hero equipment is essentially a stats upgrade for any player on your team you choose to give it to. You'll unlock things like Lemieux's gloves, which increase your skating and shooting abilities, and Domi's helmet, which increases a player's aggression levels. Once your team has completed the circuit, you can use that team in the game's season mode. One unfortunate omission in this year's game is the minigames mode, which a lot of people rather liked, but is no longer available. The effective replacement for minigames is pickup hockey. This is basically a miniaturized version of the game that takes place on a frozen pond, in a city park, or in a parking lot. Each location features two set teams who battle it out. In the parking lot, for instance, a pair of roller hockey squads go at one another, and in the city park, it's an all-out brawl between two groups of blue-collar types. Here, you basically set how many goals you want to play to, and the game is on. This mode isn't quite as original or interesting as last year's minigames mode, but it's still really good--especially in multiplayer. Hitz Pro doesn't feature the deepest level of hockey gameplay around, but it's still a whole lot of fun. As far as presentation goes, this is the area where NHL Hitz Pro falters a bit. For the most part, the game does look very good. The player models are less exaggerated and look more realistic than ever before, and all of the game's menus and stat overlays are equally pleasing to look at. Animations are just as wild as ever, with players on the receiving end of brutal checks flying face-first into the ice. There are some pretty awesome-looking contextual goal-scoring animations, like one where a player dives to hit a rebound with his stick and attempts to edge it into the net. Unfortunately, the game has some pretty heavy frame rate problems, especially during cutscenes and replays, where the chop can get very ugly. The Xbox and GameCube versions of the game are about on par with one another, but there are a couple of notable differences. The Xbox version looks cleaner and brighter overall, but the frame rate problems are actually less prevalent on the GameCube version, though they do still exist. The game's audio is on par with the graphics--meaning it's good but not great--and consists of typical sound effects and some random, yet decent, licensed music. Commentary is provided by the team of Tim Kutzrow and Harry Tienowitz, and, like in most Midway sports titles, it's usually pretty amusing stuff. NHL Hitz Pro offers some new simulation options, but these really aren't what the game is all about. The gameplay of the arcadelike modes is still really great, and the extensive roster of modes for play make this a great package for any arcade hockey fan or simulation hockey fan looking for something a bit different. If you enjoyed any of the previous installments of NHL Hitz, NHL Hitz Pro is right up your alley."}