{"ref": "https://www.gamespot.com/reviews/zapper-review/1900-2897286/", "date": "November 11, 2002", "game_name": "Zapper", "text": "Blitz Games has never really been the epitome of groundbreaking game design, usually hiring its services out to publishers for low-profile licensed games like Cubix: Robots for Everyone. But this small British development house has been incredibly prolific recently, shipping no fewer than four games in the past six months. Granted, none of these titles have been real award-winners, but the latest from Blitz Games, Zapper, is probably the most noteworthy of the bunch. As the spiritual successor to Frogger 2: Swampy's Revenge, Zapper delivers more challenging action puzzle gameplay in a colorful, upbeat setting. The story of Zapper the cricket serves as very thin window dressing, motivating you to stop Maggie the Magpie and rescue your little brother, Zipper. Zapper is basically just Frogger without the license, and anyone who played either of the first two 3D Frogger games should be instantly familiar with the game's controls, and players familiar with the platformer formula should have little trouble figuring this one out. You'll guide Zapper across a series of 3D grids, hopping from space to space, dodging hazards, leaping across chasms, and doing a little bit of zapping, which can stun enemies and open up wooden crates. Your primary goal is to smash all six of the evil magpie eggs placed in each level by Maggie the Magpie, but there are also lots and lots of shiny baubles to collect, and collecting enough of these will give you a onetime superzap, which can be used to reveal secret areas of the map and open up special steel crates. Using the shoulder buttons, you can make Zapper change the direction he's facing without hopping to another square, which makes for much tighter level design all around. At 18 levels, Zapper is longer than Frogger 2, but unfortunately the action generally doesn't change much through the 18 levels, and you'll probably have had your fill of Zapper by the end. If you indeed tire of Zapper's story mode, the game also offers an arcade mode and a multiplayer mode. The arcade mode isn't much--it essentially just puts a timer on levels you've already played. Though every game in the multiplayer mode is a slight variation on the theme of catching Zipper on the map before the other players do, this mode is made more interesting because of the inclusion of custom rules, which let you tweak the match settings to your liking. The visual style of Zapper is much the same as its predecessor, creating a bright, colorful environment that walks the line between 2D and 3D by mixing visual elements from both styles. While the game is quite proficient at what it does here, the game is displayed on such a small scale that the graphics are more charming than impressive. Zapper himself, however, lacks the polygonal definition or the character to be much of a recognizable personality and, like many platforming heroes, could have easily been swapped out for a completely different character altogether. The sound in Zapper is pretty much dominated by the soundtrack, which comes off like a fusion of Fatboy Slim-style party music and the old-school Big Band style of the old Merry Melodies tunes. This is a better combination than you might expect, and a couple of the tracks are actually downright infectious. The changes that Blitz Games has made from Frogger 2 to Zapper are incremental, and the resulting product is basically the same. So it doesn't get a lot of points for originality, but the style of gameplay found in Zapper is still fairly unique, and the graphical presentation is competent enough that it doesn't distract you from the task at hand. In the end, Zapper fulfills its modest aspirations of capably creating an enjoyable action puzzle game."}