{"ref": "https://www.gamespot.com/reviews/the-urbz-sims-in-the-city-review/1900-6112791/", "date": "November 10, 2004", "game_name": "The Urbz: Sims in the City", "text": "The Urbz: Sims in the City is the latest title based on developer Maxis' incredibly successful PC game The Sims. And instead of restricting itself to tiny neighborhoods, the new game takes place in the big city. Maxis' bold changes to the original formula set forth by The Sims aren't all for the better, but they make The Urbz a very distinctive and surprisingly solid game. The removal of some aspects of the series and the emphasis placed on other areas suggest that The Urbz might be best suited to a specific audience, but it retains enough core elements to appeal to most any fan of The Sims. The Urbz isn't about building a home--it's about hanging out in the big city. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: The Urbz: Sims in the City Video Review Unlike The Sims for the PC (and most other The Sims products), The Urbz doesn't focus on building up a fabulous home or getting to know your neighbors well enough to love them or hate them. Instead, the game lets you create a group of up to four different ~urbs~ (the hip, urban version of a ~sim~) in a single saved game session, and control one of them at a time. Your character can start his or her career in one of the game's nine districts, each of which is designed around a particular type of urban subculture, such as skaters, ravers, and bikers. You have a set of roughly analogous goals to accomplish in each area, but your primary goal is to improve your reputation by socializing with urbs in the different neighborhoods. In fact, most of your character's interaction with other characters will happen as a direct result of your efforts to become more popular. Successfully socializing with other urbs (that is, interacting with them using the appropriate conversation commands, or ~socials,~ without horribly offending them) increases an onscreen ~reputation~ meter that, when continuously filled, can make your character more famous and even appear on posters throughout the city. Filling up your meter, along with completing specific goals like advancing in a career path, can unlock access to new districts and areas, new standard socials, and new ~power socials~--especially effective socials that can also be used to scare off bullies and muggers. Like in other The Sims products, you interact with other characters by choosing from a preset list of socials, but The Urbz actually color-codes socials to show which ones will actually work (green socials always succeed, yellow socials only sometimes succeed, and red socials always fail). This minor addition makes getting in good with other characters much easier, but if you're aggressively trying to complete your goals, it has the side effect of making character interaction a lot less interesting--you'll end up using only the few green socials over and over. You can also increase your standing in a district by changing clothes at that district's clothier, which, depending on the district, will let you deck your character out in a good variety of different getups, including knit caps, flannel shirts, high heels, dreadlocks, facial and body piercings, and even tattoos. And you'll unlock more content by achieving other specific goals, such as scaring off bullies, using specific socials in different districts, and advancing through the first, second, and third levels in the game's new career system. Unlike previous The Sims games, The Urbz lets you control your character directly at work at temporary jobs like being a short-order sushi chef, a pro skater, a sculptor, or a fashion model. You complete your ~job~ by pressing your controller's buttons in simplistic four-button sequences (three-button sequences in the GameCube version, presumably because of the default GameCube controller setup), as well as looking after a few other miscellaneous concerns, such as maintaining your urb's hygiene while making California rolls. Once you've completed the basic level of a job, you'll need to train in a specific skill to advance to the higher-paying second and third levels of each one--for instance, to be a level-three bartender on Cozmo Street, you need to increase your ~mental~ attribute. The actual act of pressing controller buttons in sequence isn't especially challenging or interesting (and it's the same for every single job in the game), and neither is the tedious process of using a skill object, which requires you to hammer on your controller's A button repeatedly (or X for the PS2 version) until your skill increases enough to take on the next job level. You'll use your mobile phone to manage goals, inventory, and relationships. Your goals, messages, and inventory are handled with your character's mobile phone, which rings whenever you receive a new message or unlock a new goal. Sometimes you'll be mobbed with too many messages to really keep track of them, and while the phone interface handles some features well, like your relationships with other characters and your remaining goals, it doesn't do a good job of organizing incoming messages (which appear in one long list) or managing the items you purchase for your urb's apartment or apartments. Like in other Sims products, your character has a home--in this case, an apartment that can be decked out with different wallpaper and furniture. But in a baffling change, you can't buy anything for your apartment while you're in it. You must instead visit the cash register in each district to buy items, sight unseen, to bring back to your apartment and place. Since entering and leaving districts requires you to sit through a load time of 10 to 15 seconds (sometimes more on the PS2 version) each way, and since most of The Urbz's action takes place out in the city, there's very little incentive to furnish your apartment, which basically turns one of The Sims' most fundamental gameplay mechanics--building and designing a home--into something you may not even bother with. Considering that you can lay down some skill-increasing objects in the middle of the city, and also that you can find nearly all the amenities of home, including food, entertainment, and even a bed, out in each city district, you practically never need to return to your apartment, and you probably won't. However, The Urbz still has no shortage of different things for your character to do, and while many goals are similar across different districts, you should have a wide enough variety of goals available at any time to not feel terribly bored or forced into playing the game a certain way. If you don't like where you are at a given moment, you can simply pick up and move to a new district, get a new change of clothes, and hang out with a whole new group of friends. The new game has fairly good artificial intelligence for your character and for others (even though characters do occasionally ~forget~ their next actions, like in The Sims), and it's also very lenient with ~motives~--your urb's various personal needs of food, hygiene, rest, and so on. However, The Urbz still does feature the time-management gameplay made famous in The Sims in that not only do you need to look after your character's more-manageable motives, but you also need to attend certain events that happen only at specific times of the day, like jobs that are available only between certain hours and parties that happen only at midnight. Using the right socials can help you become more popular. It's also essential that your urb be popular and make lots of friends by successfully socializing (becoming extremely close friends with another urb will let you ask that character to join your ~crew,~ at which point you can switch your control to that character at any time)--but pretty much anytime you speak with another urb, it's to gain popularity or unlock a new social, and not to experience an unexpected interaction like in The Sims, where the characters were more autonomous and much less predictable. In fact, rather than emphasizing home building or character interaction, The Urbz instead stresses popularity, different clothing fashions, and simple minigames, all of which are organized with a mobile phone--a presentation that seems like it would be most appealing to young girls, which is presumably the game's target audience, anyway. The Urbz's presentation is another story altogether. The game's graphics are extremely colorful and feature a distinctive cartoonlike look that is very consistent. The Urbz does a surprisingly good job of capturing the essence of each urban subculture (or at least, a comically over-the-top version of each one), and most of the social gestures are very expressive and very much in keeping with the flavor of the game. Rich snobs from Diamond Heights just love mugging for the camera when you use the ~snapshot~ social on them, while thugs from the rough side of town prefer to be greeted with playful fake punches or vicious professional-wrestling maneuvers. These expressive animations play into the game's sense of humor, which also extends to the in-game descriptions and the numerous sight gags employed when urbs interact. The Xbox version is clearly the best looking of the three, sporting cleaner textures and fewer jagged polygonal edges, while the GameCube and PS2 versions have noticeably aliased graphics in some areas. Similarly, the game's music, which includes contributions from the hip-hop group Black Eyed Peas, is uniformly very appropriate for each district, despite the fact that nearly all of it is delivered in ~simlish,~ the gibberish language of The Sims. Hang out with the wannabe-Japanese ravers of Neon East to hear bubbly, vacuous techno music, or listen to a semi-gibberish version of the Black Eyed Peas radio hit ~Shut Up~ in the inner-city alleys of Cosmo Street. It's disappointing that all three games suffer from minor graphical slowdown whenever the game cuts to a wide shot of a district, or when too many urbs appear onscreen, and that there are fairly limited voice samples for the actual characters, but despite these issues, The Urbz's presentation is still surprisingly authentic. The game's different districts do a surprisingly good job of re-creating different urban subcultures. The Urbz offers nine major districts that will all take at least an hour to fully clear out, along with Darius' penthouse, the home of the most happening urb in the city and the game's final area. Most of each district's goals are actually fundamentally identical (completing jobs, learning at least two distinct socials from locals, earning a power social, scaring away a bully, and so on), but you'll often have so many variations on each goal to complete that you should find enough variety to keep you busy. You might take issue with the game's few minor bugs (which sometimes cause important characters not to appear on time, or cause your sim to celebrate completing a goal when nothing has actually happened), or with the game's fundamental shift away from home design and unpredictable interactions. However, what The Urbz offers for most players is a surprisingly great presentation and varied gameplay, and PS2 owners will also be able to use their EyeToy peripheral to take real-life photos of themselves to put on in-game posters when their urb becomes popular. Those who find this last feature truly exciting, or are thrilled by the idea of playing a game that focuses on constantly dressing up a character in new clothing and hairstyles, or on managing relationships with many virtual friends by answering a virtual mobile phone, will be the ones who will likely get the most out of The Urbz. However, The Urbz still has no shortage of different things for your character to do, and while many goals are similar across different districts, you should have a wide enough variety of goals available at any time to not feel terribly bored or forced into playing the game a certain way. If you don't like where you are at a given moment, you can simply pick up and move to a new district, get a new change of clothes, and hang out with a whole new group of friends. The new game has fairly good artificial intelligence for your character and for others (even though characters do occasionally ~forget~ their next actions, like in The Sims), and it's also very lenient with ~motives~--your urb's various personal needs of food, hygiene, rest, and so on. However, The Urbz still does feature the time-management gameplay made famous in The Sims in that not only do you need to look after your character's more-manageable motives, but you also need to attend certain events that happen only at specific times of the day, like jobs that are available only between certain hours and parties that happen only at midnight. Using the right socials can help you become more popular. It's also essential that your urb be popular and make lots of friends by successfully socializing (becoming extremely close friends with another urb will let you ask that character to join your ~crew,~ at which point you can switch your control to that character at any time)--but pretty much anytime you speak with another urb, it's to gain popularity or unlock a new social, and not to experience an unexpected interaction like in The Sims, where the characters were more autonomous and much less predictable. In fact, rather than emphasizing home building or character interaction, The Urbz instead stresses popularity, different clothing fashions, and simple minigames, all of which are organized with a mobile phone--a presentation that seems like it would be most appealing to young girls, which is presumably the game's target audience, anyway. The Urbz's presentation is another story altogether. The game's graphics are extremely colorful and feature a distinctive cartoonlike look that is very consistent. The Urbz does a surprisingly good job of capturing the essence of each urban subculture (or at least, a comically over-the-top version of each one), and most of the social gestures are very expressive and very much in keeping with the flavor of the game. Rich snobs from Diamond Heights just love mugging for the camera when you use the ~snapshot~ social on them, while thugs from the rough side of town prefer to be greeted with playful fake punches or vicious professional-wrestling maneuvers. These expressive animations play into the game's sense of humor, which also extends to the in-game descriptions and the numerous sight gags employed when urbs interact. The Xbox version is clearly the best looking of the three, sporting cleaner textures and fewer jagged polygonal edges, while the GameCube and PS2 versions have noticeably aliased graphics in some areas. Similarly, the game's music, which includes contributions from the hip-hop group Black Eyed Peas, is uniformly very appropriate for each district, despite the fact that nearly all of it is delivered in ~simlish,~ the gibberish language of The Sims. Hang out with the wannabe-Japanese ravers of Neon East to hear bubbly, vacuous techno music, or listen to a semi-gibberish version of the Black Eyed Peas radio hit ~Shut Up~ in the inner-city alleys of Cosmo Street. It's disappointing that all three games suffer from minor graphical slowdown whenever the game cuts to a wide shot of a district, or when too many urbs appear onscreen, and that there are fairly limited voice samples for the actual characters, but despite these issues, The Urbz's presentation is still surprisingly authentic. The game's different districts do a surprisingly good job of re-creating different urban subcultures. The Urbz offers nine major districts that will all take at least an hour to fully clear out, along with Darius' penthouse, the home of the most happening urb in the city and the game's final area. Most of each district's goals are actually fundamentally identical (completing jobs, learning at least two distinct socials from locals, earning a power social, scaring away a bully, and so on), but you'll often have so many variations on each goal to complete that you should find enough variety to keep you busy. You might take issue with the game's few minor bugs (which sometimes cause important characters not to appear on time, or cause your sim to celebrate completing a goal when nothing has actually happened), or with the game's fundamental shift away from home design and unpredictable interactions. However, what The Urbz offers for most players is a surprisingly great presentation and varied gameplay, and PS2 owners will also be able to use their EyeToy peripheral to take real-life photos of themselves to put on in-game posters when their urb becomes popular. Those who find this last feature truly exciting, or are thrilled by the idea of playing a game that focuses on constantly dressing up a character in new clothing and hairstyles, or on managing relationships with many virtual friends by answering a virtual mobile phone, will be the ones who will likely get the most out of The Urbz."}