{"ref": "https://www.gamespot.com/reviews/crimson-skies-review/1900-2631526/", "date": "September 22, 2000", "game_name": "Crimson Skies", "text": "Occasionally, games defy genre classification. That's the case with Crimson Skies, which could be called a flight sim, an action game, and at some points even an adventure. While games that mix genres often turn out badly, Crimson Skies takes the most interesting aspects of each of its source genres and puts them together into a fresh, original concept that has plenty of style. In fact, playing Crimson Skies can be so much fun that it'll remind you of why computer games were probably invented in the first place: to create absorbing, imaginative, alternate worlds to escape to. Unfortunately, the game is also a reminder of how easily technical problems can defeat a promising design. Crimson Skies takes place in an alternate past in which the Great Depression caused the United States to break up into a host of regional fiefdoms engaged in constant skirmishing. Faced with the breakdown of the railway system, these nations were forced to rely on aircraft for commerce, and the skies soon became crowded with passenger and cargo traffic. As airborne trade grew, so did the menace of ~air pirates.~ Crimson Skies takes you through the exploits of one such buccaneer, Nathan Zachary, as he and his cohorts gradually turn from being aerial bandits into public heroes. Along the way you'll meet the other denizens of the Crimson Skies universe, including rival pirates like Ulysses Boothe and several of Zachary's former love interests. It's a very rich and well-developed universe. The world of Crimson Skies is actually based on the popular board game from FASA (now part of Microsoft), and it's a loud, brash place. Microsoft and developer Zipper Interactive have done a great job of creating an atmosphere for Crimson Skies that's similar to 1930s pulp fiction, between all the game's daring exploits and its emphasis on adventure instead of pure violence. While Crimson Skies is ultimately a game about air combat, it's structured so that the focus is just as much on daredevil flying as it is on shooting the other guys down. To this end, you can even set up instant-action missions where the objective is stunt flying. In keeping with Crimson Skies' imaginative setting, the flight models for the various aircraft are extremely forgiving. The planes allow for flashy acrobatic maneuvers without your having to worry about concomitant airspeed, stall, and lift issues that are at the heart of any true flight simulation. For example, while a Crimson Skies plane does lose a bit of lift when flying at a 90-degree bank, turning the rudder at that attitude will send the aircraft climbing with ease (or diving, depending on which way you turn the rudder). The wide variety of bizarre aircraft designs is a big part of the game - you can even customize your own - and these all have varying speed and maneuverability characteristics. But all the aircraft you can fly share certain things in common that relieve you of having to worry about such things as deciding whether you have enough airspeed for a loop. All the planes are tremendously overpowered: No matter which plane you fly, you'll be able to climb, dive, and turn with impunity. The result is that you can pretty much dive into the action without having to worry too much about the more demanding details of flight, and instead just focus on the basics - like where the ground is or if you're about to hit a mountain. The game's emphasis is on fast, furious air combat and performing difficult maneuvers. There are ~danger zones~ in most scenarios, such as bridges or tunnels or some other restricted space underneath some obstacle. Successfully flying through such a zone will shake a pursuer, and in the campaign it will yield a ~snapshot~ for the photo album/scrapbook that documents all your triumphs. This running archive of your feats of skill is a clever way of personalizing what is essentially a fixed, linear story. Crimson Skies has a 24-mission campaign that tells the story of Nathan Zachary and his band of pirate aces as they go from Hawaii to Hollywood to Manhattan in search of fame and fortune. The campaign is where the Crimson Skies universe really comes alive and the skill of the production team comes through. Each mission is preceded by a map-screen briefing with voice-over by Nathan Zachary, in addition to plenty of dialogue supplied by his cohorts. The voice acting is simply outstanding and among the best you'll find in a computer game. Both the story and the voices are sufficiently campy for the pulp-novel atmosphere, but they also mimic the style of the time so well without crossing the line into parody that you can't help but be impressed.The game's graphics are excellent throughout, and they feature wonderful landscapes and clean, crisp aircraft models. The colors are bright, and the effect is in keeping with the story, as it all seems larger than life. Crimson Skies uses the variety of locales to keep the gameplay fresh, and when combined with the story, it's enough to push you through the game without ever slowing down. The missions are a combination of combat and derring-do. As you progress through a mission, you'll generally be instructed to do something that wasn't in the original mission briefing, as unexpected, scripted events arise. And performing a dangerous maneuver will elicit a comment from your wingmen. The only problem with the campaign is that it's completely linear, so each mission will play exactly the same when repeated. This can become a bit tiresome the fifth time through a mission if you're having difficulty with a particular objective, because you'll hear all the same dialogue each time. Your wingmen serve more as running commentators than actual support, since they can't be given orders and are more useful in alerting you to threats than in dealing with them. This is all in keeping with Crimson Skies' focus on action. The game's multiplayer mode includes deathmatch, capture the flag, and zeppelin-to-zeppelin combat, and it is supported on the MSN Gaming Zone in addition to being playable over TCP/IP, IPX, and direct serial connections. The only thing that's really missing is the option to cooperatively play missions from the campaign. If the preceding descriptions were all that could be said about Crimson Skies, then it would be a truly outstanding game. Unfortunately, in keeping with the disturbing trend in which games are released prematurely and later patched after they're already available, Crimson Skies seems as if it were taken away from a quality assurance team much too soon. The game has many serious problems with its loading times and its stability, although the actual in-mission gameplay itself is fairly stable and smooth. The problems emerge in between the actual missions, where an apparent memory leak can often slow menu selection to a crawl. Transitions between game screens are also painfully slow and prone to freezing and crashing. According to Crimson Skies message-board postings, some players have managed to avoid these problems, but many others weren't so lucky - and all these bugs affected several of GameSpot's test systems running the game. As a result, it's impossible to wholeheartedly recommend the game unless Microsoft addresses its problems. It's unfortunate when a fundamentally good game such as Crimson Skies is marred by persistent crash bugs that affect each game session. However, the worst bug in the game is its tendency to spontaneously delete saved games. Crimson Skies saves your games under your pilot's name (you can create more than one pilot) and keeps track of how far you've gone in the campaign, so if you finish the fifth mission, you just later load that pilot's campaign and you get the briefing for the sixth. Incredibly, the game sometimes just seems to delete these, forcing you to start all over with no chance of recovery. As such, playing the campaign seems like a game of Russian roulette - you may or may not make it all the way to the end, regardless of your skill. Crimson Skies does an excellent job of taking the elements of flight simulations that have broad appeal - the shooting and the fancy flying - and embellishing them with a great environment and a good story. And it does all this in a slick and attractive way that makes even its corniest moments appealing. So unfortunately, its technical problems end up taking away from what's one of the most stylish games in years. If a patch were to resolve its various bugs, then Crimson Skies would be very easy to recommend - but until then, buy it at your own risk.The game's graphics are excellent throughout, and they feature wonderful landscapes and clean, crisp aircraft models. The colors are bright, and the effect is in keeping with the story, as it all seems larger than life. Crimson Skies uses the variety of locales to keep the gameplay fresh, and when combined with the story, it's enough to push you through the game without ever slowing down. The missions are a combination of combat and derring-do. As you progress through a mission, you'll generally be instructed to do something that wasn't in the original mission briefing, as unexpected, scripted events arise. And performing a dangerous maneuver will elicit a comment from your wingmen. The only problem with the campaign is that it's completely linear, so each mission will play exactly the same when repeated. This can become a bit tiresome the fifth time through a mission if you're having difficulty with a particular objective, because you'll hear all the same dialogue each time. Your wingmen serve more as running commentators than actual support, since they can't be given orders and are more useful in alerting you to threats than in dealing with them. This is all in keeping with Crimson Skies' focus on action. The game's multiplayer mode includes deathmatch, capture the flag, and zeppelin-to-zeppelin combat, and it is supported on the MSN Gaming Zone in addition to being playable over TCP/IP, IPX, and direct serial connections. The only thing that's really missing is the option to cooperatively play missions from the campaign. If the preceding descriptions were all that could be said about Crimson Skies, then it would be a truly outstanding game. Unfortunately, in keeping with the disturbing trend in which games are released prematurely and later patched after they're already available, Crimson Skies seems as if it were taken away from a quality assurance team much too soon. The game has many serious problems with its loading times and its stability, although the actual in-mission gameplay itself is fairly stable and smooth. The problems emerge in between the actual missions, where an apparent memory leak can often slow menu selection to a crawl. Transitions between game screens are also painfully slow and prone to freezing and crashing. According to Crimson Skies message-board postings, some players have managed to avoid these problems, but many others weren't so lucky - and all these bugs affected several of GameSpot's test systems running the game. As a result, it's impossible to wholeheartedly recommend the game unless Microsoft addresses its problems. It's unfortunate when a fundamentally good game such as Crimson Skies is marred by persistent crash bugs that affect each game session. However, the worst bug in the game is its tendency to spontaneously delete saved games. Crimson Skies saves your games under your pilot's name (you can create more than one pilot) and keeps track of how far you've gone in the campaign, so if you finish the fifth mission, you just later load that pilot's campaign and you get the briefing for the sixth. Incredibly, the game sometimes just seems to delete these, forcing you to start all over with no chance of recovery. As such, playing the campaign seems like a game of Russian roulette - you may or may not make it all the way to the end, regardless of your skill. Crimson Skies does an excellent job of taking the elements of flight simulations that have broad appeal - the shooting and the fancy flying - and embellishing them with a great environment and a good story. And it does all this in a slick and attractive way that makes even its corniest moments appealing. So unfortunately, its technical problems end up taking away from what's one of the most stylish games in years. If a patch were to resolve its various bugs, then Crimson Skies would be very easy to recommend - but until then, buy it at your own risk."}