{"ref": "https://www.gamespot.com/reviews/the-sum-of-all-fears-review/1900-2911268/", "date": "February 20, 2003", "game_name": "The Sum of All Fears", "text": "The Sum of All Fears is one of the few tactical espionage games available for the Game Boy Advance, but moviegoers hoping to relive the events depicted in the film may be disappointed with it. This is because the only plot point the two have in common is that of a nuclear device detonating on American soil. You control a team of counterterrorist operatives sent in to uncover the source of this device. The single-player campaign includes 15 missions spread across the globe, from West Virginia in the United States, to the Middle East, and throughout Africa. Red Storm Interactive developed The Sum of All Fears for publisher Ubi Soft, so it's no surprise that the game looks, sounds, and plays similarly to Rainbow Six: Rogue Spear, which was also developed by Red Storm and released earlier in 2002. The presentation is pretty slick, although the visuals and audio don't really break any new ground. The environments have a pseudo three-dimensional look to them thanks to the use of a tilted perspective, and all of the various furniture, vehicles, and other decorative elements are extremely detailed. Even though the character graphics are tiny, they're remarkably lifelike and show a good range of motion. Whenever you reload your weapon, for example, your character will go through the entire process of removing the old clip and reaching for and installing a new one. The game doesn't implement any special lighting or transparency effects, however, which tends to make the whole visual experience rather run of the mill. The same holds true for the audio. The sound effects are basically just an assortment of gunshots, and there isn't any in-game music whatsoever. There is a fair amount of digitized speech, however, which is exceptionally clear and does a nice job of establishing the overall tone of each mission. Just like Rogue Spear, The Sum of All Fears is a team-oriented game. Before each mission, you select four team members from a list of 20 or so various operatives. These operatives each fall into one of four different character classes: recon, assault, sniper, and demolition. The different classes dictate which weapons and tools you'll be able to use in a mission. For instance, if you're going into a hostage-rescue situation, you should select the recon and sniper classes since they're equipped with long-range rifles and light clothing. You'll be torn to shreds if you get into a firefight, but you'll also be able to see most enemies long before they've noticed you. No matter which class you select, it's relatively easy to switch between long-range rifles and close-up weapons such as pistols and grenades. Additionally, you can assume control over any of your team members whenever you like. Despite the basic similarities, The Sum of All Fears is much less complicated than Rainbow Six: Rogue Spear was. You can't split your team into separate attack groups, and there aren't any navigation points to fiddle with. You also can't tell your other team members to wait behind you while you enter a room. For the most part, your job is to survey the situation and go in with guns blazing. Considering the mass audience that the game is meant to appeal to, it's understandable that the developers would simplify things somewhat. Even so, the lack of strategy makes the missions feel repetitive after a while, especially since each one pretty much boils down to eliminating every last enemy soldier. After you complete the single-player campaign, which should take most players roughly three hours, you have the option to participate in a lone-wolf campaign. This option lets you play the single-player missions as a solo operative without the luxury of backup. In order to squeeze the most out of the game, you'll need to participate in its multiplayer features. These include a deathmatch mode, with 15 maps, as well as a cooperative mode, where you and your friends can team up to tackle the standard story missions. In the end, The Sum of All Fears is a good entry point for people interested in discovering the tactical espionage genre, but it doesn't offer anything over and above the older Rainbow Six: Rogue Spear. At the same time, people who purchase the game based upon its title alone will be sorely annoyed when they discover that it doesn't follow the plot of the movie it's based upon."}