{"ref": "https://www.gamespot.com/reviews/floigan-bros-review/1900-2802226/", "date": "August 7, 2001", "game_name": "Floigan Bros. Episode 1", "text": "Sega is no stranger to taking risks. Over the life span of the Dreamcast, Sega has released some of the most daring, innovative, and genuinely fun software of modern console gaming. Games like Shenmue, Jet Grind Radio, and Phantasy Star Online have, if nothing else, proven Sega's willingness to think outside the box. Of course, this risk-taking doesn't always pay off as one would hope, and sometimes the audacious vision lacks focus--look at the acid-tongued virtual pet Seaman or Kenji Eno's ambitious cinematic adventure/train wreck, D2. Floigan Brothers, the latest from Sega Sports collaborator Visual Concepts, most definitely falls into the latter category. There are hints of inspiration throughout, with the game sporting some good-looking visuals, a catchy soundtrack, and a distinct sense of style. But the game's length, uneven gameplay, and atrocious camera negate these virtues.Floigan Brothers takes inspiration from the classic mismatched buddy formula used in the black-and-white television days of comedy, as well as the comedic violence of old Warner Bros. cartoons--imagine Laurel and Hardy or Abbott & Costello done over by Tex Avery, and you'll get the general idea. The story begins with Moigle, the supersized, simple-minded brother, working on a secret project in the workshop on the Floigan family junkyard. There are a few items that are key to his plans, so he charges his diminutive but quick-witted older brother Hoigle to help him collect the necessary parts from around the junkyard. In addition, the evil Baron Malodorous has his eye on the land that the Floigans' junkyard rests on and is determined to drive the brothers out.The gameplay hinges on the disparity between the characters' size and intelligence. You have direct control over Hoigle, who in turn has a certain amount of control over Moigle. Moigle isn't so bright and generally acts on emotion, which makes him relatively easy to manipulate. You have a variety of techniques available to you: You can placate Moigle with food and games, you can depress him with insults to his character, and you can infuriate him with a couple of quick slaps. Using these skills, you solve a variety of action-by-proxy puzzles throughout the junkyard, and these are interspersed with a good deal of simple minigames. The puzzles are pretty straightforward, and adventure game veterans will likely breeze right through the game--actually, most anyone will probably breeze right through it, as Floigan Brothers is incredibly short. Visual Concepts has incorporated some online capabilities into the game, such as downloadable puzzles and the ability to trade your Moigle with other players, but the value added here is nominal. In addition to the unchallenging puzzles and the game's brevity, the reliance on dull, simplistic minigames brings the whole experience down a notch.But even these problems are minor blemishes when compared with the game's deeply flawed camera. Employing no dynamic tracking, all camera movement in Floigan Brothers is done using the shoulder buttons. The camera is at a set radius from Hoigle, making it difficult to rotate the camera in the cluttered junkyard and downright impossible in any sort of close quarters. The camera also has a nasty habit of getting momentarily stuck underneath the ground, giving you a nice worm's-eye view of the underside of the ground's textures. Floigan Brothers has been in development for almost the entire life of the Dreamcast, and developer Visual Concepts has previously produced some of the most dynamic games on Sega's hardware. There is simply no excuse for the camera problems that Floigan Brothers is so rife with.The game's graphics really makes the camera problems all the more frustrating, as the graphics are really a pleasure to look at. The game's style is very reminiscent of old Warner Bros. cartoons, which it is miraculously able to pull off without resorting to cel shading. The characters are comically animated, and there is a tangible sense of atmosphere in the game--magpies pecking about the garden, your guard dog, Spitz, idly protecting and serving, and the appropriately upbeat, jazzy soundtrack. What might not agree with everyone is the voice acting. Both Hoigle and Moigle have a fair amount of speech, but some bits come up a whole lot more often than others, and Moigle's dim-witticisms can go from comedic to grating very, very quickly.Floigan Brothers has a distinct look and a clever concept, but these are its only strengths, and they aren't enough to support the rest of the game's numerous flaws. Even though the game is being marketed as a value title, it's a tough game to recommend, and the game's shortness makes it far more appropriate as a rental."}