{"ref": "https://www.gamespot.com/reviews/star-wars-the-force-unleashed-review/1900-6197903/", "date": "September 18, 2008", "game_name": "Star Wars: The Force Unleashed", "text": "You hear the big chord and the brass fanfare, and you know what's coming. It's easy to get excited when you hear the rousing Star Wars theme, though the franchise has hardly been known for exceeding expectations in recent years. If you're interested in Star Wars: The Force Unleashed for its story and theme, you won't be disappointed: Its campaign supplies a weighty plot with a few stunning surprises. If you're more interested in the action, you'll find that while some frustrations get in the way during the main campaign, the PSP-exclusive modes are designed well and offer a surprising amount of replay value. Starkiller is an electric addition to the Star Wars pantheon. You're cast as Galen ~Starkiller~ Malek, Darth Vader's secret apprentice. The Clone Wars have ended, and Vader orders you to hunt and destroy the last of the remaining Jedi. Exploring the universe from this dark perspective is remarkably compelling. The story is over in under six hours, but it contains multiple twists, features some friendly and not-so-friendly faces, and is both explosive and remarkably intimate. You'll interact with Vader, of course, but Starkiller spends most of his time with an android called PROXY and his female pilot, Juno Eclipse. Sharing the details of the trio's adventures would spoil too much, so suffice it to say that you'll grow remarkably fond of Starkiller and his companions, and their moral conflicts carry a lot of weight. The real star of the game isn't Starkiller, though; it's the robust physics engine that powers your most impressive moves. Using Force grip, you can grab and throw any number of objects, including your enemies; with Force push, you can shove items and foes out of your path. These skills and their variants deliver the game's best moments. Whether you're flinging stormtroopers into each other or offing swarms of rebels with a burst of energy, there are a number of ~did you see that?~ moments that will have you grabbing your friends to show them your Felucian-flinging prowess. Nevertheless, the controls can be unresponsive and sometimes lack fluidity. There is a bit of a delay after some of the longer Force-power animations, so your button presses may not result in onscreen action, and the floaty jumping makes some platforming sequences more frustrating than fun. Those platforming sequences are made more vexing by Force Unleashed's unwieldy camera. The player has no manual camera control, and though the game tries to leash this untamable beast, it easily gets stuck in corners and against walls. A targeting system that lets you focus on a single enemy mitigates this issue somewhat, and the camera will reposition itself behind you if you remain immobile for a second or two, but these are imperfect solutions. However, the targeting isn't as frustrating as it is in other versions, given that environments are generally smaller and not littered with as much stuff. There are still some moments when you'll grab a different object than you intended, but seeing as how there are fewer objects to grab, these moments will provide only the occasional frustration. Force Unleashed moves along at a relatively quick pace, so between droid encounters and boss battles, you'll always be in the thick of the action. You won't find much challenge in the campaign; there are plenty of health drops scattered around, including respawning ones during boss battles. Should you die, you'll restart at the most recent checkpoint with all of the damage you've already done to your enemies still intact. This is probably for the best because it keeps the pace moving. Some variety comes by way of Force Unleashed's God of War-style quick-time events, which result in some terrific, flashy-looking moves, whether you're smashing on an opposing Jedi or defeating a rancor in a series of thrilling acrobatics. And it's a welcome sort of variety, given that you'll be visiting the same exact levels several times over. Fortunately, the PSP's exclusive modes will scratch your itch for a good challenge, and they're more entertaining than the story mode, to boot. Multiple stand-alone scenarios let you participate in famous (and hypothetical) battles from the Star Wars universe. As Anakin Skywalker, you'll skirmish with Count Dooku as the Emperor looks on; as Vader, you will come to blows with Luke before dropping the familial bomb. These missions, and others, are essentially extended boss battles, but they surpass the campaign's bosses thanks to larger environs, while mid-battle re-creations of well-known scenes make them more dramatic. Other fictional scenarios let you choose a character and take on a host of Jedi, one after another, or defend against waves of enemies. The camera can still get in the way during these battles; for example, it makes defeating Jabba's henchmen and Boba Fett while avoiding the hungry mouth of the Sarlacc more frustrating than it should be. Nevertheless, these encounters are ultimately fun, offer a lot of replay value, and cater to the game's strengths: The environments are all the right size, and there are neither too many nor too few scattered items to throw around. Luke lays down the law at the Great Pit of Carkoon. The visuals and sound both capture the Star Wars feel. Moderately sized environments are fairly detailed, and the saber action and powerful-looking Force abilities produce flurries of particles and other special effects. Areas such as the Jedi Temple, which looked underwhelming on the Wii and the PlayStation 2, benefit from the smaller screen, which imparts a crisper look. The good visuals come with a caveat, though: long loading times between missions, and moments when the action will pause as the UMD spins. These hitches occurred on both Slim and original model PSPs, so you should expect to encounter them regardless of which version of the hardware you own. The pauses aren't usually pronounced, but they'll snap you back to reality at inopportune times. John Williams' music and some original tracks, as well as the familiar swooshes of sabers, sound like you'd expect, and they appeal whether you don headphones or listen via the PSP's speakers. The voice acting is all quite good, and the voiceovers of the famous scenes seem to be lifted directly from the films. Multiplayer adds further value, and though it isn't a make-it or break-it feature in this case, it's good fun, letting you slash up and fling around up to three other local participants, assuming that they all have copies of the game. There are variations on Deathmatch and King of the Hill--nothing groundbreaking, but a pleasant change of pace that further establishes this version of Force Unleashed as the most feature-rich of the bunch. So if you're in the mood to slash up Jawas or electrocute Darth Phobos, this is your chance. Although it's unfortunate that camera issues and other frustrations weaken the experience, you'll find that Star Wars: The Force Unleashed is a pleasant way to spend a few afternoons."}