{"ref": "https://www.gamespot.com/reviews/darkened-skye-review/1900-2901492/", "date": "December 11, 2002", "game_name": "Darkened Skye", "text": "The core concept behind Darkened Skye, a fairly straightforward fantasy action adventure game, is probably one of the most peculiar in a while. The game was originally intended as a vehicle for the Skittles line of candies, and more specifically, as an extension of the Skittles commercials where Skittles-loaded rainbows would bring life and color to otherwise drab fantasy settings. Though what's probably even more bizarre than Darkened Skye's weird promotional tie-in is its rather good voice acting and impeccable sense of humor, though these positive traits only somewhat make up for the otherwise dull and unattractive proceedings. The game starts off sincere enough. You see the game's heroine, Skye, lamenting her dull existence as a lowly dwentil herder in Lynlora, a plain, boring world, and questioning her own origins and life purpose. Unsurprisingly, she quickly learns that her origins are greater than that of just a dwentil herder, and her purpose lies in overthrowing the evil lord Necroth and freeing the power of the Skittles, a type of magical jewel, to bring life and color back to the lands of Lynlora. It's pretty generic fantasy fare up to this point, but the game's whole tone changes wildly once you start the first level and meet up with your sidekick, Draak. Though he looks like a tiny evil winged demon, Draak has the voice of a stand-up comic and the personality and wealth of one-liners to match. From here on, the game regularly indulges in cheesy fantasy material about destiny and triumphing over evil and the like, but it balances these moments with lots of genuinely funny and disarmingly self-aware dialogue, often breaking the fourth wall to talk directly to the player, poking fun at the fantasy genre, overused game mechanics, and even the inclusion of the Skittles license itself. The game's less-than-auspicious beginnings make the fact that Darkened Skye is one of the most intentionally funny games to be released in a while that much more of a pleasant surprise. It's too bad, then, that its sharp wit and unrelenting sense of humor are Darkened Skye's strongest points. The gameplay is pretty standard third-person action adventure fare. You'll run, jump, and, using your handy staff, pull off a handful of melee attacks and, later on, some magic spells as well. Darkened Skye originally appeared on the PC some months back, and this origin is most evident in the game's control scheme, which is just a touch more archaic than need be. A simple tutorial or some streamlining of the controls would have vanished this problem altogether, but most players should have a pretty solid handle on Skye within the first level. Though you'll do a fair bit of fighting in Darkened Skye, the game also relies heavily on basic platform jumping and puzzle solving. The platforming portions of the game aren't especially challenging, though the occasionally inconsistent controls do make for more than one exasperating moment. Skye will randomly decide not to obey a jump command, and, as a self-described ~warrior-hero-adventurer-goddess who can't swim,~ she will get finished off by drowning in the drink more often than at the hands of enemies. The puzzles are executed with a touch more polish and tend to revolve around switch-flipping and multipart item-collection routines. Veterans of adventure games of yore should have little trouble with most of the puzzles, though the audio and visual clues can sometimes be muddled. Darkened Skye generally doesn't look particularly good, though it has a consistent and cohesive enough style to carry some of that burden. Environments look downright blocky, and textures are inconsistent and often repetitive. Skye herself looks good enough, though much of her movement appears rather mechanical, and transitions between different animations are either clunky or nonexistent. And, although the scope of the visuals in Darkened Skye is pretty humble, slowdown rears its head regularly, sometimes because of too much onscreen action, and sometimes for no real apparent reason at all. Darkened Skye's sound fares significantly better, simply by virtue of the game's consistently sharp script and solid, professional voice acting, with the actress who voiced Princess Jasmine in Aladdin handling voice duties for Skye. Though the quality of the voice acting is quite good, the audio levels are inconsistent, occasionally making the speech inappropriately loud and creating some nasty clipping. The rest of the game's sound design is just there and is generally forgettable. All things considered, Darkened Skye is a better game than a Skittles-licensed game has any business being. Sure, the actual gameplay isn't the most compelling, and the graphical presentation could've used some optimizing, but its sharp, self-deprecating wit helps motivate you to the next puzzle or platforming section, if only to hear another one-liner. But if sarcastic humor and some cringingly bad puns don't sound like your idea of good comedy, you should probably pass on Darkened Skye, as the game doesn't really have much else to offer."}