{"ref": "https://www.gamespot.com/reviews/mega-man-network-transmission-review/1900-6030115/", "date": "June 16, 2003", "game_name": "Mega Man Network Transmission", "text": "Capcom's Mega Man has done a lot of things throughout his 15-year gaming career. While he started out as, and largely continues to be, a side-scrolling robot buster, he's branched out into soccer and kart racing, he's gone 3D, he's been revived in 2D, and, in the Mega Man Battle Network series, he even went to cyberspace. The Battle Network series takes Mega Man and turns him into the cyberspace avatar of a young boy named Lan, and it tosses out the classic side-scrolling combat in favor of something a little more strategic. Now Capcom and Arika are taking the Battle Network concept and turning it back into a side-scroller with Mega Man Network Transmission. While some basic ideas from Mega Man new and old remain intact here, and at times the game can be pretty cool, it also has its share of flaws that prevent the game from being totally recommendable. Along the way you'll encounter Ice Man, Guts Man, Fire Man, and a few more of Mega Man's 8-bit foes. Network Transmission fits into the Battle Network series right between the first and second games. The basic concepts remain the same, with Lan jacking his handheld computer, known as a PET, into cyberspace. His net navi--essentially an intelligent avatar-- is Mega Man, and you'll take control of Mega Man to do all your exploring online. Unlike in the GBA games, Lan doesn't wander around the real world on his own, and all your net jacking is done via a convenient, yet bland, map screen. As you journey through various net terminals and other online locales, you'll encounter loads of regular enemies and other intelligent online avatars, also based around classic Mega Man characters. Before you're finished getting to the bottom of the game's short, thin story, you'll encounter Ice Man, Guts Man, Fire Man, Quick Man, and a few more of Mega Man's 8-bit foes. Like in the standard Mega Man side-scroller, your own personal Mega Man is armed with his classic slide move, his regular buster shots, and the ability to hang from wires. Though your standard shot is initially incredibly weak, upgrades that you uncover throughout the game let you increase its power, speed, and charging abilities. By the end of the game, it'll be a respectable weapon, but your subweapons are the stars of the show. The subweapons use the ~battle chip~ concept introduced in the Battle Network series. Battle chips are collectable weapons and support items that you find or purchase during your travels. Some are simple cannons, some have healing abilities or other support functions, and some are summons that cause other navi units to appear, attack, and leave. You can keep 20 chips in rotation at any given time. Certain chips can be combined in very specific ways to form special attacks known as program advances. For example, combining a sword, a wide sword, and a long sword (in that exact order) will give you a life sword attack, which does a hefty 200 points of damage. Chips are enabled on a timer. A meter at the top of the screen slowly fills. When it's full, you can press the Z trigger and choose from up to 10 of your chips. The chips are fed to you at random, so outside of the ability to flag one chip as a default chip that always appears, you never know if you're going to get useful items. This presents the game's most obvious problem. Early on, the game is quite tough. The first two bosses in the game are more difficult than most of the rest of the game's battles, and it's essential that you go into these battles with the right chips selected. This leads to your sitting by the warp pad that leads to the boss fight, waiting for the chip meter to fill over and over again until you can get the proper chips. Sitting on sword and wide sword and rolling the dice until long sword comes up is an extremely frustrating way to spend your time. Once you pass the first two sections, the game opens up and gets a bit easier, but you'll still find yourself occasionally waiting on the right chips to make certain situations easier. Network Transmission has an odd look to it. The backgrounds are all appropriately cyberspace- and computer-themed, and Mega Man animates pretty well. But the art style used in the game, which matches the basic look of the Game Boy Advance Battle Network games, really lacks personality outside of the brief cutscenes that play before boss fights. The standard enemies don't really help the situation, but you will see some classic Mega Man bad guys, such as the ever-popular metool. Weapon effects and the game's summons are also pretty understated. Sitting on sword and wide sword and rolling the dice until long sword comes up is frustrating. The weapon sound effects are equally underdeveloped. The rest of the sound is pretty good, though, and the speech, all of which is in Japanese, fits the characters pretty well. The music is upbeat and matches the lighthearted look and feel of the game and its anime spin-off. While some of the core concepts of Network Transmission are cool--just as they were in the Battle Network series--these things don't translate terribly well to the side-scroller format. Taken as a whole, Mega Man Network Transmission is a potentially fun, but ultimately frustrating, entry in the series, and fans of the Battle Network universe would be much better off sticking with their GBAs."}