{"ref": "https://www.gamespot.com/reviews/mlb-the-show-20-review/1900-6417436/", "date": "March 27, 2020", "game_name": "MLB The Show 20", "text": "MLB The Show 20 suddenly finds itself in an unprecedented position. The COVID-19 coronavirus has disrupted sports across the globe, and baseball is no different, as Opening Day of the 2020 Major League Baseball season was recently postponed for at least the next two months--and even that seems optimistic. It's an unfathomable turn of events, yet it also means Sony San Diego's latest baseball sim is now one of the only ways to experience the 2020 season of America's favorite pastime. It's a good job, then, that MLB 20 maintains the series' consistently high quality. Refinements to fielding and hitting may only be incremental this year, but they add more depth to what is still one of the most compelling sports games on the market, while new additions and modes off the field increase the game's variety as you chart a course towards World Series glory.Fielding and defense received a lot of love in last year's game, so MLB 20 adds a few more wrinkles without rocking the boat too much. The distinction between Gold Glove caliber outfielders and mere mortals is now slightly more pronounced, particularly when the CPU is in control. The best outfielders in the game are much more dialed in this year, reacting to the ball off the bat with authentic accuracy and a dependable first-step. On the flip side, the square peg you've lodged into the round hole in left field might struggle when it comes to reading the flight of the ball, committing a fair few errors over the course of a season as balls careen off the edge of his glove instead of nesting in its palm.There's also a new Extreme Catch Indicator that identifies those bloop singles and hard-sinking line drives that are right on the edge of being catchable. If you have a player like Minnesota Twins center fielder Byron Buxton patrolling the outfield, you might take a chance and attempt a risky diving catch on one of these tough-to-reach balls, knowing full well that he's skilled enough to pull off a spectacular grab. With an average defender hustling towards the ball, however, you might prefer to play it safe and get yourself in position to gather the ball after it bounces. Surrendering a single is a much more positive outcome than laying out for a catch and completely missing the ball, resulting in a triple for the fortunate hitter.Snagging that single might even give you the opportunity to use MLB 20's new Throw Home Indicator. Nailing the small needle in the center of an outfielder's throwing meter will see them launch the ball towards home with as much power and accuracy as they can possibly muster, giving you a greater chance of recording one of those bang-bang plays at home plate. It's a smart, albeit subtle, addition to the game, which is true of all of these improvements to the game's fielding. It's possible you won't even see the Extreme Catch Indicator until 20 games in, but they each add more dynamism to the outfield, and the best defenders may even influence your strategy when stepping into the batter's box, too.When it comes to hitting, the Plate Coverage Indicator (or PCI) has been redesigned in MLB 20 to give you a better idea of the type of hitter you have at the plate and how you should approach their at-bat. When using the default PCI, the outer reticle displays your batter's plate vision, while the inner reticle represents their ability to make contact. Previously, the PCI consisted of an average between these two attributes, so there was some vexing guesswork involved when trying to square up the ball and make solid contact. Splitting these attributes up with seperate reticles illustrates exactly what your hitter's contact and vision are, offering an immediate distinction between good and bad hitters (with each reticle varying in size based on the player's skill), and providing you with better feedback for lining up the PCI in the optimal position.This all ties into the new Perfect/Perfect system that gives you the best possible chance of having a productive at-bat. The first part of this new mechanic is displayed by three dots in the centre of each player's PCI. From top to bottom the dots represent fly balls, line drives, and ground balls. If a player's top dot is bigger than the other two, then you know he excels at launching powerful fly balls into the stratosphere. A bigger bottom dot, meanwhile, means you'll want to try and focus on sending hard-hit ground balls through gaps in the infield. If you manage to line up the PCI so that the ball connects with one of these dots and your swing timing is absolutely perfect, you'll be rewarded with Perfect/Perfect contact and the auditory euphoria that comes from the crack of the bat.This new distinction results in high exit velocities and a significant chance the ball will fall for a hit if it doesn't just wind up in the stands. The redesign of the PCI and the addition of the Perfect/Perfect system adds more layers to MLB 20's batting that rewards you for guessing a pitch's location, having immaculate timing, and playing to each player's strengths. With these new tools at your disposal, you're given more control over the outcome of each at bat. That doesn't mean you're suddenly going to start hitting .500, and you may only execute a Perfect/Perfect hit once or twice each game, but the feedback you're given after every swing of the bat feels more pertinent, and there's a tangible consistency to the way hitting works, with solid contact resulting in hard-hit balls instead of weak lineouts, as was often the case in MLB 19.As for new modes, MLB 20 enhances the Franchise experience with a couple of additions. You now have the ability to add custom teams to your Franchise by replacing a current team with one of your own. You can change the name, design your own uniforms, and select a home venue--whether it's the historic Polo Grounds or the Texas Rangers' brand-spanking-new Globe Life Field. The fact you can't pick the roster means this isn't quite the expansion team mode the community has wanted for years now. It's a small step in the right direction, though, even if the execution is a tad underwhelming. If you opt for a fantasy draft or force some trades, you can somewhat emulate the experience of adding an expansion franchise to the league, but it's not as involved as it could be.The most significant new addition is the inclusion of full Minor League rosters. In the past, the community would create its own custom rosters from scratch, replacing every Joe Random with the top prospects and Double-A veterans from each team's MiLB affiliate. Now these players are included straight out of the box, with real names, accurate stats, and even face scans in some cases. Instead of waiting weeks for the community to come up with the goods, you can now start Franchise mode and have an entire organisation's roster at your disposal from the get-go, including players like Gavin Lux, Wander Franco, and Luis Robert.Elsewhere, Online Leagues make their return in MLB 20. These are customisable one-off seasons that give you a lot of options when it comes to setting up a league with friends. You can even use your Diamond Dynasty rosters, which is a nice addition. The problem is that there are none of the aforementioned Minor League teams to call up players from, nor is there a draft or any sort of free agency. It's a one and done season with no CPU teams--a far cry from the robust Online Franchise mode that was once a part of the season and is still a feature in other sports games. Again, Online Leagues is a small step in the right direction, and it's great being able to play competitively with a group of friends, but one would hope Online Franchise returns in some form in the next iteration of The Show.Diamond Dynasty also received a lot of love last year, so MLB 20 doesn't mess with the formula too much. There's a new Showdown mode that's sort of like a mix between Moments and Battle Royale. You begin by drafting a skeleton crew of players and then play through a series of scenarios that are often based on significant moments in baseball history. You won't know exactly what challenges await, but every playthrough ends in a Showdown against a formidable pitcher, where you're tasked with coming back from a variable deficit before recording 15 outs. Each challenge you complete along the way gives you the opportunity to draft more players to improve your team, unlock special perks, and add runs to your final score in order to reduce the deficit you need to fight back from. It's a fun mode that gives you another way to play Diamond Dynasty, sample some of the best players, and unlock rewards, especially if you don't touch the multiplayer.March to October and Road to the Show have received some similarly minor improvements. The latter still offers the same truncated season experience, only now you can influence your team's roster moves with trades and Minor League call-ups. RTTS, meanwhile, allows player relationships to develop on the field as well as during locker room conversations. Building a rapport with your teammates will unlock useful perks throughout the season, and they now feel more natural. Play as a shortstop, for example, and you're likely to improve your relationship with the first baseman by spraying accurate throws his way. The addition of Minor League players pays dividends in RTTS, too.MLB The Show 20 doesn't make any large strides forward, choosing instead to focus on refining areas that needed improvement from last year. This results in a game that feels more balanced in terms of variety across an assortment of game modes, while the action on the diamond has been tightened up with rewarding consistency and added dynamism that maintains the series' lofty standards. It's the ideal foundation to build upon as the PlayStation 5 looms on the horizon, and with the baseball season suspended for the foreseeable future, MLB 20 goes some way to filling an empty space in our pursuit for escapism."}