{"ref": "https://www.gamespot.com/reviews/nba-shootout-2003-ps2-review/1900-2896042/", "date": "October 29, 2002", "game_name": "NBA ShootOut 2003", "text": "NBA ShootOut 2003 offers an interesting take on the typical franchise (or in this case career) mode, and it gives you quite a bit of freedom in creating dunks and players, but the relatively poor gameplay detracts from any good points the game has. The control scheme, which assigns the right analog stick to perform juke moves (similar to the freestyle system in NBA Live), just isn't responsive enough, causing you to perform juke moves that almost always lead you nowhere. The rebounding is also incredibly poor, and players will often stand still as the ball passes right through their fingers. These problems, as well as others, add up to a less-than-satisfying game of basketball. While other games strive to build an in-depth franchise mode, ShootOut 2003 takes a slightly different approach by focusing on an individual player instead of the team. Upon starting the career mode, you'll be able to customize nearly every aspect of your player, from the name that appears on the back of his jersey to the distance between his eyes. When you're done, you can align your player with any one of the teams in the NBA and then begin your career in the NBA summer league. The summer league gives your player an opportunity to play alongside the benchwarmers of the team you've selected, and it also gives you the chance to exhibit your skills for the team and show them if your player is worthy of playing in the NBA. If you don't get the nod to join the team, you'll be sent to the NBDL, which is the equivalent of a minor league, where you can continue to improve your player's skills. It's an interesting take on the traditional franchise mode found in most basketball games, and it offers a little insight into the life of a player who's not selected in the draft, but ultimately, this mode loses its luster simply because gameplay isn't intriguing enough to keep you toiling in the depths of the NBDL or the summer leagues before you get your shot at the NBA. Perhaps ShootOut's most apparent problem is control. Simply walking or running up the court isn't a problem, but when you want to start using juke moves, control becomes a bigger issue. The right analog stick is used to control a variety of juke moves, such as crossover dribbles, but the problem is that it's incredibly unresponsive. When you want to execute a spin or another similar move, you essentially have to stop and then press the right analog stick in the appropriate direction, only to see your player perform the corresponding move a second or so later. This doesn't make much sense in the grander scheme of the game since juke moves are supposed to be sudden and quick and actually fake the defender out. Occasionally, a defender will bite and go the opposite way, but for the most part, defenders will stay glued to the ball handler, and you'll simply spin or dribble in place. This is especially apparent when the computer has the ball and tries to perform such moves if you play defense up close. There are numerous other issues on the offensive side of the ball that make ShootOut fall well short of the competition. The biggest omission is not being able to pass out of a basic jump shot or a layup, an option that's an integral part of the sport of professional basketball. If you're driving to the hoop and two defenders come down on you to block the shot, you'll want to be able to kick it out to the open man for an open jump shot, but you simply can't do that here. In fact, you'll rarely find an open lane to the basket from the top of the key, but you can run around the court like a chicken with its head cut off until the defender gets caught on one of your teammates, or you can go baseline and drive in from the left or right since the defensive AI seems to have problems protecting that particular route. That won't always guarantee you'll make the shot, though, since players on your team have the tendency to miss shots from 4 to 5 feet out when they're not coming out of a post-up move. It should also be noted that the computer apparently doesn't know what an open lane is--it will simply keep its player standing still even though it has a clear path to the basket. You shouldn't have problems hitting shots from the perimeter. On the default difficulty setting, you can pretty much hit three-pointers all day long by doing a jump fake and then pulling up for an actual shot when the defender gets his feet in the air--that particular problem isn't quite as bad when the difficulty is increased. But if you feel compelled to do so, you can throw the ball into a man on the post and have him go to work. Here you can either pull up for a shot or back down the defender and roll off for a quick layup, but since the latter of the two options almost always results in two points, there shouldn't be much of a decision to make. Defensively, there aren't quite as many fundamental problems, and your players can perform all of the essentials, such as blocking shots and stealing. Indeed, there might even be a slant toward defensive play in ShootOut--you can literally stick onto opposing players by simply sliding back and forth, cutting off any chance of their driving to the basket. But the developers seem to have counterbalanced this by making it nearly impossible for you to block the computer opponent's shot once it gets the ball on the inside. Unlike the players on your team, computer-controlled players seem to be flawless when they get the ball within 5 feet of the basket, so you're better off just trying to defend on the perimeter where you can block numerous shots. On either side of the ball, rebounding is pathetic. Your players will often just stand around the basket and let the ball pass right through their fingers or simply let it get away into the hands of a defender. NBA ShootOut 2003 also has some visual drawbacks. The player models look very blocky, and in some cases the faces don't look even remotely like their real-life counterparts--even some of the marquee players. However, the arenas generally look good, and there's some nice detail on the player benches. The frame rate remains constant throughout the game, but the frame rate is pretty slow to begin with, which doesn't really lend itself well to the fast-paced nature of basketball. It also seems to highlight the jittery animation, which you'll see when players go in for dunks or perform any sort of move that requires a transition into canned animation. You shouldn't be expecting too much from the commentary either, which is partially supplied by former NBA ~great~ Bill Walton. The commentary sounds quite choppy, as if the comments were simply spliced together. Not only do the two commentators repeat themselves often, but they'll also offer some suitably out-of-place comments. For example, if you make a simple pass to an open man on the perimeter for a short jump shot, Walton will chime in with ~that's the greatest pass I have ever seen,~ which is even more ridiculous than something that Walton would say during an actual game. There are some noteworthy features in NBA ShootOut 2003: The career mode may be an interesting diversion for those not looking to take control of nearly every aspect of an NBA team, and the create-a-dunk feature provides an interesting level of customization, even if the interface is clunky. Still, ShootOut needs work, especially with its control system, which is absolutely put to shame by EA's freestyle control scheme for NBA Live 2003. With better options available, NBA ShootOut really isn't worth your time."}