{"ref": "https://www.gamespot.com/reviews/evolution-skateboarding-review/1900-2894756/", "date": "October 15, 2002", "game_name": "Evolution Skateboarding", "text": "Evolution Skateboarding is a dull sequel to Konami's last dull skateboarding game, ESPN X Games Skateboarding. The main difference in this year's edition of the game is that Konami no longer has the ESPN license, so the X Games events from the previous game are nowhere to be found. In their place, the developers have added something completely new to skateboarding games: boss battles. But neither that nor the presence of Konami's most famous character as an unlockable bonus in the game can save Evolution Skateboarding from its awful gameplay. Like every other skateboarding game on the market, Evolution Skateboarding's main mode has you first picking a skater and then moving from level to level, completing level-specific goals as you go, often by performing various tricks. The game contains a handful of pro skaters, including Rick McCrank, Arto Saari, Mark Appleyard, Danny Way, Colin McKay, Stevie Williams, Kerry Getz, and Chris Senn. You can also create your own skater using parts that are unlocked as you play the game. Some hidden skaters are also included, the most notable of which is Metal Gear Solid's Solid Snake, who actually isn't much of a hidden secret, considering there are pictures of him on the back of the box. Actually unlocking Mr. Tactical Espionage Action, however, is easier said than done. The game has a collection of different levels, and some even have multiple configurations, depending on which skater you're using. Each level has the standard set of generic goals, such as performing a multitrick combo, reaching a certain score point, breaking or collecting a series of items, or performing large combos in front of photographers. The levels are pretty dull in design and scope, and many of the goals--specifically the checkpoint goals, which simply ask you to reach a series of checkpoints in a certain order--are poorly designed. The only level really worth mentioning is a skate-enabled version of Metal Gear Solid 2's Big Shell, which has some charming features, such as patrolling CYPHER robots that you must smash before they blast you with their machine guns. The game's boss battles seem promising at first, as they pit your skater against a large foe such as a runaway truck, a tank, or a giant spider. However, they lack any real challenge, merely forcing you to grind on certain parts of the enemy until its life meter is depleted. The biggest offenders in Evolution Skateboarding are the poor control and the sluggish gameplay. Every single skater, regardless of his stats, feels really sluggish. On paper, the control setup looks a lot like the setup in every other game in this genre. But the tricks don't really flow from one to the next like they do in better action sports games. This is partially due to the fact that you have to hold down the triangle button to keep your manual going, making it difficult to transition from the manual to a grind, air, or any other tricks. Additionally, balancing on a rail for any real length of time is next to impossible, as the balance meter will eventually just jam over to one side, ignoring your attempts to counter the shift with the D pad and sending you off the rail. If there's a high point to Evolution Skateboarding, it would be the game's graphics, though even those aren't terribly exciting. The game runs at a solid frame rate, and many of the trick animations are well done. Other tricks, however, look pretty bad, and the levels, skater models, and other in-level items are pretty subpar overall. The game's sound has some strong points--the sounds of skating are well represented, for instance--but all the strong points are washed away by the game's stupid announcer. The announcer will call out the names of tricks as you perform them, go crazy when you execute long combos, and tell you that you are ~beat~ or ~wack~ if you continually fall off your board. The announcer has an extremely limited and incredibly annoying vocabulary, so he repeats the same stupid comments over and over again. The game features Dolby Pro Logic II support, but you wouldn't even notice it unless you saw the logo on the back of the box. In the end, the only thing about Evolution Skateboarding that is remotely appealing is the inclusion of Big Shell and Solid Snake. Considering that both of these items will also apparently be included in the upcoming release of Metal Gear Solid 2: Substance, Metal Gear fans shouldn't bother with Konami's skateboarding game. And, of course, the game is bad enough that fans of action sports games in general shouldn't bother with it, either. There are plenty of better action sports games on the market now, and more are on the way soon, so do yourself a favor and look elsewhere for entertainment."}