{"ref": "https://www.gamespot.com/reviews/ar-tonelico-melody-of-elemia-review/1900-6165576/", "date": "February 7, 2007", "game_name": "Ar tonelico: Melody of Elemia", "text": "Ar tonelico: Melody of Elemia is a conventional role-playing game in most respects, but it strays from the well-worn path of similar RPGs by incorporating elements of the dating sims and visual novels that are immensely popular in Japan. It sounds like a bizarre concept, but in practice it just means that you'll have to sit through a lot of breathy, often nonsensical dialogue and minimally interactive courtship sequences rife with chirpy anime characters and groan-inducing sexual innuendo that could have been written by a staff of excitable 12-year-old boys. Unfortunately, that means that unless you happen to be an excitable 12-year-old boy, you might find a lot of this game to be unbearable. Still, Ar tonelico succeeds in delivering a moderately enjoyable experience due to its likeable characters, lengthy story, and mostly sound role-playing mechanics. It's your job to protect your reyvateil while she sings her magical songs, not unlike the way Kevin Costner 'protects' Whitney Houston in The Bodyguard. Ar tonelico takes place in the world of Sol Ciel, where two separate disasters have destroyed every last trace of a once-great civilization, as well as the earth and sky. All that's left is the Tower of Ar tonelico, which the remaining inhabitants of Sol Ciel must cling to in order to survive. Most of the survivors live on a small floating continent that surrounds the tower, but a powerful group known as the Knights of Elemia inhabit the tower itself, and it's their job to repel attacks from creatures known as viruses in order to save the world from further calamity. As you might expect, one day the tower is attacked by an extra-powerful wave of viruses. Lyner, a young knight, is sent to the continent at the base of the tower to find a magic stone that will save the world from utter ruin. You play the game as Lyner, and it's up to you to adventure through dungeons and towns fighting monsters, recovering treasure, and growing stronger in preparation for the obligatory final confrontation that will determine the fate of the world. You usually visit a town and talk to a few characters who inform you that you need some special item that can be found only in a secret and almost always treacherous place. Being the brave hero, you set out to find the item in question and then return to the town to get the necessary information, item, or permission to continue on your journey. You never have to wonder where you're supposed to go next because you'll receive reminders if you stray from the path, and also because the world consists of a small series of connected dots that represent the game's towns and dungeons, so you usually only ever have a handful of options of where to go anyway. While you're running around in a dungeon or forest or other generic danger zone, you'll be randomly drawn into battles. When this happens the perspective switches to a side view, with your party of up to four characters on the right half of the screen and the enemies on the left half. You take turns based on initiative, and three of your characters can perform standard actions like attacking and using items and skills. The twist is that your fourth character is always a reyvateil. The reyvateil are a race of young girls who have the ability to generate magical energy by singing songs. During battle, it's up to your reyvateil to sit in the back and sing songs. Each reyvateil learns several songs as you progress through the game. Some of the songs inflict major damage on enemies, while other songs protect or heal your party. While your reyvateil is singing her song her magic power is drained, and when she has no more power she'll automatically cast the spell. You can interrupt the song at any point to activate the spell, but the longer you let a spell charge the more powerful it will be. As a result you'll spend most battles just biding your time as your magic charges up, and then unleashing a superpowered spell to wipe out all of your enemies in one swift blow. The songs are all ridiculously overpowered, so there's very little challenge to be found, even in the boss battles. It also takes a long time to resolve each battle, because you end up having to wait forever for your magic to charge up while your other characters use their meager attacks to pick away at enemies and bide time. All those battles do pay off in terms of experience points, though, so your characters will quickly gain levels and become stronger and tougher as you play the game. The reyvateil in your party will also level up, but for a reyvateil to learn new songs you have to ~dive~ into her cosmosphere, which is essentially her subconscious. As you fight alongside a particular reyvateil she gains trust in you, which earns you dive points. When you have talked to your reyvateil enough, you can dive into her at a special shop found in most towns. This is where the dating sim elements come into play. You have to enter the girl's cosmosphere to find out what kind of crazy stuff is going on in her head. In each level of a girl's cosmosphere you'll encounter new people and problems, and you'll resolve all of those problems by spending dive points that you've accumulated. These dive sessions aren't at all interactive beyond pressing a button to advance through the copious amounts of dialogue. There are a few times where you have to choose between a couple of responses, but usually you just read lots and lots of nonsensical conversations until you've cleared the level and can move on. This portion of the game plays like a dating sim in that your objective is to get the girls to care for you so that they'll sing better songs for you. However, there's no challenge here because there's no real game. It's more like watching a visual novel where conversations and events occur without any input from you. That makes these portions of the game rather boring, which is unfortunate because the dive sessions can last for a long time and feature page after page after page of dialogue. As with Gust's Atelier Iris series of role-playing games, Ar tonelico features an extensive item-crafting system. You can purchase or find hundreds of different items, and then learn recipes to combine those items into useable products like weapons and potions. There are more than 300 different items to create in the game, but because there's so little challenge to the game you'll rarely find yourself in need of any items at all. Sure, it might be nice to have a bit stronger sword than the one you currently have, but with your magic taking care of all of your enemies there's no reason to even bother making a new weapon, and it's certainly not worth the time you'll spend running around collecting the required ingredients. If you giggle when this girl asks you to be gentle as you dive into her for the first time, then you'll probably be tickled pink by most of the dialogue in this game. In addition to the item-crafting system, Ar tonelico also borrows its visual presentation from the Atelier Iris games. The characters are all small 2D sprites over a static, but usually nicely painted, background. The sprites are slightly larger and more detailed in battle, and the attack animations in particular are great to see. For some of the higher-level attacks you'll even see some anime sequences that look good and blend surprisingly well with the rest of the game. During dialogue sequences you'll see large, static portraits representing the main characters. This artwork has a very anime look to it, but although the style is derivative, most of the character portraits do look good. The characters also have some speaking lines, which are usually delivered relatively convincingly. Not all of the dialogue is voiced, though, and it can be odd when the voice track suddenly drops off in the middle of a conversation. The soundtrack in Ar tonelico varies wildly, but the music quality is high overall. There are some odd selections, such as the battle theme featuring a vocalist rapping over a fast and highly synthesized beat. Despite some odd musical selections like the battle rap, the soundtrack fits the game very well. Ar tonelico: Melody of Elemia has a charming look and some likeable characters, and it will take you a good 40 hours to complete the lengthy story. Just based on those characteristics this could have been a good, satisfying role-playing game. The problem is that the lengthy courtship sequences will wear on your patience because there's no interaction whatsoever. You'll spend a large portion of your time in this game repeatedly pressing the X button to flip through one nonsensical conversation after another. If you go into this game expecting an epic quest full of challenging battles and extensive exploration you'll be sorely disappointed. But if you're looking for something more lighthearted and character-focused than the usual role-playing game, you'll find plenty to like about Ar tonelico."}