{"ref": "https://www.gamespot.com/reviews/top-spin-2-review/1900-6167347/", "date": "March 14, 2007", "game_name": "Top Spin 2", "text": "PAM Development delivered a high-quality game of tennis when it originally brought Top Spin 2 to the Xbox 360 a year ago. It wasn't particularly revolutionary, but it offered a flexible character creation system, a playful career mode, first-rate production values, and most importantly, some of the sharpest, most nuanced tennis action to be found anywhere. Aspyr has now brought Top Spin 2 to the PC, and although most of what made the Xbox 360 version great remains applicable here, the passing of time and some sloppiness in the translation make it a less impressive package all around. Those weaned on Virtua Tennis may have to adjust to Top Spin 2's more technical style. First off, you should know that this is a game that simply demands you play it with a gamepad, and unsurprisingly, the Xbox 360 controller proves to be ideal. This necessity is driven by the fact that Top Spin has always offered a slightly more technical game of tennis than Sega's standard-bearing Virtua Tennis franchise, though it's still quite easy to pick up. You've got four basic swings, including the aptly named safe swing, which will never go out of bounds, though the other three shot types require a bit more finesse to keep inside the lines. The slice shot flies low and fast and is great for crossing up your opponent; the topspin shot flies straight and bounces high but moves fast and can slip right past opponents who aren't on their toes; and the lob shot, which should be used sparingly, can be very potent against aggressive opponents apt to ride the net. While the four basic shot types can be used at any time, eight additional swings require some portion of your momentum meter. Momentum is gained and lost naturally as you score points and are scored on and can be used for either risk shots, which take up big chunks of your momentum, or advanced shots, which eat up a more modest amount of momentum. The advanced shots are high-powered versions of your standard swings. Risk shots are even more powerful, but as the name suggests, they're rather risky, too. Holding down the assigned modifier button before you start a swing will bring up a rising power meter, which you need to stop right at the top. If your timing is off, you'll botch the shot and likely give your opponent the upper hand. If you nail it, the ball moves hard and fast and can be difficult to return. As potent as they can be, though, risk shots are usually worth taking only during your first serve, when you have a free pass to hit the net. Otherwise, the stakes are too high, and it's prohibitively difficult to keep an eye on the meter and your opponent while also keeping your player in motion in the middle of the match. While the risk shots still don't have an optimal risk-to-reward ratio, they've been refined a bit since the first Top Spin, and they don't have any ill effect on the rest of the gameplay, which is consistently responsive and, thanks to some aggressive and skilled artificial intelligence, regularly quite intense. Digesting all of the tennis jargon in Top Spin 2 can be a bit much if you don't know the sport, and hopping right into the game's exhibition or tournament modes may give you a bit of a rocky start. It's best, then, that you go into the game's career mode, which does a fine job of casually acclimating you to the nuances of the gameplay as you play. Before you start mastering your smokin'-fast ace serves and humiliating dump shots, though, you'll have to create your own custom tennis pro. In addition to offering basics like gender, age, and nationality, the character creation system in Top Spin 2 gives you rather impressive control over the facial features and physical build of your player and is almost comparable to the character creation system found in 2K Games' The Elder Scrolls IV: Oblivion--though, as far as we could tell, there's no option to create a crazy magic-adept lizard-man tennis pro in Top Spin 2. Maybe next year! There's kind of an ~uncanny valley~ thing going on with the facial features. The skin tones often have flat, mannequinlike sheens to them, but the player models still feature a good amount of realistic detail. Despite the support of higher screen resolutions, it can be tougher to make the tennis pro you want in the PC version, as the work-in-progress model you're shown during the creation process is blurry and indistinct, making some of the finer details hard to make out. It's odd, because once you're actually in the game everything is crisp and clear. The animation has also suffered in the translation. There's still some nice subtlety to the players' movements, but the smoothness of the Xbox 360 version has been replaced by erratic choppiness. This isn't just a minor aesthetic problem, as it can affect the timing of the gameplay as well. The players themselves look good, but the animations can look choppy. Once your player is created and dolled up in some appropriately fresh gear from major tennis apparel companies like Adidas, Nike, Wilson, and Lacoste, you'll start your career at the bottom of the barrel with a rank of 200 and a low-level sponsorship. Your goals over the course of your career are to build up your player's skills, rise in the ranks, and rake in an obscene amount of coin. The game progresses a week at a time, and each week has room for one training event, one tournament event, and one special event. The training events should be your primary concern when you first start off--you won't qualify for most of the tournaments when you first start anyways, and even if you did, the competition will more than likely eat you alive. Training is handled much the same as in the original Top Spin, and the Virtua Tennis games before that, turning the tennis court into the stage for a series of skill-building minigames. Sometimes your task is as simple as hitting specific spots on the court a number of times, but more often than not, you'll be hitting balls into rows of giant dominoes, bowling balls, gigantic tennis balls, and towering walls made out of translucent bricks. The variety of training games you'll encounter over the course of your career has increased since the first Top Spin, and it's a change that helps make the career mode here much more compelling--while training has been a little tedious in the past, the variety and the novelty of the minigames here makes training something to look forward to. Successfully completing a training event nets you stars that you can apply to up to three of the 11 different attributes, techniques, and skills that define your player's performance. But training events cost money. Eventually you'll run out of money, and the only way to get back into the black is to participate in and win tournaments. You'll start off competing in minor regional tournaments, which are often held in extremely inauspicious locales such as community centers or outdoor public courts, and go all the way up to centre court at Wimbledon. Aside from the distraction of stands filled with thousands of tennis fans watching you during a grand slam event, you'll find that the kind of surface you're playing on will affect the speed of the game. There are subtle atmospheric differences between the courts, too, such as the casual poolside chatter you'll hear when playing at a Mediterranean resort, the international announcers you'll hear at different venues, the way tennis shoes will squeak across a hardwood floor, or the way a player's grunt will echo in a large stadium (it's just too bad that there isn't a greater variety of grunt sounds). Additionally, no matter where you go, you'll be treated to the same generic rock and hip-hop Muzak over and over again. Despite some technical problems and unfortunate camera angles, Top Spin 2 is a good-looking tennis game. Winning or even placing well in a tournament will increase your rank, which will in turn open up bigger and better tournaments to you and will also garner you invites to special events. Before you know it, you'll be playing for your country in special international events, getting invitations to play in private matches for the amusement of wealthy bon vivants, putting on exhibition matches for your incredibly grateful sponsors, and trading barbs with rival players. The career mode goes on for years and years, and if you chose to play every last match yourself, it could take that long to finish it. Taking a cue from the lengthy career/dynasty/franchise modes found in nearly any other serious professional-sport game, Top Spin 2 will regularly let you simulate your matches, and it does it on a surprisingly granular level. You can choose to simulate an entire tournament, all the way down to a single game. So, if you want to step onto the court only when it looks like you might lose otherwise, Top Spin 2 makes it possible. If you'd rather not invest yourself in the career mode, or you'd rather play against someone with a pulse, Top Spin 2 has several options for you. Exhibition matches are available from the main menu, and you can choose both your player and your opponent from dozens of today's hottest tennis stars, including current top-ranked players like Roger Federer, Andy Roddick, Maria Sharapova, and Lindsay Davenport. You can also build your own custom tournament, which lets you choose the number of both real and AI players involved, the venue, and the name of the event. Both the exhibition and tournament modes allow for multiplayer action, though Top Spin 2 also features some multiplayer-only modes. The party games are somewhat similar to the training minigames in that they put a wild spin on conventional tennis. Time bomb sees you trying to score points to slow down your own countdown clock; wall breaker challenges you to knock down your opponent's wall of boxes while protecting your own; and splash court covers portions of the court in paint whenever a point is scored. Additionally, Top Spin 2 includes online support for up to four players, though the match options are pretty bland and include only the most basic match types. Also, you can play online ranked matches only with a custom tennis pro, which means you'll have to spend a lot of time in the career mode if you intend to compete seriously online. The online play in Top Spin 2 could and should have been much more fleshed out. Top Spin 2 all but requires a gamepad to play right. While it didn't do a lot of technical grandstanding, Top Spin 2 was a sharp-looking game when it appeared last year on the Xbox 360, and all told it still holds up pretty nicely on the PC a year later, though we did experience some strange texture dropout issues. Player portraits would disappear, player clothing would appear as black, and in the strangest occurrence, entire player models would lack any texture at all, making them look as if they just fell out of an iPod ad. The most egregious problem with the presentation also happens to be one of the most basic, and is carried over from the Xbox 360 version. When you're playing solo, rather than being able to keep your player on the side of the court closest to the camera, you'll regularly find yourself on the far side of the court, which presents some frustrating perspective issues. Your only option is to switch to the zoom camera, which is lower and closer to the player. It can take some getting used to, but it's definitely preferable to playing on the back side of the court. Technical hiccups aside, Top Spin 2 for the PC is still a good game of tennis, and its $19.99 price tag makes it that much more attractive. But it definitely has its flaws, the majority of which are so head-shakingly clear-cut it's hard to understand how they made it into a product that is otherwise pretty well thought out. If you haven't cared for tennis games in the past, Top Spin 2 won't change your mind, but if you enjoy the genre, you'll be hard-pressed to find much better on the PC. But training events cost money. Eventually you'll run out of money, and the only way to get back into the black is to participate in and win tournaments. You'll start off competing in minor regional tournaments, which are often held in extremely inauspicious locales such as community centers or outdoor public courts, and go all the way up to centre court at Wimbledon. Aside from the distraction of stands filled with thousands of tennis fans watching you during a grand slam event, you'll find that the kind of surface you're playing on will affect the speed of the game. There are subtle atmospheric differences between the courts, too, such as the casual poolside chatter you'll hear when playing at a Mediterranean resort, the international announcers you'll hear at different venues, the way tennis shoes will squeak across a hardwood floor, or the way a player's grunt will echo in a large stadium (it's just too bad that there isn't a greater variety of grunt sounds). Additionally, no matter where you go, you'll be treated to the same generic rock and hip-hop Muzak over and over again. Despite some technical problems and unfortunate camera angles, Top Spin 2 is a good-looking tennis game. Winning or even placing well in a tournament will increase your rank, which will in turn open up bigger and better tournaments to you and will also garner you invites to special events. Before you know it, you'll be playing for your country in special international events, getting invitations to play in private matches for the amusement of wealthy bon vivants, putting on exhibition matches for your incredibly grateful sponsors, and trading barbs with rival players. The career mode goes on for years and years, and if you chose to play every last match yourself, it could take that long to finish it. Taking a cue from the lengthy career/dynasty/franchise modes found in nearly any other serious professional-sport game, Top Spin 2 will regularly let you simulate your matches, and it does it on a surprisingly granular level. You can choose to simulate an entire tournament, all the way down to a single game. So, if you want to step onto the court only when it looks like you might lose otherwise, Top Spin 2 makes it possible. If you'd rather not invest yourself in the career mode, or you'd rather play against someone with a pulse, Top Spin 2 has several options for you. Exhibition matches are available from the main menu, and you can choose both your player and your opponent from dozens of today's hottest tennis stars, including current top-ranked players like Roger Federer, Andy Roddick, Maria Sharapova, and Lindsay Davenport. You can also build your own custom tournament, which lets you choose the number of both real and AI players involved, the venue, and the name of the event. Both the exhibition and tournament modes allow for multiplayer action, though Top Spin 2 also features some multiplayer-only modes. The party games are somewhat similar to the training minigames in that they put a wild spin on conventional tennis. Time bomb sees you trying to score points to slow down your own countdown clock; wall breaker challenges you to knock down your opponent's wall of boxes while protecting your own; and splash court covers portions of the court in paint whenever a point is scored. Additionally, Top Spin 2 includes online support for up to four players, though the match options are pretty bland and include only the most basic match types. Also, you can play online ranked matches only with a custom tennis pro, which means you'll have to spend a lot of time in the career mode if you intend to compete seriously online. The online play in Top Spin 2 could and should have been much more fleshed out. Top Spin 2 all but requires a gamepad to play right. While it didn't do a lot of technical grandstanding, Top Spin 2 was a sharp-looking game when it appeared last year on the Xbox 360, and all told it still holds up pretty nicely on the PC a year later, though we did experience some strange texture dropout issues. Player portraits would disappear, player clothing would appear as black, and in the strangest occurrence, entire player models would lack any texture at all, making them look as if they just fell out of an iPod ad. The most egregious problem with the presentation also happens to be one of the most basic, and is carried over from the Xbox 360 version. When you're playing solo, rather than being able to keep your player on the side of the court closest to the camera, you'll regularly find yourself on the far side of the court, which presents some frustrating perspective issues. Your only option is to switch to the zoom camera, which is lower and closer to the player. It can take some getting used to, but it's definitely preferable to playing on the back side of the court. Technical hiccups aside, Top Spin 2 for the PC is still a good game of tennis, and its $19.99 price tag makes it that much more attractive. But it definitely has its flaws, the majority of which are so head-shakingly clear-cut it's hard to understand how they made it into a product that is otherwise pretty well thought out. If you haven't cared for tennis games in the past, Top Spin 2 won't change your mind, but if you enjoy the genre, you'll be hard-pressed to find much better on the PC."}