{"ref": "https://www.gamespot.com/reviews/phantasy-star-collection-import-review/1900-2534036/", "date": "May 2, 2000", "game_name": "Phantasy Star Collection", "text": "The Phantasy Star saga has always been one of the most hallowed series of RPGs ever to grace a home console. Many consider it the only other RPGs series in the same class as Final Fantasy. Whatever your opinion, the most commonly accepted theory, however, is how unfortunate it was that there was never a new episode developed specifically for the Saturn. A fact that remains true to this day. The only game even remotely associated with the Phantasy Star legacy, on Saturn, was Terra Phantastica, which, while having nothing to do with the Phantasy Star games, was an RPG developed by the old PS team. Sega of Japan apparently recognized the value of the series to its fans, and decided to bring all four together in one tidy compilation: Sega Ages - Phantasy Star Collection.While the Phantasy Star series' strength has always been its character development and storyline, it also had a fair share of innovations to offer during its time. In a pre-cursor to today's deluge of first-person shooters and RPGs like Quake, Shining the Holy Ark, and King's Field, Phantasy Star 1 featured perhaps some of the earliest gameplay of this kind. No small feat during the early 8-bit days of Sega's Master System. Originally released in 1988, with more than three worlds to explore, the debut of Phantasy Star at that time was nothing less than stunning. The next year followed with Phantasy Star II for the Genesis, and while the 3D caves were replaced with a traditional overhead view, Part II is considered by many to be the most challenging of the series. Two years later Sega released Phantasy Star III: Generations of Doom. What was interesting about this game was that once you finished your first quest you would choose a spouse for your character. Depending on your selection you would then embark on a separate adventure. Up to seven different quests were available as well as four different endings. Unfortunately the graphics weren't quite up to snuff, and the combat scenes were disappointing as well. The apex of the series, Phantasy Star IV: The End of the Millennium, was enthusiastically received by fans of the series. The story was detailed and lengthy, and the graphics were quite good as well. Each character could learn additional techniques in addition to his/her usual skills. The worlds were huge and offered a lot of exploration. The only drawback people found with this game was that it was a little too easy to complete.As far as graphics are concerned, everything has been ported exactly from the old Master System and Genesis games. There have been no enhancements and nothing has been lost. Although, for some strange reason Part 1 is completely framed on all sides by a decorative border. A strange detail that some might find perplexing. Otherwise, as long as you know what to expect, the game is essentially the same. The music is the same old PCM that graced the original versions, and the only added feature in this collection has been loading time.For the completist, Phantasy Star Collection provides considerable value. All four games come complete on one disc, and the set comes packaged in a cardboard slipcase, complete with a fold-out map and a softcover book chronicling the Phantasy Star series in full. On the disc itself, aside from the four original games, is enough Phantasy Star memorabilia to make any true fan weep tears of joy. Every piece of artwork ever drawn for the Phantasy Star games is included here-conceptual art, character illustrations, original covers, etc. In all, there are over 200 illustrations to peruse at your leisure. Also included on the disc (a la Sonic Jam), is every Phantasy Star commercial ever filmed (or at least, the Japanese ones), making this perhaps the most complete collection anyone could have hoped for.Unfortunately, while fans of the series would undoubtedly love to get their hands on this ambitiously packaged set, they will likely be the only ones. In an era where eye-catching graphics are the order of the day, few people are likely to turn their heads to take notice of some old 8-bit and 16-bit RPG's, no matter how good they are. Coupled with the knowledge that even fewer are going to be able to understand what's going on due to the game being entirely in Japanese, and you've got a tough sell on your hands. But, until Sega completes the oft-rumored Phantasy Star V for Dreamcast, this will most certainly have to do."}