{"ref": "https://www.gamespot.com/reviews/vietcong-purple-haze-review/1900-6107940/", "date": "September 23, 2004", "game_name": "Vietcong: Purple Haze", "text": "On the PC, where it was released in March, Vietcong: Purple Haze was simply the original Vietcong packaged with the Fist Alpha expansion. You might expect, then, that the console version of Purple Haze would be a more or less straight conversion of the PC original. Instead, Pteredon's seminal Vietnam-War-themed first-person shooter has been thoroughly retooled by a different design team. Though a few of the changes are constructive, the new developer, Coyote, has generally made a mess of what used to be a good game. For some reason, the single-player HUD includes your connection status to Xbox Live, a fact that has nothing to do with the single-player game. Someday somebody on the Internet will undertake an exhaustive study of exactly what's different between the console and PC versions of Purple Haze. Until then, here's one good example: The original Vietcong includes a mission in which you must defend the barbed-wire wall that surrounds your base camp against waves of attacking VC. The level layout consists of four mounted machine-gun bunkers, each connected by a defensive trench. Each of the four guns is manned by a computer-controlled teammate, and the trenches are filled with friendly soldiers. You must run up and down the trench system in an attempt to staunch the flow of VC as they press ever closer to--and eventually into--your team's entrenched position. On the surface, the console version of this level is similar. You're still defending your base, only now there are three bunkers instead of four. The mounted gun in the middle bunker is now unmanned, and it's clear that you're meant to operate it because the weapon you're assigned for the mission is a grenade launcher without much ammo (in the PC version, the default weapon is an M16). Because of the missing bunker and the subsequently missing trench section, the middle gun emplacement has a clear field of fire across the entire battlefield. This seemingly small change turns what was a furious firefight spent running up and down the trenches into a simple matter of standing in one place and shooting the VC as they occasionally pop up and creep toward your position. In fact, unless you stop firing altogether, your computer-controlled teammates will never even need to squeeze off a shot. A pitched battle has been converted into a lifeless turkey shoot. Some levels have been removed altogether. Whereas Purple Haze for the PC contained 38 levels, the console version has only 19. Some of the deletions are actually for the better. All traces of the original's universally reviled tunnel and stealth missions are now gone. However, some good missions, such as every single on-rails shooting level, are missing as well. Gone too are sections of many levels that contained scripted interactions with both friendly soldiers and Vietnamese villagers. What's left is Vietcong stripped to its bare essentials. You progress through a series of firefights, usually accompanied by a computer-controlled squad of grunts. You can issue simple orders to your companions, and each squad member has a specialty. The medic can heal you, the engineer provides ammo, and the point man will lead the way through the level, looking for both enemies and traps. The point man appears to be somewhat less sure-footed than he was on the PC. He'll often wander back and forth for a while, bouncing off objects and other soldiers before finally deciding which way to go. It's aggravating enough--and the levels are linear enough--that you'll usually just run ahead, find some cover, and engage the enemy alone while you wait for everybody else to catch up. The graphics that weren't especially notable a year ago on the PC haven't been improved and aren't aging well. Though the textures are nice enough, the level geometry is cramped and simplistic. The impassable sections of jungle are often represented by solid walls painted with a thick patchwork of fern. Virtually every environment that featured a wide-open area has been cut. That said, the unmemorable visuals more or less get the job done. Thick, sprite-based foliage obscures enemies, who, while not terribly smart, put up a pretty good fight. They're usually able to find cover and stick to it. Many of the game's numerous weapons aren't terribly accurate, so firefights are often a satisfying matter of finding cover and then poking your head out to shoot at similarly entrenched enemies. Covering fire from your squad also provides the opportunity to flank VC positions and surprise them at close range. Cover is so integral to the game that it includes an iron-sight aiming mode that automatically pokes your head just over any low-enough object that you're hiding behind. It's a neat little feature that should become a genre standard. The original US version of the Vietcong was censored so that it could achieve a Teen rating. This updated Xbox release, however, is based on the original European version of the game, which essentially translates into more swearing, including lots of instances in which the ~F~ word is used in reference to people's mothers. As a result of this, the game now has a Mature rating, but not for any extra violence than what's typical in a shooter. After putting in the six or so hours required to finish the campaign, you're left with a single-player skirmish mode that lets you set up battles between teams of US soldiers and VC. There's also a set of Xbox Live modes. Up to 10 players can participate in six different game types across nine maps. The game modes include standard deathmatch, team deathmatch, and capture the flag. There's also something called assault team game, which is a round-based, one-death-and-you're-out Counter-Strike derivative, and real war, a straightforward capture-and-hold game with three capture points. Three of the maps support a cooperative version of the single-player mission for up to six people. The ruined and soon-to-be-infamous defend-the-base level. The thick jungle setting featured in most of the maps combined with the necessity of utilizing cover inspires a slower-paced, cat-and-mouse style of gameplay. It also turns many of the maps into nothing more than sniping contests. Still, even if the online game isn't especially pretty or deep, it is technically solid and entertaining in short bursts. It's also the best part of Purple Haze, though, like the single player campaign, it's a stripped down version of the PC original, which featured twice as many maps, bigger teams, and a couple more game types. The soundtrack contains four period songs by the original artists and is padded out by a bunch of bad period-sounding music by completely unknown modern bands. This pretty much sums up the Purple Haze experience--a little of the original magic diluted with a healthy dose of junk."}