{"ref": "https://www.gamespot.com/reviews/cities-skylines-snowfall-review/1900-6416386/", "date": "March 21, 2016", "game_name": "Cities: Skylines", "text": "The latest expansion to Cities: Skylines--a world building sim in the style of classic Sim City games--brings all of the unique challenges of winter weather to the desktops of virtual mayors. Nearly every conceivable snow-related issue has been packed in here except for irate residents furious about snowplows blocking in their driveways. As a real mayor in a Canadian city who deals with this sort of thing for a good four months every year, Im not complaining.With all that said, there are some limitations here. The biggest issue for me is that Snowfall is pretty much an all-or-nothing proposition. Virtually all of the new winter features are confined to the three new maps: Snowy Coast, Icy Islands, and Frosty Rivers. Each map is all winter, all the time, with so much icy precipitation that you might as well be stuck inside a snow globe. That certainly underlines the wintry focus of this add-on, but it also makes everything a tad simplistic. Progression through the seasons would have been a nice touch, as would the option to play around with the intensity of the winter weather. As it is, youre either tackling Old Man Winter 24/7 or youre off to the original game in a map with green grass and sunshine.Even with its single-minded design, Snowfall offers a fresh spin on Cities: Skylines. The look of the game is very different. The snowfall is idyllic, and it adds a lot of atmosphere to cities as it falls during the near-constant storms. It gives the game a facelift even though repetition remains something of an annoyance whenever you want to take an up-close-and-personal look at your burgeoning metropolis from street level.Gameplay has been tweaked in a handful of notable ways to emphasize the colder weather, too. The most prominent example of this is the new gauge at the bottom of the screen that tracks some pretty frigid temps, far below the point of freezing. Snow quickly accumulates on the streets, necessitating the construction of plows that patrol the roads and a place where all that excess white stuff can be piled. And, of course, the icy conditions also make it vital to heat homes and businesses. Standard water/sewer pipes must now be upgraded with heating pipes that carry warmth to citizens from boiler stations and geothermal power plants.Adding in the possibility of a winter disaster, like a city-crippling blizzard or a freezing-rain storm that brought down power for an extended period of time, would have made heating homes and businesses a lot tougher. An opportunity missed.Both features add complexity to city planning, but not much in the way of difficulty. I endured life without snow removal for a while at the start of my first game as I couldnt find it in the interface (its obscured in the roads menu instead of tucked in where it should be alongside other public works features like the landfill site), and the impact on my streets wasn't noticeable. Maybe some cars were slipping and sliding, but if so, nobody complained about it. I didnt pick up on any problems with transit, people getting to and from work, or even old people slipping and falling on the snow and ice that was clearly building up on the roads and sidewalks. A snowflake icon even tells you when its time to call out the plows.Setting up a heating system was a snap. I have to admit I was expecting more of a challenge here, especially given how heating demands more electrical use at the start of a map. But the boilers and geothermal systems were unlocked when I hit just 2,000 residents, so that a strain on my electrical grid was never a problem. Adding in the possibility of a winter disaster, like a city-crippling blizzard or a freezing-rain storm that brought down power for an extended period of time, would have made heating homes and businesses a lot tougher. An opportunity missed.Snowfalls winter theme is complemented by a selection of new buildings and parks, as well as the addition of trams to the range of other transit options already on offer. All add kind of a winter carnival atmosphere to Cities in that you can build neighborhood skating rinks, snowmobile tracks, parks centered on frozen water fountains, saunas, ski resorts, and even Santa Clauss Workshop. Many are hobbled by strange and unnecessary prerequisites, however. Why you need to load up a snow dump to build a ski resort or crank out 20 tram lines to set up Santa Claus and his elves is anybodys guess. A few new policies are also available for the winter weather, although not much bears on your city-building philosophies. Mandating winter tires and tougher building insulation standards add some flavor without making any serious impact on the bottom line.With the addition of Snowfall on top of the After Dark expansion released last fall, Cities: Skylines is starting to take shape as an expansive city-building franchise that offers something for any wannabe mayor. One caveat here is that you dont really get a tremendous amount of content, and that what's present is pretty much relegated in specific maps, leaving the impact of this expansion on the overall game fairly minimal. That said, the winter wonderland atmosphere does freshen up the visuals so even while this expansion is not essential, spending a little time in a virtual snow globe city remains awfully appealing."}