{"ref": "https://www.gamespot.com/reviews/drome-racers-review/1900-2909321/", "date": "January 22, 2003", "game_name": "Drome Racers", "text": "It's hard to say exactly when Legos started copping an attitude. Regardless of when it happened, though, there's no question that the Lego people have worked tirelessly to create an edgy image for their brand of interlocking toy building blocks. If you're looking for proof, look no further than Drome Racers, a futuristic racing game that uses actual Lego Racer-brand car designs. Why, exactly, Drome Racers came to be isn't quite clear, but one thing is for certain: Whether you fondly recall building little medieval castles and moon bases with your Legos, or this is your first exposure to the brand, Drome Racers probably won't leave you with a very glowing opinion of futuristic racing games or the Lego brand. Developer ATD obviously did its homework and played plenty of Wipeout, and perhaps some off-road racing games, as Drome Racers features all the trappings of your average futuristic racer, with a couple of dirt tracks thrown in for good measure. As is expected from the genre, you're presented with a career mode consisting of increasingly difficult racing leagues. The game also throws in the occasional challenge, in which you'll face a single opponent in a one-off race. Another curious deviation from the futuristic racer formula is the qualifying drag race. Before each set of races, you're given the chance to improve your starting position through a series of drag races. Though, if you already have a good starting position, or you just don't care, the qualifying races are entirely optional. Your standard race usually goes three laps, and each track is chock-full of speed-boosting pads, health pick-ups, and offensive power-ups. The offensive power-ups appear in the form of a floating red orb, and most of the weapons are pretty standard stuff. You'll get mines, guided and unguided missiles, and so on. There are some unique power-ups, like the flare attack, which blinds your opponents for a few seconds, or the repulsor, which turns your car into a hovercraft, giving you better speed and handling, but even with these unique touches, Drome Racers just feels like it's going through the motions. What little originality it has, like the qualifying drag races, is seriously underplayed, and most of the experience comes off as generic. It would have been nice to say that the uninspired design and presentation of Drome Racers are offset by some superbly executed gameplay, but such is not the case. The races alternate between off-road and paved races, but all the cars have some oversteer and are consistently squirrelly from the start. Though you can improve the attributes of your car as you progress through the career mode, the impact of these improvements is modest. Also, it seems that the collision detection always favors your opponent, because whether you're getting nudged or are the one doing the nudging, you'll more often than not find yourself with your grill kissing the wall. The core gameplay is summarily unenjoyable, and you'll probably find yourself going through the qualifying drag races simply because they add a touch of variety. The game looks a bit better than it plays, though its overall visual style definitely cribs from the countless other futuristic racers before it, applying a thin layer of quasi-futuristic style to the typical desert canyon, snowy mountain, and cityscape levels. More care has been taken with the cars, which look nearly identical to their real-world Lego counterparts. Save for the occasional hiccup in the frame rate, which rarely impacts the actual gameplay, Drome Racers actually looks fairly decent, despite its deficit of originality. The sound is an appropriate blend of futuristic-sounding vehicle noises and a spacey, electronic soundtrack, and it does a nice job of setting the mood. There's some pretty passionless, by-the-books voice acting in between races, but it's brief and relatively inoffensive. So, Drome Racers is a futuristic racing game of middling quality that, for some inexplicable reason, carries the Lego license. If you're drawn to this title because of the Lego name, just know that there are better futuristic racing experiences to be had. If you're a fan of futuristic racers, there's probably nothing here to enjoy that you haven't already wrung out of better game."}