{"ref": "https://www.gamespot.com/reviews/madden-21-review-feels-more-like-an-update/1900-6417550/", "date": "September 1, 2020", "game_name": "Madden NFL 21", "text": "Madden NFL 21 is a tale of two games, really. It introduces The Yard, the best new Madden game mode in more than a decade, situating itself nicely alongside the breezy and fun Superstar KO mode that arrived last year. But outside of these exciting inclusions that are well-suited for short sessions, Madden NFL 21 feels all too familiar, even for an annual sports sim. The tentpole modes that require a deep investment haven't received meaningful updates, and the on-the-field gameplay doesn't do much to move the series forward and is hampered by surprising technical issues.EA Sports has done well as of late with recognizing that not every player wants to sink a dizzying number of hours into Franchise or Ultimate Team. With Madden NFL 20, EA added Superstar KO, a sudden death overtime mode where each player gets one possession. It returns in Madden NFL 21 largely unchanged, retaining its excellent high-stakes matches. With Madden NFL 21, EA has added a second casual game mode that is even better than Superstar KO.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Madden NFL 21 Video ReviewThe Yard is easily the most over-the-top game mode to ever appear in Madden. Inspired by backyard football, teams of six compete on an 80-yard field, getting three possessions each to try and score. You can play against the computer, team up with one or two friends, or see how you stack up online against other players. While it doesn't feature NFL Blitz-esque hits, you can get really imaginative with the stripped-down playbooks. You're allowed to throw unlimited forward passes behind the line of scrimmage, and many of the plays are set up to encourage this. Adding to this mechanic is the ability to snap the ball to any of your teammates. The Yard hinges on extravagant plays, as it requires you to move the ball 20 yards for a first down. Due to the limited number of blockers, there's a delay before the defense can pass the line of scrimmage.Where things really get interesting is the scoring system. After scoring a touchdown, you can choose to go for one-, two-, or three-point conversions, which require you to score from different yard lines. There's a risk-reward element in play here, as you can lose by a decent margin even if you score three touchdowns. Bonus points are rewarded for passing the ball multiple times on a scoring play. The basic setup and chaotic variables in play create some of the most thrilling Madden moments I've ever experienced, and games typically only last around 20 minutes or less. It's both brief and delightful, making it the antithesis of Madden's long-running Ultimate Team mode.Unfortunately, Madden NFL 21 begins to show its blemishes in the familiar modes. Franchise, once again, hasn't received any noticeable improvements. It still gives you the opportunity to manage every aspect of your team over the course of many NFL seasons, but it's essentially the same loop that's been in place for the past few years, giving little reason to upgrade if you primarily play Franchise. This is particularly disappointing because The Yard and Superstar KO show that it's possible to rework the best aspects of Madden to create an experience that's fresh and exciting again.Face of the Franchise: Rise to Fame, the single-player story mode, is the worst part of the package by far. EA Sports hit its stride with Madden NFL 18's Longshot, thanks to a surprisingly moving cinematic story. Since then, the story mode has been altered significantly to give players more time on the sticks and less time watching cutscenes. This year's iteration of Face of the Franchise attempts to reintroduce more narrative after last year's lackluster Face of the Franchise: QB1.It doesn't work--at all. Rise to Fame is set up as flashbacks told to a reporter back at the high school where your legendary journey began. Of course, there's a stereotypical brash starting QB named Tommy who gives you a hard time. Quickly, it's revealed that the starter has a health condition that he's been hiding, which thrusts you into the limelight in the second half of a game.After playing a few games in high school, you pick to play at one of 10 NCAA programs, and your rival-turned-wide-receiver joins you. It flashes forward to your junior year when you're told by the coach that you'll split time as quarterback with your frenemy--yes, he wants to play QB again--in the upcoming season. The problem here is that your play on the field really doesn't matter at all. Despite winning in blowout fashion in the two collegiate games I started, all of the cutscenes mentioned how the team was struggling. Even after winning the College Football Playoff semifinal in dominant fashion, I was benched in the first half of the National Title game for Tommy. The story only gets more ridiculous from there, but quickly leads you to the NFL, where it starts to play out more in the fashion of the traditional Franchise mode.It's nice that Madden has continued its focus on narrative modes that mirror offerings in NBA 2K and MLB The Show, but Rise to Fame entirely misses the mark. Unless you really want to guide a player with your name to the Hall of Fame, it's not worth checking out--you're far better off jumping straight into the normal Franchise mode. Groan-inducing writing, stiff animations, and a disjointed story arc make Rise to Fame every bit as lackluster as last year. Since there's more of it here, it's actually even more disenchanting.The card-collecting Ultimate Team mode doesn't fare any better than Franchise when it comes to new features. At this point, EA has added so many superfluous details that half the time it feels like you're playing a tedious management sim rather than a football game. It also doesn't help that Ultimate Team remains steadfastly committed to microtransactions, which puts players who don't feel like spending money on digital cards at a disadvantage.Though Ultimate Team has a long list of solo challenges that introduce you to the basics, they're all relatively bland. Rather than emphasizing the mostly solid on-the-field simulation gameplay, Ultimate Team demands that you spend an inordinate amount of time in the menus micromanaging a growing collection of players with attributes that are often quite lower than reality. To get them closer to their real-life counterparts, you have to sink a dizzying number of hours into the mode, much of it spent completing mundane tasks and playing online against those who sometimes buy their way to a good team.While there's much to do in Ultimate Team whether you play solo against the CPU or online, nothing here moves MUT in a positive direction. Assembling and modifying your team is a monotonous task that forces you to examine a slew of different attributes in addition to a player's overall rating to compose the best team possible. It's certainly deep and filled with customization, but now more than ever, the dullness of it all is much more apparent.Despite its shortcomings in the most prominent game modes, Madden NFL 21 still offers better on-the-field gameplay than in previous years--most of the time. The biggest change I noticed came with run defense. Last year, the run game was far too challenging to stop, but this time CPU defenders smartly fill gaps and notice ball carriers more often while engaged with offensive linemen. Tackling in the open field also received noticeable improvements, including new animations and fewer (unrealistic) broken tackles.On the offensive side of the ball, the main improvement comes with your evasive moves, which can now be utilized with the right stick. Making cuts in the open field to evade defenders feels far more intuitive than before. Two new moves, a side hurdle and dead leg, add to the number of ways you can make the defender miss. Since hesitation running is big in football, it's nice to see the dead leg added. Directional hurdles--called jurdles--let you jump left and right rather than just forward, which comes in handy when you're running along the sidelines. All told, ball carrier moves are more dynamic, giving you new ways to catch defenders off guard.Quarterback play is a tad more in-step with the real thing, as there's more nuance to throws made with defenders breathing down your neck. While QBs can now hasten their release, the accuracy of passes when under pressure can vary wildly depending on the player. This also means that attempting throws with a backup QB in the same fashion as you would with, say, Patrick Mahomes can lead to some big misses. And new Superstar and X-Factor abilities further emphasize the disparity between the stars and role players, including numerous new receiver abilities that give those with hot hands high-percentage opportunities to nab anything thrown in their direction.When Madden NFL 21 is running without a hitch, the football gameplay is quite good, even if it's only incrementally better than last year. Sadly, in its current state, Madden NFL 21 has some real issues, especially in regard to kicking. On more than half of my kickoffs, field goals, and punts, there was some fairly extreme lag with the kicking meter, which led to laughably errant kicks. More than usual, receivers simply do not turn back to look at the ball at all, even when it hits them directly in the back of the head.There are also bigger-picture issues with the overall experience. Sometimes the field didn't fully render, forcing me to quit and reload. Other times the game got stuck in a loading loop after finishing a contest. Lagging animations aren't super common, but I encountered one or two every few games. While I assume these issues will get patched with the planned day-one update, they add up to create an inconsistent and sometimes frustrating experience.As the PS5 and Xbox Series X loom--PS4 and Xbox One editions come with free upgrades to next-gen--Madden has reached a crossroads. One side of the road is freshly paved and inspired thanks to the shenanigans featured in The Yard, while the other is beaten down and filled with potholes. With far more technical issues than normal and large chunks of recycled content, Madden NFL 21 feels more like an update than a brand-new game."}