{"ref": "https://www.gamespot.com/reviews/doom-3-resurrection-of-evil-review/1900-6121555/", "date": "April 4, 2005", "game_name": "DOOM 3", "text": "It seems like just eight months ago that Doom 3 was finally released to a rabid PC community slavering with anticipation. Wait, it was just eight months ago. Nevertheless, id Software has collaborated with longtime partner Nerve Software to bring us Doom 3's first expansion pack, Resurrection of Evil. The new add-on doesn't muck with the horror-movie presentation and run-and-gun gameplay laid down by the original, though it adds enough new weapons and enemies to make the expansion feel like a solid companion to the original. If Doom 3 left you wanting more, you'll find what you're looking for in Resurrection of Evil. Something has once again gone very wrong on Mars...and you're the only marine who can fix it. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Doom 3: Resurrection of Evil Video Review Resurrection of Evil picks up about two years after the hellish catastrophe of the original game. The Union Aerospace Corporation, in its infinite drive for profits, has established a new base to continue the study of an ancient Martian civilization uncovered by the original science team. During an exploratory mission, your character--a different marine than the one you played in Doom 3--unwisely picks up an evil artifact that just happens to open another portal to hell, which leads to the deaths of almost everyone on the base, as well as unleashes a new wave of demons, led by the demonic Dr. Betruger (who wants his toy back). With the help of Dr. Elizabeth McNeil, who acts as this game's Sarge, you'll have to blast your way through hordes of enemies as you attempt to reach hell to seal the artifact there, hopefully ending the threat of invasion forever. Since this is an expansion pack, Resurrection of Evil plays almost exactly like the original Doom 3. The game is extremely dark, requiring you to use your trusty flashlight to explore its many nooks and crannies to detect enemy threats, many of which lurk unseen in the darkness. The flow of the action is similar to that of Doom 3, so you'll enter a new area, clear it of enemies, and look for a key item or security upgrade that will let you meet your objective and move on to the next area. There's not as much storyline here as in the original, which means you won't spend as much time poring over old e-mails and audio logs for clues. Furthermore, the cutscenes are sparse and widely separated. So despite its similarities to Doom 3, Resurrection of Evil feels even more like the sort of straightforward action game that the original Doom was. Upon its release, Doom 3 boasted what was probably the most amazing graphics engine ever seen, yet most of the game was set in identical-looking industrial corridors. Resurrection of Evil attempts to rectify this shortcoming by placing you in a wider variety of environments. The first few levels are set in an archeological dig site similar to the one glimpsed at the very end of Doom 3, which adds some nice variety to the action. You'll spend the bulk of the game inside the base, though most of the levels are varied enough that the scenery never gets too old. Finally, it's back to hell again at the end of the game, though the designers don't get too crazy with either the waves of enemies or the final encounter there. On the whole, the action is solid throughout. The new weapons, enemies, and hell powers add some needed variety to the basic Doom 3 action. Much of the entertainment value in Resurrection of Evil comes from the incremental improvements made to your arsenal. You'll find the good old double-barreled shotgun a few hours into the game, which can only hold two shells at once but will put a massive hole in anything you manage to hit with it. Then there's the grabber, a physics weapon not unlike Half-Life 2's gravity gun. The grabber is more combat-focused, though, since you won't use it to solve any serious puzzles. You can use the grabber to snag enemy projectiles and fling them back, and you can make weapons out of a lot of environmental objects, too (as you'd expect, exploding barrels work nicely for this). Rounding out your arsenal is the very artifact that started this whole mess. As you play through the game, the artifact will grant you powers you can activate at will. At first, you'll be able to slow down time for a few seconds, giving you a speed advantage over your enemies. Later on, the berserk power will be added to the artifact, enabling you to punch anything to death with one hit. Finally, toward the end of the game, you'll become invincible when you invoke the artifact, making you a real killing machine. Using your hell powers wisely becomes important, because the expansion sometimes throws a lot more enemies at you at one time than you saw in Doom 3. You'll come to rely on the artifact just as much as you do your regular weapons. It's a good thing you have some new toys to play with, because hell's forces have been enhanced as well. The most common new enemy is the vulgar, which is like a super-imp. It hurls green plasma at you and is generally faster and more vicious than its brown counterpart. Fortunately, the vulgar's projectile is ripe for the grabber. There's also a tall, lumbering fellow with rocket launchers for hands and a computer screen for a mouth who acts as a long-range companion to the hell knight. Finally, there are the three hunters who serve as the game's bosses. Each boss comes at you a different way and requires you to use a combination of your hell powers and the grabber to win. Resurrection of Evil adds a capture the flag mode to Doom 3's multiplayer. The CTF here was developed by ThreeWave, the same group that essentially created capture the flag in online shooters back in the days of Quake (though ThreeWave founder Dave Kirsch has since moved on). Resurrection's CTF is straightforward, though the included maps are well put together and feature a lot of nice touches, such as graphical cues as to base direction and even the classic ThreeWave logos for those nostalgists out there. There are also a handful of new deathmatch maps set in the dig site and in hell, which at least provide some new backdrops for all your fragging. Like Doom 3, single-player is the focus here, although the new multiplayer offerings, which are built for eight players, are quite sharp. Even eight months later, the game's graphics are virtually unparalleled. As an expansion pack, you'd expect Resurrection of Evil to look a lot like Doom 3. And it does. That's alright, though, considering Doom 3 is still one of the best-looking games around. As mentioned, the expansion spends more time in the archeological sites, which we didn't get to see enough of in the original. And even in the Mars base levels, the designers and artists have done a good job of differentiating this add-on from the base game. The new enemies and weapons are all just as realistically modeled and animated as those in Doom 3, again adding to the impressive quality of the visuals. As with the graphics, the sounds are almost all lifted straight from Doom 3-- though the new voice actors are good--and the new shotty packs a serious punch. Like its forebear, this expansion puts forth an exceptional audiovisual effort. Resurrection of Evil does a good job of reprising the straight-ahead shooting of Doom 3, and the new additions help to add a little depth to what was admittedly a pretty basic action game. The expansion's not incredibly long, so a dedicated player can blow through it in eight to 10 hours. However, its action is solid and entertaining throughout, without ever feeling like a chore. When it comes down to it, anyone who enjoyed Doom 3 should have an equally good time playing through its first expansion."}