{"ref": "https://www.gamespot.com/reviews/fatal-frame-ii-crimson-butterfly-directors-cut-rev/1900-6111616/", "date": "May 17, 2006", "game_name": "Fatal Frame II: Crimson Butterfly", "text": "It can be difficult for a survival horror game to make its mark on a genre already full of bloodthirsty zombies and narrow-beam flashlights. The original Fatal Frame managed to stand out because of a dark, strongly Japanese atmosphere and a unique gameplay mechanic that involved using a camera imbued with special powers to dispatch spirits to their eternal rest. At its core, Fatal Frame II doesn't deviate much from the formula established by its predecessor, as it treads the same ground of mysterious, ancient Japanese rituals and features innocent young girls pitted against perpetually unappeased ghosts. This Director's Cut version of the game builds upon last year's PS2 release, adding some new and enjoyable gameplay modes to both enhance your experience and test your skill, as well as a new ending, new extras, and more. Crimson butterflies? You'll find out why they're around, what they are, and why they're terrible. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Fatal Frame II: Crimson Butterfly Director's Cut Video Review There are two protagonists in the game, the twin sisters Mio and Mayu Amakura, though you'll control Mio nearly all the time. After the twins become lost in a forest, they stumble upon a village that was supposed to have mysteriously disappeared on the night of a special festival. Unfortunately, their return path seems to have vanished, so the girls have no choice but to venture into the old, ruined village in search of help. They eventually find an old camera that seems to be able to take pictures of things that aren't really there, and soon enough they're caught up in the village's curse, reliving the terrible events that caused the quiet town to be forever shrouded in darkness. You find the camera soon after arriving in town, and the device serves a wide range of purposes. It can be used to defeat hostile spirits, reveal clues, unseal doors held closed with spirit power, and catch hidden ghosts. It can even just take snapshots, if you like. You need film to take pictures, and, unlike in the first Fatal Frame, the camera thankfully comes preloaded with a mysteriously inexhaustible supply of low-grade film. This allows you to hoard the more-powerful film you obtain for combat, and snap pictures of clues and the like to your heart's content. Otherwise, the camera handles just as it did in the previous game. Pressing the B button causes you to enter a first-person camera view, and lining up things in the capture circle allows you to photograph hints or damage spirits. The capture circle glows green for hints and hidden spirits, and it glows red or orange when you have a lock on hostile spirits. You'll acquire upgrades for your camera throughout the course of the game, and to use them, you'll spend something called ~spirit points,~ which you'll earn in battle and by taking special photos. Take that, Casper! Fighting ghosts is the real highlight of the game, as you square off against some pretty creepy foes. When you're close enough to a spirit to inflict damage, the capture circle in the camera view glows orange and starts to hum with static. The closer you get and the longer you maintain the lock, the more powerful your shot will be. There are certain moments when the capture circle turns red (called ~shutter chances~). Shots taken at these times inflict heavy amounts of damage. Battle, therefore, becomes a matter of patience and a test of nerves, since you'll often have to allow a spirit to get dangerously close to you to get the best shot. To make things even more interesting, there's an instant within the shutter chance known as the ~fatal frame.~ If you time this shot correctly, you'll not only inflict heavy damage and knock the ghost back a few paces, but you'll also have the opportunity to chain in a second photo for a combo. That extra level of strategy and timing makes a photo shoot with a ghost all the more entertaining, and the only problem is that your foes are, in the great majority, slow-moving and highly predictable. Each spirit has its own attack pattern, so once you've seen a particular ghost a couple of times, hitting shutter chances while avoiding injury becomes a breeze. Camera upgrades, such as spirit tracking, stunning, and blasting, only skew things more in your favor, so when you factor in an item that allows you to avoid getting hit, battle can become decidedly unbalanced. Two of the different modes in the Director's Cut help alleviate this somewhat--they're the first-person (FPS) mode and the survival mode. The FPS mode is basically just what it sounds like--while the original version of Fatal Frame II is played through a traditional third-person perspective, the FPS mode renders the entire game in first-person as if you were looking through Mayu or Mio's eyes. The controls for this mode take a bit of adjustment, but it's just as viable as the third-person mode, and it's even preferable in that you don't get the dramatic perspective shift when you raise your camera to shoot ghosts, and you don't get crazy camera-angle changes while running. The caveat is that you have little peripheral vision. Whereas in the normal mode you can clearly see multiple spirits moving around you or coming up behind you with your camera lowered, in the FPS mode you get next to no visual clues that something might be lurking right at your back, waiting to reach out its ethereal arms for you. However, there are audible clues when spirits are present, in the form of static humming and whispered phrases, and you're going to have to pay more attention to these and play more reactively. Considering that there are some spirits in the game that can kill you with a single touch, the FPS mode definitely makes things more exciting, particularly when there are multiple ghosts lurking about. The first-person mode isn't just a gimmick--it really enhances the experience. Survival mode is not available initially, but for Fatal Frame aficionados, it represents the best test of skill. In this mode, ghosts come at you constantly and will instantly kill you if they touch you. Those who find themselves easily handling the normal game modes will find survival mode a very hearty challenge. And, as if the waves of spirits weren't enough, you'll be timed when going through this mode, so the key is not just to survive, but to survive as speedily as possible. It's a welcome addition to a game that can swing to the easy side of things for experienced players. Graphically, the game is great. This version of Fatal Frame II is a bit cleaner than the PS2 original and is on the whole an improvement, though you'll notice some strange color-banding when viewing cutscenes. There's a few too many drab, featureless hallways, which can make it feel like certain areas are recycled, but the rooms themselves, though dark, generally have some good detail. For instance, you'll find broken dolls strewn around a master's workshop, or extreme amounts of blood spattered across the walls of a particular room. The first-person mode gives you a good opportunity to appreciate such details right up close for an even greater impact. The living characters in the game look good and animate well, and the spirits have a lot of personality. While the ghosts still appear insubstantial, there's more detail and variety in their clothing and faces than in the first Fatal Frame, and some of them are quite awful--like the broken form of one who died after leaping from the top of a stairwell. The village itself has a few interesting structures, but the outdoor environments can seem a bit flat, with nothing to really grab the eye. The game's sound is also great, from the solid sound effects to the combined chatter of all the various ghosts you meet. You'll actually feel guilty when trying to dispatch the spirit of a young girl who's constantly burying her face in her hands and weeping. The voice acting is quite good, though there's not much range to some of the performances. Some spirits will also drop special crystals when they're banished that can be ~listened~ to on a ~spirit radio,~ and some of these messages are among the best delivered and creepiest in the game. There's no in-game music (though the ending theme is a catchy song), but you won't really feel the loss of it with all the spirit activity that goes on. In fact, the lack of distracting music is a boon in such cases, as you'll be able to better track ghosts through audio cues. Each mode offers something different for everyone. Fatal Frame II allows you to choose from normal or hard difficulties right off the bat, and defeating the game will allow you to unlock a wide spread of extras. Besides the aforementioned survival mode (and the FPS mode that's available from the start), there's a mission mode that consists of specific challenges to test your photo-snapping skills. You'll also be able to unlock a variety of extra outfits for Mio and Mayu, including some Xbox-specific extra costumes, like a bikini (the Dead or Alive girls never had it this tough). There's even a new ending thrown into the mix, and while a play-through of the basic game will take you only about 10 hours, you're almost certainly going to want to spend more time playing with everything that's available to you. Fatal Frame II: Crimson Butterfly Director's Cut is an absolutely great update to what was already a wonderfully spooky game. There's a little something for everyone here--first-time players can enjoy the easier traditional modes, experienced players will enjoy the added challenge of the survival mode, and the extras flesh out the game for all. If you've never plumbed the secrets of All Gods Village and you have an Xbox and a hankering for horror, this game is easily recommendable, and even if you played Fatal Frame II on the PS2, the additions made here are worth checking out. The FPS mode is basically just what it sounds like--while the original version of Fatal Frame II is played through a traditional third-person perspective, the FPS mode renders the entire game in first-person as if you were looking through Mayu or Mio's eyes. The controls for this mode take a bit of adjustment, but it's just as viable as the third-person mode, and it's even preferable in that you don't get the dramatic perspective shift when you raise your camera to shoot ghosts, and you don't get crazy camera-angle changes while running. The caveat is that you have little peripheral vision. Whereas in the normal mode you can clearly see multiple spirits moving around you or coming up behind you with your camera lowered, in the FPS mode you get next to no visual clues that something might be lurking right at your back, waiting to reach out its ethereal arms for you. However, there are audible clues when spirits are present, in the form of static humming and whispered phrases, and you're going to have to pay more attention to these and play more reactively. Considering that there are some spirits in the game that can kill you with a single touch, the FPS mode definitely makes things more exciting, particularly when there are multiple ghosts lurking about. The first-person mode isn't just a gimmick--it really enhances the experience. Survival mode is not available initially, but for Fatal Frame aficionados, it represents the best test of skill. In this mode, ghosts come at you constantly and will instantly kill you if they touch you. Those who find themselves easily handling the normal game modes will find survival mode a very hearty challenge. And, as if the waves of spirits weren't enough, you'll be timed when going through this mode, so the key is not just to survive, but to survive as speedily as possible. It's a welcome addition to a game that can swing to the easy side of things for experienced players. Graphically, the game is great. This version of Fatal Frame II is a bit cleaner than the PS2 original and is on the whole an improvement, though you'll notice some strange color-banding when viewing cutscenes. There's a few too many drab, featureless hallways, which can make it feel like certain areas are recycled, but the rooms themselves, though dark, generally have some good detail. For instance, you'll find broken dolls strewn around a master's workshop, or extreme amounts of blood spattered across the walls of a particular room. The first-person mode gives you a good opportunity to appreciate such details right up close for an even greater impact. The living characters in the game look good and animate well, and the spirits have a lot of personality. While the ghosts still appear insubstantial, there's more detail and variety in their clothing and faces than in the first Fatal Frame, and some of them are quite awful--like the broken form of one who died after leaping from the top of a stairwell. The village itself has a few interesting structures, but the outdoor environments can seem a bit flat, with nothing to really grab the eye. The game's sound is also great, from the solid sound effects to the combined chatter of all the various ghosts you meet. You'll actually feel guilty when trying to dispatch the spirit of a young girl who's constantly burying her face in her hands and weeping. The voice acting is quite good, though there's not much range to some of the performances. Some spirits will also drop special crystals when they're banished that can be ~listened~ to on a ~spirit radio,~ and some of these messages are among the best delivered and creepiest in the game. There's no in-game music (though the ending theme is a catchy song), but you won't really feel the loss of it with all the spirit activity that goes on. In fact, the lack of distracting music is a boon in such cases, as you'll be able to better track ghosts through audio cues. Each mode offers something different for everyone. Fatal Frame II allows you to choose from normal or hard difficulties right off the bat, and defeating the game will allow you to unlock a wide spread of extras. Besides the aforementioned survival mode (and the FPS mode that's available from the start), there's a mission mode that consists of specific challenges to test your photo-snapping skills. You'll also be able to unlock a variety of extra outfits for Mio and Mayu, including some Xbox-specific extra costumes, like a bikini (the Dead or Alive girls never had it this tough). There's even a new ending thrown into the mix, and while a play-through of the basic game will take you only about 10 hours, you're almost certainly going to want to spend more time playing with everything that's available to you. Fatal Frame II: Crimson Butterfly Director's Cut is an absolutely great update to what was already a wonderfully spooky game. There's a little something for everyone here--first-time players can enjoy the easier traditional modes, experienced players will enjoy the added challenge of the survival mode, and the extras flesh out the game for all. If you've never plumbed the secrets of All Gods Village and you have an Xbox and a hankering for horror, this game is easily recommendable, and even if you played Fatal Frame II on the PS2, the additions made here are worth checking out."}