{"ref": "https://www.gamespot.com/reviews/crash-bandicoot-the-wrath-of-cortex-review/1900-2821868/", "date": "May 17, 2006", "game_name": "Crash Bandicoot: The Wrath of Cortex", "text": "It's impossible to talk about Crash Bandicoot: Wrath of Cortex without mentioning that the series' creator, Naughty Dog, didn't have a hand in developing it. Naughty Dog may have created the orange marsupial, but Universal Interactive owns the rights to the character. So it came as no surprise when Universal decided to hand the developmental duties for the first PlayStation 2 version of Crash Bandicoot to another developer after Naughty Dog decided it was time to move on. With interest in the franchise slowly waning over the past few years, it was hoped that new developers would attempt to try something new. But Crash Bandicoot: The Wrath of Cortex maintains the status quo and fails to deliver a fresh, compelling experience. The story in Wrath of Cortex is just enough to hold the game together but not much more. After suffering defeat at the hands of Crash in the past three games, Dr. Cortex has devised yet another vile plan to stop the bandicoot dead in his tracks. But in order to finish his secret weapon, he calls upon the god Uka Uka to provide him with power from four elemental masks. The masks possess the power to conjure avalanches, tornadoes, tsunamis, and electric storms, so Cortex decides to use their abilities to bring his diabolical creation, Crunch, to life. Crash must destroy all four elemental masks so he can get to Uka Uka and ultimately destroy his perpetual enemy, Dr. Cortex, once again.Through three installments of the franchise on the PlayStation, controlling Crash remained relatively the same. Up until Crash 3, the sales numbers for the first two Crash games warranted such a design choice, but technology has marched on while the Crash series has treaded water. Traveler's Tales, the development house behind The Wrath of Cortex, has erred on the side of caution and decided not to mess with what was a winning formula in the past. All Crash's signature moves have returned, including the spin attack, the body slam, and the slide attack. Crash is rewarded with more moves, such as the double jump and the ability to glide after defeating the game's bosses. Older Crash Bandicoot games have included special vehicles to take control of, but Wrath of Cortex has more alternative vehicles than the other three games combined. Crash can pilot a jeep, a submarine, a beelike flying contraption, a mech suit, and more. The special vehicle stages provide the best experiences the game has to offer, but the controls for each vehicle can take some time to get used to. There are several stages in the game where you must control Crash's sister, Coco. Coco's levels are more traditional platforming affairs in that the jumps are more difficult and the combat is somewhat subdued. Veterans of the Crash Bandicoot series will be able to jump right in and start playing The Wrath of Cortex, but those who hoped for a wider variety of attacks for Crash's PS2 coming-out party will be disappointed. The developers behind the original Crash games may have moved on to new projects, but you'd never know it by playing The Wrath of Cortex. Like in previous games in the series, the action takes place on a predetermined path, and invisible barriers quickly squash any attempt at exploration. This, in itself, isn't a huge issue. Crash Bandicoot games have been this way from the beginning, and fans of the franchise have grown to love its simplicity. But the fixed camera angles make negotiating what would be easy platform jumps a chore, and it's made more difficult by the fact that Crash dies after just one misstep. The goal in each of the game's 30 sections is to reach the end in one piece. Along the way Crash must collect peaches, which will award him with extra lives, and a crystal, which weakens the powers of the elemental masks. Within each level is a bonus pad that will teleport Crash or Coco to a hidden area where an abundance of peaches and extra lives await. It's not necessary to take on the bonus missions, but for advanced players they can be an excellent way to stockpile extra lives for the boss fights. In traditional Crash Bandicoot style, there are several points in the game where he or Coco will run toward the screen. Completing these sections becomes an exercise in trial and error because it's impossible to see what lies directly ahead. The hit detection can also seem a bit unforgiving, especially during some of the game's boss fights where precision jumping is required.The Wrath of Cortex's graphics are impressive but not at the top of the PlayStation 2 food chain. Crash has never looked so good. He's finally been constructed with enough polygons to give him smooth, flowing curves, and his animation is much more fluid than what was seen of him on the PlayStation. Special effects such as environmental mapping, heat blur, particles, and real-time lighting are used abundantly, but the relatively low-poly environments and flatly shaded textures give the game a simplistic look. Enemy animations amount to just a few different movements, but they aid in establishing the appropriate drone mentality. While some of the areas appear a bit bland, others are lush and full of vibrant colors. The underwater scenes are particularly impressive, with flowing seaweed in a rainbow of colors peppering the sea bottom and transparent jellyfish realistically flowing in the water. As mentioned earlier, the fixed camera angles used throughout the game can cause some problems. They often blind you to enemies nearby or make negotiating platform jumps much more daunting than it should be. It's impossible to shift the camera to get a better view--causing a great deal of unnecessary frustration at several points in the game. The lengthy loading times for operations as simple as navigating menus only compound the problem. The frame rates stay the course the majority of the time with only a few hiccups to speak of, but this is to be expected of a game that is always in control of what is seen. The game's story is told through a handful of real-time cinemas with convincing voice work that occurs after a boss has been defeated. Camera quirks aside, Crash Bandicoot: The Wrath of Cortex is a sharp-looking game that brings an old franchise into the new generation of video games with flair. For better or worse, The Wrath of Cortex is no different from previous Crash Bandicoot games. Those who have yet to tire of Crash's spin-and-jump gameplay mechanics will be mildly entertained, but those who have seen their interest in the franchise waning over the years should steer clear. The graphics are solid and there's little doubt that the characters still have a broad appeal, but a lack of innovation and a reliance upon the tried and true make Crash Bandicoot: The Wrath of Cortex more of an upgrade to the PlayStation games than a new experience.The Wrath of Cortex's graphics are impressive but not at the top of the PlayStation 2 food chain. Crash has never looked so good. He's finally been constructed with enough polygons to give him smooth, flowing curves, and his animation is much more fluid than what was seen of him on the PlayStation. Special effects such as environmental mapping, heat blur, particles, and real-time lighting are used abundantly, but the relatively low-poly environments and flatly shaded textures give the game a simplistic look. Enemy animations amount to just a few different movements, but they aid in establishing the appropriate drone mentality. While some of the areas appear a bit bland, others are lush and full of vibrant colors. The underwater scenes are particularly impressive, with flowing seaweed in a rainbow of colors peppering the sea bottom and transparent jellyfish realistically flowing in the water. As mentioned earlier, the fixed camera angles used throughout the game can cause some problems. They often blind you to enemies nearby or make negotiating platform jumps much more daunting than it should be. It's impossible to shift the camera to get a better view--causing a great deal of unnecessary frustration at several points in the game. The lengthy loading times for operations as simple as navigating menus only compound the problem. The frame rates stay the course the majority of the time with only a few hiccups to speak of, but this is to be expected of a game that is always in control of what is seen. The game's story is told through a handful of real-time cinemas with convincing voice work that occurs after a boss has been defeated. Camera quirks aside, Crash Bandicoot: The Wrath of Cortex is a sharp-looking game that brings an old franchise into the new generation of video games with flair.For better or worse, The Wrath of Cortex is no different from previous Crash Bandicoot games. Those who have yet to tire of Crash's spin-and-jump gameplay mechanics will be mildly entertained, but those who have seen their interest in the franchise waning over the years should steer clear. The graphics are solid and there's little doubt that the characters still have a broad appeal, but a lack of innovation and a reliance upon the tried and true make Crash Bandicoot: The Wrath of Cortex more of an upgrade to the PlayStation games than a new experience."}