{"ref": "https://www.gamespot.com/reviews/miami-vice-review/1900-6116144/", "date": "January 11, 2005", "game_name": "Miami Vice: The Game", "text": "Along with Scarface, Miami Vice was a chief influence for Grand Theft Auto III: Vice City's Jheri-curled world. Ah, how the tables have turned. Unless Tommy Vercetti manages to manifest himself in the enormous cell phone he carries around, Miami Vice will stand as the best example of GTA's gameplay style on mobile. While its action is hampered quite a bit by poor frame rates and unresponsive control, Miami Vice is still good, mindless fun, whether you're gunning down drug lords or just driving into pedestrians. The good folks down at the precinct have given Tubbs the hookup with this sweet new sports car. Miami Vice's forgettable intrigue pits Crockett and Tubbs against a drug cartel run by folks with vaguely Latin-sounding names. In order to stop these unsavory types from flooding the city with their foul product, it's necessary to bend the code of police ethics a bit. Jacking cars, bribing runners, gunning suspects down in highly populated areas--it's all in a day's work for a pair of loose-cannon cops who don't play by the rules. The game will punish you, however, should you fail to live up to the motto ~Protect and Serve.~ Expect to dish out $100 for each innocent bystander you murder in cold blood. At least you won't be asked by a chain-smoking police chief to ~hand over your shield and your shooting iron.~ Of course, as in GTA, you can choose to ignore Miami Vice's flimsy storyline entirely, and choose instead to drive around causing mayhem. Steal a car, position it so it blocks traffic, then shoot at the vacated vehicle to cause a series of explosions. Or just drive over a few hapless citizens as they walk around in small circles. When you kill anyone, they'll be replaced by a police chalk outline, which is a cute touch. Don't total your car or get gunned down yourself, though, or you'll end up in the hospital and fail any ongoing missions. Sound familiar? Elkware should be both proud and ashamed that they've managed to mimic the GTA games to this extent. The game is viewed through the same overhead perspective used in the first and second GTAs, and it employs the same graphical style. Unfortunately, the frame rate (at least on the N-Gage QD) is generally pretty slow and doesn't allow for a real sense of speed, even in Tubbs' fancy new sports car. However, if you played GTA way back when on a pre-MMX Pentium, you should feel right at home. Perhaps as a result of the game's pervasive slowdown, your controls are very unresponsive. This is particularly problematic while driving, as making tight turns is impossible. As in GTA, Miami Vice's missions require work in cars and on foot. Miami Vice's sound is probably its least-polished feature. After the blaring introductory ditty, you'll rarely hear a peep out of the game, save when you complete or fail an objective. Gunfire, explosions, and non-player character deaths all pass in silence. While Miami Vice isn't going to win any awards for originality, it's certainly going to satisfy a lot of people looking for a violent, nonlinear gaming experience on mobile. We all know how fun causing trouble in a dynamic, crime-ridden city can be."}