{"ref": "https://www.gamespot.com/reviews/crash-bandicoot-the-wrath-of-cortex-review/1900-2861428/", "date": "May 17, 2006", "game_name": "Crash Bandicoot: The Wrath of Cortex", "text": "With interest in the Crash Bandicoot series waning over the past few years, Naughty Dog decided to sell the rights to the franchise and trudge on with its new ideas. With the Crash Bandicoot license firmly in its grip, Universal Interactive is attempting to seize the opportunity to bring the orange rodent to the Xbox before a rash of other platforming games can trump its appearance. But in its haste to get its product to market, Universal forgot to allow Traveler's Tales, the game's developer, to take advantage of the Xbox hardware. Featuring no improvements to its PlayStation 2 cousin, The Wrath of Cortex for the Xbox simply toes the line. The story in Wrath of Cortex is just enough to hold the game together, but not much more. After suffering defeat at the hands of Crash in the past three games, Dr. Cortex has devised yet another vile plan to stop the bandicoot dead in his tracks. Cortex is working on a secret weapon, but in order to finish it, he calls upon the god Uka Uka to provide him with the power of Uka Uka's four elemental masks. The masks possess the power to conjure avalanches, tornadoes, tsunamis, and electric storms, so Cortex decides to use their abilities to bring his latest diabolical creation, Crunch, to life. Crash must destroy all four elemental masks before they can be used to animate Crunch and ultimately destroy his perpetual enemy, Dr. Cortex, once again. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Crash Bandicoot: The Wrath of Cortex Video ReviewThrough three installments of the franchise on the PlayStation, controlling Crash remained relatively the same. Up until Crash 3, the sales numbers for the first two Crash games warranted such a design choice, but technology has marched on while the Crash series has treaded water. Traveler's Tales has erred on the side of caution and decided not to mess with what was a winning formula in the past. All Crash's signature moves have returned, including the spin attack, the body slam, and the slide attack. Crash is rewarded with more moves, such as the double jump and the ability to glide, after defeating the game's bosses. Older Crash Bandicoot games have included special vehicles to take control of, but The Wrath of Cortex has more alternative vehicles than the other three games combined. Crash can pilot a jeep, a submarine, a beelike flying contraption, a mech suit, and more. The special vehicle stages provide the best experiences the game has to offer, but the controls for the different vehicles can take some time to get used to. There are several stages in the game where you must control Crash's sister, Coco. Coco's levels are more traditional platforming affairs in that the jumps are more difficult and the combat is somewhat subdued. Veterans of the Crash Bandicoot series will be able to jump right in and start playing The Wrath of Cortex, but those who hoped for a wider variety of attacks for Crash's Xbox coming-out party will be disappointed. The developer behind the original Crash games may have moved on to new projects, but you'd never know it by playing The Wrath of Cortex. Like in previous games in the series, the action takes place on a predetermined path, and invisible barriers quickly squash any attempt at exploration. This isn't a huge issue in itself. Crash Bandicoot games have been this way from the beginning, and fans of the franchise have grown to love its simplicity. But the fixed camera angles make negotiating what would be easy platform jumps a chore, and it's made more difficult by the fact that Crash dies after just one misstep. Consequently, the entire game is one huge exercise in trial and error with some level memorization thrown in for good measure.The goal in each of the game's 30 sections is to reach the end in one piece. Along the way, Crash must collect peaches, which will award him with extra lives, and a crystal, which weakens the powers of the elemental masks. Within each level is a bonus pad that will teleport Crash or Coco to a hidden area where an abundance of peaches and extra lives await. It's not necessary to take on the bonus missions, but for advanced players they can be an excellent way to stockpile extra lives for the boss fights. In traditional Crash Bandicoot style, there are several points in the game where Crash or Coco will run toward the screen. Completing these sections is a matter of memorization because it's impossible to see what lies directly ahead. The hit detection can also seem a bit unforgiving--especially during some of the game's boss fights, where precision jumping is required.. The Wrath of Cortex's graphics are fairly impressive, but they're only slightly above average when compared with the graphics in other Xbox games. Even so, the transition to a new platform has been a good one for Crash. He's finally been constructed with enough polygons to give him smooth, flowing curves, and his animation is much more fluid than in the PlayStation games. Special effects such as environmental mapping, heat blur, particles, and real-time lighting are used abundantly, but the relatively low-poly environments and flatly shaded textures give the game a simplistic look. Enemy animations amount to just a few different movements, but they aid in establishing the appropriate drone mentality. While some of the areas appear a bit bland, others are lush and full of vibrant colors. The underwater scenes are particularly impressive, with flowing seaweed in a rainbow of colors peppering the sea bottom and transparent jellyfish realistically flowing in the water. As mentioned earlier, the fixed camera angles used throughout the game can cause some problems. They often blind you to enemies nearby or make negotiating platform jumps much more daunting than it should be. It's impossible to shift the camera to get a better view--causing a great deal of unnecessary frustration at several points in the game. The lengthy loading times found in the PlayStation 2 version of the game have been slightly improved, though the minigame that you were allowed to play while waiting has been removed. The frame rates stay the course the majority of the time, with only a few hiccups to speak of, but this is to be expected of a game that is always in control of what is seen. The game's story is told through a handful of real-time cinemas with convincing voice work that occurs after a boss has been defeated. Camera quirks aside, Crash Bandicoot: The Wrath of Cortex is a sharp-looking game that brings an old franchise into the new generation of video games with some flair. With just one adequate platforming option available on the Xbox, Crash Bandicoot's latest outing is worth a rental to see if its trial-and-error gameplay is for you. Fans of the franchise will be happy to see that the Crash formula has been not been altered very much, but those hoping for the next evolution in platforming games will be sorely disappointed by The Wrath of Cortex's reliance on the tried and true. The graphics are simple yet solid and the gameplay mechanics are dated, but the addition of new vehicles spices up the proceedings a bit. With that said, there's no hiding that The Wrath of Cortex is a slightly updated version of the orange marsupial's 1998 debut on the PlayStation.The goal in each of the game's 30 sections is to reach the end in one piece. Along the way, Crash must collect peaches, which will award him with extra lives, and a crystal, which weakens the powers of the elemental masks. Within each level is a bonus pad that will teleport Crash or Coco to a hidden area where an abundance of peaches and extra lives await. It's not necessary to take on the bonus missions, but for advanced players they can be an excellent way to stockpile extra lives for the boss fights. In traditional Crash Bandicoot style, there are several points in the game where Crash or Coco will run toward the screen. Completing these sections is a matter of memorization because it's impossible to see what lies directly ahead. The hit detection can also seem a bit unforgiving--especially during some of the game's boss fights, where precision jumping is required.. The Wrath of Cortex's graphics are fairly impressive, but they're only slightly above average when compared with the graphics in other Xbox games. Even so, the transition to a new platform has been a good one for Crash. He's finally been constructed with enough polygons to give him smooth, flowing curves, and his animation is much more fluid than in the PlayStation games. Special effects such as environmental mapping, heat blur, particles, and real-time lighting are used abundantly, but the relatively low-poly environments and flatly shaded textures give the game a simplistic look. Enemy animations amount to just a few different movements, but they aid in establishing the appropriate drone mentality. While some of the areas appear a bit bland, others are lush and full of vibrant colors. The underwater scenes are particularly impressive, with flowing seaweed in a rainbow of colors peppering the sea bottom and transparent jellyfish realistically flowing in the water. As mentioned earlier, the fixed camera angles used throughout the game can cause some problems. They often blind you to enemies nearby or make negotiating platform jumps much more daunting than it should be. It's impossible to shift the camera to get a better view--causing a great deal of unnecessary frustration at several points in the game. The lengthy loading times found in the PlayStation 2 version of the game have been slightly improved, though the minigame that you were allowed to play while waiting has been removed. The frame rates stay the course the majority of the time, with only a few hiccups to speak of, but this is to be expected of a game that is always in control of what is seen. The game's story is told through a handful of real-time cinemas with convincing voice work that occurs after a boss has been defeated. Camera quirks aside, Crash Bandicoot: The Wrath of Cortex is a sharp-looking game that brings an old franchise into the new generation of video games with some flair. With just one adequate platforming option available on the Xbox, Crash Bandicoot's latest outing is worth a rental to see if its trial-and-error gameplay is for you. Fans of the franchise will be happy to see that the Crash formula has been not been altered very much, but those hoping for the next evolution in platforming games will be sorely disappointed by The Wrath of Cortex's reliance on the tried and true. The graphics are simple yet solid and the gameplay mechanics are dated, but the addition of new vehicles spices up the proceedings a bit. With that said, there's no hiding that The Wrath of Cortex is a slightly updated version of the orange marsupial's 1998 debut on the PlayStation."}