{"ref": "https://www.gamespot.com/reviews/culpa-innata-review/1900-6183352/", "date": "November 26, 2007", "game_name": "Culpa Innata", "text": "If only all adventure games began life as projects ~to leverage core technologies in 3-D face animation.~ According to freshman Turkish developer Momentum's Web site, the company originally set out to create a prop to sell facial modeling to TV animation, but it wound up with a really solid point-and-click adventure in Culpa Innata. Open-ended dialogue, an ambitious storyline, lots of intelligent puzzles, and characters boasting lifelike personality and motivation make this an adventure to remember. Only some fit and finish issues and some odd design decisions prevent you from getting totally wrapped up in this unusual tale. Honestly, does anyone really think that offices are going to look like this in 2047? It all begins with a story inspired by Turkish sci-fi author Alev Alati's Schrodinger's Cat novels. Much of the plot centers on the World Union, a federation that has absorbed much of the West by the time that the game opens in 2047. This is the sort of government that keeps members of militia groups in the Midwest up all night stockpiling ammunition, a United Nations on steroids that protects society by turning people into automatons. Drone life isn't all bad, though. Instead of a typical dystopian video game clich, the World Union is a blend between Brave New World and Logan's Run. Life is technologically sterile, but everybody has been so hammered into insensibility by casual sex and instant gratification that they don't care. Of course, promiscuous totalitarianism doesn't sit right with the protagonist, a female peace officer saddled with the unfortunate name of Phoenix Wallis. An apparent murder of a Russian immigrant in her home city of Adrianopolis kicks off both a whodunit and a philosophical investigation into this slickly sinister future world. Given that previous description, it probably won't come as a surprise that the game does come off a little on the pretentious side. You're beaten over the head too often with capital-B big ideas and blunt symbolism (Phoenix's government office is in a converted church--gee, how subtle!). Social commentary on what people are willing to sacrifice for security is fine and dandy, but too often the developer hammers home its ideals without any regard for human nature. It's pretty tough to buy that the entire Western world will be populated by techno-fascist drones preaching the virtues of selfishness, genetics, and random sex in just 40 years. Background accoutrements of this society are even more incredible. Every citizen wears a personal-assistant earpiece that projects a holographic screen in midair. Residences and offices are protected by holographic heads. Most living spaces are decked out with couches, chairs, and knickknacks that look like they were dreamed up by sci-fi filmmakers in the '70s. The predominance of paisley-style color splashes sure seem to indicate that the design team studied the interior decoration in Logan's Run and Rollerball. Poor visual quality makes it harder to accept all this outlandish paraphernalia. With the exception of remarkably expressive and warm faces, the game is a mash of jagged lines and blurry scenery. So ignoring the background to concentrate on Culpa Innata's characterization and gameplay is a more rewarding idea. Phoenix is one of the more believable protagonists to hit an adventure game in some time. Her growing suspicion about the true nature of the society that she's been indoctrinated to love is entirely credible, due to a top script and a voice actor who does a great job of capturing the peace officer's blend of navet and pragmatism. Most of the other characters in the game are equally convincing, thanks to personalities that are restrained enough to keep them from turning into typical game caricatures (well, aside from everybody's creepy obsession with sex). Varying quality of the voice acting is the only negative. Many people speak in monotones, and some of the ethnic accents come off cartoonish, particularly the Indian immigrant early in the game who sounds like the murderous twin brother of Apu from The Simpsons. Basic game design also adds to the sense that you're controlling a real person, since you're free to choose whichever tasks you want Phoenix to handle each working day. Some days you can get a lot accomplished, other days not so much. Getting tired and being forced to go home instead of burning the midnight oil means that the game isn't entirely nonlinear, although it's still more open than the usual adventure that proceeds through chapters by lockstep. What you're doing during these days is also somewhat original, at least in comparison to the tired old ~pick up everything you see~ adventure formula. Momentum has modeled the game after police investigations, so Phoenix spends her time following leads and interrogating persons of interest instead of pocketing everything in sight. This can cause the game to drag in spots, as conversations are drawn out and lines can't readily be skipped without immediately jumping to the end of the conversation. Still, most of the script is entertaining, so you don't mind having to sit through so much exposition. You're also provided with lots to choose from in dialogue trees, giving you the ability to make small talk, press a suspect, play nice, or some mixture of all three. This variety also boosts replay value, as when you pick a conversational tactic, you're stuck with it and can't simply go back and choose all the options that you skipped the first time. Aside from the somewhat peculiar focus on sex, most of the dialogue in the game draws you into Culpa Innata's original world. But it's not like you're eternally quizzing slack-jawed yokels. When you're not playing Columbo, you collect the odd bit of junk that will come in handy down the road and also solve an incredible number of logic puzzles. There seem to be dozens in the game. Most are reasonably quick and entertaining variations on adventure-game standards like futzing around with fuse boxes, reconstructing pictures, hacking circuit boards, and the like. Nothing here is wildly original, but at least this means that you should be familiar enough with most challenges to have a shot at solving them without recourse to a walk-through. Only a scant few come out of left field, a pretty good ratio for an adventure game these days. Unfortunately, one of the most ridiculous is stuck right at the beginning of the game, where you're expected to somehow figure out that you need to use cold cream and cotton balls to expose a butterfly hidden in an engraved sign. Considering that this is a developer's first time out of the gate, Momentum has done a fine job with Culpa Innata. It could have used some visual refinements and a few tweaks to the back-to-the-future backdrops, although it's hard to chide this game too harshly when it gets so much right."}