{"ref": "https://www.gamespot.com/reviews/silent-scope-3-review/1900-2896218/", "date": "October 30, 2002", "game_name": "Silent Scope 3", "text": "Silent Scope 3 for the PlayStation 2 is an adaptation of the arcade series of gun games. The arcade versions of Silent Scope all feature an elaborate sniper rifle-shaped light gun that you use to shoot at various targets from long range. A small screen is actually mounted in the scope of the gun, giving you a functional close-up of a small portion of the main display, and simulating what it's like to shoot from long range. Of course, when the game series was brought home to consoles, no rifle came with it, which inherently removes a great deal of what made the arcade series popular and fun. Relegated to gamepad controls, Silent Scope 3 still makes for a decent adaptation of the arcade series, and offers a sometimes enjoyable but extremely brief experience. Silent Scope 3 actually features two games in one--Silent Scope EX, a direct adaptation of the arcade title, and Silent Scope 3, a game created solely for the PlayStation 2. Silent Scope EX contains a level progression similar to that in previous games. Your character moves around on rails to set vantage points, where enemies pop up, and if you don't shoot them fast enough, they start firing back. Clear them all out, and you get rated based on your accuracy and speed in bringing the enemies down. You are then often presented with a choice of which level section to go through next, though all paths lead to the same place at the end of the game. The Silent Scope 3 game, on the other hand, introduces a new level-progression structure. After the first level is cleared, you are free to select any level or mission you wish to accomplish next, though they all must be cleared before the game is finished. While previous installments in the series have put a huge sense of time pressure onto the player, some missions in both Silent Scope 3 and EX stress patience and accuracy. The game will present you with levels containing incredibly difficult shots, but you can take all the time you need to make them. Miss one, however, and suddenly your enemies will become aware of your presence and will swarm all over the place, making your life very difficult. As in the rest of the series, health can be regained by locating a woman hidden once or twice in each level and keeping your scope on her for a short period of time. The control in Silent Scope 3 has been revised somewhat since the last home installment, though most of the conventions are still the same. Your aim is controlled by the left analog stick, which moves a zoomed targeting reticle about the screen. Press the L1 button and the reticle zooms out, allowing for more gross adjustment of your aim as well as a wider view of the action. The game attempts to assist your aim using a ~magnet~ feature. Place your crosshairs near an enemy and it will snap over him and continue to follow him if he should move. This is exceptionally useful most of the time, except it doesn't account for your need to lead shots at distant targets. This also makes lining up a shot near a civilian more difficult. You can disable the lock-on mode, but then it becomes very difficult to make some of the shots that require precision. At a few points in the game you will be surrounded by your enemies and will use the R1 and L2 buttons to turn and change your vantage point. However, because your view snaps to another of four different views, this does very little to break the game out of its rail shooter concept. Graphically, Silent Scope 3 looks fair. Enemy models look pretty good and are textured and animated well. There's very little variety within a level, though, meaning you'll face the exact same enemy model time and time again. For example, the casino level is filled with suit-wearing shooters, while a plane-hijacking scene contains nothing but masked commandos. The environments tend to seem a little sparse, and the textures don't always look very good, but you will spend so little time interacting with the environment that you'll hardly notice. Sound is limited to mostly gunshots and grunts from your enemies. Your commander will give you the same monotonous advice here and there--at least it's easy to ignore. Music tends to be fast paced and unobtrusive, and in most cases you'll hardly notice it. Yet for all its shortcomings, the biggest problem with Silent Scope 3 is its length. Because the game is an arcade port, you can literally sit down and finish it the same afternoon you get hold of it, and although you can finish it without playing all of the missions, there is still very little replay value to come back to. Even with the console-only missions of Silent Scope 3, there is very little long-term staying power to be found here. While it lasts, though, the game delivers a solid enough playing experience, and if by some chance you've enjoyed the console versions of Silent Scope in the past, then you'll probably find something to like in this one as well."}