{"ref": "https://www.gamespot.com/reviews/super-bubble-pop-review/1900-2908206/", "date": "January 7, 2003", "game_name": "Super Bubble Pop", "text": "One of the first titles from the newly resurrected game publisher Jaleco, Super Bubble Pop, is a fairly straightforward, fast-paced puzzle game that, simply put, would not exist if it weren't for the countless other puzzle games that have come before it. Playing much like a blend of Klax and Columns, two of the earliest would-be Tetris usurpers, Super Bubble Pop feels familiar all around, right down to its titular similarities to Taito's prolific Super Bust-A-Move series. Still, though the game draws inspiration from some of the more respected second-string puzzle games out there, Super Bubble Pop offers neither their depth nor their long-term appeal. Super Bubble Pop presents you with an isometric perspective on a two-dimensional square grid. In the foreground stands your avatar, which appears in the form of a funky robot or one of a few different quasi-futuristic rave kids. At the far end of the grid, you'll see an assortment of different-colored bubbles, which are slowly pushed towards the front of the grid by even more bubbles. If the bubbles fill up the grid and are pushed over the front, or if you run out of time before clearing all the bubbles, it's game over. To clear out the bubbles, you'll launch bubbles from your queue of randomly colored bubbles to create vertical or horizontal rows of three or more like-colored bubbles. Clearing out all the bubbles will advance you to the next level, though the game also offers a shortcut to victory in the form of special level-up stars that appear on the field. Early on, simply collecting three of these stars will advance you to the next stage, though the harder levels will require you to collect more stars. To keep things from getting too predictable, the game will randomly throw in dead bubbles that require five bubble shots to clear, time-extension bubbles, and special power-up bubbles. The level of challenge in Super Bubble Pop ramps up at a good, respectable gait, and the pace of the game moves at a fast clip, but the action never really feels that exciting or engaging, as though you're just going through the motions. Further limiting the game's appeal is the almost shameful lack of gameplay options, giving you only one single-player and one two-player mode. A strong number of additional modes of play might have made the rather derivative gameplay more forgivable, but Super Bubble Pop has neither the quantity nor the quality of its peers. Super Bubble Pop on the Game Boy Advance attempts to emulate the presentation found in its console versions, though it has a significantly more stripped-down look. Curiously, this works to the advantage of the GBA version. Super Bubble Pop on the consoles actually has too much flash for its own good, and the more subdued presentation on the GBA makes it much, much easier to focus on the action at hand. The focus on function over style was probably just a necessity to keep things running right on the Game Boy Advance, but it works to the game's benefit. Though the graphics had to be reined in a bit for the GBA, the sound design in Super Bubble Pop is surprisingly similar to that found in its bigger brothers, albeit at a noticeably lower level of fidelity. The soundtrack dominates with lots of hard-and-fast house music, with a few down-tempo grooves thrown in for good measure, and the generally high-BPM dance music complements the game's fast pacing nicely. Other than some pretty catchy dance music, you'll also hear crazy robot voices and little synth riffs when you clear lines, clear levels, or pick up special power-ups. But some catchy tunes aren't enough to make Super Bubble Pop worthwhile. The flow of new puzzle games has slowed to a trickle in the past few years, but the shortage of contemporary competition doesn't make this lackluster package any more recommendable. Puzzle veterans won't find anything new or exciting here, and the lack of depth and gameplay options will keep it from appealing to newcomers or casual gamers for any real length of time."}