{"ref": "https://www.gamespot.com/reviews/evil-dead-regeneration-review/1900-6133145/", "date": "May 17, 2006", "game_name": "Evil Dead: Regeneration", "text": "Bruce Campbell is back again...or is it Ash? At this point the two are indiscernible. Either way, the icon of B movies has returned, boomstick in hand, ready to rid the world of deadites once again. While the Evil Dead movies are bad in a spectacularly entertaining way, the Evil Dead games thus far have been just plain bad. Evil Dead: Regeneration is the latest game in the series, and it's a huge improvement over the last two games. Of course, that isn't saying much. Actually, Regeneration is a lot of fun to play, but it's marred by a host of bugs and an ugly presentation. Ash is back, and he's ready to kick some deadite ass. Evil Dead: Regeneration follows an entirely new storyline, but it has all the trappings of the movies so fans have nothing to fear. In the beginning of the game Ash is in a cabin, when all of a sudden a bunch of deadites show up and start tearing the place apart. What else is a wisecracking action hero to do but to start dishing out heaping helpings of hot lead? Ash wins the day, but to the authorities it doesn't look so heroic. To them, it looks like Ash went on a rampage and wasted a bunch of innocent people. So Ash is convicted of murder, but his insistence that the people he killed were possessed lands him in Sunny Meadows, an asylum for the criminally insane. Coincidentally, in the basement of that asylum, Dr. Vingo is carrying out all kinds of morbid experiments with the Necronomicon (the book that caused all this trouble in the first place). Eventually all hell breaks loose, and Ash is charged with the task of saving the world and defeating the twisted Dr. Vingo. As a former S-Mart employee, Ash knows a thing or two about hardware. As a result, he's pretty handy with firearms, and he's also able to affix all kinds of weapons to the stump that used to be his right hand. This dual-wielding combo is a great way to make short work of deadites. There aren't too many weapons available in the game, but it's fun to mix and match them to see which combos work best. The shotgun/chainsaw combo is of course a classic, and it fits just about any situation. However, you can also get a harpoon to hook on to your right arm. Then you can spear an enemy and draw it toward you so you can then rearrange its face with a hot blast from your shotgun. You can also ~juggle~ enemies by shooting them repeatedly while they're in the air. In fact, combat is a bit easy since you have infinite ammo for all your weapons. Plus, you face the same enemies throughout most of the game, and they don't get any smarter or tougher as you progress. The greatest part of combat is the finishing move. When you do enough damage to an enemy, it'll become vulnerable and start to glow green. At this point you can get close and press a button to finish the enemy off. You'll usually see a cool animation of the always gruesome and stylish finish. For example, one of the finishing moves in the game has Ash smacking an enemy and then finishing it off with a behind-the-back shotgun blast to the gut. There are only a handful of these moves, but they look cool, and they're satisfying to pull off. You can punt your partner, Sam, onto an enemy and watch him go to work ripping its head off. Another unique face of combat involves Ash's partner, Sam. Sam is a half-human, half-deadite dwarf who was used as a lab rat for Dr. Vingo's cruel experiments. Sam can die, but he comes back immediately, so you're free to abuse him as you wish. In fact, it's encouraged. You can kick Sam at enemies, and he'll often latch on and will either hold the enemy for you to finish it off or simply rip the enemy's head off and be done with it. You can also use Sam to solve puzzles, because you can kick him to areas that Ash can't reach. You can also possess Sam, and since he's smaller, he can get into areas where Ash can't go. Sam can ride on certain gigantic deadite creatures. Sam will these creatures around, bashing everything in your way, which eventually opens up a path for Ash to continue through the level. In some sequences, you have to protect Sam from oncoming deadites as he delivers spirits to their destination. All in all, the addition of Sam adds a welcome bit of depth to gameplay that would otherwise consist entirely of simple button mashing. But wait, there's yet another twist to the combat in Regeneration. As Ash defeats foes, he'll pick up little glowing orange balls that fill up his rage meter. When activated, Ash's rage transforms him into a sort of demonic version of himself that is faster and stronger than the normal Ash. This rage effect is a good way to cut through a large group of enemies, but it really isn't necessary, and in fact you can easily go through the entire game without using your rage at all. Nevertheless, it adds one more interesting twist to the game. When Ash gets angry, he can unleash his demonic rage to get an edge in battle. Fighting deadites will take up most of your time in this game, but there are some simple platforming sections to mix things up. Unfortunately, these sections don't play well at all, since Ash's jumps are stiff and awkward. You'll often land just on the edge of a platform or cliff and kind of stutter there while the game decides whether you're on land or off. There are unfortunately a lot of similar bugs in this game. The clipping is terrible here, and sometimes you'll see characters appear to go right through walls. The worst bug we witnessed was in the PlayStation 2 version of the game, where an entire room failed to load, and there were just a couple of rocks floating in a big gray void. On the Xbox, the biggest hiccup we saw was a repeating cutscene. The enemy AI is also fairly glitchy in Regeneration, but mostly it's just real dumb. Enemies can't do anything but run directly at you. They can't even walk up a short flight of stairs. A couple of times, we saw flying enemies just freeze in the air, where they couldn't deal or receive damage. It's a shame, because the gameplay is a lot of fun, but it's hampered by a few persistent and annoying glitches. Evil Dead: Regeneration looks pretty nasty too. The rendered cutscenes are fairly well done, but the in-game graphics are about as ugly as they come these days. You'll often see textures or objects pop in as you approach, and the textures and character models are flat and undetailed. In fact, the whole game suffers from a lack of detail. For example, in an early scene Ash is sprayed with gallons of blood, but his clothing doesn't show a drop. Also, in some areas you can destroy crates and shelves and other objects, but then when you have to backtrack through the same areas all those items magically reappear. The character animations are stiff and awkward as well, which isn't very nice to look at. The game is pretty fun to play, just not so much fun to look at. The sound in the game is hit or miss. There isn't any music to speak of, except when you are in rage mode or are playing as Sam. The weapon and enemy sounds are rather weak and uninteresting as well. However, Bruce Campbell and Ted Raimi provide the excellent voice performances for Ash and Sam, respectively. There's tons of dialogue in the game, and while some of it feels a bit forced at this point, most of it is pretty funny. In the end, Regeneration is easily the best Evil Dead game available. If you can look past some nasty bugs and the ugly presentation of the game, you'll find six or seven hours of fun here. There are also some great extras to unlock, including video clips of Bruce doing the voice work for the game. You can't help but feel a bit let down though, because if a little more time had been spent polishing the presentation and fixing the bugs, this game could have been a lot better than it ultimately is. But wait, there's yet another twist to the combat in Regeneration. As Ash defeats foes, he'll pick up little glowing orange balls that fill up his rage meter. When activated, Ash's rage transforms him into a sort of demonic version of himself that is faster and stronger than the normal Ash. This rage effect is a good way to cut through a large group of enemies, but it really isn't necessary, and in fact you can easily go through the entire game without using your rage at all. Nevertheless, it adds one more interesting twist to the game. When Ash gets angry, he can unleash his demonic rage to get an edge in battle. Fighting deadites will take up most of your time in this game, but there are some simple platforming sections to mix things up. Unfortunately, these sections don't play well at all, since Ash's jumps are stiff and awkward. You'll often land just on the edge of a platform or cliff and kind of stutter there while the game decides whether you're on land or off. There are unfortunately a lot of similar bugs in this game. The clipping is terrible here, and sometimes you'll see characters appear to go right through walls. The worst bug we witnessed was in the PlayStation 2 version of the game, where an entire room failed to load, and there were just a couple of rocks floating in a big gray void. On the Xbox, the biggest hiccup we saw was a repeating cutscene. The enemy AI is also fairly glitchy in Regeneration, but mostly it's just real dumb. Enemies can't do anything but run directly at you. They can't even walk up a short flight of stairs. A couple of times, we saw flying enemies just freeze in the air, where they couldn't deal or receive damage. It's a shame, because the gameplay is a lot of fun, but it's hampered by a few persistent and annoying glitches. Evil Dead: Regeneration looks pretty nasty too. The rendered cutscenes are fairly well done, but the in-game graphics are about as ugly as they come these days. You'll often see textures or objects pop in as you approach, and the textures and character models are flat and undetailed. In fact, the whole game suffers from a lack of detail. For example, in an early scene Ash is sprayed with gallons of blood, but his clothing doesn't show a drop. Also, in some areas you can destroy crates and shelves and other objects, but then when you have to backtrack through the same areas all those items magically reappear. The character animations are stiff and awkward as well, which isn't very nice to look at. The game is pretty fun to play, just not so much fun to look at. The sound in the game is hit or miss. There isn't any music to speak of, except when you are in rage mode or are playing as Sam. The weapon and enemy sounds are rather weak and uninteresting as well. However, Bruce Campbell and Ted Raimi provide the excellent voice performances for Ash and Sam, respectively. There's tons of dialogue in the game, and while some of it feels a bit forced at this point, most of it is pretty funny. In the end, Regeneration is easily the best Evil Dead game available. If you can look past some nasty bugs and the ugly presentation of the game, you'll find six or seven hours of fun here. There are also some great extras to unlock, including video clips of Bruce doing the voice work for the game. You can't help but feel a bit let down though, because if a little more time had been spent polishing the presentation and fixing the bugs, this game could have been a lot better than it ultimately is."}