{"ref": "https://www.gamespot.com/reviews/taz-wanted-review/1900-2895841/", "date": "October 25, 2002", "game_name": "Taz Wanted", "text": "The Tasmanian Devil, while certainly an entertaining beast, isn't the most beloved of animals. This is probably due, at least in part, to their insatiable appetites, destructive, hyperactive tendencies, and poor grammar. After upsetting a few too many Looney Tunes characters with his spazzy antics, Taz has been captured by Yosemite Sam, and placed in his private zoo. Even worse, the She-Devil, Taz's feminine counterpart, has also been nabbed and taken off to an undisclosed location within Sam's park. With this as the premise for Blitz Games' new 3D platformer, it's up to you as Taz to evade Yosemite Sam, trash his park, and rescue your She-Devil. Unfortunately, this rescue mission isn't really worth it. Taz Wanted plays like a very cut-and-dry 3D platformer. You start off at a central hub, and jump into the different themed levels from there, which include a zoo level, a water park level, a snow level, and so on. Like all modern 3D platforming heroes, Taz has some unique moves aside from the standard running and jumping, the most prominent being the spin attack, in which Taz turns into his trademarked beige tornado and destroys just about anything in his path. He can also eat, and subsequently spit back up most items he encounters in the game. Taz has no butt stomp or double jump maneuvers, the latter of which would've come in very handy for the game's prevalent platform jumping. With these skills at your command, you'll jump into the levels and complete multiple objectives, which generally remain the same from level to level. Destroy seven Taz Wanted posters, collect 100 sandwiches, destroy 50% of the destructible items in the level, and find and destroy the Golden Yosemite Sam. Though the game isn't especially long, the lack of variety in the level objectives gets old fast. Your main objective is to get rid of those Taz Wanted signs, which usually involves some simple puzzle solving, or just plain old platform jumping. You'll see the occasional Taz catcher roaming the levels, always wearing the same blue uniform, but thankfully the worst a Taz catcher can do is, well, catch Taz. This just translates to a small point penalty, and then you're back on your way. In fact, any time Taz gets hurt, be it by drowning, getting attacked by wildlife, or just falling off a really tall cliff, he can jump right back up, dust himself off, and be on his way. All of this, the simple objectives, benign enemies, and your character's invincibility, removes much of the game's challenge. The game can sometimes become difficult, but not because of any malevolent level design. Instead, the game's lousy camera, which is twitchy and hard to adjust, occasionally turns the game's boring platform jumping into frustrating platform jumping. The rest of the game's visual presentation fares only slightly better. Taz and the other characters are cel-shaded, but poorly. The levels look decent and do a good job of re-creating that cheery but twisted Warner Bros. aesthetic with exaggerated level geometry and simple, brightly colored textures. Most of the textures look good, but you'll often catch some blurry, nasty-looking ground textures. The Xbox version of Taz Wanted manages to eliminate the occasional frame rate problems found in the PlayStation 2 version, but considering the fact that the game isn't visually impressive on the less-powerful PlayStation 2, Taz Wanted just doesn't do the Xbox hardware justice. The sound design is also not without its problems, but some of the sound in Taz Wanted is actually pretty good. The voice acting is very competent, though the amount of in-game speech is limited and becomes quickly repetitive, and the speech sounds somewhat muddled, as though it were recorded at a lower bitrate. The soundtrack, while not standard Looney Tunes fare, is pretty consistently catchy, featuring a high-energy rock soundtrack that dynamically changes along with the action. If you're just walking, you get moderate rock. If you're tip-toeing around, the soundtrack becomes very subdued, and the sound of plucked violin strings becomes the most prominent sound. When you start doing a spin attack, the soundtrack suddenly surges, the guitars get louder, and you in full on rock mode, which can make wrecking shop rather satisfying. But the soundtrack just isn't enough to save this game. Though there aren't quite as many 3D platformers on the Xbox as on other platforms, this doesn't make the deficiencies of Taz Wanted any more acceptable--developers can do better, and gamers deserve better. The game's simple objectives and constant hand-holding might've made it suitable for younger players, but its frustrating reliance on awkward platform jumping and its poor camera keep it from being recommendable to anyone at all."}