{"ref": "https://www.gamespot.com/reviews/romance-of-the-three-kingdoms-xi-review/1900-6166361/", "date": "February 23, 2007", "game_name": "Romance of the Three Kingdoms XI", "text": "Whether it's Madden, Final Fantasy, or Romance of the Three Kingdoms, you have to respect a game series with releases numbering in the double digits, because it's a milestone that so few franchises reach. But at some point it gets hard to muster up any sort of anticipation for the next title in a series that peaked about five releases ago. Romance of the Three Kingdoms XI is certainly a solid turn-based strategy game, but it feels tired because it covers the exact same territory as its 10 predecessors--four of which were released on the PlayStation 2 in as many years. The 11th game in the series does overhaul the basic gameplay mechanics, but the net effect of these changes is marginal. This is still a very dense, very slow, no-frills strategy game, but with a forgiving approach and enough time and patience, Romance of the Three Kingdoms XI can still be quite satisfying. Almost the entire game takes place on this large, 3D map of China. Romance of the Three Kingdoms XI once again lets you experience ancient Chinese history as told in the famous novel Romance of the Three Kingdoms. The historical setting is a perfect fit for a strategy game, because without a strong central government at the end of the Han dynasty, China is essentially up for grabs. This sets the stage for seemingly endless conflict among hundreds of officers and factions vying for dominance. It's up to you to take control of a force and do whatever it takes to unify China, which is a nice way of saying that you have to kill or otherwise subjugate all of the other forces on the map. In the previous game in the series, you played as a single officer and recruited other officers, gathered resources, and developed forces personally. In XI, you play as a ruler of an entire force. So for example, instead of relaying your strategy entirely through Cao Cao, you now have direct control of all the cities, officers, and resources in Cao Cao's entire force. It doesn't sound like much of a distinction, but the result is a game that is focused on large-scale strategy rather than the actions of individual officers. There are no longer separate screens for battles and administrative tasks; instead, everything takes place on one large 3D map of China. The city management has also been simplified, and the focus is on amassing a military force, so you'll typically see greater success as a warmonger than as a diplomat. You start off each scenario with at least one city and a handful of officers under your command. Developing a city is as simple as building farms and markets to provide food and gold so you can feed and equip your soldiers. You can use the gold produced by your market to build new facilities such as barracks and smiths, which let you recruit soldiers and make weapons. You'll spend most of your time recruiting soldiers and making weapons, and then you'll move those resources around the map to either fortify your position or expand your reach. Of course, no strategy game would be complete without plenty of battles. All of the battles in the game take place on the same map, which is divided into squares. The military units include ships, cavalry, and foot soldiers, which can be equipped with swords, pikes, spears, and bows, as well as weaponry such as rams and catapults. The different types of units all have specific strengths and weaknesses, but battles are usually decided by which force has the largest numbers. You can eventually research special techniques to make your units more powerful, but they are expensive and take quite awhile to develop. But even with the variety of units and techniques, the battle strategy in XI isn't very involved. Instead, the strategy lies in amassing resources and shuffling them between cities. Although some of the basic mechanics have been simplified, Romance of the Three Kingdoms XI still has a very steep learning curve that will prove daunting for newcomers. The tutorial alone will take three or four hours to get through, and each of the more than 20 available scenarios can easily take 10 or 20 hours to complete. The replay value is nearly endless, but the sheer amount of content is limited by the game's glacial pace. A 20-hour scenario demands a tremendous amount of patience, because you can spend anywhere from five minutes to a half hour on a single turn, only to end that turn almost exactly the same way you began it. If you're willing and able to devote the time and effort that this game requires, you'll find that it can be a lot of fun. After spending hours picking away at an enemy, you'll get a great sense of victory when you finally wipe an opposing force off the map. There are more than two dozen different scenarios to play, and each one can be modified to be played dozens of different ways. There are open-ended scenarios that let you choose which force to play as, as well as preset scenarios that require you to play a specific force. Challenge scenarios are another option, and these require you to focus on a narrow set of objectives rather than simply being the last force standing. The game can also be played with up to seven other players, although that consists of just choosing different forces in one scenario and then passing the controller around each turn. If you don't like any of the hundreds of officers in the game, you can create your own. Because Romance of the Three Kingdoms XI is entirely menu driven, there's not a lot to look at. Most of your time with this game will be spent poring through menus trying to make sense of all of the information on display. The interface is strictly utilitarian, and although you'll eventually get used to it, the menu system could stand to be simplified. It also doesn't help when you have menus and other displays covering up your view of the map, making it difficult to locate anything. And, it takes way too much effort to keep tabs on what all your officers and units are doing, especially later in the game when you're trying to manage a force of dozens of officers and hundreds of thousands of soldiers. Although they're sparse, the painted backgrounds and character portraits all look great. The 3D map looks clean and colorful, especially when the seasons change. The world has a flat, cel-shaded design, which looks fine, but it lacks detail. The sound is functional as well. The rousing score is heavy on chanting and war drums, which fits the game perfectly. The minimal amount of voice acting is passable and is available in both Chinese and English. Although XI doesn't bring anything new to the series, it's still a game that you can really sink your teeth into if you have the time and patience to surmount the steep learning curve. Aside from the previous Romance of the Three Kingdoms games, you won't find another strategy game this involved on the PlayStation 2, so if you have a mind for stat tracking and resource management, you'll certainly get your fill with Romance of the Three Kingdoms XI."}