{"ref": "https://www.gamespot.com/reviews/double-d-dodgeball-review/1900-6194922/", "date": "July 23, 2008", "game_name": "Double D Dodgeball", "text": "Ah, the good old days of recess, good-natured play, and competitive schoolyard matches of dodgeball. Given how glamorous recent film, game, and other media portrayals have made the sport seem, Double D Dodgeball doesn't measure up in presentation or entertainment value to its multimedia cousins. Instead, it is a woefully underdeveloped title that pales in comparison to more attractive Xbox Live Arcade games. A gorillas versus lizards match in space should look way better than this. The setup of dodgeball is simple: You and your teammates take to a court to face off against another team on the opposite side. On the half-court line is a set of three balls. Your team must race to the center, grab a ball, then hurl it at an opponent using the right trigger. When faced with an oncoming projectile, you can grip the right trigger to catch the ball. Doing so not only saves you from being obliterated to the sidelines, but also grants you a power bonus to release a super shot. Battles play out in any of eight arenas, each with its own configuration. Some have obstacles (either destructible or impenetrable), others allow knocked out players to attack opponents from the periphery of enemy territory. Either way, the playing surfaces are made of space, ice, or plasma. The three materials offer little visual flair, but ice adds a slickness to movement and plasma slows character travel. Your dodgeball squad can contain anywhere from two to six members. You control one character, while the AI controls the remaining members when human players aren't present. To call the geometric shapes you control ~characters~ is a bit of a stretch. They better resemble adversaries found in Space Invaders than anything remotely human. They are categorized according to class: the speedy Runner, the blandly named Normal, the deadly Shooter, the clingy Catcher, and the oddly shaped Glass. Names are not this game's strong suit. Unfortunately, neither is anything else. The game tries to put on a good show of variety, but the shallow gameplay will limit your enjoyment. The developer included a modest variety of ball types (fast, heavy, and glass) and the ability to electrify lines (to render those who touch them immobile for a time). Unfortunately, these additions do little to enhance the experience and seem to be more of an afterthought than a sound strategy for fun. The sound effects are uninspired, especially with near-unintelligible voice work that barely achieves mediocrity. Cumbersome menus needlessly delay getting into and out of the gameplay. The online suffers from up to two full seconds of delay. If it weren't for a mix of ridiculously easy achievements, there would be no reason to venture online when the gameplay is even more painful than the offline experience. While the number of players online during review was scant, the overall experience leaves little hope of a burgeoning fan base. Different arenas and playing surfaces add little in the way of meaningful variety. Sure, there are bright colors and crisp particle effects, but charging 800 Microsoft points for a game this shallow and this technically deficient is asking a lot from players without giving much in return."}