{"ref": "https://www.gamespot.com/reviews/namco-museum-battle-collection-review/1900-6131840/", "date": "August 24, 2005", "game_name": "Namco Museum Battle Collection", "text": "Namco's back catalog of arcade games is legendary. Some of the greatest arcade games ever released bear the Namco logo, and for years now, the company has been issuing and reissuing these games in various compilation packages. The rundown is always pretty similar, and it usually includes Pac-Man, Ms. Pac-Man, Galaga, Dig Dug, and so on down the line. Now, the collection is coming to yet another platform with the release of Namco Museum Battle Collection for the PSP. With its longer-than-normal game list and attention to detail, this is one of the better versions of Namco Museum to be released. The Namco Museum is once again open for business. The game list in Battle Collection is broken up into two sides. On one side are the classics: Pac-Man, Ms. Pac-Man, Galaxian, King & Balloon, Galaga, Rally-X, New Rally-X, Bosconian, Dig Dug, Dig Dug II, Xevious, Mappy, The Tower of Druaga, Dragon Buster, Grobda, Motos, and Rolling Thunder. That's a pretty good list of games from Namco's early arcade years, and they're properly re-created. They run at full speed, and the sound and general quality of the emulation appears to be dead-on, though the games have been tweaked a little bit to add pause and options screens. From the options screen, you can mess around with a sound test, adjust a few variables, and choose a display mode. By default, most of the vertically oriented games display in an arranged mode that puts the score and other secondary info off to the side. You can toggle through a few different display options, including one that fills the entire PSP screen, which looks ugly, but it's nice to at least have the option. You can also rotate the game display and controls if you feel more comfortable playing Galaga while holding your PSP sideways. When playing at the default screen size, the graphics look nice and sharp, just like an arcade game should. If you blow the game up to fill the screen, though, it gets disappointingly blurry, whether you maintain the original aspect ratio or not. One of the options on the ~original~ side of the menu is game sharing, but this isn't all that interesting. If you want to share a demo version with a friend, you can send it to him or her via wireless link, but all he or she gets is a handful of the original arcade game, which is limited to one round. Simply handing someone your PSP for a few minutes makes for a much better demo of the game. Also, anyone playing the game--be it off the disc or off the demo via game sharing--needs to be running with firmware version 1.52 or higher. (Version 1.52 is included on the disc for easy updating.) If, for whatever nefarious reason, you're opposed to updating your PSP, then this game, quite simply, isn't for you. Aside from the emulated arcade games, there are also a few new editions of some of the old favorites in the form of ~arranged~ games. These updates have all-new polygonal graphics and new music. This gives you a version of Pac-Man with different mazes and power-ups, a version of New Rally-X with a speed boost option, a version of Galaga with different ship movement patterns and boss battles, and a version of Dig Dug with a bunch of crazy power-ups. You can also play these games with two players, simultaneously, via ad hoc wireless. These new takes on the classics are interesting side bonuses, but the classics are the stars of the show. Battle Collection lets you blow the games up full-screen, but you're better off leaving them the way they are. Overall, the game faithfully duplicates the graphics and sound of the originals and has decent graphics and sound for the new arranged games. There's nothing here that will blow your mind, but it's not like you'd go into a classics pack expecting state-of-the-art graphics, anyway. It accomplishes what it sets out to do and does it well. The main menu is functional but looks a little dull. Also, it would have been nice to have had game instructions included or some additional artwork or something. As it stands, this collection has the games...and nothing else. Considering that there are a lot of games on the disc, the lack of extras isn't a big deal. At least it does you the solid of saving your high scores and configurations. If you're a fan of the classics and you haven't already burned yourself by purchasing the other 15 or so versions of Namco Museum that have been released over the years, or if you're just looking to take an arcade-perfect version of Galaga around with you in your pocket, the PSP edition of Namco Museum's a good choice. While you could ask for a few more frills here and there, it has a great list of games, and they're presented just fine."}