{"ref": "https://www.gamespot.com/reviews/romance-of-the-three-kingdoms-ix-review/1900-6090475/", "date": "May 17, 2006", "game_name": "Romance of the Three Kingdoms IX", "text": "Another year, another Romance of the Three Kingdoms. Or in the case of the ninth installment in this long-lived strategy series, another six months. Indeed, Romance VIII was just released late last August, and already we've got Romance of the Three Kingdoms IX on our hands. How can Koei crank these games out at such a rapid pace (which is, ironically, in stark contrast to the plodding pace of the gameplay itself)? Well, one look at the game will tell you that the simplistic production values probably don't require a lot of man-hours to produce. This doesn't mean, however, that the game isn't packed with the same dense, statistics-based strategy that fans have long-expected from the series. In other words, if you liked Romance of the Three Kingdoms already, this is even more of what you're looking for. Travel back to Ancient China, once again, in Romance of the Three Kingdoms IX. If you're even the slightest bit familiar with Koei and its machinations, we probably don't need to illuminate the story in Romance of the Three Kingdoms IX for you. But if you've never heard of this series or Dynasty Warriors, its hack-and-slash counterpart, here's a primer. The ancient text Romance of the Three Kingdoms details the period of military and political turmoil that befell Ancient China in the second and third centuries AD, which occurred after the fall of the Han Dynasty. The game, as you might imagine, is based on this same period and casts you in the role of an aspiring ruler who's attempting to quell opposing factions so that he or she can ultimately unify the warring states of China (under one banner, of course). This is essentially the only winning (or losing) condition, so once all of China swears allegiance to a single name, the game is over. If you manage to work the military and diplomatic angles in equal measure, that name will be yours. The actual gameplay in Romance of the Three Kingdoms is pretty consistent from game to game. Basically, it focuses on the delicate balance of relationships that exist between a group of states that are all vying for supremacy in a tense, warlike atmosphere. Unlike in previous games, which had you starting low and working your way up through the command hierarchy, Romance IX immediately puts you in the role of ruler, thus demanding from you all of your managerial skills at the outset of the game. You'll have to work the diplomatic angle as much as possible by gaining allies and smoothing over hostilities, while at the same time you must prepare your strongholds and armies for the inevitable conflicts that will arise as you march toward unification. The game is played out in a turn-based fashion, and with each turn you'll give your many officers tasks to complete that will further the goals of your kingdom. There are an awful lot of things you can do to alter your relations with other kingdoms (which includes sending gifts, starting rumors, and laying siege, among other things), or you can increase your own military might (by conscripting troops, building outposts, and fortifying city defenses, among other things). All of this is carried out through simple menu options, so you'll spend most of your time reading text and interpreting statistics. The game contains a multitude of starting scenarios that are based on either historical events or the designers' imaginations, so you'll be able to start new games with lots of different circumstances, like which territories are controlled by which factions, for instance. You can even sort of play with up to eight players, though you'll just pass the controller around as you take turns in the game. Romance IX's map-screen makes it easier to see what's going on between your kingdom and your foes'. If all of this sounds a little abstract, well, it is. The gameplay in Romance IX (as in the whole series) mostly consists of managing lots of numbers and maps, which are populated by little squares that represent your territory and that of your enemies. You have numerical statistics for just about everything you can imagine. The reputation of a city, the amount of food you have, the many statistics for each of your officers--just about everything has a stat attached to it, so if you don't like crunching numbers, you'll find Romance IX's screens extremely daunting. But if you were raised on classic strategy games, you should feel pretty well at home. Despite the series' extreme number of sequels and the high frequency of releases, Koei always manages to make its Romance of the Three Kingdoms games look quite different from one another. Romance IX is no exception, so the first thing you'll notice is the way the game portrays the entirety of China in one navigable map. Previous games mostly portrayed the cities of China as static background art with no discernible geographic links to one another; as a result, your perception of the relationships between different territories and empires was often vague. Romance IX's single-map display shows all territories, cities, and barriers right in one place, so you can more tangibly grasp who's doing what to whom. You'll actually see armies on the march to war this time around (although they're only represented by tiny sprites), and thanks to touches like this, it generally feels like your actions have a more immediate effect than in previous series' entries. While the game looks plain in some spots, it generally looks decent. There are a few new mechanical additions at work here, too, such as a personality variable that affects how officers respond to you. Additionally, there's the ability to conduct diplomatic and military operations simultaneously. The strategy is dense and complicated, but it works if you can handle it. Perhaps thanks to the runaway success of the Dynasty Warriors series, Koei has dressed up Romance of the Three Kingdoms' presentation a little bit in this iteration. There's a decent amount of tasteful, hand-painted art that accompanies the story sequences, as well as authentic Chinese dialogue (accompanied by English subtitles) that explains the circumstances you're in. The Moscow Symphony Orchestra ably performs Romance IX's appealing score, and in a game with so much repetition, it's nice to have an aural backdrop so pleasing to the ear. The actual in-game visuals are nothing to write home about in this day and age, since everything is represented by flat 2D graphics that don't animate much. Then again, this kind of visual style is almost expected in this kind of game because flashy 3D graphics would almost surely get in the way. As a result, it's not that big of a deal. If you're interested in the complicated strategy gameplay found here, you're probably not really looking for graphical pizzazz anyway. As always, the big caveat with Romance of the Three Kingdoms is that it's meant for a very specific audience that likes slow, thought-intensive games that don't present any substantial action. If that's what you're into, Romance IX is a worthy new entry in the genre. If you want to get into it, there's a decent online tutorial available that walks you through the learning process. Romance IX manages to make a few improvements to the interface and systems from the previous games while still retaining the core of what made them good. Ultimately, it's more of what you already love--that is, assuming you loved it to begin with."}