{"ref": "https://www.gamespot.com/reviews/knockout-kings-2001-review/1900-2684797/", "date": "May 17, 2006", "game_name": "Knockout Kings 2001", "text": "Knockout Kings 2001 is visually amazing and features an incredible lineup of boxing legends, both past and present. Unfortunately, it fails to improve on the series' arcade style of play, which largely consists of blocking and punching. While this may appeal to fans who simply want to choose their favorite fighter and beat up on friends in the game's two-player mode, die-hard boxing fans who appreciate the more intricate subtleties of the sport's offensive and defensive tactics will find that the game is an oversimplified exercise in blocking and counterpunching. The game has three basic modes of play: slugfest, career, and exhibition. The career mode lets you climb the ranks of a particular weight class in the hopes of a shot at the title. The game, of course, has an all-star lineup of boxers, including great fighters from the past and present such as Muhammad Ali, Joe Frazier, ~Sugar~ Shane Mosely, Diego Corales, Floyd Mayweather, Lennox Lewis, David Tua, and Evander Holyfield. The game features almost all of the fighters you could want, with the only noticeable exception being Felix Trinidad. The boxers in the game hail from three weight divisions: lightweight, middleweight, and heavyweight. The game also features several hidden athletes, such as Jason Giambi and Junior Seau, whom you can unlock during play. In addition, the game includes a fairly robust create-a-boxer feature that lets you tailor a fighter to your visual and fighting-style preferences. Anyone who has ever played any of the previous Knockout Kings games will instantly feel at home with Knockout Kings 2001, as it employs the same control scheme as previous installments in the series. The game has all of the punches, defensive moves, and illegal moves that you'll find in the real sport. The problem is that the execution of these moves is so complicated, they're of little use during an actual bout. In addition, your fighters move very slowly, so they can't get out of the way of their opponents' punches with any regularity. These conditions degrade the game into a test of reflexes that leaves you with only one real option--block and fire back with counterpunches. Visually, Knockout Kings 2001 on the PS2 is impressive, thanks largely in part to the game's use of CyberScan technology, which makes the fighters in the game look almost exactly like their real-life counterparts. These skin textures, matched with some impressive animation, give Knockout Kings 2001 a very realistic look and feel. Outside of the ring, the game's animated crowds and detailed arenas add to the game's realistic atmosphere. The only problem Knockout Kings 2001 has visually is an animation hiccup that occurs when a boxer gets knocked down. The hiccup kills the thrill of the knockdown to a certain extent, which is unfortunate. In the audio department, the game features a wide variety of music that fits the game well. The rest of the game's aural presentation has a totally authentic feel thanks to the voice work provided by several real-life boxing icons, including referees Mills Lane and Richard Steele. In addition, Al Bernstein and Teddy Atlas provide commentary and analysis, while Jimmy Lennon Jr. handles ring announcements. The commentary, while adequate, repeats itself quite often. Landing the same punch several times in a row often results in hearing the same comment about that punch several times in a row as well. Knockout Kings 2001 is more of a hitting simulation than a boxing simulation, which is a complete turnoff for die-hard boxing fans who want realism. Casual fans who just want to play as their favorite fighters may find that the game's impressive graphics and all-star lineup of boxers are enough to warrant a purchase. For fans of the Knockout Kings series, Knockout Kings 2001 isn't anything new--the graphics are pretty, but the game is, for the most part, identical to previous PlayStation incarnations."}