{"ref": "https://www.gamespot.com/reviews/singstar-amped-review/1900-6179415/", "date": "September 20, 2007", "game_name": "SingStar Amped", "text": "Sony continues to establish a foothold in the American market for its SingStar karaoke franchise with two more releases, SingStar '80s and SingStar Amped. The former ought to be self-explanatory--sing your favorite cheesy pop songs from the 1980s--and the latter focuses on classic and contemporary rock music. Both of these games are essentially identical in feature set and presentation to the last two SingStar games, Pop and Rocks! That makes them both serviceable, no-frills karaoke packages, and the only real difference between the two is their song lists, both of which have turned out to be pretty solid. If someone at your party starts singing this without making the goofy David Byrne faces, you have the legal right to punch them in the solar plexus. By its very name, SingStar Rocks! purported to deliver a hard-rocking karaoke experience, but its lineup included baffling choices such as Gloria Gaynor and Elton John. Amped gives a more cohesive tracklist, though. Every artist on the disc can be easily described in rock terms, with notable names appearing such as Alice in Chains, Audioslave, Blink 182, Cheap Trick, Judas Priest, Pearl Jam, Radiohead, the Ramones, Steppenwolf, Sublime, and ZZ Top. They're almost all A-sides, too; you'll find classic anthems such as Steppenwolf's ~Born to Be Wild~ and Boston's ~More Than a Feeling~ mixed in with contemporary hits from the Foo Fighters (~Best of You~) and Nirvana (~Come as You Are~). The tracklist on Amped makes you feel that some real thought was put into the lineup of artists and songs, more so than in past SingStar games. If you haven't played a SingStar game before, all of the ones released so far on the PlayStation 2 offer an identical, spartan menu setup that lets you play individual songs for score, as well as engage in a number of competitive and party games for between two and eight players. These include rapid-fire song medleys, score attacks, pass-the-mic challenges, and so on. You've also got the ability to record your performances for later playback and review, and to make yourself sound like a robot with one of several vocal filters. As with the previous games, you get music videos of the various artists performing as you sing their songs, but you can also plug in the EyeToy camera if you want to see yourself dancing awkwardly behind the lyrics instead. Like previous versions, both '80s and Amped come in $50 retail packages that offer a quality pair of microphones and a USB adapter. But previous SingStar owners can also nab the games individually for $30 apiece. Each game has 30 songs on its list, and considering that the de facto music-industry pricing for song downloads is around $1 these days, that makes for a reasonable deal. These PS2 SingStar games will likely start to feel antiquated after the more feature-rich, online-enabled PlayStation 3 version hits later this year, but for now, they'll do a fine job for your typical Friday night sing-along."}