{"ref": "https://www.gamespot.com/reviews/the-sims-2-pets-review/1900-6160179/", "date": "October 19, 2006", "game_name": "The Sims 2: Pets", "text": "The Sims series started on the PC as a popular and difficult-to-describe strategy game that let you control the lives of little computer people in the houses you built for them, as they loved, grew old, had families, and occasionally used the potty. Seven years, several different game platforms, and numerous editions later, the series has become known for offering zany humor, colorful graphics, a gibberish language that its ~sim~ characters speak (known as ~simlish~), and cheerful music. However, the console versions of the Sims games never quite stacked up to the PC version, mainly because the console games tended to focus on collection-based minigames and unlocking hidden items. Also, they never seemed to capture the autonomous, unpredictable artificial intelligence that powered those happy little sims in the PC versions. However, The Sims 2: Pets for the GameCube ends up being closer to The Sims 2's occasionally unpredictable gameplay than any other console Sims game to date, and it adds in some additional pet-based gameplay, while keeping the console versions' typical collection gameplay in the form of cooking recipes. If you've ever wanted to put a camouflage hoodie and pink tennis shoes on a Siamese cat, The Sims 2: Pets is your game. The GameCube version of Pets adds three main types of domestic animals: aquarium fish, cats, and dogs. Fish don't do much more than get fed and provide some amusement when stared at (your sims can collect them from the world and bring them home to toss into the tank), so cats and dogs are really the only interesting pets in the game. You can create canines and felines from a great number of different breeds and can use tons of customization options to choose size, age, different ear types, and fur color patterns. And in the console versions of the game, you can be one of those awful, awful people that dresses up their pets with an entire wardrobe, including hats, sunglasses, neckerchiefs, shirts, and tiny little tennis shoes. That's in addition to your pet's personality, such as whether your pet is friendly or aloof; neat or messy; or quick to learn new tricks or a bit slower on the draw. If those last few sentences got you excited, there's a good chance that The Sims 2: Pets is for you. That's because pets--dogs and cats, anyway--essentially function like limited people in the game. You can't take direct control of dogs or cats, but you can teach them new skills (pet tricks) by spending virtual hours (which equates to several minutes of real time) of your day until they learn how to sit, shake hands, and roll over; similar to how you can improve your sims' marketability by spending virtual hours repeatedly training at skills like charisma, repair, and cleaning. You can use interactions with them to fulfill your sims' social needs (so yes, you can play as a ~crazy cat lady~ who associates only with her housecats), just like you can with live-in family members. Unfortunately, the GameCube version of the game, unlike the PC version, doesn't let you send your pets to work to earn money--instead, it offers a single downtown area focused entirely on pets and lets you earn ~pet points~ to spend on chew toys, doggie treats, and other animal accessories. Spending pet points also unlocks the game's many hidden items and social interactions. Training a pet to perform tricks sounds interesting, but it seems to be more trouble than it's worth. Dogs and cats can also interact with each other and, based on the personality you've given them, they may get into fights with the neighbors' pets, or may get friendly with them. In the meantime, if you happen to care about your house's property value, your dogs and cats are always works-in-progress, since you must constantly catch even the best-behaved pets in the act of destroying furniture, digging up the yard, or relieving themselves in the house so that you can scold them--which teaches them not to do such things. (Alternately, if you care to, you can try to breed the biggest jerk of a cat or dog in SimCity by repeatedly praising your pet for destructive behavior, then turn it loose downtown.) Either way, patterning your pets' behavior is surprisingly time-consuming and not always convenient--if you want to have a well-behaved pet, you have to always keep an eye on it, and constantly drop what you're doing to dash over and scold or praise it--and once you get there, actually giving your pet that feedback takes a little while too. It also seems to take quite some time before constant scolding or praising even sinks in with the brightest pets...and if you decide to have any of your sims take a job, that just means less time for your sims to spend together teaching your pets. This is the main issue with the way cats and dogs work in the game--trying to create the perfect pet, or even a decent one, is difficult to schedule in the bustling world of The Sims 2, where your sims are also trying to make it in the working world themselves, build up their own skill points, pursue their wants and life-goals, and take care of their own personal needs for food, rest, and social interaction. While the console versions don't offer the complexity that the PC game's many expansion packs do, you'll probably still have trouble keeping up with the conflicting needs of both your sims and pets, which are both demanding and require separate blocks of time in any given virtual day. However, if you're a console owner and haven't had a chance to try out the PC version of The Sims 2, Pets will give you a pretty good sense of what you've been missing. The game includes improved artificial intelligence over the 2005 console version of The Sims 2, as well as The Sims 2's want- and aspiration-based gameplay, so you could just as easily put your pets in the background and focus primarily on character interactions (though you'll still find occasional glitches with characters getting stuck on geometry or having pathfinding problems around simple obstacles). The console version of Pets only offers a single neighborhood with multiple houses and only a single downtown lot, presumably due to technical constraints, but if that's all you're after, you'll find it here. Even without the animals, The Sims 2: Pets offers the most authentic Sims 2 experience on a console to date. Otherwise, the game adds some new music tracks that fit in just fine, and like the console version of The Sims 2, it borrows music liberally from the 2004 PC game. And pets also offers well-suited animal noises (dogs barking, cats purring, and so on) that are just as expressive as the still-upbeat gibberish ~simlish~ language that sims use to communicate with each other, and now to coo at and criticize their animal friends. While the expansion doesn't add a new set of out-of-home ~lots,~ the out-of-home areas that sims can visit by calling a cab, it does add new objects for your home and new household items and clothing options. These all look just fine and seem to fit in very well with the colorful, though perhaps not cutting-edge look and feel of the console versions of The Sims 2, although the GameCube version has a brighter, cleaner look and slightly shorter loading times than its PS2 cousin. It's true that the pet-related content in the console versions of The Sims 2: Pets, while interesting, doesn't seem perfectly implemented. But surprisingly, the open-ended, unpredictable Sims 2 experience seems to work much better in Pets than in any other console game. It's perhaps unfortunate that it took this long to replicate a good PC Sims experience on consoles, but if that's what you've been waiting for, you'll find it in The Sims 2: Pets. And if you're just in it for the collection and unlocking mini-games as in the previous console Sims games, you'll find those here too."}