{"ref": "https://www.gamespot.com/reviews/ea-replay-review/1900-6163100/", "date": "December 12, 2006", "game_name": "EA Replay", "text": "Electronic Arts seems like one of the last companies to cash in on its past with some sort of retro compilation, but it has finally happened. EA Replay for the PSP is a collection of games from the 16-bit era. These Super Nintendo Entertainment System and Genesis games are re-created nearly perfectly on the PSP, which is great, but the game selection leaves a lot to be desired. EA Replay contains 14 games from EA's 16-bit library. The biggest problem with EA Replay is that you aren't getting the best versions of some of the games in the compilation. For example, Syndicate was an amazing PC game in its day. It had you controlling a bunch of trench-coat-wearing thugs in a futuristic gang war. But the Super Nintendo version, which is included in EA Replay, is a total mess, with bad controls that ruin the experience. You also get Ultima: The Black Gate, Wing Commander, and Wing Commander: Secret Missions. Secret Missions was available only on the Super Nintendo, but still, people who want to play a Wing Commander game are thinking about the PC version. Plenty of the other games in this collection are just fine, though, like Jungle Strike and Desert Strike or the first three Road Rash games for the Genesis. Mutant League Football, EA's violent twist on the Madden series, is also included. The games play just like their original console counterparts, and like all compilations of old games, some of the games hold up a bit better than others. Mutant League Football is still an exciting game, but the Road Rash games don't look so great these days. As for the two Strike games, their clunky helicopter controls were acceptable back when they were first released, but the controls are a bit harder to swallow after all these years. Graphically, the games look like the console originals. While the screen defaults to 16:9, you can reduce the aspect ratio to the proper 4:3 ratio--this is how these games were meant to be seen, and stretching them out makes them look ugly. Actually, most of these games look fairly ugly at this point, regardless of how you set the screen. The sound is also kind of unappealing. Remember how treble-filled and grindy most of EA's Genesis games were? All that fake rock guitar really adds up, and when you start pumping it out of the shrill and sometimes tinny-sounding PSP speakers, it gets to be a little too much to take. The collection is also very short on extras. You get a game info page and the ability to save at any point and resume from that saved point, but that's about it. Also, the multiplayer games let you play two-player over an ad hoc connection. There's not much to EA Replay, and even though it's going for $19.99, it's really not for anyone who isn't specifically jonesing to play one or more of these games again. While one or two of these games are genuine classics, the 16-bit stuff just doesn't seem to hold up as well as some other old video games, making even the highlights on this disc tough to come back to."}