{"ref": "https://www.gamespot.com/reviews/tamagotchi-connection-corner-shop-review/1900-6143504/", "date": "May 17, 2006", "game_name": "Tamagotchi Connection: Corner Shop", "text": "Chances are you or someone you know has a Tamagotchi lying around in a junk drawer or shoebox somewhere. After all, there were about a billion of the little virtual pets sold in the late '90s. But the Tamagotchi phenomenon died as quickly as it started, leaving behind a lot of clunky key chains and a bit of filler for a VH1 clip show. Despite falling way off the radar, Tamagotchi is still around years later, now with a new generation of virtual pets called Tamagotchi Connection and a Nintendo DS game to match. It's a Tamagotchi game that doesn't require you to feed, discipline, or take care of a pet, which is nice. Tamagotchi Connection: Corner Shop is a quirky collection of minigames starring the cutely bizarre creatures from the Tamagotchi universe. Despite being based on the virtual pet license, Corner Shop is not actually a virtual pet game. When you start, you can choose one of three Tamagotchi to act as your partner, but the only difference between the three characters is the theme music, clothes, and the order in which all the shops are unlocked as you play. You and your partner can then go to work in various shops to earn gotchi points, which you can then use to purchase snacks, clothes, and furniture to ~care~ for your Tamagotchi. None of that is necessary though, since your Tamagotchi's response to these items has no effect whatsoever on the game. The entire care mode is just a very basic way for you to customize your game. As implied by the title, this game revolves around small stores that you can run with the help of your Tamagotchi partner. You start out with only two types of stores, but you can upgrade as you work in each one, and in doing so, you'll unlock new types of stores. There are 11 stores in all, and working in each store means playing a minigame over and over to earn gotchi points. The eclectic selection of stores includes a dentist, a beauty shop, a flower shop, a music hall, a bakery, and more. Each shop has an associated task that you must complete for each customer by using the touch screen. Despite the thematic variety, the tasks mostly boil down to repeating the same few processes, ad nauseam. The cleaner shop has you washing and ironing clothes, mending holes, and removing stains. There's a spa where you have to cater to customers as they soak in a hot spring. Pictures will appear in little thought bubbles above the customers' heads and you simply have to select the corresponding items and give them to the customers. In the beauty shop, a customer will give you a picture of what he or she wants to look like, and you then use makeup and accessories to perform a proper makeover. The bakery has you decorating cakes with icing and toppings according to a pattern given to you by each customer. The patterns are all simple and they tend to repeat often. The florist shop is quite similar, in that you just have to select the right color of flowers, choose a wrapping and a ribbon, and select a card. You can also create brooches and necklaces in the jewelry shop. A customer will give you a pattern, which you have to copy by placing the right stones and nuts in the right spots and then securing everything using a needle and thread (no complicated patchwork to worry about; scribbling all over works just fine). Finally, a game that lets you drill the teeth of cute little animals. The takoyaki shop has you making dumplings for customers. Once you get the process down, there's nothing to this game. The only variable is the number of dumplings in each order, and otherwise all the ingredients and procedures are exactly the same every time. You oil a pan, drop in some dough, sprinkle on the ingredients, use a pick to separate and flip the dumplings, then arrange them on a plate and top with sauce, seaweed, and fish flakes, and that's it. The music hall is a bit different from the rest of the shops, and it requires you to tap pictures of instruments along with a song. It's simple, but it gets dull quickly because you don't get any immediate feedback on how you're doing. Instead, you have to wait until the end of the song to get a rating between zero and three smiley faces. The most interesting and fun shop is the dentist, where you have to help customers who come in with toothaches, cavities, and missing teeth. You can select a drill to drill out a cavity, select colored wadding to fill in the hole, and then clean it all up with a toothbrush. If you take too long, the customer will start to cry, at which point you can administer a shot of Novocain or just let him or her suffer. If they suffer too much, they'll leave and you won't get paid. You can spend all your gotchi points on new clothes, furniture, and snacks for your Tamagotchi friend. There are two special hybrid shops that you can unlock by upgrading other shops. The florist jeweler is a mix between a jewelry store and a florist, so you just make necklaces and brooches with flowers instead of gems. The strangest store is the dental salon, where all the Tamagotchi go to get some grill work done. Customers will give you a picture of what they want their teeth to look like, and you just have to copy the look using various colored glazes, letters, silver etchings, and accessories like diamonds or pink bows. In all of the shops you get rated on your performance, but the rating has no effect on your earnings. The only way to do poorly at any of the minigames is to just take too long performing a task. That isn't much of a threat, though, since the customers are extremely tolerant. In fact, they're so tolerant that even if you completely botch the job, or do nothing at all and just click the Done tab, you'll still get paid the same. This is true for all of the minigames, and it removes any sort of challenge or incentive to keep playing. Most of the minigames are fun for at least a few minutes, and they do make good use of the DS touch screen. But the novelty quickly wears off and you're left with a lot of fairly menial and repetitive diversions. You'll eventually earn upgrades for each shop. You can upgrade a shop three times, but there's not much that changes with each upgrade. You get a little bit more money per customer, and you might see some slightly more challenging requests, but for the most part the upgrades are only important because they allow you to open up other types of shops. Once you've unlocked all the shops, the only reason to keep playing is to earn money to purchase items for your Tamagotchi. However, most of the items aren't worth the time and effort required to earn the money. For example, you can decorate a hundred cakes to buy a bookshelf, which you can then place in your Tamagotchi's room and look at, but that isn't much of a reward. The best part of Corner Store is the unique sense of style. The back of the box advertises the fact that this game is from the creators of PaRappa the Rapper, and indeed you can spot the similarities. The 2D characters are all colorful and crudely drawn, but they fit perfectly with the quirky theme of the game. The backgrounds are equally crude and cheerful, and they all look good despite the simplicity. The interface is all managed with tabbed menus. There are tabs along the left and right edges of the screen, which you touch with the stylus to access menus, where you can select items you need for each minigame. This menu system works fairly well, although it feels a bit convoluted when you start getting into submenus. The best part of Corner Shop is its wacky sense of style. The sound in the game is good, too. The tunes are catchy and upbeat, which is just what you need when you're drilling teeth or arranging bouquets. The creatures do speak, but it's a squealing gibberish that sounds a lot like the language the creatures speak in Animal Crossing. The sound effects are mostly variations of the voices of the creatures, so while it sounds interesting and cute at first, it can get annoying to hear the same weird noise every time you put icing on a cake or brush a tooth. Tamagotchi Connection: Corner Shop is fun at first, but the novelty is fleeting. There just isn't enough here to keep you occupied for more than a few hours. You can unlock and upgrade every shop in the game in a few hours, and beyond that there just isn't much to do. You can link up with a friend to trade gifts, and you can also let a friend download a demo of the game, for which you'll get one gotchi point. If you're looking for a virtual pet experience, you won't find it here. But if you just like to play with the touch screen and don't mind a lot of repetition, then you'll find a few hours of light fun in Corner Shop. The most interesting and fun shop is the dentist, where you have to help customers who come in with toothaches, cavities, and missing teeth. You can select a drill to drill out a cavity, select colored wadding to fill in the hole, and then clean it all up with a toothbrush. If you take too long, the customer will start to cry, at which point you can administer a shot of Novocain or just let him or her suffer. If they suffer too much, they'll leave and you won't get paid. You can spend all your gotchi points on new clothes, furniture, and snacks for your Tamagotchi friend. There are two special hybrid shops that you can unlock by upgrading other shops. The florist jeweler is a mix between a jewelry store and a florist, so you just make necklaces and brooches with flowers instead of gems. The strangest store is the dental salon, where all the Tamagotchi go to get some grill work done. Customers will give you a picture of what they want their teeth to look like, and you just have to copy the look using various colored glazes, letters, silver etchings, and accessories like diamonds or pink bows. In all of the shops you get rated on your performance, but the rating has no effect on your earnings. The only way to do poorly at any of the minigames is to just take too long performing a task. That isn't much of a threat, though, since the customers are extremely tolerant. In fact, they're so tolerant that even if you completely botch the job, or do nothing at all and just click the Done tab, you'll still get paid the same. This is true for all of the minigames, and it removes any sort of challenge or incentive to keep playing. Most of the minigames are fun for at least a few minutes, and they do make good use of the DS touch screen. But the novelty quickly wears off and you're left with a lot of fairly menial and repetitive diversions. You'll eventually earn upgrades for each shop. You can upgrade a shop three times, but there's not much that changes with each upgrade. You get a little bit more money per customer, and you might see some slightly more challenging requests, but for the most part the upgrades are only important because they allow you to open up other types of shops. Once you've unlocked all the shops, the only reason to keep playing is to earn money to purchase items for your Tamagotchi. However, most of the items aren't worth the time and effort required to earn the money. For example, you can decorate a hundred cakes to buy a bookshelf, which you can then place in your Tamagotchi's room and look at, but that isn't much of a reward. The best part of Corner Store is the unique sense of style. The back of the box advertises the fact that this game is from the creators of PaRappa the Rapper, and indeed you can spot the similarities. The 2D characters are all colorful and crudely drawn, but they fit perfectly with the quirky theme of the game. The backgrounds are equally crude and cheerful, and they all look good despite the simplicity. The interface is all managed with tabbed menus. There are tabs along the left and right edges of the screen, which you touch with the stylus to access menus, where you can select items you need for each minigame. This menu system works fairly well, although it feels a bit convoluted when you start getting into submenus. The best part of Corner Shop is its wacky sense of style. The sound in the game is good, too. The tunes are catchy and upbeat, which is just what you need when you're drilling teeth or arranging bouquets. The creatures do speak, but it's a squealing gibberish that sounds a lot like the language the creatures speak in Animal Crossing. The sound effects are mostly variations of the voices of the creatures, so while it sounds interesting and cute at first, it can get annoying to hear the same weird noise every time you put icing on a cake or brush a tooth. Tamagotchi Connection: Corner Shop is fun at first, but the novelty is fleeting. There just isn't enough here to keep you occupied for more than a few hours. You can unlock and upgrade every shop in the game in a few hours, and beyond that there just isn't much to do. You can link up with a friend to trade gifts, and you can also let a friend download a demo of the game, for which you'll get one gotchi point. If you're looking for a virtual pet experience, you won't find it here. But if you just like to play with the touch screen and don't mind a lot of repetition, then you'll find a few hours of light fun in Corner Shop."}