{"ref": "https://www.gamespot.com/reviews/arc-the-lad-end-of-darkness-review/1900-6128083/", "date": "May 17, 2006", "game_name": "Arc the Lad: End of Darkness", "text": "Arc the Lad has been around long enough to be a grown man by now. For nearly a decade, the Arc series of role-playing games has appeared on Sony consoles in Japan and the US. Past installments in the series have been fairly standard turn-based role-playing games set in a fantasy universe that threatens to implode every so often, unless a group of unlikely heroes comes along to save the day--which, conveniently, it always does. End of Darkness moves into new territory, as it's the first entry in the series to feature online play and an action-oriented battle system. Unfortunately, the new battle system is mindless and repetitive, and the online multiplayer does nothing to mitigate the weak single-player campaign, lifeless characters, and dull presentation of the game. Approach the counter at a hunters' guild to take on tasks so you can earn experience and increase your rank. Arc the Lad: End of Darkness takes place in the same universe as Twilight of the Spirits and is set five years after the events of it. You play as Edda, a young orphan boy who has, until now, led a simple but unexciting life on an isolated island. Eventually, Edda realizes that he's an exorcist who's capable of dispatching the evil darmysts, later known as malademons, that have been popping up to attack people throughout the world. These malademons are the manifestations of the ~bad feelings~ in the hearts of man, and the only way to destroy them is to exorcise the evil that pervades these beings. After an initial encounter with a malademon, Edda decides to join the hunter's guild to use his powers to rid the world of evil. As Edda investigates, he finds out there's a terrorist group known as Truth Sword that's threatening to ~cleanse~ the world of the destructive and ignorant humans. Edda also finds himself meeting up with an enigmatic and ill-tempered young woman named Kirika, who seems to have some connection to Truth Sword. As you progress through the story, you'll discover more about Edda's past, the origins of the malademons, and what has become of the characters that saved the world from ruin in Twilight of the Spirits. The story is generic and clich, and if you've ever played a role-playing game, you'll recognize all the worn-out themes present here. Amnesia, magic versus technology, tumultuous race relations, a dying world... It's all here, and it's wrapped up in one bland, uninspired package. The story unfolds incrementally as you complete various tasks throughout the game. As a hunter, you can go to a guild where you'll be able to take on tasks from either the notice board or the counter. The counter tasks are short and are divided into classes based on difficulty. A more difficult task will earn you more experience points, but the risk is greater, because the spells you equip to your ALD--a wristband infused with special energy that lets hunters equip skills cards--will be lost if you fail to complete a task. Notice-board tasks are longer and multitiered, often requiring you to meet multiple objectives before the task is finished. Completing the notice-board tasks not only progresses the story, but it also nets you dignity points, which are required to level up. As with the counter tasks, notice-board tasks are classified according to rank, so you can only complete a veteran task if your hunter rank is veteran, and so on. Once you have 10 dignity points and 10 experience points, you can go to the hunter exam center to take a promotion exam to increase your rank. The exams consist of a series of three battles that must be completed within a certain time frame. As your rank increases, your stats will improve, and you'll be able to take on more-advanced tasks to further the storyline. However, the result of this task system is a storyline that feels disjointed, because it unfolds through several small, tangentially related events. Whether you choose a counter task or a notice-board task, you'll have to be prepared to fight. The battle system is entirely action-oriented, much like the basic combat system found in games like Champions of Norrath. You'll only ever control a single character in battle, although with the right cards, you can play as other characters from past Arc the Lad games, as there are more than 20 character cards in all. These other characters can only be used when completing counter tasks or when playing online, because, unfortunately, most of these characters don't factor into the story at all. So the novelty of getting to see your favorite characters from Twilight of the Spirits again is fleeting. While some of the counter tasks require you to capture a monster, arrest a criminal, or find an object, you'll still just be hacking and slashing monsters most of the time. All your items and skills are based on cards, which you can purchase at shops or find on the battlefield. You can assign specific magic or techniques to each of the four face buttons, and you can use them by holding R2. Using magic or techniques requires ~card points,~ which are held in a tank that is replenished slowly by the card points stored in your subtanks. During battle, you can hold the triangle button to regenerate your card points faster, but doing so leaves you vulnerable to attack. However, in most battles, a simple attack will suffice. As a result, you'll just be tapping X repeatedly to perform slashes and combo attacks. And by tapping the X button three or four times, you'll perform a combo of two to four strikes that does more damage but leaves you open to counterattacks. You can target enemies using the L2 button before moving in for an attack. For the most part, battles are extremely easy, since most enemies aren't quick or clever enough to avoid your attacks. However, it's easy to get trapped in a corner where you'll quickly get pummeled by a group of enemies. When you get knocked down, you'll be invulnerable to attacks for a few seconds. However, you still can't run past enemies that block your path, so you just end up getting slaughtered due to some poor level design. Another source of frustration in battle is the camera. You can lock on to enemies using the L2 button, and you can sidestep around them with L1 and R1. And when you're locked on to an enemy, the camera pulls in close to the action, which can be helpful. But often the camera will get stuck behind a tree, a crate, or another part of the level. Subsequently, you won't be able to see what you're doing. Pressing L2 again either cancels the lock-on or switches it to another enemy. However, you don't always feel in control of the targeting system, so it's often easier to avoid the lock-on targeting altogether, unless you're using ranged attacks or magic. In addition to the generic bad guys, you'll occassionally fight malademons, which look exactly like any other enemy but have a black mist around them. The malademons are stronger, faster, and more aggressive than normal enemies. Once you inflict enough damage to a malademon, it will be stunned, at which point you can press the circle button to perform a special exorcism attack. Exorcising enemies earns you spirit points that are later used to increase the rank of other characters in your party. Darc's back and ready to save the world once more or just run around beating up multicolored blobs of ooze. Aside from earning spirit points and collecting dropped cards and items, there's no reason to fight any enemies unless your task objective specifically requires it. You don't gain experience points from fighting monsters, and, for the most part, you can run right past any enemies you encounter. During battle, you can't progress to the next area if you've been spotted by an enemy, but you can quickly lose him or her and move on without consequence. While the lack of experience points and leveling helps make online play slightly more balanced than it otherwise would be, it makes the battles feel ancillary and unnecessary. Killing enemies will get you cards, but most cards aren't that important. The only cards that are really worth searching for are character cards. Most of the other cards can be purchased or created through the process of synthesis. Card synthesis is the procedure of combining two cards to create a single, more powerful card. For example, you can combine a cure card with a magical stone to get a ~cure 2~ card. It's easy to try various combinations to see what you get, because there's no penalty for creating a bad combo. In addition to the overly simplified and unsatisfying combat, End of Darkness doesn't look or sound impressive, either. The entire world is made up of five continents, each with a single town. The towns are empty and, for the most part, devoid of any signs of life. Aside from visiting the guild and card shop, you won't have any reason to spend any time in any of the towns. And while the towns are boring, the rest of the world might as well not even exist. There's no exploration involved when traveling throughout the world. You simply pick a destination, and you're instantly transported there. The battlefields are likewise without any distinguishing characteristics. In fact, you'll often see the exact same hallway or room multiple times during a single battle, except there will be two blobs and one dragon instead of two dragons and one blob. Also, sometimes you'll see the exact same backgrounds used during battles that are supposed to be taking place on entirely different continents. The character models don't look any better than the environments, either. There are a few generic townsfolk, as well as a handful of your basic animal, mechanical, and human enemies in the game. The enemies aren't varied or interesting, but to its credit, the game does feature a wide assortment of colored blobs to fight--from green, to yellow, to pink. The main characters look blocky and wooden, and during the cutscenes, they make a few repetitive, unnatural gestures that just look ridiculous. Of course, the gestures have to be exaggerated, because there are no voices to convey the emotions of the characters. Most of the time you'll just watch your character wave his hands around while silently mouthing dialogue. It's especially odd considering the previous installment in the Arc the Lad series had full voice work. While the cutscenes are totally silent, your character has plenty to say in battle. Unfortunately, all that's said are a few catchphrases, like, ~Is that the best you can do?~ and ~Take that!~. These phrases are repeated endlessly throughout the battles, and unlike the last game, this time around, there's no option to turn the battle chatter off. Aside from a few towns, this is about as much of the world as you'll ever see in this game. The single-player campaign only takes about 20 hours to complete, but once you finish the story, you can continue playing the game to finish all the tasks you might have skipped earlier. Also, you can take your character online to play with up to eight players in cooperative missions, as well as engage in head-to-head or team-based combat. There are dozens of missions--ranging in difficulty and length--that you can choose to play with a group of up to four players. Some of the missions have multiple stages, and if you die on one stage, you'll be resurrected on the next stage...as long as there's at least one surviving member of the party. When you complete the cooperative tasks, you earn points that determine your rank among all the other players online. You'll also find cards, which you can then use in the single-player game to strengthen your character. Overall, the cooperative tasks and the player-versus-player battles are more fun than the battles in the single-player mode. However, they still require minimal skill to complete. As more and more role-playing games turn to action-based combat systems, it's no surprise to see Arc the Lad following suit. Unfortunately, despite the inclusion of a somewhat amusing online component, End of Darkness takes the series to a new low with an uninteresting story and a tedious battle system. If you're a diehard Arc the Lad fan, you might take comfort in the return of some of the characters from the previous games. But even the most loyal fans will be disappointed with End of Darkness. In addition to the generic bad guys, you'll occassionally fight malademons, which look exactly like any other enemy but have a black mist around them. The malademons are stronger, faster, and more aggressive than normal enemies. Once you inflict enough damage to a malademon, it will be stunned, at which point you can press the circle button to perform a special exorcism attack. Exorcising enemies earns you spirit points that are later used to increase the rank of other characters in your party. Darc's back and ready to save the world once more or just run around beating up multicolored blobs of ooze. Aside from earning spirit points and collecting dropped cards and items, there's no reason to fight any enemies unless your task objective specifically requires it. You don't gain experience points from fighting monsters, and, for the most part, you can run right past any enemies you encounter. During battle, you can't progress to the next area if you've been spotted by an enemy, but you can quickly lose him or her and move on without consequence. While the lack of experience points and leveling helps make online play slightly more balanced than it otherwise would be, it makes the battles feel ancillary and unnecessary. Killing enemies will get you cards, but most cards aren't that important. The only cards that are really worth searching for are character cards. Most of the other cards can be purchased or created through the process of synthesis. Card synthesis is the procedure of combining two cards to create a single, more powerful card. For example, you can combine a cure card with a magical stone to get a ~cure 2~ card. It's easy to try various combinations to see what you get, because there's no penalty for creating a bad combo. In addition to the overly simplified and unsatisfying combat, End of Darkness doesn't look or sound impressive, either. The entire world is made up of five continents, each with a single town. The towns are empty and, for the most part, devoid of any signs of life. Aside from visiting the guild and card shop, you won't have any reason to spend any time in any of the towns. And while the towns are boring, the rest of the world might as well not even exist. There's no exploration involved when traveling throughout the world. You simply pick a destination, and you're instantly transported there. The battlefields are likewise without any distinguishing characteristics. In fact, you'll often see the exact same hallway or room multiple times during a single battle, except there will be two blobs and one dragon instead of two dragons and one blob. Also, sometimes you'll see the exact same backgrounds used during battles that are supposed to be taking place on entirely different continents. The character models don't look any better than the environments, either. There are a few generic townsfolk, as well as a handful of your basic animal, mechanical, and human enemies in the game. The enemies aren't varied or interesting, but to its credit, the game does feature a wide assortment of colored blobs to fight--from green, to yellow, to pink. The main characters look blocky and wooden, and during the cutscenes, they make a few repetitive, unnatural gestures that just look ridiculous. Of course, the gestures have to be exaggerated, because there are no voices to convey the emotions of the characters. Most of the time you'll just watch your character wave his hands around while silently mouthing dialogue. It's especially odd considering the previous installment in the Arc the Lad series had full voice work. While the cutscenes are totally silent, your character has plenty to say in battle. Unfortunately, all that's said are a few catchphrases, like, ~Is that the best you can do?~ and ~Take that!~. These phrases are repeated endlessly throughout the battles, and unlike the last game, this time around, there's no option to turn the battle chatter off. Aside from a few towns, this is about as much of the world as you'll ever see in this game. The single-player campaign only takes about 20 hours to complete, but once you finish the story, you can continue playing the game to finish all the tasks you might have skipped earlier. Also, you can take your character online to play with up to eight players in cooperative missions, as well as engage in head-to-head or team-based combat. There are dozens of missions--ranging in difficulty and length--that you can choose to play with a group of up to four players. Some of the missions have multiple stages, and if you die on one stage, you'll be resurrected on the next stage...as long as there's at least one surviving member of the party. When you complete the cooperative tasks, you earn points that determine your rank among all the other players online. You'll also find cards, which you can then use in the single-player game to strengthen your character. Overall, the cooperative tasks and the player-versus-player battles are more fun than the battles in the single-player mode. However, they still require minimal skill to complete. As more and more role-playing games turn to action-based combat systems, it's no surprise to see Arc the Lad following suit. Unfortunately, despite the inclusion of a somewhat amusing online component, End of Darkness takes the series to a new low with an uninteresting story and a tedious battle system. If you're a diehard Arc the Lad fan, you might take comfort in the return of some of the characters from the previous games. But even the most loyal fans will be disappointed with End of Darkness."}