{"ref": "https://www.gamespot.com/reviews/the-charnel-house-trilogy-review/1900-6416110/", "date": "April 20, 2015", "game_name": "The Charnel House Trilogy", "text": "In The Charnel House Trilogy, I found a box full of dirt and worms in a train compartment, where a groaning freak was protecting it. I understand what that box represents, but I'm perplexed by The Charnel House Trilogy itself, a side-scrolling, low-resolution, point-and-click adventure that depicts a series of unsettling images that never coalesce into a story worth connecting with.That isn't to say that The Charnel House Trilogy's three-chapter mystery is overly secretive, only that, unlike the train it takes place on, it never arrives at a distinct destination. In fact, one of the game's central enigmas is overtly revealed in much of the preceding dialogue, causing later events to land with too little weight, their power sucked away by lines that unearth secrets before they're given enough time to fester and simmer. This occurs in the game's central chapter, Sepulchre, which was originally released as a standalone short in 2013, and is notable for its overt but unsettling story of Harold, a man on a train. Yet like so many allegorical works, Sepulchre is not really a story about a man on a train--it's a story about mistakes and consequences, about how a single choice sets devastating events into unstoppable motion. It's difficult to analyze a game like this without divulging key information, and almost every detail of Sepulchre--its main character's profession, the name of the aforementioned groaning freak, the state of the train's windows--points to its obvious conclusion. And its that lack of subtlety that proves the chapter's ultimate unraveling. This kind of setting has been used in a similar manner in fiction many times before, leaving the game's individual sights and sounds to provide most of the impact. I did find myself pulled in by some of these details: the high-pitched buzz that punctuated an important moment, the horror of the lights blinking off and on again, and the troubling sight of particularly oversized luggage among them. Yet given all the foreshadowing, I was only mildly disturbed; with the wind snuffed from Sepulchre's sails so quickly, I could only wonder which path it might take to arrive at its obvious finale.Sepulchre is bookended by another story, told in chapters titled Inhale and Exhale. Inhale is remarkably short, and unusual in how it almost parodies other point-and-click adventures, to the game's overall detriment. The Charnel House Trilogy is hardly humorous, so Inhale's self-referential in-jokes, such as the heroine's sarcastic description of an object behind a lamp that clearly isn't there, sets a tone the ensuing adventure doesn't follow through on. It is an odd prologue, providing some background on Alex, The Charnel House Trilogy's other main character, but its out-of-place humor, its focus on puzzles, and its failure to adjust object interaction dialogue after certain story events make it a poor tone-setter for what's to follow. (Alex's reactions to books in her bookcase, for instance, make no sense once the related puzzle has been solved.) Exhale is the final and longest chapter, and its story is simultaneously more straightforward and more vague than Sepulchre's. The events that led to Alex's presence on the train are plainly exposed, yet the game's attitude towards her is more positive than its ultimate depiction of Harold. Alex's choices drove her towards her predicament, yet her horror is not self-made in the way Harold's is. Alex's role as victim allows The Charnel House Trilogy's horror elements to finally bloom, driving Alex to learn hair-raising truths, and intriguingly, to interact with her past more directly than Harold does. Alex's awareness of her unusual circumstance is the game's most successful narrative beat, as it happens. She accepts the supernatural turn of events, and uses it as an opportunity to grow. What she discovers is horrifying, but where Harold can only accept fate, Alex tries to direct it.There are other players in this story whose roles are left mostly unexplored, though The Charnel House Trilogy's conclusion hints that there will someday be answers to lingering questions. If you wonder why I haven't described the game's puzzles in much detail, it's because there isn't much to describe. You have an inventory that holds objects like your wallet, or cigarettes and a lighter, but most of the time, the dialogue informs you what you must do and where you must go; your interactions aren't usually puzzle-solving so much as they are direction-following. The Charnel House Trilogy is focused almost exclusively on its story, a story I wish impacted me more than it did. Inhale's in-jokes about adventure games and video game reviewers left me cold; Sepulchre's obvious foreshadowing neutered the story before it had any hope of grabbing me. It was Exhale that pulled me in, and its final, unresolved events left me longing for clarity, yet thankful for story strands that give me something to chew on. Overall, however, I am left puzzled by The Charnel House Trilogy, not because I don't understand it, but because its mishmash of themes and tones can't find a way to coexist."}