{"ref": "https://www.gamespot.com/reviews/bangai-o-review/1900-2540046/", "date": "January 7, 2000", "game_name": "Bangai-O", "text": "Developers like Treasure are relatively few and far between these days. With narrative and cinematic pretensions becoming more and more commonplace in games, titles developed around strong gameplay mechanics are becoming something of a rarified treat. Content with developing simple, elegantly playable games, Treasure has become known as something of a hard-core gamer's company. Bangai-O serves as a testament to its sensibilities. Originally released for the N64 in Japan under the name Bakuretsu Muteki Bangaioh in 1999, the game was later ported to the Dreamcast with a handful of key tweaks. Both releases garnered the game mild acclaim. In it, you take control of Bangaioh--an archetypal giant robot piloted by a suitably scrappy brother and sister duo, Riki and Mami. The game is essentially a free-roaming 2D shooter whose sprites are all rendered at a very small scale. As a result, Treasure has managed to pack copious amounts of carnage into each level, granting them optimum action-to-square-inch ratios. Simply put, the game is ultra fast-paced, pleasingly varied, and, most importantly, lots of fun. The game's premise is appropriately light. A group of vile space pirates--known as the SF Cosmo gang-- have been purloining and subsequently hawking rare space fruit to fund its foul designs. Riki and Mami-- piloting their mighty mech Bangai-O (as it's called in the US)--have made it their business to rout the SF Cosmo Gang from their peaceful sector. You wouldn't glean much of this from the game's cutscenes, though: They're full of delightfully absurd non sequiturs, and, as a whole, they seem to work more toward an amusing absence of narrative than any real plot development. When they do occur--usually at the end of stage--the cutscenes are brief, mostly hysterical, and totally skippable. Controlling the Bangai-O is a treat. You move it by means of the directional pad, and you can fire its guns in eight directions by using either the analog stick or the DC's four face buttons. Since the Bangai-O can fly, you're free to soar through the game's huge 2D levels, blasting things willy-nilly and collecting fruit. You can switch between Riki and Mami on the fly by hitting the left trigger, which grants you access to either of their powerful weapons. When Riki's at the helm, the Bangai-O fires homing missiles, which unerringly tail their targets; when Mami's in control, you shoot powerful lasers that rebound off surfaces. Each weapon has its uses, and Treasure has thoughtfully designed sections of levels around the use of each. The game's most interesting mechanic, though, is the Bangai-O's special attack. Holding and releasing the right trigger will cause the Bangai-O to unleash a flurry of missiles or beams whose intensity depends on the immediate level of carnage present. If performed during a relatively calm moment, the effect will be modest. During particularly hectic moments, though, when explosions are prevalent and enemies are everywhere, the effect will be astounding: A literal swarm of projectiles will issue forth from the Bangai-O's frame, which, in all probability, will lay every foe onscreen to rest. A handy meter tells you exactly how explosive your current area is--and you'll use this area to strategically execute the screen-clearing supermove. Treasure has managed to pack a wide array of gameplay elements into this deceptively simple package. While the primary goal of each level is to blast everything in sight, some levels are designed around strong secondary themes. One level, for instance, has you racing against a gradually disintegrating, destructible wall, running the perpetual risk of being stuck behind it. Another level involves a kind of lock-and-key gameplay style, forcing you to shoot down certain areas of it to open up others. Each stage, though, is effectively a race against time--regardless of complexity, each has a timer that's constantly ticking. If it runs out, it's curtains for Riki and Mami. Every level culminates in a boss fight, all of which are preceded by a cutscene. All in all, most levels prove to be nicely challenging. Considering that the game is 40 levels long--and gets a good deal difficult about halfway through--you get the feeling that there's quite a bit of Bangai-O to tackle. Bangai-O's production values are admittedly modest. The game's 2D art is simple and utilitarian, and its few graphical flourishes are very no-frills. Still, it's difficult to believe that anyone who plays the game will be disappointed by its lack of visual splendor--when playing a game like Bangai-O, the images onscreen take a back seat to the compelling action that'll consume your attentions. The game's audio production is quite well conceived--surreal little tunes will flow through at unexpected moments, and the small bit of undubbed voice work really endears you to the game's whimsical themes. Sound effects are suitably explosive, crisp, and sharp. Treasure long ago mastered the art of 2D game design--Bangai-O serves as its only recent evidence of having done so. Dreamcast owners craving a genuinely compelling gameplay experience would do well to check out Bangai-O. In an age of thick productions and thin gameplay, Bangai-O really has it where it counts: in truly compelling and addictive gameplay."}