{"ref": "https://www.gamespot.com/reviews/tony-hawks-pro-skater-4-review/1900-6101435/", "date": "May 17, 2006", "game_name": "Tony Hawk's Pro Skater 4", "text": "Though the Tony Hawk series makes its biggest mark on the PlayStation 2, where it appears with online support and all the other bells and whistles you'd expect from a popular series, it also does quite well on the Game Boy Advance. Developer Vicarious Visions manages, year after year, to cram quite a lot of what makes Tony Hawk's Pro Skater so good into its portable renditions, which take the behind-the-back action of the original and recasts it from an isometric perspective. Zodiac developer Semi Logic has ported Vicarious Visions' Tony Hawk's Pro Skater 4 over to Tapwave's handheld, and the resulting game is a good one, though it probably could have been ported a bit more smoothly. The Zodiac version of Tony Hawk 4 is a cleaned-up port of the Game Boy Advance release. The Zodiac version of Tony Hawk's Pro Skater 4 is roughly identical to the Game Boy Advance version, though some enhancements have been made to take advantage of the Zodiac's more powerful hardware. The most obvious difference is that the graphics have a much higher resolution to them, so the resulting game is much clearer and cleaner than its GBA counterpart. The polygonal skaters are still a little blocky, but there's significantly more detail there as well. Additionally, the link cable multiplayer found on the GBA has been replaced with Bluetooth support, so if you have up to three friends with a Zodiac, you can enjoy some multiplayer games, like trick attack, horse, and so on. The Bluetooth multiplayer tends to be slightly slower than the single-player game, so you'll have to adjust your timing. Aside from multiplayer mode, you can also play single, timed sessions, and the subsequent scores from these sessions can be posted to an online scoreboard (on Tapwave's site) via the system's hotsync abilities. The disappointing side of Tony Hawk 4 on the Zodiac is what hasn't changed. Some control limitations had to be put in place on the GBA, because the GBA only has four buttons. The Zodiac has four buttons on the face and two shoulder buttons, but it still sticks to the GBA's control scheme. You can set up the four face buttons to act like they do in the console versions of the game, but that means you'll have to work some finger magic to do things like spine transfers, which require you to hit both trick buttons at the same time. Also, the Zodiac's analog stick isn't really well suited for the Tony Hawk series, which requires some pretty precise control. This makes performing timely manuals--the key to long combos--more difficult than you'd like. You can get used to these shortcomings over time, however, so the game is still pretty playable. But when you combine the imprecision of the game's control with its sometimes confusing isometric perspective, Tony Hawk 4 can get pretty frustrating. Tony Hawk 4's main mode is a career mode, which starts you out in one of the game's seven levels. You're able to skate around freely, but the real action of the game kicks in when you accept a goal from one of a level's pedestrians. These goals vary from easy things, like landing a 10,000-point trick, to more difficult tasks, like some of the later levels' combo moves. There are a great deal of goals in each level, and once you've gotten to the pro challenge segment of the game, you can go back to take on more-difficult goals in the levels you've already played. With its lengthy single-player career mode, high-score contests, and more, Tony Hawk 4 offers a great amount of value. Graphically, Tony Hawk's Pro Skater 4 looks pretty sharp. The environments are clean, the skaters look good, and the whole thing runs at a pretty smooth speed. The enhancements made over the Game Boy Advance version are nice, though you can't help but think that the platform probably could have done a better job if this game had been developed from the ground up as a Zodiac offering. The sound side of things represents another area that is good, but it probably could have been handled better. The existing sound of the action is just fine. However, on a system with built-in MP3 support, the game's MIDI-style music falls a little flat. Well, if the music really gets on your nerves, you can always turn it down and use the system's audio-playable abilities to crank out your own music during the game. Overall, Tony Hawk's Pro Skater 4 is a good game for the Tapwave Zodiac. It offers a lot of single-player action in its career mode, and if you have a posse of Tapwave owners in your area, the multiplayer is also fun. It doesn't take advantage of everything the Zodiac has to offer, but it's certainly a solid start for the franchise on Tapwave's new platform."}