{"ref": "https://www.gamespot.com/reviews/command-and-conquer-red-alert-review/1900-6250839/", "date": "February 16, 2010", "game_name": "Command & Conquer: Red Alert", "text": "Although the iPhone game library is dominated by casual games, there's still a place for more hardcore game genres like real-time strategy. And for some time, the most anticipated iPhone strategy game was Command & Conquer: Red Alert. The celebrated C&C series gained success in part due to its exciting online multiplayer and over-the-top live-action cutscenes. Sadly, neither of these features made it into the iPhone version, but there's still enough quality content to appeal to fans of the series. The premise of Red Alert can best be described as a fantasy version of the Cold War. Playing as either the Soviets or Allies, you must crush the opposing faction. Each side has a unique campaign with five missions and a fairly basic storyline. The first few levels ease you into the game at a steady and understandable pace, with a brief tutorial to introduce new game mechanics--a great addition for RTS newcomers. The celebrated PC series comes to the iPhone in a victory for RTS fans. Playing through the campaign is a blast. The levels last for a good 15 to 20 minutes on average, and optional objectives add extra replay value. The missions also have some variety. In one, you must use a hero unit and brute force to fight through the opposing faction. Another requires you to tactically place new buildings. While it never gets too tough, a more-challenging difficulty level would've been a welcome addition. Red Alert has intuitive controls that make great use of the touchscreen. Unit selection, movement, and attacks are all initiated through taps and drags, with the occasional need to press a button. You can pan the camera by pinching and expanding the screen, and you can move around the field by simply dragging or tapping on the minimap--the camera controls work naturally and seamlessly. RTS games usually have intricate interfaces, but Red Alert has successfully simplified this aspect without sacrificing functionality. Three custom unit groups can be created in order to quickly jump between different battalions on the map, and the display shows you which types and how many of each unit are part of the group at a glance. A detailed minimap enables you to spot an assault before it happens and choose the best route to victory. There are even audio cues from a military officer who alerts you of any occurring events. Some missions require brute force, and others require thoughtful strategy. Building bases, another important part of RTS games, is also effortless. Scrolling panels give you all the options, and dragging an icon onto the map expands it. You can then place it down with surprising accuracy, taking care to maintain a balance of defense towers, unit deployment, and energy towers in order to keep the base in operation. Your armies are comprised of infantry, tanks, airplanes, and faction-specific units like the Soviets' trained bears and zeppelins. Though your armies don't have any special abilities nor tables that list their attributes, they still get the job done in the field. Red Alert looks great. Different camera angles let you take in the details of the game's full 3D models. Even on 3GS, the frame rate moves briskly and barely stutters. Unfortunately, this version of Red Alert is missing the series' infamous live-action cutscenes, which added a ton of personality to the original PC game. This is disappointing, considering that EA did add cutscenes to the iPhone version of Need for Speed: Undercover. Instead, this version of Red Alert offers text-based briefings prior to each mission. Unit types include zeppelins, tanks, and even trained bears. The strongest aspect of many RTS games is multiplayer, but Red Alert offers only local multiplayer through Bluetooth or Wi-Fi. Another weak point is the game's shallow skirmish mode. Both campaigns are filled with unavoidable tutorials and set layouts, and after completing them, most players will want fully customizable sessions. However, your gameplay options and choice of map are limited. It's unfortunate that Command & Conquer Red Alert lacks different modes, map customization, and better multiplayer--but it still offers a great experience with good graphics and the best RTS gameplay on the App Store, thanks to its smart control and interface. This review was provided by GameSpot mobile content partner SlideToPlay.com."}