{"ref": "https://www.gamespot.com/reviews/medievil-resurrection-review/1900-6133032/", "date": "May 17, 2006", "game_name": "MediEvil: Resurrection", "text": "MediEvil first came to the PlayStation in 1998, and while it wasn't a smash hit, it's remembered fondly for its wacky cast of characters, interesting level design, and morbid sense of humor. So it seems like MediEvil was as good a choice as any when it came time for Sony to once again reach into its franchise grab bag to populate the PSP library. MediEvil: Resurrection is a pseudo-remake of the original game, but with some slightly changed levels and a handful of minigames tacked on. Unfortunately, the game hasn't aged well, and although it has plenty of personality, the maddening camera control and broken combat mechanics quickly spoil the fun. Sir Daniel Fortesque is back from the dead. Can he live up to his heroic reputation? In case you aren't familiar with the original MediEvil game, we'll give you a rundown of the story. You play as Sir Daniel Fortesque, a cowardly knight of the kingdom of Gallowmere who was killed by an arrow to the eye in a battle with an evil necromancer named Zarok. With a slick bit of public relations work, the king twisted the events of the battle to portray Daniel as a courageous hero who defeated Zarok and saved the kingdom at the cost of his own life. Flash forward 100 years, and Zarok is back. The wizard is once again dead-set on ruling the world, so he casts a powerful spell to block out the sun and raise the dead in order to cultivate an army of zombies and ghouls. This magic brings Daniel back to life as well, though, and he decides to use his second chance to redeem himself and live up to his heroic reputation by defeating Zarok for real this time. With the encouragement of Al-Zalam, a genie that Zarok confined to Daniel's skull, the skeletal knight heads off to save the day. On your way to confront Zarok and save the kingdom, you'll encounter plenty of cartoony monstrosities, including mutant pumpkins, crazy scarecrows, fanatical mental patients, and all kinds of undead soldiers. As a result, you'll have to rely heavily on your weapons to hack your way through Zarok's minions. The combat system in MediEvil: Resurrection is pretty simple. You have two attacks, one strong and one weak. With some weapons, you have one ranged attack and one melee attack. You can string together attacks to create combos and pull off special attacks. You can also use a shield to block attacks or charge enemies. As you progress through the game, you'll collect chalices, which can be used to revive dead warriors in the Hall of Heroes. Each warrior will give you a different weapon to use, such as a spear, a long bow, a hammer, or a shield. There are more than a dozen different weapons you can use. Sometimes you have to use certain weapons in certain areas; for instance, you have to smash open a passageway with your hammer. Most of the time, though, you'll stick to one weapon, since it's somewhat cumbersome to push select and navigate a menu every time you want to switch weapons. It doesn't really matter what you use, since combat boils down to running up to an enemy and hitting the X or square button a few times until the enemy is dead. The camera is often uncooperative, and the poor collision detection takes all the fun out of combat. There is some challenge to the combat, since you first have to fumble with the camera to find your target and then try to judge your distance from the enemy so you can land a hit without getting hit yourself. Poor collision detection takes what could have been a decent combat system and turns it into a frustrating and tedious guessing game. Your melee weapons feel as though they have no weight at all, and the weapons often seem to pass right through objects or enemies. Since enemies don't drop any items, you're better off just running past them rather than trying to fight it out. You can't do that all the time though, since some areas require you to clear all the monsters before you can proceed. The ranged attacks aren't any better than the melee attacks. You have a targeting icon that will hover by an enemy and turn red, at which point you can hold R to lock on to that enemy. The lock isn't very secure though, because when enemies start moving around or when other enemies join in the battle, the lock breaks and combat degrades into mindless button-mashing. The ranged attacks are so slow that you can hit enemies only if you manage to lock on to them and if they're standing still directly in front of you. Needless to say, that doesn't happen very often. Aside from combat, the biggest problem in MediEvil: Resurrection is the camera. You can sometimes lock on to enemies to keep the camera focused on the action, but as mentioned, that doesn't always work. When you don't have a target, you can use the R button to quickly center the camera behind Daniel's back. This works fairly well, but the camera gets stuck in confined areas. The only way to move the camera is to move Daniel, which makes it difficult to spot any enemies that might approach from the side. In combat this is extremely frustrating, since enemies often swarm from all directions. It causes problems beyond combat as well. Some areas require you to jump between platforms, and jumping is a major pain when you can't see where you're going. Also, the camera will often shift inexplicably, which makes it difficult to stay focused on anything. There are lots of minigames in MediEvil: Resurrection, which you can play multiplayer via an ad hoc connection. Fortunately there is more to the game than combat and platforming challenges. There are also a number of minigames in MediEvil: Resurrection, and most of them are entertaining for at least a short while. There are a few different target-shooting games, a whack-a-mole type of game, a survival game, and even a chicken-herding game. You can play these minigames in the context of the single-player story, or you can play them multiplayer via an ad hoc connection. In multiplayer there's also a race mode where you run through a level activating checkpoints on your way to the exit. Whoever gets to the exit first wins the race. You can't see the other player in any of these games, and at most you'll see the player's life bar or an indicator that shows how many checkpoints the player has hit in a race. This removes a lot of the excitement from the game because rather than a tense head-to-head battle, it feels like you're each playing the game single-player and then comparing scores at the end. MediEvil: Resurrection looks nice, and although each of the 19 levels has a specific theme, they all carry enough of the same details to make Gallowmere feel like a cohesive fantasy world. The horror theme persists through the entire game (you are playing as a skeleton after all), and the characters are all interesting, which makes you wish they had more screen time. The environments and characters are nicely detailed, but oftentimes they're too small to really see on the PSP screen. The camera also makes it difficult to give the visual design as much attention as it deserves. The frame rate often takes a significant hit when enemies start to swarm onscreen. It isn't bad enough to make the game unplayable, but it's one more annoying problem to take you out of the game. The best part of the game is easily the sound. All of the voices are really well done. For example, when you die you see a close-up of Dan's skull/face, and you hear Death say in an almost exasperated tone, ~Dan, Dan, Dan. Step on the boat. You know the procedure.~ The voice fits the image perfectly, and the feeling of disappointment and despair really comes through. Most of the dialogue in the game is pretty goofy, and the voices match each character. Some of the voices are so odd that you can hardly understand what they're saying, but they're still much more interesting to listen to than the average voice-over. The music is great too, with a fully orchestrated soundtrack that manages to sound spooky and upbeat at the same time. The characters, art design, and sound are great, but they don't quite make up for the rest of the game. The gameplay of MediEvil just doesn't translate well to the PSP. It's especially disappointing because the characters, story, art design, and overall presentation are funny and unique. In fact, the game holds up quite well until you actually start playing it. At that point, it just falls apart. Aside from combat, the biggest problem in MediEvil: Resurrection is the camera. You can sometimes lock on to enemies to keep the camera focused on the action, but as mentioned, that doesn't always work. When you don't have a target, you can use the R button to quickly center the camera behind Daniel's back. This works fairly well, but the camera gets stuck in confined areas. The only way to move the camera is to move Daniel, which makes it difficult to spot any enemies that might approach from the side. In combat this is extremely frustrating, since enemies often swarm from all directions. It causes problems beyond combat as well. Some areas require you to jump between platforms, and jumping is a major pain when you can't see where you're going. Also, the camera will often shift inexplicably, which makes it difficult to stay focused on anything. There are lots of minigames in MediEvil: Resurrection, which you can play multiplayer via an ad hoc connection. Fortunately there is more to the game than combat and platforming challenges. There are also a number of minigames in MediEvil: Resurrection, and most of them are entertaining for at least a short while. There are a few different target-shooting games, a whack-a-mole type of game, a survival game, and even a chicken-herding game. You can play these minigames in the context of the single-player story, or you can play them multiplayer via an ad hoc connection. In multiplayer there's also a race mode where you run through a level activating checkpoints on your way to the exit. Whoever gets to the exit first wins the race. You can't see the other player in any of these games, and at most you'll see the player's life bar or an indicator that shows how many checkpoints the player has hit in a race. This removes a lot of the excitement from the game because rather than a tense head-to-head battle, it feels like you're each playing the game single-player and then comparing scores at the end. MediEvil: Resurrection looks nice, and although each of the 19 levels has a specific theme, they all carry enough of the same details to make Gallowmere feel like a cohesive fantasy world. The horror theme persists through the entire game (you are playing as a skeleton after all), and the characters are all interesting, which makes you wish they had more screen time. The environments and characters are nicely detailed, but oftentimes they're too small to really see on the PSP screen. The camera also makes it difficult to give the visual design as much attention as it deserves. The frame rate often takes a significant hit when enemies start to swarm onscreen. It isn't bad enough to make the game unplayable, but it's one more annoying problem to take you out of the game. The best part of the game is easily the sound. All of the voices are really well done. For example, when you die you see a close-up of Dan's skull/face, and you hear Death say in an almost exasperated tone, ~Dan, Dan, Dan. Step on the boat. You know the procedure.~ The voice fits the image perfectly, and the feeling of disappointment and despair really comes through. Most of the dialogue in the game is pretty goofy, and the voices match each character. Some of the voices are so odd that you can hardly understand what they're saying, but they're still much more interesting to listen to than the average voice-over. The music is great too, with a fully orchestrated soundtrack that manages to sound spooky and upbeat at the same time. The characters, art design, and sound are great, but they don't quite make up for the rest of the game. The gameplay of MediEvil just doesn't translate well to the PSP. It's especially disappointing because the characters, story, art design, and overall presentation are funny and unique. In fact, the game holds up quite well until you actually start playing it. At that point, it just falls apart."}