{"ref": "https://www.gamespot.com/reviews/battlefield-2-euro-force-review/1900-6146348/", "date": "March 21, 2006", "game_name": "Battlefield 2", "text": "It's a bit difficult to evaluate Battlefield 2: Euro Force, the latest addition to the wildly popular Battlefield 2 franchise. Euro Force isn't an expansion pack in the traditional sense. It has only half the content of most expansion packs, and you won't be able to buy Euro Force in stores. This official ~booster pack~ for Battlefield 2 can only be bought online, and it's the first of what EA probably hopes to be many booster packs for the game. While Euro Force does indeed sate the voracious appetite out there for more Battlefield 2 content with some great levels and a new army, you can't help but wonder if EA is also installing a direct pipe to fans' wallets at the same time. Euro Force is very armor heavy on desert maps, so be prepared to go antitank a lot. Meanwhile, there's not much you can do against enemy airpower. As its name indicates, Euro Force introduces a European army into the ongoing virtual modern war between the United States, China, and the fictional Middle Eastern Coalition. This is undoubtedly a welcome addition for Battlefield 2's many European fans, but it's also a treat for fans everywhere. The European army brings some nifty variety to the war, and the ~war by committee~ Europeans can be fun to listen to with their many different accents. And despite any popular misconceptions that Europeans can't fight, these Euros bring some formidable firepower to the fight in the form of the HK21 light machine gun (which has a wonderful report), the Leopard and Challenger main battle tanks, and other new weapons and vehicles. The pity is that you can only see the Europeans in action on the three new maps in the booster pack. Two of these maps are really amazing. Great Wall is set in and around a section of China's Great Wall, and it's designed to make for an intense and wild fight. There's something for everyone to do, from infantry running and fighting atop the wall itself, to armor slugging it out for tactical chokepoints or in the open areas outside the wall. Sadly, this is the only map where the Europeans can battle China, because the two other maps pit the Europeans against the MEC. The best of these Euro-vs.-MEC maps is Operation Smoke Screen, which is set amid a burning oil refinery that's pumping out thick black clouds of smoke, which kills visibility in some areas. It's a cinematic level that will remind you of movies such as Jarhead at times. The other, Taraba Quarry, is a more open level where both armies slug it out over a wide expanse, though it doesn't have any of the scenic vistas that the other two maps possess. Both the desert maps are reminiscent of the desert warfare maps found in the original Battlefield 1942, because they're very armor heavy. Whereas the core Battlefield 2 map gives each side only a handful of tanks at a time, Euro Force gives you armor and vehicles almost everywhere, and it's not unusual to see tank squadrons and platoons form up. And this brings us to the point where Euro Force gets a bit controversial. The emphasis on vehicles, while a welcome change of pace, can make being an infantryman downright brutal at times on the desert maps. While armor isn't so much an issue, thanks to the infantry antitank class, airpower pretty much trumps all. It's gotten to the point where the best pilots can dominate a map, and it's getting out of hand. Attack helicopter pilots have perfected the art of continually sweeping over a spawn point, spraying a lethal stream of lead before you have any chance to even escape. Meanwhile, jet pilots take out armor with near impunity. Yes, ideally your team's pilots should counter the other team's pilots, but unfortunately that seldom seems to happen, because your team's pilots get caught up in doing the same thing to the other team's infantry and armor. The tweaks to the antiaircraft missiles made in the 1.2 patch helped the ground pounders a bit, but they were nerfed in the 1.21 patch that's required to install Euro Force. It's simply gotten to the point where EA and DICE must implement some sort of infantry antiaircraft class to level the playing field, because it's almost ridiculous how things fare right now. We unloaded two magazines from a PKM machine gun into a Eurocopter and it didn't even start smoking. The Eurocopter, meanwhile, traced back our tracers and took us out with its cannon. With that said, Euro Force can be as wildly fun to play as Battlefield 2, but keep in mind that it shares many of the same quirks and balance issues that affect the core game. In addition, the notorious red tag bug, which sometimes color-codes teammates in red rather than blue, still rears its ugly head, despite the many attempts to date to squash it. Still, when the game is going, you're caught up in an over-the-top battlefield experience where all sorts of crazy things are happening all around you. We've participated in desperate firefights, watched as the European army ground to a halt at the gates of the Great Wall, escaped death by a hair's breadth dozens of times, and died even more. If you can team up with a good squad that's on microphones, Battlefield 2 remains one of the most intense and fun action games that you can play online. And if you're not running with a squad, there's still plenty to do and see. Fight atop the Great Wall in perhaps the booster pack's best level. There's something here for everyone, on foot or in a vehicle. At $9.99, Euro Force is a solid value. Yes, it has only about half the content of a traditional expansion pack, but it also has a price tag that's about half the price of a traditional expansion. While you technically don't have to buy Euro Force to continue enjoying Battlefield 2, you may find that you have to in order to keep up with the servers online. That's because unlike the Special Forces expansion, the Euro Force maps are listed on the same servers used for the core game. This is great, because you don't have to run a separate executable to enjoy the new content. This is also bad, because if you've got a favorite Battlefield 2 server, and that server incorporates the Euro Force maps and you don't have them, you'll be kicked off as soon as the server switches to a map that you don't have. It's a hassle, and the only way around it is to buy the booster pack. This is a situation that will only get worse as additional booster packs are released and the server base is segmented even further. Still, if you're a Battlefield 2 fan who has logged dozens, or even hundreds, of hours playing the game online, Euro Force is probably a must-have. Despite its warts, it adds some great variety and content to one of the best action games on the market. And if you find yourself wanting even more Eurocentric content, rest assured that EA will probably make another if this one proves successful, and you'll have to pay for that one, as well."}