{"ref": "https://www.gamespot.com/reviews/spellforce-the-order-of-dawn-review/1900-6089813/", "date": "February 23, 2004", "game_name": "SpellForce: The Order of Dawn", "text": "Real-time strategy games let you harvest resources, build a base of operations, and commission an army to flatten your enemies as quickly as possible. Role-playing games let you play as a character who gradually gains power by attaining fabulous treasures and powers, while also earning experience levels from adventuring. Real-time strategy games have attempted to use more and more role-playing elements recently, and Encore and Phenomic's SpellForce: The Order of Dawn is the latest example of this trend. This colorful strategy game lets you play as a warrior or wizard in a fantasy world while leading an army of elves, dwarves, orcs, and trolls to victory against a powerful foe. It may have a familiar-seeming premise, and it may have a few noticeable shortcomings, but SpellForce's unique combination of role-playing and strategy elements makes it worth a look for fans of either kind of game. SpellForce lets you create and develop a character with varied abilities. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: SpellForce: The Order of Dawn Video Review SpellForce lets you start out by creating a character who acts as a powerful military unit in the game. You can choose to be a male or female character that specializes in various types of melee combat, ranged combat with bows, or one of a few different schools of magic. As you complete your adventures and defeat enemies, your character may attain new levels of expertise in these fields, in addition to acquiring new weapons, armor, and magic spells. The game's character advancement is paced well enough to let you create either a focused specialist character or a well-rounded generalist character. And like with any good role-playing game, you may find yourself fighting just one more battle to accomplish just one more goal. You may be trying to gain a level and some new abilities; you may be trying to save up enough coin to purchase a new spell or item from a merchant in a town area; you may be trying to explore the wilderness for hidden treasure chests full of loot; or you may be trying to finish up one of many side quests you'll receive in each level. The real-time strategy portion of SpellForce is just as intriguing as its role-playing elements, even if it doesn't work quite as well. In the single-player campaign, your character will explore huge overland maps, hack through enemies, and eventually set up a base of operations, complete with worker units that build structures and troops that can be added to your armies. However, while most real-time strategy games require you to research upgrades by spending some resources--and then sitting and waiting--SpellForce's technology upgrades appear as rune items that your character can add to his or her inventory. Once these upgrades are equipped, your character will always have these new buildings and troops available for construction. It then becomes a matter of simply gathering enough resources and subsequently ordering your workers to erect the proper buildings. SpellForce features six different playable races that you'll eventually be able to recruit in the single-player game (and these races are also available in multiplayer play), which ultimately lets you mix and match your troops so that you can create interesting battalions of healers, wizards, archers, and melee units with different abilities. Multiplayer lets you choose from one of 10 prebuilt characters with various high-level specializations. You then recruit multidimensional armies for competitive play in one of 12 maps. Multiplayer offers only head-to-head and team-based competition; there are no other game modes. Also, your characters do not remain persistent from game session to game session, like in the Warlords Battlecry series, though they don't need to be leveled up de novo in each game either, like in Warcraft III. The game's interface has some problems. Sometimes you may have trouble just picking out onscreen friends and foes with your mouse. As mentioned, SpellForce's strategy aspects don't always work particularly well. For example, while units are usually decent about following orders, they'll sometimes get stuck on environmental objects and will ~forget~ whatever order you gave them. This can be annoying when assaulting a large enemy force with your army, especially when only half of them show up. You can assign them to one of a few different marching formations, though these formations don't seem to work consistently, and they don't seem to be that useful. The ability to create armies that consist of varied units is one of SpellForce's best features, but its interface doesn't quite seem up to the task and appears to suffer from both a lack of hotkeys and some camera issues. For example, if you wish to access the special abilities of a grouped unit, you need to individually select that unit, and then you must click on the ability rather than by activating a predefined hotkey. To the game's credit, several of the units will automatically use their abilities when appropriate...most of the time. In addition, the game's perspective often limits gameplay. While you can zoom in extremely close on your character to take a good look, this view is mostly useless. You'll generally play with a more zoomed-out view, which is often the farthest view possible for getting a good sense of the game's expansive overland maps. However, actually clicking on and targeting specific units while in this view is often difficult, especially if there are trees, hills, and other environmental objects in the way (and there usually are). So you'll likely find yourself constantly zooming in and out to get both the best view of your surroundings and the best view of your armies as they fight. SpellForce's battles happen quickly. As such, the game lets you target the strongest nearby enemy with the ~Tab~ key, and it also has a ~click-and-fight~ option at the top of the screen, which brings up a context-sensitive icon that you can click on for fighting or for using an appropriate special ability. At their best, these features can helpfully let you focus on your toughest foes with a few simple clicks. However, the icons appear at the top of the screen, so your armies will wander all over them (and can sometimes get separated). As a result, you'll often find it difficult or next-to-impossible to manage larger battles when having to click all over the screen, especially when your units occasionally get stuck or wander off from their objectives. At least the game has some pretty high production qualities. The fully 3D world of SpellForce colorfully renders rolling, grassy hillsides, dense forests, and bustling cities, in addition to detailed 3D units. Unfortunately, the game's attractive graphics should have been optimized better since it tends to have frame rate problems and lengthy load times--unless you have an extremely high-end computer. The game also features a fitting faux-orchestral soundtrack that changes dynamically to indicate when your enemies have been sighted. It has a great deal of voice-over in its lengthy in-engine cutscenes as well, and some of it is decent, though the rest is fairly bad. Unfortunately, the cutscenes can't be skipped. The game's blend of role-playing and real-time strategy elements ultimately works quite well. Fortunately, although the game's impressive visuals are best appreciated on a proportionately high-end computer, most any fan of high fantasy should be able to appreciate SpellForce's effective combination of role-playing and strategy elements. Oddly, SpellForce doesn't have any single-player skirmish maps, and its dozen multiplayer maps aren't seeing much competition online (as of this writing). However, the game does have a sizeable single-player campaign, and its unusual character development system will likely make you want to restart a few games just to try out the different character abilities to see how an advanced character with different skills works in practice. SpellForce has a lot going for it, and it definitely sets itself apart from other, more conventional real-time strategy games."}