{"ref": "https://www.gamespot.com/reviews/americas-army-operations-review/1900-2895424/", "date": "October 23, 2002", "game_name": "America's Army", "text": "America's Army: Operations may very well be one of the most ironic games ever. More than a few American politicians have bolstered their careers by condemning violence in popular entertainment, particularly in video games. Now the US government, by way of the Army, has produced a computer game that's all about realistic, deadly combat. While this odd turn of events raises interesting ethical and political issues, many gamers probably just want to know one thing about this online shooter: Is it any good? The game was launched in a more limited form on July 4 of this year, but the launch was plagued by embarrassing problems, including bugs and too few official servers. Fortunately, the Army now seems to have gotten its act more or less together with this game. Now there are more servers, and America's Army is generally more stable, which means you can more easily enjoy this exciting tactical shooter. Right off the bat, America's Army has one thing going for it that retail games don't: It's free, assuming you don't count the purported millions of US tax dollars spent on the game's development. The only thing America's Army is likely to cost you is a fair amount of time as you download over 200MB of game files, though the game is also available on CDs that can be picked up at US Army recruiting offices all over the country. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: America's Army Video Review America's Army aims to educate you about the US Army and its career opportunities and values. As such, if you want to enjoy all that the game has to offer, you're going to have to do things the Army way. You won't be able to simply install the game and head online to start blasting people. First, you need to log in to create a game account that tracks your progress and lets you access the official servers. Then, you'll need to pass at least four offline basic training missions: rifle marksmanship, an obstacle course, US weapons training, and training for MOUT (military operations in urban terrain). After these missions, you can optionally progress through advanced training for snipers or airborne troops, for example, which will in turn open up new online missions and gear. These offline training missions might sound like a chore that gets in the way of the real fun online. Actually, they can be moderately entertaining and challenging in their own right, and they teach you a little about Army history and procedures in the process. They certainly help draw you into the atmosphere of the game by putting you in meticulously re-created sections of the infantry school at Fort Benning, Georgia. There you'll find no-nonsense drill instructors, fellow recruits on the firing range, and tall pine forests as far as the eye can see. The obstacle course training mission is really just a way to instruct you on the use of the game's movement controls, which are generally similar to those of most shooters. The other training missions are more interesting since they focus on the game's weapons. For instance, the marksmanship lesson actually requires a surprising amount of skill, thanks to the game's unusually realistic weapons and ballistics modeling. You'll really need to aim carefully and quickly to hit as many targets as possible. How well you do determines whether or not you can qualify for sniper training later, but don't worry if you don't score well the first time--you can retake the test as many times as you like. Unfortunately, while these offline training missions teach you the basics of movement and firing in the game, they teach you nothing about successful tactics. For that, you'll need on-the-job training in online matches, which you can join using an integrated server browser. While there are many more official Army servers than in the past, you'll find that the network code still has a major, albeit intermittent, problem--namely, the way the game can refuse to properly connect to open servers. Assuming you can connect, you'll engage in battles between the US Army and OpFor, a generic opposing force. No matter which side you choose, you and your teammates always look like US soldiers, while the enemy always wears ski masks or other garb that marks them as terrorists. The number of maps is currently limited, though the Army plans to keep releasing free content for the game, and the maps you get are tactically and visually interesting. You'll fight on a huge snow-covered bridge littered with the burning wrecks of cars, raid a camp in the middle of a night-shrouded forest, and battle in an Alaskan pipeline pump station, among others. The actual gameplay is based on the proven (and aging) Counter-Strike model, in which both teams have opposing goals--usually assaulting or defending an area--that they try to complete during short rounds typically lasting somewhere around five minutes. If you die during a round, you're forced to sit out and watch the action as an invisible spectator until a new round begins. This can be boring when you'd rather be fighting, but it can be still be fun to watch other players at work without the stress of having to avoid enemy fire yourself. Yet whatever its weaknesses, this round-based combat with only one player spawn per round is surely the best design for this type of game. Death should be something you avoid on the battlefield, after all. With infinite respawns, it would be too easy to take things casually and use unrealistic tactics.While the round system and single spawns call to mind Counter-Strike, America's Army doesn't have much in common with the arcade-style gameplay of that game. At its best, America's Army is an extremely intense game in which you really need to rely on your teammates if you hope to avoid death and accomplish your objectives. It's a game in which player movement speed is moderate at best and single shots can kill enemies outright, as they can and do in real life. You'll treat every little scrap of cover and concealment like it's a rare treasure. You'll aim carefully, squeeze off a few rounds, and then hit the dirt to avoid having your skull ventilated by a well-aimed bullet. When the tracers start flying, you won't even consider running around wildly and hopping all over the place like some players do in less realistic shooters. Unfortunately, even if you play smartly, a match can easily be lost because of unskilled teammates. Appropriately enough for a game meant to teach Army values, finding a good team is of paramount importance if you want to enjoy the game fully. Assume different roles and carry different gear into battle. To help you survive on the battlefield for more than 30 seconds, you'll be able to lean around corners, crouch, and go prone. In an unusual twist on the standard shooter movement options, you'll be able to switch from the default running speed to a full-out sprint, but your weapon will be temporarily lowered to prevent it from accidentally discharging. In another unusual touch, you'll also be able to roll quickly when prone, as well as make use of the usual side-to-side shuffle when crouching. It's great to have so many movement options, though you can't always use them when you need them, since the game's scenery, doorways, and other objects have an annoying ~sticky~ property and will occasionally catch you and prevent you from moving when you really need to. One of the most impressive elements of America's Army, and one of the obvious benefits of having real-world experts behind the game, is its detailed weapon modeling. You'll find predictable tactical shooter details like the way your rifle kicks when fired in bursts. Then you'll notice things that other shooters don't always model or model as well. Crouching or going prone dramatically improves your aim, for example, in part by reducing the effect breathing has on the steadiness of your crosshair. For increased accuracy, you use the gun's actual ~iron sights~ instead of the unrealistic crosshair for aiming when zoomed. The game also realistically switches you out of the zoom mode whenever you assume a different firing stance or make other major movements. Another neat touch that adds to the ambience, if not the actual gameplay, is the way a soldier visibly thumbs the switch on his assault rifle to toggle between semiautomatic and burst firing modes. During play, you'll be able to carry up to two weapons at a time, and you can drop weapons to pick up others from the battlefield. The game's arsenal isn't particularly large since the focus is on actual standard-issue Army weapons, but the firearms are all carefully based on the real things and can even jam. You'll get to wield the well-known M16A2 rifle and its shorter M4A1 variant. You'll also get use the M203 40mm grenade launcher, which can be attached to either of those rifles, as well as the SAW (squad automatic weapon) for laying down continued fire. ~Trained~ snipers get access to the 7.62mm M24 SWS and the .50-caliber Barrett M82A1. You can also pick up weapons dropped by fallen OpFor troops, like the AK-47, and you'll get to throw fragmentation, smoke, and flash-bang grenades, too. Along with its unusually realistic weaponry, America's Army features unusually detailed visuals powered by the latest version of Epic's Unreal engine. Other than some occasional clipping and the lack of lip-synching for your training instructors, the game generally looks superb. The models, textures, and visual effects usually match or surpass those found in today's top shooters. Attention to detail abounds, from the little patches on a sergeant's uniform, to the moths swarming around an outdoor light at night, to the sophisticated reloading animations. The dense clouds that spew from smoke grenades and the brilliant firearm muzzle flashes also look unusually realistic. One thing that's conspicuously and ironically missing, though, is any gore, presumably so the game could earn a T rating and maybe even to sanitize combat for the potential recruits the Army hopes to woo with the game. Every bit of cover counts. Not surprisingly for a game so focused on realistic and immersive details, the weapon sound effects in America's Army are top-notch--easily among the best in the genre. From the reports of rounds being fired, to the casings clattering on concrete, to the click of a fresh magazine being inserted into a rifle, all the sounds draw you into the action. Even more than the visuals, they help you feel like you're really in the middle of brutal firefights. Even the game's ambient sounds, like the birds and cicadas in the pine forests of the Fort Benning training missions sound spot-on. America's Army: Operations clearly has a lot going for it, not the least of which is a level of realism that's constantly palpable and brought to life with very high production values. However, at this point, the game is limited by its focus on small-scale engagements between foot soldiers. You'll find a limited selection of weapons, no usable vehicles, and a limited number of maps. Some players might be turned off by the mandatory training missions, the lack of significant innovation or offline play, or the US Army's real motives for releasing the game. Still, if you're a serious shooter fan, you should at least give America's Army: Operations a try. At worst, you'll lose some time downloading it. At best, you'll get an unusually intense game that in many ways rivals or surpasses the top commercial tactical shooters.While the round system and single spawns call to mind Counter-Strike, America's Army doesn't have much in common with the arcade-style gameplay of that game. At its best, America's Army is an extremely intense game in which you really need to rely on your teammates if you hope to avoid death and accomplish your objectives. It's a game in which player movement speed is moderate at best and single shots can kill enemies outright, as they can and do in real life. You'll treat every little scrap of cover and concealment like it's a rare treasure. You'll aim carefully, squeeze off a few rounds, and then hit the dirt to avoid having your skull ventilated by a well-aimed bullet. When the tracers start flying, you won't even consider running around wildly and hopping all over the place like some players do in less realistic shooters. Unfortunately, even if you play smartly, a match can easily be lost because of unskilled teammates. Appropriately enough for a game meant to teach Army values, finding a good team is of paramount importance if you want to enjoy the game fully. To help you survive on the battlefield for more than 30 seconds, you'll be able to lean around corners, crouch, and go prone. In an unusual twist on the standard shooter movement options, you'll be able to switch from the default running speed to a full-out sprint, but your weapon will be temporarily lowered to prevent it from accidentally discharging. In another unusual touch, you'll also be able to roll quickly when prone, as well as make use of the usual side-to-side shuffle when crouching. It's great to have so many movement options, though you can't always use them when you need them, since the game's scenery, doorways, and other objects have an annoying ~sticky~ property and will occasionally catch you and prevent you from moving when you really need to. One of the most impressive elements of America's Army, and one of the obvious benefits of having real-world experts behind the game, is its detailed weapon modeling. You'll find predictable tactical shooter details like the way your rifle kicks when fired in bursts. Then you'll notice things that other shooters don't always model or model as well. Crouching or going prone dramatically improves your aim, for example, in part by reducing the effect breathing has on the steadiness of your crosshair. For increased accuracy, you use the gun's actual ~iron sights~ instead of the unrealistic crosshair for aiming when zoomed. The game also realistically switches you out of the zoom mode whenever you assume a different firing stance or make other major movements. Another neat touch that adds to the ambience, if not the actual gameplay, is the way a soldier visibly thumbs the switch on his assault rifle to toggle between semiautomatic and burst firing modes. During play, you'll be able to carry up to two weapons at a time, and you can drop weapons to pick up others from the battlefield. The game's arsenal isn't particularly large since the focus is on actual standard-issue Army weapons, but the firearms are all carefully based on the real things and can even jam. You'll get to wield the well-known M16A2 rifle and its shorter M4A1 variant. You'll also get use the M203 40mm grenade launcher, which can be attached to either of those rifles, as well as the SAW (squad automatic weapon) for laying down continued fire. ~Trained~ snipers get access to the 7.62mm M24 SWS and the .50-caliber Barrett M82A1. You can also pick up weapons dropped by fallen OpFor troops, like the AK-47, and you'll get to throw fragmentation, smoke, and flash-bang grenades, too. Along with its unusually realistic weaponry, America's Army features unusually detailed visuals powered by the latest version of Epic's Unreal engine. Other than some occasional clipping and the lack of lip-synching for your training instructors, the game generally looks superb. The models, textures, and visual effects usually match or surpass those found in today's top shooters. Attention to detail abounds, from the little patches on a sergeant's uniform, to the moths swarming around an outdoor light at night, to the sophisticated reloading animations. The dense clouds that spew from smoke grenades and the brilliant firearm muzzle flashes also look unusually realistic. One thing that's conspicuously and ironically missing, though, is any gore, presumably so the game could earn a T rating and maybe even to sanitize combat for the potential recruits the Army hopes to woo with the game. Not surprisingly for a game so focused on realistic and immersive details, the weapon sound effects in America's Army are top-notch--easily among the best in the genre. From the reports of rounds being fired, to the casings clattering on concrete, to the click of a fresh magazine being inserted into a rifle, all the sounds draw you into the action. Even more than the visuals, they help you feel like you're really in the middle of brutal firefights. Even the game's ambient sounds, like the birds and cicadas in the pine forests of the Fort Benning training missions sound spot-on. America's Army: Operations clearly has a lot going for it, not the least of which is a level of realism that's constantly palpable and brought to life with very high production values. However, at this point, the game is limited by its focus on small-scale engagements between foot soldiers. You'll find a limited selection of weapons, no usable vehicles, and a limited number of maps. Some players might be turned off by the mandatory training missions, the lack of significant innovation or offline play, or the US Army's real motives for releasing the game. Still, if you're a serious shooter fan, you should at least give America's Army: Operations a try. At worst, you'll lose some time downloading it. At best, you'll get an unusually intense game that in many ways rivals or surpasses the top commercial tactical shooters."}