{"ref": "https://www.gamespot.com/reviews/tom-clancys-rainbow-six-3-athena-sword-review/1900-6091303/", "date": "March 11, 2004", "game_name": "Tom Clancy's Rainbow Six 3: Raven Shield", "text": "It is said that history repeats itself. Apparently, Ubisoft does too. In last year's Tom Clancy's Rainbow Six 3: Raven Shield, you had to take the elite Rainbow commandos into battle against neofascists who were determined to detonate a weapon of mass destruction in the middle of a major city. In Athena Sword, the expansion to Raven Shield, you have to take the elite Rainbow commandos into battle against neofascists who are determined to detonate a weapon of mass destruction in the middle of a major city. Sound familiar? As Yogi Berra once quipped, ~It's dj vu all over again.~ And this attitude pretty much sums up Athena Sword. The expansion to last year's excellent shooter differs very little from its predecessor, in terms of plot, and heaps on more of the same tense tactical combat we've come to expect from the franchise. Soak in the lovely and historic city of Dubrovnik while you're busy taking down neofascists in Athena Sword. Athena Sword has a decidedly Mediterranean flavor to it since it's a direct product of Ubisoft's Milan, Italy, development studio. (Raven Shield came out of the company's Montreal, Canada, offices.) This time around, the neofascists that you stopped in South America have shifted their activities to Italy and Greece. Once again, you have to uncover what they're up to in a series of disparate missions that take place in exotic locales that would make James Bond envious. There's a swanky Italian art museum set in an ancient medieval fortress, as well as the historic and beautiful old city of Dubrovnik, Croatia. Follow that up with a couple of trips to a ritzy Monaco hotel, wrap it all in the heart of Athens, and you've got a tour of duty worthy of 007 himself. Not only are all the levels in Athena Sword quite large, especially by Raven Shield standards, but they're chock-full of personality and color. There's almost a sun-drenched atmosphere in the daytime missions that brings out the vibrancy of the textures. Ubisoft Milan has definitely upped the cultural quotient of the franchise by packing in tons of classical architecture, artwork, and statuary that really conveys the feeling that you're battling it out in the middle of Old Europe. And it's not all just eye candy either. For instance, in the art museum level, each wing of the museum showcases a different period of art. Smart players will quickly be able use the art to orient their location. Plus, the statues make handy reference points on the urban maps as well. More importantly, nearly all the levels are superbly designed to offer a range of tactical situations. The art museum is a mix of wide-open courtyards, long, narrow corridors, balconies, and gatehouses (which serve as excellent choke points). The Milan, Dubrovnik, and Athens maps are a warren of narrow alleyways and streets that are dotted by spacious plazas and markets for marksmen. However, there are also lots of opportunities for claustrophobic close-quarters combat in buildings. There's a factory level that's a nightmare of catwalks and tunnels, as well as huge open spaces for a sniper to feast on the unwary. The single-player campaign maps in Athena Sword are among the best we've seen for the series to date. Sadly, the single-player campaign is still festooned with holdover problems from Raven Shield. The biggest problem is the AI, which is still schizophrenic in nature. For example, there are times when the AI won't react to you at all. You can have a massive firefight in a hotel hallway only to turn the corner to see bad guys not 10 feet away, oblivious to what just happened. Hostages stand idly by as bullets whiz around them, and they don't know how to flee or get out of the way. Your teammates can still get stuck behind objects, thus forcing you to double-back to collect them because they can't navigate around a simple door, for instance. There are some improvements, though. For instance, the enemy AI now throws grenades at you (and there's a strange sense of karmic payback being on the receiving end of a flashbang for a change), but it still doesn't know how to coordinate attacks. Furthermore, the AI will alternate between being the best and worst shot in the world, which is frustrating when you're trying to get through the game without losing anyone and your head suddenly gets taken off a split second after you turn a corner. The obvious appeal of Athena Sword is its multiplayer. The expansion adds about 16 new levels--eight from the single-player campaign, five multiplayer-only maps, and three classic levels from earlier Rainbow Six games. That almost doubles the complement of maps from the original game. The single-player maps translate well in the multiplayer arena, and the huge size of the levels offer much more room to maneuver, especially to some of the relatively confined levels on Raven Shield. And the large amount of tactical variation on each map means that there's a mix of close-quarters and long-range combat that can take place, thus forcing teams to be a bit more balanced in terms of weaponry. There are nine new weapons in Athena Sword, bringing the total number of weapons to more than 50, all of which are customizable with silencers, expanded magazines, and more. The best of the new weapons is probably the Beretta M93R, which can fire a three-round burst and has an expanded 21-round magazine. It's remarkably useful in close quarters. Like in Raven Shield, all the new weapons sound exceptional, and the sound effects in the expansion are what we've come to expect of the franchise. (Indeed, Ubisoft touts that they enlisted the sound effects wizards from The Matrix movies to handle the game's weapons.) Positional audio, as always, plays a critical role, since knowing which direction footsteps are coming from can mean the difference between success and failure. About the only complaint we have with the sound is that the European neofascists have the same habit of speaking in broken English as their South American counterparts in Raven Shield. Stop! Or my commando will shoot! Athena Sword also includes five new multiplayer modes, most of which are variations on the existing team-versus-team modes, but there are a couple of notable additions. The first is capture the enemy, which plays exactly like it sounds. Instead of killing one another, you have to capture one another. When you shoot someone, they won't die. Instead they'll put their hands up in the air to surrender. You then have a few seconds to run up and cuff them, or else they'll lower their hands and will get to move and shoot again. Once they're cuffed, they'll kneel on the ground. However, they can escape if a fellow teammate can free them. The round isn't over until an entire team is captured and subdued, so there can be wild battles as survivors try to rally to rescue captive teammates. The other interesting new multiplayer match is kamikaze, which is a variation on the pilot mode from Raven Shield. One player gets to play the bomb carrier, who's got a bomb strapped to his person. His team has to protect him from harm, but it also has to prevent the other team from reaching a detonation computer and triggering the bomb. If the bomb carrier can get to a detonation computer first, he can disarm the bomb. This forces the team on defense to aggressively spread out instead of camping around the bomb carrier. If you're a fan of Raven Shield multiplayer, Athena Sword is pretty much a must-have if you're going to want to keep up with the rest of the player community--the vast majority of which has been starved for new content. However, as much as we like the single-player maps, we can't help but feel disappointed with the plot. Yes, the story in Raven Shield was a thin pretense to hang the missions on, but couldn't the developers have at least tried to come up with something original and interesting? Yet for all the flaws, Athena Sword makes a worthy addition to Raven Shield, and that's what you'd expect from an expansion pack."}