{"ref": "https://www.gamespot.com/reviews/tom-clancys-rainbow-six-3-raven-shield-review/1900-6023492/", "date": "March 24, 2003", "game_name": "Tom Clancy's Rainbow Six 3: Raven Shield", "text": "Since its debut in 1998, the Rainbow Six series has been an outstanding example of how exciting sophisticated tactical shooters can be, thanks to its challenging ~one-shot kill~ gameplay and complex mission planning. And even though the tactical shooter subgenre has become even better thanks to great games like SWAT 3 and Operation Flashpoint, fans still eagerly look to each new Rainbow Six installment to see what the series has in store next. While Rainbow Six 3: Raven Shield does little to push the tactical shooter genre forward, it's still an exciting entry in the series. Just like the previous Rainbow Six games, Raven Shield lets you lead a group of elite international counterterrorists known as Rainbow. These guys are equipped with high-tech gear and high-powered firearms and are itching for an opportunity to shout, ~Tango down!~ In Raven Shield, you'll help the Rainbow operatives on a mission with a rather forgettable plot that involves a James Bond-style madman and Nazi loot from World War II. In fact, as you play the rather short single-player campaign, you'll find that storytelling isn't one of Raven Shield's strong suits. You'll receive clear text and audio mission briefings and see a few well-directed but brief cutscenes, but these sequences don't quite create a strong sense of drama or immersion. Rather, the storytelling feels like merely a flimsy framework to hang the tactical combat on. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tom Clancy's Rainbow Six 3: Raven Shield Video Review Also, the mission goals sometimes tend to blur together into a repetitive string of ~Kill the terrorists and rescue the hostages.~ This sometimes makes the Rainbow team seem like a regular SWAT team instead of a truly elite international organization. And unlike the classic SWAT 3, Raven Shield rarely creates any real emotional connection with the hostages. In many cases, they'll essentially be a mission goal, similar to the hostages in the extremely popular Counter-Strike--you won't even see them until the very end of a mission. Still, whatever their flaws, Raven Shield's missions provide lots of intense tactical action. Each map is filled with lots of cover and sniping spots, as well as a seemingly endless number of places where you could be ambushed or caught in a brutal crossfire. In the first mission, for instance, you make your way through a Venezuelan oil refinery at night, creeping around railroad cars outside and then wending your way through a maze of heavy machinery and catwalks inside. Later, you'll shoot your way through an airport in the Cayman Islands, battle in the streets of Brazil, and cleanse a London bank of terrorists. Overall, the missions provide really diverse and interesting settings, though a few missions reuse the same maps, merely changing the basic goals or switching from daylight to a night setting. With so much happening tactically in each mission, preparation and planning are vital. After a mission briefing, you select up to eight operatives to take part in the coming mission. You'll get to fill out up to three sub-teams, choosing from specialists in assault, sniping, demolition, and so forth. Each operative is also rated in observation, leadership, and other general skills, and these stats will rise over the course of the game, particularly if an operative takes part in and survives a mission. After you've chosen your team, you get to equip your operatives individually. Real-world weapon buffs will love this part of Raven Shield, as the game's extensive arsenal includes assault rifles, shotguns, sniper rifles, and more. Experimenting with all the different weapon capabilities, ammo types, and optional attachments is almost like a minigame in itself. Along with the firearms, you can equip your troops with breaching charges, flash-bang grenades, tear-gas grenades, and other special weapons and tools. In addition, you can choose from a wide variety of different uniform camouflage schemes and body armor types. Once you've outfitted the operatives, you head to Raven Shield's planning room. This is the trademark feature that helped put the Rainbow Six series on the map, but it's also the one that's caused players a lot of grief because of its complexity. Here you'll see a schematic map of the mission area, along with a 3D view window of the area currently selected on the map. During a mission, you can only directly control one operative at a time and only give simple orders to your currently selected team. So, you'll need to set up a complex string of waypoints for each team on the planning map to ensure that all your operatives know what to do on their own. You'll choose from available insertion points, set rules of engagement, and assign special actions for particular junctures, like throwing a smoke grenade to cover an assault. As in the previous games, mission planning can be very rewarding in Raven Shield, but it's nevertheless laborious and might seem a bit confusing at first. Trying to make heads or tails of the game's convoluted maps and determine how best to coordinate up to three groups of operatives is no easy task, especially for a beginner. Plus, the planning screen isn't as user-friendly or as sophisticated as it should be. Mission planning can rewarding but cumbersome. If mission planning isn't your thing, you can always load a preset plan for each mission, and these usually work well enough. You can also just forget planning altogether and jump into the action with one four-person team. Of course, this means you'll be skipping the intellectually rewarding side of the game. Whatever plan you end up using, you'll find most of the in-game action to be thrilling. Raven Shield's focus on stealth and one-shot-kill realism helps build enormous tension. You might slowly sneak through a luxurious mansion, with only the gentle ticking of a grandfather clock to break the tense silence. As you round a corner, a fierce firefight will suddenly erupt, leaving a pile of bodies and shattered glass on the floor when the smoke clears. This repeated shifting between methodical, tense sneaking and lightning-fast gun battles keeps the game exciting almost all the time, though it also makes it unusually difficult. In fact, since Raven Shield doesn't actually let you save your game in the middle of the mission, beginners may find this difficulty truly daunting--if you slip up and lose half your team to an ambush, you may have to start over from the beginning. Then again, tactical shooter veterans may very well relish that sort of challenge; a better compromise might have been to include lower difficulty settings that offered you the choice of being able to save within a mission. Unfortunately, one of the long-standing problems of the Rainbow Six series sometimes rears its ugly head in Raven Shield: friendly and enemy AI can range from extremely smart to extremely stupid. Enemies will sometimes flank you or run for better cover if they feel too threatened, but other times they'll simply stand around in the open, ignore nearby gunplay, or just walk casually into your line of fire. For the most part, the Rainbow operatives cover each other well and react to threats fairly quickly. But sometimes, they'll blow themselves up with grenades or overlook obvious threats. You'll also run into occasional bugs and pathfinding problems that can cause your teammates to get lost or refuse to follow you as they should. If the teammate AI gets on your nerves, you can always go back and play the missions in the lone wolf mode, which sends you in without any support. This and a few other ~custom~ modes, which use the single-player maps, extend the game's replay value slightly, though not as much as they should. You can also head online for a variety of straightforward cooperative and competitive modes. While none of these are innovative, they can be a lot of fun because of their sheer intensity. Like the gameplay, the production values in Raven Shield aren't perfect, but they're clearly above average. The terrorists all conveniently (and unrealistically) speak English, even when shouting for help, but the game's voice-overs are otherwise mostly well done, and the music lives up to the high standards of the various Tom Clancy games. The weapon sound effects are quite possibly the best ever featured in a realistic shooter. Get the game running on a computer with a good audio setup, and you might be shocked at how the assault rifle fire in an enclosed area will be so intense that it almost knocks you out of your chair. Thanks to Raven Shield's stunning implementation of EAX sound support, even the sound of other operatives shooting it out with terrorists in adjacent rooms or buildings is also remarkably convincing. These terrorists were no match for the Rainbow operatives. Raven Shield usually excels visually, too. The game is powered by Unreal technology, and has minutely detailed textures, generally convincing animations, and great special effects like bullets kicking up snow or chipping concrete off walls. Also, Raven Shield gives you the option to see your weapons in the first-person view, which is a welcome change. Little artistic touches and careful attention to detail help bring the levels to life, too. You'll see the northern lights in the sky above a Norwegian shipyard and gumball machines and a tire promo display in the waiting room of an auto dealership. The only really significant issue with the game's visual presentation is the way dead bodies often slump in bizarrely contorted postures. In a way, this minor problem exemplifies Rainbow Six 3: Raven Shield. The game suffers from a number of small flaws (and sometimes bigger ones, where the AI is concerned), yet it still does many things exceptionally well. It's a shame that Raven Shield doesn't help redefine the tactical shooter genre the way SWAT 3 did, but despite its minor flaws, it's still a very impressive addition to the series and a worthy heir to the Rainbow Six name. As in the previous games, mission planning can be very rewarding in Raven Shield, but it's nevertheless laborious and might seem a bit confusing at first. Trying to make heads or tails of the game's convoluted maps and determine how best to coordinate up to three groups of operatives is no easy task, especially for a beginner. Plus, the planning screen isn't as user-friendly or as sophisticated as it should be. If mission planning isn't your thing, you can always load a preset plan for each mission, and these usually work well enough. You can also just forget planning altogether and jump into the action with one four-person team. Of course, this means you'll be skipping the intellectually rewarding side of the game. Whatever plan you end up using, you'll find most of the in-game action to be thrilling. Raven Shield's focus on stealth and one-shot-kill realism helps build enormous tension. You might slowly sneak through a luxurious mansion, with only the gentle ticking of a grandfather clock to break the tense silence. As you round a corner, a fierce firefight will suddenly erupt, leaving a pile of bodies and shattered glass on the floor when the smoke clears. This repeated shifting between methodical, tense sneaking and lightning-fast gun battles keeps the game exciting almost all the time, though it also makes it unusually difficult. In fact, since Raven Shield doesn't actually let you save your game in the middle of the mission, beginners may find this difficulty truly daunting--if you slip up and lose half your team to an ambush, you may have to start over from the beginning. Then again, tactical shooter veterans may very well relish that sort of challenge; a better compromise might have been to include lower difficulty settings that offered you the choice of being able to save within a mission. Unfortunately, one of the long-standing problems of the Rainbow Six series sometimes rears its ugly head in Raven Shield: friendly and enemy AI can range from extremely smart to extremely stupid. Enemies will sometimes flank you or run for better cover if they feel too threatened, but other times they'll simply stand around in the open, ignore nearby gunplay, or just walk casually into your line of fire. For the most part, the Rainbow operatives cover each other well and react to threats fairly quickly. But sometimes, they'll blow themselves up with grenades or overlook obvious threats. You'll also run into occasional bugs and pathfinding problems that can cause your teammates to get lost or refuse to follow you as they should. If the teammate AI gets on your nerves, you can always go back and play the missions in the lone wolf mode, which sends you in without any support. This and a few other ~custom~ modes, which use the single-player maps, extend the game's replay value slightly, though not as much as they should. You can also head online for a variety of straightforward cooperative and competitive modes. While none of these are innovative, they can be a lot of fun because of their sheer intensity. Like the gameplay, the production values in Raven Shield aren't perfect, but they're clearly above average. The terrorists all conveniently (and unrealistically) speak English, even when shouting for help, but the game's voice-overs are otherwise mostly well done, and the music lives up to the high standards of the various Tom Clancy games. The weapon sound effects are quite possibly the best ever featured in a realistic shooter. Get the game running on a computer with a good audio setup, and you might be shocked at how the assault rifle fire in an enclosed area will be so intense that it almost knocks you out of your chair. Thanks to Raven Shield's stunning implementation of EAX sound support, even the sound of other operatives shooting it out with terrorists in adjacent rooms or buildings is also remarkably convincing. Raven Shield usually excels visually, too. The game is powered by Unreal technology, and has minutely detailed textures, generally convincing animations, and great special effects like bullets kicking up snow or chipping concrete off walls. Also, Raven Shield gives you the option to see your weapons in the first-person view, which is a welcome change. Little artistic touches and careful attention to detail help bring the levels to life, too. You'll see the northern lights in the sky above a Norwegian shipyard and gumball machines and a tire promo display in the waiting room of an auto dealership. The only really significant issue with the game's visual presentation is the way dead bodies often slump in bizarrely contorted postures. In a way, this minor problem exemplifies Rainbow Six 3: Raven Shield. The game suffers from a number of small flaws (and sometimes bigger ones, where the AI is concerned), yet it still does many things exceptionally well. It's a shame that Raven Shield doesn't help redefine the tactical shooter genre the way SWAT 3 did, but despite its minor flaws, it's still a very impressive addition to the series and a worthy heir to the Rainbow Six name."}