{"ref": "https://www.gamespot.com/reviews/dynasty-warriors-5-xtreme-legends-review/1900-6139212/", "date": "November 17, 2005", "game_name": "Dynasty Warriors 5: Xtreme Legends", "text": "Dynasty Warriors 5 hasn't even been out for more than half a year, and already its first expansion is on the way. Dynasty Warriors 5: Xtreme Legends does what any Dynasty Warriors expansion would: It adds some new features and ultimately provides more opportunities for you to cut through hundreds upon hundreds of enemy soldiers for 15 minutes at a time. But therein lays the primary flaw of Xtreme Legends: Dynasty Warriors 5 already felt more like an expansion pack than a proper sequel. And now there's an expansion of a game that felt like an expansion to begin with? That's just too many layers of abstraction for any product to survive. In Xtreme Legends, you cut dudes, and they die--well, sort of. They don't actually die so much as they just fall over bloodlessly. Let's assume for the moment that if you're reading this review, you already know the crux of what a Dynasty Warriors game is about. Thus, we'll spare you the lessons on ancient Chinese warriors and whatnot. What you will want to know is what this package offers in terms of new modes. The bulk of them aren't terribly interesting. Xtreme mode returns from Dynasty Warriors 4: Xtreme Legends, letting you pick any of the available 48 warriors and jump into one of three immediately available scenarios. The goal is to keep pushing through as many missions as you can without being automatically healed between missions. During those downtimes, you can purchase health and weapon upgrades. You'll also be recruiting officers to fight alongside you as you play, and there's a co-op play option as well. Overall, it's an amusing mode that's fairly easy to jump into, but it isn't the kind of thing you'll want to play over and over again, simply because it's just a bunch of randomly generated battles that don't really provide much story context. The Legend mode is similarly basic. Eighteen individual scenarios are available to play, and each one represents one of the key battles from the game's mythos. Here, you get a little backstory by way of some explanation from some of the characters involved, but that's about it. The most interesting addition to Xtreme Legends 5 is the destiny mode. Here, you're given the ability to create your own officer, from physical attributes to costume and dress. You then choose one of the 48 warriors in the game to act as your chosen general. After that, the storyline follows a similar structure to any of the main story modes from the original Dynasty Warriors 5. You're presented with a series of battles, with objectives to meet during each one. Often you'll find yourself toting right behind your main general, which actually helps give you a more definitive sense of direction--provided your general doesn't get terribly confused and start wandering around in odd directions for a while, which does happen from time to time. The whole point of the destiny mode is to build and upgrade your character. You start out as the lowest of lowly officers, but as you play you'll gain rankings and upgrades for weaponry and skills, as well as some visual upgrades. There are even occasional story twists in which rival generals will try to sway you to the other side. In that situation, you can switch allegiances, or even go to the other side and work undercover for your general. And obviously, there are some differences in mission progressions depending on who you choose as your general. The destiny mode is easily the best thing this package has to offer, and it makes a reasonably suitable replacement for the musou mode, which is entirely absent in Xtreme Legends. However, if you already went out and got yourself a copy of Dynasty Warriors 5, you can combine the two games into one by going into the ~load original~ option on the main menu, inserting your DW 5 disc, letting it load, and then reloading your Xtreme Legends disc. Doing so tosses all the musou mode storylines back into the mix, but that's mostly it. The Xtreme mode is not quite as 'xtreme' as such a title might lead one to believe. Nothing else about Xtreme Warriors is especially different from the original game. There are a couple of new challenge modes and some new items and power-ups, but otherwise, this is precisely the same hack-and-slash action that you got in DW 5. The graphics are completely identical, right down to the bland-looking maps, and the audio features all the same ham-fisted voice acting and wailing rock guitars. Chances are you've already expected this, because no other Dynasty Warriors expansion has ever really expanded on any of these aspects. Ultimately, what it comes down to with Dynasty Warriors 5: Xtreme Legends is the following: If you already bought Dynasty Warriors 5 and enjoyed it, then you're the exact person that this expansion is aimed at, so the value of its content is likely worth your while. If you missed out on Dynasty Warriors 5 and are somehow curious about it, you can't actually find a new copy of that game for the PlayStation 2 right now in any major retail outlet, thus leaving you solely with Xtreme Legends. Xtreme Legends is $20 cheaper than DW 5 was when it first came out, but it also lacks the musou mode, which is where a whole lot of the content in this series lies. The destiny mode is certainly enjoyable, but it's not enough to carry the entire product, and the rest of the modes just feel like supplemental distractions. Thus, Xtreme Legends isn't as appealing as a stand-alone product. If this is too confusing, let us break it down very succinctly: If you liked Dynasty Warriors 5, you may enjoy Xtreme Legends, provided the concept of paying $30 for a few more modes doesn't upset you, and you're interested in more of the same. If you didn't like Dynasty Warriors 5, or even just didn't play it, then you don't need to bother."}