{"ref": "https://www.gamespot.com/reviews/x-men-mutant-academy-review/1900-2603650/", "date": "May 17, 2006", "game_name": "X-Men: Mutant Academy", "text": "Just as Activision has kept the PlayStation covered with X-Men games this summer, it has also kept the Game Boy Color in mind. The GBC release of X-Men: Mutant Academy is a one-on-one fighting game, just like its console counterparts. Take the idea of Street Fighter, paint over it with Marvel characters and spruce things up with a movie-inspired plot, and you've got the gist of X-Men. It isn't a new formula, but it's not immediately disastrous either. At the outset, X-Men: Mutant Academy seems promising. There are five game modes: story, battle, versus, survival, and training. While the story, battle, survival, and training are modes familiar to most fighting game vets, this game marks only the second GBC fighting title to feature link-cable support. Kudos to Crawfish for that. There are nine selectable characters and two hidden characters: Storm, Magneto, Cyclops, Wolverine, Sabretooth, Toad, Mystique, Gambit, Pyro, Phoenix, and Apocalypse. Since there's no battery save, the game rewards you with the unlock codes to the latter two characters once you've beaten the story mode. Other than that, that's it. An abrupt end to what was the beginning of a decent feature list. No hidden artwork, no sneaky secrets, and no superboss to unlock. While X-Men's features are nothing to write home about, its gameplay might just warrant a restraining order. Once you begin a match, you quickly realize the game's shortcomings. First, the control is sluggish and unresponsive. While the GBC hardware is partly to blame, games such as Street Fighter Alpha and Power Quest prove that adaptation is possible. The game's fight system itself is a throwback to pre-Mortal Kombat days, with one button for punch and another for kick, and with the duration of button press controlling the strength of the attack. Unfortunately, each character has exactly the same punches and kicks, with zero variation in range or damage. Special moves are done via quarter circle, half circle, and tapping motions coupled with button presses, but since each character has only three special moves, you won't need to worry about them too much. The game also lacks reversals, counters, and combos above your basic three-hit chain. A rage meter at the bottom of the screen lets you perform devastating supermoves, but thanks to the unresponsive control, you won't use them much, either. Serving as the game's final dosage of cyanide, the single player AI is the sheer definition of detritus. Walk to the middle of the screen, crouch, and tap the punch button repeatedly. You'll win every match, regardless of the difficulty level. The link-cable mode offers a chance for redemption, but with uninspired moves, sluggish control, and a lack of variety, does this game sound like something you'd want to challenge a friend to? Contrary to the above, X-Men: Mutant Academy does have a single redeeming trait - its visuals. Inasmuch as Street Fighter Alpha came at you with large sprites and fluidly animated characters, X-Men improves upon the idea. Whether you choose Wolverine, Magneto, or the ever-luscious Storm, the character sprites are large, colorful, and expressive. Framing these sprites are the best background visuals ever rendered on a GBC screen. While Street Fighter Alpha had more background animation, X-Men: Mutant Academy leaps out with colorful, stylish backdrops. Despite the game's visual performance, though, the audio devolves back into disappointment with overly dramatic theme music and painfully scratchy sound effects. The Game Boy Color may not be an audio powerhouse, but it's capable of better. While the ~big brother~ console release of X-Men: Mutant Academy may be at least tolerable, the Game Boy Color release falls flat. This disappointment is doubly painful when you consider that the same development company responsible for Street Fighter Alpha for the GBC is responsible for this game's failure. Once you pry away the enjoyable visuals, you end up with a title that barely warrants any gameplay or value scores at all. Professor X would not be pleased."}