{"ref": "https://www.gamespot.com/reviews/grim-dawn-review/1900-6416401/", "date": "April 7, 2016", "game_name": "Grim Dawn", "text": "Grim Dawn is a fast-paced, gory, and loot-filled action RPG that deserves a spot among the greats of the genre. The developers at Crate Entertainment have ticked off all the boxes that hack-and-slash fans want, and as one of those fans, I was reminded of countless experiences from the past, but there's more to Grim Dawn than old tricks.Much of its appeal lies in the forbidding realm of Cairn; a world H.P. Lovecraft would see fit to call ~home,~ which blends horror and fantasy in nearly equal measure. Maps are all spectacularly bleak--corpses, guts, and gore are everywhere. Bodies can be found piled into wagons as if the Black Death had just swept the land. Wander into a half-destroyed house and youll find evidence of lives interrupted, represented in fantastic detail.A phenomenal musical score provides superb accompaniment to all of these scenes. Aspects of it are really offbeat, too. Some pieces bring to mind traditional fantasy, while others are much more avante garde. One particular tune features jangling western-style steel guitar and plaintive horns that recall the old west. Tunes are spooky and subtle; they never broadcast their presence with loud martial bleats or riffs, allowing the action to speak for itself.Grim Dawn's combat is every bit as compelling as the story and setting, even though those two elements are arguably more original than the very good, if very traditional, action RPG mechanics. Character creation and evolution are suitably deep. There are six classes to choose from when creating your hero, and the range of options--Arcanist, Demolitionist, Nightblade, Occultist, Shaman, and Soldier--cover all the D&D-inspired bases. You can even dual-class a little way into the game if youre not entirely happy with your initial choice or want to add different skills to the mix.As expected with a hack-and-slasher like this, you level up frequently--expect to hit level 10 within a couple hours, for example, and to be well into the high double digits long before wrapping the campaign. There is also a fair bit to do when assigning skill points. Every character class comes with an extensive skill tree, allowing for various buffs, arcane abilities, and so forth, all of which improve your killing abilities. And theres also something called the Devotion system, which lets you take points earned from the restoration of shrines found around Cairn and use them to pick astrological symbols that provide additional special skills and boosts.Theres a great rhythm to every scrap, and monsters give you a good run most of the time, but almost always bite the dust well before your hand grows numb from incessant clicking. With that said, the game does feel somewhat padded. Some maps are a little too crammed with enemies. There were times when I just wanted to get to the end of a quest, and the why settle on a thousand foes when two thousand would be even better? approach became too much to take. Still, I continually got sucked into marathon play sessions that ran for hours. Id get into a game and eventually look up at the clock to realize that five hours had vanished. Alien abductees have had less trouble with missing time.Grim Dawn strangest enemies encompass everything from dinosaurs that look like theyve been put through a blender to the worm-like refugees from Dune.The enemy lineup is broad and appealing, boasting deeply weird Chthonic demons, stereotypical fantasy creeps, and a wide range of human opponents that run the gamut from priests to cowboys. Grim Dawn strangest enemies encompass everything from dinosaurs that look like theyve been put through a blender to the worm-like refugees from Dune.Loot drops from these beasties are fantastic, giving a proper reward--usually a cool new piece of gear--to every battle. Whether it be a new weapon, piece of armor, magic ring, or some sort of weird accoutrement that you can use to buff one of the above, Grim Dawn grants you a steady supply of new toys The flow of useful gear is so consistent that I must have upgraded some aspect of my characters equipment every 10 or 15 minutes. The only drawback was that this influx of goods overwhelmed my inventory and forced me to make frequent trips to town. The ability to spawn riftgates for instantaneous travel made this a little less onerous than it might have been otherwise, although it was still a hassle when combined with the inscrutable checkpoint system.Grim Dawn has enough tricks up its sleeve to charm even the most grizzled veteran.Grim Dawn can be like pulling the lever on a slot machine, the only difference being that the reward here isnt cash but the gory explosion of beasts and the clink of loot-drops. I know from personal experience that this game has that certain something, and even if you think that you've grown tired of games of its ilk, Grim Dawn has enough tricks up its sleeve to charm even the most grizzled veteran."}