{"ref": "https://www.gamespot.com/reviews/pirates-of-the-caribbean-dead-mans-chest-review/1900-6154184/", "date": "July 17, 2006", "game_name": "Pirates of the Caribbean: Dead Man's Chest", "text": "Hot on the heels of Bethesda's Pirates of the Caribbean: The Legend of Jack Sparrow, which filled us in on some of the past exploits of cinema's most flamboyant buccaneer, comes Buena Vista Games' Pirates of the Caribbean: Dead Man's Chest, which aims to bring us up to speed on Captain Jack's most recent voyage concerning a certain seafaring spirit named Davy Jones. Dead Man's Chest does a good job of evoking the spirit of the second film, expanding on and making alterations to the plot without breaking it. The dominant sword-fighting mechanics are even a bit novel at first, but the game fails completely in exploiting them, and this shortcoming, along with some clumsy platforming and a frustrating late-game design decision, all but drag Dead Man's Chest down into the murky depths. Captain Jack Sparrow has a debt to pay to Davy Jones. The story in Pirates of the Caribbean: Dead Man's Chest is fairly faithful to its cinematic counterpart, focusing almost exclusively on the bits featuring Captain Jack Sparrow, since that's the character you'll be playing as over the course of the game. The game starts with a little explanation for what Jack was doing in that coffin at the start of the film, and on the whole the story is mostly faithful, though it tweaks a few minor exchanges for the sake of streamlining the game's storytelling and stuffing more fights into the narrative. It's also highly referential to the film, and if you haven't seen it, some of the storytelling will come across as a little murky. It works better as a companion piece than a stand-alone story. Johnny Depp lent his voice to The Legend of Jack Sparrow, but Dead Man's Chest gets a soundalike who doesn't slur quite enough, though he actually gives a more enthusiastic performance than the real Jack Sparrow. More authentic than the voice work is the Hans Zimmer score, which regularly swells up to accompany the clanging of swords, the crack of a flintlock, and other sounds of general swashbucklery. As Captain Jack, you'll make your way from that dreaded cliff-side Turkish prison to a lush jungle island to the pirate port town of Tortuga and beyond. But no matter what exotic locale you travel to and what salty enemies you encounter--which include regular old pirates, the Harryhausen-esque skeletal variety, zombies, cannibals, and more--there are really only three different enemies you'll encounter over the course of the game. The game takes a unique approach to the swordplay, where a button icon will appear over an enemy's head when you approach him, and you'll need to press the appropriate buttons in sequence to take him down. The system is reminiscent of The Mark of Kri, though Dead Man's Chest only lets you engage one enemy at a time. This would have worked quite well if the button combos you needed to take down an enemy ever evolved. There is a different combo to take down each of the three different enemy types, but once you figure out what kind of enemies you're dealing with, most of the excitement is sucked out of the action. The predictability is a shame, because this combo system could have made for some really excellent boss battles, but instead it's just squandered. There's more to the single-player game in Dead Man's Chest than just sword fighting, just not that much more. The game breaks up all the blade work with the occasional puzzle, though it also spells things out for you with a series of skull-and-crossbones icons that basically tell you what to do next. There are some real piratical activities to get up to, such as knocking down walls with cannon fire and using explosive rum barrels to knock down doors, but it's more for window dressing than anything else. The puzzle-solving, while not particularly challenging, at least works as it ought to, unlike the game's sloppy platforming sections. Dodging plumes of fire and falling boulders is pretty stock video game activity, but your control over Jack's movement is too imprecise for its own good, which will inevitably lead to some unwarranted deaths. The punishment for death is scant, simply returning you to an earlier spot in the level, so it's not as frustrating as it could have been, but that still doesn't make it enjoyable. Another irritating point is the way the endgame is structured. As you progress through the single-player game, you'll pick up hidden pieces of maps that, once you've collected enough, will give you access to one of five Kraken Arenas. Here, you'll face a wave of four enemies before you're rewarded with a piece of the Kraken Statue, and you'll need all five pieces of the Kraken Statue from all five Kraken Arenas before you're given access to the final encounter with, you guessed it, the Kraken. Aside from being needlessly convoluted, the problem here is that if you get through all of the regular levels without collecting enough map pieces to enter all five Kraken Arenas, you have no way of knowing which level that you've already completed needs to be revisited. Considering how monotonous the action has become by the time you will have reached this point, the chances that you won't even care enough to revisit those previous levels are quite good. Completely separate from the landlubbing single-player game in Dead Man's Chest is a four-player naval combat game. With any empty slots being filled by artificial intelligence opponents, you'll pick a ship from several different types, including a sloop, brigantine, fluyt, frigate, and galleon, and then head out onto the high seas with your cannons blazing. There are four different game types to choose from, including deathmatch, last man standing, timed match, and plunder the flag. There's even a persistent aspect to it, where any gold you pick up over the course of the game can be put toward ship upgrades that will effect how you perform in future games. Best of all, the full four-player experience can be had through game sharing with just a single copy of Dead Man's Chest. It's not particularly deep, but it's consistently fast-paced and engaging, which is more than can be said for the single-player game. The multiplayer is divorced from, and surprisingly much more interesting than, the single-player. The visual style of Dead Man's Chest is the best thing the graphics have going for it, which can be a little too dark and hazy at times but gets the mood right with lots of smoky lighting and appropriately unseemly locations. Beyond the look and feel, though, the game is rife with repetitive character models, choppy animation, and some pretty lo-fi textures. Jack Sparrow himself looks OK, if a bit too puffy in the face, but his animation turns his trademark teeter into full-on gesticulations, and it's so far over the top that it's distracting. If you're a big fan of Pirates of the Caribbean, Dead Man's Chest complements the films pretty nicely, and you'll probably be more willing to overlook the one-trick combat and ill-conceived platforming in the single-player game than most. Without some affection for the source material, though, Dead Man's Chest will seem like a pretty unremarkable action adventure with a fair amount of wasted potential."}