{"ref": "https://www.gamespot.com/reviews/kirbys-dream-buffet-review-good-food-tiny-portions/1900-6417954/", "date": "September 8, 2022", "game_name": "Kirby's Dream Buffet", "text": "If there's one thing Kirby is known for--apart from being ~friend-shaped~ and adorable--it's the little guy's insatiable appetite. Kirby's Dream Buffet hones in on this aspect, creating a game all about chowing down on tasty treats as fast as you can. While the title seemingly draws inspiration from a variety of games, most notably Fall Guys, Beautiful Katamari, and Mario Party, it succeeds in differentiating itself from the rest and feeling quintessentially Kirby with its lighthearted, food-centric, and fun tone. However, for all of its charms, Kirby's Dream Buffet suffers from quite a few issues--most notably, a serious lack of content and incentives to keep playing. While rolling around as Kirby is enjoyable, the experience feels more like a light snack than a well-balanced meal.Kirby's Dream Buffet begins atop a table adorned by pastel-colored pastries and sweet treats. After rolling off your plate and onto the gingham-patterned tablecloth, you can browse through a variety of supplemental features or roll straight on into one of the game's three play modes: Battle mode, Online mode, or Local Play mode.In Battle mode, you and up to one other player can take on CPUs for the chance to take the cake--literally. Online mode, on the other hand, pits you against players all over the world through either random matches or password-protected private games. However, if you and your buds are all in the same room, you can also do Local Play, which allows up to four separate consoles to play the game together.Despite these differences, all these modes consist of the same three events: races, minigames, and battle royales. In a Gourmet Grand Prix--essentially the default way to play--two races, one minigame, and a final showdown via battle royale are combined to form a cohesive experience, after which four Mario Party-esque awards are dished out and one Kirby is crowned the heavyweight king. However, regardless of what event you select, how you go about playing is essentially the same: You roll around, collect fruit, and attempt to either out-race or outlast your opponents.While competing, there are two things that can give you an edge: collecting fruit and rolling over item boxes. While picking up fruit earns you the points you need to win the game, it also increases your Kirby's size, allowing you to cover greater ground as you move while also giving you a bit more weight to throw around when bumping into other players. Item boxes, on the other hand, will give you a consumable you can use to get ahead. These items take the shape of different foods you can use Kirby's signature power absorption ability on. These include healthier snacks, such as hot peppers, which cause you to coast through the course aflame, as well as delicious-looking donuts that allow Kirby to take the shape of a wheel.All these aspects combine to create a game that is actually quite fun, in the moment. While the controls are a bit wobbly, it feels like a deliberate choice and ultimately adds to the excitement of the matches. Dream Buffet also succeeds in taking some great ideas from a few series--such as the random, game-changing awards dished out at the end of Mario Party--and combines them into something new. That feature in particular (along with how each race concludes with some first-come-first-serve dishes of strawberries that can drastically alter the number of points you have) consistently gives players opportunities to make a huge comeback. While this could be irritating for more competitive players, I found it kept the game lighthearted and fun.Unfortunately, this is about where my excitement for Kirby Dream's Buffet's ends. While there are four difficulties you can set the CPUs to--sweet, normal, spicy, and extra spicy--none of them are particularly challenging. Even worse, the game tends to have connectivity issues during online matches, meaning not even human opponents can put up a proper fight. All this paired with how few differences there are between courses and minigames means that Kirby's Dream Buffet grows repetitive very quickly. For example, when I pulled the game out for a family game night, each one of us could play about two Gourmet Grand Prix' each before we were ready to move on to another, more engaging party game. It didn't help that only two at a time can play the game locally, which feels like a missed opportunity.As for what else you can do in Kirby's Dream Buffet, the list is not long. Outside of the main events, you can pop by Free Rolling mode (which acts as a sort of training ground), change your costume and color, and check any rewards you've earned. These rewards primarily consist of new costumes, which are cute enough, but don't do much to offset the repetitive gameplay and incentivize you to continue playing. And that's it. Not even an options menu is included in the game, meaning if you need any sort of accommodations, you're out of luck. While handling Kirby in ball-form is meant to be a bit tricky, the game doesn't account for anyone who might need extra assistance, button remapping, or visual aids. This is even more egregious when you see how small some of the text is in handheld mode.In short, a lot of what Kirby's Dream Buffet relies on is its adorable aesthetic, which, to be fair, is where it shines. The pastel-colored paradise is filled with food that, while not quite as tempting-looking as something from a Studio Ghibli film, is a visual treat. There is an exuberance that shines through while you play, making the experience feel distinctly ~Kirby.~ Also in typical Kirby fashion, the music is delightful, being composed of upbeat and somewhat jazzy tunes. However, for all its charms, it's a bit frustrating that every level has the exact same aesthetic. While it's understandable that the game wants to keep its soft and sweet visuals, you can't help but grow weary of every course delivering just that, with no real color palette changes, unique songs, or any sort of gimmick that sets them apart. The result is something that feels uninspired.In a world where most Nintendo games are $60 for, well, ever, Kirby's Dream Buffet's $15 price tag indicates a different thought process on Nintendo's part. But when stacked up against free-to-play games like Fall Guys, even that lower-than-usual price feels out of line with what's offered in Dream Buffet. While any expectation of a full-size Kirby game seems unreasonable considering the main series just got a new entry earlier this year, Kirby's Dream Buffet feels incomplete and just doesn't quite hit the mark."}