{"ref": "https://www.gamespot.com/reviews/shin-megami-tensei-digital-devil-saga-review/1900-6121713/", "date": "April 5, 2005", "game_name": "Shin Megami Tensei: Digital Devil Saga", "text": "~True Goddess Rebirth~ is a somewhat literal translation of Shin Megami Tensei, Atlus' long-running role-playing series that deals with all manner of demons, deities, and the occult. Digital Devil Saga is the latest in this line of games, which includes last year's great Shin Megami Tensei: Nocturne. Similarly, this installment matches up favorably to its creepy forebears. Eschewing the series-favorite demon recruiting for an open skill advancement tree, Digital Devil Saga keeps the strategic balance of abilities that makes battle engaging and fun. As the first of a two-game continuity, some of the storytelling here poses more questions than it answers, but Digital Devil Saga stands well on its own, presenting a dark and interesting world that you can't help but want to know more about. The Junkyard was never a very happy place, and that was before people started sprouting extra heads and eating one another. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Shin Megami Tensei: Digital Devil Saga Video Review The Junkyard is a world dominated by scattered urban environments that surround a great building called the Karma Temple. Each small city is lorded over by a tribe, and the tribes all fight one another, purportedly to eventually gain the right to climb the heights of the Karma Temple to reach nirvana. One such battle between two groups converges on a strange artifact that bursts open during their conflict, firing out ribbons of light that spread over the land, giving all humankind the ability to take the form of bloodthirsty demons. Many of the transformed set upon one another immediately to devour the flesh they now desperately crave and need for survival. It was only after this initial confusion died down that a young man named Serph and his tribe, the Embryon, came upon a girl. She was within the artifact itself and could provide no clues as to where she was from or what her ultimate purpose was. She only new that her name was Sera. Then, the order comes down from the Karma Temple that the tribes must devour one another until there is only one tribe left. That remaining tribe must ascend the temple with the girl. The Embryon set out to accomplish this goal, as well as attempt to unravel just what it is that's happened to them and their world. The Junkyard is a fascinating place, and its inhabitants are no less so; the entire world is fleshed out with Indian myth and lore (the warring city-states are all named after chakras, and Indian artwork is etched into the stone of the temples). The people are mostly battle-hardened and intent on reaching their goals. It's a grim spot to have to eke out a living, but the environments and characters all look great, as series artist Kazuma Kaneko brings Digital Devil Saga to life with style. From the urban zones the Embryon calls home, to the winding corridors of dungeons, to the bizarre fusion of spiritual grandeur and technology that is the Karma Temple, the world has a very unique feel. Unique, too, are the characters, with their kohl-rimmed eyes and sharply outlined lips in human form, as well as the truly outrageous demons, which feature teeth in the oddest of places. While you might not get to recruit enemy demons to your cause, the game doesn't stint on the abilities it lets your own demons learn. All characters can learn all skills, which means you're free to customize them however you like. Each character has the ability to specialize in mantra, which are sets of demon powers that enable you to learn elemental spells (like those involving fire, ice, and lightning), as well as new physical attacks and magic to boost your abilities. You'll buy mantra with money, and the only requirement to learning a given mantra is that you have enough money and any lower ranks of that particular ability tree. Any character can learn any ability in the game, so you're free to mix and match as you like. This leaves you wide open to mold your characters as you see fit, so long as you have enough money to keep buying mantras and enough points to train them. This means you aren't trapped into anything except for the character's innate weaknesses and resistances. It's almost akin to Final Fantasy X's sphere-grid system, but it's much more easily customizable, as you can trade around abilities from the very beginning. To learn abilities for a character permanently, you'll need atma. Atma points are gained when you defeat enemies in battle, much like experience points. However, you can use special ~devour~ abilities to gain greater amounts of atma from your foes. So if your enemy is ~frightened~ of you, you'll gain even more atma when you chow down. As a result, it's generally not too hard to max out your mantra so you can equip the skills. (You can even get a ~stomachache~ from eating your foes!) As you gain in level, the number of skills you can equip at one time increases. Consequently, it becomes easier and easier to load up your party with vital abilities to proceed. However, that still doesn't make battle a cakewalk. You'll have to know when and where to apply your skills to gain an advantage. Feast richly upon your enemies. However, the fava beans and chianti are optional. Combat is turn-based...with a twist. If you inflict a critical hit on your foes, or if you hit them with an element they've a natural weakness to, you can gain extra character moves during your turn. Likewise, if your enemies are pounding you, they'll get extra turns that let them grind you to powder. This means that even routine battles can quickly turn into desperate situations. Knowing creatures' weaknesses and being able to defend against various types of attacks is the key to succeeding. There's no mindlessly tapping the X button here. Even against known foes, battles don't always map out the same each time, as your enemies can call in recruits or drain your mana to recharge their own abilities. This level of tactical prowess from your computer-controlled opponents is a lot of fun, and that's a good thing, because the encounter rate in Digital Devil Saga is very high. In some stretches, it can border on the ridiculous. But at least there are plenty of save stations around to record your progress, in addition to heal stations you can use to cure your party members for a fee. The save stations (called karma terminals) will also generally allow you to teleport to larger karma terminals in the same area, letting you back out of a zone quickly if you need to, as well as purchase new mantras to try out new abilities. You won't have to purchase all your skills, though. There are also special combo attacks your characters will automatically learn if they have the necessary abilities, and a number of them are powerful. Some are actually triggered by reverting your characters to human form, which you can use a turn for. But in general, you don't want your party members running around as their meager selves. And the characters themselves might share this sentiment. In fact, one of the interesting threads in the game is how the characters react differently to their newfound forms, in addition to how they react to their needs to power themselves with living flesh. There is some voice work during cutscenes, though the characters are more distinctive visually than they are vocally, especially since they all seem to deliver their lines with a similar solemn tone. More notable is the soundtrack, which is a truly eclectic mix, from the driving guitar rock of the battle themes to the more mystical (sometimes unsettling) tunes that dot certain areas and cutscenes. The great sound, along with its great visual style and its sometimes bizarre subject matter, really serve to make the game experience very unlike virtually anything else out there. Digital Devil Saga leaves plenty of unanswered questions. Fortunately, there's a sequel coming down the pike. There's little resolution in the ending of Digital Devil Saga's 30-40 hour adventure because it was developed as a direct prequel to another game that Atlus currently plans to release this summer. As a result, some of the choices you make can feel a bit arbitrary, and you'll be left with more questions about the characters and their world than you have answers. Nevertheless, Digital Devil Saga's great demon combat and tenebrous world full of myth and mystery make it worthy of the Shin Megami Tensei name. If you don't mind cliff-hangers and lots of turn-based combat, definitely consider giving this role-playing game a try. To learn abilities for a character permanently, you'll need atma. Atma points are gained when you defeat enemies in battle, much like experience points. However, you can use special ~devour~ abilities to gain greater amounts of atma from your foes. So if your enemy is ~frightened~ of you, you'll gain even more atma when you chow down. As a result, it's generally not too hard to max out your mantra so you can equip the skills. (You can even get a ~stomachache~ from eating your foes!) As you gain in level, the number of skills you can equip at one time increases. Consequently, it becomes easier and easier to load up your party with vital abilities to proceed. However, that still doesn't make battle a cakewalk. You'll have to know when and where to apply your skills to gain an advantage. Feast richly upon your enemies. However, the fava beans and chianti are optional. Combat is turn-based...with a twist. If you inflict a critical hit on your foes, or if you hit them with an element they've a natural weakness to, you can gain extra character moves during your turn. Likewise, if your enemies are pounding you, they'll get extra turns that let them grind you to powder. This means that even routine battles can quickly turn into desperate situations. Knowing creatures' weaknesses and being able to defend against various types of attacks is the key to succeeding. There's no mindlessly tapping the X button here. Even against known foes, battles don't always map out the same each time, as your enemies can call in recruits or drain your mana to recharge their own abilities. This level of tactical prowess from your computer-controlled opponents is a lot of fun, and that's a good thing, because the encounter rate in Digital Devil Saga is very high. In some stretches, it can border on the ridiculous. But at least there are plenty of save stations around to record your progress, in addition to heal stations you can use to cure your party members for a fee. The save stations (called karma terminals) will also generally allow you to teleport to larger karma terminals in the same area, letting you back out of a zone quickly if you need to, as well as purchase new mantras to try out new abilities. You won't have to purchase all your skills, though. There are also special combo attacks your characters will automatically learn if they have the necessary abilities, and a number of them are powerful. Some are actually triggered by reverting your characters to human form, which you can use a turn for. But in general, you don't want your party members running around as their meager selves. And the characters themselves might share this sentiment. In fact, one of the interesting threads in the game is how the characters react differently to their newfound forms, in addition to how they react to their needs to power themselves with living flesh. There is some voice work during cutscenes, though the characters are more distinctive visually than they are vocally, especially since they all seem to deliver their lines with a similar solemn tone. More notable is the soundtrack, which is a truly eclectic mix, from the driving guitar rock of the battle themes to the more mystical (sometimes unsettling) tunes that dot certain areas and cutscenes. The great sound, along with its great visual style and its sometimes bizarre subject matter, really serve to make the game experience very unlike virtually anything else out there. Digital Devil Saga leaves plenty of unanswered questions. Fortunately, there's a sequel coming down the pike. There's little resolution in the ending of Digital Devil Saga's 30-40 hour adventure because it was developed as a direct prequel to another game that Atlus currently plans to release this summer. As a result, some of the choices you make can feel a bit arbitrary, and you'll be left with more questions about the characters and their world than you have answers. Nevertheless, Digital Devil Saga's great demon combat and tenebrous world full of myth and mystery make it worthy of the Shin Megami Tensei name. If you don't mind cliff-hangers and lots of turn-based combat, definitely consider giving this role-playing game a try."}