{"ref": "https://www.gamespot.com/reviews/final-fantasy-xi-review/1900-6092072/", "date": "March 31, 2004", "game_name": "Final Fantasy XI", "text": "Final Fantasy XI isn't a new game--it's just newly released for the PlayStation 2 in North America. However, the game originally debuted in Japan nearly two years ago in the summer of 2002. Late last year, a PC version of the game shipped to these shores, which was many English-speaking gamers' first exposure to the persistent world of Vana'diel. The new PS2 version of the game is identical, to the point where you can freely transfer your player character between the different versions of the game. Yet while it's the same Final Fantasy XI, the context is completely different. Despite the fact that the PC gaming market is oversaturated with massively multiplayer online role-playing games, many PS2 owners have never experienced such a game before. But let's not beat around the bush: The PC is the better platform for Final Fantasy XI, and to properly enjoy it on your PS2, you'll need to pay $100 for the PS2 hard disk drive (the game comes included) and possibly $40 for a PS2 network adapter if you don't already have one. Plus you'll need a USB keyboard hooked up to your console to communicate with other players. On top of this, Final Fantasy XI is a time-consuming game that's got monthly fees associated with it. And now the good news: For some players, the unique experience that Final Fantasy XI provides is well worth it. Final Fantasy XI is actually a two-year-old game, but there's still very little else like it on the PlayStation 2. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Final Fantasy XI Video Review When Final Fantasy XI first launched, it experienced many of the growing pains that many online RPGs experience in the days following their release--server instability, game balance issues, exploits, and so on. Fortunately, these issues have basically all been taken care of, so what you're getting out of Final Fantasy XI is an online RPG that's fully ripened. The game is stable and lag-free on a broadband connection (don't even think about playing over a dial-up connection). The character classes (called ~jobs~ here) are balanced, and each is respectable in its own right. There's a considerable amount of content for players of all levels, including content from a full-on expansion pack, which was released as a separate retail product in Japan. The gameplay, though not drastically different from that of other online RPGs at a glance, has some unique and interesting features. Furthermore, if you're expecting that an online RPG originally designed for consoles yet clearly derived from EverQuest would seem simplistic--or ugly--by the genre's current standards, you'd be mistaken. It's true that Final Fantasy XI is simpler in some ways than most other MMORPGs, but the simplified aspects--your character doesn't need to eat and cannot grow fatigued from running too much, for example--are mostly to the game's credit. Not all such omissions are praiseworthy, however. There's no player-versus-player aspect to the game currently, though one is planned, and because Square Enix has delivered on its past promises of additional content (by introducing a higher-level cap for player characters, new jobs, unique in-game events, and more), there's reason to be optimistic about this game's ongoing development. Additionally, Final Fantasy XI features better graphics, sound, and music than the vast majority of PC games like this. Since any Final Fantasy XI player will inevitably end up staring at the graphics and listening to the sounds for long stretches at a time, their quality does make a big difference. The world of Vana'diel is consistent with the style and theme of many other Final Fantasy games. Online RPGs are some of the most inaccessible games out there, for reasons that include their lack of an offline component, their steep learning curves, the time commitment they typically demand from the player, and their relatively costly monthly fees. Unfortunately, Final Fantasy XI doesn't buck any of these bad trends. In fact, Final Fantasy XI seems to do its worst to give you a negative first impression. Its gamepad/mouse-and-keyboard control scheme is functional, but it's entirely unconventional, so it will take a few good hours to get used to it. Even before this, the time it takes from the moment you first open the box to set up your new PS2 hard drive to the moment you first set foot in Final Fantasy XI's world of Vana'diel is going to take a good hour or so. Additionally, there is also the time it takes to patch the outdated game data to the latest version and the time it takes to slog through the game's convoluted front end, which requires you to enter several different registration codes along the way. The front end warrants a closer look. Final Fantasy XI is really just one facet--but, certainly, by far the biggest attraction--of Square Enix's proprietary PlayOnline service, which is the gateway to Final Fantasy XI. This self-contained service's offerings include e-mail and a friends list, though if you're reading this, you probably don't need another e-mail address. PlayOnline features another game, TetraMaster, in addition to Final Fantasy XI. Access to it costs another dollar per month on top of the $12 and change it costs per month to remain subscribed to Final Fantasy XI after your first 30 days, which are free. TetraMaster, which originated as a minigame in Final Fantasy IX, is a multiplayer card game reminiscent of Magic: The Gathering, and it can be fairly addictive. However, Final Fantasy XI could easily suck up all your spare time by itself, and it's costly enough as it is. Getting Final Fantasy XI up and running for the first time is a chore, and the controls take a lot of getting used to--but your patience should eventually be rewarded. Want to have more than one character on your Final Fantasy XI account? That will cost you, too: The first one's on the house, and any additional character slots cost $1 apiece on top of the monthly flat fee. Highway robbery, perhaps, but one of Final Fantasy XI's innovations is that it lets you change jobs freely. Sick of your warrior and want to try being a white mage (the Final Fantasy equivalent of a healer)? You can go right ahead. You'll start back at the first level, but there's no penalty for leveling up in parallel as each of the starting professions, which also include the monk (a martial artist), the black mage (specializing in offense-oriented magic), the thief, and the red mage (a jack-of-all-trades). So you really don't need more than one character slot to experience most of what the game has to offer--except for the different player races, which include male and female humes (humans), elvaan (like elves, but tougher-looking), tarutaru (munchkins), mithra (cat girls), and galka (hairy ogrelike guys). However, like in most online RPGs, the character races in Final Fantasy XI look much more different than they actually are in gameplay terms. Each merely has a slightly different leaning (tarutaru are inclined toward magic, while the galka have relatively more hit points, for example), but none is restricted from any of the jobs. When creating your character, you also decide which of the three regions of Vana'diel will be your home: Bastok, a mining town in the middle of a desert; San D'Oria, which looks like a medieval fortress; and Windurst, the most hospitable-looking of the three. Each, of course, has similar amenities and is a viable starting location for new players. And, reminiscent of the three analogous, competing realms of the PC online RPG, Dark Age of Camelot, players hailing from each of the three kingdoms of Final Fantasy XI will have a chance to undergo missions in the name of their country. These relatively high-level objectives give you some more incentive beyond just gaining more levels by killing monsters, though they do overlap with that all-important goal. The gameplay is superficially similar to that of other online RPGs, but it has enough unique twists to make it compelling. You can choose your starting kingdom, but, strangely enough, you can't choose the server on which your character will live. This is another one of Final Fantasy XI's slaps in the face to more-casual players: Basically, if you and a friend both wanted to start playing Final Fantasy XI together, the game seems to go out of its way to make it difficult for you to get together. It's possible to keep re-creating a character until the game ~rolls up~ the server that you want; but what you're ~supposed~ to do is purchase an item in the game called a world pass, which allows a number of other players to create characters on (not transfer existing characters to) the purchaser's server. There's probably some way to defend the logic behind this system--maybe it helps ensure that all the servers are equally populated, or something--but it's bizarre, at best, and it's a substantial deterrent for prospective players, at worst. Also, the servers are international and platform-agnostic, so expect to see plenty of high-level Japanese players (who had a significant head start in the world of the game) right off the bat, and don't assume that everyone you see running around is playing the game on a PS2. Depending on whether you land on an ~old~ server or one of the new ones, you'll naturally have a pretty different experience. When you go at it alone, Final Fantasy XI's combat is initially very straightforward and is even boring. Like in other online RPGs, all you do is target an enemy and initiate attack mode, causing your character and his or her new enemy to exchange blows until one of them dies (player characters incur an experience penalty if they're defeated, unless they're resurrected by a white mage). As your character uses his or her weapon of choice (including bare hands, swords, scythes, axes, lances, bows, and more), over time, you'll learn special moves exclusive to that weapon category. These moves can be pulled off only when you've charged up your tactical-point meter past 100 percent, which naturally occurs after a few minutes of fighting. The front end warrants a closer look. Final Fantasy XI is really just one facet--but, certainly, by far the biggest attraction--of Square Enix's proprietary PlayOnline service, which is the gateway to Final Fantasy XI. This self-contained service's offerings include e-mail and a friends list, though if you're reading this, you probably don't need another e-mail address. PlayOnline features another game, TetraMaster, in addition to Final Fantasy XI. Access to it costs another dollar per month on top of the $12 and change it costs per month to remain subscribed to Final Fantasy XI after your first 30 days, which are free. TetraMaster, which originated as a minigame in Final Fantasy IX, is a multiplayer card game reminiscent of Magic: The Gathering, and it can be fairly addictive. However, Final Fantasy XI could easily suck up all your spare time by itself, and it's costly enough as it is. Getting Final Fantasy XI up and running for the first time is a chore, and the controls take a lot of getting used to--but your patience should eventually be rewarded. Want to have more than one character on your Final Fantasy XI account? That will cost you, too: The first one's on the house, and any additional character slots cost $1 apiece on top of the monthly flat fee. Highway robbery, perhaps, but one of Final Fantasy XI's innovations is that it lets you change jobs freely. Sick of your warrior and want to try being a white mage (the Final Fantasy equivalent of a healer)? You can go right ahead. You'll start back at the first level, but there's no penalty for leveling up in parallel as each of the starting professions, which also include the monk (a martial artist), the black mage (specializing in offense-oriented magic), the thief, and the red mage (a jack-of-all-trades). So you really don't need more than one character slot to experience most of what the game has to offer--except for the different player races, which include male and female humes (humans), elvaan (like elves, but tougher-looking), tarutaru (munchkins), mithra (cat girls), and galka (hairy ogrelike guys). However, like in most online RPGs, the character races in Final Fantasy XI look much more different than they actually are in gameplay terms. Each merely has a slightly different leaning (tarutaru are inclined toward magic, while the galka have relatively more hit points, for example), but none is restricted from any of the jobs. When creating your character, you also decide which of the three regions of Vana'diel will be your home: Bastok, a mining town in the middle of a desert; San D'Oria, which looks like a medieval fortress; and Windurst, the most hospitable-looking of the three. Each, of course, has similar amenities and is a viable starting location for new players. And, reminiscent of the three analogous, competing realms of the PC online RPG, Dark Age of Camelot, players hailing from each of the three kingdoms of Final Fantasy XI will have a chance to undergo missions in the name of their country. These relatively high-level objectives give you some more incentive beyond just gaining more levels by killing monsters, though they do overlap with that all-important goal. The gameplay is superficially similar to that of other online RPGs, but it has enough unique twists to make it compelling. You can choose your starting kingdom, but, strangely enough, you can't choose the server on which your character will live. This is another one of Final Fantasy XI's slaps in the face to more-casual players: Basically, if you and a friend both wanted to start playing Final Fantasy XI together, the game seems to go out of its way to make it difficult for you to get together. It's possible to keep re-creating a character until the game ~rolls up~ the server that you want; but what you're ~supposed~ to do is purchase an item in the game called a world pass, which allows a number of other players to create characters on (not transfer existing characters to) the purchaser's server. There's probably some way to defend the logic behind this system--maybe it helps ensure that all the servers are equally populated, or something--but it's bizarre, at best, and it's a substantial deterrent for prospective players, at worst. Also, the servers are international and platform-agnostic, so expect to see plenty of high-level Japanese players (who had a significant head start in the world of the game) right off the bat, and don't assume that everyone you see running around is playing the game on a PS2. Depending on whether you land on an ~old~ server or one of the new ones, you'll naturally have a pretty different experience. When you go at it alone, Final Fantasy XI's combat is initially very straightforward and is even boring. Like in other online RPGs, all you do is target an enemy and initiate attack mode, causing your character and his or her new enemy to exchange blows until one of them dies (player characters incur an experience penalty if they're defeated, unless they're resurrected by a white mage). As your character uses his or her weapon of choice (including bare hands, swords, scythes, axes, lances, bows, and more), over time, you'll learn special moves exclusive to that weapon category. These moves can be pulled off only when you've charged up your tactical-point meter past 100 percent, which naturally occurs after a few minutes of fighting. Weapon skills present you with some interesting tactical decisions. They can be quite powerful, especially if you bide your time and charge up your meter to 200 or 300 percent--and even more so if you chain weapon skills together with allied party members. Skill chains require coordination between players, but they are a fine way of rewarding that kind of coordination, which permits cohesive player groups to tackle enemies much more powerful than any of the individuals in the group could possibly handle. Similar to the skill chains, magic bursts allow mage characters to deliver big damage by combining their spells, and they are even more challenging to pull off. Meanwhile, stronger enemies will use a variety of spells and special moves to keep you guessing. They'll attempt to target the weakest link in the party, forcing you to fight carefully. More than a dozen different jobs are available, and your character may theoretically master them all. Starting out in Final Fantasy XI, it's not difficult to gain experience levels alone. Low-level characters are reasonably strong compared to most low-level monsters and can quickly regenerate their health or magic power. However, like in most any online RPG, as you get deeper and deeper into Final Fantasy XI, you'll realize that you can't get by without the help of other players. The game's dozens of servers seem to be reasonably well populated, so you'll certainly be seeing other players running about. Joining into groups of up to six players can be pretty easy, as the game includes some basic tools for finding player groups or looking up players of similar experience level. In addition to the six starting jobs, higher-level jobs, including the paladin, the ninja, the ranger, the summoner, the dragoon, and the dark knight, become available, once you complete a unique quest to unlock each one. On top of that, Final Fantasy XI features a system similar to 2nd Edition Dungeons & Dragons' dual classing, whereby you may choose a secondary profession for your character. However, you will never grow as powerful in it as you will in your primary job, but if you want a thief who can use some white magic on the side, for example, you can make it happen. The 15 different jobs therefore create a great deal of potential for developing a relatively unique character, and, in turn, there can be a lot of variety from one player group to the next. There's a good amount of other stuff to do in the game. Various trade skills from alchemy to blacksmithing can be learned and developed. There's a functional in-game bazaar, allowing you to auction off your hard-earned loot to other players who might have better use for it. As previously suggested, there are a variety of missions and quests that can be accepted from the game's nonplayer characters. You may travel by ship or airship or on the back of Final Fantasy's quintessential chocobos. You even get your own personal room, from the get-go, which you can decorate to your liking (however, only you yourself are permitted in your room for the time being). The game doesn't break much new ground in terms of content, but it's fully featured. Final Fantasy XI is a cut above most other online RPGs, thanks to a variety of distinctive features and a passionate player community. It also looks quite good. Despite how some of the character races are oddly proportioned--the elvaan and the mithra have unusually long arms--their faces are expressive and detailed, and they're well animated. One particularly notable aspect of the game's visuals is that, unlike in pretty much all other online RPGs, there's a good sense of impact during the battles in this game. Bright, colorful ~hit sparks~ are a telltale indication of when one character hits another, and the occasional critical hit looks even more powerful. The game's environments are also reasonably nice-looking, though not as interesting as the rather original character and enemy designs. The game sounds very good, too, and features a rousing (though, over time, repetitive) musical score that's actually one of the better soundtracks the Final Fantasy series has been graced with in a while--and this is a series well known for its memorable compositions. The music sounds synthesized, but it's upbeat and very fitting. Other sound in the game is minimal but well done, with the highlight being, as mentioned, the various combat effects. You'll have to jump through several proverbial flaming hoops before you start having fun in the world of Vana'diel, but your efforts may well be rewarded. Go into this game with the right expectations--knowing, for instance, that this is a time-consuming game that takes a while to get into and isn't dramatically different, at its core, from other online RPGs--and you'll find in Final Fantasy XI a different-enough take on the online role-playing genre that the experience can end up being both rewarding and refreshing. And since the world of the game is already filled with dedicated players who mostly seem to be enjoying the game rather than complaining about its problems, the tone of the experience of Final Fantasy XI is ultimately more uplifting than that of most other, similar games. As such, if you enjoy online role-playing, then you'd do well to try out Final Fantasy XI, which might just pull you away from your previous time-sink of choice. Alternatively, if you're a Final Fantasy fan who's looking for an excuse to give online role-playing a try with this game, by all means go for it, though proceed with caution. Weapon skills present you with some interesting tactical decisions. They can be quite powerful, especially if you bide your time and charge up your meter to 200 or 300 percent--and even more so if you chain weapon skills together with allied party members. Skill chains require coordination between players, but they are a fine way of rewarding that kind of coordination, which permits cohesive player groups to tackle enemies much more powerful than any of the individuals in the group could possibly handle. Similar to the skill chains, magic bursts allow mage characters to deliver big damage by combining their spells, and they are even more challenging to pull off. Meanwhile, stronger enemies will use a variety of spells and special moves to keep you guessing. They'll attempt to target the weakest link in the party, forcing you to fight carefully. More than a dozen different jobs are available, and your character may theoretically master them all. Starting out in Final Fantasy XI, it's not difficult to gain experience levels alone. Low-level characters are reasonably strong compared to most low-level monsters and can quickly regenerate their health or magic power. However, like in most any online RPG, as you get deeper and deeper into Final Fantasy XI, you'll realize that you can't get by without the help of other players. The game's dozens of servers seem to be reasonably well populated, so you'll certainly be seeing other players running about. Joining into groups of up to six players can be pretty easy, as the game includes some basic tools for finding player groups or looking up players of similar experience level. In addition to the six starting jobs, higher-level jobs, including the paladin, the ninja, the ranger, the summoner, the dragoon, and the dark knight, become available, once you complete a unique quest to unlock each one. On top of that, Final Fantasy XI features a system similar to 2nd Edition Dungeons & Dragons' dual classing, whereby you may choose a secondary profession for your character. However, you will never grow as powerful in it as you will in your primary job, but if you want a thief who can use some white magic on the side, for example, you can make it happen. The 15 different jobs therefore create a great deal of potential for developing a relatively unique character, and, in turn, there can be a lot of variety from one player group to the next. There's a good amount of other stuff to do in the game. Various trade skills from alchemy to blacksmithing can be learned and developed. There's a functional in-game bazaar, allowing you to auction off your hard-earned loot to other players who might have better use for it. As previously suggested, there are a variety of missions and quests that can be accepted from the game's nonplayer characters. You may travel by ship or airship or on the back of Final Fantasy's quintessential chocobos. You even get your own personal room, from the get-go, which you can decorate to your liking (however, only you yourself are permitted in your room for the time being). The game doesn't break much new ground in terms of content, but it's fully featured. Final Fantasy XI is a cut above most other online RPGs, thanks to a variety of distinctive features and a passionate player community. It also looks quite good. Despite how some of the character races are oddly proportioned--the elvaan and the mithra have unusually long arms--their faces are expressive and detailed, and they're well animated. One particularly notable aspect of the game's visuals is that, unlike in pretty much all other online RPGs, there's a good sense of impact during the battles in this game. Bright, colorful ~hit sparks~ are a telltale indication of when one character hits another, and the occasional critical hit looks even more powerful. The game's environments are also reasonably nice-looking, though not as interesting as the rather original character and enemy designs. The game sounds very good, too, and features a rousing (though, over time, repetitive) musical score that's actually one of the better soundtracks the Final Fantasy series has been graced with in a while--and this is a series well known for its memorable compositions. The music sounds synthesized, but it's upbeat and very fitting. Other sound in the game is minimal but well done, with the highlight being, as mentioned, the various combat effects. You'll have to jump through several proverbial flaming hoops before you start having fun in the world of Vana'diel, but your efforts may well be rewarded. Go into this game with the right expectations--knowing, for instance, that this is a time-consuming game that takes a while to get into and isn't dramatically different, at its core, from other online RPGs--and you'll find in Final Fantasy XI a different-enough take on the online role-playing genre that the experience can end up being both rewarding and refreshing. And since the world of the game is already filled with dedicated players who mostly seem to be enjoying the game rather than complaining about its problems, the tone of the experience of Final Fantasy XI is ultimately more uplifting than that of most other, similar games. As such, if you enjoy online role-playing, then you'd do well to try out Final Fantasy XI, which might just pull you away from your previous time-sink of choice. Alternatively, if you're a Final Fantasy fan who's looking for an excuse to give online role-playing a try with this game, by all means go for it, though proceed with caution."}