{"ref": "https://www.gamespot.com/reviews/midnight-nowhere-review/1900-6092743/", "date": "April 5, 2004", "game_name": "Midnight Nowhere", "text": "As the gaming industry becomes more global, we're beginning to see a large number of games coming from Europe and Russia. Midnight Nowhere is one of these games, and it's an attempt to build a spooky horror adventure about serial killers. Unfortunately, it's also a game that you can't help but feel got lost in translation. The maintenance room has a lot of useful tools, if you can find them. The game is set in the near future, in the fictional Russian city of Black Lake. An unstoppable serial killer has murdered hundreds, and the government is powerless to stop him. The game gets off to a great start, with your character, Sergey, waking up in a body bag in an eerie, deserted morgue. But that early promise is wasted in no time by Sergey's outlandish tone. Rather than being creeped out or terrified--or even vaguely disturbed--Sergey cracks jokes and ogles the breasts of a dead woman as if waking up in a body bag surrounded by corpses were old hat for him. Sadly, it's almost all downhill from there. As he encounters more and more bodies, his tone almost becomes even more jovial. Sergey cracks one-liners much like Arnold Schwarzenegger does whenever he dispatches a villain in one of his movies. We get the feeling that the dialogue was a lot more effective in the developer's native Russian. Something, however, was definitely lost in the translation to English. For instance, many of Sergey's one-liners come off as bizarre or weird instead of funny. When he encounters a gigantic ventilation van, he utters, ~The fact that the fan's stubborn, I can see that.~ And when asked to open a cabinet, he says, ~Am I going to have to remember the Pythagorean theorem to open it?~ It's as if the translators were trying to turn a familiar Russian expression into English. There are other moments when the translation clearly stumbles; the cardiology room (complete with a sign that says ~cardiology~) is constantly referred to as the ~reanimation room~ by Sergey, which just adds needless confusion. Midnight Nowhere uses the traditional point-and-click gameplay featured in most adventure games. When Sergey enters a location, you mouse over objects to see if he can interact with them in any way. Done correctly, it's an effortless gameplay mechanic. However, in the case of Midnight Nowhere, it becomes a maddening pixel hunt as you carefully mouse over every square inch of the screen. It's far too easy to miss a critical clue or object, especially in the many dimly lit locales of the game. And even when you do mouse over the correct item, it can be a bit maddening trying to figure out what to do. We checked the pockets of a coat and retrieved an item, but we were still stymied. It turns out we had to check the pocket multiple times in order to get the critical object that we needed. Many of the early puzzles are fairly logical and well thought out. You'll have to retrieve batteries from a flashlight, so you need to figure out what pieces of equipment you can cannibalize. Or a thumb scanner requires a specific thumbprint, so you have to perform impromptu ~surgery~ on a corpse. The later puzzles, on the other hand, cause a fair bit of frustration because they make little sense. At one point, you need to find seven player cards in a jail cell, and most of them are in the most unlikely and illogical of places. And there are moments when you'll retrieve a clue but won't be able to analyze it correctly because the translation is so bizarre. For some reason, we got the key code to an electronic lock just by examining the nude body of a young woman. Midnight Nowhere does try to present an interesting and original story. Just when it appears that the plot is headed down the traditional supernatural path, like something out of Call of Cthulhu, it switches gears and does something unexpected. There's also a definite twisted sense of humor in the game, including wryly written public service announcements and bizarrely fascinating magazines that you can flip through. The game itself uses a combination of 3D-rendered characters and prerendered environments to strong effect, and some of the imagery in the game is creepy and disturbing. But if you're offended by profanity or nudity, you'll probably want to steer clear, because there are plenty of both throughout the game. There are also strong sexual themes that, while not graphic, you'll probably not want kids to see. You can make this corpse dance by using electrical surges. While it ran fairly stable most of the time, the game does suffer from a killer bug that can wipe out all your progress; you'll effectively hit a dead end because the trigger for the next event won't trip. So you need to make sure to use multiple saves to back up your progress. In the end, Midnight Nowhere is a competent adventure game that squanders a lot of potential. The pity is that you get the feeling the game would be a lot more effective if the main character had a drier, more morbid sense of humor. As it is, the attempts to crack weird jokes takes away from the otherwise eerie atmosphere of the game."}