{"ref": "https://www.gamespot.com/reviews/might-and-magic-ix-review/1900-2861194/", "date": "May 17, 2006", "game_name": "Might and Magic IX", "text": "Might and Magic IX is like a bubblegum pop song from a group that's been on the charts too long. It has all of the same ingredients that made the earlier releases so popular, but the excitement is gone, and what once felt new and energetic is now old and tired. Even though New World Computing built this game from the ground up with the use of Monolith's respected LithTech engine, the developer also tried to re-create the past rather than truly revitalize the Might and Magic line. This divided focus between old and new leaves us with a square-peg-in-a-round-hole sort of game that can't please either longtime fans or series newcomers looking to get a role-playing fix. Combine that with shoddy quality in everything from the monster models to the paper doll interface and a dreadfully slow start, and you've got an end product unworthy of its prestigious name. The early stages seem more like a chore than a game, due in part to a stripped-down character-creation process that's simple but too much so. You have only four playable races (human, elf, dwarf, and half-orc) with which to fill the four party slots, along with a handful of face and voice types and a paltry two character class options to choose from. In the beginning, you pick a path of might or magic, becoming either a fighter or an initiate. Other classes are held back until much later, when your characters have progressed high enough in level to accept promotion quests. A fighter can become a crusader and then perhaps a ranger or paladin, while an initiate can advance to the position of scholar and later maybe a mage or lich. There are a total of 12 class options, though choice is restricted based on the path of advancement that you select. Characters can be further customized with skills, though once again, there are few options at the start of the game. Just two skills can be selected from a small pool of options, while two more are predetermined by your choice of class. The same goes for spells. Choice explodes from the virtually nonexistent only long after the beginning of the game. Aside from changing race or class, there is no way to alter the default numbers for the six basic character attributes--might, magic, endurance, accuracy, speed, and luck. Another major contributor to this dull opening is that you begin stranded in the land of Chedian without a clue. There is no back story, no driving force behind the beginning of the game. After an opening cinematic that comes off like Sesame Street doing a ~best of times, worst of times~ shtick and tells you precisely nothing about the game, you are dropped on what's presumably your island home. You speak to an old man whom your entire party calls ~Grandpa~ for no stated reason, read some scrolls about the game interface, hop on a boat for lands unknown, get shipwrecked, and meet up with a troll woman named Yrsa who anoints you the saviors of the world after you kill a few dragonflies. Seriously. Making matters even worse, you don't care about anything that Yrsa tells you because unless you've read the manual, you have no background information about the land and peoples you're about to spend 100 hours of game time saving. The whole introduction is a jumbled mess of names and events and dates that does more to confuse you than provide you with a good reason to continue playing. Expect to feel bewildered for some time after. Aspects of the game design seem to have been put in place for the sole purpose of disorienting the player. Although the main plot soon comes into focus--you have to unite the six warring clans of Chedian so that they may face the threat of Tamur Leng and his feared Beldonian Hordes--everything that surrounds it stays fuzzy. It shouldn't be this way, because the game consists of traveling to the capital cities of each clan and carrying out rudimentary quests that involve little more than killing a lot of monsters and picking up the sacks of gold that they leave behind (and everything leaves behind a sack in this game--even bats). Each town features citizens who require help finding lost objects, obtaining items that they desperately need, and so on, along with chieftains called jarls who assign slightly more interesting objectives, such as clearing out monster infestations, delivering letters to fellow jarls, and slaying particular foes. Role Playing 101, right? Not exactly. While New World never strays from this old-school format, the company has complicated matters by providing little information when quests are assigned. You often spend more time searching for the place you've been asked to visit than actually doing the job. The assignee says what he or she needs, mentions a locale that you've typically never heard of, and then leaves you on your own to explore. It doesn't get any easier after you stumble upon a quest location. Even though the mouse-driven interface (left-click for a melee strike, right-click for a ranged weapon or spell) makes it easy to slash through the hordes of monsters found everywhere, it is often difficult to figure out where you are when the dust settles after combat. Most quest locations have a unique look, but that unique appearance is marred by the designers' usage of the same architecture over and over again within each location. Along with mirror-image corridors that transform many buildings and dungeons into mazes, whole rooms are repeated right down to the furnishings and complement of monsters. You often find yourself wondering if you are going in circles or have activated some kind of teleportation trap.Things are often just as confusing in town. NPCs with the ability to provide skill training and class quests wander the streets aimlessly and don't look any different than the average commoner. So unless you share the curious logic that led New World to make a bartender the only one who can promote you from mercenary to assassin, you need to speak with everyone you meet. And you're never sure when an NPC will be around to talk to. Some pay attention to the virtual clock that tracks the time and then shut down at the end of each day, while others are ready for business all night long. Either way, the people remain present, so you get children playing in the street at three in the morning and shopkeepers offering to take your business and then telling you that they're closed when you take them up on it. Now this is an attack of the clones. There is an automap function, but it does almost nothing to clear these issues up. You can't make notes on it and you can't scroll it, and extra lines make it impossible to determine where walls really are. Plus, many vital features are either missing or so poorly drawn that you can't make them out. Ladders and staircases, for example, are marked with squiggles that could mean anything, if they're marked at all. Some maps show features that aren't actually there. Not surprisingly, problems like these take a toll on the atmosphere. Moving through a succession of chambers that all look the same bolsters your suspension of disbelief as effectively as the painted plywood that community theater groups use for scenery. Poor graphical quality doesn't help much either. Although New World used the LithTech engine to give Might and Magic IX a true 3D world for the first time, the series doesn't look any better than it did three years ago. You might even say that it looks worse. The preceding three Might and Magic games boasted fairly good visuals, and if you forgave them for being a couple of years out of style, the current one is ugly by any standard of measurement. Part of the problem is the default 800x600 resolution (which can be changed by manually editing the autoexec.cfg file, although higher resolutions wreak havoc with text and menu size and location), though much of the blame has to be laid on poor programming and artwork. Textures are dark and blurry, making it hard to locate switches and objects on walls. Rooms are either bare or sparsely furnished. Monster and NPC models seem more like roughed-in placeholders than finished products. Furthering this effect is the use of just three or four NPC face types per sex and race. You'll talk to what seems to be the same person over and over again. There isn't even a thinly veiled illusion of variety here. In one town, the side-by-side armor and weaponry shops are run by what looks to be the same bearded merchant. Move from one directly to the other, and your first thought is ~How'd you get over here so fast?~ This issue hits ludicrous heights in combat with human opponents, as you seem to be mobbed by gangs of clones. There is little more diversity in the monster ranks. Each quest location features just two or three enemy types that you kill again and again from the moment you enter until the moment you leave. One spot might feature dragonflies, another imps, another zombies, and so on. Regardless of the creature type, you're certain to be sick of it by the time you reach the midway point of each quest. The engine also does a poor job of providing feedback while adventuring. Although the first-person perspective should involve you in your surroundings more effectively than the isometric third-person angle used in most role-playing games these days, the effect is actually the reverse. Unless you're firing spells or missiles, attacks are not represented onscreen. Your only indication of making an attack is a swoosh sound and a menu box that opens in the bottom center of the screen to inform you of hits, damage totals, and misses. Blood splatter is an option, but yours is the only blood to actually do any splattering, and it seems to do so only when ranged weapons are employed against your party. Enemies show no sign of injury until they abruptly collapse to the ground. The interface is also light on feedback. The paper doll system for every character has just one picture to represent each class and sex. All male fighters, for example, are portrayed by the same drawing of a bearded dwarf. These images change only when you take up new classes during the course of the game, so you never get to see your characters in new armor or wielding new weapons. Missing automap features will have you reaching for graph paper. Yet despite all these negatives, Might and Magic IX somehow builds momentum as it goes. After you get a good 15 hours into playing, the addictive acts of solving quests and leveling up take on a life of their own apart from the stillborn story and setting. Unlike in the beginning of the game, where you're presented with few options, you can finally start fine-tuning your characters by giving them specific classes and boosting them in certain skills. While the game never evolves into anything more than a straightforward dungeon crawl, it does develop an energy that can carry you along to the conclusion. Quests assume more importance as you work to unite the clans, and monsters get more interesting, as do the magical items and spells you acquire. The dreary sewer of Beet Hoven at the start of the game, for instance, is nothing at all representative of the spooky ruined temples and crypts you'll explore later. Even the musical score progresses from the dreary and repetitive to a number of atmospheric tunes that do a much better job of establishing a mood. Of course, the catch is that you have to dedicate a lot of time to the game before the interesting stuff shows up. Which probably isn't likely, considering the slow start and number of flaws that have to be overlooked for hours in the beginning. And even if you do get caught up in playing, there is little here that's truly memorable. Unlike the way that people still rhapsodize over the likes of old pop songs, it's a safe bet that nobody will ever wax nostalgic about Might and Magic IX.Things are often just as confusing in town. NPCs with the ability to provide skill training and class quests wander the streets aimlessly and don't look any different than the average commoner. So unless you share the curious logic that led New World to make a bartender the only one who can promote you from mercenary to assassin, you need to speak with everyone you meet. And you're never sure when an NPC will be around to talk to. Some pay attention to the virtual clock that tracks the time and then shut down at the end of each day, while others are ready for business all night long. Either way, the people remain present, so you get children playing in the street at three in the morning and shopkeepers offering to take your business and then telling you that they're closed when you take them up on it. There is an automap function, but it does almost nothing to clear these issues up. You can't make notes on it and you can't scroll it, and extra lines make it impossible to determine where walls really are. Plus, many vital features are either missing or so poorly drawn that you can't make them out. Ladders and staircases, for example, are marked with squiggles that could mean anything, if they're marked at all. Some maps show features that aren't actually there. Not surprisingly, problems like these take a toll on the atmosphere. Moving through a succession of chambers that all look the same bolsters your suspension of disbelief as effectively as the painted plywood that community theater groups use for scenery. Poor graphical quality doesn't help much either. Although New World used the LithTech engine to give Might and Magic IX a true 3D world for the first time, the series doesn't look any better than it did three years ago. You might even say that it looks worse. The preceding three Might and Magic games boasted fairly good visuals, and if you forgave them for being a couple of years out of style, the current one is ugly by any standard of measurement. Part of the problem is the default 800x600 resolution (which can be changed by manually editing the autoexec.cfg file, although higher resolutions wreak havoc with text and menu size and location), though much of the blame has to be laid on poor programming and artwork. Textures are dark and blurry, making it hard to locate switches and objects on walls. Rooms are either bare or sparsely furnished. Monster and NPC models seem more like roughed-in placeholders than finished products. Furthering this effect is the use of just three or four NPC face types per sex and race. You'll talk to what seems to be the same person over and over again. There isn't even a thinly veiled illusion of variety here. In one town, the side-by-side armor and weaponry shops are run by what looks to be the same bearded merchant. Move from one directly to the other, and your first thought is ~How'd you get over here so fast?~ This issue hits ludicrous heights in combat with human opponents, as you seem to be mobbed by gangs of clones. There is little more diversity in the monster ranks. Each quest location features just two or three enemy types that you kill again and again from the moment you enter until the moment you leave. One spot might feature dragonflies, another imps, another zombies, and so on. Regardless of the creature type, you're certain to be sick of it by the time you reach the midway point of each quest. The engine also does a poor job of providing feedback while adventuring. Although the first-person perspective should involve you in your surroundings more effectively than the isometric third-person angle used in most role-playing games these days, the effect is actually the reverse. Unless you're firing spells or missiles, attacks are not represented onscreen. Your only indication of making an attack is a swoosh sound and a menu box that opens in the bottom center of the screen to inform you of hits, damage totals, and misses. Blood splatter is an option, but yours is the only blood to actually do any splattering, and it seems to do so only when ranged weapons are employed against your party. Enemies show no sign of injury until they abruptly collapse to the ground. The interface is also light on feedback. The paper doll system for every character has just one picture to represent each class and sex. All male fighters, for example, are portrayed by the same drawing of a bearded dwarf. These images change only when you take up new classes during the course of the game, so you never get to see your characters in new armor or wielding new weapons. Yet despite all these negatives, Might and Magic IX somehow builds momentum as it goes. After you get a good 15 hours into playing, the addictive acts of solving quests and leveling up take on a life of their own apart from the stillborn story and setting. Unlike in the beginning of the game, where you're presented with few options, you can finally start fine-tuning your characters by giving them specific classes and boosting them in certain skills. While the game never evolves into anything more than a straightforward dungeon crawl, it does develop an energy that can carry you along to the conclusion. Quests assume more importance as you work to unite the clans, and monsters get more interesting, as do the magical items and spells you acquire. The dreary sewer of Beet Hoven at the start of the game, for instance, is nothing at all representative of the spooky ruined temples and crypts you'll explore later. Even the musical score progresses from the dreary and repetitive to a number of atmospheric tunes that do a much better job of establishing a mood. Of course, the catch is that you have to dedicate a lot of time to the game before the interesting stuff shows up. Which probably isn't likely, considering the slow start and number of flaws that have to be overlooked for hours in the beginning. And even if you do get caught up in playing, there is little here that's truly memorable. Unlike the way that people still rhapsodize over the likes of old pop songs, it's a safe bet that nobody will ever wax nostalgic about Might and Magic IX."}