{"ref": "https://www.gamespot.com/reviews/mount-and-blade-warband-review/1900-6259262/", "date": "April 21, 2010", "game_name": "Mount & Blade: Warband", "text": "Mount & Blade is starting to deliver on its promise. The open-world role-playing game that was a little rough and ready for a mainstream audience when it arrived in 2008 has taken a leap forward with the stand-alone Warband expansion. New multiplayer modes supporting frenzied mob battles are the big draw here, along with a few refinements to the solo experience that include such goodies as a new faction and overhauled graphics. This still isn't a welcoming game, with the solo campaign so open ended and mostly bereft of the background color typically used to lure you into the medieval realms of RPGs. But the multiplayer is exciting and addictive in its own right, giving you enough happy fuzzies that you can't help but be more patient with the shortcomings of the campaign. Although you can't call it a looker, some parts of Warband are picturesque. Multiplayer is a great direction to take the Mount & Blade franchise in, because it puts the outstanding, naturalistic combat of the game front and center. All eight modes are flat-out frenetic, with up to 64 players in warrior, crossbowman/archer, and mounted knight classes (formal names vary among the six available factions, but this is essentially what you get to play with) hacking and slashing at each other in lag-free battles. Each class can also be custom outfitted with weapons and armor purchased with an opening pool of dinars, and upgraded during matches with extra money earned for kills. Games take place on a limited number of maps depicting typical medieval settings, such as besieged castles, quaint Nordic towns, snowy hamlets, riverside settlements, and the like. Each multiplayer setting has been dressed up with a few attractive scenes that improve greatly on the dull, muddy brown that dominated the original game. The different game modes are standard multiplayer staples, such as are standard multiplayer staples, including Deathmatch, Team Deathmatch, Conquest, and Capture the Flag, among others. As in the original game, battles are mostly melee, consisting of face-to-face skirmishes where you swing swords, axes, pikes, and their many medieval friends by clicking the mouse button while moving the mouse in the direction you want to launch your attack. So to swing overhand and down, you push forward as you click. To swing from the right, you push to the right, and so on. It's an intuitive control scheme that also allows for a great deal of customization and experimentation due to accurate physics and detailed battlefields. No two battles ever play out the same. You can also step out of the trenches to mount a horse for galloping charge attacks or play a crossbowman or archer and sit back sniping enemies from afar (at least until the bad guys notice where the bolts are coming from and charge over your way). Chaos is the big drawing card here. You never really feel totally in charge of what you're doing. But it's not because the controls are awkward or anything. On the contrary, they're so natural and fluid that you simply move and react, and are never able to script out actions or fall into predictable hack-and-slash ruts. This adds a sense of desperation and realism to battles that just isn't often found in games. That said, this style of combat is an acquired taste. If you're used to the simple click attacks found in most other action games, you'll struggle with a learning curve at first. Early matches are frustrating as you deal with getting used to these controls; you might wind up shifting the camera all over the place as you move the mouse back and forth to make attacks. There is no rating system for players or servers, either, so you inevitably get tossed to the wolves and find yourself slaughtered by more skilled opponents in the beginning. Still, basic combat movements in Warband are so natural that you quickly become accustomed to them and soon start running enemies through like a good medieval knight. Battles here are incredibly addictive, even when you're just feeling your way around because the sheer anarchy is crazy fun no matter how skilled you are--no matter how often you get killed. Simply experimenting with the many different weapons is entertaining all on its own, such as seeing how you can best swing a long pike from a distance and deal out death from close range with a sword. Once you develop a knack for melee, you can also turn to playing crossbowmen and mounted knights. They provide very distinct challenges and combat that is more exacting. Crossbowmen, for instance, are tough to manage because you need to time attacks due to lengthy reloads and standard aiming concerns. Just firing away incessantly will only waste a lot of bolts and get you killed. Playing cavalry is even more of a trial due to the speed of horses and the necessity of perfectly timing attacks in order to hit enemies as you gallop past. It's a very enjoyable trial to take on, however, particularly when you start mastering timed attacks and begin to lay the smack down on hapless enemies on foot. Combat is crazy, out of control, and a whole lot of fun. The only lingering problem with Warband is the lack of attention paid to the single-player campaign. It remains very similar to what it was in the original Mount & Blade. The world of Calradia is pretty much just as you left it, with the only obvious addition being some new territory and a new faction called the Sarranid Sultanate that has been modeled on real medieval Arab kingdoms. They come with killer Mamluk-styled cavalry but otherwise fit in perfectly with the existing factions. Nothing here has been seriously fleshed out--at least to a level consistent with more popular epic RPGs along the lines of Oblivion and Dragon Age. You are, however, given a few more career and quest options, such as becoming a king, recruiting vassals, or even getting married. But you still start your life with virtually no direction. Non-player characters are dull repositories of information with little distinctive character. The land is largely barren and boring due to the dated visuals that have been improved only marginally with revamped textures, as well as frills like HDR lighting. Even though you can do just about anything you want in this medieval sandbox, from roaming around as a mercenary commanding an army of troops to carting goods around as a dinar-grubbing merchant, the backdrop is so lightly sketched that it can be tough to stay interested. Anyone looking for the drama or color of the usual medieval RPG will be disappointed by the absence of story and motivation here. Even if you don't bother with the single-player campaign, Warband is worth the buy for the outstanding multiplayer alone. The combat is addictive and exciting, with a good number of people crowding onto the servers. While the core of Mount & Blade is still relatively primitive due to its underdeveloped solo campaign and a few limitations with graphics, there is a lot of charm here. The simple fun of smashing skulls with a pike and charging into a gang of enemies atop a fine Arab charger really makes this game stand out in a world of cookie-cutter RPGs."}