{"ref": "https://www.gamespot.com/reviews/puzzle-quest-2-review/1900-6268040/", "date": "July 2, 2010", "game_name": "Puzzle Quest 2", "text": "Like peanut butter and chocolate or French fries and ice cream, Puzzle Quest: Challenge of the Warlord's seemingly odd mix of genres just worked. It resulted in a surprisingly deep and layered experience from both its role-playing and puzzling parts. The sequel--Puzzle Quest 2--doesn't stray far from the core of the original but introduces several new additions to make it a more accessible experience. The outcome is mixed, with a more fun and varied puzzle side coexisting with a less engaging role-playing half. Improved looks and an interesting new multiplayer mode make the Xbox Live Arcade version of the game the superior one available, and while overall Puzzle Quest 2 is a less engrossing experience than its popular predecessor, it's still an addictive and at times compelling game. The stronger half of this sequel is its puzzle side, which once again sees you having to match jewels and items by sliding them around a rectangular 8-by-8 grid (ditching the hexagonal play field used in Puzzle Quest: Galactrix). When in battle, you need to match three or more skulls to do damage, or match three or more different-colored gems to earn the mana that fuels your various spells and special attacks. Matching four or more of the same type of gem grants you another turn, and this, coupled with the various spells you can launch to assist your efforts or impede your foes, adds a significant strategic layer to the gameplay. You constantly need to think a few moves ahead to ensure that you don't leave your opponent in an advantageous position, and you also have to strategically target which gems to grab to make the best use of your spells and abilities. The matches can be just as exciting and involving as they were in the original; as a plus, this time around your opponents don't have the uncanny ability to earn continuous extra turns and go on damaging runs at will. This makes Puzzle Quest 2 more fair than its predecessor and makes your success more dependent on skill than luck. The puzzles aren't exactly the same as in the original, however, with the biggest addition to battle in Puzzle Quest 2 being the ability to use weapons or shields. While the original let you equip gear that conferred stat bonuses on your character, the sequel goes one step further by letting you use these items during a fight. You can equip up to two items at once, and, like with spells, you need to collect a specific gem on the board before an item can be used (in this case, a gauntlet-shaped action jewel). You'll come across some powerful weapons and shields in Puzzle Quest 2, which are a significant addition to your arsenal and an important part of most battles. The addition of weapons makes matches faster paced thanks to their ability to deal large amounts of damage, but it's not the only way Puzzle Quest 2 improves on its standard puzzle mechanic. You'll come across seven variations to the basic gem-matching game, and they're integrated seamlessly into your overall adventure. A locked door, for example, will trigger a lock-pick puzzle, which requires you to match specific items featured on the bottom of the board. To disarm a trap, you need a set number of matches in each type of gem, while to loot a chest, you have to join up key-shaped gems that appear only after you've matched other gem types. There's even a special boss-type puzzle, which gives you a special one-off weapon or ability that can be used only after meeting a high gem requirement. The basic gem-matching mechanic may be the same, but these variants make Puzzle Quest 2 a much more diverse experience than the original, keeping the game involving for its lengthy single-player campaign long after the story starts to drag. The puzzles are the best part of the game, now that the role-playing elements have been simplified. Because the narrative moves so slowly, you'll probably lose interest in Puzzle Quest 2's story quite early. While the first game's narrative was akin to more traditional role-playing games where the hero has to overcome a blight threatening an entire land, Puzzle Quest 2 story's is more like that of a dungeon crawler, with the vast majority of the action taking place within a towering castle and its tight corridors. You play as a lone adventurer trying to uncover the evil force plaguing the fortress city of Verloren. It's a simple plot that's neither as involving nor as expansive as the first game's (completely unrelated) storyline. Similarly simplified are the game's role-playing elements, which have been significantly ratcheted down from the original. While you can still choose a class for your character (barbarian, assassin, sorcerer, or templar), character attributes that you can upgrade as you move up in levels have been reduced from seven to five. Many of the original game's role-playing elements have also been ditched, such as the ability to catch and train mounts, capture enemies to learn new spells, lay siege to cities, craft new items using found runes, and more. These omissions certainly make the game more accessible for those uninterested in the role-playing side of the Puzzle Quest series, but its depth and credentials as a full-fledged RPG suffer as a result. It's not all omissions on the role-playing side, though. Puzzle Quest 2 does introduce a fairly robust loot system. Enemies drop weapons and armor, as well as materials. These include metals, wood, and more, which are used to upgrade your gear. There are dozens of items to earn, and with several upgrades available for each, there are plenty of customisation options. Another neat addition is a new multiplayer mode called Tournament. While you can still play straight-up ranked or friendly battles online via Xbox Live, Tournament adds a twist to the proceedings by letting you and your opponent choose four monster characters to pit against each other in consecutive battles. As soon as one of your monsters dies, the next will step in to take up the fight. Tournament is a fun mode that provides a lot of tense moments. It's a pity that it's restricted to offline play. Rounding out the changes from the first game is Puzzle Quest 2's visual style, which has been upgraded significantly. The game's world view has now switched to an isometric perspective, following your characters as they move around the town of Verloren and its nearby tower. As you'd expect, the Xbox 360 version of Puzzle Quest 2 is the superior one over its DS counterparts. Non-player characters and monsters are presented in good, colourful detail, and there's also a good smattering of spoken dialogue thrown in as well. But despite the prettier graphics on show, Puzzle Quest 2 is a rather bland game to look at because most of the game takes place indoors in similar-looking rooms and corridors. Faring much better are the puzzle grids, with all of the varieties popping out, thanks to the use of bright colors and uncluttered interfaces. Weapons can be extremely powerful in Puzzle Quest 2. It's appropriate, then, that the best-looking part of Puzzle Quest 2 is also its strongest element--the gem-matching puzzles themselves. Because of the simplified approach to the role-playing half, the puzzles are left to carry the game, and they do so with aplomb. Puzzle Quest 2 is a fun experience that keeps your attention for the 15 or so hours it takes to complete the game (without tackling its many side quests), and despite its RPG-lite approach this time around, it's a game that's easy to recommend."}