{"ref": "https://www.gamespot.com/reviews/cyberball-2072-review/1900-6178335/", "date": "September 6, 2007", "game_name": "Cyberball 2072", "text": "Cyberball 2072 is robotic football, in which giant machines attempt to score touchdowns while hopefully not blowing up. Of course, staying intact is a little harder than it sounds, given that the ball in Cyberball is a bomb. The 1989 release came in an interesting cabinet that actually contained two arcade machines in one case. Two linked monitors let four players play the game at once in two-on-two play. If you were into competitive arcade games back then, it was absolutely awesome. But after playing the butchered version that's been foisted on Xbox Live Arcade for five bucks, you'll probably wonder why anyone ever cared about such a dull game. An absolutely pointless product. Cyberball 2072 isn't crippled by its age. Its joystick-and-one-button gameplay holds up reasonably well. Instead, the problem lies with how the game has been emulated. Rather than find a way to properly emulate the original arcade experience by letting players compete, the developers decided to emulate only one machine. You can play two-player games, but only in a cooperative mode that puts both players on the same team. There's just no way to play this game competitively against another human, not even via Xbox Live. Without the ability to play against another player, this game has a shelf life of almost zero. The computer teams aren't difficult to beat, especially when you're playing with a friend. There's also a ~game breakers~ mode, in which you have to use specific plays in specific situations to move on; three botched attempts end the game. That'll keep you busy for around 30 minutes or so, given that the game lets you continue as many times as you want, just like the arcade version did. To add a little insult to injury, some of the game sounds often get stuck and loop infinitely until you hit the pause button, which kills all of the game's sound when you unpause. This gives you the impression that the audio isn't being emulated at all, but rather triggered by samples. Some of those looped sounds get pretty grating, so you'll find yourself pausing and unpausing four or five times a game, just to correct the audio. It's pretty disgusting that this game was released in such a pointless state. In its intact form, Cyberball 2072 could have been a really awesome download, and the four-player mode could have been outstanding online. Instead it's a missed opportunity and a waste of five dollars. Don't play this game."}