{"ref": "https://www.gamespot.com/reviews/barnyard-review/1900-6163217/", "date": "December 14, 2006", "game_name": "Nickelodeon Barnyard", "text": "Like most of the other GameCube games that have been ported to the Wii, Barnyard takes advantage of the Wii's motion-sensitive controls and has undergone a modest graphical upgrade, but it's otherwise identical to the original GameCube release. However, unlike many of those other games, the waggle controls in Barnyard work great and give the game a more hands-on feel, while the uptick in visual quality makes the farm and the characters on it look that much nicer. Although those improvements don't fully justify the $20 price difference between the two versions, they do at least give Wii owners a reason to choose that version if they or their kids have already decided to add Barnyard to the home game library. Ultimately, what matters most is that the game itself is fun and diverse. Instead of leading you through a series of run-and-jump missions that simply duplicate the film's story, like the majority of movie-inspired games do, Barnyard lets you explore the farm, talk to characters, and tackle dozens of missions, minigames, and collect-a-thon checklists on an open-ended basis. It's that freedom of discovery, combined with the charming anthropomorphism underpinning the characters, that helps set Barnyard apart from all of the other movie-based games out there. In Barnyard, you work to become the number-one party animal by helping other characters, competing in minigames, and buying nightclub goodies for the barn. In the three-dimensional world of Barnyard, the animals on the farm behave like people. Otis, a carefree cow, likes to swim in the pond and play gopher golf. His father, Ben, keeps track of chores on a clipboard and keeps raccoons and coyotes at bay with his milk squirters. There's a chicken named Peck who dreams of flying, so he routinely has the other animals launch him out of a slingshot so that he can sail across the farm, usually to disastrous results. There's a pack of cows that likes to race their bikes and go joyriding in the local farmers' cars. Every day, just for grins, these same cows sneak up behind the mailman and mock him behind his back. You are dropped right into the middle of this menagerie, taking on the role of a teenage cow that has just been delivered to the farm. This cow wants to make a good impression, so he (or she, depending on the choice made in the beginning) decides to join the animals in their activities. There's plenty to see and do. Just by wandering around and talking to the other animals, you can play gopher golf, blast coyotes and raccoons with your squirt-gun-like udders, control Peck's journey as he sails through the air, dance behind the mailman's back, and so on. These minigames aren't all that difficult, but they sure are amusing. Doing the robot behind the mailman or squirting milk at raccoons like Keanu Reeves in The Matrix is hilarious. Some characters have tasks they need help with, which typically involves bringing back a certain item or visiting multiple characters situated at various spots on the farm. Most missions only take a couple of minutes to complete. The reward for completing them is usually a cinematic scene advancing a loose subplot involving the raccoons and coyotes, along with some gopher bucks to spend at the store on gopher hill. The environment itself encompasses two farms and the surrounding areas. You can walk around, climb ladders, pick flowers, and ride a bicycle to get around more quickly. A few daredevil tricks can be performed while riding the bike, for no practical purpose except that it's something else to do. Tree stumps in the environment are actually prize machines run by the gophers that spit out gopher bucks in exchange for prize tokens. At the barn, you can participate in parlor games and use the food items you've collected to make treats and mocktails, which can be given to the other animals or sold to the gophers for a huge profit. Numerous bike upgrades and barn decorations are available for purchase at the gopher shop. Although many of these decorations are purely for aesthetic purposes, some of them unlock additional parlor games, such as pool, darts, and whack-a-rac. This is a lighthearted sandbox-style game where you can watch the hours zip away as you do whatever you want, whenever you want. The open-ended structure gives you the freedom to explore and to accomplish tasks at a leisurely pace. The motion-sensitive controls in the Wii version of the game aren't necessarily more functional than the traditional pad and button setup, but they definitely make the Wii game seem livelier and more hands-on than the other versions. Lifting the Nunchuk to jump and shaking the remote to pick up and throw objects works better to immerse you in the action than simply tapping a button does. Likewise, it just feels right to be able to aim the remote at the screen and then pull the trigger to spray raccoons with milk. Minigames implement control schemes similar to those found in Wii Sports or Excite Truck. In the gopher golf minigame, for example, you point the remote downward and move it sideways to swing at the ball. In the pool minigame, you pull back on the remote to pull back on the cue and jerk the remote forward to take a shot. A few chapters into the game, you'll gain access to one of the farmers' trucks, which you steer by holding the Wii remote horizontally and tilting it to turn left or right. For the most part, the controls are accurate and responsive. Ubisoft tried to implement similar control schemes in Open Season, but aiming was impossible and character response was slow to occur. In Barnyard, you can aim your character's milk udders and squirt off a shot in an instant. Fans of the movie will appreciate that the game's 3D world does a nice job of duplicating the layout and artistic style of key locations from the animated film. You can freely explore the main farm and about a dozen other nearby areas, as well as watch or talk to any animals that happen to be hanging around. The cel-shaded graphics and bright primary colors mimic the movie's art style. At first glance, it doesn't appear that there's much happening in the environment, aside from animals walking around, but closer inspection reveals a wealth of subtle details just waiting to be noticed. The animals smile and blink when spoken to, bushes and flowers shake when characters walk through them, and dirt and leaves are kicked up at every turn. A glimpse of the sky reveals that the clouds are actually passing by up there, and that the sun, moon, and stars are making their appointed treks as the clock ticks. Numerous objects in the environment can be picked up or smashed, including fruit, rocks, boxes, hay bales, and flower pots. Trees can be kicked and ladders can be climbed. The world of Barnyard is quite lively. Throughout it all, the frame rate remains smooth even when a bunch of animals and items are visible, and the draw distance is far enough such that only the occasional distant tree suddenly pops into view. As Wii games go, Barnyard isn't pushing out graphics at the same level of visual intensity as other games developed specifically for the Wii are. Nevertheless, it is easy on the eyes. Compared side by side, the Wii version of the game generally looks identical to the GameCube version, except that everything is cleaner. The Wii version runs at a higher resolution than the GameCube game and benefits from an increased polygon count and sharper textures. It also outputs its visuals at 60 frames per second, whereas the GameCube version is locked in at 30. These enhancements aren't substantial enough to justify buying the game again if you already bought it for the Cube, but they're something to keep in mind if you find yourself holding the game box at the store wondering why the Wii version costs $20 more than the other versions. A number of actions in the Wii version are accomplished by tilting or shaking the controller, which makes the experience that much more engaging. Audio, meanwhile, is best described as atmospheric. Just standing still, you can hear the wind blowing through the trees, the birds chirping, and the faint sound of water coming from the direction of the river. Every action, such as shaking fruit out of a tree or walking across a rickety dock, has the appropriate sound effect. The banjo music that's always playing in the background is rather fitting, too. Unfortunately, despite all of this ambient detail, the audio often feels too subdued. Much of the reason for that is the lack of character speech in the game. Characters don't say much while wandering the farm or during minigames. Even during conversation scenes, animals will only speak their first line of dialogue, leaving you to read the rest. It's rare that a movie tie-in has so little recorded dialogue, as that's usually a major selling point. Overall, Barnyard is a solid sandbox-style game that manages to capture the spirit of the movie it's based on without resorting to the typical one-level-after-another structure. The improvements made to the Wii version of the game don't fully justify the $20 price difference between it and the GameCube version, but if you have to make a choice and cost isn't a factor, the Wii version is the one to get. The cleaner visuals on the Wii make it easier to mentally gel with the game's world, while the motion-sensitive controls make most tasks and minigames seem more engaging."}