{"ref": "https://www.gamespot.com/reviews/gun-review/1900-6139981/", "date": "November 16, 2005", "game_name": "Gun", "text": "Recently released for most other gaming platforms, Gun, a Western-themed action adventure from Tony Hawk series-developer Neversoft, is now available for the Xbox 360, complete with a premium price tag and implicit promises of next-generation gaming quality. But all you get is the same decent game you could be playing on a PlayStation 2 right now, except that if you run it on a high-definition TV, all the flaws in its graphical presentation stick out like a sore thumb. The game itself is somewhat more commendable than the quality of the translation. Featuring an open-ended environment that you can traverse on foot or on horseback, plenty of gory shoot-outs, numerous optional side missions, and an interesting story, Gun initially seems like a 19th-century Grand Theft Auto. Gun's main story missions are pretty exciting, but the main plot is over so quickly that the whole thing just ends up feeling rushed, and the various side missions aren't compelling enough to hold your interest after the end credits roll. So it turns out that a terse, simple title like ~Gun~ is really the perfect fit for what could have been a great game, if only it had more meat on its bones and had been properly tailored to a system with a lot more horsepower. Like a cowboy in New York City, Gun for the Xbox 360 just doesn't look right. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Gun Video Review If you're already familiar with the other versions of Gun, know that the only real differences are that this port runs on the Xbox 360 instead of other platforms, and it also costs more. Control differences compared with other versions are practically negligible, though the layout of the Xbox 360 controller is slightly better suited to this game than most of the other versions. When you play Gun on an HDTV, low-resolution textures and character models shine through, undermining what was a great-looking presentation on other platforms. Seams in textures, some weird shimmering, clipping, and other little graphical flaws just get magnified. On top of that, when running in true HD resolution, for some strange reason the game comes out looking extremely dark compared with other versions of Gun and other Xbox 360 games (we confirmed this using Xbox 360s, component cables, and HDTVs). Or, if you play it on a standard television, Gun barely looks different from what you could be playing on a PS2 or an Xbox, except that it forces you to play in a letterboxed widescreen mode, for whatever reason. It doesn't really suffer from frame rate drops like the other versions do, but the frame rate still isn't fast and smooth, on the whole. So even though the quality of the visuals may be technically better on the 360 than other platforms--some of the textures are definitely sharper, for instance--the game just doesn't look at all flattering compared to other Xbox 360 titles, and it isn't going to live up to your expectations of what a game for a powerful new console ought to look like. Gun is the tale of Colton White, a soft-spoken gunslinger raised by a resourceful old hunter named Ned, made instantly likable thanks to an excellent voice performance by Kris Kristofferson. One day Ned and Colton's hunt lands them on a steamboat carrying some sort of important artifact that Ned seems to know about. However, he's not alone in his knowledge, and as the ship is besieged, Colton barely escapes with his life. He makes his way to Dodge City at Ned's request, and from there embarks on a journey that will put him up against a greedy ex-military railroad mogul and his wicked cohorts. There's a strong cast of characters in Gun, and the 3D cinematic cutscenes are nicely choreographed, making each story mission worth looking forward to if only to see how Colton's misadventures will continue to pan out. Colton will find himself on both sides of the law, allying with a diverse array of different comrades in his efforts to find answers and seek vengeance. Colton White doesn't take long to exact his revenge on the unsavory customers who made his life difficult. Unfortunately, the story hurries along at a breakneck pace. Situations that seem intended to introduce entire chapters of gameplay tend to be resolved almost immediately. For example, at a certain point, Colton is deputized as a peacekeeper in Empire City, the game's largest town. You expect to then undertake a series of sheriff-style missions, but Colton's career path very quickly goes sour as the story jarringly goes in another direction. It blazes on like this until the end credits roll--maybe six hours after you first begin play, depending on how many side missions you opted to take on and depending on how much trouble you had with the final battle, which is one of the only tough fights at the normal difficulty setting. There's just no time to really get to like (or dislike) the main cast. The mechanics of gameplay are good, and even though there are only a few main story missions, they tend to be diverse and packed with action. Gun carefully walks the line between being a run-and-gun shoot-'em-up and more of a realistic tactical shooter. You get to use all kinds of different authentic weapons, including pistols, rifles, shotguns, sharpshooters, bows, and dynamite to take on vastly superior odds, which Colton can overcome because of his excellent marksmanship and his ability to instantly recover all his health by drinking from his flask (what's in that thing?). Controlling Colton primarily from a third-person perspective, you also get to take on ferocious Apache warriors, play with barrels of TNT, fire cannons, and more. Plus, you also get to ride and fight on horseback, making for some high-speed battles. Your horse's hooves are arguably even more dangerous than your firearms, and besides, it can be mightily entertaining to trample your foes, causing their bodies to get flung about like rag dolls. The horse-riding mechanics are fun and well designed, letting you shoot rather effectively while mounted. You also get to execute quick sliding turns (an awful lot like hand-brake turns in a driving game) while balancing your horse's health with your top speed. You can spur your horse to go faster and faster, but this wears the animal down. With the exception of those times when you run up against a barrier of some sort and just keep running, all the animation on horseback looks very convincing. The only problem is that there's no real sense of horse ownership in the game, as horses are completely disposable. Western heroes like Colton White ought to have their very own trusty steeds, but in Gun, you'll just grab whichever animal is closest to you, and you won't grow attached to any of them. There are a lot of dudes that what need buckshot to the face here. If you figured there would be a lot of shooting in a game called Gun, you figured correctly. Colton will typically be up against large numbers of foes, but there's a very wide auto-aim window on his pistols, which lets you easily blast multiple foes even when they're hiding behind cover. Chances are you'll do most of your damage with your rifles, though, since you can aim down the sights of these in a first-person view, which lets you effectively shoot foes from afar. You also have limited access to a quick-draw ability, which slows everything down for a little while and lets you quickly line up a bunch of deadly shots against groups of foes. Magically, you don't even have to reload during a quick-draw attack, though Colton's pistol ammo is unlimited anyway, and his other ammo types may be replenished by conveniently strewn power-ups. Colton can even go to town with melee weapons like knives and hatchets, easily slicing up large numbers of foes. So the action isn't exactly realistic, but it still feels that way to a certain extent, since your foes tend to weave and dodge effectively and will shout to press the attack when you're caught reloading. Most importantly, the weapons feel like they pack a real punch, and enemies are fun to fight, especially ones on horseback. It's hard to decide whether it's more satisfying to shoot a rider from his mount or to take the mount out from under him. The shooting action's not for the faint of heart. The makers of this game must be big fans of HBO's Deadwood or something, because the level of violence and general vulgarity in Gun surpasses what you'd probably expect from a typical Western, even if you've seen some of the gorier ones. Gun pays tribute to the classic films in the genre, from the unbelievable rescue from the gallows in The Good, The Bad, and The Ugly, to the unforgettable last battle (courtesy of a Gatling gun) in The Wild Bunch. However, Gun's more than just bloody, like when you blast a big chunk out of an enemy's head with a clean shot from your rifle. But this stuff isn't nearly as shocking when viewed in high definition, so the impact of the action feels lessened on the Xbox 360. Nevertheless, expect graphic violence, racism, and misogyny in heavy doses during the course of the game. Hey, no one said the Old West was pleasant. But for what it's worth, some of this mature-themed content borders on being gratuitous, since Gun clearly isn't aiming for historical authenticity. You'll realize this from the moment you first catch a glimpse of the main villain's private locomotive, emblazoned with a big fat skull logo. The game is far too over the top to be taken seriously. Fighting on horseback is one of the better aspects of the game. Apart from the brevity of the storyline, other aspects of Gun feel rather half-baked. For instance, you can purchase a scalping knife, which you can use to finish off dying enemies rather gruesomely. Although, other than whatever sadistic thrill you might get from this, there doesn't seem to be any point to it at all, since mortally wounded foes are effectively out of the fight, and all the scalps you're ostensibly collecting aren't even quantified as a line item on the statistics screen (which, for reference, records things like number of headshots you've scored). Furthermore, the free-roaming format of Gun means that you can trot in to town and start trouble if you so choose, such as by wantonly killing random townspeople. This causes a ~town patience~ meter to dwindle, and if you empty it, a ~showdown~ scenario begins as a posse rolls in to get rid of you. Only, this posse tends to be laughably weak, and should you defeat all its members, the town just goes back to normal, as if you never even hurt a fly. Alternatively, if you get killed, you automatically restart without penalty--same difference. The world of the game definitely evokes that Old West charm, and it's nice to see townspeople milling about, as well as the occasional shoot-out between uppity citizens. But Gun really doesn't reward exploration or experimentation as free-roaming action adventure games ought to do. The more you explore, the less you'll find. The game does offer a variety of different side quests, though. Plus, you also get to ride and fight on horseback, making for some high-speed battles. Your horse's hooves are arguably even more dangerous than your firearms, and besides, it can be mightily entertaining to trample your foes, causing their bodies to get flung about like rag dolls. The horse-riding mechanics are fun and well designed, letting you shoot rather effectively while mounted. You also get to execute quick sliding turns (an awful lot like hand-brake turns in a driving game) while balancing your horse's health with your top speed. You can spur your horse to go faster and faster, but this wears the animal down. With the exception of those times when you run up against a barrier of some sort and just keep running, all the animation on horseback looks very convincing. The only problem is that there's no real sense of horse ownership in the game, as horses are completely disposable. Western heroes like Colton White ought to have their very own trusty steeds, but in Gun, you'll just grab whichever animal is closest to you, and you won't grow attached to any of them. There are a lot of dudes that what need buckshot to the face here. If you figured there would be a lot of shooting in a game called Gun, you figured correctly. Colton will typically be up against large numbers of foes, but there's a very wide auto-aim window on his pistols, which lets you easily blast multiple foes even when they're hiding behind cover. Chances are you'll do most of your damage with your rifles, though, since you can aim down the sights of these in a first-person view, which lets you effectively shoot foes from afar. You also have limited access to a quick-draw ability, which slows everything down for a little while and lets you quickly line up a bunch of deadly shots against groups of foes. Magically, you don't even have to reload during a quick-draw attack, though Colton's pistol ammo is unlimited anyway, and his other ammo types may be replenished by conveniently strewn power-ups. Colton can even go to town with melee weapons like knives and hatchets, easily slicing up large numbers of foes. So the action isn't exactly realistic, but it still feels that way to a certain extent, since your foes tend to weave and dodge effectively and will shout to press the attack when you're caught reloading. Most importantly, the weapons feel like they pack a real punch, and enemies are fun to fight, especially ones on horseback. It's hard to decide whether it's more satisfying to shoot a rider from his mount or to take the mount out from under him. The shooting action's not for the faint of heart. The makers of this game must be big fans of HBO's Deadwood or something, because the level of violence and general vulgarity in Gun surpasses what you'd probably expect from a typical Western, even if you've seen some of the gorier ones. Gun pays tribute to the classic films in the genre, from the unbelievable rescue from the gallows in The Good, The Bad, and The Ugly, to the unforgettable last battle (courtesy of a Gatling gun) in The Wild Bunch. However, Gun's more than just bloody, like when you blast a big chunk out of an enemy's head with a clean shot from your rifle. But this stuff isn't nearly as shocking when viewed in high definition, so the impact of the action feels lessened on the Xbox 360. Nevertheless, expect graphic violence, racism, and misogyny in heavy doses during the course of the game. Hey, no one said the Old West was pleasant. But for what it's worth, some of this mature-themed content borders on being gratuitous, since Gun clearly isn't aiming for historical authenticity. You'll realize this from the moment you first catch a glimpse of the main villain's private locomotive, emblazoned with a big fat skull logo. The game is far too over the top to be taken seriously. Fighting on horseback is one of the better aspects of the game. Apart from the brevity of the storyline, other aspects of Gun feel rather half-baked. For instance, you can purchase a scalping knife, which you can use to finish off dying enemies rather gruesomely. Although, other than whatever sadistic thrill you might get from this, there doesn't seem to be any point to it at all, since mortally wounded foes are effectively out of the fight, and all the scalps you're ostensibly collecting aren't even quantified as a line item on the statistics screen (which, for reference, records things like number of headshots you've scored). Furthermore, the free-roaming format of Gun means that you can trot in to town and start trouble if you so choose, such as by wantonly killing random townspeople. This causes a ~town patience~ meter to dwindle, and if you empty it, a ~showdown~ scenario begins as a posse rolls in to get rid of you. Only, this posse tends to be laughably weak, and should you defeat all its members, the town just goes back to normal, as if you never even hurt a fly. Alternatively, if you get killed, you automatically restart without penalty--same difference. The world of the game definitely evokes that Old West charm, and it's nice to see townspeople milling about, as well as the occasional shoot-out between uppity citizens. But Gun really doesn't reward exploration or experimentation as free-roaming action adventure games ought to do. The more you explore, the less you'll find. The game does offer a variety of different side quests, though. Gun's assorted side quests can be fun for a while, and they offer a decent amount of variety, since they range from hunting down wanted felons, to cattle ranching, to competing in poker tournaments. Most every side quest is unique in some way, with its own voice-over narration and basic twist, but these tend to be only a few minutes long, fairly easy, and rather repetitive, in spite of everything. For instance, almost every bounty hunter mission simply tasks you with galloping some brief distance before taking on a hoodlum and his thugs. Often you can earn more money by bringing your victim in alive, but all this comes down to is rushing up close and ~subduing~ your target instead of killing him. The missions end abruptly in this fashion, at which point you can go find another or proceed with the main story missions, if you have any left. An onscreen radar display conveniently points out both enemies and destinations of importance, so for better or worse, it's very simple to figure out where to go next. At any rate, the side quests in Gun certainly are nice to have, but they're not so fleshed out or enjoyable as to make them anywhere near as good as the story missions. The world of Gun initially seems big and expansive, but there's really not a whole lot to it. One of the main reasons you might not be compelled to take on side quests is that the rewards for successfully accomplishing them aren't all that necessary. You'll improve Colton's stats for things like gun handling, melee weapons, and quick draw with each side quest you complete, but the effects of these boosts tend to be so subtle as to be barely noticeable. Besides, you can also purchase weapon and health power-ups, and you can find better weapons at the end of almost every mission. In practice, you'll probably be drawn to some of the side quests and be compelled to earn money with which to buy new items and power-ups. However, the game is easy enough on normal difficulty to where you really don't need to worry much about building up Colton's strength. On hard and ~insane~ difficulty, the challenge is substantially greater, since your foes will deal a lot more damage with every hit. You might want to play on hard mode if normal difficulty seems too easy, but it would have been better if the normal difficulty simply were more challenging overall. The action is that much simpler because story missions tend to have multiple checkpoints. So even if you fail, you'll restart from just a few minutes or seconds before with full health. At least the game isn't frustrating (not for the most part, anyway). On the Xbox 360, Gun looks just OK. Since the character models look blockier and less realistic, the cutscenes in the story aren't as impressive, and the cookie-cutter enemy gunmen found in other versions of Gun stick out even more on the 360. At least Gun features a good use of realistic physics, in addition to plenty of lifelike animations. The sorts of explosions that become more and more prevalent later on in the story are particularly flashy, causing nearby characters (possibly Colton himself) to get flung fast and hard away from the blast, and oftentimes causing them to get flattened against nearby walls. Other than that, the game's rendition of the Old West is decent, and since it's one continuous stretch of land, you really get the feel for the place. Various lighting effects signifying day and night, wild animals, tumbleweeds (of course), and other little visual flourishes help make the world of Gun a little more believable, though the simplistic-looking environments and blurry textures drag things down. It's an unimpressive port of a short, shallow game. On the other hand, the game's audio is quite good, thanks especially to the excellent voice acting heard throughout the story. Thomas Jane (Deep Blue Sea) is great as the quiet, confident Colton White, and the main villains, played by Lance Henriksen (Aliens) and Brad Dourif (Deadwood), sound at least as wicked and nasty as they look. The music shies away from spaghetti Western twanging, instead going for an epic feel that the gameplay doesn't really live up to. Apart from that, effects for gunfire, galloping hooves, and the other sounds of the Wild West are pretty much accurate, though they aren't as noteworthy as the voice work. Gun for the Xbox 360 ultimately offers too little content for it to be a truly satisfying game, and it's got little in the way of visual punch, to boot. The shooting and riding action can make for a good time, to be sure. But the hastily delivered storyline (which, fittingly, concludes with an incredibly abrupt ending) and the lack of any real depth to the gameworld make Gun much better suited for some quick, fleeting thrills instead of for the long haul. So you could give it a rental if you run out of other 360 games to play. Gun's assorted side quests can be fun for a while, and they offer a decent amount of variety, since they range from hunting down wanted felons, to cattle ranching, to competing in poker tournaments. Most every side quest is unique in some way, with its own voice-over narration and basic twist, but these tend to be only a few minutes long, fairly easy, and rather repetitive, in spite of everything. For instance, almost every bounty hunter mission simply tasks you with galloping some brief distance before taking on a hoodlum and his thugs. Often you can earn more money by bringing your victim in alive, but all this comes down to is rushing up close and ~subduing~ your target instead of killing him. The missions end abruptly in this fashion, at which point you can go find another or proceed with the main story missions, if you have any left. An onscreen radar display conveniently points out both enemies and destinations of importance, so for better or worse, it's very simple to figure out where to go next. At any rate, the side quests in Gun certainly are nice to have, but they're not so fleshed out or enjoyable as to make them anywhere near as good as the story missions. The world of Gun initially seems big and expansive, but there's really not a whole lot to it. One of the main reasons you might not be compelled to take on side quests is that the rewards for successfully accomplishing them aren't all that necessary. You'll improve Colton's stats for things like gun handling, melee weapons, and quick draw with each side quest you complete, but the effects of these boosts tend to be so subtle as to be barely noticeable. Besides, you can also purchase weapon and health power-ups, and you can find better weapons at the end of almost every mission. In practice, you'll probably be drawn to some of the side quests and be compelled to earn money with which to buy new items and power-ups. However, the game is easy enough on normal difficulty to where you really don't need to worry much about building up Colton's strength. On hard and ~insane~ difficulty, the challenge is substantially greater, since your foes will deal a lot more damage with every hit. You might want to play on hard mode if normal difficulty seems too easy, but it would have been better if the normal difficulty simply were more challenging overall. The action is that much simpler because story missions tend to have multiple checkpoints. So even if you fail, you'll restart from just a few minutes or seconds before with full health. At least the game isn't frustrating (not for the most part, anyway). On the Xbox 360, Gun looks just OK. Since the character models look blockier and less realistic, the cutscenes in the story aren't as impressive, and the cookie-cutter enemy gunmen found in other versions of Gun stick out even more on the 360. At least Gun features a good use of realistic physics, in addition to plenty of lifelike animations. The sorts of explosions that become more and more prevalent later on in the story are particularly flashy, causing nearby characters (possibly Colton himself) to get flung fast and hard away from the blast, and oftentimes causing them to get flattened against nearby walls. Other than that, the game's rendition of the Old West is decent, and since it's one continuous stretch of land, you really get the feel for the place. Various lighting effects signifying day and night, wild animals, tumbleweeds (of course), and other little visual flourishes help make the world of Gun a little more believable, though the simplistic-looking environments and blurry textures drag things down. It's an unimpressive port of a short, shallow game. On the other hand, the game's audio is quite good, thanks especially to the excellent voice acting heard throughout the story. Thomas Jane (Deep Blue Sea) is great as the quiet, confident Colton White, and the main villains, played by Lance Henriksen (Aliens) and Brad Dourif (Deadwood), sound at least as wicked and nasty as they look. The music shies away from spaghetti Western twanging, instead going for an epic feel that the gameplay doesn't really live up to. Apart from that, effects for gunfire, galloping hooves, and the other sounds of the Wild West are pretty much accurate, though they aren't as noteworthy as the voice work. Gun for the Xbox 360 ultimately offers too little content for it to be a truly satisfying game, and it's got little in the way of visual punch, to boot. The shooting and riding action can make for a good time, to be sure. But the hastily delivered storyline (which, fittingly, concludes with an incredibly abrupt ending) and the lack of any real depth to the gameworld make Gun much better suited for some quick, fleeting thrills instead of for the long haul. So you could give it a rental if you run out of other 360 games to play."}