{"ref": "https://www.gamespot.com/reviews/dead-space-review/1900-6200447/", "date": "October 31, 2008", "game_name": "Dead Space (2008)", "text": "The survival horror genre is rife with games in which you are isolated in a hostile environment full of monsters, and Dead Space is no exception. But from the moment you're thrown into the middle of the fray in the heart-pounding introduction until the bone-chilling conclusion, it's clear that this is something quite unique. With its disturbingly twisted visuals, its deeply engrossing story, and innovative strategic dismemberment combat system, Dead Space is a best-in-its-class game that surpasses other entries in its venerable genre in nearly every way and will be the standard by which they are judged for years to come. When the Concordance Extraction Corporation loses radio contact with its Planet Cracker-class mining ship, the USG Ishimura, engineer Isaac Clarke is dispatched on a routine mission to repair its communications array. However, Clarke is also on a mission of his own, having recently received a cryptic message from Nicole Brennan, a medical officer serving aboard the Ishimura. While on board he intends to reunite with her and learn the meaning behind her strange broadcast. Unfortunately, the moment you set foot on the derelict ship, it's obvious that something terrible has happened. Meet the Necromorph. This is one lady you don't want to dance with. As Isaac, you are separated almost immediately from the rest of your team by the former crew of the Ishimura, which has been transformed into horrifying monsters called Necromorphs. Forced to fight for his survival, Isaac makes do with the tools at hand to defend himself with, which are for the most part repurposed mining instruments like plasma welding guns or buzz saws. These improvised weapons are put to graphic, gruesome work as bodily damage and even severe head trauma isn't enough to kill a Necromorph--only by severing their limbs can you put them down for good. This nuance, referred to as strategic dismemberment, vastly alters the way combat is approached in Dead Space from the typical ~aim for the head~-style gameplay seen in most action games and zombie apocalypse scenarios. Every class of Necromorph requires a different strategy to handle, and knowing how to combat multiple types simultaneously is an essential skill if you want to survive for long. Though dismemberment is ultimately the key to victory, failing to finish off a monster properly will only send it into a berserker rage and force it to adapt to its new, partially appendageless situation so that it can continue trying to eat your face. Even more alarming than their ghastly appearances and uncouth manners is the fact that they are quite intelligent. Necromorphs attack in packs using loose team tactics, and are capable of traversing the ship's extensive ventilation system to sneak around for outflanking or ambushing. They feign death among the corpses of their peers to rise up and attack when you least expect it, and they often come in waves, leaving you wondering if it's truly over or if they're simply toying with you. The most basic Necromorphs are humanoid monsters that attack in a frenzy. Horribly mutated undead babies also make an appearance, and they run along the walls and ceilings sprouting tentacles from their backs capable of throwing organic projectiles. Others still are heavily armored but vulnerable from behind, are bloated with dozens of spiderlike parasites that are released upon their host's death, or shriek madly as they carry explosive pods toward you in a suicidal charge. In one fully interactive gameplay sequence that comprises some of the more amazing moments to be experienced in Dead Space, you're assaulted by the gigantic tentacle of an even larger, unseen beast that drags you to a gruesome and bloody death as you struggle to shoot yourself free. Finally, at several key points in the story, Isaac stumbles upon some of the most incredible and truly terrifying boss monsters to be seen in the survival horror genre. Though revealing the circumstances around which you confront these nightmares would do much to spoil them, it is safe to say that these epic encounters are easily some of the most remarkable seen in years. Having all the traditional HUD elements built into your suit makes grisly scenes like this that much more immersive. One of the first things to notice in Dead Space is that it features a complete lack of a traditional heads-up display; instead, pertinent information is integrated directly into Isaac's RIG uniform. To see his current health you need only glance at the iridescent meter built into the RIG's spine (or pay attention to his physical cues), and to see how much ammo is left in your current weapon, simply check the display readout visible whenever you raise it into the ready position. If you ever find yourself wondering where you need to be next, you need only press a key for Isaac's RIG to temporarily trace a beam of light on the ground toward your next objective. When called up, menus are holographically projected ahead of you in real time, producing a sense of urgency as you remain vulnerable to attack. These simple yet ingenious systems ensure that you remain firmly within the realm of the gameworld at all times, preserving the horror experience. Your ultimate goal aboard the Ishimura is to escape from it, hopefully along with Nicole; but to get to that point you must first accomplish a series of dependent tasks. Guided remotely or in person by the remaining survivors of your doomed repair operation, your missions take you from deck to deck in a logical chain of events. For example, early on you discover that the ship's orbit is decaying because its engines are offline, so you must travel to engineering to refuel and restore them. Once they're back online and the Ishimura begins to correct its course, you realize that you're about to pass through an asteroid belt and that the automated defense systems are down, so it's off to do something about that. Each deck is a self-contained environment in which you run around putting out fires while moving closer to escape, and while your team will remain in frequent contact, you are almost always alone--and most of the few survivors you do encounter have been driven insane by their ordeals. This sense of isolation in such a hostile environment, coupled with bloody visuals and a brilliant sound design, has you constantly questioning your own sanity and wondering when the next attack is coming. Further enhancing this effect are the bone-chilling logs you find left behind by the crew in which their final thoughts and moments are recorded. Though audio logs are nothing new to this type of game and are in fact often used to flesh out the backstory, these are exceptionally well done, and are accompanied by full video logs and text reports, which all together make for a much more compelling narrative. As you explore the many decks of the Ishimura, you will come across two utilities that will prove to be of endless use: stasis and kinesis. Stasis, a finite resource that must be replenished at recharge stations across the ship or with booster packs, allows you to temporarily slow down fast-moving objects, while kinesis gives you the ability to lift, move, and throw objects in the environment at no cost. Each can be used independently or in tandem to solve puzzles or navigate the ship, and each has useful battle applications as well. For instance, stasis can be used to virtually stop incredibly fast-moving Necromorphs and give you the time to tear them limb from limb, and kinesis can be used to throw explosive canisters or even severed extremities to conserve ammunition. Space babies like to hug your face and stab your back. They are not very lovable. During your travels, you will find a number of areas that do not have functional gravity. In these situations, Isaac's magnetic boots will keep him grounded and allow you to perform zero-gravity jumps and attach to nearly any surface. Suddenly having a full 360-degree range of movement is a mind-bending experience, but once you get the hang of it, few experiences are as enjoyable as leaping from the floor to the ceiling to dodge an attack and then finishing off your assailant, sending its body, blood, and limbs floating off in different directions realistically. Many of these zero-g situations are also performed within a vacuum, making oxygen, in addition to your health, a scarce commodity. Between searching for Nicole, trying to escape, and fighting for your survival, you've got your hands pretty full, but this is not to say that there aren't other things for Isaac to do. As the monsters you are killing were once people, they will occasionally drop credits that can be spent in the automated stores you will come across. RIG upgrades, health items, new weapons, and additional ammunition can all be purchased, and if you happen to find a new item schematic and take it to a store, you'll be able to buy that as well. Inventory management is a key element as you can only carry around so many medical kits or plasma cartridges. In the event that you find yourself overburdened, you can sell off your unneeded goods or toss them into the safe for pickup later at any other store location, but you may also find yourself constantly low or out of ammo if you simply go into every enemy encounter guns blazing--sometimes it's better to run and conserve ammo. As an engineer, Isaac can make use of the numerous nanotech workbenches onboard the Ishimura to upgrade his weapons and equipment. Each upgradeable item has a circuit board arranged like a skill tree, and by soldering in power nodes (typically found in fuse boxes or purchased at the store) down a set of branching paths, functionality can be greatly increased. For example, weapons can have their damage and clip size upped, and Isaac can even increase his RIG's maximum health or the duration of his stasis ability. Fuses can also be used to override certain optional door locks, though, so if you want to be ready for potential secret-item caches, make sure you don't use up all of your power nodes. Strategic dismemberment works both ways. Don't let this happen to you. From engineering to hydroponics and beyond, Dead Space never fails to impress with its visuals. Whether you're watching the torrential rainfall of asteroids across the hull of the Ishimura from the bridge atrium or witnessing the way a corpse spins serenely in a zero-g vacuum, the haunting yet beautiful graphics of Dead Space have a way of sticking in your mind long after you've quit playing. Semi-interactive cutscenes such as the one in which your team's rescue ship explodes within the Ishimura docking bay simply must be seen firsthand, and the tremendous lighting and environmental effects lay the groundwork for an intense horror adventure. VSync is enabled by default, which prevents some really nasty visual tearing but adds about a half a second of lag into mouse movements. This can be compensated for by adjusting mouse sensitivity, so make sure you tweak your control settings for an optimal experience. What really rounds out the entire experience, however, is the incredible sound design. Throughout the halls of the Ishimura, you are stalked mercilessly by the Necromorphs, and while you can't always see them, you are constantly surrounded by the menacing noises they produce or the eerie pitter-patter they make as they crawl through the ventilation shafts. You'll occasionally hear the distant screams of Necromorph victims or the creepy singing of a mentally unbalanced survivor, and environmental effects such as those generated by the sudden release of a burst of steam will keep you on the edge of your seat. Perhaps the most impressive use of audio in Dead Space takes place in a vacuum: any sounds that originate outside of Isaac's helmet are muffled and barely audible, while those from the inside, including his breathing and grunts of pain, are amplified. Dead Space is a remarkable game from a well-tread genre that manages to stand out from its competitors in almost every way, from visual presentation to engaging story, innovative combat mechanics to fright factor. Whether you're looking for a terrifying horror experience or a deeply story-driven adventure that will keep you engaged for 15-20 hours, Dead Space is a fantastic game that you should not pass on. Each deck is a self-contained environment in which you run around putting out fires while moving closer to escape, and while your team will remain in frequent contact, you are almost always alone--and most of the few survivors you do encounter have been driven insane by their ordeals. This sense of isolation in such a hostile environment, coupled with bloody visuals and a brilliant sound design, has you constantly questioning your own sanity and wondering when the next attack is coming. Further enhancing this effect are the bone-chilling logs you find left behind by the crew in which their final thoughts and moments are recorded. Though audio logs are nothing new to this type of game and are in fact often used to flesh out the backstory, these are exceptionally well done, and are accompanied by full video logs and text reports, which all together make for a much more compelling narrative. As you explore the many decks of the Ishimura, you will come across two utilities that will prove to be of endless use: stasis and kinesis. Stasis, a finite resource that must be replenished at recharge stations across the ship or with booster packs, allows you to temporarily slow down fast-moving objects, while kinesis gives you the ability to lift, move, and throw objects in the environment at no cost. Each can be used independently or in tandem to solve puzzles or navigate the ship, and each has useful battle applications as well. For instance, stasis can be used to virtually stop incredibly fast-moving Necromorphs and give you the time to tear them limb from limb, and kinesis can be used to throw explosive canisters or even severed extremities to conserve ammunition. Space babies like to hug your face and stab your back. They are not very lovable. During your travels, you will find a number of areas that do not have functional gravity. In these situations, Isaac's magnetic boots will keep him grounded and allow you to perform zero-gravity jumps and attach to nearly any surface. Suddenly having a full 360-degree range of movement is a mind-bending experience, but once you get the hang of it, few experiences are as enjoyable as leaping from the floor to the ceiling to dodge an attack and then finishing off your assailant, sending its body, blood, and limbs floating off in different directions realistically. Many of these zero-g situations are also performed within a vacuum, making oxygen, in addition to your health, a scarce commodity. Between searching for Nicole, trying to escape, and fighting for your survival, you've got your hands pretty full, but this is not to say that there aren't other things for Isaac to do. As the monsters you are killing were once people, they will occasionally drop credits that can be spent in the automated stores you will come across. RIG upgrades, health items, new weapons, and additional ammunition can all be purchased, and if you happen to find a new item schematic and take it to a store, you'll be able to buy that as well. Inventory management is a key element as you can only carry around so many medical kits or plasma cartridges. In the event that you find yourself overburdened, you can sell off your unneeded goods or toss them into the safe for pickup later at any other store location, but you may also find yourself constantly low or out of ammo if you simply go into every enemy encounter guns blazing--sometimes it's better to run and conserve ammo. As an engineer, Isaac can make use of the numerous nanotech workbenches onboard the Ishimura to upgrade his weapons and equipment. Each upgradeable item has a circuit board arranged like a skill tree, and by soldering in power nodes (typically found in fuse boxes or purchased at the store) down a set of branching paths, functionality can be greatly increased. For example, weapons can have their damage and clip size upped, and Isaac can even increase his RIG's maximum health or the duration of his stasis ability. Fuses can also be used to override certain optional door locks, though, so if you want to be ready for potential secret-item caches, make sure you don't use up all of your power nodes. Strategic dismemberment works both ways. Don't let this happen to you. From engineering to hydroponics and beyond, Dead Space never fails to impress with its visuals. Whether you're watching the torrential rainfall of asteroids across the hull of the Ishimura from the bridge atrium or witnessing the way a corpse spins serenely in a zero-g vacuum, the haunting yet beautiful graphics of Dead Space have a way of sticking in your mind long after you've quit playing. Semi-interactive cutscenes such as the one in which your team's rescue ship explodes within the Ishimura docking bay simply must be seen firsthand, and the tremendous lighting and environmental effects lay the groundwork for an intense horror adventure. VSync is enabled by default, which prevents some really nasty visual tearing but adds about a half a second of lag into mouse movements. This can be compensated for by adjusting mouse sensitivity, so make sure you tweak your control settings for an optimal experience. What really rounds out the entire experience, however, is the incredible sound design. Throughout the halls of the Ishimura, you are stalked mercilessly by the Necromorphs, and while you can't always see them, you are constantly surrounded by the menacing noises they produce or the eerie pitter-patter they make as they crawl through the ventilation shafts. You'll occasionally hear the distant screams of Necromorph victims or the creepy singing of a mentally unbalanced survivor, and environmental effects such as those generated by the sudden release of a burst of steam will keep you on the edge of your seat. Perhaps the most impressive use of audio in Dead Space takes place in a vacuum: any sounds that originate outside of Isaac's helmet are muffled and barely audible, while those from the inside, including his breathing and grunts of pain, are amplified. Dead Space is a remarkable game from a well-tread genre that manages to stand out from its competitors in almost every way, from visual presentation to engaging story, innovative combat mechanics to fright factor. Whether you're looking for a terrifying horror experience or a deeply story-driven adventure that will keep you engaged for 15-20 hours, Dead Space is a fantastic game that you should not pass on."}