{"ref": "https://www.gamespot.com/reviews/assassin-s-creed-chronicles-china-review/1900-6416109/", "date": "April 20, 2015", "game_name": "Assassin's Creed Chronicles: China", "text": "Assassin Shao Jun really wants a box. Apparently, the box holds a precious artifact left from the time of the First Civilization, but it is simply the ultimate in MacGuffins; it's the Maltese Falcon, the briefcase from Pulp Fiction, and the Ark of the Covenant. What it does is irrelevant and never elaborated upon, at least not in this story, for its purpose is to kick an adventure into action--in this case, a beautiful and ultimately boring trek that cribs from Mark of the Ninja but can't capture the earlier game's cleverness or excitement. It's tempting to praise Assassin's Creed Chronicles: China for squeezing the series' signature elements into two-and-a-half dimensions, and for making stealth gameplay more vital than it has been in an Assassin's Creed game for years. But Chronicles rests on being pretty, adding new mechanics over time but flattening the pace and allowing exploits and glitches to suck out the rising tension.If a game must rest on being pretty, then at least Chronicles makes the most of it. This side-scrolling stealth game is overflowing with watercolor beauty. In one level, an impossibly large, bright moon rises in the sky, shining through the mist and illuminating willow trees in the foreground, which have the natural smudges and brushstrokes you would expect to see from the Qing masters. Elsewhere, a distant waterfall glows of its own accord, as if pure moonlight had been mixed into the paint that created it. Each scene comes to life with an inviting softness; even simple gray walls depict hushed details, like an underlying paperlike texture, where darker rings reveal where water droplets might have landed on the canvas.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Assassin's Creed Chronicles: China - Video ReviewIt's a gorgeous style, relegated to an atmospheric role; Chronicles' wan storytelling, which mostly occurs in hand-drawn interstitials, doesn't engage in much world- or character-building, leaving the art to provide the game's aesthetic, along with an unobtrusive, string-heavy soundtrack. As Shao Jun, a silent killer trained by none other than Assassin's Creed II hero Ezio Auditore, you move through these spaces, sneaking past patrolling guards and avoiding their vision cones; they cannot see more than 20 feet in front of their own faces, and will not notice you at all when they engage in conversation with each other. Avoidance means slipping behind a pillar with a flick of an analog stick, hanging from a front facing ledge, spidering along a ceiling, or tumbling into a pile of hay. (Of course, in Assassin's Creed fashion, you will occasionally make a leap of faith into one of these bales, an action as satisfying to perform in two dimensions as in three.)You make your way from one array of guards to another, sometimes flinging your rope dart towards an overhang and swinging towards the camera (or away from it) and into a different adventuring layer. Chronicles makes good use of these layers, giving its best levels a sense of depth. You spend more time, however, navigating past the guards that bar your way, either by sneaking around them, stealthily assassinating them, or, rarely, by directly confronting them. My favorite approach was assassination, because it is in silent assassination that Chronicles stays truest to the games that preceded it. When you plunge your hidden dagger into an enemy from behind, you hear an eerie crunch as metal permeates flesh; your target grunts and falls to the ground, and blood seeps across the corpse and dissipates as if soaking into the paper upon which the game is drawn. Performing an assassination while hanging from above is even more enjoyable, thanks to the way Shao Jun points her blade downward as she falls, as if absolving herself by letting gravity perform the cruel deed. Later on, you can sprint forward and slide into unaware guards, which makes for a smooth and rewarding way to combine momentum and quiet butchery.The game awards you the most points for complete avoidance, yet it is when skirting around your enemies that Chronicles' flaws most often surface. In most stealth games, there is intrinsic reward in sticking to the shadows--or in this case, slipping into a dark doorway, or dropping into crevasses that guards ignore unless you've alerted them to your presence. Yet over the games four-hour (or so) running time, the challenge rarely grows. You earn upgrades to your stealth repertoire as you progress, such as a limited ability to flit from one cover position to the next as if you were a ghost on methamphetamines, but there is no sense of rising anxiety. The puzzles don't noticeably increase in complexity, keeping pace with your new moves but not pushing beyond them, and a few ideas--wind chimes that jingle if you don't crouch under them, for instance--appear too rarely to invigorate any given level.In time, you discover ways to exploit the AI's limitations, rushing out of guards view if you alert all of them, and waiting to return until they resume their patrols just a few seconds later. Of course, you could accuse many stealth games of allowing similar exploits, but in Chronicles, each guard is leashed to such a limited area that the ease with which you can simply sprint away and wait it out makes the entire setup feel contrived--quite a feat in a genre that, by nature, can feel particularly game-ish. And occasionally, the game doesn't know how to respond to your reactions and glitches out. At one point, the AI remained on high alert even though I'd escaped the area and was no longer in view; at another, two guards got stuck in place as they searched for me, halting the game and forcing me to leap out of hiding just so I could put the adventure back in motion.This side-scrolling stealth game is overflowing with watercolor beauty.Going toe-to-toe with the enemy is an option, yet an unsatisfying one. Combat has never been Assassin's Creed's strong suit, but swordplay has always featured an understandable rhythm. In Chronicles, you are meant to avoid combat if possible; perhaps battle was made to be purposefully awkward, so that you avoid it when possible. Design choice or not, fending off patrolmen is hardly fun. It's possible to escape with your life if you are incredibly careful and alert, even when flanked on both sides by multiple sword- and gunmen, but the entire affair is clumsy, and death is quick in many of these situations, regardless. There is no cadence to enemy behavior, nor do the fiddly controls invite fluid motion. Direct confrontation is best circumvented, making a boss fight that requires combat all the more mind-boggling.Another boss fight puts to use your throwing knives, one of a few gadgets you have on hand for solving Chronicles' super-easy pseudo-puzzles. You can distract and lure enemies by whistling or throwing a projectile, and momentarily stun them with fireworks, but the predictability of level layouts and ease of AI exploitation means that your strategies can remain the same from start to finish. Ironically, this stealth game's finest moments arrive when it allows you to break free and sprint ahead in order to flee encroaching danger, such as a blazing fire. In no way do these escape sequences match those from the recent Ori and the Blind Forest, but they are the closest Chronicles comes to delivering the series' signature freerunning. You vault over obstacles and slide into shellshocked guards, cutting them down as you rush from danger, watching Templar baddies succumb to flames and crumbling infrastructure. It's a lively diversion in a game that is otherwise mostly devoid of forward momentum. You know the end is about to arrive because the cutscene narration tells you as much, and because the music's tempo has increased, but the gameplay hasn't built to this moment. The credits roll. The game is over. But there was no more excitement in that finale than there was in the opening minutes.Chronicles' passive pacing is a shame, because the pieces, combat notwithstanding, are mostly strong. Furthermore, the exquisite environments craft a setting that makes me eager to see the two upcoming sequels--Chronicles: India, and Chronicles: Russia--in action. If they follow in Chronicles: China's footsteps, they will be beautiful to behold. I hope, however, that unlike the first entry, they take the leap of faith required to make them play as boldly as they look."}