{"ref": "https://www.gamespot.com/reviews/the-king-of-fighters-xiv-review/1900-6416498/", "date": "August 22, 2016", "game_name": "The King of Fighters XIV", "text": "The King of Fighters XIV is yet another satisfying entry in the long-running KOF series. It ditches the intricate sprites found in recent games in the series in favor of 3D characters and backgrounds, though battles still take place on a 2D plane. This change is bound to turn off those who might favor the series' traditional visual style; however, the game's core fighting system lives up to the series legacy, offering new mechanics that expand upon those from its predecessor. KOF 14 is an engrossing fighter that exceeds the initial impressions of its bland presentation, delivering an experience well worth your time, whether you're a dedicated KOF follower or a casual fighting game fan.KOF 14 pits your side against teams of three fighters in a series of one-on-one battles; when one character is defeated, the next one is brought into battle and a new round begins. Returning players will notice the difference in movement speed from past games right away; the game seemingly slows down the energetic action of KOF 13, but this doesn't diminish the exciting nature of fights. Battles remain tense and exhilarating, especially once you get a feel for the pace of combat and combo timing.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: King of Fighters XIV - Video ReviewMany familiar faces from the series 22-year history return, while a host of new characters enter the fray to mix up the series' already diverse set of fighting styles. Its uplifting to see such a robust cast, but its unfortunate that the visuals do little to bring their large personalities to life. The new 3D character models, while serviceable, are stiffly animated and occasionally doll-like in appearance. Theyre a far cry from the dynamic 2D sprites of the past, showcasing only a faint glimmer of what made these characters so memorable and endearing.Despite the less-than-stellar visuals, KOF 14s new fighting system is its most striking quality. It streamlines mechanics weve seen in the past, while introducing expansive techniques and options for combos. The result is a fighting system that's easier to understand and more fulfilling to engage with.The game presents three major mechanics to manage: Max Mode, Super/Advanced/Climax Cancels, and Rush. Max Mode is a cross between KOF 13's EX Specials and Hyperdrive Mode--its a state you trigger that grants you the ability to perform more powerful versions of your characters special moves. These prove useful in turning the tide of battle, since these beefed-up moves can be linked with other moves to create even more powerful combos. Max Mode can be activated whenever you have a super meter to spare.Then theres the multiple ways of canceling moves into supers, which is the games bread and butter for executing destructive combos. Each allows you to cancel a certain move into a type of super special move at the cost of a set amount of super meter. When executed properly, canceling can be an effective means of finishing off opponents when youre in a tight spot. Its also an especially user-friendly mechanic thats far easier to execute than the complicated Drive Cancels from KOF 13. Canceling out of one attack and beginning another more powerful one allows you to turn a single move into a custom combo, and with three ways to cancel moves in KOF 14, this opens up a wealth of opportunities for players of all skill levels to deliver a series of devastating attacks.Lastly, Rush is a unique combo that you can perform by repeatedly pressing light punch. Similar to Persona 4 Arenas auto combo, the attack is suited for beginners looking for a way to strike back at their opponent. This may raise red flags for advanced players; however, the attack is balanced accordingly, requiring you to be right next to an opponent in order to perform it. Rush also does comparatively little damage when you stack it up against the game's powerful combos.These new mechanics help make KOF 14's combo-focused fighting system less convoluted and more straightforward; its the most accessible entry in the series thus far. That isn't to say that it downplays the finesse and strategic planning of the game. Youre still required to understand the fundamentals of execution and positioning if you want to be able to fully take advantage of the offensive and defensive capabilities available.The coalescing of these mechanics makes performing devastating combos easier, which increases the stakes of a fight--one wrong move could result in a punishing reprisal that costs you half your life bar. However, the odds are tipped in your favor the more of your teams roster is eliminated since the game provides additional super meter bars on top of your base ones during consecutive lost rounds. You may end up with five super meter bars during the final round of a match, which can be a lifesaver if you're able to find an opening to initiate a comeback. While this might seem imbalanced at first, it gives the losing player opportunity to even the odds, so that by the time the match reaches its final round, both sides are on equal footing. Still, its unfortunate that a combo-breaker move (in the vein of Guilty Gears Burst mechanic) wasnt implemented to better give newcomers a chance to stave off opponents with higher combo literacy.Thankfully, the path to understanding the intricacies of KOF 14 is a welcoming one, since the game offers a multitude of tutorials to get you up to speed on the series established mechanics, such as rolls, blowbacks, and the all the different types of jumps. Theres also a Trial mode that educates you on the combos you can perform with each character, providing a general idea of which attacks and special moves each character can link together.Once youve outfitted yourself with the basic knowledge to fight, KOF 14 offers plenty of modes in which to test your skills. Like past games, there's a story mode that allows you to fight against 10 stages worth of CPU opponents, but if you're expecting anything similar to the recent story modes from other fighters, like Street Fighter V or Mortal Kombat X, you're going to be disappointed. The narrative is vague and nearly non-existent, setting up--in three brief cutscenes--a much larger conflict that's likely to continue in later installments. Fortunately, the game includes ending cutscenes for each of the canonical teams to help bookend your journey and provide slight context over the events that took place.If you're looking to compete against other players online, the good news is that servers are smooth and stable thus far. It also helps that your online activities are initiated via matchmaking rooms, where up to 12 players can join in and slot into separate rooms within to play exhibition matches of a chosen mode. The format is intuitive and keeps you from having to constantly search for a new room after every match just to find another opponent--though you'll be resorting to this in Ranked mode. It's also a great way to interact with multiple players at once via voice chat or text, testing your skills, asking questions, or discussing strategies.With plenty of opportunities available online or off, KOF 14 is a well-executed addition to the revered fighting series. Those disappointed in its new visuals may be unwilling to give it a chance, but if you remain steadfast in parsing through the multiple layers of its mechanics, you'll be rewarded with one of the most accessible, satisfying entries in the series to date."}