{"ref": "https://www.gamespot.com/reviews/tom-clancys-ghost-recon-advanced-warfighter-2-revi/1900-6175493/", "date": "July 23, 2007", "game_name": "Tom Clancy's Ghost Recon Advanced Warfighter 2", "text": "Ghost Recon is a franchise that was born on the PC, so it was nice last year when Ubisoft commissioned a separate version of Tom Clancy's Ghost Recon Advanced Warfighter that was built directly for the PC instead of merely porting over the Xbox 360 game of the same name. That way, Xbox 360 gamers could get a third-person action game while PC gamers could get a hardcore first-person shooter. That trend continues with Tom Clancy's Ghost Recon Advanced Warfighter 2, which again comes in a separate PC version that's tailored for the platform. Nevertheless, you'll need to be a pretty die-hard fan of extremely unforgiving combat to get through this one. GRAW 2 is sort of like spring break in Mexico. Only, there's no beach, and plenty of assault rifles. GRAW 2 picks up immediately after the events of the first game, though you needn't have played it to understand what's going on. Mexican rebels have some nukes and are setting up shop next to the Texas border, and you, as a member of an elite U.S. Army Special Forces unit, must stop them. While the PC version features entirely new levels and environments, it does lift many of the story elements and voice-overs from the Xbox 360 version. In essence, this is basically a retelling of the Xbox 360 game. The major difference between the two versions is that the Xbox 360 is much more action focused, while the PC is a lot more simulation heavy. It's a huge difference. You can sprint your way through the Xbox 360 game, knowing that you can heal up easily whenever you hit a resupply point. In the PC version, the pace is a lot slower and more methodical. If you try to run-and-gun through you'll get cut down within seconds. It's all about moving slowly, using cover, and suppressing the enemy with cover fire. You have a fairly small health bar, and it can be drained relatively quickly. Even worse, a hit in the wrong place will kill you no matter what, so the PC version is very much one shot, one kill. And if you do manage to find a place to resupply, you do not heal. While this kind of realistic authenticity is the hallmark of Ghost Recon games on the PC, GRAW 2 is a lot tougher than its predecessors. Part of that is the nature of the gameplay, which is very unforgiving, but it's also due to the huge size of the levels. You have to carefully ration your health bar or else you'll find yourself in a bad spot. For instance, if you take a couple of hits early on, it's usually best to just start the mission over because odds are you'll never survive the middle and later parts of the level, especially since you can't heal. There is a quick save and a quick load that you'll need to use early and often, as you'll get cut down without warning a lot. And this was on the easiest difficulty setting. Trying to play at the default difficulty is murder. Your squad can provide cover fire and support, but they also die easily. If that weren't bad enough, GRAW 2 also likes to put you in a lot of really difficult--dare we say unfair--tactical situations. The end level has a helicopter drop you off in the middle of a bridge, with one end garrisoned by Mexican rebels armed with rocket launchers and heavy machine guns. If you manage to survive that, you'll next face an attack by troops and vehicles, and then have to take down a helicopter, and then attack the other end of a bridge defended by snipers and machine gunners, and so on. It's a lot to tackle in a single mission, and it will undoubtedly require a lot of trial and error. You do have up to three other soldiers at your command, as well as various support elements such as aerial recon drones and the ability to call in air strikes or artillery. The squad controls are fairly simple because they're context sensitive. Simply move the cursor onscreen and you'll tell the squad to move to that spot or attack it. Unfortunately, the artificial intelligence, while sharp, isn't sharp enough. It's pretty good about using cover, but nowhere near as good as a human mind. It's not hard for your guys to get cut down behind you, which at times makes them more of a hindrance. The better missions in the game are the ones that have you going almost lone wolf. It's during these levels that the PC version shines, as you don't need to worry about micromanaging the squad and can go around stalking the enemy. The PC version does allow a bit more freedom in mission setup: you can select the troopers that go with you, as well as custom-outfit their gear, choosing from different weapons and accessories, like grenade launchers, scopes, and silencers. (If a trooper is cut down, he's unavailable for later missions.) The only thing that this mode needs is a way to save a loadout so you can easily outfit your team with the same gear. Instead, you have to load out each trooper separately, a somewhat annoying process. Aside from the sheer difficulty of the game, the other hit against the PC version is its drabness. The game recycles much of the textures and buildings from its predecessor, so the slums of Juarez look almost identical to the industrial areas of Mexico City. The game is dominated by its brown-and-yellow palette, and the color scheme is so bland and lifeless that it sucks a lot of life out of the otherwise solid graphic engine. You'd be hard-pressed to find something in the game that's a bright red or green or blue. Even the skies feel oppressive. The Xbox 360 did a much better job of actually creating environments that felt like they had some color and culture to them. The PC version feels like it's set in what appears to be the dullest and driest place on Earth. If you can get through the single-player campaign you'll be an army of one. The multiplayer options are nicely fleshed out. There are some cooperative gameplay levels, though the single-player campaign itself isn't playable in co-op. Then there's deathmatch and team modes, such as hamburger hill (one team holds a hill as long as possible against the other) as well as recon-versus-assault, which is an objective-based mode that tasks one team on defense and the other on offense. There's enough here to keep you busy for a good, long while, which is sort of the point. And multiplayer has always been one of Ghost Recon's strengths. While the difficulty will undoubtedly be one of the things that the dedicated fans of the series will look forward to, GRAW 2 raises the challenge bar to a new level. That said, if you're looking for a relatively quick and painless shooting experience, look elsewhere. If you want to experience a brutal battlefield where death can happen suddenly, then check out GRAW 2."}