{"ref": "https://www.gamespot.com/reviews/nba-shootout-2004-review/1900-6077961/", "date": "November 2, 2003", "game_name": "NBA ShootOut 2004", "text": "Tracy McGrady, shooting guard for the Orlando Magic, was last year's NBA scoring champion and is widely considered to be one of the top five basketball players in the world. Clearly, an athlete of McGrady's caliber deserves better than to be relegated to coverboy for a poor product like 989 Sports' NBA ShootOut 2004. A host of problems can be found in almost all facets of the game, so there simply aren't any good reasons to buy it, especially with better alternatives already available. The problems begin with the game's graphics. Poor frame rate is the first thing you'll notice when you start a game of ShootOut. Instead of capturing the fluid grace and beauty of professional basketball, the game stutters constantly, especially when the camera shifts viewpoint after a change in possession. The problem is so bad, you'll frequently wonder exactly how a turnover occurred, with your only clue being that the camera has swapped sides. The animations look stilted, and your players often appear to skate and slide over the ground rather than run. There isn't much detail put into any of the arenas, and the crowds are completely flat and unconvincing. This doesn't look much like T-Mac to us. Most disturbingly, players tend to have their heads tilted upward at an unnatural, almost macabre angle. Heads swivel from side to side as players play defense, and, more often than not, the faces on these heads bear little resemblance to the players they're supposed to represent. Even McGrady's face isn't done very well, and he's the cover athlete for ShootOut 2004. You can extrapolate from there how poorly the faces of less marquee players were done. The overall player models aren't much better. Many appear disproportional, and some tattoos on players are included while some are mysteriously omitted. ShootOut 2004 doesn't do so well in the sound department either. The crowd noise is dull and indistinct, and you hear no chatter at all between players or coaches. The announcing is done by Ian Eagle and the incomparable (some might say ~infamous~) Bill Walton. Unfortunately, it gets repetitive and annoying in a hurry. The duo seems to have very few lines, with Eagle getting overly excited at the most mundane of plays. Walton is his usual self, full of ridiculous comments and metaphors. After about the 100th time you hear him talk about the defense ~parting like the Red Sea,~ you'll wish Walton had never read the story of Moses and the Israelites. Unfortunately, you won't find any salvation in ShootOut 2004's gameplay. The post game is almost nonexistent. Even if you control a potent post player, like Shaq or Yao Ming, and back your man down to within five or ten feet from the basket, you'll find it almost impossible to hit a jump-hook or fadeaway. In fact, the game makes it difficult to hit any kind of shot, aside from a layup or a dunk. Even if the defender isn't jumping at you or otherwise challenging your jumper, they'll seldom fall unless you are wide open. Good luck getting those open looks, as the computer appears to cheat on its rotations out of the double team. Throw a pass to the open man and you'll see defenders racing to cover the pass recipient, seemingly before the ball leaves the passer's hands. This isn't to say that it's difficult to score in ShootOut 2004. As a matter of fact, it's embarrassingly easy to get a dunk or layup almost every time down the court. Take control of almost any player, jam on the turbo, and start running back and forth across the lane until you can get your defender caught up on another player. That gives you the opportunity to drive straight to the hole so you can dunk or lay the ball in. If it doesn't work, you can usually go baseline and get to the basket that way, as the computer doesn't seem to understand the importance of sealing that driving lane. Master this method, and your shooting percentage will skyrocket. ShootOut 2004 does include some juke moves mapped to the right analog stick, but the implementation and variety pales in comparison to NBA Live's freestyle or ESPN NBA's isomotion. Besides, who needs to use juke moves when you can get cheesy dunks by just running back and forth across the lane until your defender gets lost? Ratcheting up the difficulty level doesn't help matters much either. At Hall of Fame difficulty the computer simply sends a constant double or triple team at the ballhandler and cranks up the shot blocking to the point where any and every contested shot of yours gets swatted. You can still score using the cheese-method, but it's just a little more difficult to shake two or three defenders instead of just one. Dunks are easy to come by. Defense isn't much more rewarding than playing offense. It's very easy to rack up a ton of steals in the game simply by running up to the ballhandler and pounding on the steal button. You won't get whistled for fouls very often, and you'll frequently knock the ball away for an easy turnover. For the times you do give up a shot, you'll find that it's also rather easy to block them. Rebounding is hit or miss. Sometimes it seems as though you have good control over the players in the low block, while jumping for the boards, but at other times it seems like the ball will simply clip through your players and find its way into the hands of the computer. Strange bugs plague the gameplay as well. Play long enough and you'll see the computer exhibit some bizarre behavior, like throwing the ball out of bounds off of an inbound pass play or passing to a teammate behind the half-court line for an over-and-back turnover. Sometimes you'll hear the announcer say the wrong name on a play. You'll also see the slow-motion highlight camera engage even though your player was actually stripped of the ball as he went up for a dunk. Perhaps most frustrating is that the camera will often focus for a couple of seconds on the computer players running back to play defense after they've made a basket. You can't skip that bit of animation, making it impossible to try to fast-break after a made basket. You, too, can be a summer league scrub in ShootOut 2004. While you can play single exhibition games or one full season, unlike other basketball games on the market, ShootOut 2004 doesn't include a traditional franchise mode where you take the role of a general manager of a team. Instead, the game's career mode focuses on your created character as he tries to make his way up from the ranks of the summer leagues and the NBDL to ~the big show~ in the NBA. Every game you play while in the summer league or NBDL includes a list of goals, such as scoring a certain number of points, getting a steal or a block, and/or holding one of the opposing players under a certain number of points. If you consistently achieve most of your goals, an NBA team will offer you a contract, and you can attempt to prove yourself at that level. If you are good enough to stick around the NBA and win a few championships, scoring titles, and other accolades, you can eventually earn enough points to be inducted into the Hall of Fame. While ShootOut 2004's career mode is an interesting idea, its implementation leaves a lot to be desired. First of all, the game doesn't give a clear enough idea of how to improve your attributes like speed, ballhandling, shooting ability, etc. This seems like a strange omission, given that the whole idea of career mode is to improve your character enough to get a spot in the NBA. Also, the computer seems to have no regard at all for the existing players in the NBA when you're given your chance. To exemplify this point, one of our created characters, a shooting guard who tried out for the Lakers, immediately replaced Kobe Bryant in the starting lineup after being offered a contract! Needless to say, this idea is preposterous. Finally, it's a little odd that the game includes all the real NBDL teams, but it doesn't include any real-life players who actually do play in the ~D-League.~ The NBDL rosters in ShootOut 2004 are, interestingly, comprised of fictional players. The game does include a couple of other features, like the inclusion of the NBA's 50 Greatest Players and voice activated commands. Each of the 50 greatest players are unlocked by accomplishing certain challenges in the exhibition games, like scoring a certain number of points and assists using the point guard of a certain team or racking up the most points and rebounds in a game with the center of another team. The voice commands are another feature that allows players with USB headsets to issue specific plays on offense or defense. While the feature seems to work reasonably well, ShootOut 2004's core gameplay mechanics aren't solid enough to necessitate or benefit much from such a gimmick. You'll find yourself falling back on the cheesy game exploits more often than not. The online aspect of ShootOut 2004 is surprisingly feature-rich, with working leaderboards, message boards, polls, news, and tournaments. The gameplay is also pretty smooth, in general, with few latency or lag issues. It's just too bad such a nice network infrastructure is wasted on a game that plays as poorly as ShootOut. Player models can sometimes have rather odd-looking proportions in ShootOut 2004. At one point in time, 989 Sports was a leading contender among sports game developers, but in recent years they've clearly been overtaken. With a myriad of problems across the board, NBA ShootOut 2004 brings 989 Sports no closer to its competitors. Unless you're a basketball nut who must own a copy of every single basketball game on the market, or you're one of the world's few NBDL fans, there are much better alternatives than NBA ShootOut 2004. Strange bugs plague the gameplay as well. Play long enough and you'll see the computer exhibit some bizarre behavior, like throwing the ball out of bounds off of an inbound pass play or passing to a teammate behind the half-court line for an over-and-back turnover. Sometimes you'll hear the announcer say the wrong name on a play. You'll also see the slow-motion highlight camera engage even though your player was actually stripped of the ball as he went up for a dunk. Perhaps most frustrating is that the camera will often focus for a couple of seconds on the computer players running back to play defense after they've made a basket. You can't skip that bit of animation, making it impossible to try to fast-break after a made basket. You, too, can be a summer league scrub in ShootOut 2004. While you can play single exhibition games or one full season, unlike other basketball games on the market, ShootOut 2004 doesn't include a traditional franchise mode where you take the role of a general manager of a team. Instead, the game's career mode focuses on your created character as he tries to make his way up from the ranks of the summer leagues and the NBDL to ~the big show~ in the NBA. Every game you play while in the summer league or NBDL includes a list of goals, such as scoring a certain number of points, getting a steal or a block, and/or holding one of the opposing players under a certain number of points. If you consistently achieve most of your goals, an NBA team will offer you a contract, and you can attempt to prove yourself at that level. If you are good enough to stick around the NBA and win a few championships, scoring titles, and other accolades, you can eventually earn enough points to be inducted into the Hall of Fame. While ShootOut 2004's career mode is an interesting idea, its implementation leaves a lot to be desired. First of all, the game doesn't give a clear enough idea of how to improve your attributes like speed, ballhandling, shooting ability, etc. This seems like a strange omission, given that the whole idea of career mode is to improve your character enough to get a spot in the NBA. Also, the computer seems to have no regard at all for the existing players in the NBA when you're given your chance. To exemplify this point, one of our created characters, a shooting guard who tried out for the Lakers, immediately replaced Kobe Bryant in the starting lineup after being offered a contract! Needless to say, this idea is preposterous. Finally, it's a little odd that the game includes all the real NBDL teams, but it doesn't include any real-life players who actually do play in the ~D-League.~ The NBDL rosters in ShootOut 2004 are, interestingly, comprised of fictional players. The game does include a couple of other features, like the inclusion of the NBA's 50 Greatest Players and voice activated commands. Each of the 50 greatest players are unlocked by accomplishing certain challenges in the exhibition games, like scoring a certain number of points and assists using the point guard of a certain team or racking up the most points and rebounds in a game with the center of another team. The voice commands are another feature that allows players with USB headsets to issue specific plays on offense or defense. While the feature seems to work reasonably well, ShootOut 2004's core gameplay mechanics aren't solid enough to necessitate or benefit much from such a gimmick. You'll find yourself falling back on the cheesy game exploits more often than not. The online aspect of ShootOut 2004 is surprisingly feature-rich, with working leaderboards, message boards, polls, news, and tournaments. The gameplay is also pretty smooth, in general, with few latency or lag issues. It's just too bad such a nice network infrastructure is wasted on a game that plays as poorly as ShootOut. Player models can sometimes have rather odd-looking proportions in ShootOut 2004. At one point in time, 989 Sports was a leading contender among sports game developers, but in recent years they've clearly been overtaken. With a myriad of problems across the board, NBA ShootOut 2004 brings 989 Sports no closer to its competitors. Unless you're a basketball nut who must own a copy of every single basketball game on the market, or you're one of the world's few NBDL fans, there are much better alternatives than NBA ShootOut 2004."}