{"ref": "https://www.gamespot.com/reviews/classic-nes-series-xevious-review/1900-6100045/", "date": "June 7, 2004", "game_name": "Xevious", "text": "Xevious was first released as an arcade game back in 1982. The scrolling shooter was, at the time, very unique. Not only could you shoot directly ahead of you but also you could drop bombs to take out ground-based targets. The game was a success, and Namco eventually ported it over to the Famicom in 1984, releasing it on the NES some time later. Now, that NES version has been ported over to the Game Boy Advance. While players will find that this game--part of the Classic NES Series--is a pretty faithful duplication of the NES game, it isn't exactly the most exciting concept. Xevious is certainly a classic game, but it's a classic arcade game, not a classic NES game. The music in Xevious is totally classic, but it might just drive you crazy. The original arcade game was played on a vertical monitor. To fit on a TV, the game was stretched out for the NES, so it took up the entire width of a TV screen--and now it takes up an entire Game Boy Advance screen. The gameplay, though, has remained largely unchanged. You still fly your ship around while blasting anything that attacks from the air, and you still use your onscreen crosshairs to deliver bombs to ground-bound enemies. There are no power-ups or anything of that nature, so the game simply trucks along indefinitely, pausing from time to time to serve up a boss-style encounter against a large, dangerous mothership. The mechanics are sound, but since the game doesn't really change very much as you play, it can get tiresome pretty quickly. Graphically, the NES version of the game lacked the sharpness of the arcade original, and that trait has carried over to the GBA. The sound also isn't quite as crisp as that found in the arcade game. The repetitive, high-pitched music sounds roughly the same, but the aural effects used for hitting targets and shooting at the game's flying, spinning monoliths don't sound quite right. Like other games in the Classic NES Series, Xevious has save support for storing your high score. It also has link cable support to allow two players to play the game with just one cartridge. But since Xevious' two-player mode is alternating, you can get by just fine passing the GBA back and forth as necessary. Xevious originated in arcades. Then it was ported to the NES. Now the NES version has been ported to the GBA. All in all, this Classic NES Series game does a great job of playing the NES version of Xevious. Unfortunately, the NES version of Xevious was never really all that great of a game, and its ~classic~ status on the NES is questionable, at best. Charging $20 for one 20-year-old game of middling quality certainly doesn't help matters either. Fans of Xevious would be better served by finding a copy of Namco Museum Volume 2 for the PlayStation, which contains the arcade version of Xevious and can probably be bought for less money than this cart."}