{"ref": "https://www.gamespot.com/reviews/arkanoid-ds-review/1900-6192676/", "date": "June 17, 2008", "game_name": "Arkanoid DS", "text": "In the beginning there was Pong. Then there was Breakout, and 10 years later there was Arkanoid. Taito's bat-and-ball block breaker first appeared in arcades more than 20 years ago, and in the years since it has graced numerous home computers and consoles. Arkanoid DS, which comes to North America and Europe minus the paddle controller that it was bundled with in Japan last year, introduces a handful of new features to the Arkanoid mix but thankfully doesn't do anything that's detrimental to the classic gameplay. Multiplayer options, new power-ups, unlockable audio and visual options, and the objective-based Quest mode make Arkanoid DS easy to recommend. The lack of a paddle (you can import one) is disappointing and the D-pad option is best avoided, but the stylus works just fine. Arkanoid's traditional Clear mode should be the first one you check out, given that visiting levels there unlocks them for use in the new Quest mode. Taking the controls of the Vaus (that's the name of your bat at the bottom of the screen--it's actually a spaceship), Clear mode tasks you with destroying every block in a level using a ball (some kind of sci-fi energy projectile, no doubt) that rebounds off of everything it touches without ever losing momentum. You keep the ball alive by using your bat to prevent it from falling into the bottom of the screen, and the longer it takes you to hit all of the blocks, the faster the ball gets. Previous incarnations of Arkanoid worked like pinball in that losing a ball was the same as losing a life, and anytime that happened you just launched the next one until you ran out. Arkanoid DS does things a little differently: You get only one ball, ever, and if you lose it then it's game over. A number of energy barriers that span the bottom of the screen make it impossible for your ball to drop early on, but if you use one you lose one, so starting every level with three barriers means that you get three lives. You might think that having that many lives for every level makes Arkanoid DS too easy, but considering that the game doesn't stop or slow down when you hit a barrier, the real difference between this and previous games is just that this one keeps you playing at a more brisk pace. Thirty years later, at least one of the Space Invaders still poses a threat. Clear mode consists of 28 worlds arranged in an inverted pyramid shape. Each world is made up of five levels, and your goal is to get from the bottom of the pyramid to the top by taking any route you please. Every world that you beat along the way unlocks two new worlds, and by the time you get to the last row, you can end the game with any of seven different worlds. Given that they consist entirely of square bricks, level designs in Arkanoid DS are rarely much to look at, but occasionally the bricks are arranged to create pictures of everyday objects or recognizable characters from classic Taito games. Additional variety and challenge come in the form of blocks that take two hits to destroy, blocks that move, and blocks that simply get in the way because they can't be destroyed at all. Some of the level designs are truly fiendish toward the end of Clear mode, and many are designed in such a way that even power-ups don't help much. For example, equipping your Vaus with lasers is no help at all if the blocks that you need to shoot are hiding behind an indestructible wall. Other power-ups in Arkanoid DS include a longer Vaus, multiball, additional barriers, a powerball that can plow through multiple blocks, and more. The same 140 levels from Clear mode appear in Quest mode, but there's no map to navigate, and you can attempt to complete them in any order you like. Rather than tasking you with clearing every block in a level, Quest mode hits you with level-specific objectives that must be completed either within a time limit or without hitting the ball more than a specific number of times. For example, you might have to clear all yellow blocks from a level within 45 seconds, or destroy 10 blocks while only hitting the ball three times. Objectives like these force you to play quite differently, and they're a great way to hone your skills before you check out the multiplayer options. Unlockable visual options can enhance or detract from your experience, according to taste. Arkanoid DS supports both local wireless and online play for up to four people (using friend codes or random matchmaking) in two different modes, and one copy of the game is all that you need to play with up to three friends locally. Bust All mode is a race to see who can clear a level first, whereas Bust Color mode is a race to see who can destroy all of the blocks of a specified color. The levels that you play on are randomly selected from all that the game has to offer, and you can keep an eye on your opponents while playing via small thumbnail images that appear alongside your own play area. Multiplayer games play out in the same way that single-player games do, except that any negative power-ups (power-downs, if you prefer) that you collect are passed on to your opponents. Shrinking other players' bats and slowing their balls are perhaps the most obvious ways to upset them, but multiplayer-specific pickups, such as one that randomly drops a handful of additional blocks on opponents' screens, are also worth pursuing. Regardless of whether you're playing solo or multiplayer, you're rewarded for almost everything that you do in Arkanoid DS with points that serve as currency in the game's shop. Items for sale include new background music, new sound effects, new block and Vaus graphics, and new artwork for the backdrop. None of the unlockables impact the gameplay, and the additional audio options aren't nearly as agreeable as the default setting, which combines electro music with sound effects straight out of the '80s. But, if you've always dreamed of playing Arkanoid on a leopard-skin backdrop, with a Vaus made of wood along with blocks that look like Space Invaders, now you can. There's more than enough fun to be had with Arkanoid DS to justify its budget price tag, and the multiplayer content and online leaderboards that compare your performances in the single-player Clear mode ensure that there's no shortage of replay value if you're the competitive type. Arkanoid was a great game in 1986 and it's still a great game in 2008. Arkanoid DS is even better. If you have any interest whatsoever in destroying blocks with a bat and ball, you won't be disappointed."}