{"ref": "https://www.gamespot.com/reviews/chrono-cross-review/1900-2545933/", "date": "January 6, 2000", "game_name": "Chrono Cross", "text": "Square's Chrono Trigger got everything right. The self-proclaimed ~dream team~ of scenarist Yuji Hori (Dragon Quest), producer Hironobu Sakaguchi (Final Fantasy), and character designer Akira Toriyama (Dragon Ball Z) created a quirky, enjoyable romp through time with a cast of endearing characters, memorable environments, solid RPG gameplay, and unparalleled presentation. Needless to say, fans have clamored for a sequel ever since. Which is why, after nearly five years of silence, the announcement of Chrono Cross drew so much ire. Where was the legendary dream team? (Only Sakaguchi contributed to Chrono Cross.) Where was the cast of characters we had grown to know and love? And who the hell was that Thundercats reject named Lynx? Things looked grim for the Chrono Trigger faithful. When Chrono Cross was revealed to have over 40 playable characters, many lost faith in the game entirely. Had Square thrown all pretense of a coherent story out the window? But fortunately for series fans, Chrono Trigger's dream team doesn't have a monopoly on RPG innovation. As with the first SNES title, everything in Chrono Cross ~clicks~ in a way most games wish they could imitate. The different parts combine into an instant RPG classic. The story begins with the hero, Serge, who is thrust into a parallel world where he died under mysterious circumstances over a decade ago. He teams up with a rowdy adventurer, Kid, and sets out in search of the mysterious Frozen Flame, an artifact that lets the holder reshape time and space on a whim. The enigmatic Lynx, a regal man-cat who hunts the Frozen Flame for his own purposes, opposes them. In his quest to return home, Serge will accrue both allies and foes, and he'll find himself thrust into an adventure that reveals his heritage, purpose, and ultimate destiny. Only by crossing between the two dimensions can Serge find the answers to his questions. Without revealing any more of Chrono Cross' excellent storyline, it can be said that it successfully pulls off the difficult balancing act every sequel faces. It's not a rehash of the original Chrono Trigger, but neither does it exploit the characters and setting of Chrono Trigger for name recognition alone. Instead, it sets up an equally valid, separate, and well-developed world, then slowly and responsibly weaves in elements, characters, and events from the first title. It doesn't continue the original Chrono Trigger mythos so much as it expands it. Gamers will be stunned by the resolution of the disparate plot threads. And with features like a unilaterally taciturn hero, an accommodating attitude toward interdimensional travel, and a new game+ mode, Chrono Cross manages to maintain the ineffable Chrono Trigger feel. The battle system deviates slightly from the RPG norm. The traditional ~active time bar~ has been replaced with a bar of seven stamina points. While the engine is still ostensibly turn-based, any character can take a turn at any time as long as they have at least a single stamina point remaining. Enemies can even interrupt your characters' attacks. Party members can unleash weak, medium, and strong attacks, which require one, two, and three stamina points, respectively. Even though the game pauses while waiting for input, the ability to start and end a character's turn whenever you please makes for a more frantic, ~real-time~ experience. Elements, Chrono Cross' magic system, is divided into six colors: black and white, red and blue, and green and yellow. The characters all have a ~color alignment,~ which determines their affinity to certain elements. Once you obtain a spell, you place it in an acceptable empty slot on a character's element grid. For example, a spell with level ~5+/-2~ is a level five spell, but can be placed in any slot from three to seven with the expected drop or rise in effectiveness. Successfully landing a weak, medium, or strong attack adds one, two, or three bars to a characters' element grid. A character with sufficient element bars can cast a spell, but the cost is seven stamina points, temporarily dropping him or her out of action. Combine building element grids and plummeting stamina bars with the dynamic nature of characters' turns, and battles become a constantly shifting endeavor - yet always remain under the player's total control. Once you understand the intricacies of the battle system, encounters are always over quickly. Two other features of the battle system are dual techs and the color field. As in the original Chrono Trigger, characters can combine their special techniques for dual attacks; while dual techs are not as prevalent as you might expect, they are there to be discovered. The color field keeps track of the color of the last three spells cast. If the field becomes a single color, characters with that color alignment gain a statistical boost. Moreover, a monochromatic field is the only time when one of the game's mighty summons can be unleashed. Manipulating the field to a single color is trickier than you might expect, as the interference of your opponents' spells can't be ignored. Chrono Cross has to be the most battle-friendly RPG ever released. All opponents are visible onscreen before the battle sequences begin, making battles easy to engage in or avoid. Even more pleasantly, every battle can be escaped whenever you like with a 100-percent success rate. Even boss battles. Don't like the way the battle is going? Your three red magicians hopelessly doomed against a blue powerhouse? Don't reset your console - just run away, regroup, and re-engage. And last but far from least, the option to automatically heal at the end of a battle is a boon from the RPG gods. Don't misunderstand; the game doesn't cure your party for free. But it will intelligently dig through your available spells and stocked inventory and use the necessary elements to return your party to fighting shape. So long, post-battle trips to the status screen, and don't let the door hit you on the way out.Chrono Cross also features a list of key items that can be selected and used on the overworld map and field screens. These items advance the plot, bypass obstacles, and recruit characters to your cause. While no one will fall head over heels in love with this gameplay ~innovation,~ it does add an old-school adventure game feel and an element of interaction with the environment that most console RPGs lack. Surprisingly, Chrono Cross' seemingly endless supply of characters works to its benefit, not its detriment. The secret to its success? Every last one of the 40-plus members is a unique, story-driven, and valuable contributor. Unlike many cast-of-thousands RPG epics, each character in Chrono Cross is an interesting and worthy addition to your team. Everyone has a beautiful character model, excellently animated attacks, and three unique ~limit break~ type special skills. There's even a miniquest or special requirement for every character's best skill - that's a lot of extra adventuring! While you'll certainly have your own handful of favorites, you'll never add someone to your party and wonder, ~Why is this character in the game?~ There are no disposable placeholders in Chrono Cross. Even more surprising is the amount of unique text in the game. There is no dialogue spoken by ~assorted other party members.~ Every character has his or her own reaction to and take on the story's events, expressed in his or her own special dialect, speech pattern, and dialogue style. Moreover, many exchanges are only found by having certain characters in your party. If your opponent has a history with one of your members, the two of them will hash it out before you fight. If one of your members has had an experience they feel pertains to the situation at hand, they'll share it with you. Square's localization team has done an incredible job with a comprehensive set of uniquely English dialects. The Japanese language has a broader base of vocabulary with which a writer can express a character's social class, self-perception, politeness level, maturity, and so forth. It would have been easy to dismiss maintaining the dialects as ~impossible~ and just do a straight translation - but Square did not. While some choices may seem odd at first (Kid as a foul-mouthed Australian sheila? Harle as a compassionate French belle?), the richness of the language soon becomes as much a credit to the game as the diversity of characters. Graphically, Chrono Cross is nothing short of stunning. While Square's Final Fantasy is glossy and polished, Chrono Cross has an organic feel lacking in the former's ~perfect~ environments. Vibrant color, creative design, and just the right amount of ambient effects bring the settings to life. Again, while Final Fantasy drops your characters into a small subsection of a large, epic environment, Chrono Cross lets you explore every nook and cranny of scandalously detailed towns, buildings, and dungeons. While we don't intend to slight Final Fantasy's excellent graphics and design, many gamers will prefer the more down-to-earth, personal, and ~gritty~ feel of Chrono Cross. The environments are well worn and lived in, not just-constructed movie sets. The battle graphics are also excellent. Characters and enemies are universally well modeled, textured, and animated. Camera movement, for the most part, always offers a great view of the action. Special accolades should be given to the spell effects - while they're impressive and suitably over-the-top, they're also short and fast. Thankfully, the sound and music more than match the graphics. Sound effects are varied and always match the situation at hand. The music is, in a word, gorgeous, and it will undoubtedly be many players' favorite part of the Chrono Cross experience. Chrono Trigger composer Yasunori Mitsuda has returned and crafted a masterpiece. Composition and sample quality are both outstanding, and the soundtrack runs the emotional gamut, presenting everything from playful mambo jams to sorrowful violin solos. While many songs are new and unique to Chrono Cross, the influence of Chrono Trigger can definitely be heard. Some songs are rearrangements of Chrono Trigger tunes, while other songs tactfully reference a three- or four-note phrase that only the most devoted series fans will recognize. With Square agonizing over every detail of its flagship property, the Chrono Cross team was apparently left mostly to themselves. Consequently, the game shares an all-out enthusiasm and joie de vivre found in the best 16-bit titles - back before games became multimillion dollar properties that had to answer to glaring shareholders. Chrono Cross may not have had the largest budget, but it has the largest heart.Chrono Cross also features a list of key items that can be selected and used on the overworld map and field screens. These items advance the plot, bypass obstacles, and recruit characters to your cause. While no one will fall head over heels in love with this gameplay ~innovation,~ it does add an old-school adventure game feel and an element of interaction with the environment that most console RPGs lack. Surprisingly, Chrono Cross' seemingly endless supply of characters works to its benefit, not its detriment. The secret to its success? Every last one of the 40-plus members is a unique, story-driven, and valuable contributor. Unlike many cast-of-thousands RPG epics, each character in Chrono Cross is an interesting and worthy addition to your team. Everyone has a beautiful character model, excellently animated attacks, and three unique ~limit break~ type special skills. There's even a miniquest or special requirement for every character's best skill - that's a lot of extra adventuring! While you'll certainly have your own handful of favorites, you'll never add someone to your party and wonder, ~Why is this character in the game?~ There are no disposable placeholders in Chrono Cross. Even more surprising is the amount of unique text in the game. There is no dialogue spoken by ~assorted other party members.~ Every character has his or her own reaction to and take on the story's events, expressed in his or her own special dialect, speech pattern, and dialogue style. Moreover, many exchanges are only found by having certain characters in your party. If your opponent has a history with one of your members, the two of them will hash it out before you fight. If one of your members has had an experience they feel pertains to the situation at hand, they'll share it with you. Square's localization team has done an incredible job with a comprehensive set of uniquely English dialects. The Japanese language has a broader base of vocabulary with which a writer can express a character's social class, self-perception, politeness level, maturity, and so forth. It would have been easy to dismiss maintaining the dialects as ~impossible~ and just do a straight translation - but Square did not. While some choices may seem odd at first (Kid as a foul-mouthed Australian sheila? Harle as a compassionate French belle?), the richness of the language soon becomes as much a credit to the game as the diversity of characters. Graphically, Chrono Cross is nothing short of stunning. While Square's Final Fantasy is glossy and polished, Chrono Cross has an organic feel lacking in the former's ~perfect~ environments. Vibrant color, creative design, and just the right amount of ambient effects bring the settings to life. Again, while Final Fantasy drops your characters into a small subsection of a large, epic environment, Chrono Cross lets you explore every nook and cranny of scandalously detailed towns, buildings, and dungeons. While we don't intend to slight Final Fantasy's excellent graphics and design, many gamers will prefer the more down-to-earth, personal, and ~gritty~ feel of Chrono Cross. The environments are well worn and lived in, not just-constructed movie sets. The battle graphics are also excellent. Characters and enemies are universally well modeled, textured, and animated. Camera movement, for the most part, always offers a great view of the action. Special accolades should be given to the spell effects - while they're impressive and suitably over-the-top, they're also short and fast. Thankfully, the sound and music more than match the graphics. Sound effects are varied and always match the situation at hand. The music is, in a word, gorgeous, and it will undoubtedly be many players' favorite part of the Chrono Cross experience. Chrono Trigger composer Yasunori Mitsuda has returned and crafted a masterpiece. Composition and sample quality are both outstanding, and the soundtrack runs the emotional gamut, presenting everything from playful mambo jams to sorrowful violin solos. While many songs are new and unique to Chrono Cross, the influence of Chrono Trigger can definitely be heard. Some songs are rearrangements of Chrono Trigger tunes, while other songs tactfully reference a three- or four-note phrase that only the most devoted series fans will recognize. With Square agonizing over every detail of its flagship property, the Chrono Cross team was apparently left mostly to themselves. Consequently, the game shares an all-out enthusiasm and joie de vivre found in the best 16-bit titles - back before games became multimillion dollar properties that had to answer to glaring shareholders. Chrono Cross may not have had the largest budget, but it has the largest heart."}