{"ref": "https://www.gamespot.com/reviews/vietcong-2-review/1900-6136410/", "date": "May 17, 2006", "game_name": "Vietcong 2", "text": "Given the dubious results of the Vietnam War, it was a bit surprising when publishers, after having exhausted World War II for stories, started to turn out Vietnam War games a few years ago. This resulted in a wave of Vietnam games, with the majority of them being utterly forgettable. A few did make distinct impressions, including Vietcong, an immersive first-person shooter developed by Pterodon, a Czech Republic studio (of all places). Well, it's time to get back to the jungle with Vietcong 2, the follow-up to 2003's original, which picks up almost exactly where its predecessor left off. That's because Vietcong 2, like its predecessor, exhibits some great qualities but still suffers from technical issues that affect its performance. Furthermore, it's a game that hasn't aged as well as you might hope. You can play as a captain in the US Army battling to take back the city of Hue... Vietcong 2 shifts gears from the actual jungle to the urban jungle, as the story this time centers around the brutal fighting in and around the city of Hue in the days leading up to and after the infamous Tet Offensive of 1968. The sequel actually boasts two campaigns, and this time you can play from either the perspective of a US officer or a Vietcong guerilla. Though in truth, the VC campaign is all but a vignette, as it's a fraction of the length of the US campaign. In addition to the campaigns, you still retain the ability to play any completed single-player mission in quick play against a host of enemies, and there's also a full-fledged, if rudimentary, multiplayer suite at your disposal. The meat of the game is in the single-player campaign. And in the US storyline, you are Captain Daniel Boone of the United States Army, who's assigned to MACV (aka the Military Assistance Command, Vietnam). Like in a gritty Vietnam War movie, Vietcong 2 tries to immerse you in the atmosphere of the war, so you actually start the game in a brothel before you travel to headquarters to get your first assignment. Nothing unseemly is seen or happens, as this sequence is mainly for you to chat with your fellow officers and to get the sense that this isn't your typical first-person action game. Unfortunately, once the action starts, Vietcong 2 eschews the talking and exploring part of the storyline to transition in to a fairly straightforward shooter where you and your squad must battle the Vietcong level after level. The US campaign actually has a nice twist about midway through that serves as the introduction to the VC campaign. Though in the end, it's something of a disappointment. The VC campaign lets you play as a Vietcong guerilla that joins up with the insurgents after your village is destroyed by South Vietnamese soldiers. However, it's so short it can't really be considered a campaign. All it covers is your journey from your village to the city of Hue. And once you arrive, the VC campaign is over. It takes a while to get used to Vietcong 2's gameplay, especially if you didn't play the original game. If you're a first-person shooter veteran, then you're used to running around in the open, blasting guys and then picking up health packs before repeating the process again. That's something you can't do in Vietcong 2. While there are health packs to be found, Vietcong 2 is also a game where you must use cover at all times if you want to survive, because the combat can be downright brutal. In many ways, Vietcong 2 is sort of a cross between a Call of Duty-style run-and-gun shooter and a more realistic tactical shooter. Thankfully, the game gives you the ability to ~peek~ over or around whatever cover you're huddling behind when you fire your rifle to get a good sense of what real combat is like. The enemy soldiers aren't too smart about shifting around, but they do take advantage of cover themselves, and they'll peek out to fire potshots at you--unless they're being suppressed. Your own teammates are a mixed bag in terms of intelligence, as they're sometimes good about getting behind cover and laying down covering fire, but they also do crazy things, like rushing forward into the open or constantly getting in your line of fire. They can also perform some cool moves that really make you feel like you're in a battle, such as roll for cover or leap over obstacles. Unfortunately, you can't execute these moves yourself. Both campaigns don't actually have that many levels, so this is generally a ~short~ game by that standard. However, just because there aren't a lot of levels doesn't mean that you won't spend a lot of time trying to get through them, because this can be a brutally tough experience. Thanks to the ~realistic~ combat, the smallest mistake can get you killed in a heartbeat, which means you have to go back to the last checkpoint or save point. And you only get a limited number of quick saves, depending on the difficulty level, so you have to parcel them out carefully. Otherwise you'll have to redo long sequences over and over until you get them right. Even then, though, you'll be hard-pressed to find 10 hours of gameplay in the single-player campaign. The multiplayer suite isn't much stronger. Vietcong 2 features the standard multiplayer modes, such as deathmatch and team deathmatch, but the gameplay is fairly generic, and the levels are fairly basic. There is a cooperative mode that will let you play alongside other players against the computer, at least. ...or you can play as a Vietcong guerilla in the very brief VC campaign. It doesn't help that the game suffers from all sorts of performance issues. On a high-end machine, we suffered through countless stutters and hitches, and that's even after sliding the visual and physics options down to the middle settings. This is unacceptable in a shooter, particularly one where you can't afford to make a mistake. We had to tone down the settings quite a bit to get the game to run without a hitch. And the inexplicable thing is that the game doesn't look like it's that demanding. From a visual perspective, the graphics are decent, but they're also dated. Meanwhile, the animations are downright clunky at times. The graphics engine hasn't kept pace with the latest in dynamic lighting or pixel and vertex shaders, and Vietcong 2 looks and feels very much like a 2003-era shooter. And when you get down to it, there are tons of shooters that look far more complex than Vietcong 2 but run at much higher frame rates. The audio in Vietcong 2 is at least stronger than the visuals, though it does get a bit annoying to hear your squadmates repeat the same lines over and over again (~Kill a commie for Christ~ becomes grating after the 50th time you've heard it). Ultimately, Vietcong 2 is a game that doesn't improve too much on its predecessor. And while it's a fairly challenging game in some respects, it's also one that suffers from numerous flaws. There are flashes of goodness in Vietcong 2, but it would have been nice to have seen the noncombat portions of the game extended throughout the story to give you a sense of what Vietnam was like between the firefights. Still, those firefights can be challenging and immersive, even when you do get bogged down by technical issues."}