{"ref": "https://www.gamespot.com/reviews/hospital-tycoon-review/1900-6173461/", "date": "July 2, 2007", "game_name": "Hospital Tycoon", "text": "If you're going to rip off a game, it's a good idea to make sure that you pick one that's both current and successful. So it's hard to understand what DR Studios was thinking when it decided to essentially remake the 1997 bomb Theme Hospital. The British developer's Hospital Tycoon is like a reheated version of Bullfrog's ancient hospital-management sim, which was actually a cheap copy of the company's Theme Park. Unsurprisingly, this copy of a copy of a copy is bland and derivative, with only a halfhearted attempt at establishing a Sims-style ambiance to make it stand apart from all the other shovelware out there with the word ~tycoon~ crammed somewhere into their titles. Oddly enough, the biggest difference between Theme Hospital and Hospital Tycoon is that the latter has a more developed theme. Whereas the decade-old Bullfrog game was a straight god game, the story mode of play here drops you into a soap opera with all the angst and twice the cheese of a TV show like ER or the late, great St. Elsewhere. In addition to the usual tycoon-game management chores, you get to follow the escapades of heartthrob doc Rick Steele and the rest of the staff at Sapphire Beach Hospital. Everything here is certainly more fantasy than reality. The glass-walled hospital looks more like the famous Sydney Opera than the usual pile of bricks that passes for houses of healing in most metropolitan centers these days. Steele and a babe nurse are featured in posters all over examination rooms. And patients complain of kooky made-up diseases like ~mummifried~ and ~lightbulbia.~ This is probably better than having to deal with budget cutbacks, fat nurses, and people staggering into emergency with flesh-eating disease or voluminous goiters, though everything is a little too kid-friendly here. DR Studios attempts to further this soapy feel with Sims-like characters that speak in garbled simlish, have personality traits, and hook up or hate one another by turns. As with The Sims, you can take control of these yobs and force them to commit malicious acts on one another like shove and intimidate, or social acts like shake hands and tease, but there is rarely any point to doing so. Everybody mostly gets along, so you're best off to let the staff run on autopilot and interact however they see fit. This leads to some odd spectacles, if you bother to watch. Why is popular Doc Buffman making out with the hated Nurse Dakota? Why are Professor Brahms and Nurse Daisy having a teasing tickle fight in the research room? You'll never know. Or care, because these actions have little impact on your objectives, which stick to the tried-and-true like curing diseases, building specific equipment, and beautifying hospital corridors with fountains, statues, and the like. All of the Sims stuff doesn't fit well with the management aspects of the game, either, and it really sticks out like a sore thumb when you skip the story episodes for sandbox play (which you'll likely do in short order, as all the story really does is add some dull cutscenes, offbeat stories about staffers, and things like missing vials filled with dangerous germs). Game mechanics stick to the god-game template every step of the way, leaving no real room or need for doctors and nurses to play hanky-panky in the operating room. Patients arrive with weird, supposedly humorous illnesses like explosive sneezing or golf rage, or some ailments that you can't immediately identify. You then build examining rooms to make diagnoses, research facilities to figure out unknown maladies, and special equipment like operating rooms and acid baths to treat them. There's a real lather, rinse, repeat thing going on here. Depth is not a part of your doctoring, however. Research is automatic. Whenever patients befuddle your docs, the afflicted party eventually just wanders over to the research lab where a professor is waiting to whip them around in what looks like a cyclotron in order to both diagnose the ailment and prescribe what equipment is needed to make them all better. All identified illnesses are immediately uploaded to what's called the curadex files, where they're listed alongside brief descriptions of the symptoms, the equipment needed to cure them, and the cost (apparently Sapphire Beach is located in the USA) of the treatment. You get some reasonably oddball cases as time goes by, and get to build more involved equipment and carry out more serious (if always G-rated and goofy) medical procedures, but everything is spelled out for you so bluntly that you don't so much play a game as you color by the numbers. About all you ever have to figure out is which type of staff member is needed to run the hardware that you buy, since the game doesn't tell you this information. Audio and video are hit and miss. A big problem with the sound of the game is that it also doesn't fit with the blended Sims/management-game philosophy. The simlish here is just god-awful. It's loaded with repetition and seems entirely random, not the quasi-pig latin that you can almost make out in the Sims games. Also, this gibberish is used as the audio counterpart for printed English dialogue when you communicate with your administrative assistant and others, and that's somehow amazingly annoying. The music also doesn't quite fit, with the score consisting of downbeat elevator music instead of the up-tempo tunes that a game this purportedly zany desperately requires. The visuals do fit the part, though. Everything is colorful, and exaggerated animations and physical features give the game a cartoonish air. Funny treatment sequences abound, as well. The good ones are repeated too often to be amusing for long, although you should get a few chuckles out of moments where nurses pump patients full of health with great big needles in the pharmacy. The one drawback is a restricted camera that doesn't allow you to pan back far enough to get a good look at your hospital. You can go to a bird's-eye view, but this angle is useless since it prevents you from actually doing anything. Panning way, way back from Hospital Tycoon is probably a good idea. The derivative and simplistic gameplay might be a marginal piece of entertainment for god-game newbies and kids, but it won't impress anyone else--especially if you're old enough to know what Theme Hospital was."}