{"ref": "https://www.gamespot.com/reviews/dungeon-siege-ii-review/1900-6130938/", "date": "August 13, 2005", "game_name": "Dungeon Siege II", "text": "When Dungeon Siege came out in early 2002, it was praised for having amazing graphics and a fast-paced, accessible combat system. However, for a role-playing game it was a bit shallow in terms of character development and story. Also, the game lacked the challenge to appeal to veterans of the point-and-click dungeon crawler. Developer Gas Powered Games took the criticism to heart, and set out to fine-tune the gameplay, as well as make the game a bit more challenging and involved for experienced players. The result is Dungeon Siege II, a solid effort that manages to improve on the first game to deliver a lengthy, combat-heavy dungeon hack that will certainly please fans of the genre. Dungeon Siege II is all about killing hordes of evil monsters and collecting tons of loot. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Dungeon Siege II Video Review Dungeon Siege II plays pretty much like your average action RPG, except instead of controlling a single character, you control a party of up to six characters. Don't get too excited though, as it takes a lot of work to get six characters in your party. You start the game with the ability to create a two-person party, but you can buy extra ~slots~ from an innkeeper to increase the size of your group. On your first run through the game, you can have a maximum of four characters in battle at a time. By the time you start on your third run through the story, you're finally able to get that sixth party member. It's a bit of a chore, though, since the story takes between 40 and 60 hours to complete. There are only a handful of characters in the game that you can recruit to join your party, but you can also purchase pets in any of the three major towns. The pets can be fed items to increase their maturity and to make them stronger. There are more than half a dozen different kinds of pets, including pack mules, lap dragons, and elementals. They aren't as immediately effective as human characters, but pets can be useful as a kind of living garbage disposal, since they'll gladly eat any extra items you might have. Once you have your party assembled, you're ready for combat. You only directly control one character at a time, but you can give your party orders with a quick press of a button. For example, you can tap the F key to put your party into mirror mode, which will make them mimic your main character. Or, you can put your party into rampage mode and they'll kill anything that moves. It's easy to switch characters on the fly as well. You can hit the F2 key to take control of your mage and fire off a quick healing spell, or you can press F3 to switch to your fighter and go pound on some enemies for awhile. You can also set magic spells to auto-cast, which can be handy. It's easy to set up the artificial intelligence-controlled characters to be self-sufficient enough that you don't have to do anything but tell them where to go. In fact, if you have healing spells set to auto-cast, your mages can easily heal your party faster than enemies can inflict damage, so the only thing you have to do to stay alive is keep your mages' mana up. Unlike the first game in the series, Dungeon Siege II gives you complete control over how the characters in your party develop by letting you allocate skill points to make your characters more specialized. There are four classes in the game: ranger, fighter, combat mage, and nature mage. You choose your class by simply using the character in a certain way. A character that uses primarily physical attacks will level up in melee skill and will effectively become a fighter. Any character can learn the skills of any class, but if you try to make a jack-of-all-trades-type of character, it'll end up being fairly weak and useless. It's best to choose a class early on and spend all of your skill points on the skills that pertain to that specific class. The skill tree for each class contains 12 different skills, but some of the more-advanced skills require you to reach a certain level with some of the more basic ones first. For example, if you want to learn the deadly strike skill--which increases the damage of a critical hit--you have to have a level-36 melee skill and a level-one critical strike skill. The skills system does help to make the character development feel more dynamic than in the first Dungeon Siege game, but some of the skills are fairly useless, so you're better off just focusing on a few of the more-versatile ones. The combat is simple and easy, but it's satisfying for awhile. In addition to skills, you can now learn special powers based on how you decide to develop your characters. A fighter can learn the brutal attack power, which, when activated will make his or her next strike about 20 times more powerful than a regular attack. These special powers are set to the 1 through 4 keys, so it's easy to activate any of your characters' powers in the midst of combat. You'll be using these powers often, because they're extremely powerful and will let you take out a group of half a dozen enemies in a single blow. The only penalty for using these powers is that once used, you can't use the power again until it recharges, but that usually takes less than a minute. Combat in Dungeon Siege II is about as simple as they come, but it can be pretty satisfying for awhile. You simply right-click on an enemy you want to attack, and if you hold the button you'll keep attacking the enemy until it dies. If you take too much damage, you'll get knocked unconscious, but as long as one of your characters is still coherent you can continue fighting. Eventually an unconscious character will wake up and be ready to fight again. However, if a character takes too much damage while unconscious, he or she will die. As you fight, enemies will drop all kinds of loot for you to pick up--too much loot in fact. You'll find so much gold, armor, weapons, and spells that the notion of collecting items becomes almost trivial. Luckily there are teleporters located throughout the world so you can simply teleport back to town, sell off everything you don't want, and teleport back to continue your quest. Toward the end of the game the only use you'll have for all the items you get is to sell them for gold, but gold is useless since store-bought items are a lot weaker than the items you get from enemies. You can spend gold to enchant weapons and armor, but that isn't necessary since your characters will overpower enemies even when using mediocre equipment. The pack mule isn't necessary anymore, since you can just teleport back to town to sell your loot. For those who enjoy simple, automated combat, there's plenty of it here. There are often dozens of enemies onscreen at a time. Actually, sometimes there's too much going on and it gets difficult to tell which characters are allies and which ones are enemies. The combat in Dungeon Siege II doesn't require any sort of skill or strategy, but there's still something to be said for tearing through mobs of undead soldiers and leaving piles of bloody corpses in your wake. Unfortunately, cutting down evildoers gets stale after a while, since enemies don't really become more challenging as you progress through the story; they just have more hit points so they take a bit longer to kill. There are a few cool boss fights in the game, but even those can get dull at times. There's one particular battle with a dark mage who has about 90,000 hit points but can barely inflict any damage on your party. Essentially, you just end up hacking away for a few minutes while the mage stands there casting useless spells. To make things even easier, you can consult your journal for step-by-step instructions on how to complete each quest. If you're too lazy for that though, there's a small map in the corner of your screen that has a little arrow to direct you to where you need to go. There are multiple difficulty settings, but unfortunately you can't access them until after you beat the game on the easiest setting. To make things slightly more interesting, you can play through the story cooperatively with a friend via LAN or online play. You can import a party from your single-player campaign, but when you start a multiplayer game you have to start at the beginning of the story, which isn't much fun if you already know all the ins and outs of every quest. Although you can use parties in multiplayer, each player can only use a few characters, so there are never more than six allies in the game at a time. Dungeon Siege II does a good job with its setting and maintaining the fantasy atmosphere. The environments are detailed, and although some of the textures look a bit blurry and faded, the assorted areas are varied enough to be interesting while still feeling like they belong in a cohesive fantasy universe. From shadowy forests to dark dungeons and barren deserts, it all looks natural, even down to the enemies and interactive objects that appear in each area. The character animations are a bit awkward, but the characters themselves are high quality, and all the equipment is represented cosmetically. The spell effects are hit or miss. Some of the status effects add a nice glow to your characters, but the elemental spells look rather weak. You can import a party into an online multiplayer game and play through the story cooperatively with a friend. In addition to the scenery, the sound goes a long way in enhancing the atmosphere in Dungeon Siege II. The fully orchestrated soundtrack from Jeremy Soule helps set the mood for each area, whether you're exploring a dungeon or just chatting with people in town. The sound effects are consistently enjoyable as well, and although you hear battle noise almost constantly in the game, it manages to avoid sounding canned. The only weak spot in the sound is the voice work. Just about all of the characters in the game have speaking lines, and although a few characters are done well, most of the acting is pretty bad. To give the voice actors credit, though, they didn't have the best dialogue to work with. Dungeon Siege II is a solid game with plenty to keep you busy for hours. The biggest problem is that the game is just too easy, and even though there are increased difficulty settings, you have to put in a good 40 hours just to unlock the veteran setting, and another 40 hours to reach elite. Unfortunately, the story and gameplay really aren't deep enough to warrant that many trips through the game. But, there haven't been a lot of good dungeon crawlers lately, and Dungeon Siege II does a respectable job of filling that void. As you fight, enemies will drop all kinds of loot for you to pick up--too much loot in fact. You'll find so much gold, armor, weapons, and spells that the notion of collecting items becomes almost trivial. Luckily there are teleporters located throughout the world so you can simply teleport back to town, sell off everything you don't want, and teleport back to continue your quest. Toward the end of the game the only use you'll have for all the items you get is to sell them for gold, but gold is useless since store-bought items are a lot weaker than the items you get from enemies. You can spend gold to enchant weapons and armor, but that isn't necessary since your characters will overpower enemies even when using mediocre equipment. The pack mule isn't necessary anymore, since you can just teleport back to town to sell your loot. For those who enjoy simple, automated combat, there's plenty of it here. There are often dozens of enemies onscreen at a time. Actually, sometimes there's too much going on and it gets difficult to tell which characters are allies and which ones are enemies. The combat in Dungeon Siege II doesn't require any sort of skill or strategy, but there's still something to be said for tearing through mobs of undead soldiers and leaving piles of bloody corpses in your wake. Unfortunately, cutting down evildoers gets stale after a while, since enemies don't really become more challenging as you progress through the story; they just have more hit points so they take a bit longer to kill. There are a few cool boss fights in the game, but even those can get dull at times. There's one particular battle with a dark mage who has about 90,000 hit points but can barely inflict any damage on your party. Essentially, you just end up hacking away for a few minutes while the mage stands there casting useless spells. To make things even easier, you can consult your journal for step-by-step instructions on how to complete each quest. If you're too lazy for that though, there's a small map in the corner of your screen that has a little arrow to direct you to where you need to go. There are multiple difficulty settings, but unfortunately you can't access them until after you beat the game on the easiest setting. To make things slightly more interesting, you can play through the story cooperatively with a friend via LAN or online play. You can import a party from your single-player campaign, but when you start a multiplayer game you have to start at the beginning of the story, which isn't much fun if you already know all the ins and outs of every quest. Although you can use parties in multiplayer, each player can only use a few characters, so there are never more than six allies in the game at a time. Dungeon Siege II does a good job with its setting and maintaining the fantasy atmosphere. The environments are detailed, and although some of the textures look a bit blurry and faded, the assorted areas are varied enough to be interesting while still feeling like they belong in a cohesive fantasy universe. From shadowy forests to dark dungeons and barren deserts, it all looks natural, even down to the enemies and interactive objects that appear in each area. The character animations are a bit awkward, but the characters themselves are high quality, and all the equipment is represented cosmetically. The spell effects are hit or miss. Some of the status effects add a nice glow to your characters, but the elemental spells look rather weak. You can import a party into an online multiplayer game and play through the story cooperatively with a friend. In addition to the scenery, the sound goes a long way in enhancing the atmosphere in Dungeon Siege II. The fully orchestrated soundtrack from Jeremy Soule helps set the mood for each area, whether you're exploring a dungeon or just chatting with people in town. The sound effects are consistently enjoyable as well, and although you hear battle noise almost constantly in the game, it manages to avoid sounding canned. The only weak spot in the sound is the voice work. Just about all of the characters in the game have speaking lines, and although a few characters are done well, most of the acting is pretty bad. To give the voice actors credit, though, they didn't have the best dialogue to work with. Dungeon Siege II is a solid game with plenty to keep you busy for hours. The biggest problem is that the game is just too easy, and even though there are increased difficulty settings, you have to put in a good 40 hours just to unlock the veteran setting, and another 40 hours to reach elite. Unfortunately, the story and gameplay really aren't deep enough to warrant that many trips through the game. But, there haven't been a lot of good dungeon crawlers lately, and Dungeon Siege II does a respectable job of filling that void."}