{"ref": "https://www.gamespot.com/reviews/super-monkey-ball-deluxe-review/1900-6120496/", "date": "March 15, 2005", "game_name": "Super Monkey Ball Deluxe", "text": "Super Monkey Ball may prove to be one of the last great gasps of creativity to emerge from Sega in recent history, and it certainly stood out at the launch of the GameCube. Forget operatic space battles or splashy jet-ski races--GameCube owners who were willing to take a chance on the strange would know of the incredible challenge and nerve-racking tension of rolling a monkey inside a hamster ball around abstract checkerboard platforms suspended in infinity. Super Monkey Ball, and its aptly named sequel, Super Monkey Ball 2, have long remained exclusive to the GameCube. That has finally come to an end with Super Monkey Ball Deluxe, which takes a kitchen-sink approach to the franchise, cramming all the content from both games into a single package. It even tosses in a few extras, just to make sure it's worth your while. It's a fantastic package if you've missed this infectiously charming series up until now, though some of its luster has faded with time. Hamsters would've made more sense, but since when is Super Monkey Ball about making sense? Super Monkey Ball owes an awful lot of its concept to the Atari classic Marble Madness--to the point that Marble Madness creator Mark Cerny should probably be getting checks from Sega. It's a simple formula: By using one of the analog sticks, you roll a ball from point A to point B across an obstacle course, and simultaneously try to avoid plummeting off the course while being urged along by the countdown timer at the top of the screen. Of course, the idea of putting monkeys inside translucent plastic balls is all Sega, and the level designs in Super Monkey Ball are way more controller-smashingly devious than anything even possible in Marble Madness. The levels often feel like the combined efforts of Rube Goldberg and P.T. Barnum, requiring you to wildly ricochet your monkey ball off various surfaces one minute and then carefully but quickly rolling yourself across a razor-thin platform the next. It's the kind of high-wire difficulty that makes you acutely aware of the slightest tremble in your hand. You'll often have to remind yourself to breathe. The single-player game's draconian level of challenge seems downright absurd when you consider the game's otherwise sunny disposition. Super Monkey Ball Deluxe presents the same story mode found in Super Monkey Ball 2, which tells the tale of AiAi, MeeMee, Baby, and GonGon, a quartet of monkeys who have to return all of the bananas to their village where they were stolen by the brutally insane Dr. Bad-Boon. All of this, including the subtitled cutscenes that almost seem to be poorly translated from Japanese on purpose, would be too weird to handle in a lot of other games. Here, it just kind of adds to the dizzying Monkey Ball charm. A big part of that charm comes from the game's presentation, which always seemed to carry the design philosophy that it was impossible to be too vibrant or too cheery. The Monkey Ball series has always been about establishing a whimsical, energetic feel, and that still comes across in Deluxe. The MC Escher-inspired checkerboard levels contrast nicely against the crazy backdrops, the most inspired of which include the inside of a clock tower and the inside of an active volcano. The pumping, upbeat techno almost feels like it's trying to strong-arm you into being happy, which really isn't out of character for the game, and neither are the monkeys various eeks. Admittedly, the graphics in Super Monkey Ball Deluxe don't feel as crisp as they did when they first arrived on the GameCube. Sega has done some work to include a few new special effects, but these efforts are overlooked by aliasing, certain muddiness to the game's overall look, and noticeable frame rate problems on the PlayStation 2 version of Deluxe. Also, as a minor aside, Monkey Ball veterans will probably notice that the Dole branding has been stripped from the bananas that litter the game. This is quite probably one of the very few occasions when ubiquitous product placement is actually missed. It doesn't pop quite like it used to, but Super Monkey Ball Deluxe is still a great package. If you're looking for a break from the skull-splitting difficulty of the single-player game, Super Monkey Ball Deluxe features an awesome array of multiplayer options as well. All 12 multiplayer minigames that have appeared in previous Monkey Balls are included in Deluxe, and unlike in past Monkey Balls, they're all immediately playable out of the box. The variety of the action matches the sheer quantity of minigames, and though some certainly have more lasting appeal than others, you're bound to find something that appeals to you here. The biggest factor working against Super Monkey Ball Deluxe is the time between the original GameCube releases of the Super Monkey Ball games and their consolidated latter-day arrival on the Xbox and PlayStation 2. There are probably a few tweaks that would've made Super Monkey Ball Deluxe a more attractive package, such as enhanced graphics or online play, but the biggest help would've been if it had come out about two years earlier."}