{"ref": "https://www.gamespot.com/reviews/tamagotchi-party-on-review/1900-6171807/", "date": "May 31, 2007", "game_name": "Tamagotchi Party On!", "text": "Back in 1996, digital pets called Tamagotchi were all the rage. Children couldn't get enough of playing with and cleaning up after their little LCD pets. As with all fads, interest in Tamagotchi quickly waned, but that hasn't stopped the brand from continuing its existence. The latest product to sport the Tamagotchi name is Tamagotchi Party On!, a virtual board game for the Nintendo Wii. It's got plenty of cute Tamagotchis, but it's short on depth and is seriously lacking in the fun department. Parties better than Party On!: Tupperware parties, bachelor parties, House Party... Party On! pits you and up to three friends (or CPU opponents) in a race to become the next president of Tamagotchi planet. The game takes place over seven turns, or as they're referred to in the game, ~days.~ At the end of seven days, the person with the most popularity points wins the election. You can choose to play longer games where there is more than one election (the game defaults to three), but the game is super slow, so you're looking at an hour and a half if you play three elections. You start by rolling a die and then choosing the direction you want to go. There are multiple boards in the game and each one is connected to a central hub. When the game begins, the location of the campaign space is revealed. You'll want to immediately go to the board that contains the campaign space because getting there first typically gets you enough popularity points to win. There are multiple paths on each board, but they're all connected, so picking your direction all comes down to what type of space you prefer to land on. The board is made up of a few different types of spaces. The main ones are minigames, gotchi games, stores, and events. You can use money you've acquired throughout the game in the store to purchase items that will help increase your popularity. Unless you're playing more than one round, you probably won't be able to afford any of the items. Gotchi games are quick games where you play rock-paper-scissors or other simple games, such as memory. Event spaces are nothing more than brief sequences that show you doing something good, like breaking up a fight, or doing something bad, like falling down. If it's a good event, you'll gain popularity, but if it's something bad, you might wind up losing a whole turn. Minigames are the big draw here, but that's not saying a whole lot. There are 15 different minigames that will have you use the Wii Remote to wash windows, shake hands, flip the pages of a book, scoop fish out of a stream, and even drive a car. These games are mildly entertaining, but the game does a poor job registering movement. Another issue is that the games are all single-player only. However, worst of all, there are so few minigames that it's possible to play an entire round without ever playing a single minigame. How everything fits together is what really ruins the Party On! Experience. The pace of play is absolutely terrible, and that's even taking into account the fact that you don't have to watch all of your opponents take their turns (just part of them). Because you can go an entire round without landing on a minigame space, the game's dreadfully boring. Even if you do land on a few minigames, they don't spice up the action for long. The game's also poorly balanced. With the CPU opponents set to ~easy,~ we still lost miserably when we lost our turn three times in one round. That's right, of the seven turns in the game, six of them went as follows: land on event space and lose turn, sit out turn, land on event space and lose turn, sit out turn, land on event space and lose turn, sit out turn. There's a challenge mode that lets you skip the board game and only play minigames, but you've got to unlock a minigame in the board game before you can play it in the challenge mode. political parties, birthday parties, House Party 2, surprise parties Party On! is a simple-looking game with a look that should appeal to younger children. The Tamagotchi are all quite large and display a range of emotions based on what's happening in the game. The cel-shaded boards are also quite simple, but they fit the theme well and are quite colorful. The audio is similarly lighthearted. It's not bad, though some may find the music a bit irritating after awhile. If there's one thing the Wii has in spades, it's party games and minigame collections. With so many good games already out there, it's impossible to recommend a game like Party On! It's boring, there aren't enough minigames, and you can't play any of them with friends."}