{"ref": "https://www.gamespot.com/reviews/spy-hunter-review/1900-2854220/", "date": "March 13, 2002", "game_name": "Spy Hunter", "text": "As we all know, history has a way of repeating itself, and this maxim rings no truer than in the field of video games. Popular games tend to spawn sequels and imitations ad nauseum, and classic titles are often recycled by publishers looking to cash in on existing name recognition. Midway has certainly been guilty of squeezing its franchises for everything they're worth and then some, but its PlayStation 2 remake of Spy Hunter qualified as more of a revival than a cash-in. But there's a new facet to the repetition of history, where publishers will take a game from one platform and port it to every other modern console. Spy Hunter for the Xbox is just one of these ports. For the most part, it makes good on the PlayStation 2 version, but it's dragged down by somewhat problematic graphics.The game's story plays out like an unmade James Bond movie, pitting you as the lone superspy up against an evil organization known as the Nostra, which is conspiring to drain the planet of its power. Taking to the road in the G-6155 Interceptor, you'll travel around the world to locations such as the canals of Venice, the autobahns of Germany, and the Panama Canal. The core mechanics of the arcade classic remain intact--that is, you can drive down stretches of road or water and blow up any enemy vehicles that cross your path. Aside from the smoke screen, oil slick, missiles, and front-mounted guns in the original, defensive flamethrowers and more exotic weaponry, like an electromagnetic pulse cannon, equip your supercar. The Interceptor is also a versatile vehicle, able to transform from car to boat and back again. If your vehicle takes enough damage, it will shed the majority of its weight to reveal a slimmed-down motorcycle or Jet Ski, depending on the environment. The Interceptor handles incredibly well in all of its forms, though the full road machine form is the most fun. The sensation of speed can be very satisfying, and powersliding is as easy as it is constantly necessary, due to the turn-filled nature of the game's level design.Blowing things up is no longer the sole purpose of Spy Hunter, as each mission charges you with a primary mission objective, as well as a handful of secondary objectives. These objectives include escorting friendly vehicles, blowing up stolen Interceptors and enemy communications towers, or simply escaping from an enemy warehouse before time runs out. While certain goals, like collecting all the satcom icons, are found in every level, the objectives are varied and keep things interesting on the whole. As you complete mission objectives, you are awarded points, which you'll need to accumulate to advance to the next level, making it necessary to run through each level several times to complete all the objectives. On the downside, there are only 14 levels in all, and with each taking between three and seven minutes to run through, this doesn't give Spy Hunter much length. There is a ton of unlockable goodies hidden in the game, such as music videos and behind-the-scenes footage, but these treats aren't as much incentive to keep playing as more levels would be.The game also features a multiplayer mode, though it does not impress as much as the single-player game. Most of the multiplayer games consist of picking up more items than the other player or just straight racing. The majority of the multiplayer levels start off locked, and you'll have to complete single-player objectives to open them up. The levels themselves are just as varied and fun as the mission objectives. Each level is full of action-movie moments, such as plowing through rows of outdoor cafes, scraping past a road-blocking semi, and being faced with harrier jets as they rise up out of canyons. All the levels are rife with big jumps, hairpin turns, and multiple paths, but the game manages to maintain a balance between thematic consistency and varied level design. And what would Spy Hunter be without that classic Peter Gunn theme? It certainly wouldn't be Spy Hunter, and Midway knows it, as the soundtrack consists almost entirely of electronic interpolations of it. A cover of the Peter Gunn theme is included as well, complete with lyrics, performed by nu-metal outfit Saliva. The in-game sound effects are solid, with nothing too gratingly offensive or especially impressive. While most of the Spy Hunter experience has been deftly translated from the PlayStation 2 to the Xbox, the graphics have taken a bit of a hit in the process. The Interceptor, the enemy vehicles, and the environments they occupy still look just as sharp, but the framerates aren't quite as consistent as in the PS2 version.There are some other minor curiosities about Spy Hunter's graphics, like the black armored car's ability to magically appear on the other side of your car if you push them up against a wall, but the other big complaint is that the entire game looks dark and muddled, as though it were being viewed through a pair of cheap sunglasses. When comparing the Xbox version to the PlayStation 2 version side by side, it literally looks like night and day. The PlayStation 2 remake of Spy Hunter was a pleasant surprise, as it capably delivered in all the categories that a Spy Hunter fan would expect it to. While it's virtually identical to the PlayStation 2 version, the Xbox version is made slightly less desirable by the drab, sometimes choppy graphics. Sure, there are more extras you can unlock, such as the original arcade Spy Hunter and more DVD goodies, but these features don't compensate for the game's muddled presentation. Editor's note 03/13/2002: Due to technical inconsistencies between Microsoft-provided debug hardware (used for review purposes) and retail Xbox hardware, our original review noted technical problems that are not actually present when the final version of the game is running on retail Xbox hardware. Note the review was based on 100% final code. To more-properly reflect the retail product, we have amended the original text and accordingly raised the game's graphics and gameplay scores. GameSpot regrets the error.The game also features a multiplayer mode, though it does not impress as much as the single-player game. Most of the multiplayer games consist of picking up more items than the other player or just straight racing. The majority of the multiplayer levels start off locked, and you'll have to complete single-player objectives to open them up.The levels themselves are just as varied and fun as the mission objectives. Each level is full of action-movie moments, such as plowing through rows of outdoor cafes, scraping past a road-blocking semi, and being faced with harrier jets as they rise up out of canyons. All the levels are rife with big jumps, hairpin turns, and multiple paths, but the game manages to maintain a balance between thematic consistency and varied level design.And what would Spy Hunter be without that classic Peter Gunn theme? It certainly wouldn't be Spy Hunter, and Midway knows it, as the soundtrack consists almost entirely of electronic interpolations of it. A cover of the Peter Gunn theme is included as well, complete with lyrics, performed by nu-metal outfit Saliva. The in-game sound effects are solid, with nothing too gratingly offensive or especially impressive.While most of the Spy Hunter experience has been deftly translated from the PlayStation 2 to the Xbox, the graphics have taken a bit of a hit in the process. The Interceptor, the enemy vehicles, and the environments they occupy still look just as sharp, but the framerates aren't quite as consistent as in the PS2 version.There are some other minor curiosities about Spy Hunter's graphics, like the black armored car's ability to magically appear on the other side of your car if you push them up against a wall, but the other big complaint is that the entire game looks dark and muddled, as though it were being viewed through a pair of cheap sunglasses. When comparing the Xbox version to the PlayStation 2 version side by side, it literally looks like night and day.The PlayStation 2 remake of Spy Hunter was a pleasant surprise, as it capably delivered in all the categories that a Spy Hunter fan would expect it to. While it's virtually identical to the PlayStation 2 version, the Xbox version is made slightly less desirable by the drab, sometimes choppy graphics. Sure, there are more extras you can unlock, such as the original arcade Spy Hunter and more DVD goodies, but these features don't compensate for the game's muddled presentation.Editor's note 03/13/2002: Due to technical inconsistencies between Microsoft-provided debug hardware (used for review purposes) and retail Xbox hardware, our original review noted technical problems that are not actually present when the final version of the game is running on retail Xbox hardware. Note the review was based on 100% final code. To more-properly reflect the retail product, we have amended the original text and accordingly raised the game's graphics and gameplay scores. GameSpot regrets the error."}