{"ref": "https://www.gamespot.com/reviews/spy-hunter-gba-review/1900-2868768/", "date": "May 17, 2006", "game_name": "Spy Hunter", "text": "Game Boy Advance games are starting to resemble early PlayStation games. Case in point: Midway's Spy Hunter, which uses texture-mapped polygons to create roadways and vehicles that are large, smooth, and entirely three-dimensional. It's a great-looking game, though the gameplay can start to wear thin pretty quickly. The 3D look is very impressive. Terrain graphics, especially those for water, are crisp and show off a modest amount of interactivity, such as dust and splash. Courses are generally lengthy and have plenty of room to drive, so you don't feel the confinement typical to other handheld driving games. The good news for Spy Hunter fans is that the basic gameplay of the arcade original translates well into a 3D environment. There are eight stages, each with roughly five submissions. To complete these missions, you need to use your trusty G-6155 Interceptor to destroy the designated targets, activate the required sat-coms, and survive a gauntlet of enemy Nostra vehicles--including the bulletproof sedans and switchblades of yesteryear. One nice thing about the transition to 3D is that if you miss an item or fail to destroy a target, you can always turn around and make another pass. Spy Hunter also offers a healthy variety of weapons. By default, the Interceptor is equipped with machine guns and oil slicks, while upgrades such as missiles, E.M.P., and smoke screens are strategically placed within each level. In all, there are eight different weapons to use. The car itself takes on various forms as well--it can transform into a speedboat for water travel or into a motorcycle if you lose half your armor. Unfortunately, while the visuals are pretty, and while it's fun to be able to transform into a speedboat, Spy Hunter has a few problems that may ultimately diminish your enjoyment of the game. Although courses are lengthy, the goals within each mission can be downright boring. The primary objective usually entails eliminating a specific Nostra vehicle or base, while secondary objectives involve destroying X number of supply trucks, activating X number of sat-coms, or some other task equally as generic. Course designs don't help matters any in that the various forks and branches in the road occur with regular predictability. After a couple of missions, you'll literally feel as if you've seen it all before, even though the terrain is a different color and enemy vehicles are increasing in number and strength. Another major problem is the way vehicles can overlap one another on roadways. Frequently, civilian and gangster vehicles mesh into large groups, which can make it impossible to destroy a target without incurring civilian casualties. At other times, an enemy enforcer will simply merge with a semitruck, which makes it nearly impossible to destroy either vehicle before you've taken a significant amount of damage. Once in a while, some objects will even just disappear right in front of you. If you have a friend in the game, the included two-player link battle option actually offsets these problems somewhat--primarily because human opponents are much less predictable than CPU vehicles and because you rarely notice dull course layouts when missiles are flying at you from random directions. On its own, however, Spy Hunter is an easygoing vehicular combat game with a few unfortunate flaws. But it sure is pretty."}