{"ref": "https://www.gamespot.com/reviews/spy-hunter-review/1900-2815288/", "date": "May 17, 2006", "game_name": "Spy Hunter", "text": "As we all know, history has a way of repeating itself, and this maxim is no more evident than in the field of video games. Popular games tend to have sequels and be imitated ad nauseum, and classic titles are often recycled by publishers looking to cash in on existing name recognition. Midway has certainly been guilty of squeezing its franchises for everything they're worth and then some, but its PlayStation 2 remake of Spy Hunter qualifies as more of a revival than a cash-in. It manages to bring this classic drive-and-shoot arcade game into the next-generation of polygonal gaming without losing the core appeal of the original.The game's story plays out like an unmade James Bond movie, pitting you as the lone superspy up against an evil organization known as the Nostra, which is conspiring to drain the globe of its power. Taking to the road in the G-6155 Interceptor, you'll travel around the world to locations such as the canals of Venice, the autobahns of Germany, and the Panama Canal. The core mechanics of the arcade classic remain intact--that is, you can drive down stretches of road and blow up any enemy cars that cross your path. Aside from the smoke screen, oil slick, and front-mounted guns found in the original, your supercar can be equipped with heat-seeking missiles, defensive flamethrowers, and more exotic weaponry, like an electromagnetic pulse cannon. The Interceptor is also a versatile vehicle, able to transform from car to boat and back again. If your vehicle takes enough damage, it will shed the majority of its weight to reveal a slimmed-down motorcycle or Jet Ski, depending on the environment. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Spy Hunter Video ReviewBlowing things up is no longer the sole purpose of Spy Hunter, as each mission charges you with a primary mission objective, as well as a handful of secondary objectives. These objectives include escorting friendly vehicles, blowing up stolen Interceptors and enemy communications towers, or simply escaping from an enemy warehouse before time runs out. While certain goals, like collecting all the satcom icons in a level, are found in every level, the objectives are varied and keep things interesting on a whole. As you complete mission objectives, you are awarded with points, which you'll need to accumulate to advance to the next level, making it necessary to run through each level several times to complete all the objectives. On the downside, there are only 14 levels in all, and with each taking between three and seven minutes to run through, this doesn't give Spy Hunter much length. There is a ton of unlockable goodies hidden in the game, such as music videos and behind-the-scenes footage, but these treats aren't as much incentive to keep playing as more levels would be. The game also features a multiplayer mode, though it does not impress as much as the single-player game. Most of the multiplayer games consist of picking up more items than the other player or just straight racing. The majority of the multiplayer levels start off locked, and you'll have to complete single-player objectives to open them up.The levels themselves are just as varied and fun as the mission objectives. Each level is full of action-movie moments, such as plowing through rows of outdoor cafes, scraping past a roadblocking semitruck, and being faced with Harrier jets as they rise up out of canyons. All the levels are rife with big jumps, hairpin turns, and multiple paths, but the game manages to maintain a balance between thematic consistency and varied level design.The entire Spy Hunter package is fun to play, and it looks good as well. It's not the most mind-blowing PS2 game yet, but it definitely holds its own. The Interceptor is beautifully modeled and smoothly transforms between its four different forms. The enemy vehicles, while lacking the same level of detail, look good, and the vehicles that have been included from the original Spy Hunter look exactly how you think they should in 3D. You'll have no problem spotting the black armored cars and the roving biker gangs. The levels themselves have a great amount of detail, to the point that you may feel inclined to cruise through the levels and do some sightseeing. There is some occasional texture tearing and even less occasional slowdown, but considering the overall quality of the graphical presentation of Spy Hunter, these are almost trivial gripes.And what would Spy Hunter be without that classic Peter Gunn theme? It certainly wouldn't be Spy Hunter, and Midway knows it, as the soundtrack consists almost entirely of electronic interpolations of it. A cover of the Peter Gunn theme is included as well, complete with lyrics by nu metal outfit Saliva. The in-game sound effects are solid, with nothing too gratingly offensive or especially impressive.If you were to slap a 007 license on this game, it would be one of the best James Bond games yet. As it stands, it's a solid reinterpretation of a video game classic that adds its own unique elements to the franchise without forsaking what made Spy Hunter what it was."}