{"ref": "https://www.gamespot.com/reviews/powerwash-simulator-review-filthy-rich/1900-6417923/", "date": "July 26, 2022", "game_name": "PowerWash Simulator", "text": "At one point while playing PowerWash Simulator, I referred to it as ~time-consuming.~ I meant this in the context of planning my time to write this review, but it occurred to me that in this case it's also a statement of identity. PowerWash Simulator consumes time--that's just what it does, and what it's meant to do. Like many chore-core games, it exists to be a satisfying activity, not a challenge. That can make it feel tedious and repetitive at times, but taken in small doses, it's a pleasant, low-impact, and very satisfying approximation of cleaning.As the name suggests, PowerWash Simulator puts you into the rubber galoshes of a burgeoning power-washing business owner in the absolutely disgusting town of Muckingham. Just about everything is covered with a thick layer of grime, and you're just the person to clean up this town. You start with some basic equipment and a dirt-caked business van--your very first job and then a prop at every job site thereafter--and get called to increasingly complex jobs as you develop a loyal clientele.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: PowerWash Simulator Launch TrailerThat may make the story sound more expansive than it actually is. While Muckingham has a good sense of personality thanks to a motley cast of weirdos, we never actually see any of them face to face. All of their dialogue is delivered through messages requisitioning you for jobs or text messages they send while you're in the middle of a job. These are often funny and add a little personality, as they detail everything from interpersonal rivalries to corrupt local politics to conspiracy theories. No one really seems to notice or comment on why the entire town is so absurdly filthy, but the texts sometimes toy with those expectations, seeming to tease some larger or even supernatural force at play and then pulling back toward the mundanity of an especially dirty suburb.There's a soothing rhythm to power-washing surfaces, complete with a satisfying ~ding~ whenever you complete a particular piece of a job. There's something primal and instinctive about washing away the filth, watching as a grubby mess gains a wet sheen of cleanliness. It just feels good, somewhere in the deepest recesses of our lizard-brains. Cleaning provides a different kind of satisfaction than organizing in a game like Unpacking, but the two sensations are similar. And each completed job ends with a quick montage of your own cleaning progress, which is a nice cherry on top of the fulfilling feeling.The sound design is quiet and contemplative, but more often than not, I found myself listening to podcasts, like I do when completing my own actual chores around the house. That makes it easy for minutes to turn into hours as you get into the zone and clean, without any of the physical fatigue of doing actual chores.As the jobs get more complex, you'll gather enough money to buy better equipment, chief among these being a series of better power washers. These are mostly elegantly balanced, giving you more efficient cleaning power just as you start to feel your old tools are no longer keeping up with the demands of these newer, larger tasks. The one major exception was when I had spent hours saving up for a top-of-the-line washer, the best and final one, and I had just one more job to complete before I could afford it. I was excited to get started and earn that little bit of extra money I needed. But upon starting that job, I discovered that it needed an expensive extender attachment. As far as I could tell, the job would be impossible to complete without the extender, or at least far more difficult than the game is meant to be. So I bit the bullet and bought the attachment, setting back my progress on the washer I had been ogling for several more hours. This seems to be how the in-game economy was meant to work, delaying the best washer for a few more jobs, but I couldn't help but feel that the rug had been pulled out from under me.And while the game is never exactly challenging, finding the last few spots of dirt can be like searching for a needle in a haystack. I found myself knowing I needed to clean a particular part, but scratching my head at what an ~Upper Deck Rim Joist~ even is. PowerWash Simulator gives you a few tools to locate remaining dirt spots, including a shortcut button that makes any remaining dirt glow orange and the option to highlight individual pieces through the menu. But for larger jobs, even those tools start to become insufficient, as you can be looking directly at a part that needs attention and fail to see where exactly to find that last bit of gunk. It never demands absolute perfection, and will consider an area complete when you cross some invisible ~close enough~ threshold, but it can still be a pain.This is especially the case when it comes to structures that have lots of tiny parts and corners tucked behind other parts. Getting your washer into those tiny crevices can feel a bit trial-and-error, and sometimes I just turned on my narrowest sprayer and waggled it around until the game marked the piece as complete.For tiny, fiddly, hard-to-reach cleaning spots, though, nothing matches the wide array of vehicles. While most of the jobs in PowerWash Simulator are large structures like houses, parks, and carnival rides, many of the smaller jobs are vehicles like classic cars, helicopters, and even a massive drill. These jobs technically cover less space, but they're much more prone toward tiny detail work with grime hiding in grills or underneath cosmetic features and irregular shapes. As a result, I found these much less relaxing than the larger superstructures, and with lower payouts to boot. Progress is gated behind them, though, so I didn't have much choice but to clean every last crevice.That may have contributed to an overall feeling of tedium that eventually set in with PowerWash Simulator. It's well-made and relaxing, but the campaign is as long as some mid-size RPGs, so the mechanics have a hard time sustaining such a long playtime--at least when marathoning with few breaks over a week. At dozens of hours to complete the campaign--and often, two or so hours just to complete a single, large-scale job--the novelty wears off.The lengthy career mode is complemented by a handful of other modes. Free Play lets you replay old jobs with all of your unlocked equipment, and with up to six players instead of the 1-2 in career mode. Challenge Mode sets limits on elements like time or water, which just felt totally unappealing to my desire for chill vibes but might attract some kind of power-washing speedrunner community. The highlight of the alternative modes is the Special Jobs, which offer strange tasks like a miniature golf course, or the Mars rover. There are only four of these at launch, but they show off the novel flexibility of the idea. More than anything, this seems like the area most rife for updates and further exploration.With the exception of Challenge Mode, all of the game can be played cooperatively. It's easy to toggle on and promises to speed up progress if you find a willing partner to help see you through the entire campaign. And it offers cross-play, albeit with the use of a room code that makes the process slightly less elegant.When PowerWash Simulator leans into its best qualities, as a soothing and low-impact way to pass some time, it shines like the chrome on a recently power-washed classic car. On the rare occasions when it breaks up its own flow with granular fussiness or interrupts your plans for the in-game economy, it detracts from the experience. At its best, PowerWash Simulator is a quiet, relaxing experience that's best enjoyed in small doses. It's time-consuming, yes, but once in a while, we all need something to consume our time."}