{"ref": "https://www.gamespot.com/reviews/cryostasis-the-sleep-of-reason-review/1900-6208532/", "date": "April 24, 2009", "game_name": "Cryostasis: The Sleep of Reason", "text": "The best horror games can make you shiver, but few elicit chills as well as Cryostasis: The Sleep of Reason. This is partially due to the tense atmosphere that slowly thickens as you play, inspiring a general unease that eventually escalates into full-blown panic. But it's also due to its icy Arctic setting, where the freezing air can choke your lungs and heat is the most valuable of commodities. The unforgiving blizzards of the North Pole inspire Cryostasis on multiple levels, from a heavy, deliberate pace akin to wading through drifts of snow, to multiple gameplay mechanics that keep you forever at odds with the cold. This innovative first-person adventure is not for everyone; its slow tempo will numb players seeking instant gratification, and occasional performance and stability issues may frustrate. But Cryostasis has a way of keeping you in its thrall, pushing you forward to see what frosty secrets lie ahead. The game doesn't give you much in the way of exposition, ushering you into the frozen tundra by way of a seemingly unrelated voice-over about a tribe of forest dwellers seeking refuge within the wildwood. This tale evolves during the game through a series of scattered parchments, though its meanings and metaphors are slow to unfold--much like the main narrative. It's not immediately clear as you start your initial explorations where you are and why you're there, though the raging blizzard and lifeless bodies strewn around indicate that you aren't apt to encounter many friendly faces. Eventually the framework becomes more apparent: You are on a nuclear-powered icebreaker whose crew has befallen an unusual tragedy, though the glacial crash that seems the most likely cause is only one piece in an increasingly complex puzzle. It's a great mystery, and the gradual flow of information will keep you guessing--and keep you tethered to your screen. The story is uncovered in flashbacks, but these recollections aren't just plot morsels that exist outside of the gameplay. Rather, you relive key moments as you encounter the scattered corpses of crew members. When you discover bodies, you're transported back in time to witness important events that eventually coalesce into a meaningful narrative, and you do so through the eyes of the poor soul you've discovered. However, you aren't always just a powerless witness; in many cases, you must actively change the circumstances of the past to affect the present. This mechanic manifests itself in different ways and leads to some of the game's most memorable moments. For example, by piloting an undersea vessel through some murky waters within one sinister flashback, you conduct repairs that then remove obstacles in the present. In another case, you'll make a quick jump before icy waters plunge into the room and wash you away. Reliving this victim's past transforms the present. In fact, many of these ~mental echoes~ involve saving the victim's life, and often require a bit of trial and error as you jump into the past and figure out which actions lead to success. Try-and-try-again gameplay can be an annoyance in other games, but in Cryostasis, these conundrums take on a classic adventure-game feel with successful results. The puzzles involved aren't overly difficult, but you may need to make a few attempts to complete them without succumbing to environmental hazards, like suffocating smoke and rising water levels. Should you fail, you're transported to the present without penalty. Should you succeed, your surroundings change and usher you toward more mystery. However, Cryostasis isn't always so forgiving. You may find a lurching fiend awaiting you when you return to the present, and the best way to communicate with such flesh demons is with an axe to the head or a shotgun blast to the belly. These enemies aren't the smartest bunch, but they can inflict a lot of damage, so every shot you fire must count. This is partially because your weapons aren't built for speed; like every facet of the game, slaying your lumbering enemy is a measured affair. The axe, your close-combat mainstay, feels remarkably heavy, and the camera sways forcibly when you swing as if to reinforce that notion. Ranged weapons can be just as ponderous, often devastatingly so. Reload times are incredibly long, and the camera bob that signifies recoil with some weapons is dramatic. The sense of impact doesn't always match up with these effects, which can make combat cross the line from ~heavy~ to ~needlessly clunky.~ Nevertheless, pelting a blowtorch-wielding brute with flares and watching it panic as it burns to death is satisfying. On the other hand, trying to use the Mosin rifle and its infuriatingly blurry scope won't lead to similar glee. The occasionally awkward combat doesn't thaw the frigid tension, thankfully, and scare attempts hit more often than they miss. Some encounters are predictable, such as those that follow your haunting visits to the past. However, most of them still manage to shock, thanks to clever uses of slamming doors, scurrying beasts, and good old-fashioned surprise appearances, complete with flickering lights and high-pitched ambient chords. Far-off clatters, your character's heavy breathing and occasional wheezing, and the churning, clanging machinery juxtapose well and generate tension on a broad scale. Frequent silences make the excellent sound design even more effective by making it unpredictable, just as the tense lulls between enemy attacks make those encounters seem all the more vicious. Cryostasis is legitimately scary, because death's cold embrace seems perpetually close at hand. The flare gun isn't your best offensive tool, but it sure buys you precious time. There is limited solace to be had in the various heat sources found on the vessel. Burning torches, flaming debris, and even desk lamps not only provide visual warmth, but also let you replenish your health reserves. Your health meter is dynamic, given that it is affected both by taking damage in combat and by the chill that permeates the Arctic. Although the standard levels of cold won't kill you, they will keep your health meter practically empty, and a few short jaunts through superchilled fogs can easily be fatal. This mechanic is not only a cool idea on its own, but also enhances the tension and general sense of chilled danger, because the effects of the cold directly impact gameplay. The only drawback to this system is that every so often, it foreshadows enemy encounters, which sometimes occur shortly after you discover heating elements. As you crawl through the tight corridors, you may occasionally experience a sense of deja vu, but that's a product of the setting rather than of uncreative design. In fact, as the tale evolves, so too do the environments that you explore. Just as the frosty hallways start to wear down your resolve, Cryostasis will introduce a new area, often via a grainy mental echo that recounts the eerie events of the past before you explore the same now-decrepit environs in the present. Some of these locales are constructed well, such as a room with a large reactor that looks far different in the present than it does when you first explore it via flashback episode. But no matter which region of the ship you're traversing, you'll feel perpetually frostbitten. Flakes of frost waft down from above, undulating sheets of ice crystals cover walls and machinery, and when you're exposed to full blasts of the arctic tempest, the roar of the wind will deafen you whilst the rush of snow and ice blinds you. Pro tip: Pack a blanket. The water and ice effects are quite good, as are the lighting and shadows. Flickering lights and icy reflections set up the scares, but these touches aren't used so often that they lose their edge. Additionally, though not always perfectly smooth, good animations bring characters to life, human and nonhuman alike. Yet though the graphics engine projects the right mood, it is somewhat dated. Textures are greatly lacking in detail, and some jagged edges and blocky geometry make Cryostasis look uneven. Despite that, the graphics technology has a difficult time keeping up. The game is prone to major fits of slowdown, even on machines that greatly exceed its minimum requirements, which is a head-scratcher in a game that clearly doesn't push the limits of modern technology. We also experienced a couple of crashes, though the experience was otherwise mostly bug-free. The frame-rate difficulties usually lead to only minor annoyances, though they can be a bit more frustrating when they occur in the midst of combat. These visual issues aside, Cryostasis's measured exploration and sense of frigid tension make it an experience unlike any other. Additionally, the flashback and health-replenishment mechanics aren't just interesting on their own, but also enhance the atmosphere and give weight to the enigmatic tale as it slowly unfolds. If you need the constant stimulation of flying bullets and sprays of blood, Cryostasis: Sleep of Reason likely won't inspire you. But if you appreciate slow-burning suspense, this adventure will keep you glued to the monitor to uncover the secrets buried deep within the inhospitable tundra of the Arctic circle. The occasionally awkward combat doesn't thaw the frigid tension, thankfully, and scare attempts hit more often than they miss. Some encounters are predictable, such as those that follow your haunting visits to the past. However, most of them still manage to shock, thanks to clever uses of slamming doors, scurrying beasts, and good old-fashioned surprise appearances, complete with flickering lights and high-pitched ambient chords. Far-off clatters, your character's heavy breathing and occasional wheezing, and the churning, clanging machinery juxtapose well and generate tension on a broad scale. Frequent silences make the excellent sound design even more effective by making it unpredictable, just as the tense lulls between enemy attacks make those encounters seem all the more vicious. Cryostasis is legitimately scary, because death's cold embrace seems perpetually close at hand. The flare gun isn't your best offensive tool, but it sure buys you precious time. There is limited solace to be had in the various heat sources found on the vessel. Burning torches, flaming debris, and even desk lamps not only provide visual warmth, but also let you replenish your health reserves. Your health meter is dynamic, given that it is affected both by taking damage in combat and by the chill that permeates the Arctic. Although the standard levels of cold won't kill you, they will keep your health meter practically empty, and a few short jaunts through superchilled fogs can easily be fatal. This mechanic is not only a cool idea on its own, but also enhances the tension and general sense of chilled danger, because the effects of the cold directly impact gameplay. The only drawback to this system is that every so often, it foreshadows enemy encounters, which sometimes occur shortly after you discover heating elements. As you crawl through the tight corridors, you may occasionally experience a sense of deja vu, but that's a product of the setting rather than of uncreative design. In fact, as the tale evolves, so too do the environments that you explore. Just as the frosty hallways start to wear down your resolve, Cryostasis will introduce a new area, often via a grainy mental echo that recounts the eerie events of the past before you explore the same now-decrepit environs in the present. Some of these locales are constructed well, such as a room with a large reactor that looks far different in the present than it does when you first explore it via flashback episode. But no matter which region of the ship you're traversing, you'll feel perpetually frostbitten. Flakes of frost waft down from above, undulating sheets of ice crystals cover walls and machinery, and when you're exposed to full blasts of the arctic tempest, the roar of the wind will deafen you whilst the rush of snow and ice blinds you. Pro tip: Pack a blanket. The water and ice effects are quite good, as are the lighting and shadows. Flickering lights and icy reflections set up the scares, but these touches aren't used so often that they lose their edge. Additionally, though not always perfectly smooth, good animations bring characters to life, human and nonhuman alike. Yet though the graphics engine projects the right mood, it is somewhat dated. Textures are greatly lacking in detail, and some jagged edges and blocky geometry make Cryostasis look uneven. Despite that, the graphics technology has a difficult time keeping up. The game is prone to major fits of slowdown, even on machines that greatly exceed its minimum requirements, which is a head-scratcher in a game that clearly doesn't push the limits of modern technology. We also experienced a couple of crashes, though the experience was otherwise mostly bug-free. The frame-rate difficulties usually lead to only minor annoyances, though they can be a bit more frustrating when they occur in the midst of combat. These visual issues aside, Cryostasis's measured exploration and sense of frigid tension make it an experience unlike any other. Additionally, the flashback and health-replenishment mechanics aren't just interesting on their own, but also enhance the atmosphere and give weight to the enigmatic tale as it slowly unfolds. If you need the constant stimulation of flying bullets and sprays of blood, Cryostasis: Sleep of Reason likely won't inspire you. But if you appreciate slow-burning suspense, this adventure will keep you glued to the monitor to uncover the secrets buried deep within the inhospitable tundra of the Arctic circle."}