{"ref": "https://www.gamespot.com/reviews/roller-champions-review-keep-rollin-rollin-rollin/1900-6417889/", "date": "June 3, 2022", "game_name": "Roller Champions", "text": "Roller Champions is an intriguing mixture of sports, strengthening the already-compelling baseline of roller derby by adding in elements of basketball and Mesoamerican ball game, ulama. This unique blend is a whole lot of fun, so it's a bit of a shame that it starts to feel so samey as quickly as it does.In Roller Champions, players compete as teams of three, skating in a circular rink. Both teams fight over possession of a ball and then make as many consecutive laps as possible with it in hand, before then tossing it through a hoop to score points. If your team manages a full lap before scoring, you earn a single point, while two or three laps net you three or five points, respectively. If at any point the other team manages to get the ball away from you, it breaks the streak and you'll have to fight to get the ball back in order to break your opponent's streak and begin scoring again. The first team to reach five points (or have the most points after seven minutes) wins.It's a straightforward premise, made more engaging and complex with the variety of moves at each player's disposal on both offense and defense, including multiple ways of tackling your opponents to the ground or passing the ball to a waiting teammate. Plus, there are the in-game physics to master, which dictate how a ball might roll or bounce depending on where and how hard you throw it.It can feel a bit overwhelming at first, even with Roller Champions' mandatory tutorial, but like any real-life sport, the game becomes easier with time and practice. There's a helpful move list and practice skate park to assist in that regard.Roller Champions is not a grind to learn--roller skating is an absorbing backbone for the game, providing a sense of fantastic speed to practically every action. The mechanics tied to movement are the most approachable of the lot, so grasping the nuances tied to pumping down slopes to quickly reach your top speed and mastering how to work with your teammates to race around the rink swiftly becomes second nature. With these basics readily in hand, approaching Roller Champions' more complex maneuvers is a whole lot easier, ensuring even the most difficult moves can be grasped in just a few hours of play.This works to Roller Champions' favor in the early hours, uplifting all players to a base understanding of how this sport works within a small time frame and creating a tangible sense of improvement. But this swift accumulation of knowledge largely works against the game after that initial progression, as the intriguing learning curve flattens out almost as quickly as it shows up, making it unsatisfying. My initial excitement upon playing the game and witnessing the potential I could reach--skillfully timing dodges to dance through all three defenders and pull off a clutch pass, for example, or managing to reach the necessary height to dunk the ball through the hoop--rapidly gave way to mounting tedium when I achieved that level of skill and learned I had already encountered the game's short ceiling.This issue is exasperated by the uniformity of Roller Champions' content. Both the casual Quick Matches and competitive Ranked Matches play on the same three maps, all of which may be aesthetically different but are identical in shape. All players control the same as well, as there are no distinct positions to Roller Champions. So outside of the limited-time modes (which add considerations like making the competitions 2v2 or restricting how long each player can hold the ball), the matches in Roller Champions all play remarkably similarly--once you've got a good grasp of how the game works, you're getting the same experience over and over again.Admittedly, this uniformity ensures the playing field is always equal between teams, and also creates the agency for players to choose how they wish to approach Roller Champions. For instance, if you want to solely focus on defense--only tackling enemy players trying to steal the ball from your teammates or manning the hoop so you can jump up and block any opposing shots--you absolutely can do that. A strategy that works on one arena will work on all three given their uniform design, and since all players control the same, you never have to adapt to new mechanics.But the drawbacks this creates are far more damning. I wouldn't go so far as to call Roller Champions boring, but the sense of sameness to every match means that the game doesn't encourage that feeling of ~just one more~ that typically supports the growth and maintenance of the playerbase behind similar games. It's hard to want to play one more match after playing two or three games when matches aren't changing at the macro-level (beyond the outcome, that is) and only feel marginally different at the micro-level.That aforementioned agency to play how you want has a downside too: There's no easy way to communicate with other players within Roller Champions. This makes it tricky to comprehend what your teammates are planning in the first few minutes of a match, and even harder to know when they've decided to switch things up. Having no predetermined roles sounds great on paper, but without communicating your intent to your allies, this format actually gets in the way of your squad's teamwork more often than not, as it makes it harder to cohesively play as a well-orchestrated unit. Jumping on a mic fixes this issue, of course, but I've found that to be an ask that not many randoms want to partake in.All of which is such a shame, because there is a fun team-based sport tucked away in Roller Champions. For the first few hours, I had a great time with it--it's just that the uniformity in regards to its maps and mechanics eventually makes each match start to feel a bit samey. I can see myself picking it up every once in a while for an enjoyable bout around the rink, but there's just not enough meat to the bones of this live-service game to make it a part of my daily rotation."}