{"ref": "https://www.gamespot.com/reviews/world-soccer-winning-eleven-8-international-review/1900-6118018/", "date": "February 4, 2005", "game_name": "World Soccer Winning Eleven 8 International", "text": "Konami's Winning Eleven games have never been able to boast the official licenses and superb presentation that are such integral parts of many other sports games, and as result the series has earned its great reputation solely on the strength of its realistic gameplay. World Soccer Winning Eleven 8 International not only marks the first time that (an unfortunately limited number of) licensed club teams have appeared in a Winning Eleven game, but also the first time that the series has appeared on the Xbox. Released in Europe as Pro Evolution Soccer 4 toward the end of last year, World Soccer Winning Eleven 8 International is undoubtedly Konami's best soccer game to date, thanks to a number of quite dramatic improvements made both on and off the field. The training mode offers plenty of ways to hone your skills. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: World Soccer Winning Eleven 8 International Video Review Regardless of whether or not you're familiar with previous Winning Eleven games, the first thing you'll want to check out in Winning Eleven 8 is its surprisingly deep training mode, which, like everything else, can be reached via menu screens that are both far easier on the eyes and far easier to navigate than those found in previous entries in the series. The training options in Winning Eleven 8 are divided into four subcategories: beginner training, free training, situation training, and challenge training. Beginner training not only teaches you how to perform all the basic moves, but also does a great job of explaining the sport itself, the roles of the different players on the pitch, and even the offside rule (via a series of texts, diagrams, and demonstrations). Free training lets you take control of a team on a field where the only opponent is a goalkeeper. Situation training teaches you how to use some of the more advanced controls to make you more effective at dribbling, passing, shooting, attacking, and defending. Challenge training is basically an opportunity for you to put what you've learned to the test in a series of increasingly difficult trials. It's so rewarding that you'll want to successfully play through everything it has to offer at least once. The challenge training mode comprises no fewer than 40 different trials for you to complete, and it will test your skills in eight different disciplines: attacking, defending, dribbling, short passing, manual passing, free kick long passing, free kick shooting, and ball possession. All the challenges on offer are played using exactly the same controls and camera angles as the rest of the game, but they require you to perform very specific tasks. The dribbling challenges, for example, require you to navigate your way through mazes of cones within a time limit, while the free kick challenges have you aiming at increasingly smaller targets. Every time you beat a challenge, you'll gain access to a more difficult one, in addition to being awarded a number of ~WEN points~ to spend in the WE-Shop. WEN points are one of the many new features in Winning Eleven 8. Specifically, they can be spent to unlock additional content, such as stadiums, classic teams and players, ball types, player-edit options, camera angles, and a sixth difficulty setting. Completing the challenge training is the easiest way to amass a large number of WEN points early on, but you'll also be awarded a small number every time you play a match, regardless of the outcome. The master league career mode boasts a number of innovative features. When you're not playing Winning Eleven 8 with friends (up to seven can simultaneously play on the PlayStation 2, while three can play on the Xbox) you'll most likely be managing a team in the ~master league~ career mode, which this year introduces a host of great new features to what was already a winning formula in previous Winning Eleven games. The first thing you'll notice about the master league, before you've even chosen a team to take control of, is that you're no longer forced to manage the exact same squad of fictional no-hopers, regardless of which team you opt for. That option is still available, of course, but you can also choose to start your career in charge of a team that comprises the players you'd expect it to in real life, thus making winning games a lot easier. However, raising enough money to pay wages becomes a bit harder. Once your career gets under way, you'll find this year's master league to be an incredibly deep and engaging gameplay option in which every player on your team is in a constant state of change. The behavior of every player in Winning Eleven 8 is determined by a rating of 1-100 in no fewer than 31 different attributes, as well as by any of 23 specialized skills that each might possess. The attributes system isn't radically different from that found in previous Winning Eleven games, but what is new is the role-playing-game-style character development that every player goes through as your career progresses. At the end of every match, you'll automatically be taken to a development-sheet screen where you can see which of your players has been awarded experience points and how those points have affected any of his attributes. Every time a player accrues 100 experience points for a particular attribute, his rating for that attribute (which might be top speed, shooting accuracy, or team work, for example) will be increased by one point. Only players who actually participated in the match will be eligible for experience bonuses, and the number of points that can be received is more dependent on age than anything else. The players on your master league squad are in a constant state of change. Very young players in Winning Eleven 8 are generally less skilled than those in their primes, but they're quick to learn and can improve noticeably over the course of just one 14-game season. Older players, on the other hand, will actually start to lose skills as they near retirement age, by which time you'll hopefully have managed to sell them to other clubs. The new age and experience system works incredibly well, because whereas previous Winning Eleven games let you both build your dream team and stick with it indefinitely, Winning Eleven 8 forces you to constantly evaluate and change your squad, since retiring players are removed from the database and promising youngsters invariably replace them. Signing big-name players for your team is still very satisfying, of course, but in addition to the huge transfer fees and wages they'll invariably demand, you'll now also have to take their ages into account. As you've probably guessed, you'll be spending a fair bit of your time wheeling and dealing on the transfer market in this year's master league, which is, no doubt, why Konami went to the trouble of including player search options that put even those in some soccer management games to shame. You'll find a quick search option that automatically selects a number of players that are ready and willing to play for your team, as well as a talent search option that lets you search for 14 different ~types~ of players (such as dribblers, ace strikers, or defensive leaders). Additionally, you'll find an advanced search option that lets you narrow down your short list by fine-tuning just about every parameter imaginable. As in previous Winning Eleven games, you also have the option to look for new players to sign simply by checking out other teams' lineups, though this really isn't a very efficient use of your time. In short, finding the player that you're looking to sign really couldn't be any easier (assuming that he exists), although convincing him to play for your team is occasionally much more challenging than you'd imagine. At other times in your master league career, you'll have to make the tough decision of not playing key members of your team, either because their ~condition~ ratings are low or because they've not been rested for a number of matches and have accordingly accumulated fatigue. The condition rating in Winning Eleven 8 works the same way it did in previous games, with different-colored directional arrows used to indicate five varying player states. A player in poor condition (indicated by a blue arrow pointing down) will definitely not perform as well as he would if he was at his peak (red arrow pointing up). So, again, you're forced to constantly evaluate your players so you can alter your starting lineups accordingly. One of the more unusual options in the master league lets you ~regulate~ your entire team's condition by kicking a ball around with it for 20 seconds or so before going to a match. This results in the overall improvement of most of your less-well-conditioned players, while your better-conditioned players often drop slightly in overall gameplay performance. The master league mode can be played indefinitely, and you can, of course, pit your team against one that belongs to a friend at any time via the miracle of Memory Card. The referee's presence on the field adds very little to the game. And how would that game against your friend play out? Well, like every other match in Winning Eleven 8, it would be incredibly realistic. It's highly unlikely that you'd ever score the same goal twice, and while one of you sings the praises of the new on-the-pitch referee, the other would almost certainly be cursing him for making some poor decision or another. In truth, the referee on the field doesn't add anything significant to the game other than representing a focal point for your frustrations after a dubious offside decision or after a questionable judgment that awards a penalty or playing advantage to the opposition. Like the CPU-controlled players in Winning Eleven 8, the referee exhibits great artificial intelligence (if you can use ~referee,~ ~great,~ and ~intelligence~ in the same sentence), but since he's only human, it's not uncommon for him to make mistakes from time to time. Dubious refereeing decisions are a big part of soccer in real life, of course, so this isn't a criticism so much as an observation...and a warning. The behavior of every player in Winning Eleven 8 is determined by a rating of 1-100 in no fewer than 31 different attributes, as well as by any of 23 specialized skills that each might possess. The attributes system isn't radically different from that found in previous Winning Eleven games, but what is new is the role-playing-game-style character development that every player goes through as your career progresses. At the end of every match, you'll automatically be taken to a development-sheet screen where you can see which of your players has been awarded experience points and how those points have affected any of his attributes. Every time a player accrues 100 experience points for a particular attribute, his rating for that attribute (which might be top speed, shooting accuracy, or team work, for example) will be increased by one point. Only players who actually participated in the match will be eligible for experience bonuses, and the number of points that can be received is more dependent on age than anything else. The players on your master league squad are in a constant state of change. Very young players in Winning Eleven 8 are generally less skilled than those in their primes, but they're quick to learn and can improve noticeably over the course of just one 14-game season. Older players, on the other hand, will actually start to lose skills as they near retirement age, by which time you'll hopefully have managed to sell them to other clubs. The new age and experience system works incredibly well, because whereas previous Winning Eleven games let you both build your dream team and stick with it indefinitely, Winning Eleven 8 forces you to constantly evaluate and change your squad, since retiring players are removed from the database and promising youngsters invariably replace them. Signing big-name players for your team is still very satisfying, of course, but in addition to the huge transfer fees and wages they'll invariably demand, you'll now also have to take their ages into account. As you've probably guessed, you'll be spending a fair bit of your time wheeling and dealing on the transfer market in this year's master league, which is, no doubt, why Konami went to the trouble of including player search options that put even those in some soccer management games to shame. You'll find a quick search option that automatically selects a number of players that are ready and willing to play for your team, as well as a talent search option that lets you search for 14 different ~types~ of players (such as dribblers, ace strikers, or defensive leaders). Additionally, you'll find an advanced search option that lets you narrow down your short list by fine-tuning just about every parameter imaginable. As in previous Winning Eleven games, you also have the option to look for new players to sign simply by checking out other teams' lineups, though this really isn't a very efficient use of your time. In short, finding the player that you're looking to sign really couldn't be any easier (assuming that he exists), although convincing him to play for your team is occasionally much more challenging than you'd imagine. At other times in your master league career, you'll have to make the tough decision of not playing key members of your team, either because their ~condition~ ratings are low or because they've not been rested for a number of matches and have accordingly accumulated fatigue. The condition rating in Winning Eleven 8 works the same way it did in previous games, with different-colored directional arrows used to indicate five varying player states. A player in poor condition (indicated by a blue arrow pointing down) will definitely not perform as well as he would if he was at his peak (red arrow pointing up). So, again, you're forced to constantly evaluate your players so you can alter your starting lineups accordingly. One of the more unusual options in the master league lets you ~regulate~ your entire team's condition by kicking a ball around with it for 20 seconds or so before going to a match. This results in the overall improvement of most of your less-well-conditioned players, while your better-conditioned players often drop slightly in overall gameplay performance. The master league mode can be played indefinitely, and you can, of course, pit your team against one that belongs to a friend at any time via the miracle of Memory Card. The referee's presence on the field adds very little to the game. And how would that game against your friend play out? Well, like every other match in Winning Eleven 8, it would be incredibly realistic. It's highly unlikely that you'd ever score the same goal twice, and while one of you sings the praises of the new on-the-pitch referee, the other would almost certainly be cursing him for making some poor decision or another. In truth, the referee on the field doesn't add anything significant to the game other than representing a focal point for your frustrations after a dubious offside decision or after a questionable judgment that awards a penalty or playing advantage to the opposition. Like the CPU-controlled players in Winning Eleven 8, the referee exhibits great artificial intelligence (if you can use ~referee,~ ~great,~ and ~intelligence~ in the same sentence), but since he's only human, it's not uncommon for him to make mistakes from time to time. Dubious refereeing decisions are a big part of soccer in real life, of course, so this isn't a criticism so much as an observation...and a warning. Perhaps the best thing about Winning Eleven 8 is that it's not a difficult game to pick up and play, particularly if your pride doesn't prevent you from playing at one of the easier difficulty settings. However, it should also offer a lasting challenge for even the most experienced players among you. Some of the advanced controls listed in the instruction manual, for example, will undoubtedly come as news even to many of you who spent a lot of time with Winning Eleven 7. We should also point out that Winning Eleven 8 is the first game in the series to feature licensed teams. Although the teams from the Dutch, Italian, and Spanish leagues collectively look great and certainly represent a collective step in the right direction for the series, they also serve to highlight just how generic the remaining 80 club sides and 50 international teams look. With that said, Winning Eleven 8 does boast some adequate editing tools with which you can quite easily add more-realistic uniforms, badges, player likenesses, and more...if you're so inclined. Most of the players in the game are instantly recognizable. Most of the default player likenesses in Winning Eleven 8 are very good, in fact, as are the re-creations of famous stadiums from around the world. These stadiums, despite presenting false names, are instantly recognizable and can be given their real-life names just as easily as players like Wales' Ryan Gils, who, strangely, also appears under the correct name of Giggs for Manchester United. (sorry, Man Red) It's unfortunate licensing issues have manifested themselves in such messy, evident manners in team and player rosters for Winning Eleven 8, but these issues are nothing that those of you who are familiar with the series aren't used to, and it's certainly not reason enough for any of you to ignore the best soccer game available for any current-generation console. More impressive than the stadium re-creations and player likenesses in Winning Eleven 8 are the way they come to life when a match gets under way. The player animations are superb, the ball physics are as believable as always, and even the crowds look good, so long as the cameras keep their distances from them. The visual differences between the PlayStation 2 and Xbox versions aren't significant, although the Xbox game's player models are a little more detailed. We also noticed that the PS2 game suffered from drops in frame rate occasionally, though these were extremely rare and were limited to those occasions when practically every player on the field was in the active shot. The only other noticeable difference between the PS2 and Xbox versions of Winning Eleven 8 (besides the aforementioned numbers of players supported on a single screen) is that the loading times in the Xbox game are a lot quicker, which is particularly apparent when matches between CPU-controlled teams are being played out in the master league mode or during custom cup and league competitions. Despite the fact that most of the differences between the two games favor the Xbox version, we'd definitely choose to play the PS2 version for its controls. It's not that the PS2 controller is inherently better than its Xbox counterpart, it's just that Winning Eleven 8 puts all four shoulder buttons to good use when you want to sidestep other players or when you want to alter your team's playing style on the fly. Accomplishing either of those things on the Xbox means using the poorly positioned (regardless of which official controller model you're using) black and white buttons. If there's one area in which Winning Eleven 8 definitely comes second to FIFA Soccer 2005, it's audio. The game's soundtrack comprises just two or three instantly forgettable and mind-numbingly repetitive variations of the same tune, and the crowd noise, while varied, doesn't always seem to relate to the action on the field. BBC soccer pundits Peter Brackley and Trevor Brooking do a good job reprising their roles in the commentary box, and although they're prone to repeating themselves, their observations are generally accurate. Eat my goal! So there you have it. World Soccer Winning Eleven 8 International is KCET's best soccer game to date, which basically makes it the best soccer game ever made...even taking the seminal Sensible World of Soccer games on the Amiga into account. The competition between KCET and EA Sports is now closer than ever, and which of this season's games you choose to play will ultimately be determined by what you're looking for from a soccer offering. If online play and official licenses are high on your wish list, then FIFA Soccer 2005 is the only way to go. If you can manage to play without those features and are looking for the most realistic soccer game available, in addition to an all-consuming career mode that you can play when your friends aren't around, then Winning Eleven 8 is definitely the game for you. Perhaps the best thing about Winning Eleven 8 is that it's not a difficult game to pick up and play, particularly if your pride doesn't prevent you from playing at one of the easier difficulty settings. However, it should also offer a lasting challenge for even the most experienced players among you. Some of the advanced controls listed in the instruction manual, for example, will undoubtedly come as news even to many of you who spent a lot of time with Winning Eleven 7. We should also point out that Winning Eleven 8 is the first game in the series to feature licensed teams. Although the teams from the Dutch, Italian, and Spanish leagues collectively look great and certainly represent a collective step in the right direction for the series, they also serve to highlight just how generic the remaining 80 club sides and 50 international teams look. With that said, Winning Eleven 8 does boast some adequate editing tools with which you can quite easily add more-realistic uniforms, badges, player likenesses, and more...if you're so inclined. Most of the players in the game are instantly recognizable. Most of the default player likenesses in Winning Eleven 8 are very good, in fact, as are the re-creations of famous stadiums from around the world. These stadiums, despite presenting false names, are instantly recognizable and can be given their real-life names just as easily as players like Wales' Ryan Gils, who, strangely, also appears under the correct name of Giggs for Manchester United. (sorry, Man Red) It's unfortunate licensing issues have manifested themselves in such messy, evident manners in team and player rosters for Winning Eleven 8, but these issues are nothing that those of you who are familiar with the series aren't used to, and it's certainly not reason enough for any of you to ignore the best soccer game available for any current-generation console. More impressive than the stadium re-creations and player likenesses in Winning Eleven 8 are the way they come to life when a match gets under way. The player animations are superb, the ball physics are as believable as always, and even the crowds look good, so long as the cameras keep their distances from them. The visual differences between the PlayStation 2 and Xbox versions aren't significant, although the Xbox game's player models are a little more detailed. We also noticed that the PS2 game suffered from drops in frame rate occasionally, though these were extremely rare and were limited to those occasions when practically every player on the field was in the active shot. The only other noticeable difference between the PS2 and Xbox versions of Winning Eleven 8 (besides the aforementioned numbers of players supported on a single screen) is that the loading times in the Xbox game are a lot quicker, which is particularly apparent when matches between CPU-controlled teams are being played out in the master league mode or during custom cup and league competitions. Despite the fact that most of the differences between the two games favor the Xbox version, we'd definitely choose to play the PS2 version for its controls. It's not that the PS2 controller is inherently better than its Xbox counterpart, it's just that Winning Eleven 8 puts all four shoulder buttons to good use when you want to sidestep other players or when you want to alter your team's playing style on the fly. Accomplishing either of those things on the Xbox means using the poorly positioned (regardless of which official controller model you're using) black and white buttons. If there's one area in which Winning Eleven 8 definitely comes second to FIFA Soccer 2005, it's audio. The game's soundtrack comprises just two or three instantly forgettable and mind-numbingly repetitive variations of the same tune, and the crowd noise, while varied, doesn't always seem to relate to the action on the field. BBC soccer pundits Peter Brackley and Trevor Brooking do a good job reprising their roles in the commentary box, and although they're prone to repeating themselves, their observations are generally accurate. Eat my goal! So there you have it. World Soccer Winning Eleven 8 International is KCET's best soccer game to date, which basically makes it the best soccer game ever made...even taking the seminal Sensible World of Soccer games on the Amiga into account. The competition between KCET and EA Sports is now closer than ever, and which of this season's games you choose to play will ultimately be determined by what you're looking for from a soccer offering. If online play and official licenses are high on your wish list, then FIFA Soccer 2005 is the only way to go. If you can manage to play without those features and are looking for the most realistic soccer game available, in addition to an all-consuming career mode that you can play when your friends aren't around, then Winning Eleven 8 is definitely the game for you."}