{"ref": "https://www.gamespot.com/reviews/land-of-the-dead-road-to-fiddlers-green-review/1900-6140997/", "date": "December 11, 2007", "game_name": "Land of the Dead: Road to Fiddler's Green", "text": "There is an almost pseudo-brilliance to the sheer awfulness of Land of the Dead: Road to Fiddler's Green. Loosely based within the same universe as zombie pioneer George Romero's Land of the Dead film from earlier this year, Road to Fiddler's Green isn't just content to be another completely unplayable movie-to-game translation. It's almost as though the developers wanted to capture the essence of the zombie through each and every aspect of the game. It feels like it was once a regular, workaday, full-featured Xbox game that was horribly murdered by zombies, and then resurrected into a shambled, decrepit, undead version of its former self. Every component of this game is slow to react, dumb as a doornail, and basically broken. It shuffles along at a sluggish, depressing pace while pieces of it literally fall apart at the seams. And the only thing going through its figurative mind is the unquenchable instinct to attack and feed on your free time and money. This is either one of the most avant-garde pieces of gaming artistry to ever find its way to the retail market, or the absolute worst game of the year. Actually, it's probably just the latter. The ethos of zombie culture dictates that zombies should roll deep, and violently attack and eat living people with reckless abandon. Apparently someone forgot to clue in the developers of Land of the Dead to these key facts. The protagonist of this hapless zombie tale is Jack, a regular country bumpkin thrust into the role of zombie vanquisher extraordinaire when a slightly ripe-looking stranger happens upon his doorstep. When this stranger turns out to be a brain-hungry zombie, Jack is sent fleeing around his property, looking for guns, ammunition, and, of all things, his keys. Clearly panic-stricken, Jack then finds himself neck-deep in zombie action, with mildly threatening corpses flocking onto his meager farm. He takes off to a neighbor's property, by way of a completely insane haystack maze and a badly textured cornfield, only to find--yes, you guessed it--more zombies! Perhaps you can see where all this is going. Wondering where the film tie-in comes into play? Well you do eventually find yourself in the guarded city of the scant few living humans remaining on the planet, which is featured prominently in the movie. But before you can get there, you'll have to travel through a slew of horrendous-looking environments, navigate terrible level designs, and shoot a never-ending army of the stupidest zombies you will ever encounter. Stupid zombies? How is that even possible? Zombies are, after all, lumbering dimwits by nature, driven purely by the instinct to feed and with no real form of intelligence. However, the whole point of the Land of the Dead movie is that the zombies are slowly evolving into a more organized society of the undead. They're supposed to be smart zombies. But let's forget that fact for the moment, and just understand there are rules that govern zombie fiction at large. In just about every form of zombie anything you'll ever see, the creatures are largely aggressive toward any creature with living flesh, and they tend to travel in overwhelming packs. Save for very rare instances, you will see no such behavior in this game. Oh sure, they'll attack, but it's an absolute rarity to find yourself in a situation where you're overmatched. The zombies have one or two really lame attacks, which can be quite easily avoided if you're not completely surrounded. And even when you are, all you need to do is run and find a piece of the scenery that the zombies just aren't smart enough to circumvent--you know, like an open doorway, or a pile of garbage that sits maybe two or three feet high. And this is all assuming the zombies even come after you in the first place. Half the time, they're content to just stand completely still, dumbfounded as you pick them off from silly distances. To make matters worse, the game completely destroys any measure of satisfaction you might get from offing these bloodthirsty creatures by making the combat a complete and utter bore. The game tries to create some measure of tension by severely limiting the amount of ammunition you can pick up, leaving you to fight off the zombies with shovels, golf clubs, baseball bats, and fire axes. Yet somehow, the action of slamming a blunt object into a zombie's brittle body is just screwed up. There are both weak and strong melee attacks, and the weak attacks are completely useless. You can sit there whacking away at a zombie, and half the time it won't even react to the shots it has taken, leaving you completely vulnerable. That is one sweet-looking cornfield. And by sweet, we mean awful. So, you're stuck using strong attacks at all times. The trouble is, these strong attacks look completely stupid. When you're using a shovel, you look like you're giving the zombie a firm poke--a fact made even more hilarious by the overexaggerated animation of a zombie flying backward from the attack. Every time you use a hammer, you see Jack flip it around to the claw side to make his strong swipe. For the love of god, why can't he just leave the hammer on its claw side? And somehow, someway, the act of chopping hard at a zombie with an axe is done so flatly, so devoid of satisfaction, that it's barely even worth using the weapon, given how long it takes to wind up for the hit. Gunplay is even worse. There's a decent variety of weapons, but there is just no predictability to their effectiveness. The game purports to use some manner of location-specific damage model, but it's also completely broken. Shoot a zombie in the chest, and his head will magically explode. Shoot another one in the chest, and it will react like it just took a shot to the shin. Shoot yet another's arm off, and it won't even flinch. Sometimes you have to shoot a zombie seven times in the head to bring it down. Other times, two shots to the legs will kill it. There's just no rhyme or reason to any of it. Adding further insult to injury, Land of the Dead constantly sabotages itself with predictable and insipid level designs. The game constantly tries to force a reaction out of you by having zombies appear out of nowhere. But that's the problem...they literally appear out of nowhere. They'll either just blink in and out of thin air, or they'll drop in from some magical point in the ceiling. And even when you don't see them appear from some magically distant dimension, the game waves a big, bright flag to let you know zombies are coming around the corner by hitching up the frame rate for up to a full second every single time enemies are being loaded into the level. Talk about defeating the tension It's just not scary. It's not scary like it should be, Jack. Believe it or not, Land of the Dead actually offers a full multiplayer mode for system link and Xbox Live play. But what's even harder to believe is that it's just as awful as the single-player experience. You have deathmatch and co-op modes available, and both are lousy for different reasons. The deathmatches take place in zombie-infested levels, so you're fighting your opponents and zombies at the same time. OK, that sounds all well and good, except that the maps all completely suck and lag frequently gets in the way of your ability to properly shoot anybody or anything. The co-op missions we played seemed to suffer from this the most. Zombies would dart around the level in indecipherable patterns and sometimes even spawn right on top of us, making it impossible to even get a shot off before we were eaten alive. Fun? Hardly. Land of the Dead is also one of the worst-looking Xbox games there is. The whole thing is like some kind of time warp back into late-'90s PC gaming, with nasty textures, bland and overly angular environmental designs, and zombies that look a lot more blurry than scary. Sure, they're all mangled to death, missing jaws, intestines, and basically leaking blood all over themselves, but the only reason you know that it's even blood is because of the preconceived notion of this being a horror game. If you just looked at these poor schlubs from a distance, they look as though they might have been in a very messy pie-eating contest, and simply have a bad skin complexion, or something. And then there's the severely damaged rag-doll physics that pop up every time you kill a zombie. They'll flop to the ground in an ultraexaggerated fashion, but then they'll also start gyrating and twitching freakily for up to a minute at a time before they simply vanish from sight, like they're being electrocuted. Save for the moments where the game completely freezes every time a zombie loads up, the frame rate does mostly hold up. But it would be real, real difficult for it not to with graphics that look this ancient. Uh, ma'am? Would you like a napkin or something? You've got some tomato sauce or something all over your...ah jeez... Mentioning Land of the Dead's abysmal audio almost seems like it would be giving it too much credit. Zombies have about two or three distinct grunts and gurgling sounds, all of which seem forced or overwrought. Jack talks like a man reading a script very, very poorly. The weapon effects are generic and flat. And the music, if you even want to call it that, consists of a four-measure loop of grating unpleasantness that changes to a different four-measure loop of grating unpleasantness as you jump to each new level. If ever there were a game that demanded a mute button, this is the one. The most insane thing about Land of the Dead: Road to Fiddler's Green is that it doesn't feel like the kind of rushed, hack-job piece of work that often comes from movie licenses. Considering the fairly lengthy single-player game, the fact that there's a complete multiplayer mode that's Xbox Live-enabled, and that the game supports things like Dolby Digital sound and a 480p resolution, it's very clear that a group of people actually put time and effort into this unadulterated train wreck of a game. And that's just depressing on so many levels. Regardless of whatever effort was sunk into this fool's errand, Land of the Dead is far and away one of the most atrocious gaming experiences to be found on the Xbox. And like the zombies contained within, it should be shot, burned, stabbed, or otherwise slaughtered until there's no possible way for it to harm anyone again. Seriously, don't play this game. Adding further insult to injury, Land of the Dead constantly sabotages itself with predictable and insipid level designs. The game constantly tries to force a reaction out of you by having zombies appear out of nowhere. But that's the problem...they literally appear out of nowhere. They'll either just blink in and out of thin air, or they'll drop in from some magical point in the ceiling. And even when you don't see them appear from some magically distant dimension, the game waves a big, bright flag to let you know zombies are coming around the corner by hitching up the frame rate for up to a full second every single time enemies are being loaded into the level. Talk about defeating the tension It's just not scary. It's not scary like it should be, Jack. Believe it or not, Land of the Dead actually offers a full multiplayer mode for system link and Xbox Live play. But what's even harder to believe is that it's just as awful as the single-player experience. You have deathmatch and co-op modes available, and both are lousy for different reasons. The deathmatches take place in zombie-infested levels, so you're fighting your opponents and zombies at the same time. OK, that sounds all well and good, except that the maps all completely suck and lag frequently gets in the way of your ability to properly shoot anybody or anything. The co-op missions we played seemed to suffer from this the most. Zombies would dart around the level in indecipherable patterns and sometimes even spawn right on top of us, making it impossible to even get a shot off before we were eaten alive. Fun? Hardly. Land of the Dead is also one of the worst-looking Xbox games there is. The whole thing is like some kind of time warp back into late-'90s PC gaming, with nasty textures, bland and overly angular environmental designs, and zombies that look a lot more blurry than scary. Sure, they're all mangled to death, missing jaws, intestines, and basically leaking blood all over themselves, but the only reason you know that it's even blood is because of the preconceived notion of this being a horror game. If you just looked at these poor schlubs from a distance, they look as though they might have been in a very messy pie-eating contest, and simply have a bad skin complexion, or something. And then there's the severely damaged rag-doll physics that pop up every time you kill a zombie. They'll flop to the ground in an ultraexaggerated fashion, but then they'll also start gyrating and twitching freakily for up to a minute at a time before they simply vanish from sight, like they're being electrocuted. Save for the moments where the game completely freezes every time a zombie loads up, the frame rate does mostly hold up. But it would be real, real difficult for it not to with graphics that look this ancient. Uh, ma'am? Would you like a napkin or something? You've got some tomato sauce or something all over your...ah jeez... Mentioning Land of the Dead's abysmal audio almost seems like it would be giving it too much credit. Zombies have about two or three distinct grunts and gurgling sounds, all of which seem forced or overwrought. Jack talks like a man reading a script very, very poorly. The weapon effects are generic and flat. And the music, if you even want to call it that, consists of a four-measure loop of grating unpleasantness that changes to a different four-measure loop of grating unpleasantness as you jump to each new level. If ever there were a game that demanded a mute button, this is the one. The most insane thing about Land of the Dead: Road to Fiddler's Green is that it doesn't feel like the kind of rushed, hack-job piece of work that often comes from movie licenses. Considering the fairly lengthy single-player game, the fact that there's a complete multiplayer mode that's Xbox Live-enabled, and that the game supports things like Dolby Digital sound and a 480p resolution, it's very clear that a group of people actually put time and effort into this unadulterated train wreck of a game. And that's just depressing on so many levels. Regardless of whatever effort was sunk into this fool's errand, Land of the Dead is far and away one of the most atrocious gaming experiences to be found on the Xbox. And like the zombies contained within, it should be shot, burned, stabbed, or otherwise slaughtered until there's no possible way for it to harm anyone again. Seriously, don't play this game."}