{"ref": "https://www.gamespot.com/reviews/excitebike-64-review/1900-2569925/", "date": "May 17, 2006", "game_name": "Excitebike 64", "text": "In 1984, the gaming industry was all but dead, in shambles after a war waged by Coleco, Atari, and Intellivision. In 1985, Nintendo released the NES, and with the help of Mario and Zelda it reinvigorated the industry. One title released during that time was a side-scrolling motorcycle game titled Excitebike, which featured simplistic and addicting gameplay and a plethora of unique courses. Simply put, Excitebike was a class A title with a reputation that remained untouched for 15 years. Now though, the franchise is seeing its rebirth in the 3D dirt-bike extravaganza, Excitebike 64. Nintendo delivers with a 20-track season mode, a 17-track tutorial, a variety of exhibition and time-trial modes, and a level editor. If you have the guts to finish all that, then you can take on the special tracks, an assortment of quirky side games - such as a bonfire-filled desert course, the stunt competition, a game of motorbike soccer, or the hill climb. If that weren't enough, you can also unlock the original Excitebike. Yes indeed, all of the unadulterated gameplay and panache of the NES Excitebike is yours for the taking - provided you finish the season-mode tutorial - and the track editor even lets you save your tracks in the NES game, a feature that wasn't available in the US version of the original. Ultimately, the greatest fear with the announcement of Excitebike 64 was that it would be a derivative rehash of modern cycle racers. Such is not the case, as the game plays like a dream. You can choose from one of six riders, each with his own handling characteristics. Controlling is deceptively simple, with the analog or D-pad aiming the bike, A and B for acceleration/deceleration, R for sliding, and Z for that much-needed turbo boost. Just as in the original, holding down gives you more air on jumps, while holding up aims your front wheel forward to enable landing on slopes. Since each course gives way to another that's more twisty and bumpy than the last, you'll either be powersliding with the best of them or reveling in the accolades of fifth place by the sixth or seventh novice track. As evidenced by the midair steering and hover-happy physics, the game isn't meant to be a motorbiking simulation, but the inherent gameplay is so reminiscent of classic Excitebike that such a goal would prove fruitless anyway. When you take an old-school game and rework it as a modern-day dirtbike title, some aspects are bound to fail. In Excitebike 64, the computer AI and collision mechanics are the culprits. CPU bikers race with sickeningly predictable precision, becoming suspiciously expert as each race progresses in such a way that preprogrammed season length, as opposed to skill building, is what obviously contributes to their success. The collision detection doesn't help either. Sometimes you'll spin out or crash against a minor obstacle or bump, but then you'll blow past the same hindrance the next lap. Colliding with the back tires of CPU opponents is a poor idea, but what makes it even worse is that you don't always spin out. Sure, you can return the favor, but for every CPU opponent you derail, the rest will artificially pick up the slack. Frankly though, the game feels just as joyous as the original Excitebike, so poor collision detection and shady AI aside, it's hard to stop playing the game. Visually, Excitebike 64 looks awesome, with dirt and mud flying from the waterlogged muck. Whether you're playing as Jumpin' Jim Rivers or Sarah Sugar Hill, the rider undulates and animates as if he or she is really a 150-pound human being bandied about by high-speed motorbikes. Be it flowing rivers, lens flares, falling leaves, or blowing exhaust, the visuals in the game are gussied up in ways that could make even Hugh Hefner ogle. Furthermore, the painful poses that result from crashes and spinouts are enough to trigger sympathetic crotch pain in even the strongest of humans. Unfortunately, the frame rate could be better, as the action jitters and juts from 30 to 24 to 15 frames and anywhere in between. Lens flares slow things down, jumps speed the game up, and driving in the pack sometimes results in a choppy mess. The slowdown isn't damaging to the quality of a game as a whole, but it is quite noticeable. After nitpicking the game's features, gameplay, and visuals, it is a nice change of pace to say that the game's sound is just short of perfect. More announcer snippets and music would have been nice, but what's present is crisp and clear, and it benefits the game greatly. The announcer'ssayings, from ~Jim Rivers eats dirt!~ to ~Sarah Hill takes the lead!~ give the game a comedic sense of realism akin to Sunday afternoon monster-truck rallies. In most N64 racing titles, sound effects sound tinny and ill spaced, but Excitebike 64 breaks this mold with jarring crashes and a plethora of realistic motorcycle sounds. Almost an afterthought, background music is standard fare, but it's not maliciously poor. The real issue when it comes to sound is one of ambience, and Excitebike 64 finds the mark in almost every way, except variety. All told, Excitebike 64 is an excellent rebirth of the Excitebike franchise. The gameplay is arcade-like, but it is also deep and varied in that well-known Nintendo way. The visuals aren't perfect, but they are stunning nonetheless. Most importantly, the game is both fun and addicting, giving oldsters and youngsters alike a chance to revel in the glory that is Excitebike. Some will cry about the frame rate, and some will wish the game featured real riders, but even these woes are forgotten when the game itself is so scrumptious."}