{"ref": "https://www.gamespot.com/reviews/gish-review/1900-6109960/", "date": "October 7, 2004", "game_name": "Gish", "text": "What an awesome little game! Gish more or less epitomizes everything that independently produced, budget-priced titles should aspire to. Rather than making a dull, no-frills copy of a popular game, Chronic Logic has taken a well-worn genre--the 2D side-scrolling platformer--and used it as the launching pad for some exuberant and largely successful experimentation. Here's a nice example of the physics, lighting, and stylized character design. There's nothing experimental about the game's structure. It's a traditional platformer in which you'll jump, run, and swim through a series of increasingly complex scrolling environments while conking enemies on the head with your butt. There are times to beat, extra lives to earn, coins to collect, and secrets to unlock (including some extra levels that act as funny tributes to 8-bit classics such as Super Mario Bros. and Pitfall). In what might be the ultimate homage to video games in general, you're even on a quest to rescue your girlfriend. The unorthodox element of the game involves the way in which your character interacts with the environments. You play as a charismatic gelatinous blob of tar called Gish. You can glide across the ground, jump, and make yourself slippery so that you can flow through tight spaces. Moreover, you can become rigid, thus giving yourself more weight. You can also extrude a series of small hooks that let you scale both walls and ceilings, in addition to letting you grip and move objects. What makes all of this so interesting is the game's fully realized physics system. Gish flows across and is deformed by objects in an utterly believable, unique, and satisfying way. Jump height is affected by how compressed Gish is at the start of a leap, while maximum compression is achieved by falling from a great height, which makes successful high jumping a matter of rhythmically timed bounces. Objects in the world are governed by the physics system as well. For instance, seesawlike platforms can be controlled by Gish's varying weight, pendulums can be ridden and made to swing, and cinder blocks can be gripped in Gish's spikes--and they can then be rotated around his body and subsequently flung into the air. The game presents you with all the elements of a traditional platforming environment, and then it gives you a completely new and entertaining set of tools with which to tackle them. The game's visuals are simple but stylized. Everything's drawn in a unique manner that gives Gish plenty of cartoony character. There's also a nice lighting engine that complements the physics. For instance, crumbling walls will often unleash multiple streams of light. Other than what might be the best ~secret discovered~ noise in game history, the sound effects aren't particularly notable. The soundtrack, on the other hand, is great. It's composed of an eclectic mix of Residents-style creepy carnival music, marching tunes, and an oddball mixture of chunky guitar licks and chanting. There are even some riffs on themes from classic platformers. Here's an homage to Mario. The game features a 34-level story mode that comes complete with five boss battles, 23 ~collection~ levels (in which you must grab as many coins as you can within a given time limit), and at least four secret bonus levels. There's also a set of six two-player modes that milk the Gish concept for all it's worth. These modes include such activities as tar blob drag racing, moving a football across a field, and a variation on logrolling wherein each player attempts to maneuver the other off of a seesawlike platform. The only drawback is that both players need to be at the same computer, because Internet and LAN connectivity is not supported. ~Physics~ is quickly gaining currency as the newest ~must-have~ game industry buzzword. Gish is one of those rare games that actually manages to integrate realistic physics into its gameplay in a way that's both meaningful and, more importantly, enjoyable. That it does this with humor and style, and without the benefit of a large budget, is a small miracle."}