{"ref": "https://www.gamespot.com/reviews/chrome-specforce-review/1900-6142761/", "date": "January 23, 2006", "game_name": "Chrome SpecForce", "text": "Like sci-fi movies, futuristic shooters tend to be hit or miss. For every Total Recall there's a Battlefield Earth, and for every Halo there's a Starship Troopers. Chrome SpecForce is neither a hit nor a miss, because while it manages to avoid going terribly awry, it also avoids any sort of fun or excitement. SpecForce falls smack in the middle of mediocrity, and it seems that every good idea or interesting gameplay mechanic is countered by an underwhelming or annoying design flaw. Bolt Logan is back to save the world once again in Chrome SpecForce. Chrome SpecForce is the follow-up to 2003's Chrome, and in SpecForce you once again play as the awesomely named Bolt Logan, who is a member of the elite SpecForce soldiers. The story is fairly transparent, and since there are no cutscenes to move it along, most of the plot information you receive comes from some brief text on the loading screen before each mission. Apparently there's some sort of conflict going down on the planet of Estrella, and the SpecForce has been commissioned to take care of it. Eventually you learn that a huge, insidious corporation is training supersoldiers and threatening the very existence of the planet. Bolt Logan and the SpecForce soldiers have to save the day by trudging through jungles and military bases to hack computers, blow up key structures, save prisoners, and so on. As clich as the missions are, they're at least somewhat varied. While you spend most of the game on foot, running around and shooting enemies, there are times when you have to hop on a speeder bike, pilot a huge mech, or man a turret to fend off aerial attacks. The vehicles are generic, but they work well to break up the monotony of the rest of the game. In addition to piloting vehicles and shooting, you occasionally have to hack a computer system to unlock a door, upload a crippling virus, or retrieve some information. This whole hacking thing plays out like a simple game of memory, where you reveal tiles and match like shapes to eventually clear the board. These sections are laughably easy, to the point that it makes the minigame seem like pointless busy work. The rest of the game is spent on foot, engaging in firefights with the same few enemies over and over. And while there's nothing especially wrong with that, the shooting in SpecForce is just boring and tedious. For one thing, the weapons are all so weak that they just aren't fun to use. They are all pretty standard: there's a 9mm pistol, an assault rifle, shotgun, rocket launcher, grenades, and a few others. The guns all feel completely anemic in terms of firepower. The weapon sounds are thin and lack some much-needed kick, they don't look particularly menacing, and it often takes an inordinate amount of shots to take down an enemy. Another problem is that there's no sense of range with any of the guns. You can snipe enemies from hundreds of yards away just using your assault rifle. As a result, you can just about play through the entire game without ever bothering to pick up any other weapons. And, you won't want to bother with other weapons because the inventory system is so annoying and cumbersome. SpecForce uses the same inventory system as the previous Chrome game. You can search the corpses of the people you kill to get items, and when you do so it brings up your inventory screen. The inventory screen looks a lot like one from a role-playing game, with a grid that you have to fit all of your equipment into. Your inventory space isn't very large, so it isn't practical to carry more than one gun. But, as we mentioned previously, it isn't a problem, because the standard assault rifle is about the most useful weapon in the game anyway. This inventory management just feels out of place and unnecessary in a shooter, and you'll quickly get tired of the hassle. Another problem with the combat in SpecOps is that the enemy artificial intelligence feels cheap. As soon as you step around a corner, regardless of how hidden you are by the surrounding foliage, you'll get hit immediately. The enemies maintain their posts behind the carefully arranged cover and wait for you to advance. Your best option is to try to snipe the enemies with your assault rifle, or take a few shots and hope the enemy goes down before you do. On the other hand, the AI of the characters on your side is completely moronic. You might be engaged in a heated exchange of firepower, only to have one of your allies walk right in front of you and get wasted immediately. Or, one of your fellow soldiers might walk right up to a dinosaur (yeah, a dinosaur) and stand there getting his skull gnawed without doing anything to defend himself. While you'll hopefully play a bit smarter than your allies, you're still just as weak. Even on medium difficulty you'll die often, because it only takes a couple shots to take you down and there's no body armor to pick up. Luckily, health packs are plentiful, and you can carry around a large stash to keep yourself healthy. You can also save at any time, so even if you do die over and over again, you can just reload your last save and try again. You do have a few special moves at your disposal, but they're mostly useless. Your power armor has four special functions that you can activate as long as your boost gauge is at least partially full. There are power shields, which make you take less damage; motive support, which makes you run slightly faster; camouflage, which makes you invisible; and neural boost, which acts just like slow motion. The speed boost is occasionally helpful, but for the most part these special functions are completely useless. The camouflage rarely works, because even when cloaked, enemies can usually see you and will immediately start shooting at you. The neural boost is pointless, because it just slows everything down, including you. Since the enemies shoot you with pinpoint accuracy, the improved reaction time you might get from the slow motion does nothing to help you out in a fight. The power shields might help, but health packs are more effective at keeping you alive, and they're so plentiful and quick to use that there's no reason not to use them frequently. This game is drawn further from the brink of fun by an outdated and underwhelming presentation. Some of the outdoor levels are quite large and full of foliage, which is great, but none of it looks very good. Ground foliage is all two dimensional, giving the plants the look of a bunch of cardboard cutouts. Textures are blurry and dull, and the weapon models are generic. As you run, the animation makes it look like you're floating along just above the ground, and Bolt's arm looks like a flimsy cutout that has been pasted to the bottom of the screen. There are also some really goofy-looking rag dolls that defy gravity and clip through walls and objects. On top of all that, we noticed some slowdown a few times when the action got heated. The sound is no better in SpecForce. The weapon sounds are all way too weak, and other sound effects, like explosions, do nothing to punctuate the action on the screen. There are some voices to listen to, and while they aren't the worst you'll hear, the delivery is rather lifeless most of the time. The music is almost nonexistent, and it only occasionally picks up for a few seconds before fading away again. What is there sounds good enough, but it's just too subdued to be noteworthy. Who needs a bulky sniper rifle when you can pick guys off from across the map using your standard assault rifle? Chrome SpecForce has some good ideas, and if you can get past the dated presentation and dull gunplay, you might actually enjoy its sci-fi world. If you do manage to keep playing, the game will keep you busy for 8 or 10 hours in the single-player campaign. There's also support for 16-player games via the Internet or a LAN, with a handful of maps and the standard game types, including capture the flag, deathmatch, and king of the hill. Don't get too excited, though, because chances are you'll have a hard time finding anyone to play against online. Still, if you absolutely can't get enough sci-fi action, then you might find something to enjoy in SpecForce. But those few shining moments will quickly fade away, leaving behind a generic, mediocre shooter."}