{"ref": "https://www.gamespot.com/reviews/the-banner-saga-2-review/1900-6416411/", "date": "April 19, 2016", "game_name": "The Banner Saga 2", "text": "The Banner Saga 2 begins at Chapter 8 and ends just as its engrossing plot begins to reach a tipping point. It feels like the central portion of an epic novel, torn straight from the binding. Its a game that looks and feels practically identical to its predecessor released two years prior, but the attractiveness of its presentation--inspired by 1960s Disney-style animation--and the refined combat system still stand strong, giving it an air of timelessness. The Banner Saga 2 presents a grand mythological odyssey and effectively conveys the hardships of the characters enduring it.However, this is not the ideal point to enter the series. The Banner Saga 2s mechanics, its layers of consequential decision-making, strategic management, and tactical turn-based combat are enjoyable within the confined context of this sequel, but the narrative events of The Banner Saga are intertwined with its mechanical decisions. Many plot developments and branching commitments, one of which players may have to make before the game even begins, are made more potent and morally complex with knowledge of events from the first game in the series.The Banner Saga 2 allows you to import a completed save file from The Banner Saga, bringing with it a cast of characters who you may or may not have helped survive the ordeals of the first game. These characters maintain their level growth, statistical upgrades, and all items you may have collected. But in some cases, the returning cast can be more than 15 playable characters, and I very quickly found a desire to revisit the original game to better orient myself.The game paints a mythological Norse world of humans, horned giants called Varl, stone oppressors called Dredge, and the factions within them. But aside from a new centaur race, the Horseborn, the game doesnt take time to introduce them as gradually as the previous did. These omissions help keep the sequels pace moving quickly, but although the game does have some tools to try and help initiate newcomers and refresh returning players on key narrative events (a recap video and brief summaries of characters as they re-enter the story), they are short, and feel insufficient.Where the first Banner Saga focussed on preparing for war, the fatigue it has on society, and the pitfalls of leadership, the second deals with fleeing from devastation as refugees, and the dilemma of selfishly protecting your tribe versus working for the greater good during that journey. As the leader of a caravan, you slowly shepard hundreds of followers across the continent to what you hope will be safety.Thankfully, the games mechanics, which can determine whether characters live or die permanently, are relatively straightforward in operation. Managing the followers in your caravan is simple, but requires thought and diligence: choosing to train enough fighters to defend your clan during conflict is important, but so is having enough regular clansmen to gather food in order to keep everyone alive and, if possible, in good spirits.Keeping morale high within your clan is advantageous, as it adds fuel to the games Willpower resource, utilised in the tactical turn-based battles. Points of willpower are spent to move characters beyond their natural range on the isometric battlefield, add more points of damage to attacks, and to activate and buff unique character abilities, of which there are many.Willpower, along with the rest of the core combat mechanics remain unchanged from the original Banner Saga. All units have distinct armor and health numbers, and the amount of health one has directly correlates to how much damage they may be able to inflict. The amount of armor one has, meanwhile, will directly block that amount of damage, and units may choose to strike blows at either attribute.The system is clear and uncomplicated, but there are enough strategic variables present to make the deliberation process enjoyable. The low-value numbers along with a clear user interface allow you to make calculations and purposeful decisions quickly. Whittling down the health of an enemy is always a desired move, but attempting to attack a foe whose armor number is higher than your units strength can risk negating all damage. Choosing to chip away at the armor of an enemy can open them up to more effective attacks later on, but leaving their health high means theyre a harder-hitting opponent. There is no way for units to heal and regain health, which results in combat scenarios that can fluctuate wildly between cautious brinkmanship and invigoratingly aggressive maneuvers.The Banner Sagas combat also places a vital emphasis on unit positioning. Large units, such as the enormous Varl characters in your clan, take up four isometric squares rather than one. They are less mobile, and their mass can cause blockages in the map, stopping other melee units from reaching the front lines if the player-assigned turn order is mismanaged. But this can also be used to your advantage, keeping enemies from reaching fragile ranged units.Nearly all of the unique character abilities require considerations in positioning and turn order to be used effectively. A passive buff from the new Poet class may grant extra Willpower to allies who witness a kill, but only if the character is close enough to see it himself and sing about it. The new Horseborn race may be able to Mule Kick a unit back several squares and damage all units it passes through, but this effect can hurt nearby allies as easily as it hurts enemies. The Banner Saga 2 also introduces destructible barricades, which can allow for interesting strategies, but these only appear occasionally.However, in a system where positioning is so important, there can be some annoyances that hinder combat, stemming from the games lush 2D visual style. Foreground elements of the otherwise stunning battlefield art mean that a tree branch can occasionally obscure an important portion of the map, no matter how you pan the camera. The units themselves can also cover elements of the battlefield. Because the angle of perspective cannot be rotated, a group of units clumped together can block sight of enemy traps which may cause damage or spawn more enemies if overlooked.Minor irritations aside, battles are still fair and challenging. Primary characters have a higher level cap than the original game, and are able to learn additional abilities. The difficulty of The Banner Saga 2 feels like a natural growth that bridges the two titles to accommodate these changes. The continued challenge makes each maneuver important to consider, and means that encounters can be lost as easily as they are won. This is especially key to the enjoyment of The Banner Saga 2, because losing a conflict doesnt mean the game is over. Losing may mean morale and clansmen are lost, characters are injured and require several days of rest, but these consequences can inform events in the story, a story which will continue regardless of your actions.Likewise, story events and decisions made in the strategic management layer can have a rippling effect to other portions of the game, so each must be carefully considered in context. Dumping food supplies may save lives or create extra barricades for an imminent tactical encounter. A poorly handled dispute may force you to fight and kill a party member youve invested a significant amount of resources upgrading. Do you sacrifice lives, food, morale or political relationships? When do you halt your journey to let your people rest, and when do you press an advantage with an iron fist? Situations are often fragile.The way each layer of the game feeds into and informs the other creates a cerebrally and emotionally grueling loop that can take its toll on you as a player. But it also helps engross you in the fate of the dire, war-torn world of The Banner Saga, and empathize with the perils of a fleeing population and the characters that struggle to lead them. The majestic hand-drawn art and eloquent animations of units on the battlefield further amplify this feeling, as does Austin Wintorys stirring orchestral soundtrack, with Gregorian chants haunting and illuminating the malaise of the world and events that occur.The Banner Saga 2s wonderful balance of systems and their effectiveness in heightening the ongoing narrative can still be appreciated if you arent familiar with what came before--but much more so if you are. Like the original game, The Banner Saga 2 leaves you holding your breath, completely invested in the world, its inhabitants, and their struggles, anxiously eager for more."}