{"ref": "https://www.gamespot.com/reviews/scooby-doo-mystery-mayhem-review/1900-6093050/", "date": "April 6, 2004", "game_name": "Scooby-Doo! Mystery Mayhem", "text": "Just in time for the theatrical release of Scooby-Doo 2: Monsters Unleashed, synergy-minded THQ has brought Scooby-Doo! Mystery Mayhem to consoles. A cowardly talking dog with a debilitating speech impediment is pretty timeless comedy, and the game is easy enough that it will probably appeal to the 10-and-under set. Nostalgic adults might be able to get some campy fun out of the cheesy plot elements and canned laugh track, though if they do, it's purely coincidental. Mystery Mayhem is aimed squarely at the kids. Scooby and the gang are back to solve more predictable mysteries. The game plays out like a string of episodes of the old-school cartoons, complete with stock mysteries occurring in stock locations like haunted libraries, haunted movie studios, haunted amusement parks, and so on. Breaking away from the patented Scooby-Doo formula, Mystery Mayhem has the meddling kids chasing after real-life spooks and specters and using a magical book called the Tome of Doom to trap them. Following protocol, each episode starts with the group splitting up to look for clues, putting you in control of the easily startled, perpetually hungry pair of Shaggy and Scooby. Remember back in 2001, when Luigi's Mansion came out at the launch of the GameCube? Apparently THQ and A2M do, because Mystery Mayhem is a fairly blatant Luigi's Mansion rip-off, though it lacks that game's charming haunted-house aesthetic. With the Tome of Doom at your disposal, you'll wander through different locales, solving basic switch- and item-based puzzles and trapping a variety of monsters. The Tome of Doom is Mystery Mayhem's answer to Luigi's Mansion's vacuum cleaner and works pretty much the same--get close to the monster, open the book, and start jamming on one of the buttons. The only real unique twists that the game adds to the Luigi's Mansion formula are the inclusion of disguises that you can use to sneak past monsters and the ability to switch controls back and forth between Scooby and Shaggy, which only occasionally comes into play when there's a tight passage that only Scooby can squeeze through. If you didn't play Luigi's Mansion already, then this gameplay mechanic may seem kind of unique, though Mystery Mayhem's relative ease keeps it from being too engaging either way. Having stolen its main gameplay mechanic from an older, better game, it's not too surprising that little work has gone into Mystery Mayhem's visuals. Shaggy and Scooby look pretty rough, using lots of flat-shaded polygons instead of actual textures, and their animation doesn't have much finesse either. The monsters fare better, mostly because they're usually accompanied by a unique particle or lighting effect. The game occasionally makes pretty good use of shadows to make certain areas look extra spooky, but this effective technique is used only sporadically, stealing some of its effectiveness. The locations you'll creep your way through are usually pretty small in scale and not too technically impressive, though they do carry enough of an exaggerated cartoony look to work in the context of a Scooby-Doo cartoon. The game maintains a fairly consistent frame rate, though opening up the Tome of Doom also unleashes a small flurry of colored lighting and particle effects, which can cause things to chop up pretty badly. There's not much appreciable difference between the three console versions of Mystery Mayhem, so if the game sounds like it's up your alley, you can safely pick it up for whichever system suits you. Young kids may find Mystery Mayhem entertaining. Everyone else, however, probably won't. Of course, Scooby-Doo would not be Scooby-Doo without a whiny-voiced beatnik, a dog with poor pronunciation, and prominent use of words like ~zoinks~ and ~jinkies~ Mystery Mayhem assembles a pretty good cast of voice actors to deliver the goods, most of whom have been providing the pipes for the core Scooby-Doo characters for years now. The talent can't make up for the fact that the game makes a habit of mercilessly recycling Shaggy's and Scooby's in-game sound bytes. The game opens up with a classic rendition of the Scooby-Doo theme song, but the rest of the game's music is generic and forgettable in comparison. Similarly, the sound effects are at their best, and their most memorable, when they're simply lifted from the old cartoons. There are all of five levels in Mystery Mayhem, which can be breezed through in an afternoon, and it's hard to imagine wanting to play through the game multiple times. Ardent adult Scooby-Doo fans would probably have their nostalgia best served by some Scooby-Doo DVDs, which are prominently advertised in the back of the game's manual, along with Scooby-Doo action figures and Scooby-Doo cereal. Parents whose kids have Scooby-Doo hot on the brain from the movie can safely rent this one, or not, without worry of missing much."}