{"ref": "https://www.gamespot.com/reviews/hitman-episode-two-review/1900-6416417/", "date": "November 23, 2016", "game_name": "Hitman", "text": "The second episode of Hitman opens with Agent 47 lounging on a bench in the idyllic vacation destination, Sapienza. With a newspaper in hand and a crisp Italian shirt on his back, you could be forgiven for mistaking Agent 47 as a proxy of Daniel Craig's James Bond--if it wasn't for his shaved, barcoded head.Sapienza's laid back atmosphere is almost the antithesis of the first episode's bustling fashion show, and this shift comes as a breath of fresh air. There's a greater variety of events to behold and more ground to cover, and you're afforded more opportunities to explore, unfettered by potential threats on the streets. While familiarizing yourself with the area, you'll regularly stumble into amusing scenes and personalities. Whether it's a street performer entertaining a group of tourists, an off-duty waiter taking a leak, or a priest who's flustered to see you barge into the middle of a confession, there are numerous vignettes that made me snicker and buy into the idea that Sapienza is a functioning community. It's disappointing that you can't enter every building given the potential advantages and entertainment they could provide, but episode two's world feels intricate and alive.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Hitman Episode 2 Sapienza - Video ReviewIt didn't take long for me to warm up to the sunlit streets and coastal views, which provided a relaxing buffer from this episode's dangerous destination: a mansion with a secret underground laboratory, protected by mafia-like guards and professional security. Your mission is to infiltrate the home, kill two targets, and destroy an experimental virus located in the heart of the lab. In traditional Hitman fashion, there are disguises to steal from unsuspecting NPCs that allow you to pass through security checkpoints and fool hired hands into thinking you're just another employee, toiling away in the opulent villa. A keen eye--or a finger on the button that triggers the x-ray vision-like Instinct mode--will help you locate tools to unlock doors or items that take out enemies, such as an exploding golf ball.Hunting for opportunities in your environment is just as critical to the Hitman experience as the act of assassinating targets. You spend most of your time sneaking and procuring said items, and while you need to be ever vigilant to avoid detection from suspicious NPCs, Hitman's unreliable AI can be easily fooled once you learn how to manipulate the way the game handles line-of-sight. It's reasonable to expect that rounding a corner and making a sharp turn in an unexpected direction would throw off a hapless guard, but it's a little silly that you can avoid detection by crouching and walking circles around objects, despite Agent 47's head poking out in plain view.Even though the enemies you circumvent aren't the brightest, there are enough of them to make your job difficult once you infiltrate the mansion's perimeter. Anyone who played the first episode will feel right at home, and potentially more at ease, despite staring danger in the face on a constant basis. Whereas the mansion in Paris was brimming with people and stuffed with hallways and tiny rooms, Sapienza's has more open space and fewer twists and turns. This looser layout potentially presents fewer hiding places--with no crowds to confuse guards and fewer windows to jump through--but this also makes the moment-to-moment action feel more manageable. That is, until you see what lurks under your feet.The underground laboratory is a totally different beast compared to the mansion. It's small and jam-packed with professional security and doctors in a space that's only big enough for a few medical trailers and crates. It's a scene that's tough to navigate and even harder to crack, but its concentrated nature makes victory all the more rewarding. With a swap of an outfit, an errant keycard, and a handy hazmat suit, you can make it into the virus' containment facility, but it requires extreme patience--any amount of aggressive behavior in the lab is met with extreme force.Though you can still rely on Hitman's forgiving radar-meets-map--which automatically tracks movements of targets and NPCs--you can use infiltration and reconnaissance across the entirety of Sapienza to locate your targets on foot. NPCs often engage in conversations that reveal the habits or locations of specific characters, but you can also pursue mini-objectives that lead you right into the lion's den, such as playing the part of a target's golf instructor. However, it's not unusual to turn a corner and organically cross paths with your target. However, they have routines, and once you realize your target is simply following a pre-programmed path rather than living in and reacting to the world as a real person might, their mystique takes a nose-dive.The mediocre AI and animations return, as does the need to repeat the same old spy tricks, but they take a backseat this time around as Sapienza and its colorful denizens take center stage.Indeed, once you understand the movements of your targets, the limitations of Hitman's enemy AI and the locations of critically useful items, the sense of wonder and immersion fade, and Hitman begins to feel more like a puzzle game. This is most evident when you dive into escalation missions.These multi-stage missions come in five parts, stacking new objectives with each round. The added challenges--like not pacifying NPCs--make completing these challenges more difficult with each round, but not necessarily more enjoyable, as you already know how to complete the unchanging objectives. It's possible to clear the first few stages of an escalation mission in a couple of minutes using the knowledge you gleaned from the episode's main mission, and it doesn't take long to grow tired of walking the same paths and resorting to the same tactics. You can look for new solutions, but it's up to you to drum up the interest in doing so as the game doesn't go out of its way to mix up the variables and guide you in new directions.Despite having a few distinct locations to explore within Sapienza, your main mission won't last long, but the variety is appreciated, with the lab feeling different from the mansion feeling different than the streets. In that regard, this episode feels far more well-rounded than the first. The mediocre AI and animations return, as does the need to repeat the same old spy tricks, but they take a backseat this time around as Sapienza and its colorful denizens take center stage. Episode two doesn't fill your plate, but it's a satisfying experience nonetheless."}