{"ref": "https://www.gamespot.com/reviews/lego-pirates-of-the-caribbean-the-video-game-revie/1900-6313137/", "date": "May 11, 2011", "game_name": "LEGO Pirates of the Caribbean: The Video Game", "text": "What's more fun? Building miniature castles out of Lego bricks or smashing them to smithereens? What makes the Lego film tie-ins so wonderful is that you needn't choose. Like its predecessors, Lego Pirates of the Caribbean is at its best when you're either constructing items from vibrant plastic blocks or bashing them and collecting the little pips that go flying everywhere. Equally fun is the game's silly, wordless retelling of the Pirates of the Caribbean films, with cutscenes as sly and charming as Jack Sparrow himself. However, these joys are interspersed throughout a mundane, by-the-book adventure with little excitement or momentum. Easy-peasy puzzles make it simple to sleepwalk through the small environments, and the one-on-one sword duels scattered throughout drag the pace down from a mild stroll to a sluggish crawl. Lego Pirates of the Caribbean is a leisurely journey to pleasant but predictable shores that is mostly devoid of the treasures you might hope to find there. For someone who can't walk without lurching, Jack Sparrow is an excellent swordfighter. At least, its heart is in the right place. The game recounts the tales told by the Pirates of the Caribbean films, including the yet-unreleased fourth installment, with chunky Lego figures stepping in for the films' stars. Even if you're the world's biggest Johnny Depp or Geoffrey Rush fan, you may not always know exactly what's going on in the last of these included adventures, but the game does a fine enough job of giving you the gist. Besides, what happens isn't as important as how it happens. Lego Pirates eschews dialogue in favor of adorable details that are sure to put a smile on your face. When two characters walk the plank, they remain suspended in midair for a moment before plunging into the sea. Monkeys and pigs are given prominent comedic roles. Jack Sparrow's flamboyant strut is so exaggerated that it's a wonder he can remain upright. Almost every cutscene has some silly surprise or another, and they are as colorful as the vibrant in-game visuals. The levels following those scenes are copied and pasted from the Lego template. You meander through various environments filled with objects to shatter, all while pulling blocks and activating push plates to gain access to new areas. While you only control one character at a time, you can usually switch personas among several choices, morphing into whichever avatar allows you to perform the necessary actions. Those actions include hammering on glowing broken items to repair them, activating your compass to find hidden items, using a grapple hook to swing from platform to platform, and more. It's a shame that Lego Pirates doesn't allow you to invite a friend to adventure with you, as many of the previous handheld Lego games have done. Solving involved cooperative puzzles with a friend in tow could have provided some much-needed excitement. There is a multiplayer component, though it is no substitute for co-op play. Here, you select a character, assign a few AI-controlled moves to him or her, and wait to encounter another 3DS owner with StreetPass enabled. When you do, characters duel, earning experience and new moves. The worth of this component is based entirely on your chances of encountering other random players. Squids often mistake Davy Jones as one of their own. The main adventures also feature duels, though these ones involve halfheartedly mashing a button and then participating in the world's slowest, most uninspiring quick-time event. The dreariness of duels is mirrored by the standard combat, in which one or two enemies might gang up on you, but the only one that fights back is the one you engage. If you hit the button five times, down they go--no fuss, no muss. It's so simple, you will likely never need any of the health-giving hearts that enemies drop, let alone actually die. Fortunately, other efforts to vary the pace are much more successful. At certain points, you take control of a parrot and fly to higher ground to assist its human master. And in one memorable chapter, you joyfully roll around in a spherical cage. In the ball, you jump chasms and collect seemingly endless coins, all while squashing the spear-throwing baddies that attempt to hinder you. You could complete all four stories in as many hours if you don't linger, though every level is filled with secrets that are accessible only by returning to them in free play. You can also create your own character using a selection of body parts, weapons, and special skills, which brightens up your return visits. But even then, you must still go through the motions of solving puzzles that aren't puzzles and cutting down enemies that have no sense of self-preservation. Lego Pirates of the Caribbean is adorable, but it takes a lot more than a cheeky attitude to gain infamy on the high seas."}