{"ref": "https://www.gamespot.com/reviews/bloody-roar-3-review/1900-2780243/", "date": "June 26, 2001", "game_name": "Bloody Roar 3", "text": "Harsh as it seems to say, the Bloody Roar series has always focused on style over substance. With its focus on fighting theatrics and half-man, half-beast designs, Eighting's breed of fighter seems content to gloss over things like technique and depth, delivering a visually dynamic, yet ultimately limited, experience. Bloody Roar 3 is the developer's latest, and it doesn't buck the series' legacy at all. The game is visually keen, and its pacing is marvelous, but its fighting system is remarkably slim, emphasizing one-button combos and nearly instant-kill supers. For what it's worth, newcomers will be able to get up to speed very quickly.The Bloody Roar series, for those new to it, is about human warriors with the supernatural ability to assume the forms of beasts. Aside from the token werewolves, -lions, and -bats, the series features a handful of other less orthodox hybrids--in it, you'll find werechameleons, -moles, -bunnies, and even -robots (or ~iron moles~). For its quirky, imaginative designs, the games deserve credit. Even its basic premise--fighters transforming into beasts and their fighting styles being altered--was definitely workable, the first time around. But after two iterations and roughly zero major alterations to the formula, the series is screaming for a change--a change that Bloody Roar 3 fails to deliver. Bloody Roar 3's control scheme is pretty basic. There's one button for punching, and one for kicking, along with one that simulates the pressing of both simultaneously, for grabbing. There's also the beast-change button, which allows for metamorphosing once the rage meter is full. The shoulder buttons, finally, have right and left sidestepping commands mapped to them, allowing you to somewhat effectively circle or otherwise spatially flimflam your opponent. The controls are modified slightly once you're in beast mode--the button previously used to shape-shift allows you to execute specials and supers. As you've surely surmised, the control scheme is frightfully simple. And while that isn't necessarily negative in itself, the game's fighting system, sadly, in no way warrants anything more complex. Even its bare-bones control scheme, in fact, often seems squandered.Bloody Roar 3--like its predecessors--is all about one-button 12-hit combos, resulting in spectacular, albeit canned, animations. If you keep pressing the punch or kick button long enough, depending on your character, you'll eventually start juggling your opponent, delivering massive amounts of damage. Do this in a corner, and the effects are devastating. Not that's it cheap, however--every single character can do this, turning most fights into a tug-of-war, of sorts, as both you and your opponent try to ease one another into your respective corners. The game's special moves were designed with a similar sensibility--they're basically all achieved by either full- or half-circle motions, forward or backward, along with punch or kick. When in beast mode, your character will gain access to a couple of extra supers, which serves to mix it up a bit, though not nearly enough; ideally, the beast mode should dramatically change your character's fighting style, resulting in not just an aesthetic shift in form, but also a tangible alteration in gameplay. As is, Bloody Roar 3's beast form merely brings with it more damaging attacks, a regenerating health bar, and access to a handful of exclusive special moves and, of course, the game-breaking supers. Bloody Roar 3's super moves are simultaneously its most intriguing elements and its most broken. Most characters have access to two of them, and they're executed by the perennial double-half-circle motions used extensively by 2D fighters. Basically, if you're hit by one of these supers, your chances of winning the match drop dramatically. They deliver intense amounts of damage, and once you're hit with the initial blow, there's no way to counter or defend against them. To its credit, Eighting did limit their use, a bit--you can only execute them in beast mode, as mentioned before, and executing a super forces you to shape-shift into your regular form, even if you miss. They still throw your game off, though, more often than not, and it takes no real skill--aside from the ability to adequately gauge distance--to execute them effectively. The supers are accompanied by ludicrously pretty particle effects, though, as well as some top-notch animations and dynamic camera shifts. And with a game as dynamic as Bloody Roar 3 is to begin with, it really does add a lot to the spectacle. In truth, it's really hard to say anything negative about the game's production. The character designs are fanciful and imaginative, if not truly inspired, and some of the beast forms border on slapstick humor. Shina (formerly Marvel), for example, in her beast form and denim costume, is almost too much. When coupled with the game's bold animations and spectacular use of particle effects (some heavy swings, for instance, are emphasized by translucent motion lines), the game is quite a pleasure to behold. It really does look like a marvelous fighter, until you pick up the controller. Given the strides in 3D fighter design made by companies like Namco, Sega, and Tecmo, there really is no reason for anyone to pay much attention to Bloody Roar 3, aside from its bold visual stylings and faux heavy metal soundtrack. If you like the Bloody Roar series already, though, then this might be right up your alley. But if you like fighting games for their technique and depth of design, then this certainly won't hold your attention."}