{"ref": "https://www.gamespot.com/reviews/ncaa-gamebreaker-football-2004-review/1900-6074829/", "date": "September 9, 2003", "game_name": "NCAA GameBreaker 2004", "text": "Like NFL GameDay, 989 Sports' college series, NCAA GameBreaker, has taken a bit of a beating since moving from the PlayStation to the PlayStation 2. The two games improve every year, but they still seem to be behind the pack in terms of basic gameplay elements, like AI. Those who've played 989's GameBreaker series will find that NCAA GameBreaker 2004 is a much more competent game than last year's edition. While the series has improved, most of these improvements are in the realm of additional features, like improved online play and support for USB headsets. Unfortunately, the gameplay still hasn't received the attention it deserves, and, as a result, GameBreaker still fails to get many of the fundamentals right. The game definitely does a good job of presenting the college atmosphere--right down to new school fight songs and mascots. The game contains more than 117 Division I-A teams as well as 66 classic teams from which to choose. NCAA GameBreaker 2004 also, of course, gives you the ability to go in and create your own player or team that can be used in any of the game's modes of play. The included modes of play are fairly standard and include practice, scrimmage, bowl season, tournament season, career mode, and online. The bowl season lets you play a regular season, and, if you do well enough, you're invited to play in one of college football's bowl games. Tournament season is similar, but it's set up so that you can enter a traditional tournament at the end of the season. The game's career mode allows you to assume the role of a coach in an attempt to rise through the ranks to become a legend. You start out by choosing an open coaching position, at a small school, with the overall goal of coaching a successful season. At the end of the season, if you've done well, you can get promoted or even receive a job offer from a bigger school. If you don't hit your marks, though, you may find yourself out of a job and starting over. Online play is actually quite a robust feature in NCAA GameBreaker since the game gives you quite a bit of control. You can create your own league, chat, send virtual e-mails, and view buddy lists that inform you when friends are online, and, of course, you can track statistical data. NCAA GameBreaker 2004 supports both dialup and broadband users, and, just so long as you are matched up with someone with an equal connection, it works well. The gameplay in NCAA GameBreaker 2004, if nothing else, is incredibly customizable. The game even comes with a style setting that allows you to change the game's overall setting from simulation to arcade, which basically makes a difference in the game's speed and adds some exaggerated moves. There's not a huge difference between the two modes, but it's a good example of some of the level of customization available in NCAA GameBreaker 2004. The actual control, when running and throwing the football, is fairly decent--especially when compared to last year's game. There are still more than a few flaws, such as the game's AI, which lets you get away with far too many huge passing plays. You, of course, have the typical arsenal of moves at your disposal. These include speed burst, spin, and hurdle. The gameplay is fairly responsive, although it does take some time to get used to since it buffers animations before letting you start your next move. One interesting innovation this year is the addition of support for the USB headset, which allows you to call plays using your voice. It works well when you're extremely deliberate about pronouncing the words--which kind of works since quarterbacks typically yell in an authoritative manner. You can also use the headset to talk to online opponents, and this works well, just so long as you both have good connections. The usual college plays and playbooks have been included, and some have even been rewritten for this year's game. Visually, NCAA Gamebreaker 2004 does a decent job of trying to re-create what an actual college football game looks like. The player models, compared to the ones used for NFL GameDay, are much slimmer in NCAA GameBreaker 2004. The lower legs, calves, and ankles look a little too thin, in fact, and are a little disproportionate to the rest of the model. Overall, though, the helmets, jerseys, and stadiums in the game look fine. Little touches add to the game's presentation, like camera shots that show the team's mascot--complete with cheerleaders and sideline personnel in the background. Unfortunately, the animation of the players isn't very smooth, and sometimes you'll see the animation routines pop from one to the next. Even the animation of the players shaking hands at the beginning of the game doesn't line up very well. Beyond that, there just aren't a whole lot of different animations in the game, which makes every other play look the same as the last. In the audio department, NCAA GameBreaker 2004 features a lot of college-specific elements, like school fight songs as performed (in most cases) by actual school bands. Plus, the game also has a two-man announcer team that features Tim Brandt and Keith Jackson--the latter of whom is one of the most beloved sportscasters in recent memory. Unfortunately, the announcing is fairly boring at times, since the two men don't seem to have any chemistry or interesting lines between them. In the end, NCAA Gamebreaker 2004 is still a mediocre game of college football that has a lot of promising features, like its online capabilities and voice recognition options. However, the game also comes with a lot of problems, such as weak AI and poor animation. Perhaps the biggest problem with the game is that it simply isn't as good as its main competitor, NCAA Football 2004, which is, by all measures, a much better game of college football."}