{"ref": "https://www.gamespot.com/reviews/jack-keane-review/1900-6187989/", "date": "March 18, 2008", "game_name": "Jack Keane", "text": "Deck 13 Interactive is proving that 2006's Ankh was no fluke. The German developer's follow-up, Jack Keane, is every bit as colorful and cheerful as that romp through a Disney-fied ancient Egypt. It was also one of those rare adventures that worked for kids and adults. The two games are actually very similar in just about every way, with the same cutesy humor and lighthearted derring-do shifted a few millennia forward in time. A reliance on obscure, overly traditional puzzles spoils the party somewhat, but these old-fashioned conundrums aren't going to trouble your noggin too much. Eerie settings and abandoned treasure are just part of the scenery on the forbidding (yet still goofy) Tooth Island. An out-there nautical adventure powers the plot. You play as Jack Keane, a Han Solo-like British rogue tasked with taking a secret agent for her majesty's secret service to a rather ominous-sounding destination in the Indian Ocean called Tooth Island. It seems that a madman named Doctor T is threatening to destroy tea plants in the region, which naturally drives the Brits to the point of madness wondering what they'll drink with their crumpets. The setting is the 19th century, when the sun never set on the British Empire, so get ready for lots of fops, pith helmets, and outrageous moustaches. Resemblances to LucasArts' classic Monkey Island games are entirely intentional, with Jack taking part in a screwball escapade that gets progressively zanier as you unravel the mystery of Doctor T's fiendish plot. If you've played any of those great old Lucas point-and-clickers, you'll feel right at home by the time you encounter the crazed scientist's superapes and cannibal plants. At times, the storyline may be a little too broad and a touch too childish. It certainly lacks the adult edge of those old LucasArts games. Humor is kind of hit and miss, which probably won't come as much of a surprise given how hard it is to make people laugh while playing games. There are some nice touches here, however, including a funny Victorian variation on the distinctly modern Nigerian banking scam, a great Star Wars joke or two, a Clouseau-like British secret agent, and Flintstones-styled technology, such as monkey-powered electricity. Visuals are over the top in a classic Saturday morning cartoon fashion, with lots of deep chins, pop eyes, and exaggerated architecture, so the cornball plot is at least nicely complemented. Voice acting is equally flamboyant, with many thick accents on display. Oddly enough, though, the list of characters with outrageous accents doesn't include Jack Keane himself, who's voiced by an American despite supposedly being a born-and-bred Londoner. That's rather odd, especially given how just about everyone else in the game speaks with ridiculous English and Indian accents straight out of old Monty Python sketches. What would an adventure be without a femme fatale to complicate everything? Puzzles are straight-up old school. Jack Keane is loaded with traditional point-and-click challenges that can be a bit obscure at times. But, at least, they stay within the bounds of reason and gradually ramp up in difficulty. By the time they get fairly tough, you should be thinking in adventure-game logic. At any rate, there are real-world solutions to just about every problem. Need to feed a plant some fish? Go angling with a readily available chain of sausages. Path blocked by vines? Whip out Jack's trusty jackknife. Need to fix up the broken taillight on an elephant taxi? Just take grandma's best jam, a broken-hearted wannabe pirate, a red sock, and--OK, so not everything is entirely sane. Still, there is more common sense here than in most old-time adventure games. Even the more outlandish puzzle solutions can be readily figured out with some careful observation and experimentation. You'd have to be pretty hard-hearted not to enjoy Jack Keane. It may be a little too cutesy in some spots and the puzzles may be a bit too obtuse or conventional in others, but the sheer sense of cartoon adventure that permeates every frame drives the game over these potholes."}