{"ref": "https://www.gamespot.com/reviews/star-trek-invasion-review/1900-2621525/", "date": "May 17, 2006", "game_name": "Star Trek: Invasion", "text": "Despite a proliferation of Star Trek titles for the PC platform, as well as journeyman attempts on other consoles, the PlayStation has been left in the cold when it comes to Mr. Roddenberry's signature franchise. Thanks to Activision and its recent release of Star Trek: Invasion, this discrepancy has come to an end. Forget drawn-out sims and tedious point-and-click FMV, Invasion is about blowing stuff up in the purest sense. But it remains to be seen if Star Trek: Invasion does the franchise justice, and if this 3D shooter can hold its own against the likes of Colony Wars and Wing Commander. Similar to the Colony Wars series, Invasion starts you out as a lowly ensign, a new recruit in Starfleet's illustrious Red Squadron, a group of skilled fighter pilots that are both revered and reviled across the galaxy. Throughout the game, you, as ensign Ryan Cooper, will participate in a variety of missions and battles. Do well, and you'll increase in rank and acquire better ships. Fail, however, and your ashes will be scattered throughout the vacuum of space. Unlike the unfamiliar confines of Colony Wars, this is a Star Trek title, and, as such, contains a storyline that's initially a bit more inviting. It seems the Borg have been acting up, assimilating entire galaxies of peaceful life-forms. Even worse, they're on their way to our solar system. To counter this threat, Lt. Commander Worf has been assigned to command a fighting ship, the USS Typhon - a ship that boasts a compliment of 24 Valkyrie fighters and a warp drive that would make the Millennium Falcon jealous. As you might have guessed by now, you've been assigned to his ship. Thus, the game's storyline leaps out of the starting gate with the two things Trekkers love most: the Borg and Michael Dorn. As you complete each mission, the story will pull you through Romulan uprisings, Cardassian pirate skirmishes, and even introduce a new threat - the Kam'Jahtae. Regardless of the Kam'Jahtae's heinous similarity to the Protoss in Blizzard's StarCraft, Invasion's plot is robust, never seeming silly or contrived. For Trek fans, the many plots, subplots, and intricate twists will be enough to pull them through even the toughest of the game's missions. However, if you're a fan of Colony Wars' story branching or Wing Commander's role-playing aspects, watch out. Other than secret levels and a few sidetracks, Star Trek: Invasion is as linear as they come. Your ship will be upgraded and you will gain in rank, but the end, my friends, is only a mere 20 levels away. More surprising than Invasion's quality storytelling, though, is its gameplay. Warthog's development team, allied with a couple former Psygnosis veterans, has succeeded in delivering a 3D shooting experience that's spot on. Every button on the PlayStation pad is used to control the ship, but the control scheme is never counterintuitive. The D-pad controls steering, the main buttons fire the weapons, and the shoulder buttons serve as thrust and evasion controls. Selecting between weapons, locking on, firing, performing rolls, and warping away are processes you'll need to perform frequently, and as far as Invasion goes, it lets you pull them off without a hitch. Of special note is the game's lock-on system, which not only allows you to automatically target an enemy, but it also shows how far ahead of them to aim in order to account for distance delays. Nice. Unfortunately, there are a few problems to be found in Star Trek Invasion's gameplay. First, the ship oversteers like mad, but only in third-person view and only with the digital D-dad. Unless you toggle to one of the game's two cockpit views or stick to the analog stick, it's going to take awhile before you acclimate to the default view. Second of these problems, and more notable, is the poor collision detection. It's one thing to get bumped around by a ship that's packing an energy shield, but does the same have to hold true for asteroids, space junk, and unshielded vessels too? There are times when the game calls for precision stopping and maneuvering, but thanks to its iffy hit detection, this is aggravating. Star Trek: Invasion's final major gameplay issue is actually a combination of two things - difficulty and tedium. If you've played Colony Wars 2 or Red Sun, you'll find Star Trek: Invasion a smidgen easier, but only just. If you're not a dyed-in-the-wool 3D shooter fanatic, prepare to die, a lot. Admittedly, the majority of this difficulty stems from smart enemies and the need to apply strategy when fighting, which, on their own, are good things. However, the game simply keeps throwing enemies at you, on and on, more and more, as the storyline progresses. Sure, protecting a pod or defending a cruiser is something shooter fans are used to, but is all this insanity necessary? Compounding things, the game is just boring to play. Sure, the story is nice, but the battles drag on forever. Protecting a convoy to a warp point or retrieving a distressed ship is one thing, but doing it twice with four battles in between is a bit much. All told, the game begs for pacing. Visually, though, who's complaining? Warthog somehow managed to come up with a game engine that delivers crisp, high-resolution visuals and a speedy frame rate. While the spatial locales aren't as diverse or obstacle ridden as Colony Wars, one can't help but be impressed by Invasion's ability to simultaneously display more than 30 ships - as well as asteroids, fully detailed moons, and a command ship or two - on a single screen. Even the game's two-player mode looks good, exhibiting none of the loss of clarity and detail that seems to plague split-screen games. Furthermore, the game's FMV is rendered using the game's own graphical engine, and it looks so crisp at times that you'd bet you were watching digitized video. Invasion's sound also happens to be exceptional. Mission briefings, subspace communications, and computer voices are all perfect renditions of their TV and movie counterparts, while Michael Dorn and Patrick Stewart's voice acting performances are top-notch. The game's sound effects are stellar as well. Phaser sounds, torpedoes, tractor beams, and explosion effects all sound crisp and clear, while remaining faithful to the franchise. So, then, what do you have? There is no doubt that Star Trek: Invasion's storyline, visuals, and sound are of the utmost caliber. However, despite the game's fluid control system and innovative lock-on features, its pacing and repetition simply mar the gameplay experience. If you skip the side levels, you'll probably enjoy the game much more. Unfortunately, though, the game is over twice as fast if you do that, and since there's no path branching, there's no reason to pick it up again. The two-player deathmatch and cooperative missions may offer an extra diversion for those with gaming friends, but even those features can't lift an average game to stardom."}