{"ref": "https://www.gamespot.com/reviews/the-outfit-review/1900-6145879/", "date": "March 13, 2006", "game_name": "The Outfit", "text": "Neither a teeth-rattling action game, nor a highly cerebral strategy game, The Outfit tries to split the difference, effectively putting you in the role of both front-line grunt and field commander as you march across WWII-torn France. Cross-pollinating genres like this is tricky, and though it puts in a good effort, The Outfit doesn't quite pull it off, leaving both the action and strategy elements compromised. The multiplayer game copes with The Outfit's shortcomings much more ably than the single-player campaign, but it remains a game difficult to wholeheartedly recommend, regardless. It's like GI Joe meets the A-Team, except that people actually get shot and die. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: The Outfit Video Review The titular Outfit is initially comprised of J.D. Tyler, Deuce Williams, and Tommy Mac, three ~tough as nails~ soldiers doing their part in the European Theater to quash the Nazi threat. They've each got their specialties--J.D. is good with a rifle and has a knack for detonating enemy vehicles, Deuce packs a bazooka (along with some sweet aviator sunglasses) and is proficient in hand-to-hand combat, and Tommy packs a flamethrower and can use tear gas to flush out enemies. Physically speaking, they're all striking figures, but they're all pretty much just salty, battle-hardened, Sgt. Rock types without many unique personality traits to differentiate them. Their story sees them hunting down blood-thirsty German generals and traitorous clergymen, as well as allying with Le Resistance and some unexpected German sympathizers, all the while proving their worth as practitioners of wanton destruction. The story itself is completely unremarkable, with its ability to fill time between missions being its greatest strength. As a mission starts, you'll be given your choice of characters. At first, you'll be picking from J.D., Deuce, and Tommy, though your choice of playable characters varies as you play through the 12 missions that make up the single-player campaign. Each character is armed with two weapons and a limitless supply of grenades, but more importantly, they also command a four-soldier squad and can call in equipment reinforcements as is necessary. Your squad isn't particularly bright and can only be given a handful of very broad commands under pretty specific conditions. On top of these handicaps, you have to wait for a meter to recharge before issuing new commands, which can take a good minute to refresh. Still, when you tell them to provide cover fire, they generally do what they're told, and they do it well enough. You'll immediately understand the necessity of the additional backup the first time you squeeze off a round--the characters' weapons are weak, overheat quickly, and have consistently poor aim. The effectiveness of your characters' weapons can improve over time, but since the game heavily conditions you to rely on your squad and air-dropped equipment, the weapon upgrades are of minor consequence. The vehicles you'll have access to, which range from a wheelbarrow (no, seriously) to a ferocious, rocket-mounted tank, are great for providing your character with improved durability, but whether you're on foot, manning a turret, or playing tank commander, you'll undoubtedly find yourself frustrated by the erratic aiming, inconsistent bounding boxes for pieces of the environment, and a notable lack of splash damage. Underwhelming firepower and bad aim conspire against the actual action in The Outfit. Save for the crosshairs on the sniper rifle, most of the weapons use somewhat archaic aiming reticules that take a while to adjust to, partially because reloading on most of the heavy weapons takes forever, but also because they've been purposely imbued with enough imperfections that it's hard to tell if the problem is your aiming or the equipment. Bounding boxes, the invisible geometry that decides the physical space an in-game object will take up, is another source of grief. You'll find yourself in some pretty war-torn areas that are filled with debris and obstacles, but unfortunately, you can't always shoot through empty space in The Outfit, and it is supremely frustrating when your 75mm cannon shell happens to catch an invisible edge. Almost more frustrating is the game's model for splash damage. Vehicle explosions will regularly take out soldiers that are standing right next to them, but shots from a bazooka or a tank's main cannon have almost zero effect if they don't bull's-eye the desired target. You'll realize just how ridiculous this is when you're sniping off a row of Nazis one at a time with a gigantic antitank cannon. Though the game prefers to word things a little differently, the core objective in every single-player mission is to get from one area to another--a straightforward task, thanks to the game's extremely linear level design. Your path will twist and turn, going from narrow valleys to open plains, and on a few rare occasions, you'll have to backtrack, but the game always makes it quite clear where you're to go next. As you bring your scorched-earth campaign through beachfronts, quaint French villages, and heavily fortified Nazi bases, you'll regularly happen upon small, Nazi-military installments, which you can capture for your own ends. Some are simply ~strategic objectives,~ which serve as spawn points for when you die--and you will die a lot. Your fighters are pretty fragile creatures, and the enemy is often a frustratingly good shot, capable of seeing you through a brick wall. Punishment for death is light, forcing you to hoof it back to where the action is from a spawn point of your choosing. The other types of bases include a motor pool, an armory, and a radio tower, which serve as spawn points, and when captured, also give you access to additional firepower. The motor pool gives you the keys to a variety of tanks and heavily armored vehicles; the armory lets you deploy machine-gun nests and antitank cannons; and the radio tower lets you call down artillery and air strikes. Your ability to deploy anything, however, is contingent upon how many field units (or FUs) you have. Field units are currency that you get for completing midmission objectives, capturing bases, and killing enemies. Spending FUs is as easy as hitting the Y button, which brings up an on-screen ~destruction on demand~ menu that lets you quickly, and rather easily, purchase new hardware, choose a position for it, and have it air-dropped in seconds later. As hard as we tried, we couldn't come up with anything funny to say about the FUs. The destruction-on-demand system is the only thing that really makes The Outfit strategic at all, but even then it's not a particularly deep or nuanced system. If you happen upon a base fortified with turrets and tanks, you find a good position, drop down some turrets and antitank guns of your own, and watch the mayhem unfold. Overspending at one point in a mission can make it difficult to proceed at another, but even then you're punished so sparingly for death that it's still possible to grind your way through. On top of all the general Nazi killing, each level contains at least a few secret mission objectives, usually revolving around destroying a number of Nazi objects--statues, spotlights, artillery, bombers, and so on--or defending a number of Allied forces. Save for a good number of bonus FUs, completing these objectives is mostly only good for unlocking Xbox 360 achievements. There are literally dozens of these scattered throughout the game, each generally earning you 20 or 25 points, and they are the only good reason to go back and replay missions you've already completed. If you don't take the time to ferret out every last hidden mission objective, you'll probably breeze through the story in less than 10 hours. Luckily, The Outfit features some multiplayer modes, which make better use of the gameplay model than the single-player campaign. There's basic deathmatch, as well as a capture-the-flag variant where you have to hold down a number of strategic objectives before your enemy does, and both can be played either head-to-head, two-on-two, or three-on-three. The modes are pretty straightforward, and though the controls are identical to the single-player game, it's a much different game to play against other opponents that have the same objective as you do, and the dozen multiplayer maps included are far more interesting. Though some poor design choices muck up the single-player game, the multiplayer proves to be pretty engaging and a unique online experience on the Xbox 360. You can play through the single-player game in online co-op, which can add a bit more strategy to the proceedings. The Outfit favors wide-spread ruin over finesse, which comes across in the game's presentation. The world of The Outfit, while not terribly expansive, is highly destructible. Tanks and other military hardware explode satisfyingly enough, and with a little effort, you can knock down trees, level buildings, and bust right through defensive walls. If you're rolling in something with a little heft, you can roll over soldiers, smaller pieces of military hardware, low walls, and various barriers. You can get a good ~bull in a china shop~ thing going, but as with any game that touts destructible environments as a bullet point, it only makes the indestructible parts of the environment stand out that much more. There are some other nice little touches, such as the way a tank will rock on its suspension a little when it is initially air-dropped, the way cannon-fire will briefly bathe the immediate area in a flash of light, or the cloud of dust and smoke that will waft out of the back of an antitank cannon, but these highlights are overshadowed by other shortcomings. Character models are chunky and feature some stiff, repetitive animations. Textures are wildly inconsistent, going from crystal clear to ~what the heck is that even supposed to be...a briefcase?~ Funny-looking rag-doll deaths abound, though soldiers shot with a cannon or flamethrower crumble into weird Sarah Connor-style logs of ash, which is actually even weirder than watching your guy's limbs flop around like some kind of epileptic marionette. The game takes on a different kind of taint depending on whether you're playing it in HD or standard definition. HD makes the game's level-of-detail and shadow-mapping issues more prominent, while standard definition makes all the textures look a bit more crudded up. Everything explodes in The Outfit. Well, almost everything. The soundtrack features a somewhat predictable blend of military marches, driving guitars, and electronic beats--derivative, yes, but still quite effective. The voice acting sees the three main characters playing perfectly into their tough-guy archetypes--J.D. sounds gruff and stern, Deuce sounds gravely and stern, and Tommy sounds almost exactly like John Wayne. The supporting cast features a cattle call of fake French and fake German accents that go between awkward and really bad. Some of the explosive effects pack a punch, and there are occasionally some great 5.1 moments, such as when you're defending a position against wave after wave of Nazi fighter planes, but a lot of the in-game effects ring hollow. The Outfit's multiplayer game goes quite a ways to redeeming the monotonous single-player campaign, but it still doesn't fully excuse the game's myriad of other faults. An action strategy hybrid of this kind has been done before, and done better by games such as Battalion Wars or Kingdom Under Fire: The Crusaders, but still, it's a one of a kind on the Xbox 360, at least for now. The other types of bases include a motor pool, an armory, and a radio tower, which serve as spawn points, and when captured, also give you access to additional firepower. The motor pool gives you the keys to a variety of tanks and heavily armored vehicles; the armory lets you deploy machine-gun nests and antitank cannons; and the radio tower lets you call down artillery and air strikes. Your ability to deploy anything, however, is contingent upon how many field units (or FUs) you have. Field units are currency that you get for completing midmission objectives, capturing bases, and killing enemies. Spending FUs is as easy as hitting the Y button, which brings up an on-screen ~destruction on demand~ menu that lets you quickly, and rather easily, purchase new hardware, choose a position for it, and have it air-dropped in seconds later. As hard as we tried, we couldn't come up with anything funny to say about the FUs. The destruction-on-demand system is the only thing that really makes The Outfit strategic at all, but even then it's not a particularly deep or nuanced system. If you happen upon a base fortified with turrets and tanks, you find a good position, drop down some turrets and antitank guns of your own, and watch the mayhem unfold. Overspending at one point in a mission can make it difficult to proceed at another, but even then you're punished so sparingly for death that it's still possible to grind your way through. On top of all the general Nazi killing, each level contains at least a few secret mission objectives, usually revolving around destroying a number of Nazi objects--statues, spotlights, artillery, bombers, and so on--or defending a number of Allied forces. Save for a good number of bonus FUs, completing these objectives is mostly only good for unlocking Xbox 360 achievements. There are literally dozens of these scattered throughout the game, each generally earning you 20 or 25 points, and they are the only good reason to go back and replay missions you've already completed. If you don't take the time to ferret out every last hidden mission objective, you'll probably breeze through the story in less than 10 hours. Luckily, The Outfit features some multiplayer modes, which make better use of the gameplay model than the single-player campaign. There's basic deathmatch, as well as a capture-the-flag variant where you have to hold down a number of strategic objectives before your enemy does, and both can be played either head-to-head, two-on-two, or three-on-three. The modes are pretty straightforward, and though the controls are identical to the single-player game, it's a much different game to play against other opponents that have the same objective as you do, and the dozen multiplayer maps included are far more interesting. Though some poor design choices muck up the single-player game, the multiplayer proves to be pretty engaging and a unique online experience on the Xbox 360. You can play through the single-player game in online co-op, which can add a bit more strategy to the proceedings. The Outfit favors wide-spread ruin over finesse, which comes across in the game's presentation. The world of The Outfit, while not terribly expansive, is highly destructible. Tanks and other military hardware explode satisfyingly enough, and with a little effort, you can knock down trees, level buildings, and bust right through defensive walls. If you're rolling in something with a little heft, you can roll over soldiers, smaller pieces of military hardware, low walls, and various barriers. You can get a good ~bull in a china shop~ thing going, but as with any game that touts destructible environments as a bullet point, it only makes the indestructible parts of the environment stand out that much more. There are some other nice little touches, such as the way a tank will rock on its suspension a little when it is initially air-dropped, the way cannon-fire will briefly bathe the immediate area in a flash of light, or the cloud of dust and smoke that will waft out of the back of an antitank cannon, but these highlights are overshadowed by other shortcomings. Character models are chunky and feature some stiff, repetitive animations. Textures are wildly inconsistent, going from crystal clear to ~what the heck is that even supposed to be...a briefcase?~ Funny-looking rag-doll deaths abound, though soldiers shot with a cannon or flamethrower crumble into weird Sarah Connor-style logs of ash, which is actually even weirder than watching your guy's limbs flop around like some kind of epileptic marionette. The game takes on a different kind of taint depending on whether you're playing it in HD or standard definition. HD makes the game's level-of-detail and shadow-mapping issues more prominent, while standard definition makes all the textures look a bit more crudded up. Everything explodes in The Outfit. Well, almost everything. The soundtrack features a somewhat predictable blend of military marches, driving guitars, and electronic beats--derivative, yes, but still quite effective. The voice acting sees the three main characters playing perfectly into their tough-guy archetypes--J.D. sounds gruff and stern, Deuce sounds gravely and stern, and Tommy sounds almost exactly like John Wayne. The supporting cast features a cattle call of fake French and fake German accents that go between awkward and really bad. Some of the explosive effects pack a punch, and there are occasionally some great 5.1 moments, such as when you're defending a position against wave after wave of Nazi fighter planes, but a lot of the in-game effects ring hollow. The Outfit's multiplayer game goes quite a ways to redeeming the monotonous single-player campaign, but it still doesn't fully excuse the game's myriad of other faults. An action strategy hybrid of this kind has been done before, and done better by games such as Battalion Wars or Kingdom Under Fire: The Crusaders, but still, it's a one of a kind on the Xbox 360, at least for now."}