{"ref": "https://www.gamespot.com/reviews/darkness-within-in-pursuit-of-loath-nolder-review/1900-6183415/", "date": "November 28, 2007", "game_name": "Darkness Within: In Pursuit of Loath Nolder", "text": "It doesn't seem to have been very long ago that H.P. Lovecraft was a cult phenomenon. But as of late, his stories have become a source of inspiration for a number of recent games. And this has generally been a very good thing--that is, until Darkness Within: In Pursuit of Loath Nolder. This point-and-click adventure from Zoetrope Interactive may loudly proclaim its debt to Lovecraft through press releases and goofy character names, but the actual game is a lackluster mystery in which you solve problems by taking turns playing grad student and scavenger hunter. Even though plot points have been ripped off from classic Lovecraft stories such as ~The Call of Cthulhu~ and ~The Shadow Over Innsmouth,~ and stereotypical drivel about ancient cults and a horrible family secret is front and center, this game is as scary as a moldy piece of bread. Everything here is a dreary recitation of adventure-game procedure, totally predictable and totally boring. Scared yet? Darkness Within is a clearing house of lame spooks like this skeleton with glowing eyes. Its pedestrian plot is a major drag. You play Howard E. Loreid, a British cop looking for a private investigator named Loath Nolder who has apparently just escaped from a mental hospital. This private dick is the main suspect in the murder of amateur archaeologist Clark Field, so you're trying to track down Nolder while at the same time determining if he could actually be a killer. As is par for the course in these Lovecraft yarns, you're soon crawling around in dank wells, researching sinister cults, having weird prophetic dreams, and apparently going mad with the strain of all this forbidden knowledge. Although all this sounds sufficient (if also spectacularly hackneyed) on paper, Zoetrope doesn't do anything with its setup. Aside from eerie noises and the protagonist going wacko due to nightmares, there aren't any thrills and chills here. Loreid just doesn't seem all that concerned about his crazy nocturnal fantasies or the possibility of winding up in the nut house. The game's acting and dialogue is usually good, but there is barely even a hint of tension in this character's voice. He muses over hallucinations and possibly losing his mind with all the deadly seriousness of a guy trying to decide between having the ham and cheese or the BLT for lunch. This is one down-to-earth lunatic. Loreid also seems like more of a bookworm than a detective plumbing the occult, given that he spends most of his time nosing through books and manuscripts. Trying to spot the Lovecraft references (catch that Kingsport-brand radio?) that the developers have sprinkled through the game is about all that will keep you awake at times. Poor mechanics make Darkness Within even more of a test of your patience. Instead of being left alone to read texts for hints and to hunt down objects needed to open drawers and the like, you have to actively collect clues through activities such as underlining passages in documents. These clues are gradually collected in a list in the inventory screen, where you drag them into boxes and click on a gear icon to get Howard thinking. If you've combined the right clues, you're rewarded with a new clue, or the ability to do something in the game like access a new location. For example, if you're searching through documents to find the numbers needed to open the lock on a briefcase, you can't simply pick out the clues yourself and spin the right digits. You have to identify and then underline hints in the docs first, which in turn generates clues on the list that you combine to generate the necessary numbers. Even though the underlining minigame is sort of neat in the way that it tests your detection skills (clues don't jump out at you, either, so you really have to read), it's deeply frustrating to jump through hoops to prove something that you've already figured out. Everything here requires a few extra steps. At the start of the game, you can't even check out an askew picture without matching it up against an earlier photograph of the scene and prodding Howard into an ~A-ha!~ moment in which he notices that the room has changed. The whole procedure is reminiscent of doing math and having to show your work to prove to the game that you know what you're doing and aren't just guessing at solutions. Some of the clues in the game are pretty complex, although it's still awfully annoying to spell out all of your deductions in the interface. At least this busywork doesn't make up the entirety of the gameplay. You spend a fair bit of time reading, and you pick up the odd bit of junk like rope and varnish solely because you can, but other than that you simply trudge from one gloomy, bland location (aside from the odd creepy crypt, you spend virtually the entire game in various living quarters and offices) to another, apparently in search of something that finally goes bump in the night with real menace. Only the odd logic puzzles mix things up, and they're too rare to have any real impact on gameplay. Most also deal in generic and unchallenging tasks in which you piece together broken tablets, set up cogwheels, turn rings, etc. If Lovecraft had produced tedious, fussy tripe like Darkness Within: In Pursuit of Loath Nolder, his fiction would have been forgotten before the Second World War. Don't expect this game to linger very long in anyone's memory, either, which is probably its biggest saving grace."}