{"ref": "https://www.gamespot.com/reviews/texas-hold-em-review/1900-6156375/", "date": "August 23, 2006", "game_name": "Texas Hold 'Em", "text": "With classic card games like Hearts, Spades, and even Uno getting the Xbox Live Arcade treatment, it was only a matter of time before poker came running up to join the party. In this case, it's Texas Hold 'em, a functional, if somewhat middling take on the Cadillac of poker games. Though no one has produced one for the Xbox 360 as of yet, poker games that heavily feature Texas Hold 'em in a single- and multiplayer setting aren't anything new, and Texas Hold 'em for XBLA doesn't do anything special or unique to set it apart from the pack. Still, if all you want is to play against your friends or get in on the occasional tournament, Texas Hold 'em scratches the appropriate itch. If you like your poker streamlined to the point of pure functionality, Texas Hold 'em is probably up your alley. Though Texas Hold 'em offers both a single-player mode and a multiplayer option, multiplayer is really what you'll want to stick to. The single-player mode, despite offering a number of tournaments, standard games, and specific scenarios (such as being the short stack at the final table, or going heads-up with even stacks), has an artificial intelligence that's so severely boneheaded that it makes the mode all but worthless. You can mercilessly bully any opponent into folding, no matter what the table position is or how much they've already committed to the pot. After a couple of rounds, you should be able to just win any single-player game every single time if you know what you're doing. If you don't, Texas Hold 'em is adequate in terms of showing you the rules of the game, but don't expect to pick up any real strategies unless you go online. And even then, stick to tournaments and games against friends you know aren't going to play like clowns, as the open-table games are littered with players going all-in every single chance they get. Those are the breaks when you play with fake money, but it's still pretty annoying to put up with. Another annoyance is that you'll often find yourself waiting for long periods of time to get into open-table games, due to the fact that you'll have to wait for the big blind to come back around to you before you can jump in. This is a completely understandable provision, as it forces people to pay to start playing, but if someone busts out before it comes back around to you, and it screws up the flow of the blinds, the game sometimes resets the queue, forcing you to wait even longer. Given how many people like to go all-in, this could happen to you a lot. Those issues aside, Hold 'em plays well online. The pacing of the game is slower than even most free poker programs available on the Internet, but the interface gets the job done in terms of letting you do all the key things, like being able to choose to muck or show your cards when you call an opponent, or force everyone to fold. Your bankroll is persistent, so whatever you win or lose at a table both online and off is saved immediately following the game. If you bust out, you can just rebuy, but some tournaments and games require exceedingly high chip stacks to get into, so if you just throw all your money away over and over again, you won't get to play in those games. Your bankroll is persistent across all modes, so if you want to keep your stack up, don't play like an idiot. Texas Hold 'em's presentation is functional, though it has zero in the way of bells or whistles. The game takes place on a static table with a camera that can be angled up and down, but that's it. There are no polygonal players or anything to mess with, and as of now, the promised Xbox Live Vision support isn't functioning. Supposedly it will be up and running around the time the camera launches, though considering the camera already works in Uno, that's a little weird. The poker heads-up display is decent enough, though the text and even suit markers can be tough to make out on a standard-definition TV. The audio is just a bunch of chips clacking and some cheesy blues guitar riffs that build endlessly yet never pay off with any sort of guitar solo. If you're a beginner to the world of poker, or an experienced player just looking for a new online multiplayer option, Texas Hold 'em does the bare minimum to suit your needs. There's no reason to ever play the single-player mode except to unlock some of the game's achievements, but the multiplayer has enough going for it to be a decent amusement. Incidentally, if you download Texas Hold 'em within the first 48 hours of its release, it is fully a free download, and you never have to pay for it following that 48-hour period. After that, you'll be dropping 800 points on this bad boy. Our advice? Grab it before that 48-hour mark is up. It's certainly worth the 26 megabytes of space the game takes up on your Xbox 360 hard drive, but it's not necessarily worth $10 of your money."}