{"ref": "https://www.gamespot.com/reviews/nervous-brickdown-review/1900-6175235/", "date": "July 17, 2007", "game_name": "Nervous Brickdown", "text": "There are plenty of ways you can make an old video game concept feel fresh again. You can gussy up the graphics, turn 2D into 3D, or maybe even slap some recognizable personalities on the box, be they fictional or otherwise. However, Nervous Brickdown goes its own route--or should we say routes? It offers a suite of unique variations on the classic brick-and-bat gameplay typified by such games as Breakout and Arkanoid. Some of the variants in Nervous Brickdown offer just a simple twist, while others virtually rewrite the formula, sometimes making the game feel more like a shooter or a dungeon crawler than a Breakout clone. The differences also go beyond just the mechanics, with each variant sporting a striking visual style and some fitting, often quite catchy, music. The results aren't always consistent, but Nervous Brickdown hits more often than it misses. Who knew a Breakout clone could be so much fun in 2007? The beauty of using such a familiar gameplay template is that Nervous Brickdown feels immediately familiar; before you even realize anything weird is going on, you can jump right into the game. Using the stylus, you drag a paddle back and forth across the bottom screen, bouncing a ball into a field of destructible bricks on the top screen. The game acknowledges its biggest influences in its first stage, a very sincere homage to both Breakout and Arkanoid. Power-ups will drift down the screen when you hit certain bricks, there's a glassy, vibrant visual style, and there's repetitive but undeniably catchy synthesizer music that could've been ripped straight from an '80s arcade game. After you clear the first 10 levels and advance to the next stage, things start getting a little stranger. The game shifts style completely, looking like a notebook full of doodles accompanied by a blipping background track that makes interesting use of vocal samples. Instead of rectangular blocks, you'll be knocking the ball against ink blots with a paddle that you'll actually have to draw yourself. How you draw the paddle will determine how the ball will bounce off of it, implicitly encouraging some avant-garde paddle design. Furthermore, in this stage, as well as a few others, the paddle isn't restricted to horizontal movement, allowing you to move the paddle freely about the bottom screen and making it possible to put some real heat behind your hits. From there, you'll travel through a haunted house where you'll blow into the DS's microphone to bust ghosts, use a submarine to save people from the threats of drowning or marauding sharks, attempt to contain a laser beam with an increasing velocity, and more. There are 10 stages in all, each of which consists of nine regular levels and a boss fight. Although it's not hard to tear through the game in a few hours, there are so many novel concepts at work, so many well-realized art styles, and so much catchy music that many will inspire multiple plays. Additionally, there's a simple cooperative two-player component where color-coded blocks determine which player's paddle will actually be able to make contact with the ball at any given time. The blocks slowly but surely push down from the top of the screen, and a single game can last as long as you keep the blocks from pushing too far down. It's novel, and the dreamy, minimalist music is sublime, but it wears out fairly quickly. However, this shortcoming is at least partially mitigated by the fact that you only need one copy of Nervous Brickdown to play. In one level, you're fighting ink blots; the next, you're fighting ghosts. How great is that? The radical shifts in look and feel from stage to stage do a lot to keep Nervous Brickdown feeling fresh, but there are problems. The ambitious concepts can occasionally outstrip the actual gameplay, and there are certain moments when it feels like blind luck is a greater factor in whether you'll make it to the next level. This creates an inherent trial-and-error pattern, but because levels are presented in groups of three, you'll regularly have to play through two problem-free levels before you get to the one that really stumps you. To its credit, the game rewards you with bonuses, such as extra lives and the ability to affect the trajectory of the ball by blowing into the microphone the more time you spend on any given stage. Underneath its slick presentation, as well as inspired gameplay twists and turns, Nervous Brickdown is still basically just a fancy version of Breakout. This makes it all the more surprising that it is so fun and captivating to play. It doesn't reinvent the wheel, but it goes to show you how far a strong sense of style and some solid basics can get you."}