{"ref": "https://www.gamespot.com/reviews/myst-v-end-of-ages-review/1900-6133977/", "date": "April 19, 2006", "game_name": "Myst V: End of Ages", "text": "It's been more than 10 years since Myst revolutionized adventure gaming with its beautiful, surrealistic scenery, its elegantly simple point-and-click interface, and its mind-bending logic puzzles. And now the series is officially concluding with Myst V: End of Ages, a game that stays true to its roots, such as by having a remarkable audiovisual presentation. Last year's Myst IV: Revelation was created by Ubisoft Montreal, which did an excellent job of following in the footsteps of Myst's original developer, Cyan Worlds, who returned to the helm for this final chapter. Ironically, then, Myst V omits a few of the key presentational features that made last year's game so captivating, and its fully 3D graphics aren't necessarily a superior alternative to the prerendered scenes of most previous Myst installments. Regardless of that, Myst V concludes this landmark series with dignity and style, delivering a challenging and sophisticated adventure that contains a number of satisfying moments. A difficult but captivating journey awaits in Myst V, which invites you to tour the ages of the D'ni one last time. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Myst V: End of Ages Video Review Myst V doesn't expect you to have previous experience with the series, and as its story unfolds, there's a fair bit of summary about what transpired in previous installments. In addition to seeing some strange creatures darting around in the darkness, you'll encounter two characters early on in your adventure: a tormented woman named Yeesha, and an enigmatic man named Esher. Yeesha's diaries are scattered throughout the game, cryptically explaining the predicament you're all wrapped up in. Meanwhile, Esher will often appear (and disappear) out of thin air, telling you about the place you're in and offering veiled clues on how to proceed. Esher looks and moves like a real person, but it's the voice work by David Ogden Stiers that brings this interesting character to life. It's clear early on that Esher and Yeesha are not fond of one another, though neither character's motives are apparent. As such, what eventually transpires feels like a bit of a letdown, since the subtlety of these two characters completely breaks down and their agendas and personalities become obvious. This happens with all the unpleasant abruptness of turning on bright, fluorescent lights in a dark room. Nevertheless, Myst V mostly does a good job of thinly layering tantalizing bits of storyline as you make progress, compelling you to discover what's really going on. As in previous Myst games, you view the world of Myst V from a first-person perspective and may play through the entire game using just the mouse, which lets you easily navigate the assorted landscapes. There's no danger to battle--just places to explore and mysteries to solve. By default, Myst V plays like older Myst games by limiting your movement from node to node--you can only travel from one specific point to another. However, you have the option to switch to an ~advanced~ control scheme that lets you move freely throughout the environment, using mouse-and-keyboard controls that have long become standard in first-person-perspective games. A third variant is also present, combining node-based movement with the ability to freely look around just by moving the mouse. The advanced control scheme is probably the best, since it lets you quickly get around without having to scan each node for other points you could move to. However, the advantage of node-based movement is that the game will make sure you're standing in the right position to solve various puzzles. If left to wander around on your own, you might have more trouble figuring out exactly where you're supposed to go. Several different control methods allow you to explore Myst V's fully 3D environments any way you prefer. Presumably these three different control schemes are there so that players can find one that really suits them, which will help them get immersed in Myst V's visually striking world. Yet much like how it's possible to fruitlessly pursue a false lead while trying to solve one of Myst V's difficult puzzles, it seems the developers of Myst V implemented these options at the expense of certain subtle details that might have made for a more enthralling experience. The absence of these details is especially noticeable since they helped make Myst IV's world feel so alive. Unlike in that game, here you won't be able to interact with any objects except for ones that are somehow important. So even though you'll be seeing all kinds of wonderful contraptions and architecture, it's all window dressing, since the only stuff you can use tends to be tied to the game's puzzles. You also can't hear your character's footsteps, so all the unusual textures you'll be walking (floating?) over make no sound. Myst V is certainly pretty to look at, but it doesn't wholly succeed at making you feel like you're really there in its imaginative worlds. Fortunately, Myst V does succeed at presenting you with some difficult, interesting puzzles. Pattern recognition and keen observation of subtle cause and effect will help you overcome the environmental challenges impeding your progress. Your journey through Myst V will primarily take you through four different worlds, or ~ages,~ and the goal in each one is to find a special object whose power can only be harnessed once it's found in all four ages. In each age, you'll find a slate--a mystical stone tablet, which you may pick up and carry around and also inscribe with special symbols. The slates are a new addition to the traditional point-and-click gameplay, and they introduce a pleasant twist to the series' formula, yet without unnecessarily complicating the deliberately simple mechanics. Basically, the slates are used to communicate with those weird creatures you see early on, called the bahro. The bahro may teleport, or ~link,~ at a moment's notice, and if you drop a slate on the ground, one of them will show up and return it to its pedestal. A strange man named Esher and a stranger race of creatures called the bahro help liven up Myst V's desolate settings. You can draw on a slate using the mouse, and in each age, you'll need to discover and draw certain symbols that the bahro understand. Some of these may cause different environmental effects to occur (such as a rain shower or a wind storm), and you'll need to discover how these can be used to your advantage. The environmental effects last for a limited amount of time, adding a sense of urgency to some of Myst V's puzzles, though the only consequence for running out of time tends to be just having to try again. You'll also need to use slates to link to other parts of each age. As you discover more about the slate in each age, you also gain the ability to move more freely throughout the age by linking between key points, so there's a liberating feeling as you unlock the secrets of the places you explore. As you make progress through Myst V, eventually you're given the freedom to investigate the remaining ages in whichever order you wish. This helps give you some options should you get stuck and start feeling frustrated. Because the game consists of a variety of different ages, there's a certain thrill in discovering what sort of place you'll set foot in next. One of the ages is particularly breathtaking, while a couple of the others look a little too similar. Overall, the game makes good on one of the core appeals of the Myst series, which is to take you to places that look like they could be real, but simply do not exist in nature...not as far as we know, anyway. Myst V's fully 3D visuals are impressive for the most part, though you'll need a high-end system to appreciate them looking their best. On slower machines, the game runs quite choppily, which can be distracting but fortunately isn't detrimental to gameplay. The few characters are also fully 3D, and the human ones are motion-captured and made to look photo-realistic. At times, this technique makes them look a little odd, while at other times the results are fantastic and the characters really do look--and act--real. As for the audio in Myst V, it's about as minimal as you'd probably expect, mostly consisting of ambient noises that help bring the various ages to life. There's not much music, but what's there fits the theme well and sets the proper tone for the different ages. Again, though, footstep sounds are noticeably absent, and fans of the previous Myst game will also miss how that game let them tap on every object in the environment to get a feel for its mass and texture. Farewell, Myst. You'll be missed. The conclusion of Myst V isn't as dramatic or as apocalyptic as you might expect from a game that's billed as the very last installment in the series. In fact, if not for this billing, you probably wouldn't come away from Myst V thinking that this was the end. But assuming this really is it, Myst V: End of Ages is a fittingly dignified ending to a series of games that ushered in a new era for a genre that once ruled the PC. Today, adventure games are not as prevalent as they were when Myst first appeared more than 10 years ago. So it seems appropriate that Myst V comes across as reverent of its origin to the point of restraint, as if the game didn't dare try to supersede the standards of its predecessors. Fortunately, Myst V does succeed at presenting you with some difficult, interesting puzzles. Pattern recognition and keen observation of subtle cause and effect will help you overcome the environmental challenges impeding your progress. Your journey through Myst V will primarily take you through four different worlds, or ~ages,~ and the goal in each one is to find a special object whose power can only be harnessed once it's found in all four ages. In each age, you'll find a slate--a mystical stone tablet, which you may pick up and carry around and also inscribe with special symbols. The slates are a new addition to the traditional point-and-click gameplay, and they introduce a pleasant twist to the series' formula, yet without unnecessarily complicating the deliberately simple mechanics. Basically, the slates are used to communicate with those weird creatures you see early on, called the bahro. The bahro may teleport, or ~link,~ at a moment's notice, and if you drop a slate on the ground, one of them will show up and return it to its pedestal. A strange man named Esher and a stranger race of creatures called the bahro help liven up Myst V's desolate settings. You can draw on a slate using the mouse, and in each age, you'll need to discover and draw certain symbols that the bahro understand. Some of these may cause different environmental effects to occur (such as a rain shower or a wind storm), and you'll need to discover how these can be used to your advantage. The environmental effects last for a limited amount of time, adding a sense of urgency to some of Myst V's puzzles, though the only consequence for running out of time tends to be just having to try again. You'll also need to use slates to link to other parts of each age. As you discover more about the slate in each age, you also gain the ability to move more freely throughout the age by linking between key points, so there's a liberating feeling as you unlock the secrets of the places you explore. As you make progress through Myst V, eventually you're given the freedom to investigate the remaining ages in whichever order you wish. This helps give you some options should you get stuck and start feeling frustrated. Because the game consists of a variety of different ages, there's a certain thrill in discovering what sort of place you'll set foot in next. One of the ages is particularly breathtaking, while a couple of the others look a little too similar. Overall, the game makes good on one of the core appeals of the Myst series, which is to take you to places that look like they could be real, but simply do not exist in nature...not as far as we know, anyway. Myst V's fully 3D visuals are impressive for the most part, though you'll need a high-end system to appreciate them looking their best. On slower machines, the game runs quite choppily, which can be distracting but fortunately isn't detrimental to gameplay. The few characters are also fully 3D, and the human ones are motion-captured and made to look photo-realistic. At times, this technique makes them look a little odd, while at other times the results are fantastic and the characters really do look--and act--real. As for the audio in Myst V, it's about as minimal as you'd probably expect, mostly consisting of ambient noises that help bring the various ages to life. There's not much music, but what's there fits the theme well and sets the proper tone for the different ages. Again, though, footstep sounds are noticeably absent, and fans of the previous Myst game will also miss how that game let them tap on every object in the environment to get a feel for its mass and texture. Farewell, Myst. You'll be missed. The conclusion of Myst V isn't as dramatic or as apocalyptic as you might expect from a game that's billed as the very last installment in the series. In fact, if not for this billing, you probably wouldn't come away from Myst V thinking that this was the end. But assuming this really is it, Myst V: End of Ages is a fittingly dignified ending to a series of games that ushered in a new era for a genre that once ruled the PC. Today, adventure games are not as prevalent as they were when Myst first appeared more than 10 years ago. So it seems appropriate that Myst V comes across as reverent of its origin to the point of restraint, as if the game didn't dare try to supersede the standards of its predecessors."}