{"ref": "https://www.gamespot.com/reviews/vexx-review/1900-2910627/", "date": "February 10, 2003", "game_name": "Vexx", "text": "It's surprising how relevant Nintendo's groundbreaking Super Mario 64 has remained in the six years since its release. Sure, other 3D platformers have refined the formula, such as Rare's Banjo-Kazooie or Insomniac's Ratchet & Clank, but the presentation and core mechanics haven't been changed radically. All roads still lead to Mario. In fact, Acclaim's latest 3D platformer, Vexx, plays almost like a tribute to Super Mario 64, re-creating much of that game's structure and play mechanics, though with a darker, moodier visual style. To say it's on par with Nintendo's 3D masterpiece would be overselling it, though. Vexx does little more than imitate, which just isn't enough these days. The setup is so straightforward and predictable, it might as well not even be there. Thankfully, the game gets much of its exposition out of the way before you start the first level. There's you, Vexx, out to save the world and fulfill a personal vendetta against Yabu, evil wizard and oppressor of the dark fantasy realm of Astara. The realm of Astara is conveniently divvied up into nine distinct levels, all of which are accessible from a central hub. To open the gates to each level requires a certain number of shadowraith hearts, which you can earn by completing the many tasks offered in each world. Upon selecting a task, the game will feed you some vague text hinting at what your task actually is, though once you're in the level, arrows point you in the right direction. These tasks span a pretty good range of the preexisting 3D platformer goals, including a couple of varieties of basic item collection, some switch flipping, the occasional boss fight, and a great deal of straight-up platform jumping. There are a few pleasant surprises, like the minigame levels, in which you face off against three evil versions of yourself in a series of contests, or the tasks that put you inside a painting, turning the action into a straight 2D platformer. But, for the most part, there are few surprises in Vexx, and many of the tasks--especially the platform-jumping-intensive ones--will put you in tedious trial-and-error mode. But at least the variety of the tasks is respectable, and the ability to choose the tasks in an order that pleases you keeps things moving. Vexx, our razor-clawed hero of indeterminate species, does everything a platforming dude should do, plus a bit more. Running, jumping, shimmying along and hoisting himself up onto ledges, double-jumping, butt-stomping--they're all there. What separates Vexx from the pack are his attack moves, which have a propensity toward tossing enemies in the air and keeping them there with strings of juggle attacks. Vexx can actually gain energy from performing lengthy attack-combo juggles, and once he's full up, he can perform special dash attacks and energy blasts. Once you master Vexx's commendable arsenal of moves, you'll be able to keep several enemies reeling through the air at once, though the combat is rarely central to the task at hand, and the enemies don't employ very challenging tactics. The juggle system in Vexx is a neat twist, but it exists mostly for the sake of theatrics. The realm of Astara doesn't embody the classical D&D fantasy archetype, instead drawing from the grim, quasi-mystical feel of something like Dark Crystal. The out-of-doors levels in Vexx all appear to be suspended in a sea of nothingness, with tumbling rocks and other debris just sort of floating around. The design of the levels, as well as the freaky-looking enemies you'll run into, try to maintain the game's bizarre and fantastical facade, but the rest of the proceedings are so incredibly familiar, the presentation isn't as effective as it could or should be. Vexx himself, who appears to be some kind of anthropomorphic punk rock rodent with outrageously big claws, looks like an amalgam of what several different people would think the ideal platforming hero should look like, as though he were designed by committee. The overall presentation is made even less effective by a lack of technical prowess. The environments, though fairly unique from level to level, look chunky and are covered with inconsistent textures that tend to err toward muddy. Vexx has a rather mechanical look to his movement, as do most of the enemies you'll encounter. Though, to their credit, some of the boss characters have a bit of personality, most notably the morbidly obese sumo wrestler you'll encounter. To be blunt, Vexx does its job to the basic requirements, and fails to impress beyond that. The sound design in Vexx is uniformly weird and minimalist. Vexx himself doesn't talk much, keeping his self-expression limited to a handful of grunts and hups. Your foes will cry out when attacked, and these sounds range from odd to really, really weird. Some enemies make it sound like you're beating a goat, others make it sound like you're deflating a balloon, but rarely do these effects match up with the character designs. There's very little to the music in Vexx. You'll hear only a modest little crescendo upon completing one of your tasks, and rarely anything beyond that. Vexx is not a terrible game. Yes, the graphics are a touch dated. Yes, the mechanics are familiar, perhaps to a fault. And, yes, the sound design leaves much to be desired. But what undercuts Vexx the most is the increased level of polish and innovation other recent 3D platformers have brought to the table. Had it been released just a year earlier, it probably would've fared much better. But as it stands, Vexx feels outdated right out of the gate. 3D platformer fans, hard-core or casual, can just do better."}