{"ref": "https://www.gamespot.com/reviews/black-and-white-2-battle-of-the-gods-review/1900-6148209/", "date": "April 26, 2006", "game_name": "Black & White 2", "text": "Six months after Black & White 2 hit stores comes Black & White 2: Battle of the Gods, an expansion pack that adds some new content for would-be gods everywhere to enjoy. Like any expansion, Battle of the Gods features new levels and abilities to play with, though you may find that it's just more of the same. Still, when talking about Black & White 2, that isn't such a bad thing. The creature remains one of Black & White's most-unique features, and he can be trained to be the ultimate warrior. Battle of the Gods once again puts you in the role of a nameless god whose existence depends upon having devoted worshippers. The game takes its name from the fact that you can be as good or as evil as you want, from being a benevolent god in a happy land to being an evil god in a dark and twisted land. As you'd expect, Battle of the Gods picks up after the events of Black & White 2. Just when you thought that everything was okay, a new undead god appears, complete with an undead army of skeletons--not to mention a cool, undead new creature. Once again, it'll be up to you to crush this rival god on various isles by nurturing your followers and building a flourishing civilization that lets you either assimilate the Aztec god's followers peacefully or militarily. The core gameplay remains pretty much unchanged in the expansion, though you do get to battle it out on a handful of new islands, some of which feel downright huge compared to those seen in Black & White 2. If you played Black & White 2, you can import your existing creature to Battle of the Gods, but if you didn't play that game, you can jump into the expansion immediately with a new creature. There are two new creatures to choose from, as well, boosting the total up to six. Regardless of whether you import an existing creature or start anew, you'll begin the expansion with a boatload of tribute points, and you'll have to purchase the buildings and powers that you'll start with. Again, it's simple and easy to build up your follower's cities, as pretty much the entire game can be played without ever touching the keyboard. Just use the mouse to do everything from laying out cities to picking up and dropping citizens around on the map. You can also use the mouse to punish or reward your creature for its behavior, so it's easy to quickly train it to do what you want, from fertilizing fields with its manure to knocking down enemy walls. The expansion does introduce new building types and powers. While it's nice that you can now build crossroad signs that help your followers move around the town more easily, this and other features don't seem to have a big impact on the overall game. Meanwhile, the difficulty level remains about the same, as the artificial intelligence is content to send platoons at you in a steady and regular stream, making it easy to crush them with your creature. Defeating the enemy is also unchanged. While it's possible to simply assimilate them peacefully by building a grand city that makes them want to defect, the sheer size of some of these maps can make this a long and drawn out process, since you'd need a huge and impressive city. So you can send your creature into the fray to defeat the enemy's creature and crush the Aztec armies, while building platoons to seize and capture Aztec towns. Whether you pursue a peaceful or militaristic approach, you'll find that it'll take you hours to get through each map, which is probably a good thing considering there are only a handful of new maps in the expansion. Most of the game is spent city building, and once again it's up to you to squeeze as many buildings as possible into a limited space. Perhaps the biggest noticeable change is the addition of more minigame challenges that you can pursue for tribute points, which let you unlock new buildings and powers. These challenges can provide a short diversion from the main focus of the game, as you can solve puzzles, partake in some ice curling, shoot down zombies with lightning bolts, and more. Then again, these diversions aren't really necessary, and you'll usually tackle them at the end of a level after you rout the Aztec god from the land. Battle of the Gods is a fairly straightforward expansion, as it introduces some new content for Black & White 2 fans to enjoy and it sticks to the safe path of more of the same. The visuals and production values remain relatively unchanged and are fairly good, though there's an annoying graphical glitch that we saw in Black & White 2 that still hasn't been addressed, that being the weird streaking effect whenever you zoom in on your creature. Still, if indulging a god complex is your thing, you'll probably enjoy Battle of the Gods."}