{"ref": "https://www.gamespot.com/reviews/the-sims-3-world-adventures-review/1900-6241569/", "date": "November 30, 2009", "game_name": "The Sims 3", "text": "Upon initial consideration, it seems unusual that the first expansion for The Sims 3 would revisit a concept the series has already trod. After all, in 2002, The Sims: Vacation let you visit three different travel venues and introduced a few new (but minor) concepts to the formula in the process. The Sims 3: World Adventures sends your digital counterparts back on the road, but don't assume that this expansion simply retreads what has already been done. World Adventures isn't just a bloated content pack, but rather it introduces new ideas to the series, fun rewards, and great new areas to explore. If you've somehow overcome your addiction to The Sims 3, the expansion feels so fresh that you'll be able to overlook its scattered flaws and devote yourself once again to the happiness of your little computer people. The puzzles won't tease your brain, but they will tickle your fancy. Like Vacation, World Adventures introduces three new locations to discover--in this case, France, Egypt, and China. Traveling costs a few simoleans, of course, but even if you haven't been playing The Sims 3 for long, you should be able to afford a visit to the Egyptian tombs or the Terracotta Army. You simply tap a few buttons on your in-game cell phone or computer, choose a destination, and you're whisked (if you can call it whisked, what with loading times lasting upward of two minutes) away to your overseas adventure. The first thing you may notice upon arrival is the job board outside of your base camp. Using the board, you can select an adventure, which may entail a task like talking to a local in need, who in turn will send you off to retrieve a priceless artifact, search for items lost in the desert, or have a chat with the neighbors about their lights. Most of these tasks involve exploring tombs, dungeons, and other subterranean environs; collecting loot; avoiding traps; and pushing a few statues around to solve puzzles. It's like a role-playing game, just without the sword swinging and spellcasting. And like with dungeon-crawling RPGs, it's hard to tear yourself away from the tomb raiding once you've started. The actions you take during your subterranean jaunts aren't complex: pull a lever, examine a strange-looking wall, stand on a plate to trigger a door, and so on. However, the moment-to-moment balancing of your sims' needs (such as energy or bladder) enrich the exploration, and the loot you find sweetens the deal, because it affects you outside of the adventure. You'll find relics that you can sell or display in your home, ancient coins that you can use to purchase cool items from a specialty merchant, and more. Additionally, completing adventures raises your visa level, which in turn allows you to take longer vacations and get access to better items from the specialty vendors, among other perks. Yet while the rewards are the biggest part of what makes adventuring so involving, the exploration is entertaining in and of itself. You may need to navigate a hedge maze while retrieving artifacts, look for secret doors, or pray to the statues adorning the area. And, of course, you'll want to take a tent, some morsels of food, and the charmingly illogical ~shower in a can~ to keep your standard needs met while you trudge about the dim dungeons. Even when you've left your vacation behind and returned to your life back at home (time stands still in your own neighborhood while you're away), you'll find that the new content is expertly woven into the old. For example, if you are a musician, you might get an opportunity to learn about the musical traditions of Egypt. Completing the task entails learning several different folk songs from the Egyptian populace--which you can in turn teach to other sims in all locations. As you play, the game frequently prods you to visit your homes away from home, and each visit is rich with the charms and surprises for which the series is known. The new Simlish phrases and sim animations are whimsical and enchanting, and the new areas are fun to investigate. The new music is quirky and upbeat, and while occasionally plain, the villages and tourist attractions are lovely to look at. However, like previous expansions in the Sims series, World Adventures doesn't fix any faults, and in fact, it calls attention to existing ones. As you run (or bicycle or motorbike) to your next adventure, texture pop-in and visual jitters become more noticeable than before, and the camera gets shaky when you traverse the newer hilly areas and navigate tight tombs. You can meet your daily needs at the base camp, though eventually you'll be able to own your own vacation home. The quests and ensuing rewards aren't the only delights you'll gain from playing World Adventures. If you like the scenery, you can snap a photo and sell it or hang it on your wall, which is a great way to enhance a themed room. And if you're into theming, the fun doesn't stop there. The expansion includes all sorts of new furniture and decor, so if you want to turn your backyard into a Chinese garden, you've got new foliage and lighting to do it with. If you stared with envy at your new Egyptian friend's furnishings, you can purchase them for yourself and turn your dining room into a mummy's paradise. In fact, should you really get into the tombs, you can even build one yourself. The new basement tool lets you build up to four floors underground, and you get access to all the traps, levers, and other accoutrements you encounter during your adventures. For an extra good time, add a dungeon to a community building and share it with others using The Sims 3's sharing tools. Additional goodies include pagoda-style roofs, new traits and lifetime rewards, new books and food items, and a lot more. The Sims 3: World Adventures further explores the series' continued focus on performing specific tasks for specific rewards, yet offers enough new tools, items, and social interactions to please those who prefer the free-form play for which The Sims is known. From martial arts and nectar (that is, wine) making, to firetraps and puzzle solving, there's a lot to do and a lot of playthings to muck about with. This expansion may not fix the few technical troubles that still ail The Sims 3, but it adds enough to keep your mind off the drawbacks and centered directly on the fresh and wonderful new content. In other words, Sims fans should expect plenty more sleepless nights ahead."}