{"ref": "https://www.gamespot.com/reviews/chicken-shoot-review/1900-6173751/", "date": "July 6, 2007", "game_name": "Chicken Shoot", "text": "Certainly the Wii would seem to be an ideal system for light-gun games. Just point the Wii Remote at the screen, fire away at zombies, soldiers, terrorists, or whatever else happens to pop up onscreen, and a good time should be had by all. Unless, of course, you're shooting chickens--specifically, in Chicken Shoot, a DSI-published release that is actually a Wii update of a PC downloadable game that's nearly five years old. Imagine the old NES classic Duck Hunt, now toss in a couple of poorly implemented bonus weapons, make the ducks a bunch of wacky chickens, and make the action as soul-crushingly boring as possible. That's Chicken Shoot in a nutshell. There are a few different modes to be found in the game, though nearly all of them are essentially the same thing. Arcade and classic mode are identical, except that the criteria for moving on are slightly different (one requires shooting a certain number of chickens to move on, whereas the other is time- and score-based). In both of these modes, you're plopped down in some slightly zany location, like a farm, or the Nevada desert, or the Himalayas (where the soundtrack consists of a lot of yodeling, for some inexplicable reason). From there, chickens from all walks of life pop onto the screen at varying intervals. You just point the Wii Remote at them and press B to shoot. That's it. That's the game. These harmless chickens just keep popping up, and you keep popping them off. Occasionally you get weapon power-ups and bonuses like time boosts, but some of them are more like punishments than bonuses. The shotgun is actually way less effective than the standard pistol, and getting a time bonus in this game is sort of like voluntarily extending a torture session. That chicken is just washing her clothes. What the heck did she do to deserve getting shot in the face? If the game were challenging, or actually funny, you might be able to tolerate the insipid gameplay, but it's neither. The only thing that makes the game remotely difficult is the occasional tree-heavy stage that offers some far-away chickens a chance to duck for cover. There's nothing remotely comical about the game. The chickens are all dressed up in various silly characterizations, but there's no punchline to speak of. Hey, there's a chicken reading a newspaper, and there's another one that's some kind of alien just standing around idly. Better shoot 'em! Wait, what? Why? Outside of the crummy primary modes, there's also multiplayer and a really awful minigame to contend with. The minigame consists of you moving the Wii Remote up, down, left, and right to try to catch eggs that are sliding perilously toward the ground. It's about as much fun as actually sorting eggs. Multiplayer is a split-screen version of the main single-player modes, though it's not exactly clear if it's meant to be cooperative or competitive. You're both playing on the same playing field (even though it's split-screen, go figure), and though it's keeping track of both your scores, it never exactly declares a winner, and you can't progress until you reach the same target goals as the single-player matches. Ultimately, it doesn't really matter. The game is just as bad with two people as it is with one. The only solace in the multiplayer is that someone is suffering right along with you. The list of problems just keeps going. You can beat any of the single-player modes in about 30 minutes; there's almost no variety to the enemy chickens; the graphics most definitely look like something out of a five-year-old downloadable casual game; and, worst of all, DSI is charging $30 for this heap of crap. That would almost be insulting if it weren't so hilariously absurd. But then, perhaps that's been the game's big joke all along?"}