{"ref": "https://www.gamespot.com/reviews/the-sims-3-review/1900-6210540/", "date": "June 1, 2009", "game_name": "The Sims 3", "text": "If you're reading this, there's a very good chance that you've heard about The Sims. It's been difficult to escape the popular franchise's web, what with two full games and a seemingly endless stream of expansions. The first thing you may be asking, then, is whether The Sims 3 is worth playing, or if it's just more of the same. Well, it most certainly is worth it, and yes, in some ways it is more of the same. But in this case, that's a very good thing. For anyone who's played The Sims or its first sequel, this familiarity will let them ease into it, feeling like a welcomed guest rather than an outsider. But this doesn't make The Sims 3 a simple rehash of what's come before. Instead, returning elements have been energized and extended by a number of terrific improvements, such as expanded customization tools, additional tools for interaction with other sims (and other players), and more tangible goals and rewards. Most importantly, the free-to-explore town makes you feel like part of an entire virtual society--a feature approximated but never fully realized in the previous games. By blending together the old and the new, developer Maxis has created the best, most charming game yet in the series. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: The Sims 3 Video Review If you're new to the series, here's a quick primer. The Sims 3 is a virtual life simulator. In it, you take control of a character called a sim, or an entire household of them. Sims have needs; they need to empty their bladders, to eat, to sleep, to bathe, to have fun, to socialize. It's real life boiled down to simple mechanics, but within these mechanics lies an entire universe of possibilities. Your sims can have babies who will cry in the middle of the night, needing their diapers changed. You can manage their personal development by sending them to the gym to work out, or by telling them to fix a broken television, or by having them play chess, or by sending them to the park to play the guitar. Sims go to work to earn simoleans (money, of course) so they can buy better things for their homes and redecorate--or just buy a brand-new home. They make friends and enemies, they go swimming, and they clog up the toilet. In other words, they act a whole lot like real people, except that they yammer in a delightful gibberish called simlish and communicate via speech bubbles that appear over their heads. It all sounds terribly mundane, but balancing the needs of your sims and tending to your digital playmates can keep you happily glued to your monitor for hours at a time. For experienced Sims players, the laundry list of new features in The Sims 3 is extensive, but the one overhaul that has the biggest impact on the game is how seamlessly you can now move around your virtual town. In previous games, the presence of various neighborhoods led to a disjointed experience, so you rarely felt like you were in a living world. Now, your burb is freely explorable, so traveling to the gym, the art gallery, or your place of work means walking, biking, driving, or taxiing to the location in question without any loading times to break things up. Want your sim to head to the library and read up on the latest mystery? Just zoom out to the city map and select your destination, and your sim will travel there automatically, using the most efficient means of transportation. You might even get the option to invite someone along with you, so you won't have to head to the diner alone if you've got a friend or acquaintance nearby who's available to tag along. The effect of the open town has a profound influence on the community aspects of The Sims 3. You can call other sims and invite them over using your handy cell phone, but if you're feeling adventurous, just head directly to another sim's house and introduce yourself. Or travel to one of the many public venues: the beach, the park, even the graveyard. In these places, you will have a chance to interact with other sims, and there may even be surprises in store if you happen to be in the right place at the right time. For example, you might be able to join a picnic in progress, or a midnight visit to the cemetery may introduce you to some new see-through pals. The game also provides spontaneous opportunities for your sims to socialize. Other sims will call you on the phone; if you're growing a garden, they may ask you to bring some veggies over in exchange for a few simoleans; or perhaps they'll ask you to repair a broken appliance for them. Either way, these tasks send you out on the town where you'll run into other sims, which gives you a sense of being part of a society that exists outside of your realm of influence. Those social opportunities often result from the traits that you assign your sims during creation. These social traits are another new feature, and they influence how your sims will behave in certain situations, the careers that they will most likely excel in, the conversation options available, and many other aspects of daily sim life. You can select up to five traits for your sim, and there are a lot to choose from. So if you'd like to re-create your insane, neurotic, kleptomaniac aunt within the game, then you can do that, and those traits in turn will influence various aspects of her virtual life. For example, a sim with the neurotic trait can increase his or her happiness level by compulsively checking the sink and stove, but will also be prone to random freak-outs during moments of stress. Not only will a sim with the neat trait automatically clean almost everything, but his or her fun levels will actually rise in the process. For the first time, your town feels like a living society. Of course, when you create a sim, you're choosing more than just personality traits. The physical customization options are far more extensive than before. Sliders let you determine skin color and tweak various facial features, color wheels let you settle on exact clothing hues, and there are a number of accessories, hair styles, and so on to choose from. Although it would be nice to have had even more options in some cases (for example, men's available hair styles seem limited), there's a good chance that you can still create a sim that resembles your kleptomaniac aunt. There's also a good chance that you can outfit her in that crazy polka-dot dress she wears, thanks to the Create a Style feature, which lets you choose from a huge number of patterns (even those used for nonclothing items such as masonry and linoleum) and tweak their colors as you see fit. If you want to put your klepto sim in a beautiful, subtle ball gown, then by all means, go for it. On the other hand, if she prefers swimsuits made of bricks, well, no one's going to judge (except maybe the aunt she's based on). Getting sims together is usually a guaranteed laugh. As before, you can just sit back and let things happen if you prefer, and the AI does a good job with automated behavior; sims will act in ways remarkably true to the personality that you've established for them. But directing social encounters often yields even more hysterical results, and your sims' traits allow you to direct conversations more easily than before. There's a wider array of conversation topics when meeting up with others, and you'll want to play around with all of them just to see how your friends react. Try jumping into a romantic interest's arms--he may not catch you! Take your weakling sim to the gym and watch what happens on the treadmill; kiss another sim in front of your husband and watch the slaps ensue. Or generate your own masochistic amusement by denying your sims the use of a toilet, or putting them in a room without doors. Watching the expressive animations and listening to the dramatic vocal inflections is always a delight, whether it's your toddler sim chewing on her xylophone mallets or the man of the house throwing a tantrum because there are rotting leftovers in the fridge. If you're not inclined toward such cruelty, you're better off making your sims happy by being aware of their needs and desires. You'll set a long-term goal as the final step when creating your sim, choosing from five that are generated based on the traits that you assigned. You may want to be surrounded by family, or be a famous musician, or become an international superspy, or be superpopular. Consequently, you'll need to make choices to bring these aspirations to fruition. If your sim wants to be a famous chef, take the right career track when browsing the paper; go to the bookstore and buy cookbooks to increase your cooking skills; and, of course, cook as often as you can to keep the skill bar moving ever upward. You can even take cooking classes to speed up the process, though it will cost you simoleans. But not every goal must be for the long haul; you can elevate a sim's mood and earn happiness points by accomplishing smaller tasks that pop up. Some of these are relatively simple: make the bed! Others are a little more time-consuming: upgrade five appliances! With the points you earn, you can then purchase permanent goodies such as a steel bladder (never need to pee again!), or always throwing the perfect party, or discovering the traits of other sims much more quickly. The system is more rewarding than The Sims 2's aspirations/fears system because it focuses on rewards and eliminates the sometimes-frustrating business of therapists and insanity. Actually, you can turn aging off entirely if you wish, or adjust the length of a sim's lifetime directly in the game options. In any case, the new aspiration mechanics are more about positive reinforcement than avoiding negative consequences, and the game is better for it. A trip to the bookstore is interrupted by some chatty neighbors. The Sims 3 balances its rewards well, not just within aspirations, but within career and financial progression as well. Like real people, your sims will always want better stuff, a nicer house, and a prettier yard. You'll start with meager means, but as you progress down your chosen career track, you'll earn more money and work less, giving you more time for the fun stuff. Like before, you won't actually guide your sim through the workday, but you will be able to select something to focus on during the day, such as getting to know your coworkers or pursuing independent research. Doing so earns extra benefits; for example, studying music theory will increase your logic skill, letting you kill two birds (a paycheck and an improved skill) with one stone. You'll also be presented with all sorts of choices along the way. Read a particular book or deliver some documents to city hall to improve your standing with the boss, and you might earn a raise. You might even get an opportunity to change career tracks completely (perhaps the military has had an eye on your scientist). As it happens, these kinds of possibilities aren't just related to your job. Perhaps the local school is having a bake sale; you might be invited to whip up some cookies. Thankfully, managing your basic needs--hunger, bladder, and so on--takes less effort than before, giving you more chances to take advantage of these occasions. Your coffers will grow, at which point you'll be spending time in Buy and Build modes. The Create a Style concept is at work here too, so you'll be able to customize furniture, appliances, and even window panes if you so desire. For example, you can go so far as to paint almost every brick in the wall pattern if you want to get that in-depth. Better stuff makes for a more automated and happier life, and it also lets aspiring architects and landscapers showcase their creativity. The tools work much the same as before, though the terrain and terrain-painting tools are easier to use than ever, and the most enthusiastic designers can still use cheat codes to manipulate things further (some of which are handily included in the game's readme file). And if you really take pride in your handiwork, The Sims 3's online features are much better integrated than before, though there is still room for growth in this area. From the game launcher, you can upload and download shared content such as sims, outfits, household objects, and so on. This kind of social exchange has always been an important aspect of The Sims, though in light of the tight online integration seen in games such as Spore, there are some missed opportunities here. For example, placing the browser directly in the game client would have made for a more seamless experience. And though the ability to upload movies to The Sims 3 Web site and edit them is a great new feature, you still have to access this feature through your Web browser. The good news is that there are some great items ready to download the moment you register an account online, including an entire town (which is, thankfully, free). However, most official content requires you to spend SimPoints, which cost real money. That nickel-and-diming points to what is probably The Sims 3's main drawback: Although the game includes a whole lot of content, it still has noticeable holes that the expansions to previous Sims games have already filled. Previous add-ons offered pets to play with, seasonal weather, magical items, and other fun content. None of that is featured in The Sims 3, and certain aspects of the series, such as the events of the standard workday, have gone curiously unexplored. The established pattern of Sims expansion packs make these areas of opportunity all the more apparent, especially when you'd expect a sequel to include most of the popular features of the games that led up to it. Tired of marshmallows? You could always try roasting grapes! One of the reasons for the franchise's success is how easy the games are to run on a variety of computers, and The Sims 3 is no exception; it's very scalable, so chances are that if you have a relatively modern PC, you'll probably be able to run the game. The visuals are colorful and crisp, and a noticeable step up from The Sims 2. Sim movements continue to be the highlight of the presentation, and zooming in close is always a fun treat, especially when your sims are engaging in a particularly animated exchange, such as telling a joke. Buildings like the theater and city hall look attractive, and the soft sway of trees and bushes makes the town look pleasantly suburban. Nevertheless, the game's performance does continue some unfortunate trends of Sims games past. Performance is a bit sluggish when you scroll across the town or follow your sim as he or she travels. And though the pathfinding has improved, sims sometimes still have difficulties getting from point A to point B without going through some odd animations or complaining that there's someone in the way. Unsurprisingly, the game sounds absolutely charming. The jaunty tunes that accompany the Build and Buy modes and the tunes that play when you turn on the radio are terrific, perhaps the best in the series. Some sound effects are recycled, but The Sims 3 doesn't feel cheapened as a result; it strikes a chord of familiarity that works to the game's benefit. So what is it that makes The Sims 3 even more addictive than its predecessors? It's partially due to the deft handling of rewards; it doles out new social options, new aspirations, and the possibility of better furniture and wood flooring at a slow but even pace, which keeps you tied to your computer for hours at a time. It offers the element of surprise, showing off its abundant charms through funny social interactions that make you want to be part of the improved virtual community. Although it could have offered even more right out of the box, there's still an awful lot of content here, and it's bound to put a smile on almost anyone's face. If you're not inclined toward such cruelty, you're better off making your sims happy by being aware of their needs and desires. You'll set a long-term goal as the final step when creating your sim, choosing from five that are generated based on the traits that you assigned. You may want to be surrounded by family, or be a famous musician, or become an international superspy, or be superpopular. Consequently, you'll need to make choices to bring these aspirations to fruition. If your sim wants to be a famous chef, take the right career track when browsing the paper; go to the bookstore and buy cookbooks to increase your cooking skills; and, of course, cook as often as you can to keep the skill bar moving ever upward. You can even take cooking classes to speed up the process, though it will cost you simoleans. But not every goal must be for the long haul; you can elevate a sim's mood and earn happiness points by accomplishing smaller tasks that pop up. Some of these are relatively simple: make the bed! Others are a little more time-consuming: upgrade five appliances! With the points you earn, you can then purchase permanent goodies such as a steel bladder (never need to pee again!), or always throwing the perfect party, or discovering the traits of other sims much more quickly. The system is more rewarding than The Sims 2's aspirations/fears system because it focuses on rewards and eliminates the sometimes-frustrating business of therapists and insanity. Actually, you can turn aging off entirely if you wish, or adjust the length of a sim's lifetime directly in the game options. In any case, the new aspiration mechanics are more about positive reinforcement than avoiding negative consequences, and the game is better for it. A trip to the bookstore is interrupted by some chatty neighbors. The Sims 3 balances its rewards well, not just within aspirations, but within career and financial progression as well. Like real people, your sims will always want better stuff, a nicer house, and a prettier yard. You'll start with meager means, but as you progress down your chosen career track, you'll earn more money and work less, giving you more time for the fun stuff. Like before, you won't actually guide your sim through the workday, but you will be able to select something to focus on during the day, such as getting to know your coworkers or pursuing independent research. Doing so earns extra benefits; for example, studying music theory will increase your logic skill, letting you kill two birds (a paycheck and an improved skill) with one stone. You'll also be presented with all sorts of choices along the way. Read a particular book or deliver some documents to city hall to improve your standing with the boss, and you might earn a raise. You might even get an opportunity to change career tracks completely (perhaps the military has had an eye on your scientist). As it happens, these kinds of possibilities aren't just related to your job. Perhaps the local school is having a bake sale; you might be invited to whip up some cookies. Thankfully, managing your basic needs--hunger, bladder, and so on--takes less effort than before, giving you more chances to take advantage of these occasions. Your coffers will grow, at which point you'll be spending time in Buy and Build modes. The Create a Style concept is at work here too, so you'll be able to customize furniture, appliances, and even window panes if you so desire. For example, you can go so far as to paint almost every brick in the wall pattern if you want to get that in-depth. Better stuff makes for a more automated and happier life, and it also lets aspiring architects and landscapers showcase their creativity. The tools work much the same as before, though the terrain and terrain-painting tools are easier to use than ever, and the most enthusiastic designers can still use cheat codes to manipulate things further (some of which are handily included in the game's readme file). And if you really take pride in your handiwork, The Sims 3's online features are much better integrated than before, though there is still room for growth in this area. From the game launcher, you can upload and download shared content such as sims, outfits, household objects, and so on. This kind of social exchange has always been an important aspect of The Sims, though in light of the tight online integration seen in games such as Spore, there are some missed opportunities here. For example, placing the browser directly in the game client would have made for a more seamless experience. And though the ability to upload movies to The Sims 3 Web site and edit them is a great new feature, you still have to access this feature through your Web browser. The good news is that there are some great items ready to download the moment you register an account online, including an entire town (which is, thankfully, free). However, most official content requires you to spend SimPoints, which cost real money. That nickel-and-diming points to what is probably The Sims 3's main drawback: Although the game includes a whole lot of content, it still has noticeable holes that the expansions to previous Sims games have already filled. Previous add-ons offered pets to play with, seasonal weather, magical items, and other fun content. None of that is featured in The Sims 3, and certain aspects of the series, such as the events of the standard workday, have gone curiously unexplored. The established pattern of Sims expansion packs make these areas of opportunity all the more apparent, especially when you'd expect a sequel to include most of the popular features of the games that led up to it. Tired of marshmallows? You could always try roasting grapes! One of the reasons for the franchise's success is how easy the games are to run on a variety of computers, and The Sims 3 is no exception; it's very scalable, so chances are that if you have a relatively modern PC, you'll probably be able to run the game. The visuals are colorful and crisp, and a noticeable step up from The Sims 2. Sim movements continue to be the highlight of the presentation, and zooming in close is always a fun treat, especially when your sims are engaging in a particularly animated exchange, such as telling a joke. Buildings like the theater and city hall look attractive, and the soft sway of trees and bushes makes the town look pleasantly suburban. Nevertheless, the game's performance does continue some unfortunate trends of Sims games past. Performance is a bit sluggish when you scroll across the town or follow your sim as he or she travels. And though the pathfinding has improved, sims sometimes still have difficulties getting from point A to point B without going through some odd animations or complaining that there's someone in the way. Unsurprisingly, the game sounds absolutely charming. The jaunty tunes that accompany the Build and Buy modes and the tunes that play when you turn on the radio are terrific, perhaps the best in the series. Some sound effects are recycled, but The Sims 3 doesn't feel cheapened as a result; it strikes a chord of familiarity that works to the game's benefit. So what is it that makes The Sims 3 even more addictive than its predecessors? It's partially due to the deft handling of rewards; it doles out new social options, new aspirations, and the possibility of better furniture and wood flooring at a slow but even pace, which keeps you tied to your computer for hours at a time. It offers the element of surprise, showing off its abundant charms through funny social interactions that make you want to be part of the improved virtual community. Although it could have offered even more right out of the box, there's still an awful lot of content here, and it's bound to put a smile on almost anyone's face."}