{"ref": "https://www.gamespot.com/reviews/the-sims-3-review/1900-6282965/", "date": "October 25, 2010", "game_name": "The Sims 3", "text": "The Sims 3 doesn't mark the first time the PC-centric life simulation series has come to consoles, but it's the first time that the basic gameplay has remained relatively intact. In the console versions of The Sims and The Sims 2, the sandbox gameplay that made the PC games so successful took a backseat to achieving specific goals. The Sims 3 still rewards you for reaching specific milestones, but it gives you room to direct your digital playmates as you see fit. The franchise may celebrate the routines of everyday life, but as series fans know, directing a sim household can be great fun and causes the hours of your own mundane life to whiz past before you know it. The Sims 3 provides the same kind of addictive appeal, though a few elements that made the game so special on the PC were lost in transition. Long loading times, frequent pauses, and other flaws regularly interrupt the flow of gameplay, making this virtual town more like a bunch of small, low-population areas bolted together, rather than a thriving community. The resulting awkwardness makes this version inferior to its PC counterpart, but if you can exercise some patience, you'll find there's a lot to like about The Sims 3. If you're new to the series, here's a quick primer. The Sims 3 is a virtual life simulator. In it, you take control of a character called a sim, or an entire household of them. Sims have needs; they need to empty their bladders, to eat, to sleep, to bathe, to have fun, and to socialize. It's real life boiled down to simple mechanics, but within these mechanics lies an entire universe of possibilities. Your sims can have babies who may cry in the middle of the night, needing their diapers changed. You can manage their personal development by sending them to the gym to work out, or by telling them to fix a broken television, or by having them play chess, or by sending them to the park to play the guitar. Sims go to work to earn simoleans (money, of course) so they can buy better things for their homes and redecorate--or just buy a brand-new home. They make friends and enemies, they go swimming, and they clog up the toilet. In other words, they act a whole lot like real people, except that they yammer in a delightful gibberish called Simlish and communicate via speech bubbles that appear over their heads. This might sound terribly mundane, but balancing the needs of your sims can keep you happily glued to your monitor for hours at a time. Many of the signature Sims charms that make the PC game and its expansions such a delight made it to consoles intact. Zooming in close to see these little computer people interact is always a fun treat, especially when your sims are engaging in a particularly spirited exchange. Watching the expressive animations and listening to the dramatic vocal inflections is always a delight, whether it's your toddler sim chewing on her xylophone mallets or the man of the house throwing a tantrum because there are rotting leftovers in the fridge. Take your weakling sim to the gym and watch what happens on the treadmill; kiss another sim in front of your husband and watch the slaps ensue. Or generate your own masochistic amusement by denying your sims the use of a toilet or by putting them in a room without doors. Simply watching the inhabitants of this digital world is a hoot, and the colorful visuals and jaunty soundtrack tunes enhance the slightly surreal appeal. The art gallery has a remarkable number of bathroom stalls. As you play, your sims communicate their wishes to you. Some of these are relatively simple: play a game with your spouse. Others are a little more involved: see your kid graduate. With the points you earn, you can then purchase permanent goodies, such as complimentary entertainment (go to the theater for free), or never getting hungry, or increasing your chances of conceiving a child. The Sims 3 on consoles further enhances the focus on specific tasks with the notion of karma. By fulfilling these wishes, you accumulate a currency known as karma, which you then use to make your sims a little happier--or to wreak havoc on their lives. (You also get a karma allowance at midnight automatically.) Beneficial powers include bringing a dead family member back to life (creepy!) or instantly satisfying a sim's basic needs. If you're the sadistic type, you can summon poltergeists to haunt the household of your choice, or trigger a flaming meteor shower. The glittering sound effects and the easing of everyday hassles make the advantageous powers satisfying to activate. Delivering cruelty to your unsuspecting family can be even more fun, however. Watch a crowd freak out during the earthquake you generate; giggle as your normally staid sim pees on the floor and sobs after you drop his needs to rock bottom. Another console-specific element is that of challenges. Learning particular skills, getting raises, touring landmarks--pretty much everything you normally do in The Sims 3 allows you to complete challenges, which earns you challenge points. With these points, you can buy access to lawn decor, furniture sets, karma powers, and more. You can also purchase new work outfits, which is a new addition to the series. When you take a job and earn a promotion, you get to customize a uniform from a limited number of choices, though you do get the benefit of the Create a Style feature here. This feature, also accessible when you create a sim and choose his or her clothing options, lets you choose from a huge number of patterns (even those used for nonclothing items such as masonry and linoleum) and tweak their colors as you see fit. Unfortunately, this version doesn't share the visual fidelity of its PC counterpart, which puts a slight damper on The Sims 3's dollhouse appeal. Looking through the available bracelets and rings, it's hard to tell the difference between one and the next, and it's even harder to tell the difference once it appears on your sim. It's too bad you can't guide your sims through specific actions during the work day. The various rewards for completing specific tasks are good additions that should please players who like specific direction. But they can't compensate for a few drawbacks that restrict this version's appeal. While The Sims 3 on PC possessed an excellent sense of a larger community, you won't find that same allure here. The single available town is small and condensed, and when you head out for entertainment, there aren't usually many people to socialize with when you arrive. Even more distracting is that the town is broken up into multiple areas. Traveling from your home often means enduring loading times of 15 seconds or more. That might not be a hassle if your household consists of a single sim, but most players will handle multi-sim households. This is when the loading times become an incredible bother, even for Xbox 360 owners who have installed the game on the hard drive. (There's a mandatory install on the PlayStation 3.) Having mom sim at work in the garden, dad sim at the art gallery, and daughter sim at the spa means stomaching constant waits when you'd rather be playing. You end up making a choice: dealing with a one-sim household, which leads to stretches of monotony, such as when your sim goes to work, or going with a larger household, which means constant fits and starts as you move about the town. The game's overall technical performance adds another thin layer of discomfort. There are short pauses when opening certain menus (these are more prevalent and noticeable on the PS3) and frame rate hitches as you move the camera across the terrain. These seem like small flaws, but they add up in time, making The Sims 3 seem unrefined. At least the controls aren't unwieldy. It takes some time to get used to them, but considering the mouse-centric PC controls, using a gamepad works about as well as you could expect. It's simple to snap the camera to the active sim, plant flowers, buy appliances, and adjust the terrain. The biggest flaw here is that performing many basic actions pauses time so that you can make an appropriate selection, whereas your sims go about their business unhindered on the PC. Switching between sims, selecting a social interaction, choosing a television channel, and many other basic tasks cause the game to pause while it waits for your feedback. These pauses, like the loading times and technical faults, keep The Sims 3 from feeling as effortless as it should. Precious moments of parenthood. The Sims 3 may not be the perfect fit for consoles, but it's hard to deny the attraction. As annoying as the loading times and frequent pauses are, there is something indelibly rewarding about controlling the lives of these delightful goofballs. None of the wonderful additions of the PC version's expansions--vacations, workday activities, photography, and so on--were implemented here, so you might suspect plans of premium downloadable content in the future. Nevertheless, The Sims 3 is still loaded with dozens of hours of gameplay, and is further bolstered by the online exchange, which is available from the main menu. Using the exchange, you can upload your creations and download others; or if you are willing to part with a bit of extra cash, you might purchase new items from the store. In other words, the game will keep you busy for a while. It's too clunky to be consistently satisfying, but if you're searching for the delights of everyday life, you might very well find them lurking within The Sims 3. Another console-specific element is that of challenges. Learning particular skills, getting raises, touring landmarks--pretty much everything you normally do in The Sims 3 allows you to complete challenges, which earns you challenge points. With these points, you can buy access to lawn decor, furniture sets, karma powers, and more. You can also purchase new work outfits, which is a new addition to the series. When you take a job and earn a promotion, you get to customize a uniform from a limited number of choices, though you do get the benefit of the Create a Style feature here. This feature, also accessible when you create a sim and choose his or her clothing options, lets you choose from a huge number of patterns (even those used for nonclothing items such as masonry and linoleum) and tweak their colors as you see fit. Unfortunately, this version doesn't share the visual fidelity of its PC counterpart, which puts a slight damper on The Sims 3's dollhouse appeal. Looking through the available bracelets and rings, it's hard to tell the difference between one and the next, and it's even harder to tell the difference once it appears on your sim. It's too bad you can't guide your sims through specific actions during the work day. The various rewards for completing specific tasks are good additions that should please players who like specific direction. But they can't compensate for a few drawbacks that restrict this version's appeal. While The Sims 3 on PC possessed an excellent sense of a larger community, you won't find that same allure here. The single available town is small and condensed, and when you head out for entertainment, there aren't usually many people to socialize with when you arrive. Even more distracting is that the town is broken up into multiple areas. Traveling from your home often means enduring loading times of 15 seconds or more. That might not be a hassle if your household consists of a single sim, but most players will handle multi-sim households. This is when the loading times become an incredible bother, even for Xbox 360 owners who have installed the game on the hard drive. (There's a mandatory install on the PlayStation 3.) Having mom sim at work in the garden, dad sim at the art gallery, and daughter sim at the spa means stomaching constant waits when you'd rather be playing. You end up making a choice: dealing with a one-sim household, which leads to stretches of monotony, such as when your sim goes to work, or going with a larger household, which means constant fits and starts as you move about the town. The game's overall technical performance adds another thin layer of discomfort. There are short pauses when opening certain menus (these are more prevalent and noticeable on the PS3) and frame rate hitches as you move the camera across the terrain. These seem like small flaws, but they add up in time, making The Sims 3 seem unrefined. At least the controls aren't unwieldy. It takes some time to get used to them, but considering the mouse-centric PC controls, using a gamepad works about as well as you could expect. It's simple to snap the camera to the active sim, plant flowers, buy appliances, and adjust the terrain. The biggest flaw here is that performing many basic actions pauses time so that you can make an appropriate selection, whereas your sims go about their business unhindered on the PC. Switching between sims, selecting a social interaction, choosing a television channel, and many other basic tasks cause the game to pause while it waits for your feedback. These pauses, like the loading times and technical faults, keep The Sims 3 from feeling as effortless as it should. Precious moments of parenthood. The Sims 3 may not be the perfect fit for consoles, but it's hard to deny the attraction. As annoying as the loading times and frequent pauses are, there is something indelibly rewarding about controlling the lives of these delightful goofballs. None of the wonderful additions of the PC version's expansions--vacations, workday activities, photography, and so on--were implemented here, so you might suspect plans of premium downloadable content in the future. Nevertheless, The Sims 3 is still loaded with dozens of hours of gameplay, and is further bolstered by the online exchange, which is available from the main menu. Using the exchange, you can upload your creations and download others; or if you are willing to part with a bit of extra cash, you might purchase new items from the store. In other words, the game will keep you busy for a while. It's too clunky to be consistently satisfying, but if you're searching for the delights of everyday life, you might very well find them lurking within The Sims 3."}