{"ref": "https://www.gamespot.com/reviews/in-other-waters-review/1900-6417449/", "date": "April 21, 2020", "game_name": "In Other Waters", "text": "Beyond the reef, the shelf drops away into the turquoise haze of the open ocean. I find myself surrounded by golden-peaked pillars aglow with the shimmering petals of sunlit life. Bright green webs of twisted tendrils extend from pillar to pillar, forming a writhing network of bridges for the feathery, fern-like creatures who patrol and maintain them. It's a spectacular, awe-inspiring scene. Yet it exists mostly in my imagination, its wonder shaped by a handful of single-sentence descriptions and a simple two-colour contour map. In Other Waters does so much with seemingly so little, emerging as a masterclass in prudent, minimalist storytelling.Dr. Ellery Vas is a xenobiologist following in the wake of her partner who disappeared while researching extraterrestrial life on the ocean planet Gliese 667Cc. Stationed at her partner's abandoned lab and equipped with an AI-controlled diving suit, Vas explores the depths in search of answers. In a disarming inversion of the typical human-AI relationship, you play the AI; Vas sets the objectives, often conferring with you, but it's your job to plot her course, gather samples, and run tests back in the lab.The setup allows Vas room to breathe as a character. As you guide her maritime expedition, she provides intermittent narration. She pauses to marvel at new sights, thinks out loud as she works through possible theories, and occasionally confides in you her doubts and fears. Conversation may be sparse, and your ability to respond is limited to the odd yes or no answer, yet it's perhaps all the more affecting because of it. The two of you are strangers at the outset, but Vas' wariness at revealing her innermost thoughts to an AI gradually washes away as she realises, despite your reticence, that you understand her predicament--in the process unearthing a memorably multi-layered character. It's a friendship forged in aquatic isolation, one quiet line at a time.Similarly, there's an elegance to the overall design in that it communicates a great deal of information in very few words. The view of your travels is confined to a bathymetric chart where hydrographic features are drawn in clean lines and navigational points of interest are clearly marked whenever you activate the local scanner. Vas is an assiduous note-taker, and her short written descriptions of each location bring these points to life in remarkably vivid fashion. The textual imagery combines effectively with the subtle palette changes of the map--the warm greens of the shallows segue into the rich blues and yellows of the deeper waters before giving way to the blacks and reds of the darkest depths. Add in the obscure, ambient hum of the sea and the gentle thrum of the diving suit's propulsion engine as you push off to a new destination, and In Other Waters delivers a richly immersive audio-visual experience that belies its spartan aesthetic. It's quite an achievement.The minimalist construction extends to your interactions with the world. Scanning reveals the nearest nodes you can travel to via the point-to-point movement system. It also uncovers any lifeforms that you can click on to have Vas study. Each unique encounter with a specific lifeform adds to her observations until she's able to properly identify and catalogue it. There are also special samples to collect, often hidden in out-of-the-way corners of the map, that contribute to the deep taxonomy of this alien ecosystem and reward the time it takes to track them all down.All of this is accomplished via an interface that just begs to be played with. Intriguingly unlabelled buttons, dials, switches, scopes, and sliders don't so much fill the screen as grace it, teasing enigmatic functions with perfect stylish form. Inconspicuous tutorial tips light up the dashboard when it's appropriate to utilise each component, but there's plenty left for you to decipher. Just as Vas confronts the unknown in her journey and has to speculate and experiment, testing out her hypotheses, you too are handed a highly tactile, symbolic interface and left to probe it until you eventually intuit how it all operates. In many instances, the mysteries coincide; Vas' search for understanding of the lifeforms she's encountering mirrors your own rumination on the best means to proceed. Indeed, all throughout, the themes and mechanics of exploration and scientific method align and intertwine.Although principally a narrative-driven game, there is a light undercurrent of resource management flowing through each outing from the base. Sampling and researching marine life allows you to extract the power and oxygen you'll need to maintain Vas' diving suit on longer treks. Certain environmental hazards deplete these resources at a greater rate, though, while you'll need a supply of specific samples to progress through otherwise inaccessible regions, both scenarios serving to gently nudge you to at least consider the limited inventory space as you prepare for each expedition. Even though failure here isn't punishing--Vas will be extracted via drone back to base if you let her run out of oxygen--having to monitor your use of resources builds tension and benefits the feeling of trepidation as you set a course into uncharted waters.In Other Waters develops its central mysteries in expert fashion, drip-feeding its revelations in a way that feels natural, and dispatching you to inspect the corners of its map in a way that doesn't feel contrived. As you steadily learn more of what Vas' partner was up to on this strange planet, and you yourself begin to grasp humanity's plight, the mystery builds to a confident conclusion--one that satisfies yet remains aware that some questions are more enticing when left unanswered. In this sense, its story echoes the restraint that runs through the entire game to deliver a stylish, assured, and utterly absorbing adventure that demonstrates again and again it knows how to do a lot with seemingly very little."}