{"ref": "https://www.gamespot.com/reviews/cubivore-review/1900-2897287/", "date": "November 11, 2002", "game_name": "Cubivore: Survival of the Fittest", "text": "Cubivore is the latest export from Japan that eschews genre and bucks trends. Developed by Saru Brunei, a studio headed by Miyamoto protg Gento Matsumoto, Cubivore is in the spirit of other highly conceptual games like Mister Mosquito and the PaRappa series, taking a lighthearted and highly abstracted view of reality and mixing it with gameplay to make a little something for those who are looking for a break from the norm. The goal of Cubivore is to become strong enough to defeat the Killer Cubivore, who, along with his cronies, has drained color from the wilderness to create ~raw meat~ to add to their bodies. The raw meat gives them strength and powers beyond those of the normal cubivores, but you are determined to rip it off their bodies and make it a part of you, so you can eventually return the wilderness to its former, colorful state. There are two ways to become a stronger cubivore: eating other cubivores and training. The eating portion of Cubivore is a fairly complex-sounding system, but the manual covers it well, and the game also teaches you as you play in addition to providing a helpful in-game glossary. Each cubivore has one to six limbs, each of which is one of five colors and is either pale, dark, or rage (the darkest). A cubivore can be one of five strength levels, based on whether it is all pale, a mixture of pale and dark, all dark, a mixture of different colored rage limbs, or all one color of rage limbs. Each of the five colors has certain strengths and weaknesses for how well it makes your cubivore attack, defend, run, jump, back up, or pounce on a target. By defeating a fellow cubivore and eating its limbs, you try to fill your own limbs with the right combination of colors to cause you to mutate, because in the world of Cubivore, the number of times you mutate is directly proportional to how many females you will attract. After you mate, you resume the game as one of the offspring you've created, with one more limb than you previously had, making you more powerful than before. Having lots of offspring gives you the chance to start out as one of the more powerful types for your new number of limbs, and you'll also be able to change back to that form at will in case you need to mutate to a weaker form. There are training areas and bonus pickups scattered throughout the levels, which will let you build up your horns, scars, hump, and tongue. Your progress in these areas is passed on to your offspring after you mate and die. Horns and scars raise your offense and defense levels. Your hump determines how well you heal when you eat other animals or vegetation, and the stronger your tongue gets, the better chance you have of ripping off a cubivore's limb before you've knocked it unconscious, a maneuver called ~eat-n-run.~ Getting as many mutations as possible is just as important as getting the more powerful mutations and training, not only because it attracts more females, but also because you must get 100 mutations before you can face off against the Killer Cubivore. Trying to get 100 mutations brings out the puzzle-solving element in the game--each level has been carefully populated with cubivores so that getting some mutations will be much harder than getting others. Each of your cubivore's limbs can contain one color, and eating a colored limb will cause your cubivore to lose the oldest color it's eaten, unless you have a limb without color. You can empty out the most recently colored limb by ~making a doo~ (thank you, Japan). Once you get more than two limbs, getting the right combination of colors to cause a new mutation requires a bit of planning. While it is not overly difficult to get to 100 mutations and get to the final battle, getting all 150 to get the bonus is quite a challenge. Cubivore's main draw is actually the gameworld itself. An art critic would call it ~a dissolution of form that emphasizes the primal~ instead of saying ~nearly everything is square- or cube-shaped.~ Both descriptions are apt, though. Nearly everything truly is square. The sun and moon are cubes, and even the ripples you make in the water as you walk across a creek are square. Each cubivore is just a collection of identically sized square tile limbs attached to a head. But it's incorrect to say that this game has bad graphics, as no doubt some will say. While the animal forms and the environments themselves are primitive, the look doesn't come off as amateurish, but rather as the style decision that it was. There's some real polish to the look: The cubes are slightly rounded, the special rage limbs use environment mapping for a shiny look, and the textures for the heads of the cubivores are sharp even though they match the simplicity of the models they're placed on. The music is equally minimalist, with piano as the only instrument, except for the ~a good thing just happened~ fanfare, which is done in brass. The piano music is as odd and interesting as the visual style; while one hand plays a stilted melody, the other adds in either very deep chords or quickly played scales and trills that almost sound like other instruments. It's presented along with game effects in surround sound that sounds great. While Cubivore doesn't quite match the visual flair and quirkiness of PaRappa, it does have style, which is most evident in the 150 different mutations you can obtain. Each mutation has a unique look and an inventive name to go with it. Each mutation has a unique look and an inventive name to go with it. For instance, First Date has one limb underneath the head acting as a foot and the other two on one side of the head looking like the head and foot of another cubivore walking closely alongside. Mullet has a limb hanging off the back of the head. As an exercise in creativity, making 150 different creatures out of a head and anywhere from one to six identical square tiles, and naming them, is quite an interesting feat. The mutations have a wide variety of methods of locomotion--walking, hopping, slithering, flapping, or even dragging themselves along--and each animation is smooth and looks as if it would be correct if such a creature actually existed. What's also interesting is that some of the configurations have an effect on how you control them. Some of the more powerful mutations that involve the purple cubivores walk (or bounce) with their head facing backward, so in order to pounce and do damage you have to pivot 180 degrees to face your target after moving into range. The blue cubivores can pounce far but move like snakes, with their heads on the ground facing to the side, so if you pivot a quarter turn to the left instead of the right without thinking, you may end up with your head facing the wrong direction. Cubivore does have a few flaws that will get in the way of your enjoyment of the game. Chief among these is the camera perspective. Most of the time it is far too close, placing cubivores that are in your pounce range completely offscreen. Once or twice during play a pounce knocked our cubivore off the screen as well, with the camera inexplicably focused on an empty screen for a brief moment. Control of the camera using the C stick is limited to 90-degree rotations left or right. You can also adjust the camera's elevation up and down slightly, but for some unknown reason you have to hold the C stick in place to keep the camera the way you want it, which is pretty impractical in a fight where you might want a higher camera for a more overhead type of view. Another really annoying control issue is that for some reason you can't access the in-game help if another cubivore is too close. So, if you want to remind yourself whether or not the cubivore you just spotted will help you get a new mutation, you have to back away first. Cubivore is an interesting combination of puzzle-solving and action that's plagued with camera issues and poor difficulty tuning. Cubivore also has a problem with its difficulty. When you start out, the first few mutations you can get aren't really strong enough to take on the bosses, who will have two or more somewhat weaker cubivores helping them out. You'll spend a lot of time running away to go find something to eat to replenish your health. Later on, though, when you have the opportunity to get the more powerful mutations before the end of a level, boss fights swing to the other side of the pendulum and become far too easy, especially since throughout the game you can collect a large number of ~rejuvenators~ that will instantly fill your health bar back to maximum. When we got to the final battle, we had more than 20 of these, which made for a really unexciting fight. It also didn't take very long to get there in the first place--about 12 hours. Thankfully there is a more cerebral challenge in collecting all 150 mutations. As an offbeat conceptual piece, Cubivore is a must-have. As a game, it's slightly above average--an interesting combination of puzzle-solving and action that's plagued with camera issues and poor difficulty tuning. Whether or not it's worth purchasing, given its relatively short amount of total playing time and its full-price sticker, will depend on how interesting you find its unique qualities. There's some real polish to the look: The cubes are slightly rounded, the special rage limbs use environment mapping for a shiny look, and the textures for the heads of the cubivores are sharp even though they match the simplicity of the models they're placed on. The music is equally minimalist, with piano as the only instrument, except for the ~a good thing just happened~ fanfare, which is done in brass. The piano music is as odd and interesting as the visual style; while one hand plays a stilted melody, the other adds in either very deep chords or quickly played scales and trills that almost sound like other instruments. It's presented along with game effects in surround sound that sounds great. While Cubivore doesn't quite match the visual flair and quirkiness of PaRappa, it does have style, which is most evident in the 150 different mutations you can obtain. Each mutation has a unique look and an inventive name to go with it. For instance, First Date has one limb underneath the head acting as a foot and the other two on one side of the head looking like the head and foot of another cubivore walking closely alongside. Mullet has a limb hanging off the back of the head. As an exercise in creativity, making 150 different creatures out of a head and anywhere from one to six identical square tiles, and naming them, is quite an interesting feat. The mutations have a wide variety of methods of locomotion--walking, hopping, slithering, flapping, or even dragging themselves along--and each animation is smooth and looks as if it would be correct if such a creature actually existed. What's also interesting is that some of the configurations have an effect on how you control them. Some of the more powerful mutations that involve the purple cubivores walk (or bounce) with their head facing backward, so in order to pounce and do damage you have to pivot 180 degrees to face your target after moving into range. The blue cubivores can pounce far but move like snakes, with their heads on the ground facing to the side, so if you pivot a quarter turn to the left instead of the right without thinking, you may end up with your head facing the wrong direction. Cubivore does have a few flaws that will get in the way of your enjoyment of the game. Chief among these is the camera perspective. Most of the time it is far too close, placing cubivores that are in your pounce range completely offscreen. Once or twice during play a pounce knocked our cubivore off the screen as well, with the camera inexplicably focused on an empty screen for a brief moment. Control of the camera using the C stick is limited to 90-degree rotations left or right. You can also adjust the camera's elevation up and down slightly, but for some unknown reason you have to hold the C stick in place to keep the camera the way you want it, which is pretty impractical in a fight where you might want a higher camera for a more overhead type of view. Another really annoying control issue is that for some reason you can't access the in-game help if another cubivore is too close. So, if you want to remind yourself whether or not the cubivore you just spotted will help you get a new mutation, you have to back away first. Cubivore also has a problem with its difficulty. When you start out, the first few mutations you can get aren't really strong enough to take on the bosses, who will have two or more somewhat weaker cubivores helping them out. You'll spend a lot of time running away to go find something to eat to replenish your health. Later on, though, when you have the opportunity to get the more powerful mutations before the end of a level, boss fights swing to the other side of the pendulum and become far too easy, especially since throughout the game you can collect a large number of ~rejuvenators~ that will instantly fill your health bar back to maximum. When we got to the final battle, we had more than 20 of these, which made for a really unexciting fight. It also didn't take very long to get there in the first place--about 12 hours. Thankfully there is a more cerebral challenge in collecting all 150 mutations. As an offbeat conceptual piece, Cubivore is a must-have. As a game, it's slightly above average--an interesting combination of puzzle-solving and action that's plagued with camera issues and poor difficulty tuning. Whether or not it's worth purchasing, given its relatively short amount of total playing time and its full-price sticker, will depend on how interesting you find its unique qualities."}