{"ref": "https://www.gamespot.com/reviews/sacred-3-review/1900-6415839/", "date": "September 10, 2014", "game_name": "Sacred 3", "text": "What's in a name? If you take the example of Sacred 3, very little. Publisher Deep Silver may have pasted the name of this action role-playing franchise on its new entry in the hack-and-slash genre, but the game itself is little more than a meticulously mediocre button-masher that strips out the elements that make click-heavy RPGs so absorbing.The clicking lacks inspiration; the script, inspired by equal measures of The Lord of the Rings and Leisure Suit Larry, lacks taste. Developer Keen Games never seems sure of whether to play the setting straight or to send up the tropes of heroic fantasy; as a result, the setting and narrative are all over the place. At first, it seems like you're stepping into the brawny boots of the usual hero in the usual elves-and-orcs saga. The fate of the realm of Arcania (the D&D-inspired land that also hosted the first two Sacred games) is at stake here. Lord Zane and his Ashen Empire are pillaging towns. Innocents are being slaughtered. Undead are rising.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Sacred 3 Video ReviewBizarrely, these themes are played for laughs. Comments by friends and foes alike consist of out-of-place observations and pathetic sex jokes that wouldn't raise a chuckle out of Beavis and Butthead. You can never escape this chatter, either, as you're constantly accompanied by a veritable broadcast booth of idiots. Psychic Aria is in your head all the time, ostensibly there to give you advice on what to do and where to go, but her true purpose is to blab away to herself. Villains get in on this party line, as do spirits residing in your weapons, including a perverted ghost who tells you about the things that he'd like to ~get on top of~ whenever you pull off a leaping attack. Oh, and the heroes are also morons. The barbarian, for example, sounds more like Zoolander than Conan.Perhaps this childish verbiage might have been forgivable if Sacred 3 had balanced it with solid gameplay--but it doesn't. On the contrary, the game is stripped down to the raw basics. There are just four different characters to choose from at the start of the game, all fantasy archetypes. You get the bulked-up Safiri barbarian tank, the jack-of-all-trades Ancarian lancer, the range-combat specialist Khukuri archer, and the magical blade-wielding Seraphim angel. None can be customized before delving into the hacking and slashing; you just make your pick from this limited pool of talent and then head into the campaign.You can send your hero into the fray either on your own or cooperatively with up to three others online. It's easy to find a match to drop into, which you can do with just a couple of clicks from the main campaign screen. You can also readily move in and out of online and offline play, so the option for something different is always there. Still, I didn't notice any hidden dimensions of the game materializing when playing on a team. Scores are tracked so you can tell which member of your goon squad is the best killing machine, and there are a few added co-op features, like being able to revive fallen allies. Other than those minor tweaks, Sacred 3 feels much the same whether you're playing with yourself or with somebody else.Character progression is weak, whether you're playing online or off. (A single character can be played and leveled-up in both modes of play.) There are no loot drops during combat, and there is no inventory to manage. Kill a bad guy, and you're showered with gold and shining orbs that boost health and power, but you never pillage artifacts like magical swords or ancient helms. Instead, the game doles gear out to you like rations as rewards for finishing missions and leveling up. Such delayed rewards killed much of my motivation to keep playing, because without the instant gratification provided by cool new gear and enchanted artifacts, the clicking feels too much like a pointless grind.As a result, the entire game is played with just three or four weapons. There are limited slots for amenities like health potions and defense-boosting shield amulets. Each hero comes with default attacks plus shared special abilities, like a bash that can take down enemy shields, and an execution move that finishes stunned opponents. Only a handful of combat arts provides heroes with added class-specific abilities, like the Seraphim's thunderbolt, and the Safiri's fireblade. Most of the above can be upgraded by purchasing branches on skill trees that offer up added damage, wider attack range, and so forth, but such enhancements are not easy to come by. There are tough level requirements on most upgrades. Six or more levels separate upgrades on weapons, for example, and some upgrades take so long to acquire that they seem almost unattainable, especially in the early stages of the game. As a result, I frequently would finish a mission, load up my character screen to see what new goodies I could unlock, and then walk away frustrated because I didn't qualify for anything new.Where the first two Sacred games were laid out like standard hack-slash RPGs, Sacred 3's 10-hour campaign consists of disconnected levels in wholly separate locales and dungeons. There are no quests to perform; you're not so much a part of an RPG fantasy world as you are a pugilist picking individual fights. The rigidly linear levels lack creativity. You follow a narrow path from one point to the next, killing everything you encounter along the way, only pausing occasionally to turn a wheel, pull a lever, or engage in some other generic interaction. The only break comes in the form of mini-levels where you either have to survive five waves of enemies, or wander around a small area killing everything that you encounter.Enemies are repeated over and over again in both the story and arena levels. There are varied types of foes, but when you're killing thousands and thousands of them over the course of the game, there is still plenty of repetition. Much of the enemy horde consists of goblin-like monsters, giant spiders, trolls, and the like, although occasionally you get thrown a curveball like gross puking zombies or ice creatures. Nevertheless, even when the rogues gallery gets changed up, most of the differences are only skin-deep, as all enemies rely on just a few types of attacks. The tougher elite beasts, for example, have varied appearances, but almost all of them attack with identical charges and earth-shaking swings of their weapons. Levels also feature arcade-styled challenges like giant rocks or volcanic lava falling from the skies as you race forward trying to dodge this makeshift artillery, but this gimmick is repeated in practically every level. Ideas are repeated so often I occasionally thought I'd made a mistake and had accidently chosen to replay a level that I'd already finished.Sacred 3 brings with it a number of positive elements that help ease the pervasive monotony. Boss battles at the end of each story level can be very challenging, often requiring you to take advantage of the scenery to survive, or to use some unusual strategy to turn the enemy against itself. Simply clicking as fast as I could and adding in liberal sprinklings of special attacks got me killed a fair bit of the time in these encounters. I had to actually think things through and get the lay of the land, not just charge forward. That came as a bit of a surprise in a game that was otherwise so simple-minded, but it was a welcome one.All battles are frantic whirls of color, showing off some attractive visuals that fill the screen up with flying blood, explosions, and magic effects. Levels are wonderful to look at, with varied backdrops that range from jungles, to crypts, to quasi-factory settings. Environments have a lovely sense of depth, and the camera regularly pulls back from the standard perspective to provide an exciting panoramic view of important events happening in the distance. The primary drawback with the camera is that you can't adjust it during regular gameplay, which locks you into a perspective that's a little too close to the action to see where you need to go at times, but is also high enough up that you lose some detail in the hero and monster models below.Sacred 3's primary primary flaw is that it's so easy to forget. It contains too little of what you look for in an action-first RPG, and distances itself it so far from its two predecessors that there is no meaningful connection left between the games besides the name and the setting. And that, as you can see from this example, doesn't mean much."}