{"ref": "https://www.gamespot.com/reviews/big-mutha-truckers-2-review/1900-6132263/", "date": "August 30, 2005", "game_name": "Big Mutha Truckers 2", "text": "On the working scale of completely unnecessary sequels, THQ and developer Eutechnyx's Big Mutha Truckers 2 ranks somewhere between Weekend at Bernie's II and Eddie Murphy's second musical album. The original Big Mutha Truckers wasn't completely without merit, mind you. Designed to be a mixture of silly arcade truck racing and an economy-based trucking simulation, the game just never bothered to lean far enough in one direction or another--not to mention that the game's brand of brain-dead trailer-park humor largely fell flat. So what did the developer do? It dumbed down the simulation aspects, made the driving portions even less fun and more repetitive, and threw in a gaggle of even stupider ethnic and sexual gags. Granted, Big Mutha Truckers 2 is a budget game this time around, but even so, it somehow still manages to feel like a complete waste of time and money. Because the world was absolutely screaming for yet another hick-joke-infused arcade trucking game, right? Big Mutha Truckers 2 revolves around the same slack-jawed cast of characters from the first game. This time around, Ma Jackson, the matriarch of the slovenly and generally unpleasant truckers of which you take control, is in jail for tax evasion. She charges you with the task of raising enough money to buy off the jury selected for her trial. You do so by running from place to place, delivering various forms of cargo, occasionally engaging in lame side missions, and once in a while stopping to listen to some painfully forced stereotype of a character jabber on at you for way beyond what could possibly be considered funny. The first game had the makings of what could have been a legitimately interesting economy system. Each town had certain needs with regard to what products you could carry, and it was up to you to find the best prices for said cargo and then deliver it to the town with the highest need level to make the most profit. The same basic idea is employed here, but it's been dumbed down to the point where you don't actually have to put much thought into the whole process. All you do is go to a town, hit up the local store, use the handy menu system to see what products are profitable, buy as much as you can, head to the next town, and repeat. The last game required you to periodically shift between tanker trailers, regular trailers, and refrigerated trailers to carry certain products. You can do the same here, but mostly you really don't need to. The profit margins are pretty much the same across the board, so there isn't an awful lot of reason, save for rare instances, where you'd ever need to switch your trailer around. Essentially, you're just on one long fetch quest in Big Mutha Truckers 2. Periodic side missions break up a bit of the monotony, but they're not often much to get excited about. Usually you're simply charged with having to drive around, collecting items in a set amount of time while piloting some horrifically squirrelly vehicle like an SUV or a pickup truck. The basic mission concepts aren't horrible--you'll pick up a bunch of spilled beer kegs so the rednecks can have their hog-wrasslin' tourney, or you'll pick up a bunch of lost alien delegates for the shadowy G-men that don't want word of their arrival getting around town, for example--but the car controls combined with the infrequent nature of these missions make them far less compelling. Not to mention that during these side missions the game crashed on us at least a couple of times. When you're actually driving a truck, which is really what you do for the majority of the game, things aren't a lot better. The handling of the trucks throughout the game isn't especially great, and it's not very realistic either. You can't lose your trailer as far as we can tell, and unlike the last game, you don't have to worry about fuel or damage to your truck beyond a single run, as you don't have to maintain either aspect yourself. That's fine, but the driving still feels like too much of a weird mishmash. If you're going to make an arcade trucking game, make the trucks feel legitimately crazy. Just making them kind of fast and weirdly squirrelly isn't a valid solution. Though the game seems like it would have something of an open-ended feel to it, it really doesn't. You can't really drive around the gameworld outside of specific runs, so all you get to do is plot a course and drive straight through. Sure, there are some shortcuts you can take, and you can engage in some little side ventures, like transporting hobos and smashing up traffic, but most of these little challenges are far more annoying than they are fun. Periodically, bikers will roll up on you and jump onto your trailer, or UFOs will fly up and attack. In both cases, you just have to swerve from side to side until the attackers go away. Why is this fun? All it does is make the process of getting from one place to another that much longer and more obnoxious. Obnoxious is a good term to describe the entire tone of the game. The game desperately wants to be funny, but in its desperation it simply beats you over the head with its decidedly Larry the Cable Guy-esque sense of humor. A female biker named Slits O'Grady, a lispy, pink-shirted manager of a movie memorabilia store, a hairy-chested Russian in a Hawaiian shirt who loves to chop game with hackneyed American slang, and the in-game subtitle ~Truck Me Harder~ (which, shockingly, doesn't appear on the box) are about as subtle as the game gets. There are a few moments where the game actually manages to provide a laugh or two, but so much of it is so forcefully in your face and hopelessly determined to prove to you just how funny it is that it makes the actual funny parts less so by default. And more often, it simply relies too heavily on tired racial and sexual stereotypes. Truck Me Harder'? Hah! We get it! It's funny because...wait, that's not funny. The jokes also fall flat because the game doesn't do an especially good job of presenting them. The voice acting isn't awful, but the dialogue just prattles on and on and on, well past where a punch line should have been. Sure, you can give the developer credit for throwing in a lot of voice work, but the concept of ~less is more~ might have been best applied here. Visually, yes, the characters are very goofy-looking, but that's about it. Few, if any, of the visual gags are especially funny, and the actual in-game graphics are pretty low-rent, both when you're driving and when you're talking to people. There are ugly textures, blocky models, and a frame rate that literally falls to single digits on the PlayStation 2 at times--while falling only slightly less on the Xbox. Not a single aspect of Big Mutha Truckers 2 gives any indication as to why, exactly, a sequel was really warranted. Eutechnyx didn't make the first game better--it just made it dumber. It's not funny, interesting, or particularly fun on any front, and it isn't going to be appealing to anybody without the lowest of lowbrow senses of humor. Unless that's you, your $20 is definitely best spent elsewhere."}