{"ref": "https://www.gamespot.com/reviews/mag-review/1900-6249271/", "date": "February 2, 2010", "game_name": "MAG", "text": "When you first hear that MAG supports 256-player online matches, you may be inclined to picture hordes of soldiers swarming on top of one another and filling the air with thousands of bullets. The reality is that skirmishes play out on a much smaller scale, yet MAG still boasts some of the busiest battlefields in the genre. On the objective-rich maps, defeating the enemy squads arrayed against you demands individual skill and team coordination. Powerful rewards and intriguing command abilities await determined soldiers, making the tight combat all the more satisfying. There are some rough edges to contend with, however, including technical problems and a creeping sense of repetition. Yet though MAG is sometimes frustrating, it is more often engaging and occasionally thrilling. The sharp combat and exciting command roles make MAG a great destination for soldiers of fortune. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: MAG Video Review Jumping into MAG requires you to choose a faction. Three private military companies--S.V.E.R., Raven, and Valor--are engaged in a so-called Shadow War for military contracts, attacking each other's facilities in order to gain an edge. If a faction has enough success in a given match type, it earns a contract that gives its players a slight bonus every time they play that match type. These bonuses are fairly minimal (+5% experience points, for example) and don't tip the scales too much, serving more as an indicator of faction status than a tangible goal to strive for. Each faction has a different appearance, different guns, and a different attitude, and you make your choice based on a brief recruiting video. This isn't much to go on, but they all have similar arsenals and the same skill progression trees, so they are essentially interchangeable. That doesn't mean you can change factions, however. After enlisting, you are stuck with the faction you chose unless you delete your character or reach level 60, at which point you can start a new career. This persistence builds faction loyalty and increases the likelihood that you'll see familiar teammates. You also get very familiar with the maps because they are faction-specific; you always defend your own turf and attack your enemies' territories. This consistency has obvious benefits, and though there are only ten maps, most of them have multiple fronts. The biggest maps have four such fronts, each of which has a different layout and presents its own challenges. Even with this variety, you can reach a point where you start feel like you've seen it all before. Fortunately, the maps are very well designed, and there is so much going on in each battle that this feeling doesn't become a problem. There are four match types in MAG, though only two are available to you early on. Suppression is team deathmatch within your own faction. Sabotage introduces the concept of taking and holding objectives, challenging attackers to capture two points in order to unlock (and subsequently destroy) the third point. These 64-player matches are very straightforward and provide a good point of entry into the game. You can certainly find some hotly contested matches as players hone their weapon skills, but these modes ultimately lack the dynamic intensity of MAG's larger-scale battles. When you need to clear the way for bunker demolition, your shotgun is a powerful ally. When you move up to Acquisition (128 players) and Domination (256 players), then you're playing MAG at its best. Though these matches are still designed to concentrate 64 players in a given half or quadrant of the map, they have a scope and intensity that sets them apart. In Acquisition, the attacking faction tries to infiltrate enemy territory, steal a vehicle, and return it to their insertion point. In Domination, the attackers must seize a series of objectives in order to access the central capture points, which they must then hold long enough to win. In addition to the mission-critical objectives, these battlefields are strewn with strategically valuable targets. Bunkers provide armored refuge on the front lines where defenders can spawn, resupply, and control mounted turrets. Sensor arrays and mortars allow commanders to call in powerful combat abilities, while motor pools supply vehicles for extra mobility and firepower. These facilities serve as lines of defense, and whether they stand or fall has a large impact on how battles play out. Attackers can plant charges to destroy these assets and gain a foothold, while properly equipped defenders can repair them to push the tide back. These struggles are intense and engaging, as players strive to thrust at the enemy, support their teammates, and leverage their individual loadouts to help their faction gain ground. MAG's controls and shooting mechanics are equal to the task, rewarding you with a satisfying squelching noise whenever your shots hit their mark. This fun, frantic combat is the foundation of MAG's appeal, but it's the command structure that takes the game to a new level. In matches with 128 or 256 players, battlefield commanders can have a powerful effect on the ebb and flow of the action. Each squad of eight players has a leader who can designate a target for his squad to assault. Staying near your squad leader bestows temporary boosts like increased reload speed or resistance to damage. More importantly, squad members will earn double experience for any action performed near the designated objective, which is a powerful incentive to stay on task. If a squad leader is actively setting targets, the vast majority of players respond by following his lead, and this makes the game more rewarding for the entire squad and engenders a great sense of camaraderie. Absentee leaders are more of a missed opportunity than a damper on the action, and they can be voted out of the squad with the proper motivation. Fortunately, most squad leaders tend to be active, which not only makes matches more exciting, it can give your faction some explosive advantages. Squad leaders have access to command abilities that allow them to call in outside help. These range from localized strikes, such as cluster bombs or poison gas bombardments, to broader actions, like sensor sweeps or quicker respawn times. The abilities you can use depend on whether you are a squad leader, a platoon leader, or the officer in charge. Platoon leaders and the OIC can also voice chat with everyone under their command, and though they don't seem to take advantage of this feature often, they certainly do make vigorous use of their command abilities. An automated announcer will clue you in to what abilities are activated so you can adjust your strategy accordingly, even if you choose to go rogue. Perched snipers and lone wolf infiltrators may not reap as many benefits from their squad leaders, but these roles can be fun and rewarding in their own right. How you play is up to you, though it does take a while to be eligible for command positions. The added tactical dimension of highlighting objectives, calling in support, and coordinating your troops makes you think about the battlefield in a different way, and provides a unique and engaging challenge. Unfortunately, you won't always get a command position when you want one. All you can do is check a box to apply for one when you enter a match queue and hope that you are selected, which you often won't be. It's worth trying, though, because the satisfaction of raining down explosives on your enemies' heads is too good to pass up. Even if you don't have a command position, you can flex your strategic muscle by tweaking your battlefield loadout. As you gain experience and rank up, you earn skill points that you use to unlock new weapons, gear, and attributes. These include sniper rifles, SMGs, and light machine guns; scopes, bipods, and poison gas grenades; and improved damage resistance, longer sprint distance, and increased health. There are many ways to customize your character, though given the rate you earn skill points, it's best if you choose a specialization early on. It can feel limiting if you're using assault rifles all the time, but you'll be able to unlock more-powerful items more quickly than someone who tries to specialize in both sniping and shotgunning. There is a limit to how much you can equip, so you'll need to make use of the customizable loadout presets if you want to have a range of abilities accessible during battle. You won't know before you join a match if you'll want to be able to revive teammates and repair structures or gas enemy positions and set antipersonnel mines, so it's best to come prepared. No one lasts long in the sights of a bunker turret. You should also be prepared for occasional technical issues. Matches can be hampered by lag, and if you lose your connection to the server, you forfeit the results of your current match. Fortunately, such occurrences are pretty rare. There are also battlefield oddities to contend with, like empty husks of players lingering about even though they have long since respawned. Upgraded medics will also have to contend with targeting awkwardness, making it tough to choose whom to heal in a crowd (including yourself). The tires of stationary vehicles are bizarrely deadly, and knife swipes seem plagued by inconsistency. None of these problems are severe impediments to your enjoyment, though they do give the game a certain roughness. MAG's core mechanics have a lot in common with other games in its genre, and the fast-paced action is frantic and entertaining. But MAG stands out from the crowd because of its large scope and its unique command structure. Whether you are a soldier following your squad leader's orders to flank the enemy and destroy the antiair battery, or a platoon leader calling in airstrikes to stymie the enemy while your forces push forward, MAG makes you feel like part of a collaborative undertaking and rewards you for your part in it. Though it has some rough edges, MAG's busy battlefields and intense firefights are enough to make any soldier's trigger finger itch. In matches with 128 or 256 players, battlefield commanders can have a powerful effect on the ebb and flow of the action. Each squad of eight players has a leader who can designate a target for his squad to assault. Staying near your squad leader bestows temporary boosts like increased reload speed or resistance to damage. More importantly, squad members will earn double experience for any action performed near the designated objective, which is a powerful incentive to stay on task. If a squad leader is actively setting targets, the vast majority of players respond by following his lead, and this makes the game more rewarding for the entire squad and engenders a great sense of camaraderie. Absentee leaders are more of a missed opportunity than a damper on the action, and they can be voted out of the squad with the proper motivation. Fortunately, most squad leaders tend to be active, which not only makes matches more exciting, it can give your faction some explosive advantages. Squad leaders have access to command abilities that allow them to call in outside help. These range from localized strikes, such as cluster bombs or poison gas bombardments, to broader actions, like sensor sweeps or quicker respawn times. The abilities you can use depend on whether you are a squad leader, a platoon leader, or the officer in charge. Platoon leaders and the OIC can also voice chat with everyone under their command, and though they don't seem to take advantage of this feature often, they certainly do make vigorous use of their command abilities. An automated announcer will clue you in to what abilities are activated so you can adjust your strategy accordingly, even if you choose to go rogue. Perched snipers and lone wolf infiltrators may not reap as many benefits from their squad leaders, but these roles can be fun and rewarding in their own right. How you play is up to you, though it does take a while to be eligible for command positions. The added tactical dimension of highlighting objectives, calling in support, and coordinating your troops makes you think about the battlefield in a different way, and provides a unique and engaging challenge. Unfortunately, you won't always get a command position when you want one. All you can do is check a box to apply for one when you enter a match queue and hope that you are selected, which you often won't be. It's worth trying, though, because the satisfaction of raining down explosives on your enemies' heads is too good to pass up. Even if you don't have a command position, you can flex your strategic muscle by tweaking your battlefield loadout. As you gain experience and rank up, you earn skill points that you use to unlock new weapons, gear, and attributes. These include sniper rifles, SMGs, and light machine guns; scopes, bipods, and poison gas grenades; and improved damage resistance, longer sprint distance, and increased health. There are many ways to customize your character, though given the rate you earn skill points, it's best if you choose a specialization early on. It can feel limiting if you're using assault rifles all the time, but you'll be able to unlock more-powerful items more quickly than someone who tries to specialize in both sniping and shotgunning. There is a limit to how much you can equip, so you'll need to make use of the customizable loadout presets if you want to have a range of abilities accessible during battle. You won't know before you join a match if you'll want to be able to revive teammates and repair structures or gas enemy positions and set antipersonnel mines, so it's best to come prepared. No one lasts long in the sights of a bunker turret. You should also be prepared for occasional technical issues. Matches can be hampered by lag, and if you lose your connection to the server, you forfeit the results of your current match. Fortunately, such occurrences are pretty rare. There are also battlefield oddities to contend with, like empty husks of players lingering about even though they have long since respawned. Upgraded medics will also have to contend with targeting awkwardness, making it tough to choose whom to heal in a crowd (including yourself). The tires of stationary vehicles are bizarrely deadly, and knife swipes seem plagued by inconsistency. None of these problems are severe impediments to your enjoyment, though they do give the game a certain roughness. MAG's core mechanics have a lot in common with other games in its genre, and the fast-paced action is frantic and entertaining. But MAG stands out from the crowd because of its large scope and its unique command structure. Whether you are a soldier following your squad leader's orders to flank the enemy and destroy the antiair battery, or a platoon leader calling in airstrikes to stymie the enemy while your forces push forward, MAG makes you feel like part of a collaborative undertaking and rewards you for your part in it. Though it has some rough edges, MAG's busy battlefields and intense firefights are enough to make any soldier's trigger finger itch."}