{"ref": "https://www.gamespot.com/reviews/walt-disney-world-quest-magical-racing-tour-review/1900-2609871/", "date": "May 17, 2006", "game_name": "Walt Disney World Quest: Magical Racing Tour", "text": "Infogrames' Wacky Races was supposed to be the first kart-style racer on the Dreamcast, but a few gameplay quirks made it more like an F1 simulation than a fun cartoon romp. Thanks to Eidos, however, the Dreamcast finally has its first true kart racer: Walt Disney World Quest - Magical Racing Tour. It seems Chip and Dale wandered too close to the theme park's magical fireworks machine one day, accidentally dumping some acorns into it. As a result, the machine went kablooie. To fix it, they have to compete in a series of races to reacquire the parts. While the premise is unrealistic, you certainly can't call it unoriginal. Despite the unique plot twist, though, Magical Racing Tour is mainly a Disney-licensed duplicate of Mario Kart.Magical Racing Tour's homage to Mario Kart begins with its features. There are two racing modes, adventure and versus. The adventure mode lets you take control of one of 12 Disney characters in order to help Chip and Dale repair the magical fireworks machine. Mickey, Minnie, Donald Duck, and Goofy are absent, but the presence of Chip, Dale, and Jiminy Cricket gives the game some semblance of brand familiarity. In order to fix the machine, you must place first in all 13 of the game's courses, which are loosely based on real Walt Disney World rides, such as Splash Mountain, Dinosaur, and Pirates of the Caribbean. Nine of the game's courses contain parts for the fireworks machine, while the rest enable you to unlock hidden characters and other secrets. In versus mode, you and three friends can compete against one another in two types of races: a three-lap challenge or a 30-coin challenge. Unlike Mario Kart or Crash Team Racing, however, this mode lacks battle arenas.When you get into the actual game, Magical Racing Tour's similarities to Mario Kart become even stronger. You begin each race alongside five other drivers. To control your racer, you accelerate with A, brake with B, steer with the analog, use the L trigger to fire power-ups and the R trigger to jump. Powerslides, drifting, and ~super dashes~ behave exactly as in both Mario Kart and Crash Team Racing. Several different types of Mickey balloons dot the track at regular intervals, and - just as with the question blocks in Mario Kart - these balloons give you a number of power-ups. For the most part, these acorn and teacup power-ups behave exactly like Mario Kart's turtle shells, stars, bananas, and ghosts. Literally, the only major gameplay difference between Magical Racing Tour and the rest of the genre is that it plays twice as fast.While Magical Racing Tour lacks originality, it is actually this lack of innovation that makes it a good addition to the kart genre, due to the fact that it incorporates so many time-tested features. Zippers, jump gates, and a plethora of familiar course items await fans of the genre, while newcomers will find the game's lighthearted gameplay an inviting introduction to video game kart racing. If the game has one glaring flaw, it's that it's over too quickly. It takes two hours to break 80 percent, while exceeding 100 percent barely requires another ten or 15 hours. The game does make some attempt at longevity by giving you the chance to compete for trophies and time-attack kudos, but completing these challenges is academic as well. While it may be a Mario Kart clone, Magical Racing Tour does put forth a unique effort in two categories: graphics and sound. Since the courses are based on real Walt Disney World attractions, there are no mushrooms or Koopa look-alikes anywhere. Bleating dinosaurs populate the Dinosaur track, while happy-go-lucky penguins divert your attention on both Big Thunder Mountain and Blizzard Beach. The detail level is high, the courses are colorful, and - unlike the PlayStation release - there's no polygon dropout and barely a hint of slowdown. Another nice touch is the game's use of track-specific vehicles, which adds snowmobiles and speedboats into the mix with the usual stock of four-wheeled buggies.In the sound department, engine noises and character effects are unmistakably Disney, while the music is out of this world. Wonderful renditions of It's a Small World; Yo Ho, a Pirate's Life for Me; and Zip-a-Dee-Doo-Dah await those who play the game. Of special mention is the theme for the Rock & Roll Roller Coaster stage, which somehow seems to effectively blend the sounds of Metallica and Yanni without resulting in nausea. Where Infogrames' Wacky Races failed to capture the true essence of its license, Eidos' Magical Racing Tour succeeds at delivering the emotion and heart of its Disney characters. It's also a pretty good racing game."}