{"ref": "https://www.gamespot.com/reviews/walt-disney-world-magical-racing-quest-review/1900-2547334/", "date": "April 28, 2000", "game_name": "Walt Disney World Quest: Magical Racing Tour", "text": "Though the name may be quite a mouthful, Walt Disney World Quest Magical Racing Tour is a wonderful lighthearted cart-racing game that fans of the genre will surely enjoy. Followers of the world of Disney will also undoubtedly be attracted to the game levels, which are modeled after many of the popular attractions at Walt Disney World. Either way, it's hard to go wrong with WDWQMRT.The story behind the game is that Chip and Dale have accidentally clogged up the Magic Kingdom's fireworks machine with a few accidentally placed acorns. The machine then went haywire and exploded, sending pieces of the machine to nearly every location of the park. It's up to you to race with everyone else in the park and collect pieces of the machine so it can be put back together. You can select from a variety of Disney characters such as Chip and Dale, Moe Whiplash, Bruno Biggs, Otto Plugnut, Polly Roger, and Baron Karlott - just to name a few. The game does have a few other characters that are hidden and that can be unlocked by completing the game.Playing as the Disney character is a lot of fun, but the real treat is exploring the levels you get to race through. All 13 of the game's levels are modeled after the popular rides and attractions within the Magic Kingdom, such as Big Thunder Mountain, the Haunted Mansion, and the Pirates of the Caribbean. Each level is altered so that you can race in and through different parts of the attraction. In addition, most of the levels have specific vehicles that fit the theme of the attraction. For instance, when you reach the Space Mountain track all of the racers pilot little one-man hover/rocket ships. The different vehicles really don't control all that differently, but they add a bit of verity and style. The gameplay of Disney's Magical Racing Tour is straightforward, fun, and involving. It has the typical cart-racing game setup where you race laps around a track and pick up items like teacups and acorns, which you can launch at your opponents. Controlling the carts is very easy - all you really do is steer, accelerate, and break. The only real strategy in the game comes into play when you are trying to take shortcuts or when you are using items.Visually, Magical Racing Tour is very nice. The game moves at a brisk pace and provides a wonderful sense of speed. Moreover, the levels never really pop up in front of you - the point at which the level is drawn in is always far out of view. All of the characters are very detailed and articulated, as are the various vehicles they pilot through the levels. The levels themselves are awesome; when racing, you find yourself being distracted by objects and characters that you've seen before throughout the game. In the audio department, Magical Racing Tour does a great job of re-creating the experience of visiting the park. The game's opening and menu screens are accompanied by the infamous It's a Small World ditty, which gets under your skin just as fast as it does in real life. Each of the levels has the specific music and sound effects that you'd hear if you were actually at the park on the ride. During the Pirates of the Caribbean level, you can hear the individual animatronic characters speaking the lines that have made the ride such a favorite. Disney's Magical Racing Tour on the surface may just seem like another Mario Kart or Crash Team Racing clone, and once you spend any amount of time with the game you'll realize that, at its core, it truly is one. However, with its awesome levels, characters, vehicles, shortcuts, items, overall presentation, and gameplay, Magical Racing Tour has more than enough style - and it offers a different enough experience - to make the game worthwhile. In addition, those that love the world of Disney will find the game to be a surprising treat that is wonderfully fun, not only for its content but also for its gameplay."}