{"ref": "https://www.gamespot.com/reviews/time-crisis-project-titan-review/1900-2776563/", "date": "May 17, 2006", "game_name": "Time Crisis: Project Titan", "text": "Light-gun games have rarely garnered much respect in the gaming community, which is due in part to their relatively shallow gameplay and the gimmicky nature of the light gun. Namco managed to break this trend with the Time Crisis games, which brought more depth than most other light-gun games, along with an almost tangible frantic action feeling. The PlayStation saw a port of the original Time Crisis, and Namco has now developed a PlayStation-exclusive Time Crisis game called Project Titan.Your character's motivation is fairly straightforward, if not slightly irrelevant. You play as Richard Miller, the black-leather-jacket-clad secret agent from the first Time Crisis game, and you've been framed for the assassination of Xavier Serano, president of the fictional, assumedly Caribbean island country of Caruba. Your employers have a certain level of faith in you and give you 48 hours to clear your name before they turn you over to the Caruban authorities. Further plot details, mostly concerning spies, espionage, and double-crossing villains, are revealed courtesy of real-time cutscenes throughout the rest of the game, but they serve as little more than window dressing.The meat of Time Crisis has been and remains the game's unique gameplay system. Whereas most modern light-gun games have you shoot offscreen to reload your weapon, Time Crisis instead has you press the button on the side of the GunCon to duck behind something and reload, as well as to avoid shots being fired at you. But there is a clock running the entire time, and it's game over if time runs out, so this gives you incentive to shoot fast and to make your shots count. In the arcade, Time Crisis games are equipped with a foot pedal for ducking, which keeps both your hands free to aim. Using the button on the barrel of the GunCon can quickly wear out your arms, as well as inhibit your accuracy. Aside from giving you the ability to duck, Project Titan is on rails like any other shooter, moving you from one scenario to another, all the while shooting at about a dozen subsets of bad-guy clones while they try to shoot you.Project Titan departs from the standard Time Crisis gameplay during boss fights by letting you move to several different fixed locations during the fight. When you duck, yellow arrows will appear in the direction you're able to move. Shoot the arrow, and you'll move to that position. It is an interesting gameplay addition and makes the boss fights more about pattern recognition than sharp shooting. Another PlayStation-exclusive feature is the shot combo system, which rewards you with lives for shooting a number of villains without missing.The game is true to its arcade roots to a fault, as is exemplified in the lack of options and the harsh penalties for failure. The game has the primary story mode, as well as a time attack mode, which runs you through the story mode with unlimited health, testing just how fast you can run through a level. You're given three health boxes, which allow you to get shot once, twice...but by the third shot, you're dead. If you die, you can use one of your finite continues, but that brings you back to the beginning of the level. It's a cheap way to lengthen the game, and it would've been nicer to see more thought put into converting this arcade concept into a console game.Project Titan has been in development for almost two years, but unfortunately, it looks no better than the 4-year-old PlayStation version of the original Time Crisis. The character models and textures are extremely simple and are reused frequently. The animation is downright bad, as characters will go directly from crouching to flying backwards through the air without any real transition. Despite the badly dated presentation, Project Titan still moves at a fast clip, and the visuals manage to stay out of the game's way.There are some good ideas in Project Titan, and some of them are well executed. Hard-core Time Crisis fans and those just looking for a good gun game would do well to pick up this game, but the antiquated presentation, lack of options, and brutal continue system will make this at best a rental for most."}