{"ref": "https://www.gamespot.com/reviews/doom-eternal-the-ancient-gods-part-2-review/1900-6417653/", "date": "March 23, 2021", "game_name": "DOOM Eternal", "text": "Doom Eternal: The Ancient Gods Part 2 is a workout for your hands.That isn't a result of inaccessible controls; with this DLC, id Software has added the option to fully remap console controls. Even with that flexibility, after a few hours with the new DLC expansion to the 2020 shooter, my palms and knuckles begin to ache. I'm playing on PS5, and the DualSense is a beefy controller. The Ancient Gods Part 2 pushes you to use every square inch of it. There are a lot of demons to kill here and with Ancient Gods Part 2, id Software has given us the Doom Slayer's most expansive arsenal of weapons to do so yet. Far from being just a set of three new levels, Doom Eternal: The Ancient Gods Part 2 introduces multiple new enemies, a new traversal mechanic and a new weapon, all of which alter the flow of battle for the better.I had my frustrations with The Ancient Gods Part 1, most stemming from the introduction of new enemies (like the Blood Maykr and the Turret) that required pinpoint accuracy to eradicate, which had a tendency to slow fights to a crawl. But The Ancient Gods Part 2 thankfully leans back in the other direction. One new addition to the bestiary, the Cursed Prowler, can (as the name suggests) curse you if it manages to land a hit with its projectile attack. To break the curse, you need to kill the Cursed Prowler. Simple enough. But this durable creature can only be killed with a Blood Punch. And, if you don't have a Blood Punch ready, you'll need to Glory Kill other monsters to build your meter up. So, instead of rooting you in one spot with your eye to the scope, the Cursed Prowler encourages you to dive into the fray. It can be frustrating to get hit with a curse and begin losing health in the middle of a tough battle, but it's a change for the better: one toward frenetic movement and away from the occasional aim-down-sights inertia of the first DLC.Other new enemies similarly keep things moving. The Stone Imp is a variation of the Imp that upgrades the fodder enemy's defense with a rocky layer of skin. To take it down, you'll need to bust out the Combat Shotgun's automatic fire mode and load the Imp's igneous exterior with shells. Then there's the Armored Baron which can be taken down quickly with a well-timed, well-aimed blast, or worn down slowly with the Plasma Rifle. There's the Riot Soldier, whose hefty riot shield means you'll need to attack from behind. And then there's the Screecher Zombie, which you need to avoid entirely; kill it and it temporarily boosts the speed and defense of every other enemy in the area. The Ancient Gods Part 2 keeps you dancing, scrambling behind an opponent, strafing around it or guiding other enemies away from it. Where The Ancient Gods Part 1 frequently halted the dance, Ancient Gods Part 2 adds new steps.With all these moving parts, fights often feel hectic. But The Ancient Gods Part 2 gives you a new weapon to push back and help set the pace. The Sentinel Hammer is an incredibly useful tool for crowd-control--especially when used in concert with ice grenades. The new weapon launches you into the air and brings you crashing down with stupefying force, killing all small enemies and stunning all heavy enemies within a pretty wide radius. It's great. It allows you to temporarily escape conflict, recalibrate, heal and jump back into the fray. It's so useful that I wish there was a way to take it back into the original Doom Eternal campaign or the first DLC.Like the base game and Part 1 before it, The Ancient Gods Part 2's story is front and center. The sheer number of proper nouns hasn't changed. But The Ancient Gods Part 2 does have some terrific sights which make the story a little more palatable. You fly on a dragon. You join an all-out war for control of Hell. You beat up an arch demon who looks exactly like the Doom Slayer. Are there lore reasons for all these things? I'm sure. But I ignored that completely and enjoyed the imagery the way you would enjoy set dressing whipping by on a rollercoaster ride.My biggest gripe with The Ancient Gods Part 2 is the very last thing you do before you hit credits. The final boss fight feels like a very intentional troll aimed at critics of the Marauder, the multifaceted warrior enemy who can deal out damage to the Doom Slayer from any distance. It will certainly make Marauder haters who return for this DLC feel justified in that opinion. The final boss is basically a hulked-out version of the base enemy, with the same basic moveset and the ability to summon ghostly versions of the game's roster of heavy enemies at will. If this boss lands a successful melee attack, the Doom Slayer drops healing orbs which the boss will use to replenish its health. So, you may whittle the boss' health to nearly zero, but if it lands two melee attacks on you, its health will be topped up all over again. Oh, and did I mention that there are five phases? It's a grueling, deeply frustrating fight and it left a bitter taste in my mouth as I finished an otherwise great expansion.That said, id Software has largely toned down The Ancient Gods Part 1's most annoying excesses with Part 2 and added a new crowd-control weapon that you will miss any time you return to the previous installments. In short, this is the most complete version of Doom Eternal and, aside from a terribly frustrating late-game boss fight, a consistently great note for Eternal to go out on."}