{"ref": "https://www.gamespot.com/reviews/painkiller-overdose-review/1900-6182226/", "date": "November 2, 2007", "game_name": "Painkiller: Overdose", "text": "Although more than three years have passed since Painkiller first shot up hard drives, this deeply unfashionable shooter series hasn't done any growing up since 2004. And thank the gods for that. Not too many developers are bothering with old-school shooters anymore, so it's a real pleasure to blast through such a gleefully stupid stand-alone expansion pack like Painkiller: Overdose. All of the design attributes that made the original game as subtle as blunt-force trauma are back for more, including monsters that seem to have escaped from an Iron Maiden album cover, as well as slice-and-dice weapons that wouldn't be out of place in a torture chamber. Only some technical difficulties and the nagging sense of dj vu interfere with the bloody good time on offer here. If you've played the original Painkiller, you already know the score. Mindware Studios' Overdose is pretty much a straight remake of People Can Fly's cult hit from the summer of 2004, with the same sledgehammer mentality. Considering this expansion started life as a free mod project before it got the attention of the bigwigs at DreamCatcher Games, it shouldn't be too surprising that little new ground has been broken. You're now playing a half-angel, half-demon named Belial in the three-chapter campaign instead of a dead guy looking for his wife, but this mystical creature tosses out wisecracks like Serious Sam. Hell, he even sounds so much like Serious Sam that you have to wonder if the developers hired the same actor to voice his lines. Regardless, there is definitely some of the sincerest form of flattery going on here. Belial constantly snorts out cheesy action-movie lines. He mutters ~Tastes like chicken!~ when he sucks down a soul, sings ~Dum-dum-dum! Another one bites the dust!~ when he wastes an enemy, and even grumbles about ~sand in my crotch~ when entering the Egyptian level. Nero had no idea what he was springing on Rome when he set that fire. All of the weapons have been replaced with new models that mirror the old ones. For instance, the crowd-pleasing stake gun, has been swapped out for a crossbow with the identical ability to staple enemies to walls. All-new ghouls have been tapped to stand in for the old ghouls, although they aren't as out-there as those that populated the original Painkiller. While the zombies, various types of skeleton, robots, flaming demons, and the rest of this creepy crew look great, they're very predictable. As soon as you get a look at the level setting, you know what's coming next. Of course, predictability is sort of the point. As with every traditional first-person shooter dating back to Wolfenstein 3D, the game gulps down an old formula. You walk into a room, valley, or cave jazzed up with Halloween lighting effects. A door clangs shut behind you. Driving music powers up. A few dozen creepy monsters pop in with a flash of brimstone. Mayhem commences. Repeat this for a dozen hours or so. The end. The only template tweaks are holdovers from the original Painkiller. Thus, the ability to kick off a demonic freak-out by swallowing enemy souls is back, as is the tarot-card system that rewards the completion of extreme challenges (finishing a level using only a wimpy weapon, for example) with cards that can be purchased to grant the buyer kick-ass powers. Oh, there's one more change that shouldn't go unmentioned--the developers have jettisoned the spectacularly appropriate thrash-metal music for wimpy orchestral stuff and pounding techno. Somewhere out there, Beavis and Butt-Head are not amused. All that truly separates Overdose from other old-time shooters is a horror-movie groove that's equal parts Clive Barker gruesomeness and Hammer Horror cheese. As with the first game, the levels are a jumble. You're supposed to be fighting in purgatory, which is apparently a creative code word for ~maps featuring whatever the hell we think looks cool.~ So you get an ancient Rome burning level populated by spooky gladiators, fire elementals, and giant cyclopes; a misty Japanese village level with ninjas, kung-fu old guys with coolie hats, and murderous geishas; an asteroid space base staffed by flying robots; some sort of Egyptian desert occupied by mummies, scarab beetles, and what looks like the god Anubis flying around on a magic carpet; plus murky swampland featuring giant tentacles that erupt from the ground and squid-faced Cthulhu rip-offs. Nothing here quite approaches the twisted genius of the original game, which had electric lunatics in an insane asylum and skeletal biker dudes hanging out by the Venetian canals. Only the hopping cyclopean demon arms come close, but there aren't enough of them in the game to make an impact. At least it all looks good. While the visuals aren't entirely up to contemporary standards (rest easy, Source nuts) and there are only a couple of really knockout sections in each level, the overall art design is incredible, save for the odd issue with messed-up lighting effects. The only problem is that the now-dated Pain engine isn't up to snuff. Particle effects, such as smoke and sand, cause it to chug, regularly dropping the game to single-digit frame rates. The developers have compensated for this by slowing the whole game down when this happens, so battles remain playable even when you seem to be trudging through quicksand. Still, even without any herky-jerky moments, the game drops into slo-mo far too often. Dried out mummy. Flaming torch. Hmmm, not hard to see that something could go horribly wrong here. Long load times are another huge annoyance. This was a major drawback of the original Painkiller, and all the extra eye candy in Overdose seems to have made an already-bad problem much worse. Loading even quick saves takes at least a full minute, which really gums up the works in such a pure arcade shooter that is all about running and gunning. You can also get killed pretty regularly here, so you can easily waste three or four minutes out of every 10 spent playing the game just sitting back and twiddling your thumbs in front of a loading screen. This can be very irritating, but at least it makes you extra desperate to avoid getting smoked. It seems like a lot of people are desperate to avoid the multiplayer modes of play. Online battles were never a strength of the original Painkiller, and they aren't a strong point here either, given the fact that nobody seems to be playing the game over the Internet. Maps have once more been made pretty tiny to compensate for the game engine's poor handling of large, open areas. This makes it poorly suited for multiplayer mayhem because matches with more than four players turn into a chaotic affair where you're constantly running into each other. Matches get tiresome quickly because everything seems so random that there's little rhyme or reason to anything you do. You might actually feel brain cells dying while playing Painkiller: Overdose, but even so, it's hard to quibble with such pure, dumb fun. Even though long loads can cause more angst than the multitudes of monsters trying to disembowel you, this old-fashioned shooter is a welcome respite from the scripted, story-driven epics littering the FPS landscape these days (and a pleasant reminder of the simple joy of shooting fiendish creeps in the face)."}