{"ref": "https://www.gamespot.com/reviews/feeding-frenzy-2-shipwreck-showdown-review/1900-6198479/", "date": "October 2, 2008", "game_name": "Feeding Frenzy 2: Shipwreck Showdown", "text": "In the words of Jedi master Qui-Gon Jinn, there's always a bigger fish. That's certainly true in Feeding Frenzy 2: Shipwreck Showdown, a colorful action game in which you become part of a marine food chain. Playing as one of several different fish, your goal is to eat species that are smaller than you while avoiding those that can swallow you whole. Shipwreck Showdown improves upon its simplistic predecessor by introducing a number of new gameplay features and multiplayer modes to the mix, but the fun is ultimately short-lived. Even those of you with a penchant for achievement points or online leaderboards will be hard pressed to find much in the way of replay value. Shipwreck Showdown is played from the same perspective you'd get if you were peering into an aquarium, though the fish in the game certainly aren't species that you'd ever want to keep together in a confined space. Small fish seemingly exist only to be eaten by bigger ones who, in turn, are food for even larger predators. Even as a great white shark you're not safe in this unrepentant cycle of eating; the orcas who reside at the top of this simplified food chain can swallow you whole. Levels in which you can jump out of the water and eat insects add some much-needed variety. Typically, you start out as one of the smallest fish in each level, so avoiding predators is often more of a priority than chasing after the small fry early on. When you've eaten enough fish you grow bigger, and in doing so you move up the food chain a notch so that you can prey upon some of the species that were previously a threat. It's satisfying to turn the tables on your enemies like that, but when you're one of the biggest fish in the area toward the end of each level, eating enough to progress to the next becomes something of a foregone conclusion. Your goal on almost every level is the same, and at times, the gameplay can feel as repetitive as the life of a goldfish swimming laps in its bowl. There are levels that successfully mix things up a bit scattered throughout the Story mode, but even these new features get old after you've seen them a few times. For example, there are multiple levels in which you can jump out of the water to catch insects flying near the surface, as well as others which take place in darkness but become increasingly illuminated every time you eat glowing plankton. There are also a handful of boss battles, but they all pit you against the same boss, and they all play out in much the same way. Colorful backdrops that include shipwrecks and coral reefs aside, the only other meaningful variety comes courtesy of the power-up items that you can collect in each level. In the first game, there were a few different power-ups that afforded you speed boosts, allowed you to temporarily stun enemies, and that kind of thing. All of these return in Shipwreck Showdown, and the arsenal has been expanded to increase your odds of survival against predators that are considerably more intelligent than their counterparts in the previous game. For example, any fish that's chasing you can be distracted and pulled away from you across the screen if you pick up a fishing-lure item. Picking up a mushroom will also magically shrink any fish larger than you to make it edible. You can even have up to three tiny ~shield fish~ swimming alongside you that will automatically dart into a predator's mouth in your place when you're about to lose a life. Unfortunately, these power-ups are a little too powerful, and when they're available, they make this already not-very-difficult game too easy for its own good. Both predators and prey are more aware of your presence than they were in the first game, and behave accordingly. In addition to the 60-level Story mode, which you can play solo or cooperatively with up to three friends on the same console, and comfortably beat in under four hours, Shipwreck Showdown features an easier ~Lite~ mode with fewer levels that's suitable for young children, as well as 10 different multiplayer games designed for up to four players. Most of the multiplayer offerings simply challenge you to eat more of a particular foodstuff than your opponents, but there are a few games that add some much-needed variety--and provide varying degrees of fun. Tailbite Tag sees you and your friends attempting to bite each other's tails, which is fun. Chomp 'n' Chase is a tag variant, which is also a lot of fun. Belly Flop is a race to see who can perform the most flips in midair after jumping out of the water, which is not fun. Regardless of its shortcomings, Shipwreck Showdown is a worthy sequel to Feeding Frenzy in so much as it improves upon almost every aspect of that game. Even the modest cartoon-style visuals look significantly better than those in the original game when you see them side-by-side. The same can't be said for the audio, but while both the soundtrack and effects are generic, they certainly don't detract from the gameplay experience. Feeding Frenzy 2: Shipwreck Showdown is no catch of the day, but it's certainly fun enough for you not to throw it back into the water."}