{"ref": "https://www.gamespot.com/reviews/tiger-woods-pga-tour-2004-review/1900-6075638/", "date": "September 23, 2003", "game_name": "Tiger Woods PGA Tour 2004", "text": "EA Sports has spent the past four years slowly improving the quality of its Tiger Woods PGA Tour series of golf games, and it arguably hit its stride last year with Tiger Woods PGA Tour 2003. That game all but perfected the series' dramatic visual style and tactile analog swing mechanic, while piling on loads and loads of courses and gameplay options. In fact, the 2003 edition was so well made, it could have made a halfhearted Tiger Woods PGA Tour 2004 irrelevant. Fortunately, EA Sports clearly hasn't been resting on its laurels and has poured enough great new features and courses into Tiger Woods 2004 to make it a worthwhile purchase for any and all golf fans. Tiger Woods 2004 outclasses its predecessor in several important ways. Functionally, Tiger Woods PGA Tour 2004 is not that much different from last year's Tiger. The analog swing is unchanged, letting you control the power and direction of your shot with a back-and-forward motion on the analog stick. The game also offers all kinds of assistance to sloppy duffers, letting you alter the spin of the ball in the air, providing slope grids, and offering shot advice while you're putting. All of this assistance helps keep the game from becoming exceedingly frustrating, and all of it is optional for those who take the game more seriously. There are nearly 30 different golfers from which to choose, pretty evenly split between real-life pros and EA's homegrown characters. (There's even a guest appearance from Cedric the Entertainer.) One of the big new additions to Tiger Woods 2004 is the ~game face~ feature that allows you to create your own pro golfer with a rather painstaking level of detail. This player creation mode lets you define virtually every aspect of your player's appearance. For some idea as to how extensive it is, there are 18 different attributes that can be modified in terms of facial structure alone, not including facial hair, eye color, skin tone, and what your golfer's teeth might look like. Truly, the level of character customization offered by the game face feature is unparalleled. Tiger Woods PGA Tour 2004 contains all of the gameplay modes found in last year's version, plus a few extra. You can still take part in the esteemed PGA Tour, as well as one-off rounds of stroke, match, and skins games. You can also take part in team-based games, like best ball and fourball. For more fast-and-loose golf, there's speed golf, battle golf (where two players can go head-to-head to try to win each other's clubs), and the long drive shootout. The skillzone returns and still stands as a great set of drills to help you hone the different abilities you need on the fairway. The scenarios are a great way to test your skills, throwing you into a series of bad situations and leaving it up to you to work your way out. Most of the modes in the game can be played with up to four players, and the variety of play offered makes it a great multiplayer game. New this year are the real-time events that synchronize with the console's system clock to offer special competitions on specific days of the year. Winning these competitions nets you exclusive gear and apparel that you can't get any other way. It's not a make-or-break feature, but adding it to Tiger Woods 2004's already impressive stable of gameplay modes only makes the game that much stronger. And then there are the courses... While last year there were 12 18-hole courses--many of which were inaccessible when you first started--Tiger Woods PGA Tour 2004 offers a whopping 19 different courses to play, and 14 of them are playable right off the bat. That's so many courses that the GameCube version of Tiger Woods 2004 had to be spread across two discs! Even if EA Sports had simply left every other aspect of the game identical to Tiger Woods 2003, the staggering number of new, playable courses alone makes 2004 a worthwhile purchase. Tiger Woods PGA Tour 2004 looks fundamentally identical to Tiger Woods PGA Tour 2003, which is to say, it's a really good-looking golf game. The courses faithfully represent their real-life counterparts, featuring consistently clean, realistic-looking textures. The scope of what the camera sees has been increased a bit, occasionally giving you a glimpse of the next hole. This gives you a better sense of actually playing a course rather than presenting a series of disconnected holes. The player models appear slightly cleaner, with better facial detail and small touches, like the way breezes cause a player's clothes to flutter. Most of the player animations are recycled from Tiger Woods 2003, but they still look really smooth and natural, adding extra emotional weight to both great and horrible shots. The striking visual effects that really helped Tiger Woods 2003 stand out return this year, with a handful of new shots to help make really strong tee-offs and achingly close shots that much more intense. All told, it's not a significantly better looking game, but it's still arguably the best-looking golf game out there. The 'game face' player creation feature really helps put you in the game. The only nagging issue with the Tiger Woods games that EA has yet to address seriously is the game's soundtrack. For the past two years, EA has been assembling seemingly random collections of contemporary licensed songs and calling them soundtracks. Again, the soundtrack in Tiger Woods 2004 tries to be all things to all people, oscillating between indie rock and hip-hop beats. The way the soundtrack goes immediately from Rooney to DMX is just jarring. You have the option of selecting your own playlist as well as which gameplay modes the music will actually come up in, though. Much like last year, the ambient environmental effects are done well enough so that turning off the music entirely is a perfectly viable option. These effects, combined with the casual, contextual tone of the commentary, really help make you feel like you're out there on the course. Tiger Woods PGA Tour 2004 offers such a complete package, it almost seems like EA is painting itself into a corner. With the sheer number of courses available, the variety of gameplay modes offered, and the overall polish of the presentation, there just doesn't seem like a lot of room for improvement for Tiger Woods PGA Tour 2005."}