{"ref": "https://www.gamespot.com/reviews/soulcalibur-broken-destiny-review/1900-6216668/", "date": "September 2, 2009", "game_name": "SoulCalibur: Broken Destiny", "text": "When you start playing SoulCalibur: Broken Destiny's single-player Gauntlet mode, a warning pops up on the screen to let you know that its bizarre story is ~based on obscure fables and does not accurately represent SoulCalibur history.~ Fortunately, just about everything else in Broken Destiny feels very much like it belongs in the long-running fighting series. The weapon-based combat is as accessible and as deep as ever, the arenas are ripped right out of SoulCalibur IV, and the two new fighters introduced in this game are definitely a better fit than the Star Wars characters that graced the aforementioned Xbox 360 and PlayStation 3 game. There's not enough compelling single-player content here to make Broken Destiny a must-have if you're planning on going solo, but add a friend with a second copy of the game to the equation, and good times are guaranteed. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: SoulCalibur: Broken Destiny Video Review All 28 of the fighters on Broken Destiny's roster are available from the outset. You can also create your own fighters from scratch using limited customization tools to determine their physical appearance and then dress them up in gear chosen from a massive wardrobe, much of which has to be unlocked. There are no performance bonuses associated with clothing and weapons this time around, which is unfortunate if you really enjoyed that aspect of SoulCalibur IV, but great if you want to wear all of the matching pieces of the Santa costume without feeling like your fashion choices are compromising your effectiveness. Regardless of which fighter you choose to play as and what he or she is wearing, Broken Destiny, like previous SoulCalibur offerings, is easy to pick up and grasp the basics of. You can move in eight directions using the D pad or the analog nub, and face buttons are used to guard and to perform basic horizontal attacks, vertical attacks, and kicks. That's really all you need to know to get started, though you'll find that there are plenty of more advanced techniques to master if you check out the character-specific move lists in the useful Training mode. Oddly, Broken Destiny doesn't feature an Arcade mode in which to pit your chosen combatant against a number of opponents en route to a matchup with a boss. In its place is Trials mode, which incorporates three distinct score-based challenges in Attack, Defense, and Endless flavors. In the Trial of Attack you're pitted against five opponents and earn score bonuses for playing aggressively and for landing combos. The Trial of Defense is a little longer and culminates in a boss battle against Algol from SoulCalibur IV, so in that respect it's a lot like that game's Arcade mode. The main difference here is that you score points and earn bonuses for guarding against your opponent's attacks and retaliating quickly. Endless Trial is a survival mode of sorts, except that your fighter regains all of his health between rounds. Seeing how many of the increasingly tough opponents you can make it past without ever losing is a lot of fun, but your score isn't based on that. Rather, every time you land a blow you earn points, and there's a score multiplier that goes up when you hit your opponent but falls back down when you get hit. The scoring system in the trials means there's some fun to be had replaying them to beat your best performances, but it's unfortunate that there's no way for you to compare your high scores with those of other players online. New boy Kratos has a number of cool moves that set him apart from the SoulCalibur regulars. Outside of quick one-on-one matches against the AI that you choose from a pseudo online lobby complete with win/loss records for different players, Broken Destiny's only other single-player content is the story-driven Gauntlet mode. Spanning more than 30 chapters each composed of multiple challenges, this mode is really just a lengthy tutorial that trains you to defend against every character in the game. Learning to effectively evade and guard against your opponent's attacks is important, and if you take the time to play through all of the 80-plus Gauntlet challenges, you'll almost certainly emerge a better player than you were when you went into it. You're not necessarily going to have much fun along the way though. Save for a boss fight at the very end, Gauntlet mode is comprised almost entirely of challenges that last just a few seconds, and in that time you have to complete a number of very specific objectives to progress. For the most part, that means starting with very little health, avoiding an enemy's attacks, and then landing an attack of your own. You're set up to fail most of these the first time, because unless you're a seasoned SoulCalibur veteran, you're not going to know if the attacks coming at you in rapid succession are going to be high or low, vertical or horizontal, or even unblockable. Fail once, and you're given feedback from other characters that, more often than not, includes a breakdown of exactly what you need to do. That's good, because hearing the announcer say ~mission failed~ over and over again in a short space of time when you get stuck on a challenge can be infuriating. Broken Destiny's story is best ignored unless you're looking for some laughs. As you progress through Gauntlet mode, you're introduced to throw escapes, stun recoveries, guard impacts, aerial controls, interrupts, and a number of other features that leave you in no doubt as to how deep the fighting system is. You're also exposed to facets of the fighters' personalities that you've never seen before and that, frankly, you probably won't want to see again. Yun-seong believes he's receiving messages from aliens, Zasalamel is an interdimensional peeping tom, Nightmare cries a lot, and moonwalking newcomer Dampierre has a penchant for young girls that's second only to his feelings about facial hair. In short, by the time you reach the end of the Gauntlet mode you're left in no doubt as to why the story isn't considered SoulCalibur canon. The only character who makes it through the mode with his reputation intact is Kratos, the antihero of Sony's God of War series. In fact, Kratos makes it through all of Broken Destiny's modes without losing face. Not only does he have a formidable arsenal of moves that make him feel quite different from anyone else on the roster, but in Creation mode, the only option you have for customizing him is to equip him with very slightly different chain-blade weapons. Leather loafers, short slops, goddess gauntlets, and elf ears are available elsewhere on the roster, but the only options available to Kratos are the same outfit he wears in the God of War games and the suit of armor he can be seen wearing at the start of God of War II. Regardless, he's a good addition to the roster, and with unusual abilities that include launching himself into the air using Icarus wings and swinging from the chains attached to his blades, he poses a challenge whether you're going up against him or attempting to master his moves yourself. The same can be said of Dampierre, who employs concealed weapons and an unorthodox fighting style that frequently causes him to lose his balance. The best way to put your skills with either of the SoulCalibur newcomers to the test, of course, is to use them not against the admittedly impressive AI but against another player in Versus mode. Unfortunately, there's no online play, but the option to play against friends locally in an ad hoc party is well implemented at least. Connecting is quick and easy, the gameplay is lag-free, and your win/loss records with different opponents are remembered across multiple sessions. Also deserving of a mention is an option to install a portion of the game data to your memory stick, which almost completely cuts out any load times between matchups, not just in Versus mode, but across the entire game. The AI puts up a good fight, but playing against friends is a lot more fun. SoulCalibur: Broken Destiny's presentation is impressive in almost every regard. Fighters are detailed and animate smoothly, the varied arenas they do battle in are nicely lit, and the accompanying sound effects make attacks feel even more powerful than they look. The orchestral soundtrack is a great fit and, in conjunction with the over-the-top fight announcer and some ostentatious one-liners from the characters themselves, it makes every battle feel like an epic encounter. Because the bulk of its single-player content is best suited to players who already have some SoulCalibur experience, Broken Destiny isn't quite as easy to recommend to newcomers as other games in the series. However, if you're already comfortable with SoulCalibur or with similar 3D fighting systems and can live with the lack of online play, there's really no reason you shouldn't pick this one up posthaste. Save for a boss fight at the very end, Gauntlet mode is comprised almost entirely of challenges that last just a few seconds, and in that time you have to complete a number of very specific objectives to progress. For the most part, that means starting with very little health, avoiding an enemy's attacks, and then landing an attack of your own. You're set up to fail most of these the first time, because unless you're a seasoned SoulCalibur veteran, you're not going to know if the attacks coming at you in rapid succession are going to be high or low, vertical or horizontal, or even unblockable. Fail once, and you're given feedback from other characters that, more often than not, includes a breakdown of exactly what you need to do. That's good, because hearing the announcer say ~mission failed~ over and over again in a short space of time when you get stuck on a challenge can be infuriating. Broken Destiny's story is best ignored unless you're looking for some laughs. As you progress through Gauntlet mode, you're introduced to throw escapes, stun recoveries, guard impacts, aerial controls, interrupts, and a number of other features that leave you in no doubt as to how deep the fighting system is. You're also exposed to facets of the fighters' personalities that you've never seen before and that, frankly, you probably won't want to see again. Yun-seong believes he's receiving messages from aliens, Zasalamel is an interdimensional peeping tom, Nightmare cries a lot, and moonwalking newcomer Dampierre has a penchant for young girls that's second only to his feelings about facial hair. In short, by the time you reach the end of the Gauntlet mode you're left in no doubt as to why the story isn't considered SoulCalibur canon. The only character who makes it through the mode with his reputation intact is Kratos, the antihero of Sony's God of War series. In fact, Kratos makes it through all of Broken Destiny's modes without losing face. Not only does he have a formidable arsenal of moves that make him feel quite different from anyone else on the roster, but in Creation mode, the only option you have for customizing him is to equip him with very slightly different chain-blade weapons. Leather loafers, short slops, goddess gauntlets, and elf ears are available elsewhere on the roster, but the only options available to Kratos are the same outfit he wears in the God of War games and the suit of armor he can be seen wearing at the start of God of War II. Regardless, he's a good addition to the roster, and with unusual abilities that include launching himself into the air using Icarus wings and swinging from the chains attached to his blades, he poses a challenge whether you're going up against him or attempting to master his moves yourself. The same can be said of Dampierre, who employs concealed weapons and an unorthodox fighting style that frequently causes him to lose his balance. The best way to put your skills with either of the SoulCalibur newcomers to the test, of course, is to use them not against the admittedly impressive AI but against another player in Versus mode. Unfortunately, there's no online play, but the option to play against friends locally in an ad hoc party is well implemented at least. Connecting is quick and easy, the gameplay is lag-free, and your win/loss records with different opponents are remembered across multiple sessions. Also deserving of a mention is an option to install a portion of the game data to your memory stick, which almost completely cuts out any load times between matchups, not just in Versus mode, but across the entire game. The AI puts up a good fight, but playing against friends is a lot more fun. SoulCalibur: Broken Destiny's presentation is impressive in almost every regard. Fighters are detailed and animate smoothly, the varied arenas they do battle in are nicely lit, and the accompanying sound effects make attacks feel even more powerful than they look. The orchestral soundtrack is a great fit and, in conjunction with the over-the-top fight announcer and some ostentatious one-liners from the characters themselves, it makes every battle feel like an epic encounter. Because the bulk of its single-player content is best suited to players who already have some SoulCalibur experience, Broken Destiny isn't quite as easy to recommend to newcomers as other games in the series. However, if you're already comfortable with SoulCalibur or with similar 3D fighting systems and can live with the lack of online play, there's really no reason you shouldn't pick this one up posthaste."}