{"ref": "https://www.gamespot.com/reviews/stupid-invaders-review/1900-2784166/", "date": "May 17, 2006", "game_name": "Stupid Invaders", "text": "Point-and-click adventure games have rarely struck a chord with console players due to the genre's lack of interaction and the overtly passive experience it supplies. There have been mythical adventure games like Myst, comedic romps like Escape from Monkey Island, and horror epics like the Clock Tower series on the PC, but none have been as gross as Stupid Invaders. As the septic equivalent to Ren & Stimpy, Ubi Soft's adventure game for the Dreamcast is filled with flatulence and topped with a dash of crossgender references. Despite its unique content, Stupid Invaders is unable to overcome its genre's inherently dated gameplay.The story in Stupid Invaders seems simple at first, but as the game wears on, new players are introduced to the proceedings to give it some life. At the game's outset, the five glaringly moronic aliens are about to escape Earth and return home in their newly repaired ship. In search of UFO technology, a Clint Eastwood-like character named Bolok launches a surprise attack and zaps all but one invader with a freeze ray. You eventually learn that Bolok is nothing more than a bounty hunter for the sinister Dr. Sakarine--who will stop at nothing to squeeze every last bit of information from the marauding idiots. From here the game quickly turns into a conglomeration of off-color jokes and clich situations that demonstrate just why the Space Goofs cartoon was canceled. It's just not very funny.Stupid Invaders' icon-driven gameplay isn't any different from previous point-and-click adventure games. Interaction is kept to a minimum, and the focus is on solving simple puzzles. You play as all five invaders throughout the game, but the gameplay always remains the same. A hand-shaped cursor will change animations to alert you to objects you can manipulate. The cursor can then be used to examine, operate, or take objects. Far too often you're required to traverse the same areas multiple times taking one object from one end of an area to the other and back again. There are a few scenarios where it becomes obvious that the game's developers are either performing tests on the human limits of monotony or are hoping to extend the length of the game considerably. Another quirk with Stupid Invaders' gameplay is that simply selecting the wrong door to enter or button to push often results in instant death. With no clues to aid you when making a decision, saving constantly and memorizing each room are the only options for success. This sort of trial-and-error gameplay becomes tiresome rather quickly.While prerendered, the environments in Stupid Invaders are arguably some of the nicest that the Dreamcast has to offer. One thing the Space Goofs cartoon brought to the game is a fully fleshed-out universe. This shines through in the game's consistent artistic design. The fluorescent in-game graphics are immaculately detailed and feature a crisp, clean look. Doorways are cocked to one side, textures are flatly shaded to mimic a cartoon, and the character models are simplistic yet rounded. With just three chapters spanning two GD-ROMs composed mostly of cinemas, the number of environments is limited. But it's obvious Xilam built this game room by room, making sure that each was both interesting and purposeful. The in-game graphics are impressive enough that the transition to the prerendered movies is almost seamless. The FMV moves the plot forward nicely but is rarely equal pay for equal work. Some of the cinemas tend to drag on, but from a technical standpoint, Stupid Invaders features some clever CGI. If it weren't for the flaccid writing, playing through the game would be worth the effort.The few chuckles that Stupid Invaders does generate are courtesy of the game's excellent voice acting.One of the highlights of the game, the voices used in Stupid Invaders closely resemble characters from other forms of entertainment, namely Fred Flintstone and Tommy Chong with a head cold. The inspired voice acting gives life to the otherwise forgettable characters, and it almost manages to transcend the horrid script. The music is mixed extremely low in Stupid Invaders. Considering there are only a couple of different songs that play throughout the game, this is a definite blessing. Despite its impressive graphics and excellent voice acting, the simplistic and monotonous nature of Stupid Invaders' gameplay manages to drag down an otherwise entertaining experience. For those who fell off the point-and-click adventure train after Myst, Stupid Invaders doesn't offer anything new to rekindle your interest. Fans of puzzle games with an appreciation for dark humor will likely enjoy Stupid Invaders, but a three-day rental should be more than enough time to extract all the fun."}