{"ref": "https://www.gamespot.com/reviews/avatar-the-last-airbender-review/1900-6162770/", "date": "December 5, 2006", "game_name": "Avatar: The Last Airbender", "text": "Games based on cartoons that are popular with kids, teens, and adults have often struggled under the weight of trying to appeal to each audience simultaneously. After all, it's not easy to make a game that a parent will enjoy as much as their child. Such is the case with Avatar: The Last Airbender, an action role-playing game based on the popular Nickelodeon show of the same name. The game has some interesting, yet underused, RPG elements, and the fighting system initially appears as if it has some depth, but the overall game is so simple and easy you'll never need to do much more than mash on the attack button to see the story through to its conclusion. If you enjoy killing wolves, we've got good news for you. Avatar takes place in a world that's in the midst of a global war. There are four nations, divided up by the ability of some of their citizens to ~bend~ (use as a weapon or magic) fire, water, earth, or air. The Fire Nation is trying to eliminate the Water, Earth, and Air Nations in an effort to establish itself as the planet's dominant force. The three nations' only hope for survival lies in the hands of Aang, a 12-year-old Airbender, who also happens to be the Avatar--the one person who can bend all four elements. Not only will Aang have to fend off the Fire Nation, but there are thousands of machines that threaten the land, as well. But Aang won't have to go at it alone. Katara, Aokka, Haru, and Aang's faithful sidekick Momo will all team up to save the day. The story is pretty simple, and for the most part it's entertaining. All of the characters are voiced by the same actors from the cartoon and much of the series' humor comes across here, though it sometimes feels forced. Avatar mixes light RPG elements with a healthy dose of fighting. The action is viewed from an isometric perspective, which works well for showing off your surroundings while still remaining close enough to be conducive to fighting. The controls are quite simple--you really only need to know where the attack button is. You can block, but you'll rarely need to. You begin the game with only Aang (and Momo), but you'll eventually enlist the services of Katara, Sokka, and Haru. Each character has its own advanced/bending move that can be performed by pressing a shoulder button and a face button. On the Wii, these moves are done by pressing the B button and moving the controller up, down, left, or right. This works poorly because it's awkward and the game often fails to recognize moves or performs the wrong move. You can upgrade your basic attack and special moves by earning experience points. The game upgrades these abilities for you by default, but you can control this feature manually if you so desire. It's nice to have four fighters at your disposal, but outside of the few occasions where you're forced to go at it alone with a particular character, there's never any need to fight with anyone other than Aang. The three party members that you're not controlling are controlled (poorly) by the CPU. They offer very little assistance during battle and seem content to just perform special attacks over and over. However, you will need to use each person to perform ~focus moves.~ Anytime you come across a ravine you can't cross or find a pile of boulders blocking your path, the game prompts you to perform one of these focus moves. Figuring out which character needs to do the move is revealed by trial and error, though sometimes the scenario relates to someone's innate abilities. On the PlayStation 2, Xbox, and GameCube, focus moves are performed after you successfully complete a quick timing-based minigame. The Wii does things a bit differently. You're briefly shown a symbol and then you must paint that symbol from memory using the Wii Remote as a paintbrush. Some sequences have just one symbol, while others have as many as three. You're judged on your accuracy, but it doesn't really seem to matter how accurate you are; so long as you're close, you pass. It's fun to paint symbols the first couple of dozen times, but by the end of the game it's just mind numbing. There are four people in your party, but you rarely need to use anyone other than Aang. You'll spend most of your time killing the same sorts of enemies over and over again. Wolves, platypus bears, bandits, firebenders, and various machines are most of the obstacles between you and saving the world. They generally roam in packs and attack by lunging at you, but some of them shoot fire or water, as well. Since both your health and chi (special attack power) regenerate when you're not being attacked, even the most difficult enemies can be dispatched by attacking, running away, and then attacking again. Eventually, you'll find that you don't even need to fight most of the standard enemies--you can simply run right past them. You'll want to fight some of them so you can get new gear and earn some money, but money and items are so readily available that once you get some decent equipment, you won't need to fight much. Boss battles are incredibly easy and require only patience to win. Each boss follows the same pattern of attacking and then leaving you an opening after their attack is done. All you have to do is keep your distance, run around, and wait for the painfully obvious opening to appear. There's a save point before each boss, so you never have to worry about dying. In fact, there are tons of save points everywhere, which makes it odd that there's no autosave or save-anywhere feature. The game is broken down into several different stages, and you'll have to complete many tasks before moving to the next area. Aang's primary quest is to save the world, but this doesn't mean he gets to just run off and fight the Fire Nation--he'll help many other people along the way. If you just stick to the main story, you can probably get through the game in about six hours. Should you try to help everyone out and find all of the hidden items, the game could easily last upward of 10 hours. Helping people is where the game gets boring. You're constantly beseeched to find toys, help fishermen, track down a lost person, or gather up random materials so someone can make something. You can skip the side quests, but because some of the main quest goals are tasks as mundane as finding lip balm, you're going to be doing plenty of menial tasks either way. When you're given a quest, its direction is shown on the small overhead map/radar in the corner of the screen. There's a larger map that can be viewed in the pause menu, but it just shows a large view of the area--there's no indication of your destination. You can also check your quests by looking in your journal. Where the whole process gets annoying is when you make the mistake of talking to someone that wants you to do something else while you're already on a quest. This resets the quest marker to the new quest, and while you can still complete the old task, you'll have to do it without the help of a marker. This makes for lots of roaming around, hoping you find your objective. If you really feel the need to wander around even more, there are hidden treasure chests scattered about, as well as items in each level that only Momo can find. One way to break up the monotony is to play Four Nations, which is a simple yet enjoyable tile game. Your goal is to either play all of your tiles or play a tile that your opponent can't play. If you win, you earn new items. Four Nations isn't something you're going to boot up the game just to play, but it's a pleasant diversion. Avatar's visuals are simple, yet appealing. The characters are all cel-shaded and look just as they do in the cartoon. Animation for both the main characters and the enemies is rather repetitive, which is disappointing given the fact that the game is based on an animated series. Rather than being hand drawn, the cutscenes are all rendered. This fits in with the overall look of the game but may be disappointing for anyone hoping for the game to play and look more like an episode of the show. The game's environments aren't terribly complex, but that doesn't mean they look bad. Each area is brightly colored and has a cartoonish look to it. There are plenty of effects like rain and snow, too. As mentioned earlier, the main characters are voiced by the actors from the show, and other than being hampered by a less-than-stellar script, the performances are fine. NPC characters don't fare as well. You'll hear the same canned phrases throughout the game, and to make matters worse, you'll hear them regardless of what's happening onscreen. Other than a cool theme that plays when you're controlling Momo, the music is forgettable. All of your favorite characters from the show are in the game. If you're trying to decide which version of the game to get, it looks and plays identical on the PS2, Xbox, and GameCube. The Wii version is the most expensive, it doesn't look any better than the others, it has the most unfriendly control scheme, and the motion-sensing elements add nothing to the game. The Wii version is also the only one where you can't lock on to enemies. The controls are unresponsive on the Wii, too. You'll frequently need to press a button several times before it registers, and it's basically a crapshoot as to whether or not a special move will work. Even the game's menus are made a chore to navigate because of the controls. And to add insult to injury, the Wii version has been known to freeze up on occasion. Avatar: The Last Airbender isn't so much a bad game as it is one that's disappointing because it fails to capitalize on its many interesting concepts. Even though it's geared toward kids, the game is so watered down that even they won't find it challenging. The RPG elements are underdeveloped and the fighting quickly becomes tedious due to its simplicity. The failure to include co-op multiplayer support of any kind doesn't help either. Just being able to play with one friend, much less three, would have made the whole experience more fun. Toss in some unfriendly design choices and lots of backtracking, and you're left with a game that's just not that much fun to play."}