{"ref": "https://www.gamespot.com/reviews/avatar-the-last-airbender-review/1900-6164294/", "date": "January 17, 2007", "game_name": "Avatar: The Last Airbender", "text": "Avatar: The Last Airbender for the Nintendo DS is an action adventure game featuring the characters and locations from Nickelodeon's popular cartoon show. In the game, players lead a party of four heroes through multiple portions of the Avatar world and use the characters' unique abilities to fight the seemingly endless horde of soldiers, machines, and beasts at the Fire Nation's disposal. While there are a few role-playing aspects tacked on here and there, this is, by and large, a straightforward brawler where you mainly have to mash the attack buttons and survive from one encounter to the next. Fans of the show may appreciate that the story and characters ring true to the cartoon, but it's tough to savor the story when the meat of the game consists of literally hundreds of tiresome battle situations. The thrill of the 3D graphics wears off after the umpteenth battle is spent mashing buttons. In the world of Avatar, people known as benders have the ability to cast elemental magic. The world is split into four different nations, each based on the element the nation's inhabitants have mastery over: fire, water, earth, or air. For centuries, the four nations lived in peace. However, one day the Fire Nation began a campaign to conquer the other nations. According to legend, the only person that can stop the Fire Nation is the Avatar, the legendary bender that has the ability to control all four elements. The game, like the show, follows the travails of Aang, the last airbender and supposed Avatar, on his quest to awaken his powers and bring an end to the war. When the game opens, Aang enlists a pair of waterbenders to help him on his quest, and, not long after that, an earthbender joins up to make the trio a quartet. Together, the party of four heroes sets out to visit the different villages in the land to gradually push back the Fire Nation forces and get Aang the training he needs. As you'd expect, each of the game's seven chapters involves visiting a different village, talking to people, going on fetch quests, and, eventually, confronting the boss that has been causing so much trouble in the neighborhood. When you encounter any Fire Nation soldiers, the viewpoint shifts to a real-time battle perspective where Aang's party has to stomp as many as a half-dozen Fire Nation troops. Each character has his or her own unique set of attacks and magical abilities. All four characters are involved in each battle, but you only control the active character, while the CPU controls the other three. It's easy enough to take control of any of the other characters, however, simply by tapping the appropriate icon on the touch screen. After every fight, experience points are doled out that increase the heroes' stats and periodically earn them new bending attacks. Other role-playing staples, such as healing herbs and stat-boosting potions, let you manage health and stats on a limited basis. Despite the inclusion of a few token role-playing aspects, Avatar: The Last Airbender is really a brawler. You don't have much control over character development, except when you come across the occasional stat-boost potion, and fetch quests and people-finding missions don't require much time at all. Ninety-nine percent of the time you spend playing the game will be devoted to fighting the cookie-cutter soldiers that you'll run into every 30 seconds or so. While that doesn't sound terribly enjoyable by itself, the game's fighting aspects are weak and sloppy to boot. Each character only has a single hand-to-hand attack and three different bending moves, so you're constantly seeing the same attacks performed over and over again. By the same token, the same four standard enemies are recycled throughout the game, and they each only have a single attack move. As it is, combat is straightforward to a fault. You don't have to worry about elemental strengths during normal battles, so there's no reason to switch characters once you find a favorite, and there isn't much strategy required during a fight, except to dodge or block each enemy's initial attack and then mash your preferred attack button until all enemies are knocked out. The cruel irony is that enemies are ridiculously strong, to the point that you have to burn through health items and grind a ton of levels on lower-level enemies before the ones you need to kill are no longer able to knock one of your characters out in three or four hits. To make matters worse, the CPU does a poor job of keeping the three non-player heroes out of harm's way. Suffice it to say, it's hard to stay motivated toward finishing the story when the game forces you to participate in the same simplistic, repetitive battle situations hundreds of times per chapter. For all of the grinding that players are forced to endure, the entire game barely requires six hours to finish. Fetch quests are easy to fulfill, since the map always shows you exactly where to go, and boss battles are a piece of cake once you invest a continue or two in figuring out your opponent's attack pattern. Once you complete the game, there aren't any bonus quests or goodies to further immerse yourself in. Six hours isn't a whole lot of game, and the replay value is almost nonexistent here. Thanks to overpowered enemies and pathetic CPU helpers, combat just isn't any fun. It's a shame that the game isn't more fun, because it is presented well. Comic book-style speech bubbles provide bits and pieces of the story throughout each chapter, while the lengthier exchanges that occur between chapters implement recorded dialogue featuring the actual voices of the show's actors. Visually, the game juxtaposes 2D character sprites with 3D backdrops. The characters are fluidly animated and look just like their TV personas. The 3D backdrops, meanwhile, are razor sharp and take the system's 3D capabilities to the limit. All of the superfluous environmental and weather-related visual effects are truly a sight to behold, and there's quite a bit of detail evident in the trees, houses, and other structures in the scenery. They didn't devote nearly as much horsepower to the music or sound effects, but the generic battle noises do fit the action at least, and the music has a Far East feel that wins you over by being calming, as opposed to raucous. Slick production values can only go so far. Avatar: The Last Airbender for the Nintendo DS may do a great job of capturing the look and feel of the cartoon, but as video games go, it's just another mediocre brawler loosely patterned after a popular TV show."}