{"ref": "https://www.gamespot.com/reviews/planet-puzzle-league-review/1900-6172287/", "date": "June 8, 2007", "game_name": "Planet Puzzle League", "text": "Planet Puzzle League is the latest block to drop in an old series of simple puzzle games known as Puzzle League (or Panel de Pon). The idea in these games has always been to shift like-colored blocks into rows or columns of three, prompting them to politely vanish. It should sound familiar, and not just because the series has been around for 15 years. Everyone, at some point in their gaming career, has matched colored blocks and made them disappear. So what separates Planet Puzzle League's colorful cubes from the other blocks, jewels, and pills you've sorted in your life? Two things in particular: The DS stylus, which makes sorting blocks easier than ever before, and global Internet play, so you can challenge the square-pushers of the world. These two new features make Planet Puzzle League a nice place to revisit, though its staying power is questionable. Back evil rectangles! You shall not have my squares this day. In case you aren't familiar with the series, colored squares rise from the bottom of your screen. You can drag them horizontally, but not vertically, to match up with like-colored squares. Like Tetris, if a block touches the top of the screen, you lose. Also like Tetris, the game moves faster as you score points. So while the blocks rise slowly at first, they eventually speed up. The intellectual meat of this game is setting up the blocks in a way that creates a chain reaction: Your first matchup leads to a purple block falling between two other purples (for example), which in turn leads to another score, and so on and so forth. Planning these sequences, or at least recognizing them, is what has always made Puzzle League fun and engaging. However, this leads to an odd flaw in the gameplay. To set up a sweet chain reaction, the screen must be mostly full of blocks. Yet, if the screen is nearly full, you're nearly dead. In the early going you have time to work sweet magic, but as the game accelerates, you're reduced to simply flinging blocks around, praying for random chain reactions. This creates a perverse sense of guilt every time you do something cool, because like a bee setting up a perfect sting, you're hastening your own demise. This is probably why Puzzle Planet never became as popular as other giants in the puzzle genre--you're constantly working against yourself. However, there are more modes than just the normal game, and these are far more rewarding. The best is puzzle mode, which confronts you with an assortment of blocks that must all be neutralized within one or two moves. These are well paced, usually with four or five easy puzzles to keep you winning, and then one mind-bender to get you thinking. Another cool mode is active puzzles mode, though it requires some explaining. When matched blocks disappear, you have a split-second to shove a nearby block into the space, hopefully leading to another series of matched blocks. So, every active puzzle begins with a series of blocks disappearing, and you have to quickly move the one or two blocks that will keep the combo rolling, until all the blocks are gone. These puzzles are where the game earns its money. Then there's daily mode. This mode contains three challenges you can attempt only once per day. So you'd think these would not be challenges you could easily attempt outside of daily mode anytime you wanted. After all, what would be the point of that? But alas, they are, making this feature utterly pointless. This leads to a greater problem with Planet Puzzle League: its total lack of continuity and purpose. Sure, there are tons of puzzles to solve, but there's nothing to motivate you aside from your own lack of anything better to do. Once you put this game down, it's easy to forget about, because there are no rewards or anything else to look forward to. Also, the various elements, while good in and of themselves, do not connect in any meaningful way. At least the head-to-head content is nice and atavistic. If you break open a nice, big combo, you'll dump giant blocks on your opponent's pile. And if you work certain item blocks into your combos, you might reshuffle your opponents' pieces, freeze up one of their rows, or simplify the colors on your own board. Not only can you wirelessly challenge your friends, you can also take on complete strangers from around the world. What's more, with the DS headset (not included), you can even chat with your opponents. Now, if you want to discuss the psychological effects of orange blocks versus blue with a like-minded puzzle nerd, you finally can. You can also let interested DS owners download a free demo of the game. As you can see, the DS engine handles both squares and circles with ease. Planet Puzzle League has solid graphics, though colored squares haven't exactly been cutting-edge since oh, 1980. And the backgrounds are murky, fuzzy, and dull, and are much better when you don't even notice they're there. The music is upbeat electronic stuff that's typical for your average puzzle game. Even though the game itself is far from puzzle-perfect, Planet Puzzle League is a fun title with enough worthy challenges to warrant playing. Its weird, paradoxical combo scheme keeps it from approaching the greatness of games like Lumines, Tetris, or Super Puzzle Fighter, but if you're looking for a new way to flex your brain and test your reflexes, this piece is a solid fit. Another cool mode is active puzzles mode, though it requires some explaining. When matched blocks disappear, you have a split-second to shove a nearby block into the space, hopefully leading to another series of matched blocks. So, every active puzzle begins with a series of blocks disappearing, and you have to quickly move the one or two blocks that will keep the combo rolling, until all the blocks are gone. These puzzles are where the game earns its money. Then there's daily mode. This mode contains three challenges you can attempt only once per day. So you'd think these would not be challenges you could easily attempt outside of daily mode anytime you wanted. After all, what would be the point of that? But alas, they are, and the point of it is less than obvious. This leads to a greater problem with Planet Puzzle League, its total lack of continuity and purpose. Sure, there are tons of puzzles to solve, but there's nothing to motivate you aside from your own lack of anything better to do. Once you put this game down, it's easy to forget about, because there are no rewards or anything else to look forward to. Also, the various elements, while good in and of themselves, do not connect in any meaningful way. As you can see, the DS engine handles both squares and circles with ease. At least the head-to-head content is nice and atavistic. If you break open a nice, big combo, you'll dump giant blocks on your opponent's pile. And if you work certain item blocks into your combos, you might reshuffle your opponents' pieces, freeze up one of their rows, or simplify the colors on your own board. Not only can you wirelessly challenge your friends, you can also take on complete strangers from around the world. What's more, with the DS headset (not included), you can even chat with your opponents. Now, if you want to discuss the psychological effects of orange blocks versus blue with a like-minded puzzle nerd, you finally can. You can also let interested DS owners download a free demo of the game. Planet Puzzle League has solid graphics, though colored squares haven't exactly been cutting-edge since oh, 1980. And the backgrounds are murky, fuzzy, and dull, and are much better when you don't even notice they're there. The music is upbeat electronic stuff that will definitely annoy anyone nearby. Even though the game itself is far from puzzle-perfect, Planet Puzzle League is a fun title with enough worthy challenges to warrant playing. Its weird, paradoxical combo scheme keeps it from approaching the greatness of games like Lumines, Tetris, or Super Puzzle Fighter, but if you're looking for a new way to flex your brain and test your reflexes, this piece is a solid fit. Another cool mode is active puzzles mode, though it requires some explaining. When matched blocks disappear, you have a split-second to shove a nearby block into the space, hopefully leading to another series of matched blocks. So, every active puzzle begins with a series of blocks disappearing, and you have to quickly move the one or two blocks that will keep the combo rolling, until all the blocks are gone. These puzzles are where the game earns its money. Then there's daily mode. This mode contains three challenges you can attempt only once per day. So you'd think these would not be challenges you could easily attempt outside of daily mode anytime you wanted. After all, what would be the point of that? But alas, they are, and the point of it is less than obvious. This leads to a greater problem with Planet Puzzle League, its total lack of continuity and purpose. Sure, there are tons of puzzles to solve, but there's nothing to motivate you aside from your own lack of anything better to do. Once you put this game down, it's easy to forget about, because there are no rewards or anything else to look forward to. Also, the various elements, while good in and of themselves, do not connect in any meaningful way. As you can see, the DS engine handles both squares and circles with ease. At least the head-to-head content is nice and atavistic. If you break open a nice, big combo, you'll dump giant blocks on your opponent's pile. And if you work certain item blocks into your combos, you might reshuffle your opponents' pieces, freeze up one of their rows, or simplify the colors on your own board. Not only can you wirelessly challenge your friends, you can also take on complete strangers from around the world. What's more, with the DS headset (not included), you can even chat with your opponents. Now, if you want to discuss the psychological effects of orange blocks versus blue with a like-minded puzzle nerd, you finally can. You can also let interested DS owners download a free demo of the game. Planet Puzzle League has solid graphics, though colored squares haven't exactly been cutting-edge since oh, 1980. And the backgrounds are murky, fuzzy, and dull, and are much better when you don't even notice they're there. The music is upbeat electronic stuff that will definitely annoy anyone nearby. Even though the game itself is far from puzzle-perfect, Planet Puzzle League is a fun title with enough worthy challenges to warrant playing. Its weird, paradoxical combo scheme keeps it from approaching the greatness of games like Lumines, Tetris, or Super Puzzle Fighter, but if you're looking for a new way to flex your brain and test your reflexes, this piece is a solid fit."}