{"ref": "https://www.gamespot.com/reviews/ncaa-final-four-2001-review/1900-2659267/", "date": "May 17, 2006", "game_name": "NCAA Final Four 2001", "text": "Complain, if you must, that the NBA is sucking the college basketball talent pool dry, but every year the high profile college programs retool and replenish their teams, replacing the young millionaires that find themselves in the NBA draft. By that same token, every year around this time, the developers of college hoops games retool and rework last year's versions in hopes of creating the most realistic virtual hoops experience. One such game is NCAA Final Four 2001 from 989 Sports, which has improved itself enough from last year's version to be able to compete on relatively even ground with Electronic Arts' impressive March Madness series. However, despite the improvements, the game exhibits several crucial flaws that keep it from claiming the crown as the top college hoops simulation. The most glaring of these faults is the general lack of options in the game. The usual suspects such as the exhibition, season, tournament, and arcade modes of play are in Final Four 2001, but the game is missing the all-important dynasty mode. You'd think the series has matured enough to include such things as the dynasty mode to help enhance its lasting appeal, but unfortunately, creating the next Bruins dynasty or stringing together consecutive final four appearances like the Blue Devils is impossible in 989 Sports' college hoops game. Thankfully, the game features all of the Division I-A conferences and over 300 schools, and it keeps track of extensive player and team statistics - everything from points per game to field goals made is tracked for every player on every team. Additionally, the season mode in Final Four 2001 has the coaches' and writers' polls, which show the latest top-25 rankings, and it maintains a bubble watch, which lists teams that are on the cusp of making the 64-team NCAA tournament field. NCAA Final Four 2001 fares better on the court than it does with its lineup of gameplay options. The game controls at blistering speeds while maintaining its fast frame rates. Played in its default speed setting, it is one of the fastest basketball games for the PlayStation. Quick guards, particularly with the aid of the game's turbo button, fly up and down the court in furious run-and-gun-style games - even the normally sluggish centers exhibit Michael Johnson-like speeds. This gives the game more of an arcade-style feel, which is OK, since real-life college hoops games are generally played at a quicker pace than the more methodical NBA games. Thankfully, the game's controls are intuitive enough to keep up with the frantic pace. There are two major exceptions, though. The first is that it's difficult to effectively face up on defense. On the defensive end of the court, pressing the proper controller button automatically faces up the offensive player, as it should. Once in this position, however, you lose control of your man. The defensive player automatically shadows his offensive assignment, and control of the player cannot be regained until the face-up button is released. The second exception is the rebounding game. Ignoring the fact that NCAA Final Four 2001 requires the jump timing and player location to be absolutely perfect to secure a board, where the rebounding game really suffers is in the inability to box out. Because of a less than perfect collision detection system, players can fly over and through opposing players to grab rebounds and execute put-back dunks. Visually, NCAA Final Four 2001 is only moderately improved over last year's version. The game features new dunk, shot, and dribble animations, and the player movements are more fluid overall. However, the player models are still blocky, and apart from the variations in height and weight, the individual players have very few distinguishing characteristics - the textures aren't very detailed on their faces and jerseys. The arenas are slightly better, with team-specific logos and colors on the court, but they fail to capture the look and feel of the actual college arenas. ESPN hoops analyst Quinn Buckner once again handles the announcing in NCAA Final Four 2001. Buckner's signature slam-dunk and steal calls are amusing, and his general play-by-play commentary is usually in tune with the on-court action. However, the game suffers significantly in other audio departments. Much of the appeal of the college game is in its rowdy atmosphere - college hoops isn't the same without raucous fans like Duke's Cameron Crazies and Florida's Rowdy Reptiles. This is exactly what is lacking in NCAA Final Four 2001, as the ambient noise from the arena crowds and school bands is disappointingly understated. The game attempts to capture some of this with the sixth man option, which lets players generate crowd noise on demand to distract the other team, but this too is ineffective in re-creating the constant furor of a college hoops game. Big things are expected from each new incarnation in established college hoops franchises such as the NCAA Final Four series. Although NCCA Final Four 2001 features relatively entertaining arcade-style hoops action, the game's subpar graphics, lack of options, annoying control flaws, and lack of on-court atmosphere keep it from meeting those expectations. Although casual fans may enjoy the fast-paced play, those looking for a complete college hoops experience will be disappointed with the lack of gameplay polish and the curios lack of features in NCAA Final Four 2001."}