{"ref": "https://www.gamespot.com/reviews/motogp3-review/1900-6023558/", "date": "March 20, 2003", "game_name": "MotoGP 3", "text": "With the coming of the 2003 motorcycle racing season, Namco is releasing MotoGP3, the third installment in its motorcycle racing series. Namco's series is heralded as the official game of MotoGP, and it's licensed by Dorna, the organization responsible for the annual tournament. On a superficial level, the third MotoGP game seems like a formulaic expansion on its immediate predecessor--it features 15 tracks instead of 10, 41 motorcycles instead of 38, and a bit more polish in the graphics, but otherwise it's very similar to the last game in the series. Look deeper, however, and you'll find that considerable work has been done in refining the controls, addressing the requests of fans of the series, and adding some gameplay elements to help the game better compete with THQ's MotoGP-licensed Xbox title. That being said, the game more or less features the same selection of game modes as its predecessors. The season mode allows you to take on a racing contract with teams such as Repsol Honda, Telefonica Movistar Suzuki, and Yamaha Tech 3, among others, and then compete in a series of races against other teams. The arcade mode allows you to compete in a one-off race on any track with any bike without commitment or consequence. Time trial is exactly what it sounds like--a chance for you to take on any track alone with any bike to hone your skills and improve your lines. The game provides ample help with this, in the form of ghostly representations of your best runs and a turn-by-turn analysis of each run. The time trial mode will also provide you with a password that you can enter on the game's Web site to see how your time stacks up. However, only the top 100 times are ranked, so the competition is very fierce. The legends mode allows you to compete in a challenging race against the tournament's best, from any time period, and the challenge mode provides you with a smattering of unique time trials and races. Multiplayer is offered as well, allowing up to four players to compete in a head-to-head race or a grand prix race against a number of computer-controlled opponents. As mentioned above, the game's greatest achievement is its grasp of the control of a motorcycle. On the default settings, fans of the series should feel immediately comfortable. However, a plethora of options are available to give you greater control of your motorcycle of choice. Analog control of your throttle and brakes, control of the rider's weight placement, and separate control of your front and rear brakes are all available. You can also set up the transmission to shift for you automatically or opt to change gears on your own. While it might initially seem that these options are included for the hard-core sim fan, in practice they must be mastered if you hope to remain competitive in the game's more difficult modes. In particular, the analog control for the throttle and brakes becomes key to finessing the roll-on of the throttle in a corner to achieve a perfect line and braking without locking up the wheels of the bike. While the PlayStation 2's Dual Shock 2 controller can prove to be a frustrating tool to accurately provide analog input with, the game features onscreen meters that denote the amount of pressure you're providing, which is very useful in analyzing your technique. Shifting the weight of your rider also has a drastic influence on cornering. You'll want your weight shifted forward upon entering a turn to ensure that the front wheel has the most traction so you can maximize your steering capabilities. When you accelerate out of a turn, your weight should be shifted back to give more traction to the rear wheel. Additionally, weight shifting can assist in rapid braking and acceleration, providing more traction to the wheels that need it most. The roles of the front brake and the rear brake differ significantly. The front brake will provide most of your stopping ability, while the rear can be used lightly to stabilize the bike under heavy cornering. While all these new features can be turned off to give the game more of an arcadelike feel, the automatic handling of these controls does not match the level of control you get with doing it manually, and you'll find it difficult to remain competitive in the harder difficulty levels if you leave the bulk of the control to the AI. The game also features a simulation mode that can be toggled in any mode in the game. This mode creates an even deeper motorcycle simulation, forcing you to finish all your braking before entering a corner and be smooth with the application of throttle when exiting. Too much of either will provide a severe loss of traction, and ultimately, a crash. Arguably, the crown jewel of the gameplay modes is the season mode, in which you enter a series of races against the sport's top riders, such as Valentino Rossi, Max Biaggi, and Loris Capriossi. You choose one of the 12 available teams at the beginning of a season, and you can set a number of different parameters before the start of each race, including the number of laps and the type of weather you'll encounter. However, the difficulty level selected in the season mode has the greatest impact on the experience. The higher difficulty levels not only ramp up the computer-controlled AI, but they also remove the braking and traction assists featured in the easy mode. The normal and hard settings also provide a richer experience, allowing you to take test runs on the track before each race; change the settings on your bike, such as gearing, tires, and handling response; and qualify for grid placement in actual the race. Additionally, on the hard setting, only a few race teams are initially available for play. Shifting your rider's weight not only adds a whole new layer to the control, but it also allows for some exhilarating stunts like this. While season mode might have the most features, the mode offering the most longevity will likely prove to be the challenge mode. The game features 100 unique challenges, including things like drag races, time trials, slalom courses, and one-on-one races with the sport's top riders. Each challenge has three tiers of difficulty, requiring you to complete each course with either shorter track times or a stricter set of rules, such as not leaving the track or colliding with other riders. Some challenges will involve the other game modes, such as finishing first on a specific track in the legends mode or achieving a particular time in the time trial mode. The rewards for each challenge range from videos and full-screen photos of riders and their motorcycles to new gear for your rider. Additionally, a whole collection of motorcycles and racers can be unlocked, including a few of Namco's own characters, such as Jack Slate from the action title Dead to Rights. In terms of motorcycles, MotoGP3 features 41 bikes (12 of which are immediately available) from manufacturers such as Honda, Suzuki, Yamaha, Aprillia and Kawasaki. Each bike differs slightly in terms of handling, acceleration, top speed, and braking, but these differences aren't immediately noticeable. Depending on your riding style, however, these differences will be reflected in your track times, so some trial and error will come into play when selecting a bike. Graphically, the game excels. Though the cycles and riders are slightly blocky, they have all the details they should, right down to the foot pegs, brake rotors, and calipers. What's more, they are both textured and animated extremely well. The motorcycle and riding-suit markings of brands such as Alpinestars, Red Bull, Spidi, and Axo are immediately recognizable, and the animations of the riders hanging off their bikes, setting up for corners, and taking quick looks behind them really bring the riders to life. The tracks are quite detailed, and although the trackside grass textures can get repetitive, there are plenty of buildings, grandstands, crowds, and signs to bring the environments to life. MotoGP3 adds a new cockpit view, allowing you to see through the eyes of your rider. While these views look great--each bike has its own view that is detailed down to the fairing, brake fluid reservoir, and instrument cluster--they take up a pretty large section of the screen and can make navigation of the track more difficult. The replays are also amazing, throwing in heat shimmer, television-style camera motion, and focus effects. The frame rate never skips a beat in its single-player modes, though the multiplayer grand prix modes can get pretty choppy. While the sound in the game is not superb, it delivers in every way that it should--each bike has its own unique exhaust signature, and screaming through a turn with several other riders surrounding you can be quite exhilarating. Wind noise can be heard when the rider sits up to set up for a corner, and the telltale ~chunk~ of a gear shift is present as well. The game's soundtrack is a generic mix of rock and techno that's neither memorable nor distracting. The new cockpit views look phenomenal, though they aren't that practical. Ultimately, as a motorcycle racing game, MotoGP3 stands head and shoulders above other titles in this niche genre on the PlayStation 2 console, and it's quite competitive with THQ's similarly named game for the Xbox. The experience is challenging and very deep, and for fans of the genre, it can hold your interest for a very long time. The learning curve can sometimes be very steep, and oftentimes there's very little incentive for improving your performance, so the game may not hold the interest of the casual gamer for very long. But racing fans looking for a new and unique challenge that can be as rewarding as it is deep should give MotoGP3 a try, and players looking for the definitive motorcycling experience for the PlayStation 2 shouldn't bother looking any further. Arguably, the crown jewel of the gameplay modes is the season mode, in which you enter a series of races against the sport's top riders, such as Valentino Rossi, Max Biaggi, and Loris Capriossi. You choose one of the 12 available teams at the beginning of a season, and you can set a number of different parameters before the start of each race, including the number of laps and the type of weather you'll encounter. However, the difficulty level selected in the season mode has the greatest impact on the experience. The higher difficulty levels not only ramp up the computer-controlled AI, but they also remove the braking and traction assists featured in the easy mode. The normal and hard settings also provide a richer experience, allowing you to take test runs on the track before each race; change the settings on your bike, such as gearing, tires, and handling response; and qualify for grid placement in actual the race. Additionally, on the hard setting, only a few race teams are initially available for play. While season mode might have the most features, the mode offering the most longevity will likely prove to be the challenge mode. The game features 100 unique challenges, including things like drag races, time trials, slalom courses, and one-on-one races with the sport's top riders. Each challenge has three tiers of difficulty, requiring you to complete each course with either shorter track times or a stricter set of rules, such as not leaving the track or colliding with other riders. Some challenges will involve the other game modes, such as finishing first on a specific track in the legends mode or achieving a particular time in the time trial mode. The rewards for each challenge range from videos and full-screen photos of riders and their motorcycles to new gear for your rider. Additionally, a whole collection of motorcycles and racers can be unlocked, including a few of Namco's own characters, such as Jack Slate from the action title Dead to Rights. In terms of motorcycles, MotoGP3 features 41 bikes (12 of which are immediately available) from manufacturers such as Honda, Suzuki, Yamaha, Aprillia and Kawasaki. Each bike differs slightly in terms of handling, acceleration, top speed, and braking, but these differences aren't immediately noticeable. Depending on your riding style, however, these differences will be reflected in your track times, so some trial and error will come into play when selecting a bike. Graphically, the game excels. Though the cycles and riders are slightly blocky, they have all the details they should, right down to the foot pegs, brake rotors, and calipers. What's more, they are both textured and animated extremely well. The motorcycle and riding-suit markings of brands such as Alpinestars, Red Bull, Spidi, and Axo are immediately recognizable, and the animations of the riders hanging off their bikes, setting up for corners, and taking quick looks behind them really bring the riders to life. The tracks are quite detailed, and although the trackside grass textures can get repetitive, there are plenty of buildings, grandstands, crowds, and signs to bring the environments to life. MotoGP3 adds a new cockpit view, allowing you to see through the eyes of your rider. While these views look great--each bike has its own view that is detailed down to the fairing, brake fluid reservoir, and instrument cluster--they take up a pretty large section of the screen and can make navigation of the track more difficult. The replays are also amazing, throwing in heat shimmer, television-style camera motion, and focus effects. The frame rate never skips a beat in its single-player modes, though the multiplayer grand prix modes can get pretty choppy. While the sound in the game is not superb, it delivers in every way that it should--each bike has its own unique exhaust signature, and screaming through a turn with several other riders surrounding you can be quite exhilarating. Wind noise can be heard when the rider sits up to set up for a corner, and the telltale ~chunk~ of a gear shift is present as well. The game's soundtrack is a generic mix of rock and techno that's neither memorable nor distracting. Ultimately, as a motorcycle racing game, MotoGP3 stands head and shoulders above other titles in this niche genre on the PlayStation 2 console, and it's quite competitive with THQ's similarly named game for the Xbox. The experience is challenging and very deep, and for fans of the genre, it can hold your interest for a very long time. The learning curve can sometimes be very steep, and oftentimes there's very little incentive for improving your performance, so the game may not hold the interest of the casual gamer for very long. But racing fans looking for a new and unique challenge that can be as rewarding as it is deep should give MotoGP3 a try, and players looking for the definitive motorcycling experience for the PlayStation 2 shouldn't bother looking any further."}