{"ref": "https://www.gamespot.com/reviews/tom-clancys-endwar-review/1900-6200634/", "date": "November 5, 2008", "game_name": "Tom Clancy's EndWar", "text": "Many games put you in the role of a commander; few do it with the kind of immediacy that Tom Clancy's EndWar delivers. In this innovative real-time strategy game, you don a headset and issue commands to your units by speaking your wishes to your squads. Sound like a gimmick? Perhaps--but when combined with an explosive cinematic presentation that tosses you into the thick of the action, it imparts a unique feeling of hi-tech sovereignty that's anything but a gimmick. Were this mechanic not implemented, EndWar's core simplicity would be more obvious. Its three near-future factions all play the same way, the rock-paper-scissors relationships between units are incredibly straightforward, and the single-player campaign doesn't tell any story to speak of, which is a blatant missed opportunity. Nevertheless, a novel multiplayer mode and persistent units that carry from one mission to the next keep things interesting, and on the whole, EndWar is a fun RTS that will hopefully start a refreshing new trend: console strategy games that feel tailor-made for their platforms. Using the headset to issue commands is a breeze. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tom Clancy's EndWar Video Review 1 Your headset has an enormous impact on the experience. To order your units about, you issue a series of preset commands by holding a trigger and speaking your directive into the microphone. This runs the gamut from attacking enemy squads (~Unit two, attack hostile four~) and bringing in reinforcements when they are available (~Deploy gunships~) to centering your view on a particular group (~Unit three, camera~) and ordering special attacks (~Air strike, hostile six~). There are limited possibilities, so don't expect to plan out multiple waypoints or set up tank patrols. Nor can you rely completely on the microphone--at least, not if you intend to be competitive. Actions like garrisoning infantry into a building or ordering your units to unleash special attacks require some button presses, so there is a bit of light micromanagement in this regard. Additionally, if you don't have a microphone or just don't want to use one, you can use just the controller, though given the uniqueness of the voice commands, that isn't ideal. Using the headset is cool, and it works well: While there were some exceptions (the game misinterpreting ~alpha~ for ~delta,~ for example), EndWar easily recognized the huge majority of our voice commands. This included a standard Xbox Live headset, as well as USB and Bluetooth headsets on the PlayStation 3. The units themselves are products of EndWar's World War III setting. In the game's version of near-future events, The United States, Russia, and a unified Europe have each become superpowers, and the US plans the launch of a military space station to tip the worldwide balance of power in its favor. Unfortunately, terrorists destroy the station upon lift-off, thereby igniting global conflict. Yet as interesting and far-fetched as the setting is, it's mostly backdrop. The campaign is just a series of battles versus the AI that emulates EndWar's main multiplayer mode, so don't expect much exposition, larger-than-life personalities, or political intricacies. You can play as any of the three factions, but while your own commander (and his or her blatant accent) will change, there's no story to involve you, aside from mission updates and news blurbs. Thus, there's no reason to play the campaign with another faction if you've finished it once already. This lack of narrative is a big disappointment, given Tom Clancy's pedigree of political potboilers. Nevertheless, EndWar has a way of drawing you in, not just because of the unique control mechanism, but because it lets you closely follow your squads into battle. Regardless of your faction, the basic units are the same: Infantry comprises riflemen and engineers; tanks and artillery have the armored advantage; gunships take to the skies; and transports not only whisk your infantry about the battlefield, but offer necessary antiair support. Most of the time, you'll be switching your view from squad to squad, and the camera's close-up vantage point has quite an impact when you're engaged in combat. Bullets fly, gunships fall from the sky, and artillery fire rains from above, and some visual glitches aside, it's all quite exciting and cinematic in a way that most other strategy games just can't accomplish. If you prefer a more traditional overhead view, you can enter ~sitrep~ view, assuming that your command vehicle hasn't been blown to smithereens. Here, you can get a quick overview of the battlefield, which is useful but not particularly dramatic. The rapid zoom of the camera when you move in and out of this mode and from one unit to the next, however, is incredibly slick. Sitrep view gives you some perspective. While having so few unit types and no striking difference between factions may be authentic--and relatively simple to balance--given the setting, it doesn't make any side worth playing more than another. The relationship between units is always the same: tanks beat transports, gunships beat tanks, and so on, so there's little subtlety. Instead, strategy is delivered on a broader level, starting with the mission objectives. There are four main mission types: assault, conquest, siege, and raid. Assault is the simplest (kill your enemy), while in Raid, you must either destroy or defend certain buildings on the map to achieve victory. Conquest, however, is the most interesting mode, taking its cues from the Battlefield titles in addition to EndWar's closest RTS cousin, World in Conflict. Here, you must use infantry to capture control points called uplinks scattered across the map while fending off the enemy and sabotaging their attempts to do the same. Siege battles are much less common than the others, and involve an assaulting player attempting to capture a critical uplink while the defending player struggles to maintain control of it. Tactics are generally obvious in all of these situations, but they can still generate a tense tug of war between players as each jockeys for position. Uplinks are present in all modes, and they are a critical part of the gameplay. Most importantly, they help you earn command points, which you need to call in reinforcements and perform other actions. However, uplinks can only be taken by infantry, so even if you aren't playing a conquest map, you'll still want some riflemen or engineers in the field. Uplinks also hold a second key to victory: upgrades that allow you to engage support powers like air strikes and electronic attacks. These powers are invaluable in a sticky situation but also cost command points, so you'll need to weigh the advantage of bringing in another transport to defeat your gunship-heavy opponent against a quick strike that could do immediate damage. There are even short-range nukes to deploy in certain circumstances that can immediately turn the tide of battle, and produce a properly spectacular explosion. All of these battles are given context within a larger turn-based map called the Theater of War. The offline theater is good for practice, but it's the online theater that provides the meat of the experience. This semiglobal map is persistent, so as opposing players engage one another, the results of an entire day's matches represent a single turn within the theater. Once the day's turn is complete, new battles open up as each faction spreads its dominion. This is a great idea that may remind you of a similar mode in the mech action game Chromehounds. But while the sameness of each faction makes it hard to feel particularly loyal, it's involving to watch your faction's color spread across the map, whether that means establishing your presence in Florida or burning Paris to the ground. Varied mission types help make up for some missing complexity. So your battle prowess has global consequences, but success brings more than a victory for your faction. You'll also earn a supply of credits after each battle that you can then spend on upgrades for your units. Surviving units gain levels, which gives them access to purchased enhancements, which could mean faster movement speed, new support powers (being able to designate a new drop point for reinforcements is ever so helpful), or additional attacks that can be triggered with a button when you are following the unit that can perform them. Like the Theater of War, this feature seems like its supposed to make you feel more emotionally attached to your faction's success, and it works to an extent, giving you an incentive that works on a more personal level. While new attacks open up some minor micromanagement options, they don't bring drastic changes, because most battles are still won or lost with quick uplink securing and basic understanding of rock-beats-scissors dynamics. But while EndWar's tactics were designed on a broader scale, its presentation throws you into the midst of battle. When firefights get heavy, the screen fills with units and explosions, and nothing beats watching the destruction on the ground from the vantage point of a gunship squad firing at tanks or engineers from above. Even the smaller touches make an impact, such as the authentic-looking behavior of engineer squads as they enter a building or a transport. Upon closer inspection, you can see that explosions don't look all that grand, and you'll find plenty of clipping issues and other minor quibbles. Yet on the whole, EndWar offers a terrific visual impression, thanks to fantastic unit animations and a smooth frame rate. If you're intent on purchasing the best-looking version, better color saturation gives the PlayStation 3 the slight upper hand, though both versions look and perform great. The standard view lets you get up close and personal with your units. The sound design does an even better job of immersing you in battle. This is partially due to the din of combat, which is loud and violent, perfectly appropriate for World War III. However, it's the constant radio chatter and responses of your units that have the greatest impact, making you feel as though you really are in the role of a military commander. It isn't just for show, either: EndWar's constant feedback is an important tactical tool, letting you make split-second decisions that could mean life or death for your squad. Unfortunately, there are too many times when crucial feedback (~Check unit nine~) comes far too late for it to do any good. EndWar's unique voice command mechanic makes it wholly unique among strategy games, and it's this innovation that stands out above all of its other features. Strip it away, and you'll find a RTS game that can be fun and satisfying, but is ultimately just a bit too simplistic. But even if strategy veterans won't find all the complexities they'd expect, there's something to be said for EndWar's smart match types and cinematic presentation, which will hopefully keep the game's servers populated for some time to come. All of these battles are given context within a larger turn-based map called the Theater of War. The offline theater is good for practice, but it's the online theater that provides the meat of the experience. This semiglobal map is persistent, so as opposing players engage one another, the results of an entire day's matches represent a single turn within the theater. Once the day's turn is complete, new battles open up as each faction spreads its dominion. This is a great idea that may remind you of a similar mode in the mech action game Chromehounds. But while the sameness of each faction makes it hard to feel particularly loyal, it's involving to watch your faction's color spread across the map, whether that means establishing your presence in Florida or burning Paris to the ground. Varied mission types help make up for some missing complexity. So your battle prowess has global consequences, but success brings more than a victory for your faction. You'll also earn a supply of credits after each battle that you can then spend on upgrades for your units. Surviving units gain levels, which gives them access to purchased enhancements, which could mean faster movement speed, new support powers (being able to designate a new drop point for reinforcements is ever so helpful), or additional attacks that can be triggered with a button when you are following the unit that can perform them. Like the Theater of War, this feature seems like its supposed to make you feel more emotionally attached to your faction's success, and it works to an extent, giving you an incentive that works on a more personal level. While new attacks open up some minor micromanagement options, they don't bring drastic changes, because most battles are still won or lost with quick uplink securing and basic understanding of rock-beats-scissors dynamics. But while EndWar's tactics were designed on a broader scale, its presentation throws you into the midst of battle. When firefights get heavy, the screen fills with units and explosions, and nothing beats watching the destruction on the ground from the vantage point of a gunship squad firing at tanks or engineers from above. Even the smaller touches make an impact, such as the authentic-looking behavior of engineer squads as they enter a building or a transport. Upon closer inspection, you can see that explosions don't look all that grand, and you'll find plenty of clipping issues and other minor quibbles. Yet on the whole, EndWar offers a terrific visual impression, thanks to fantastic unit animations and a smooth frame rate. If you're intent on purchasing the best-looking version, better color saturation gives the PlayStation 3 the slight upper hand, though both versions look and perform great. The standard view lets you get up close and personal with your units. The sound design does an even better job of immersing you in battle. This is partially due to the din of combat, which is loud and violent, perfectly appropriate for World War III. However, it's the constant radio chatter and responses of your units that have the greatest impact, making you feel as though you really are in the role of a military commander. It isn't just for show, either: EndWar's constant feedback is an important tactical tool, letting you make split-second decisions that could mean life or death for your squad. Unfortunately, there are too many times when crucial feedback (~Check unit nine~) comes far too late for it to do any good. EndWar's unique voice command mechanic makes it wholly unique among strategy games, and it's this innovation that stands out above all of its other features. Strip it away, and you'll find a RTS game that can be fun and satisfying, but is ultimately just a bit too simplistic. But even if strategy veterans won't find all the complexities they'd expect, there's something to be said for EndWar's smart match types and cinematic presentation, which will hopefully keep the game's servers populated for some time to come."}