{"ref": "https://www.gamespot.com/reviews/prince-of-persia-the-sands-of-time-review/1900-6085669/", "date": "December 15, 2003", "game_name": "Prince of Persia: The Sands of Time", "text": "Though it's been brought back in 3D form on the console systems this year, Prince of Persia's roots are in classic, 2D side-scrolling gameplay. Rather than simply try to make a scaled down version of the console game or port one of the older 2D games to the Game Boy Advance, Ubisoft's portable take on The Sands of Time combines features from both of these concepts and puts them together into one good, though somewhat short package. This makes The Sands of Time a platformer with equal parts swashbuckling and puzzling that should keep fans of cerebral action games entertained throughout. As the nimble, acrobatic prince, you'll have to use all your prowess to defeat the evil vizier. If you've played The Sands of Time on one of the major systems, you already know the story in the GBA game. If you haven't, here's a recap: You're a Persian prince (duh) in the ancient Middle East who's discovered an enchanted weapon, the Dagger of Time. By using this dagger, you unwittingly unleash the Sands of Time on the Sultan's kingdom, thus letting loose a bunch of monsters and generally reducing everything to a shambles. You'll play as both the prince and a capable princess named Farah as you navigate the many trap-filled rooms of the Sultan's palace and attempt to thwart the machinations of the evil vizier who ultimately controls the Sands of Time. This new version of Prince of Persia on the Game Boy Advance may remind old-time gamers of the original Prince of Persia released way, way back in the late '80s. This new one, too, takes place from a side-scrolling perspective and has you swinging from platform to platform, climbing up poles, avoiding devious traps, and generally traversing dangerous areas of the palace. You'll also do a fair amount of sword-slashing against monsters, humanoid opponents under the influence of the Sands of Time, and the occasional boss character. With the enchanted dagger, you'll be able to effectively reverse time (for a few seconds) if you leap to your doom or get beaten by an enemy. Unlike the console versions, where the time reversal ability is only useful as a means of saving yourself, the GBA version will sometimes have you use it creatively to solve puzzles or combat bosses, which is a nice twist. All in all, the gameplay is done well and gives you a good variety of things to do, though the game is fairly short, clocking in under the 10 hour mark. If you played The Sands of Time on one of the major consoles, you played strictly as the prince and received intermittent aid from Farah. However, the GBA version lets you switch between the prince and Farah (after you meet her) at will to solve puzzles that require two separate characters to work together. You can easily change to the other character by using the select button, which makes this dual-character system both accessible and pretty cool. Farah isn't as well-rounded a fighter as the prince; she attacks with a bow and arrow rather than with a powerful sword, and she can't rewind time. It's still nice to see some new stuff here that wasn't even in the console versions of the game. Overall, the progression of The Sands of Time on the GBA is pretty straightforward. You progress through increasingly complex levels of a sprawling castle, whose map is a little reminiscent of recent Metroid and Castlevania games, and you'll gain new moves and abilities as you solve puzzles, avoid traps, and uncover new areas. In terms of story and abilities, The Sands of Time on the GBA is surprisingly similar to its big-console brethren. Prince of Persia looks pretty good for a GBA game. You won't see a whole ton of variety in the backgrounds, as the rooms of each area look almost identical to one another. However, they're consistently serviceable throughout. The sprites have a simple, sparsely detailed look that makes them appear a little like cels from a cartoon, and many of them (especially the prince) use a rather high number of animation frames so that they move with exceptional fluidity. The game is a little bland on the audio side, and though the music is appropriately themed for the game's setting, it's not entirely memorable. The sound effects get the job done, but they don't really leave a lasting impression. If you've played through other side-scrolling adventure games on the GBA and you're hungering for more, Prince of Persia: The Sands of Time ought to fit the bill nicely. Between the character-switching with Farah and the unique ability to rewind time, there's enough new stuff here to keep you at least mildly entertained even if you've beaten all of the GBA Castlevanias and their ilk. Though it isn't as impressive as the other versions of the game, The Sands of Time is an enjoyable experience and is recommendable to anyone with an interest in side-scrolling action adventures."}