{"ref": "https://www.gamespot.com/reviews/crash-boom-bang-review/1900-6160076/", "date": "October 18, 2006", "game_name": "Crash Boom Bang!", "text": "When it comes to Mario Party knockoffs, the most important question is whether or not the minigames are any good. A company can stockpile its game with minigames galore, slap on a familiar mascot, and come up with a unique board game concept to organize everything around it, but no one is going to want to play the thing if the minigame challenges are dull. That's the main problem with Crash Boom Bang!. Although it lets you wander around a game board and participate in various multiplayer challenges as your favorite Crash Bandicoot characters, the game ultimately crashes and burns because the majority of its minigames are lifeless and uninteresting. You can challenge the CPU or your friends in 40 different minigames. Crash Boom Bang! sticks close to the classic Mario Party formula. You can compete against CPU opponents or link multiple DS systems and copies of the game together to compete against your friends in 40 different minigame challenges. Minigames can be played individually or as part of a larger board game-style competition. While the overall goal for each of the six different game boards varies, you generally want to roll the dice so that you land on squares that increase your point total. Some squares add and subtract points; some squares give you items that can slow down your opponents or move you to another spot on the board; and some squares initiate random minigames. Minigames can involve as many as four participants, where the winner receives a hefty number of prize points and the runners-up receive lesser amounts. When you're not personally involved in a minigame, you can wager prize points on the outcome and increase your total that way. You can even pester other players by covering their screens with pop-up chat messages. The flow of the board game is highly dependent on how dice rolls and item pickups turn out, but it's usually a fair and tolerable method of doling out the various minigame challenges. Unfortunately, the minigames themselves tend to be crummy. They're all easy to grasp, and the stylus-oriented controls make them just as easy to participate in, but only a few of them are genuinely fun. Many minigames take simplicity to the dullest extreme, such as those that involve tracing lines, tapping a moving target, or keeping a feather suspended midair. Others are just uninspired rehashes of the same four card monte, memory, and maze tasks that we've seen countless times before. At most, there are four or five noteworthy standouts that beg to be played over and over again. One in particular is the free throw challenge, where you shoot basketballs into a moving hoop by dragging the stylus across the screen. Another good example is the canoe challenge, where you have to paddle a canoe and try to grab floating fruit by alternating strokes with the stylus. These examples work because they're less simple and manage to present familiar concepts in ways that are interesting. Sadly, standouts like these are the exception rather than the rule. The minigames stink, and the Crash license is largely cosmetic. The whole product has a slapped-together feel and only incorporates the Crash Bandicoot license in a cursory fashion. Some minigames employ fluid 3D graphics and have a healthy variety of sound effects. Others employ simple 3D or 2D visuals and hardly have any audio at all. The different game boards feature generic scenery, music, and sound effects that also range in quality from rudimentary to decent. Although some backdrops are vaguely reminiscent of environments from earlier Crash Bandicoot games, there's nothing about the scenery or audio that's uniquely identifiable as actually having been taken from an earlier Crash game. The characters, at least, do look like they were ripped straight out of a Crash Bandicoot adventure, and they're also highly detailed and smoothly animated. Their trademark abilities, however, didn't make it into the game. So, while Crash, Coco, Neo-Cortex, and the rest of the gang each have their own individual walks and gestures, they're all functionally the same. Apart from the way the characters look and the way the nitro boxes explode, which can leech away your points during minigames, there isn't a whole lot that's Crash-like about Crash Boom Bang!. Even if the developers had done a better job of incorporating the Crash Bandicoot license, it wouldn't have helped in the long run. It's the quality of the minigames that ultimately makes or breaks a Mario Party wannabe, and the minigames in Crash Boom Bang! are generally lame."}