{"ref": "https://www.gamespot.com/reviews/star-wars-lethal-alliance-review/1900-6162942/", "date": "December 8, 2006", "game_name": "Star Wars: Lethal Alliance", "text": "Star Wars games have run the gamut from terrible to superb, so it's always a crapshoot when a new one is released. Lethal Alliance is a thankfully enjoyable addition to the family. Its core shooting gameplay is strengthened by a mix of Prince of Persia-esque acrobatics and some truly excellent on-rails levels. That variety makes it easier to overlook generic level designs and other by-the-book shooter traditions. It's harder to get past the frustrating targeting system, though, and its specter hovers over almost every firefight. Even so, it's an accessible shooter that Star Wars fans will enjoy for its characters and action fans will appreciate for its diversity. Togetherness. Lethal Alliance takes place between Episodes III and IV and features a number of cameos from well-known Star Wars characters. Central player Twi'Lek Rianna Saren is original to the game, and she's no Jedi. Rather, she's more of a Han Solo than a Luke Skywalker, helping out the Rebellion as a mercenary. The story isn't much to speak of, so don't expect to discover any surprising revelations or shocking insights into the Star Wars universe. Lethal Alliance is character driven, exploring an odd partnership between Rianna and Zeeo, her droid companion. Their collaboration is the cornerstone of the gameplay, and it's interesting enough to carry the uninspired narrative. Without the partnership, Lethal Alliance would have been just another adequate third-person shooter. But with Zeeo hovering alongside, you get to pull off some nice collaborative moves. Some are as simple as using him as a boomerang to bash stormtroopers, while others let you grab him to perform a slow-motion cartwheel or use his energy shield to deflect lasers back toward your enemies. Other cooperative elements are context sensitive, like using Zeeo to slice into data ports or crawl into wall ducts. These actions and others give Lethal Alliance a Prince of Persia/Tomb Raider air. Rianna doesn't jump--she tumbles, somersaults, and leaps from one anchor point to another. During melee combat and with other skills, you'll automatically enter bullet time, which is a decent cinematic touch. The moves are easy and satisfying to pull off, although they aren't without the occasional frustration. Many of these platforming elements are made overly difficult by the analog stick's oversensitivity. You need to position yourself just right in close quarters before vaulting onto walls or platforms, and in many levels, you're a single step from plummeting to your doom. The analog stick isn't conducive to subtle movement, so most of your ~mission failed~ screens are the result of control struggles. The shooting portions are standard fare, and Rianna equips blasters, a sniper rifle, and other ranged weapons. Switching among them is just a matter of pressing the D pad buttons, and in a nice touch, you'll automatically equip your slashing weapon whenever you are close to an enemy. Since Rianna isn't a Jedi, you'll never get to play with a lightsaber, but the Thorn of Ryloth used in melee is a fine substitute. It's too bad that the ranged action is hobbled by Lethal Alliance's primary drawback: its targeting system. Whenever you fire a weapon, you automatically lock on to an enemy, and you use the shoulder buttons to cycle through other enemies onscreen. One problem is that when there are a lot of enemies onscreen, it's a pain to fire at the one you need, particularly during boss encounters. The more crippling issue is that you occasionally need to target noncombat objectives during the action, like the data ports that Zeeo must hack into. In many of these instances, the targeting simply doesn't function correctly. To get around it, you can remove the lock from your current target and enter a free-roam mode, but you have to position Rianna in just the right place and face the right direction. Otherwise, the targeting icon won't appear on the entry point and you can't order Zeeo to slice into it. And if there is an enemy in your field of view, your targeting reticle will latch onto it, rather than focus on the object you wanted. That's just another reason why Lethal Alliance's most successful features are those outside of the shooting proper. Along with the acrobatic and platform elements, you'll take control of turrets and grab on to Zeeo as he zips through some dangerous environments. These on-rails sections are easily the most exciting sequences in the game. They've got a real feeling of speed, and the levels are rendered with a great amount of detail considering how quickly you soar through them. Not only must you steer Zeeo through obstacles, but you also must roll Rianna from one side to the other or jump on top of Zeeo rather than hang from him. It's good fun and shakes up the pace nicely, because the scenes feel legitimately dangerous. This isn't to say that there's an overall sense of urgency to most of the levels. Lethal Alliance isn't much of a challenge, and the level designs, while solid, aren't interesting enough to draw your attention away from how easy the action is. Levels are set up in a traditional pattern of shoot all the enemies, unlock the door, collect some ammo, and shoot more enemies. The enemy artificial intelligence is surprisingly good, and your foes will hide behind cover and keep moving to avoid fire. But they go down easily and don't inflict much damage, especially if you use Zeeo to your advantage. While there is some variety to the environments, most of them boil down to linear corridor crawls that function more as fan service than anything else. However, there are some nice surprises here and there, such as when you grab hold of Zeeo to zoom up the wall or across the ceiling. They just aren't consistent enough to overcome the sense of overfamiliarity. You shouldn't buy Lethal Alliance for its limited two-player mode. It's only available in ad hoc play, and on paper it sounds like a pretty good idea. You run around the level shooting your enemy, like it were a deathmatch, while grabbing credits and cashing them in for upgrades. But as in the single-player game, the shooter elements are too derivative to carry the game alone, and the variety and fluidity of the campaign didn't find its way into the multiplayer. The targeting system is just as annoying, and the stiff controls simply aren't meant for the confined passages of the multiplayer maps. Slo-mo double cartwheels: the next great Olympic sport. Lethal Alliance does its license proud from a visual and audio standpoint. The more interesting levels look crisp, without any noticeable drops in frame rate. Some of the textures are flat, such as those in the more expansive areas, but much of the scenery is filled with exploding barrels, moving droids, and other technical handiwork. Rianna is animated well, though she moves stiffly in the rail levels. The usual Star Wars sound effects are all present and accounted for, including the soundtrack everyone has come to know and love. The main issue with the sound is a conspicuous bug that occasionally causes dialogue to overlap, with one character speaking before the other one has finished his or her lines. The voice acting is pretty good, but it's hard to notice when characters keep interrupting each other. The lousy multiplayer notwithstanding, Star Wars: Lethal Alliance is a good portable shooter with plenty of variety and a respectable single-player campaign. With better tweaking of the shooting mechanics and platforming controls, it could have played great, but even with those deficiencies, action-game fans and Star Wars enthusiasts are bound to find something to like about Lethal Alliance."}