{"ref": "https://www.gamespot.com/reviews/star-wars-lethal-alliance-review/1900-6163514/", "date": "December 20, 2006", "game_name": "Star Wars: Lethal Alliance", "text": "Star Wars games have run the gamut from terrible to superb, so it's always a crapshoot when a new one is released. Lethal Alliance on the Nintendo DS is a solid addition to the family. It's not a difficult game, nor does it share the same acrobatic feel of its PlayStation Portable counterpart. However, it makes up for the loss of the PSP version's cinematic flair with some special features of its own. Yet it also shares some of the same problems, like the unresponsive targeting system and generic level design. But even with some obvious flaws, Lethal Alliance is an enjoyable game with enough variety to please Star Wars fans looking for a shooter on the go. The puzzles aren't hard, but they're varied and mix up the action. Lethal Alliance takes place between Episodes III and IV and features a number of cameos from well-known Star Wars characters. The main character, the twi'Lek Rianna Saren is original to the game, and she's no Jedi. Rather, she's more of a Han Solo than a Luke Skywalker, helping out the Rebellion as a mercenary. The story isn't much to speak of, so don't expect to discover any surprising revelations or shocking insights into the Star Wars universe. Lethal Alliance is character driven, exploring an odd partnership between Rianna and Zeeo, her droid companion. Their collaboration is the cornerstone of the gameplay, and it's interesting enough to carry the uninspired narrative. Without the partnership, Lethal Alliance would have been just another adequate third-person shooter. But with Zeeo hovering alongside, you get to pull off some nice collaborative moves. Many of them take place within the action proper. You can grab hold of Zeeo and he'll zoom you toward an enemy for a dual kill, or jump onto him to perform a shockwave attack. The abilities aren't as satisfying as they were on the PSP, since they lack the other version's cinematic elements, like bullet time zooms and close-up kills. Still, they are varied enough to stay consistently interesting during the six-hour campaign. Other moves are outside of the gunfights. Zeeo will pull Rianna up certain walls or across ceilings, and he can maneuver into tighter areas like air ducts. These solo Zeeo moments are among the game's best, because in them you use the touch screen for free-look and the D pad for movement. That control scheme feels more at home on the DS than Rianna's controls, which use only the face buttons. The game also throws in a decent variety of puzzles. None of them are challenging, but at least they utilize the platform's unique capabilities better than the majority of the action. Whenever Zeeo slices into a computer system, you're normally faced with some sort of puzzle that goes along with it. In one, you rotate and flip a cube until the pattern on one of its sides matches that on the block beneath it. In another, you connect rays from the bottom and sides of the screen to hold a security drone in place. The puzzles are all timed, but finishing before the timer expires is rarely a matter of life or death. The shooting portions are pretty standard, and Rianna equips blasters, a sniper rifle, and other ranged weapons. Switching among them is just a matter of choosing the one you want on the touch screen, and in a nice touch, you'll automatically equip your slashing weapon whenever you are close to an enemy. Since Rianna isn't a Jedi, you'll never get to play with a lightsaber, but the Thorn of Ryloth used in melee is a fine substitute. It's too bad that the ranged action is hobbled by Lethal Alliance's primary drawback: its targeting system. Whenever you fire a weapon, you automatically lock on to an enemy, and you use the shoulder buttons to cycle through other enemies onscreen. But the targeting is aggressive, making occasionally unwise decisions on your behalf. Sometimes, it simply doesn't function properly and you can't cycle to the enemy that you want. Other times, you can't lock on because your foe is apparently too far away, even when he's obviously within firing range. It's not as frustrating on the DS as it is on the PSP, but the concession appears to be in the difficulty of the action as opposed to a refinement of the mechanics. Enemies go down easily, so tapping the B button and performing the occasional cooperative attack will get you through every encounter without much of a challenge. Lethal Alliance's levels are familiar and linear, but they're more interesting here than on the PSP because Ubisoft wisely understood that the shooting wasn't Lethal Alliance's strong suit. Any given section will have you climbing up and down walls, avoiding beams, balancing on precarious walkways, and sending Zeeo off to do his thing. It feels disjointed in the earlier levels, but once the majority of the mechanics are introduced, the game's pace tightens and the variety of gameplay ingredients start to mesh. Much like 2002's Jedi Outcast didn't take off until the lightsaber was introduced, Lethal Alliance gets into its groove about halfway through. There's a certain slickness to the game when it's running on high gear and you move from fighting to tumbling to puzzle-solving to zooming across the ceiling. The environments are visually varied even within the standard warehouse and spaceport levels, and it helps keep the monotony to a minimum. The game includes a few rudimentary multiplayer modes for up to four players. They're certainly better than the lame deathmatch variant on the PSP, but none of them are all that fun and don't add much to the experience. In all three you control Zeeo, which is appealing thanks to the stylus-controlled free-look. However, none of them are all that interesting. Survival is simple deathmatch; Power Converter involves solving puzzles to repair a destroyed panel; and Virus Outbreak is like a handheld version of Hot Potato, where you rid yourself of a virus and infect others in order to survive. It's all throwaway stuff, as is the unlockable mode, which offers stand-alone re-creations of the on-rails segments from the single-player campaign. The modes function just fine and offer some quick entertainment, but they don't do much to extend the game's shelf life. In motion, the visual splendor of Rianna's sexy lekku becomes evident. Lethal Alliance looks great on the DS. The engine is silky-smooth and renders a surprising number of details. You might look out the window to see ships zipping past, or look across a large open area to see a network of walkways and machinery. The only issue is a certain amount of graininess, which makes it hard to see exactly what you're shooting at. Crisper visuals would have at very least added to the player's immersion, but the game generally takes good advantage of the DS's capabilities. The sound too is solid, with the quality soundtrack and sound effects you would expect from a Star Wars game. There is no real voice acting in the game--just the yelps from stormtroopers and an occasional grunt from Rianna. But all in all, the game's presentation is a fine representation of the license it's based on. Star Wars: Lethal Alliance is a good shooter that could have been even better had its core elements been tightened up and the platform's unique abilities taken better advantage of. But even with its obvious flaws, it's a multifaceted and enjoyable game that's worth a look for anyone in the market for a portable shooter."}