{"ref": "https://www.gamespot.com/reviews/tmnt-mutant-melee-review/1900-6120972/", "date": "March 23, 2005", "game_name": "TMNT: Mutant Melee", "text": "Based on the current Saturday-morning cartoon series, the Teenage Mutant Ninja Turtles game franchise has gone from merely average to downright lousy in the span of 18 months. Teenage Mutant Ninja Turtles: Mutant Melee is the latest of the crop, coming just six months after the last game's release. Alarming as that timeline is, Mutant Melee is so low-quality that it's hard to believe it took a full six months of development time to put it together. This is an incredibly slapdash and barren game that has absolutely nothing to offer you beyond monotonous, almost-broken fighting mechanics, tiny environments, and a bunch of lame unlockables. If you were holding out hope that Konami would finally right the Turtles franchise, Mutant Melee may be the last sign you'll need to finally abandon any and all faith. With games like Mutant Melee, it's hard to really care much about the Turtles game franchise anymore. Unlike the last two TMNT games, Mutant Melee aims to be more of a multiplayer-focused arena fighting game, sort of in the vein of Power Stone or Super Smash Bros. Melee. Instead, it ends up closer to something like Stake: Fortune Fighters, in terms of quality. The main problem is that the fighting mechanics feel like they're built entirely off the action from the TMNT beat-'em-up games. Konami's Hawaii studio has gone to the trouble of adding a couple of three-button combos for each character, but the action is still repetitive. Hit, hit, knockdown; hit, hit, knockdown; and so on. The game attempts to break up the monotony of the fighting controls by throwing in a special move you can perform, but that doesn't help. Couple the bad mechanics with some thoroughly bad character balancing--some characters, like Michelangelo, are incredibly easy to abuse, whereas others, like Donatello, are near worthless--and what you have is some downright unpleasant gameplay. The other way the game tries to break things up is by adding some weapons, power-ups, and occasional obstacles to each fighting arena. Basically, you can run around breaking open crates, and you'll find weapons like big swords, axes, and machine guns to nail your opponents with. It's a nice idea, but it's horribly executed. The special weapons just aren't worth using; despite the fact that they do a little more damage than the average hit, they're impossible to use effectively. The timing of the hits for special melee weapons is beyond insane, and the guns are too hard to aim properly. The power-ups are a little better. You can get attack strength as well as defense and speed bonuses, and each work as advertised, but they don't end up helping matters much. The arena obstacles, which differ from level to level, are easily the dumbest aspect of fights. If you're fighting in a back alley, sometimes cars will drive through the middle of the arena, hitting people as they go. If you're fighting on a rooftop, sometimes bombs will randomly drop, and you'll have to jump to another rooftop before the whole building collapses. Once again, these aren't bad ideas, but they come across as lazy ways to try to dress up the otherwise lousy fighting and the completely cramped arenas. Every arena in the game feels cardboard-box-size in scale, with no room to move around or maneuver, and they all look pretty weak to boot. There's also just not a whole lot to do in Mutant Melee. There are two modes of play: a really basic multiplayer mode with variants on king of the hill and survival battles, and the god-awful adventure mode. Imagine if you had to make a Turtles storyline for 10 different characters, but had no time, no writers, and no ability to make cutscenes--whatever would you do? Well, for starters, you would start out with a text intro, set up each stage with a quick thing like, ~You've got to get into the lab! Beat down the foot soldiers!~ and then repeat throughout each stage of the mode until you got to the end, where you would see another lame text screen. Sounds wonderful, doesn't it? Each stage pretty much consists of beating up all the enemies onscreen, and in the rare instance that it does try to deviate from that blueprint--as is the case in certain stages where you'll have to, say, operate a mechanical arm to pick up larger enemies and dump them in molten metal, all while trying to avoid said enemies--the game becomes almost unplayable. Your reward for braving the adventure mode is a bunch of character art, assorted other fan-service extras, and more playable characters that you'll probably never even want to play with. It may be $20, but that's hardly a reason to buy this junk. In terms of graphics and sound, you're basically looking at the same quality of the last Turtles game, though with no animated cutscenes or much in the way of voice acting. The in-game graphics are the same cel-shaded graphics found in Battle Nexus, though with slightly more polished character models offset by some glitchy animations. The Xbox and GameCube iterations of the game look nearly identical, so you won't find any graphical differences between them. The audio consists largely of the same generic soundtrack as in the last two games and repetitive, annoying voice samples that repeat like crazy. In summary, this game neither sounds nor looks very good. Mutant Melee simply amounts to an extremely poor effort. It seems to exist solely for the purpose of taking advantage of the fans of the TMNT cartoon. Regardless of your opinion of the show, or past games in the series, be sure to steer clear of Mutant Melee."}