{"ref": "https://www.gamespot.com/reviews/the-da-vinci-code-review/1900-6151651/", "date": "May 22, 2006", "game_name": "The Da Vinci Code", "text": "It may sound like a terrible idea, but Dan Brown's ubiquitous novel The Da Vinci Code has been successfully translated and adapted to a video game. And, believe it or not, the results are not all that bad. In fact, The Da Vinci Code game offers a challenging and varied gameplay experience that will satisfy the amateur cryptographer in everyone. However, the game is brought down by subpar production values and a dialogue-heavy story that has a tendency to drag at times. Tom Hanks doesn't make an appearance, but this lifelike mannequin is here to fill in for him. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: The Da Vinci Code Video Review The Da Vinci Code is essentially a murder mystery that gets blown way out of proportion with complex conspiracy theories and ridiculously elaborate clues and leaps of logic that lead to a shocking discovery that could rewrite history and bring the Catholic church to its knees. It sounds interesting enough, but in the game the story ends up being about as unexciting as it could possibly be. This is mostly because the two main characters--symbologist and suspected murderer Robert Langdon and cryptographer Sophie Neveu--are so unbelievably dull. The two characters are completely expressionless in manner and in tone, and both are entirely devoid of personality or humanity. They might as well be robots programmed to crack numeric codes, unscramble anagrams, and spout off lengthy monologues about the detailed history of every single thing they see. However, despite the lack of character, the story does follow the book and film fairly closely, so if you're a fan of those, you might enjoy taking a more active role in the story by playing the game. Some new content has been added to pad out the game, and while it doesn't bring anything new or interesting to the familiar story, it fits fairly well with the rest of the narrative. This game has you investigating crime scenes and deciphering puzzles. The game does a good job of keeping the gameplay interesting by mixing it up often. All of your skills will be challenged, from puzzle-solving to stealth and even combat. You'll even get to play as both of the characters from the book and movie, although they might as well be exactly the same because they play that way. Most of the game is devoted to puzzle-solving. There's plenty of variety to the puzzles, which keeps them interesting and challenging. You'll have to solve riddles, unscramble anagrams, decipher symbolic codes, and much more. It seems that the man who was murdered was something of a lunatic, so he left tons of elaborate clues that only a symbologist and a cryptographer could possibly solve. Even then, it's a major stretch to believe that all of these puzzles and clues could possibly come together as they do in the game. Regardless, the puzzles are still the best part of The Da Vinci Code. As you move around in each of the various stages, you'll encounter objects that you can interact with. More often than not, these areas provide some clues that keep the story moving along. You'll have to use a black light to read hidden symbols on the Mona Lisa, collect parts of a ballista to shoot a deranged monk, mix chemicals to clean a painting and reveal a message, and so on. Some of the puzzles are quite difficult, and you'll probably find yourself getting stumped more than a couple of times throughout the game. That said, it's usually clear what you have to do or where you have to go next. When you aren't looking at cryptic messages and collecting artifacts, you'll have to keep an eye out for your own safety. Robert Langdon is wanted for murder, so the police are after him. However, he's also attempting to uncover an ancient conspiracy involving the Catholic church, so lots of fanatic monks are after him as well. The only thing to do in such a situation is to pummel your troubles away with some fancy fist work. When an enemy approaches, you can hit a button to swing at him, and if you hit him, you'll clinch up as the two of you struggle to overpower each other. If you have the upper hand in the clinch, you can hit a button to attack, throw, or shove your enemy. Depending on which move you choose to perform, you'll see button icons at the bottom of the screen that you have to mimic. For example, if you choose to attack, you'll see a sequence of buttons, and you have to press those buttons in the correct order to attack. If you miss a button or take too long, your attack fails, and you're put at a disadvantage in the fight. When on defense, your enemy will take swings at you, and buttons will appear onscreen. You have to hit the right buttons as they appear to dodge each attack. It's all quite simple, but it's more fun than the average button-mashing style of combat. The problem is that these extended fights tend to make the combat sequences drag on a bit too long. It also seems out of place to be kidney-punching security guards and clubbing monks with crow bars as a couple of mild-mannered code crackers. The biggest fault of The Da Vinci Code is the overall presentation. The voice actors sound completely flat and disinterested in the dialogue, the character animations are all jerky and unnatural looking, and there are even a few frustrating bugs that make the game feel unfinished. As you move through the environment, you'll often get snagged on inanimate objects, and at one point we got stuck on a railing and had to restart the level because we couldn't move. Conversely, sometimes you'll simply clip right through objects in the environment. If you like riddles and anagrams, you'll find some good ones in this game. The Da Vinci Code will take you about 10 hours to finish, depending on how well you handle all of the puzzles. There are secret items in each level that you can collect to unlock things like artwork and bonus missions. It's a respectably lengthy game, but the problem is that once you solve all the puzzles, there's really no challenge to be had in playing the game again, which makes the price a bit hard to swallow. If that doesn't deter you, then you'll be glad to know that the Xbox and PlayStation 2 versions of the game are just about identical, so the version for you is entirely a matter of preference. The PC version is slightly better than the console versions just because the load times between levels are shorter and because some of the puzzles are easier to manipulate with the mouse and keyboard control scheme. If you're a fan of adventure games, you'll find something to like about The Da Vinci Code. If you've read the book and seen the movie and still can't get enough of the story, you'll have fun jumping in and solving the mystery for yourself. Just don't expect the production values to be on par with those of the blockbuster film."}