{"ref": "https://www.gamespot.com/reviews/pga-european-tour-review/1900-2595450/", "date": "May 17, 2006", "game_name": "PGA European Tour", "text": "Some elements of popular European culture just don't pique the interest of Americans. As evidence, consider soccer mania or David Hasselhoff as a rock star. This discrepancy probably applies to PGA golf as well. Most Americans would be hard pressed to know the latest news regarding the PGA European Tour. And, without marquee last names such as Woods or Duval, most would probably care less. So when a company hopes to sell a Nintendo 64 golf game focused on the PGA European Tour, it better have something else to offer gamers, such as jaw-dropping gameplay. Well, your jaw indeed will drop when you play the game - but more likely from dismay and disappointment rather than excitement. Dated graphics, gameplay flaws, and meager extras all conspire to bring down an otherwise average golf game. PGA European Tour covers the standard ~golf game~ bases: one-to-four-player strokeplay (best score wins), matchplay (most holes wins), skins (play for money), and practice mode. You can also simulate the PGA European Tour, which features big names such as Nick Faldo and Colin Montgomerie. In this mode, you hone your skills by starting your players off as amateurs, then improving their handicaps to eventually qualify for the tour. The game boasts four real-life courses - Quinta do Lago in Portugal, The 'K' Club in Scotland, Kungsngen in Sweden, and Druid's Glen in Ireland - which offer a good variety of holes to play. (Suffice it to say, this reviewer has never actually played any of those courses in real life, so it's difficult to judge how accurate they are.) Aside from the four golf courses, the game's biggest plus is its versatile control. Although the game uses the standard circular power meter found in virtually all golf titles, you can choose whether to control it with buttons or with a combination of the analog stick and buttons (the latter being a much tougher task). This lets you experiment until you find a style that best suits you. Unfortunately, the rest of the game slips downhill from there. Graphically, the game (which doesn't support the high-resolution Expansion Pak) looks like it could've shipped several years ago. While the greens and weather/lighting effects look passable, the lack of crowds and visual variety cheapens the game's overall atmosphere. On hole flybys, the bit-mapped tree shapes flicker and change size and shape as the camera moves through. The golfers employ the same motion-capture movements, and they all look the same, aside from palette swaps. The generic announcer phrases sometimes don't match the gameplay, and they are best turned off. On the plus side, the game uses sound mapping - so water noises get louder when you stand closer to a stream, for instance. If presentation were the game's only issue, it probably would've passed muster. However, the gameplay merely adds insult to injury. Perhaps the biggest flaw is that in tour mode, you must play along with a computer golfer. Since there's no way to turn off the other golfer's animations, you must watch and jam on buttons to speed the process along. Second, the inflexible camera control prevents you from zooming in close to target the pin precisely, so shots on the green sometimes become a guessing game. Finally, it doesn't seem to make any difference whether a ball lands in the rough, fairway, or sand - the difficulty for each shot remains the same regardless of surface. The game also had some frustrating glitches that needed fixing. On some really short putts, the aiming arrow wigs out, which makes it impossible to gauge the power meter accurately. In isolated instances, the announcer would call a ball out of bounds even though it was clearly in play based on the screen view. Much of the game revolves around choosing the right club and putting backspin on a shot when necessary, so in terms of fundamental gameplay, this title has some merit. With patience and dedication, a die-hard golf gamer can accept the game's flaws and grow to enjoy the nuances of the European courses. Still, PGA European Tour lacks the needed bells and whistles to get a good rating, while the game's tired, sparse graphics and gameplay glitches prevent it from breaking even. Only golf addicts craving for new courses to master - and money to burn - should consider hitting this less-than-spectacular tour."}