{"ref": "https://www.gamespot.com/reviews/eternal-darkness-sanitys-requiem-review/1900-2872284/", "date": "June 25, 2002", "game_name": "Eternal Darkness: Sanity's Requiem", "text": "Eternal Darkness: Sanity's Requiem has been a long time in coming. It originally started as an Nintendo 64 project, but when sales of that console went south, Nintendo decided the game would be better received on the GameCube. So after four years in development, Nintendo's first M-rated game for the GameCube is finally here, and the lengthy development cycle has resulted in an uncanny attention to detail that few games possess. Slick, polished, creepy, and alluring, Eternal Darkness raises the bar for what action adventure games should be and stands as the first example of a game that plays the player. The game centers on the Roivas family and its ties to an ancient book called The Tome of Eternal Darkness. Behind the scenes, an evil force called the ancients has been scheming to harness the power of the book and overtake the world. One by one, each generation of the Roivas family comes into contact with the book, and the game chronicles the stories of them all. There are 12 different playable characters in the game, and their adventures all take place during distinct time periods. You'll play as a doctor during World War I, an architect, a firefighter, a monk during the Spanish Inquisition, and more. Tying all the storylines together is Alexandria Roivas, the latest and last in the family's bloodline. When she ventures to her grandfather's mansion to inquire about his death, the game's branching storyline is set into motion. Owing a great deal to the Indiana Jones films, the story of Eternal Darkness is deep and twisting, and one that will leave many characters dead and you in a state of disbelief. A story isn't worth its weight in beans if it doesn't have the gameplay to back it up, and Eternal Darkness delivers in this regard with a gameplay experience like no other. First and foremost, it should be mentioned that you have full analog control over characters in Eternal Darkness, and it works flawlessly. If you push right on the analog stick, the character moves to the right, so you won't be aiming your character like you're forced to in the Resident Evil series. The 12 playable characters all have unique weapons and ratings for health, magic, and even sanity. In general, you'll control each character for a couple of hours before having to switch to a new one, at which point you'll need to get accustomed to how the next character moves and acts. You'll find that while some of the younger characters can run rather briskly and for long periods of time without tiring, some of the older characters are a bit more lethargic and run out of breath rather quickly. Similarly, some characters are more adept at using magic, while others rely more on their combat skills. Mastering each character is key to progressing through the game, and the large number of characters makes for an interesting, varied gameplay experience. Like in most adventure games, there are some puzzles to be solved in Eternal Darkness, though they're fairly straightforward. You'll never have more than one or two puzzle-oriented items in your inventory at any given time, and figuring out where to use them will not induce any migraines. Backtracking and aimless wandering are also kept to a minimum, though some items are hidden in places that will take a keen eye to spot. The hand-to-hand combat features an interesting targeting system that allows you to concentrate on specific body parts of enemies. Each enemy has a weak spot, and finding this vulnerable area and attacking it is one of the keys to success. The melee interface can seem clunky and unresponsive when you get your first rush of multiple enemies, but you'll soon learn to trust in the system and realize that it works remarkably well. In many cases, the best strategy is to enter a room, behead all the enemies, and then take your time mopping up the headless masses. In addition to using the system to attack with swords and other melee items, the targeting can also be used with projectile weapons such as guns for more accurate strikes. Timing is the most important combat skill in Eternal Darkness, and this carries over to the game's magic system as well.The magic system in Eternal Darkness is one of the game's best-kept secrets, and rightfully so. It's surprisingly deep for a game of this type, and it alters the gameplay considerably. At the game's outset, you select from one of three alignments. The alignment you choose will establish your dominant spellcasting ability and will alter the effects of every spell you cast throughout the game. When you first take control of each character, you won't be able to use magic until you stumble upon The Tome of Eternal Darkness. Even if you have the book, you won't be able to conjure until you've collected spell scrolls, codices, and runes. Combinations of these three items create the game's different spells, which run the gamut from weapon-enchanting concoctions to destructive electricity attacks. You'll also be able to summon several different creatures that you'll then be able to take control of, make yourself invisible, heal yourself, and much more. You can even experiment with mixing ingredients to create new spells. Casting one of the game's elaborate spells. Much like your magic, each enemy in the game has an alignment, and choosing the proper alignment for each spell will make a world of difference when tackling some of the more difficult foes in the game. The use of magic is reliant upon good timing and your magic meter. While casting spells you must stand perfectly still, so it's important that there is enough distance between you and your enemies to allow you to complete the entire incantation. To make things easier, you can map up to five spells to buttons on the GameCube controller for easy access. The lone drawback in the game's magic system is that the magic meter is replenished by moving your character--many times you'll find yourself running in circles to replenish your magic meter, which can seem a bit ridiculous. The magic system is great, but probably the most interesting gameplay element in Eternal Darkness is the sanity meter and its accompanying effects. When hearing about the sanity aspect of the game, it's easy to brush it off as a novelty, but nothing could be further from the truth. In the game, as you come across unsightly manifestations of evil, your character's sanity meter will start to fall. As your meter begins to dwindle, you'll be cued to the fact that your character is starting to lose his or her grip on reality when blood begins to run down the walls. However, this is just the precursor to the game's incredibly inventive insanity effects. If your sanity meter hits rock bottom, your character will really start to lose it. Sometimes you'll enter a room to find you're walking on the ceiling, or you'll be placed in a scenario that doesn't seem quite right. But the sanity effects aren't confined to affecting the character onscreen--they will also influence you. Without giving away too much, if some technical issues should arise while playing the game, don't be too quick to take action. The graphics get better as the game wears on. The sanity system is more than just a clever diversion. Once your sanity meter is at the bottom, every time you catch a glimpse of an enemy you'll lose some health. Restoring sanity is no easy task, either. You can finish off enemies to restore a little bit at a time, and some characters have special abilities or items (like a flask of whiskey) that will get their minds back in order. Also, the size of each character's sanity meter is based on his or her life experiences. You'll find that priests and other insightful characters have a larger sanity meter than the more brutish characters and therefore can endure much more before they start to crack up. More than just a cheap trick, the sanity meter adds a significant dimension to Eternal Darkness. Just when you think you have it all figured out you'll be fooled again, and there are several points where you'll have problems guessing just what is or isn't real. Back in the 16-bit days of video games, it wasn't out of the ordinary for developers to design games in such a way that the most visually impressive aspects were shown later on in the game to reward players. This old-school ideal holds true for Eternal Darkness as well. At first, the visual offerings seem very plain and subdued, but by the time you've made it to the fifth or sixth character, you begin to realize that the game's visual subtleties are many. With Eternal Darkness taking place in so many different time periods, there's a wide variety of terrain to explore. Some of the areas will also be revisited during different points in time, and it's interesting to see how the changes in technology have been implemented or how some areas have aged over the years. The game plays from fixed camera angles, and it's obvious that a great deal of care went into making sure that the dynamic camera never fails to give you a perfect view of the action. The texturing in the game is one of its most indelible visual traits. Some of the animated textures look particularly good, and you'll find multilayered textures in many areas to give the floors a grooved look.The magic system in Eternal Darkness is one of the game's best-kept secrets, and rightfully so. It's surprisingly deep for a game of this type, and it alters the gameplay considerably. At the game's outset, you select from one of three alignments. The alignment you choose will establish your dominant spellcasting ability and will alter the effects of every spell you cast throughout the game. When you first take control of each character, you won't be able to use magic until you stumble upon The Tome of Eternal Darkness. Even if you have the book, you won't be able to conjure until you've collected spell scrolls, codices, and runes. Combinations of these three items create the game's different spells, which run the gamut from weapon-enchanting concoctions to destructive electricity attacks. You'll also be able to summon several different creatures that you'll then be able to take control of, make yourself invisible, heal yourself, and much more. You can even experiment with mixing ingredients to create new spells. Much like your magic, each enemy in the game has an alignment, and choosing the proper alignment for each spell will make a world of difference when tackling some of the more difficult foes in the game. The use of magic is reliant upon good timing and your magic meter. While casting spells you must stand perfectly still, so it's important that there is enough distance between you and your enemies to allow you to complete the entire incantation. To make things easier, you can map up to five spells to buttons on the GameCube controller for easy access. The lone drawback in the game's magic system is that the magic meter is replenished by moving your character--many times you'll find yourself running in circles to replenish your magic meter, which can seem a bit ridiculous. The magic system is great, but probably the most interesting gameplay element in Eternal Darkness is the sanity meter and its accompanying effects. When hearing about the sanity aspect of the game, it's easy to brush it off as a novelty, but nothing could be further from the truth. In the game, as you come across unsightly manifestations of evil, your character's sanity meter will start to fall. As your meter begins to dwindle, you'll be cued to the fact that your character is starting to lose his or her grip on reality when blood begins to run down the walls. However, this is just the precursor to the game's incredibly inventive insanity effects. If your sanity meter hits rock bottom, your character will really start to lose it. Sometimes you'll enter a room to find you're walking on the ceiling, or you'll be placed in a scenario that doesn't seem quite right. But the sanity effects aren't confined to affecting the character onscreen--they will also influence you. Without giving away too much, if some technical issues should arise while playing the game, don't be too quick to take action. The sanity system is more than just a clever diversion. Once your sanity meter is at the bottom, every time you catch a glimpse of an enemy you'll lose some health. Restoring sanity is no easy task, either. You can finish off enemies to restore a little bit at a time, and some characters have special abilities or items (like a flask of whiskey) that will get their minds back in order. Also, the size of each character's sanity meter is based on his or her life experiences. You'll find that priests and other insightful characters have a larger sanity meter than the more brutish characters and therefore can endure much more before they start to crack up. More than just a cheap trick, the sanity meter adds a significant dimension to Eternal Darkness. Just when you think you have it all figured out you'll be fooled again, and there are several points where you'll have problems guessing just what is or isn't real. Back in the 16-bit days of video games, it wasn't out of the ordinary for developers to design games in such a way that the most visually impressive aspects were shown later on in the game to reward players. This old-school ideal holds true for Eternal Darkness as well. At first, the visual offerings seem very plain and subdued, but by the time you've made it to the fifth or sixth character, you begin to realize that the game's visual subtleties are many. With Eternal Darkness taking place in so many different time periods, there's a wide variety of terrain to explore. Some of the areas will also be revisited during different points in time, and it's interesting to see how the changes in technology have been implemented or how some areas have aged over the years. The game plays from fixed camera angles, and it's obvious that a great deal of care went into making sure that the dynamic camera never fails to give you a perfect view of the action. The texturing in the game is one of its most indelible visual traits. Some of the animated textures look particularly good, and you'll find multilayered textures in many areas to give the floors a grooved look.The character models are probably the game's weakest visual link, thanks to some low-resolution textures that can make their features a bit blurry at times. However, the facial animation is excellent during the game's many real-time cinemas, as the characters' faces will animate realistically while talking. The clothing is also incredibly well done, thanks to textures that will react properly to movement instead of clipping through each other. The enemy models are hit and miss. The most common enemies in the game show up far too often and are too uninventive for something that is supposed to represent an ancient evil. To be fair, some of the later enemies in the game are as creepy as can be, but it takes far too long before they make an appearance. Graphical trickery like multicolored volumetric fog is prevalent, and it even ties into the gameplay. If you enter a room with colored fogging, the color of the fog will clue you in to the magical alignment of the creatures in that room. The real-time lighting engine is also profound, with light from enchanted items and spells bouncing off the walls and streaking across the faces of characters. Self-shadowing is also implemented on the character models to startling effect. The animation features the same level of detail as the rest of the game--characters will bend down and step on a crossbow to reload it, and there are a dozen different walking animations for each character depending upon his or her level of health. The polygon-pushing power of the graphics engine used for Eternal Darkness is impressive, even if most of the game takes place indoors. It allows an incredible amount of detail to be displayed in each room--each object in each room is individually modeled. And when the game's environments do open up a bit, it's a sight to behold. At any rate, despite a few rough edges in the visuals, all it takes is seeing the colored lighting, fog, and detailed environments onscreen all at once, with no hit to the perfectly smooth frame rate, to truly appreciate the graphics of Eternal Darkness. A few small visual elements remind you that the game started out as a Nintendo 64 project, but on the whole, the development team has done an excellent job of creating a definitive next-level visual experience. So while Eternal Darkness' graphics won't floor you right off the bat, it's surprising how many areas of the game come close to matching the visual quality of the prerendered environments in the recently released Resident Evil remake. Overall, it's one of the most visually impressive games on the console. Sound isn't always a priority for game developers, so the sound in Eternal Darkness is certainly exceptional. For one thing, it makes use of Dolby Pro Logic II, and the channel separation is excellent. Some of the sanity effects come in the form of sound, and you'll be shocked at the quality of the samples and how well placed they are in the surround environment. Also, the voice acting in the game is truly outstanding. There are dozens of characters in the game and literally hours of spoken dialogue, yet only a few lines out of hundreds seem even the least bit stilted. The music for the game is a mix of world music and Celtic compositions that bear a striking resemblance to the work of groups like Dead Can Dance. More than appropriate, the music sets the tone for the game rather well and helps establish its timeless nature. As perhaps the most legitimately mature M-rated console game to ever be released, Eternal Darkness sets a new standard for the action adventure genre. Featuring a gripping story that never lets up, inventive gameplay, sky-high production values, and an attention to detail that is seldom matched, it's an experience like no other. It's a must-buy for anyone who appreciates an amazing story coupled with equally amazing gameplay, and since it offers almost 30 hours of gameplay each time through (and incentive to play through more than once), it's well worth the money spent. Eternal Darkness: Sanity's Requiem will long be remembered as Nintendo's first real step toward broadening its horizons, and may well represent a turning point for video games in general."}