{"ref": "https://www.gamespot.com/reviews/sea-life-safari-review/1900-6192713/", "date": "June 18, 2008", "game_name": "Sea Life Safari", "text": "Sea Life Safari tries to bring the thrill of underwater exploration to Xbox Live Arcade but fails miserably. Kids may have a little bit of fun snapping photos of fish, but the game is unattractive, achingly boring, and so preposterously simple that it won't hold anyone's attention for long. Sea Life Safari's premise is simple: A professor wants you to get in a small submersible and take pictures of sea creatures for him. The submarine follows a predetermined path along the ocean floor, so all you have to do is look around for sea creatures by adjusting your view with the analog stick, zooming with the left trigger, and snapping a picture with the right trigger. Your photos are judged on how well it's centered, how close the sea life is to the camera, and if the subject is facing the camera or not. You throw gizmos (pieces of junk, essentially) toward fish to get them to react, and you get additional points based on how much action is in the shot. The best photos are rated three stars, but the way pictures are scored feels arbitrary. You can keep your favorite pictures in a photo album, but you'll see the same fish so often that there's little reason to revisit old pictures. Here's a free game guide: Take pictures. Win. The game's five levels take place in a coral reef, a ship graveyard, the deep sea, the ~abyss,~ and an underwater volcano. Each area features 12 creatures to locate and photograph. There are sharks, lion fish, crabs, dolphins, sea horses, an octopus, orca, a number of tropical fish, and more. If you visit a level three times you'll unlock a special item to photograph, and there are also 10 shells scattered through each area that you can collect. That's about all there is to Sea Life Safari--it's little more than an interactive screensaver. Nearly every aspect of Sea Life Safari has a fatal flaw. The on-rails nature of the gameplay makes exploring impossible. If you want to take a picture of a certain fish that's near the end of a level you have to go through the entire level--there's no way to skip ahead or speed things up. Plain backgrounds, poor textures, and random cartoony animations like fish that dance or burp make it painfully obvious you're playing a video game and not watching real fish. With only 60 kinds of sea life to find, you'll see almost everything the game has to offer in an hour or so, and online leaderboards offer little incentive to return to a level to try for a high score. The biggest problem with Sea Life Safari is that it's pointless. You can't die, there's no room for creativity, it requires almost no skill, and it's mind-numbingly boring after 20 minutes. The game can't even use the ~it's educational~ excuse because you never learn anything about the creatures you're photographing except for their names. At 800 points ($10), it's a waste of money, too."}