{"ref": "https://www.gamespot.com/reviews/mass-effect-2-kasumi-stolen-memory-review/1900-6257313/", "date": "April 8, 2010", "game_name": "Mass Effect 2", "text": "Mass Effect 2's supporting cast was as memorable as any in recent memory. Stellar voice acting and superb dialogue planted seeds in your imagination, and loyalty quests for each character allowed those seeds to blossom. Yet these characters weren't defined just by what they said, but also by memorable events that became forever associated with them. Who could forget the moment a mother and daughter came to blows and forced you to make an impossible decision? Or how about an explosive introduction onboard a prison vessel? Mass Effect 2's mission structure provided each character with multiple chances to steal the spotlight, and the resulting incidents were often markedly poignant. The game's newest downloadable add-on, Kasumi - Stolen Memory, introduces you to another character but provides no such defining moment. Because the associated recruitment mission and loyalty mission are one and the same, you never get a chance to develop a bond with Kasumi. She's a thief without an air of mystery or secrecy, featured in a mission that barely gives her a chance to shine. Some clever pop culture references, a bit of brisk action, and a tender conclusion provide brief delights, but while this content doesn't wither, it never fully flourishes, either. The mission in question sends you first to the Citadel, where the supposedly secretive thief speaks to you through a vending kiosk, though as it turns out, she's watching you from just above. (For a thief, she's not particularly elusive; certainly not compared to a character like Thane, who dazzled players with a far more remarkable meeting.) She gives you a brief rundown on the situation: A criminal millionaire named Donovan Hock has stolen a bit of hardware containing her late partner's memories, including some secretive information that could apparently destroy the galaxy if it fell into the wrong hands. From there, you head to a planet in a nearby system, where you are to crash one of Hock's fancy dress parties so you can sneak into his vault and retrieve the stolen memories. Certain elements of the plot don't make a lot of sense. For example, you are to attend the party using a fake identity with an apparently rich backstory, yet Kasumi gives you only a few rough ideas about this persona and only after you're dressed in your formals. There are a few other story inconsistencies, though in Mass Effect 2, plot always played second fiddle to character development. Yet Kasumi is not nearly as interesting as your other crewmates; she's elegant but not indispensable; nice but not notable. Her story ends sweetly, but the sentimental conclusion is a small grace note rather than the full-fledged serenade it could have been had Kasumi's story arc been as lengthy as that of the other crew members. The first half of Stolen Memory is light on action but heavy on atmosphere. Hock's mansion has the right jetsetter look, featuring small art galleries and a rear veranda, where guests mill about sipping wine (or some such drink) and pass along the recent rumors that Commander Shepard is alive. You'll overhear a few other shrewd references and probably notice some other minor but clever details. Look for a visual reference to Dragon Age: Origins in one location; prepare to chortle at a silly Planet of the Apes quote in another. Otherwise, the first 20 minutes are pleasant but uneventful and involve a whole lot of roaming and busywork (walk around taking DNA samples from Hock's bedroom, talk to the infamous host to get a voice sample). One task--infiltrate the private quarters--can be fulfilled in two different ways, which adds a pleasant touch of flexibility. Yet this first sequence is paced slowly without offering any sense of increasing tension or extended dialogue options to compensate. It never hurts to equip some incendiary ammo. The action heats up in the second half, where you come up against Hock's sizable security contingent. Combat is exactly as you'd expect, but the shooting and biotic power flinging is still as good as ever. Kasumi makes a fun companion, due to her ability to quickly and silently backstab her target. If you haven't finished Mass Effect 2 or intend to play again, you'll welcome her presence during other missions. The enemies are the usual suspects, but there's a nice variety of them and a good amount of credits and other loot to collect, and the action climaxes with a predictable but enjoyable boss fight. Once you return to the Normandy, you may chat with Kasumi a bit more by selecting a few of her personal items in her quarters, but once the quest is done, so too is her character development. You get an extra gun for your trouble, as well as a bar where Shepard can get smashed, if you're so inclined. These are welcome rewards, though they don't add significant value considering the add-on's cost. This is especially true if you have finished the game before tackling the new content; 560 Microsoft points ($7) is a bit steep considering the inconsistent quality of this hour-long mission. Kasumi - Stolen Memory is still worth a look, but it won't leave you with any lasting memories of your own."}