{"ref": "https://www.gamespot.com/reviews/age-of-empires-iv-review-resistance-is-feudal/1900-6417782/", "date": "November 8, 2021", "game_name": "Age of Empires IV", "text": "There's a unique feeling of satisfaction that Age of Empires games have excelled at delivering over the years. That wonderfully fulfilling moment of seeing your strategy succeed at littering the battlefield with an entire army of deceased knights and peasants, all your hard work, micro-management, and scheming paying off as your forces march off to burn down the nearest town center. Age of Empires II mastered that triumphant moment of careful planning and unleashing a well-balanced army on your opponent, and it's that timeless feeling that Age of Empires IV seeks to capture while paying homage to its past.While it does succeed at evoking nostalgic memories of unloading a heavily-armored Persian pachyderm war machine deep in the heart of enemy territory, Age of Empires IV doesn't make much of an effort to venture out of its comfort zone either. It's confident but familiar, relying on what works without blazing a new trail in the strategy genre.Relic Entertainment and World's Edge's sequel to the long-running real-time strategy series thankfully skips some of the unnecessary complexity of Age of Empires III. Instead, they bring the game back to a successfully proven formula of managing limited resources, tactical scouting, and slowly transforming your hamlet from scrappy upstart into a world-conquering feudal superpower across several ages.That core loop of churning out dozens of villagers, researching new technologies, and building a formidable army, is a strong reminder of just how timeless a well-executed gameplay system can be, and will be instantly recognizable to any Age of Empires veteran.The campaigns take place across four noteworthy eras of human development, shining a spotlight on the English, French, Mongolian, and Russian civilizations. In addition to that, there's also the standard Skirmish mode and Art of War tutorials that teach you the finer details of the game, although at the time of writing, a dedicated scenario and map editor has yet to be added to the package.Each of the four campaigns runs for a decent number of hours, with sharp documentary-like videos filling in the gaps between each mission. They're exquisitely produced snippets of history, detailing the road to war that notable figures such as Genghis Khan, William the Conqueror, and Ivan the Terrible embarked on to secure the legacy of their nations. Even better, completing a mission unlocks more short videos that further detail aspects of those cultures and their approach to warfare, such as the time-consuming creation of chainmail, the thoroughbred beauty of Mongolian horses, and the game-changing impact of the trebuchet in siege warfare.That outsider approach to the Age of Empires IV narrative does at times feel like a missed opportunity considering that Relic Entertainment is at the helm of this game. Relic's Dawn of War games had fantastic storytelling, but Age of Empires IV leans hard into its documentary influences, conveniently glossing over the horrific acts that these nations committed to emerge triumphant over the centuries of conflict, terror, and genocides that defined these nations during the Dark Ages.While the history of each campaign is given a documentarian makeover before each round kicks off, its the actual reenactment of those major battles that provides a fun series of challenges and plenty of variety. From having to take control of the French forces during the siege of Paris to drawing a line in the sand against Mongol invaders on a warpath to Moscow, Age of Empires IV has a campaign that constantly throws a variety of challenges at you.Where Age of Empires IV truly shines, though, is with its selection of civilizations that you can experiment with in its campaign and skirmish modes. While a mere eight options for a feudal fight club might make veterans scoff when they compare it to the dozens of civilizations that can be chosen in the Definitive edition of Age of Empires II, Relic's approach makes each nation a blast to play. The bones of base-building and resource gathering creates a workable foundation, and each culture feels unique in other meaningful ways.Where Age of Empires IV truly shines is with its selection of civilizations that you can experiment with in its campaign and skirmish modesTake the Mongols, for example, as a well-timed ambush using hit-and-run tactics transfers more resources to your base with every building that you burn to the ground. Prefer the safety of long-range siege warfare? The French are a dab hand at leveling walls with their gunpowder units, the Rus take to the battlefield with self-healing holy warriors, and the Abbasid turn a single landmark into a wonder of the ancient age with each new branch that they build onto it.Each civilization has its own pros and cons, as well as some wild imbalances as the Age of Empires IV community has discovered. I've dreaded going into battle against the Delhi Sultanate, as their almighty war elephants have regularly bulldozed through all my defensive tactics. The English can also be an absolute nightmare to deal with, as that civilization has several unique technologies that make them experts at linking their defenses together, weathering any siege with their strong agriculture, and unleashing long-range death from their infamous longbows.All of this makes for a game that is both comfortably familiar and surprising when you dig into the tactical options available to you. Even progressing to a new age of development presents an additional layer of flexibility, as you'll have the choice of building one of two landmarks that will have a major impact on the direction that your city takes. The Rus can lean further into their hunter-gatherer lifestyle by earning greater rewards when they take down wild game, while the Holy Roman Empire benefits from cunning architecture that adds more benefits to a city depending on how closely buildings are erected near a central landmark.Outside of the main campaign, Age of Empires IV's skirmish mode now features new victory conditions that make for snappier games of conquest and domination. The default setup gives you three options for victory; demolishing an opponent's landmark, building a wonder, and achieving a holy victory by taking control of several strategic sites on the map. While you'd need to find and hold relics in Age of Empires II, sacred site conquest tasks you with locating the sites, sending a monk to convert them, and then holding onto all of those locations for 10 minutes.These sacred sites also tend to be situated in the middle of a map, forcing players to build armies that make for more overt warfare when compared to the tactics of the past. Holding out for a victory in a war of attrition also has plenty of charm, as Age of Empires IV makes being part of a siege far more fascinating. The absolute thrill of throwing up walls and populating them with rows of archers is now met by an adrenaline rush of watching your infantry construct battering rams and siege towers, and then throwing them into the chaotic fray of battle while trebuchets hurl devastating boulders over your units' heads.While it is a joy to see just how far your strategy can go during skirmishes and campaign missions, Age of Empires IV isn't without some annoying quirks that you'll have to contend with. Unit AI can be frustratingly unreliable, as the age-old tactic of creating a heavily-armed meat-shield while your archers and crossbowmen turn the opposition into a massive pin-cushion requires more micro-management than ever before. While your infantry and cavalry soak up damage, you'll need to do far more micro-managing than ever before to get vital units into position because they simply cannot be counted on to take advantage of the battlefield opportunity that you've created.Age of Empires IV also looks incredibly dated, as its washed-out visuals and bland color palette pale in comparison to other modern RTS games. While it has some charm--such as seeing multiple illustrative units speedily constructing a building or its selection of handcrafted menus that you can count every tapestry thread within--Age of Empires IV lacks that visual flair that made previous games shine. It's a more vanilla presentation that's also held back by a locked camera angle and a player population limit of 200 that rarely allows for large-scale battles to truly unfold.On a more positive note, the soundtrack is an audio history lesson that mixes delicate lute solos with Mongolian throat singing and Germanic choirs.Age of Empires IV is a satisfying game, but its more innovative ideas are overshadowed by a gameplay formula that rarely deviates from the revered legacy of Age of Empires II. Dated graphics, annoying AI, and a thin selection of content holds Age of Empires IV back from establishing an RTS kingdom that can stand the test of time, but thrilling campaigns, a passion for history, and factions that feel truly distinct from one another makes for satisfying RTS comfort feud."}