{"ref": "https://www.gamespot.com/reviews/tiger-woods-pga-tour-2004-review/1900-6101325/", "date": "May 17, 2006", "game_name": "Tiger Woods PGA Tour 2004", "text": "In Tiger Woods PGA Tour 2004, Digital Bridges attempts to revamp an aging graphics engine with a new 3D-view mode that furnishes the player with a view of his ball and some surrounding, sprite-based foliage, with the idea being that this will allow him to better align his shots. The mere existence of such a feature shouldn't strain the hardware of LG's fairly zippy VX6000, yet Tiger Woods barely manages a jerky, single-digit frame rate. While the Series 60 version sports a somewhat better frame rate, the problem is so pronounced on the VX6000 that it makes the classic metered system of ball control--the standard control method for virtual golf swings since the advent of golf games--very difficult to manage. It's impossible to precisely time your shot when the moving meter used to control accuracy and distance is bouncing around like a hyperactive flea. You can play against Tiger, but this mode essentially just generates a score for your opponent, rather than making you feel like you're engaged in any sort of competition. Tiger Woods PGA Tour 2004 gives you the option of playing as yourself, Tiger, yourself against Tiger, or against another player--all on the same handset. While that might sound like a lot, the on-screen representation of your golfer looks like a bad re-creation of Tiger Woods, regardless of what you choose, and the sprite used is a pretty poor likeness. The only discernible difference between playing the game as yourself or playing as Tiger is that, in the latter mode, Tiger will give you advice on how to play the hole. For example, you'll see such offerings as, ~On this slight dogleg, a drive to the narrow landing area will give you a good angle to approach the long and narrow green.~ There's no pleasant music to distract you, either, as Tiger Woods features only one sound: an occasional ~thwap~ when you connect well with the ball. If you get frustrated enough with Tiger's ineffectual musings regarding doglegs, you might want to challenge him. Doing so will prove supremely unexciting, however. You won't get to see Tiger actually playing golf. Instead, you'll just be told how much better he's doing than you. This means that the artificial intelligence in the game consists of nothing more than a score generator. The bottom line is that even the original Tiger Woods PGA Tour for mobile provided a more fluid play experience than this current version. Tiger fans should definitely stick with last year's game, though fans of the genre would be best served by Jamdat Sports Golf 2004."}