{"ref": "https://www.gamespot.com/reviews/totaled-review/1900-2875819/", "date": "May 17, 2006", "game_name": "Totaled!", "text": "Car combat games aren't new anymore. That being the case, new additions to the genre are pressed to come up with a strong gameplay model or have something to offer that other similar, older games haven't already done. Totaled! is a game that doesn't do any of this, and it even goes so far as to take the formula of wrecking cars and remove most of the fun from it. While weapons have become somewhat of a requirement in games of this type, there are none to be found here. What this leaves you to do is mindlessly smash into opponents, and while doing so may be fun in other similarly themed games, the frustratingly bad physics in Totaled! make the game a thoroughly unentertaining experience. Totaled! is essentially a destruction derby. The game revolves around the career mode, in which you travel the world and enter a variety of contests that have a number of different goals. The most basic contest puts you in an arena to destroy as many opponents as you can in a set amount of time. Damaging other vehicles by smashing into them gets you points, and in some contests, amassing points is more important than survival. Other contests have you racing around a track while trying to stay ahead of the pack, or pulling off stunts for points. The variety of different contests are nice, but unfortunately the subpar control detracts from any fun these modes might have had going for them. And that's exactly where Totaled! self-destructs--in how it controls. As you progress through the game, you'll unlock a number of different vehicles and tracks--all pretty standard stuff. Each car has a number of attributes that differentiate it from the others, but not one car handles very well. Each and every vehicle moves in such a way that can only be described as frustrating. Acceleration is so slow that even cars with high points in this category feel sluggish, and vehicles with poor acceleration are downright awful to drive. For the most part, you'll be trying to get up to speed and smash into other cars as you attempt to destroy them, so the inability to accelerate quickly becomes a problem right away. Once you have some speed going, you can pull off powerslides and other maneuvers to keep your car moving along, but one good hit on an opponent or other object and your speed will be drastically reduced, starting the bitter cycle all over again. Oftentimes, after hitting another car and coming to a standstill, opponents will pile up on you, and you won't be able to break free until an opening presents itself--this can take upward of 30 seconds, as the painfully unintelligent enemy AI tries to figure out how to move in any direction but forward. In these cases, the camera can get confused and more often than not will literally get caught inside a nearby car or spin wildly until it comes to rest behind you. Even when you're moving along at a clipped rate, the cars seem as though they have all of their weight in the front end, so powerslides will cause the rear end of the vehicle to slip abnormally, extending the slides and making them difficult to control. Often, your front wheels will catch on the edge of a track or some other surface and send your car tumbling end over end, and this is where the odd distribution of weight becomes extremely apparent. When accidents like this occur, your car will frequently act like some strange gyroscope, spinning wildly on its front grill or hood. Even when this doesn't happen, the cartwheeling wrecks look and behave oddly to say the least.In addition to the standard deathmatch-type destruction derby, there are battles for points, in which all entrants attempt to outdo each other by smashing into other cars and gaining more points than opponents. There are also races and stunt contests, in which you'll attempt to either come in first place or gain points by jumping through hoops or pulling off spectacular crashes (and landing on all four wheels). The stunt mode is pretty basic--you'll mostly spend your time driving erratically while trying to roll the car. This is the easiest way to rack up points quickly. Similarly to rolling your car in the stunt mode, there are easy-to-find exploits that will let you win other contests quickly. In the destruction derbies, the last car still driving is the winner. The easiest way to end up in this position is to drive around the arena and avoid all of the other cars until they destroy themselves, and then smash the last one standing. It's cheap, and it works every time. Other match types include single races where you have to clear a track with crates strewn about the tarmac, all while avoiding such abstract things as glowing red bowling pins that will destroy your car on contact. Still other matches act more like minigames and have you rolling barrels into target zones. There are also bus-jump contests, which consist merely of driving in a straight line and punching the nitro as you go up the ramp. None of this variety amounts to much when the game itself is so aggravating to play. Bus jumping isn't as fun as you might think. To make matters worse, Totaled! doesn't look very good either. All of the arenas you'll be playing in are thoroughly uninspired, consisting mostly of sparsely populated open arenas. Some stand out as being more interesting--the football field immediately comes to mind--but even these don't look very good when compared to other games. Considering the Xbox's capabilities, it's not unfair to say that Totaled! doesn't tax the system one iota. The car models are decent and do visibly take damage--they lose fenders and paneling and eventually explode when they've been damaged beyond repair. But that's the high point of the visuals in the game. The sound in the game is probably the strongest category in Totaled!, but even it falls short. The soundtrack stands head and shoulders above the sound effects and announcement, with a strong variety of punk rock from bands such as Bracket and Face To Face, as well as the occasional odd jazzy tune. As far as the actual sound effects are concerned, they're mostly run-of-the-mill engine and tire noises, broken up by nearly satisfactory explosions and impact noises. The announcer--while mostly serviceable--at times sounds like he's biting at the furthest reaches of street slang in order to narrate the onscreen chaos. It's going to take a while to get back up to speed after this hit. Totaled! also supports up to four players in the multiplayer mode, which basically consists of variations on the career and arcade mode arenas. If the game played any better this would be more of a bonus, but as it stands, it's a decent multiplayer option in a game that isn't fun to play. There was a time when vehicular combat games consisted entirely of destruction derby games, but the arrival of the Twisted Metal and Vigilante 8 series upped the ante and forced other car combat games to work a little harder in order to survive. The old destruction derby formula might still be a good one if done correctly, but Totaled! serves as the perfect example of how bad a game of this variety can be if it's done wrong. Totaled! falls short on all fronts, but the exceptionally bad physics and gameplay rob the game of any hope of being something worth your time.In addition to the standard deathmatch-type destruction derby, there are battles for points, in which all entrants attempt to outdo each other by smashing into other cars and gaining more points than opponents. There are also races and stunt contests, in which you'll attempt to either come in first place or gain points by jumping through hoops or pulling off spectacular crashes (and landing on all four wheels). The stunt mode is pretty basic--you'll mostly spend your time driving erratically while trying to roll the car. This is the easiest way to rack up points quickly. Similarly to rolling your car in the stunt mode, there are easy-to-find exploits that will let you win other contests quickly. In the destruction derbies, the last car still driving is the winner. The easiest way to end up in this position is to drive around the arena and avoid all of the other cars until they destroy themselves, and then smash the last one standing. It's cheap, and it works every time. Other match types include single races where you have to clear a track with crates strewn about the tarmac, all while avoiding such abstract things as glowing red bowling pins that will destroy your car on contact. Still other matches act more like minigames and have you rolling barrels into target zones. There are also bus-jump contests, which consist merely of driving in a straight line and punching the nitro as you go up the ramp. None of this variety amounts to much when the game itself is so aggravating to play. To make matters worse, Totaled! doesn't look very good either. All of the arenas you'll be playing in are thoroughly uninspired, consisting mostly of sparsely populated open arenas. Some stand out as being more interesting--the football field immediately comes to mind--but even these don't look very good when compared to other games. Considering the Xbox's capabilities, it's not unfair to say that Totaled! doesn't tax the system one iota. The car models are decent and do visibly take damage--they lose fenders and paneling and eventually explode when they've been damaged beyond repair. But that's the high point of the visuals in the game. The sound in the game is probably the strongest category in Totaled!, but even it falls short. The soundtrack stands head and shoulders above the sound effects and announcement, with a strong variety of punk rock from bands such as Bracket and Face To Face, as well as the occasional odd jazzy tune. As far as the actual sound effects are concerned, they're mostly run-of-the-mill engine and tire noises, broken up by nearly satisfactory explosions and impact noises. The announcer--while mostly serviceable--at times sounds like he's biting at the furthest reaches of street slang in order to narrate the onscreen chaos. Totaled! also supports up to four players in the multiplayer mode, which basically consists of variations on the career and arcade mode arenas. If the game played any better this would be more of a bonus, but as it stands, it's a decent multiplayer option in a game that isn't fun to play. There was a time when vehicular combat games consisted entirely of destruction derby games, but the arrival of the Twisted Metal and Vigilante 8 series upped the ante and forced other car combat games to work a little harder in order to survive. The old destruction derby formula might still be a good one if done correctly, but Totaled! serves as the perfect example of how bad a game of this variety can be if it's done wrong. Totaled! falls short on all fronts, but the exceptionally bad physics and gameplay rob the game of any hope of being something worth your time."}