{"ref": "https://www.gamespot.com/reviews/serious-sam-ii-review/1900-6135463/", "date": "October 12, 2005", "game_name": "Serious Sam II", "text": "When Serious Sam: The First Encounter quietly appeared in 2001, it was a real breath of fresh air. The game delivered fantastic-looking, incredibly intense first-person-shooting action without any of the genre's pretenses of grandiose storytelling, all with its own unique style and for a bargain price of $20 at that. Serious Sam has made appearances a handful of other times since then, but only now has a full-fledged sequel finally arrived. The good news is that this is Serious Sam all right, packing in all the silly humor and massive shooting-gallery-style levels you'd expect from the previous games. The bad news is something's been lost in translation, perhaps due to the passing of time or due to the new 3D graphics engine, or--more likely--because of a combination of each. Serious Sam II has a lot of levels and a few good laughs, but its simple shooting action is less likely to get your adrenaline pumping as it is to make you go numb. Sam is back in Serious Sam II, and this time he'll have to shoot his way through a whole bunch of levels filled with lots of enemies. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Serious Sam II Video Review ~Serious~ Sam Stone, casually dressed in a T-shirt and jeans, has been summoned to rid the universe of Mental and his nefarious forces. To do this, he'll need to travel to different worlds to collect medallion pieces from their oppressors. And to do that, he'll need to run from point A to point B through nearly two-dozen levels, stopping frequently to gun down literally hundreds of foes. Along the way, you'll find a variety of big guns, grab lots of health, armor, and ammo power-ups, and probably discover some amusing secret areas. But mostly you'll just shoot and shoot and shoot as enemies pour in from all around you, attacking from the ground and from the sky, either hanging back and firing at you or rushing right toward you--sometimes using a combination of the two. The original Serious Sam boasted a 3D graphics engine that could render incredibly huge levels packed with incredibly large numbers of enemies. By comparison, the levels in Serious Sam II seem smaller, and so do the enemy counts (or at least these factors don't stand out like they used to). Both on the PC and the Xbox, when large numbers of enemies clutter the screen, the frame rate noticeably bogs down, which hurts the experience. The bigger issue is that the action in Serious Sam II just doesn't feel all that satisfying. The game's weapons look big and bulky onscreen, but the interaction between your firepower and your enemies' bodies feels rather hollow. Enemies just kind of break apart into bits, then quickly fade away. So despite the high volume of enemy casualties, you just don't get that sense of wreaking massive havoc and carnage with your ridiculously oversized guns. The weapons don't behave as you'd expect them to in other ways, as well. The very first weapon you find, a multibarreled shotgun that looks far too much like a toy, turns out to be perfectly accurate at extreme ranges, contrary to first-person-shooter canon, which stipulates shotguns should only be effective up close. So this boring gun actually becomes your mainstay throughout most of the game. Using a shotgun to snipe aerial targets from miles away just feels silly, but it's not the same ~silly~ that Serious Sam II is going for. The rest of the weapons are pretty straightforward. You never have to reload, but just keep an eye on your ammo count. There's more variety to the scenery than to the action. Serious Sam II doesn't do much with the original game's formula, but it introduces some vehicle-driving and turret-gun sequences into the mix. These aren't anything you haven't seen in numerous other shooters prior to this one, but they help alleviate Serious Sam II from what's a very monotonous level design overall. While the worlds you'll visit have their own unique visual style and enemies, the underlying level design and enemy behavior doesn't change much from one level to the next, and the game's challenge doesn't really escalate all that much either. In fact, at the default difficulty, most of the game is fairly easy, though certain end-of-level sequences will probably take you a few tries, at least until you figure out where all the enemies are coming from. Many of the game's levels end with an anticlimax. You battle waves and waves of foes until they simply stop coming, and then the level ends. Some decent boss fights are thrown in, but it's all been downhill for Serious Sam's boss fights since the jaw-dropping battle at the end of the first game. All the game's levels are bookended by little comedic cutscenes, some of which are absurdly amusing. However, just as often the humor falls flat. The same can be said for Sam's various one-liners during the course of the gameplay. Later on in the game, Sam even starts recycling his material, as if you needed to be reminded of such gems as ~I eat resistance for breakfast.~ The differences between the PC and Xbox versions of Serious Sam II may seem purely cosmetic, but they add up to a lot in practice. Specifically, the Xbox version looks worse, and the auto-aim feature that's enabled by default to compensate for having to use a gamepad instead of a mouse and keyboard sucks away some of the game's challenge. The auto-aim feature makes it laughably easy to hit your mark, though it's necessary in the many instances when you're shooting at targets from very far away, where the Xbox version's low resolution and sketchy frame rate conspire to make it difficult to line up your shots. Also, the PC version supports online cooperative gameplay for up to 16 players, while the Xbox limits you to four (though we had a lot of problems getting into a stable co-op match on the PC). The Xbox version also retails for more than the PC version, neither of which, incidentally, is coming out of the gate for the budget price of the original. So, yeah, don't spring for the Xbox version unless you haven't upgraded your PC since the first Serious Sam. Serious Sam II gains some mileage from its absurd humor, but the action itself could have felt a lot better. On a nicely equipped PC, Serious Sam II does look great. It's now got a physics engine like pretty much every other shooter, so expect to see some boxes flipping around from explosions, and that kind of stuff. Some aspects of the game's environments blow up good, and there's another neat effect in how trees shake wildly, shedding their leaves from the violent impact of nearby blasts. The levels look pretty, though the designs aren't very imaginative, for the most part (a giant-sized level filled with giant-sized stomped-out cigarette butts stands out), and the enemies look purposely absurd. The game's grainy cutscenes seem like they could have easily been rendered in real time using the game's engines, but they probably weren't to cut back on loading times, which aren't bad. As for the audio in Serious Sam II, it tries too hard to be silly. Some of it's great. Sam's guns are plenty loud, and his gruff voice is perfect for a generic action hero. But the nonstop babble of the occasional friendly villagers you'll run into, as well as some other specific sounds (like a gratingly unfunny voice that announces when you've earned an extra life, which is often), can be annoying. The music matches the game's lighthearted theme well but picks up tempo and drops off abruptly whenever enemies appear. A cooperative mode is the only multiplayer option available in Serious Sam II, and while games like this can certainly be more fun if you play them with friends, the co-op mode doesn't do anything to fix Serious Sam II's shortcomings. Fans of Serious Sam will enjoy some aspects of being in Sam's red sneakers again, and the game's goofy humor and corny references to other first-person shooters do give this game a distinct personality. But while the action will keep you on edge, it rarely achieves the sort of teeth-grinding, fist-clenching intensity that you'd expect if you played the original Serious Sam games or are otherwise looking for a totally satisfying no-nonsense shooter."}