{"ref": "https://www.gamespot.com/reviews/fifa-22-review-tiki-taka/1900-6417748/", "date": "September 29, 2021", "game_name": "FIFA 22", "text": "FIFA 22 opens on a close-up shot of a steaming-hot cup of coffee, before panning out to reveal that it's David Beckham stirring the teaspoon. The former Galactico is enjoying some breakfast pancakes on a Parisian balcony, while a few doors down your avatar is being woken up by a friend telling them that they're late. It's a bizarre opening to a football game that also features Eric Cantona feeding pigeons, Thierry Henry and cover star Kylian Mbappe attempting to act on the Parc des Princes pitch, and blink-and-you'll-miss-it cameos from boxing star Anthony Joshua and F1 driver Lewis Hamilton. What's the point of all this, you might be asking? Well, it's all for an elaborate tutorial, of course. This lavish opening might have more style than substance, but it ushers in what feels like a new era for FIFA, as next-gen technology and a shift in tempo combine to significantly improve the on-pitch action.During the opening tutorial, you'll learn how to sprint and dribble by darting past coffee tables on the streets of Paris, then cover the basics of attacking and defending under the guidance of both Henry and Mbappe. Running through these fundamentals will be useful for series newcomers, but it's an odd way to kick off the latest version of FIFA for everyone else. That's mainly because it only shows off one new feature: the ability to switch to a specific defender by pressing in both thumbsticks. Player switching has been overly cumbersome in the past, so it's nice to have a reliable way to take control of the best-placed player without having to scroll through each backtracking defender until the cursor lands on the right one. The only problem with this is it's still not quite fast enough in the most hectic moments and ends up feeling redundant as a result. The rest of the tutorial, meanwhile, consists of features that were introduced in last year's game, like being able to influence AI runs by telling your teammates which direction to head in.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: FIFA 22 Video ReviewFIFA 22 doesn't introduce any mechanical additions such as this, but that doesn't mean it rests on its laurels and fails to move the series forward. Instead, it's the inclusion of innovative new technology, and a more considered pace, that iterates and improves on the series' core gameplay. HyperMotion is the fancy marketing term for this new technology, but it's more than just simple jargon. By using Xsens MoCap suits, HyperMotion allows the developers to use motion capture on all 22 footballers in a real-life match. Previously, EA would utilize motion capture to record specific movements, whether it's a player striking a ball or lunging in for a tackle. By capturing a full 11v11 match, all of that authentic movement is implemented and immediately palpable in FIFA 22, both at an individual and team level.With every minute detail being captured--including context-specific actions you maybe wouldn't think of in a traditional motion capture session--FIFA 22 adds a plethora of new animations that impact every phase of a 90-minute match. You'll see players take additional touches when controlling the ball to create an extra yard of space or to pluck a high pass out of the sky, before positioning their body to ping a diagonal ball to the opposite wing. Forwards will reduce their stride and take smaller steps before hitting a shot on goal, and opponents will outmaneuver each other in an attempt to dominate their aerial duel. All of this not only makes each moment and interaction look as believable as the games we watch on TV and in stadiums every week, but it also ensures that FIFA 22 feels more fluid by having each animation naturally flow into the next without any noticeable seams in between.As a result, FIFA 22 is a noticeably slower game than its predecessor. It's not quite as responsive, but it doesn't need to be because you're not zipping the ball around at 100 miles per hour. Matches in FIFA 21 often resembled the back-and-forth nature of basketball games, with the ball rapidly moving from one penalty box to the other. There isn't a lack of goals in this year's game; they're just created through slick passing moves rather than by exploiting the fastest players on the pitch.Pace is still a valuable asset, yet it's not the be-all and end-all of your attacking threat. FIFA is a better and more balanced game when speed doesn't dominate the meta as it has in years past. Harry Kane might be one of the best strikers in the world--with his 90 rating reflecting that--but finding anyone who actually used him on Ultimate Team in FIFA 21 is a challenge. That shouldn't be the case in FIFA 22, as slower strikers are now viable options to lead your frontline. Robert Lewandowski might not be as fast as someone like Anthony Martial, but he makes smarter runs, gets into better positions, and is a lethal finisher. Martial is still a decent player to have, but his pace doesn't trump everything Lewandowski brings to the table, even if the latter is slower off the mark.It's more accurate to real-life football and more satisfying as a result. You're rewarded for being patient and methodical in your build-up play, but crosses are now a useful tactic if you have a striker who's strong in the air and adept at peeling off their marker. You're not outmatched in defense either, though. HyperMotion also has a tangible effect on team shape, with players able to move as one cohesive unit. The backline will maintain its shape while holding midfielders keep their position in front of the defensive unit, making you tougher to break down if you opt to play this way. With new, more varied tackling animations--plus the fact you're more likely to come away with the ball after a successful tackle--defending can be just as enjoyable as attacking. Goalkeepers aren't a liability behind you either, which helps. They're not infallible, but they pull off a more expansive array of saves and aren't so easily beaten by shots across the face of goal. Finesse shots from outside the box do give them issues, however, and could do with a tweak so they're not quite as effective.In terms of game modes, FIFA 22 has taken a page out of PES' book and added a couple of sentences of its own. You're now able to create your own team in Career mode, from customizing the kits and stadium to deciding whether your team of randomly generated players is more youthful or experienced. You can replace an existing team in any division and choose your overall star rating before tweaking the board's expectations to your liking. It's a neat idea that feels long overdue, considering how long Master League's been around; it's just difficult to enjoy using a squad of nobodies compared to taking over a real club with household names.Volta Football, meanwhile, is getting closer to resembling the original FIFA Street, moving further away from realism. Each player now has one of three supernatural abilities they can unleash during a match to tap into the mode's arcade sensibilities. Power Strike makes your shots super-powered; Pure Pace gives you a boost of turbo speed, and Aggressive Tackle lets you plow through opponents to win the ball back with relative ease. It's not quite as over-the-top as FIFA Street, but it's edging closer. There's no story this time either, so you're left to either play games against the AI to earn XP and unlock customization options, or play with other people in Volta Squads. The latter is better with friends unless you enjoy playing with a bunch of strangers who refuse to pass the ball to anyone ever.Volta's best new addition is only available on the weekends, for some confounding reason. Volta Arcade introduces a variety of party mini-games that revolve around a particular skill. Lava Disco, for instance, tasks you with capturing white tiles on a dancefloor by dribbling through them, while Wall Ball Elimination gives you a time limit to kick the ball against a giant wall when it's your turn. Fail to do so and you're eliminated, which means everyone else is frantically trying to stop you. There's also Dodgeball, Foot Tennis, and plenty more of these frantic party games. It's just baffling that you can only play them during the weekend.Pro Clubs has also received some notable new additions after years of neglect. None of it is groundbreaking, but a slightly altered progression system that includes perks and player archetypes makes it easier to build a player that's unique to you, and you can finally play as a woman this year, too. The other changes are cosmetic, letting you customize your team's home stadium with Tifos, goal songs, crowd chants, and more.Ultimate Team will still be the major timesink for most players, though, and in FIFA 22 EA has made a few incremental changes to its successful formula. The framework for Division Rivals has been altered to make it more accessible for players of all skill levels. The rewards you receive aren't quite as good as previous years, which could drive players to the game's microtransactions, but a forgiving checkpoint system ensures that you can't lose progress after reaching a reward tier. However, it is deflating that you don't earn instant rewards for gaining promotion.Playing FUT Champions is still the best way to earn the biggest rewards and has been tweaked this year, too. After qualifying for FUT Champions via Division Rivals, you're placed into a new playoff stage that you can play any time throughout the week. Rather than having to rack up wins, you earn four points for each win and one point for each loss. Eight points are enough to reach the first reward tier but you need 24 points from nine matches in order to qualify for the finals. Once you've done that, it reverts back to the old weekend league format, except it still uses the same points system as the playoffs, and there's only a 20-match limit compared to the previous 30. This makes FUT Champions easier to digest and alleviates a lot of the stress, since you're still making progress even if you lose.Pay-to-win microtransactions are still front and center throughout Ultimate Team, despite mounting pressure from regulators, and it's difficult to ignore. FIFA 22 doles out a lot of rewards without forcing you to spend a penny, but you're unlikely to see a lot of the players--especially the Icons--without filling up EA's pockets. Limited-time preview packs let you check what's inside a pack before buying, but this only applies to a single pack that refreshes once every 24 hours. This year, in particular, it feels like the developers are trying to make Ultimate Team fairer and less exploitative, but microtransactions aren't going away any time soon unless forced to by law.FIFA 22 is a fantastic football game once you step out onto the pitch, with a realistic and methodical style that rewards passing and vision over the exploitation of cheap pace merchants. EA has a habit of changing things for the worse with each new update, so hopefully, these strong foundations can remain intact throughout its life cycle. Off the pitch, there isn't anything quite as impactful, but minor changes and new additions make game modes like Volta and Career more fun to play, and Ultimate Team is a more accessible experience that's nonetheless still burdened by its microtransactions. There are few better feelings in sports games than being able to string together an aesthetically pleasing passing move that ends with the ball in the back of the net, though, and for that reason FIFA 22 is a worthwhile upgrade."}