{"ref": "https://www.gamespot.com/reviews/nba-2k3-review/1900-2885214/", "date": "October 10, 2002", "game_name": "NBA 2K3", "text": "NBA 2K3 for the Xbox is essentially the ultimate version of an already great basketball simulation. From posting up in the paint to running screens and freeing a man up for the open jump shot, just about every aspect of NBA 2K3's gameplay mechanics will give you a true taste of professional basketball. Those looking for a fast-paced run-and-gun-style game might not find it here, though, because NBA 2K3 simply places more emphasis on the half-court game, making it seem like an exacting simulation of the sport. An in-depth franchise mode gives you even more freedom to build your team, and with excellent online play supported through Xbox Live, NBA 2K3 stands as an ideal choice for serious basketball enthusiasts. Like other games in Sega's 2K3 series, NBA 2K3 features the new ESPN interface and an enhanced franchise mode. Of course, all the basic options are still there--you can trade players, sign free agents, and pore over your roster, all of which will help you put together a competitive team before the season begins. When it does start, you can access all kinds of statistics for teams and individual players, including information on the leaders in specific categories and which rookies are doing well. You can also monitor the All-Star voting ballots. Based on all this information, you can then decide whether you want to try to trade for another player through traditional means, which entails direct negotiation with another team, or take a less proactive approach by putting your players on the trading block to see what kinds of offers you'll receive from other teams. If you're playing with a top-notch team, these options are obviously not as enticing as they would be for a team that's down on its luck and trying to build a solid franchise, but over the course of the season, some of your players may fall victim to various injuries, forcing you to look for a suitable replacement if you don't have one on your bench. At the end of a season in franchise mode, the league will hand out various awards, such as Rookie of the Year, Sixth Man, and Most Valuable Player, and it will also name its All-NBA first team, All-NBA second team, All-NBA third team, and All-NBA defensive team. More importantly, you'll also see which players are retiring and which players are eligible for free agency, two things that can really impact your team. If you don't feel like keeping or pursuing a high-priced free agent, you can focus all your attention on the draft, which allows you to get surprisingly detailed information on each player entering the draft, down to the player he most closely mimics in the NBA. If you want to get an even better idea of an individual rookie's skills, you can schedule workouts for prospective draftees, though the number of workouts you can hold is limited by the amount of money you're willing to spend on the draft process. Eventually, you'll reach a point in the off-season when you can start training players, and one of the more interesting aspects of this particular feature is that you can train a player in one of several different specific categories, ranging from post defense to perimeter offense. The whole off-season process can seem a little intimidating, but anyone who isn't willing to put up with the gobs of information being thrown around can let the computer do most of the work. In fact, if you don't particularly care about constructing a franchise or you want to avoid off-season high jinks altogether, then NBA 2K3 offers several other modes to choose from. There's a street basketball option that allows you to play a game of two-on-two or five-on-five without any refs on some of the most well-known street courts in the country. It even lets you adjust the weather and the time of day, so you could play in a downpour in the middle of the night, if you were so inclined. There are also season, playoff, and tournament options, so you can play through a single season, jump right into the playoffs, or set up a custom tournament. NBA 2K3 also features a practice mode, in which you can hold a friendly scrimmage against another team, practice free throws, or get the timing down on your shots. Online play through Xbox Live isn't handled via a lobby system as it is in other games. Instead, the game will automatically try to match you with another player, seemingly based on your connection speed (if you select the quick match option). There's another option that lets you set the parameters for a game and then wait for someone to join. You can also add other players to a friends list, which makes it easy to challenge them whenever they're online. As far as actual games go, we experienced basically no lag at all in a majority of the games, and the Xbox Live communication feature (which has a single voice mask) worked very well. Of course, Xbox Live is still in beta, so it remains to be seen how the game will perform when the service is launched in November. The game itself will be ready to go online as soon as the service is. As fine-tuned as you think your stroke might be, it doesn't seem to matter sometimes in NBA 2K3. You'll undoubtedly vocalize your frustration when you see your star point guard miss three lay-ups in a row or one of the best post-up men in the league miss three or four shots taken 5 feet away from the basket. This doesn't necessarily depend on whether the player in question is hot or cold, because your entire team seemingly goes cold at once. Incidentally, this particular problem mostly springs up when your team has pulled ahead, so in essence, it's the equivalent of the rubber-band AI used in some racing games--to keep the score close, the game puts an invisible handicap on your players. Unfortunately, that still doesn't explain why some shots don't go in even when the score is close. It would've been preferable to have the defending team step up its defense, but in this case, you'll simply miss shots that players in the real world would rarely miss. The odd shot-percentage system is annoying, but it can inadvertently motivate you to play better on offense and make sure that your player has a completely open shot. Thankfully, you'll have a number of weapons at your disposal to do just that. When you have the ball, your player can perform a number of juke moves, such as spins or crossovers, that will occasionally let you get past a defender for an easier shot. Also, NBA 2K3 introduces a new ball-fake move in which you can fake in one direction and then immediately go in another, increasing your chance of blowing by the defender. It works quite well, particularly when driving to the hoop, because defenders will scramble into the paint to block your shot, only to cause a foul. This move can be a little difficult to execute with the stock Xbox controller because of the button placement, but you'll eventually get used to it. Online play works incredibly well through Xbox Live. Another addition to NBA 2K3 is the midair adjustment. If you're a point guard driving through the lane and you see a center coming over to block your layup, you can adjust the shot in midair so the defender will miss the ball completely. It's pretty cool looking and works well against opponents (particularly when controlled by humans) who like to have a big man waiting around the basket. The post-up game is still really solid. When your player goes into the post, you can try to back the defender down and get as close to the basket as possible before turning around for a quick jump shot, or you can put the ball on the ground and try to dribble to the basket with your shoulder driving into the opponent. The latter option doesn't always work that well for a straight dunk or layup because the animation is so slow that it gives plenty of time for another defender to come over and double, but it's usually good for getting closer to the basket. In addition, sometimes it feels like your player will get stuck to another player when trying to drive to the basket in such a manner, resulting in an annoying break with realism and some choppy animation. If there's one area where NBA 2K3 could use some more work, it's the passing game. As in previous games in the NBA 2K series, the default method is still incredibly inaccurate, so much so that your players will occasionally pass the ball in the direction opposite the one selected with your controller input. However, the icon passing system is still intact, and you can use the right analog stick to pass if you don't want to stop just before passing the ball. Whether you're playing zone or man-to-man, playing the passing lanes is absolutely crucial on defense. The easiest way to steal the ball in NBA 2K3 is to put a defensive player's body directly between two offensive players. One of the opposing players will try to pass the ball to the other one, but since you're in the way, your player will steal the ball. The same applies to fronting on post players--simply use a guard to double-team the opposing team's post-up player, and you'll increase your chances of stealing the ball dramatically. It might seem like steals would occur frequently since the passing system can be inaccurate at times, but surprisingly, they don't. NBA 2K3 on the Xbox is hands down the best-looking version of the game. The player models look a little smoother and just generally better than those in other versions, and Visual Concepts has also added a special effect that makes it look as though the players are sweating while playing. But again, it certainly looks as though Visual Concepts spent more time on relatively high-profile players, because some of the lesser-known players aren't quite as accurately modeled. Some visual improvements have also been made to the environments--an entire first row in the bleachers is modeled with polygons, and fully modeled mascots and cheerleaders hang around the basket (though, unfortunately, not every mascot is represented). It's also worth noting that the replays in the Xbox version feature some nice special effects. For example, you'll see the entire screen in black and white with the exception of the ball, which retains its color--it's a small touch that enhances the overall presentation of the game. Visual Concepts has added some visual enhancements to the Xbox version, such as specular highlights that mimic sweat. The series' audio components, which support Dolby 5.1, have also been refined for NBA 2K3. The commentary in the game is very smooth, and rarely do the play-by-play and color commentary sound robotic. Plus, the two announcers make some rather insightful comments on the action transpiring on the court. There is a little repetition when certain types of plays are involved, but the announcers repeat themselves far less frequently than in previous games in the series. NBA 2K3 is a great simulation of basketball, so any Xbox owner with an interest in the sport couldn't go wrong with it. The half-court elements of the game are executed particularly well as you'll see when trying to break down the defense by going into the post, driving through the lane, or setting up a perimeter shot--it all adds up to gameplay with real depth. The game does have a few shortcomings, but they're not the sort that dramatically hinder gameplay; rather, they encourage you to play NBA 2K3 as a pure simulation. The odd shot-percentage system is annoying, but it can inadvertently motivate you to play better on offense and make sure that your player has a completely open shot. Thankfully, you'll have a number of weapons at your disposal to do just that. When you have the ball, your player can perform a number of juke moves, such as spins or crossovers, that will occasionally let you get past a defender for an easier shot. Also, NBA 2K3 introduces a new ball-fake move in which you can fake in one direction and then immediately go in another, increasing your chance of blowing by the defender. It works quite well, particularly when driving to the hoop, because defenders will scramble into the paint to block your shot, only to cause a foul. This move can be a little difficult to execute with the stock Xbox controller because of the button placement, but you'll eventually get used to it. Another addition to NBA 2K3 is the midair adjustment. If you're a point guard driving through the lane and you see a center coming over to block your layup, you can adjust the shot in midair so the defender will miss the ball completely. It's pretty cool looking and works well against opponents (particularly when controlled by humans) who like to have a big man waiting around the basket. The post-up game is still really solid. When your player goes into the post, you can try to back the defender down and get as close to the basket as possible before turning around for a quick jump shot, or you can put the ball on the ground and try to dribble to the basket with your shoulder driving into the opponent. The latter option doesn't always work that well for a straight dunk or layup because the animation is so slow that it gives plenty of time for another defender to come over and double, but it's usually good for getting closer to the basket. In addition, sometimes it feels like your player will get stuck to another player when trying to drive to the basket in such a manner, resulting in an annoying break with realism and some choppy animation. If there's one area where NBA 2K3 could use some more work, it's the passing game. As in previous games in the NBA 2K series, the default method is still incredibly inaccurate, so much so that your players will occasionally pass the ball in the direction opposite the one selected with your controller input. However, the icon passing system is still intact, and you can use the right analog stick to pass if you don't want to stop just before passing the ball. Whether you're playing zone or man-to-man, playing the passing lanes is absolutely crucial on defense. The easiest way to steal the ball in NBA 2K3 is to put a defensive player's body directly between two offensive players. One of the opposing players will try to pass the ball to the other one, but since you're in the way, your player will steal the ball. The same applies to fronting on post players--simply use a guard to double-team the opposing team's post-up player, and you'll increase your chances of stealing the ball dramatically. It might seem like steals would occur frequently since the passing system can be inaccurate at times, but surprisingly, they don't. NBA 2K3 on the Xbox is hands down the best-looking version of the game. The player models look a little smoother and just generally better than those in other versions, and Visual Concepts has also added a special effect that makes it look as though the players are sweating while playing. But again, it certainly looks as though Visual Concepts spent more time on relatively high-profile players, because some of the lesser-known players aren't quite as accurately modeled. Some visual improvements have also been made to the environments--an entire first row in the bleachers is modeled with polygons, and fully modeled mascots and cheerleaders hang around the basket (though, unfortunately, not every mascot is represented). It's also worth noting that the replays in the Xbox version feature some nice special effects. For example, you'll see the entire screen in black and white with the exception of the ball, which retains its color--it's a small touch that enhances the overall presentation of the game. The series' audio components, which support Dolby 5.1, have also been refined for NBA 2K3. The commentary in the game is very smooth, and rarely do the play-by-play and color commentary sound robotic. Plus, the two announcers make some rather insightful comments on the action transpiring on the court. There is a little repetition when certain types of plays are involved, but the announcers repeat themselves far less frequently than in previous games in the series. NBA 2K3 is a great simulation of basketball, so any Xbox owner with an interest in the sport couldn't go wrong with it. The half-court elements of the game are executed particularly well as you'll see when trying to break down the defense by going into the post, driving through the lane, or setting up a perimeter shot--it all adds up to gameplay with real depth. The game does have a few shortcomings, but they're not the sort that dramatically hinder gameplay; rather, they encourage you to play NBA 2K3 as a pure simulation."}