{"ref": "https://www.gamespot.com/reviews/tokobot-review/1900-6140850/", "date": "December 6, 2005", "game_name": "Tokobot", "text": "Since the peak of platformers in the late '80s and early '90s, the genre has steadily declined, as each successive entrant is less about platforming and more about action and attitude. Tokobot breathes new life into this staling genre with its innovative and interesting game mechanics. Though the package isn't quite perfect, the gameplay shines and platforming gets a much-needed kick back up the gaming ladder. You control Bolt, a junior Indiana Jones with a knack for finding things, like the Tokobots, a pack of tiny prehistoric robots. When the story begins, you are traveling through ancient ruins when you happen upon these miraculous creatures who take a liking to Bolt and begin to follow him around. You must then use the Tokobots to travel around the rest of the environment, uncovering their secrets and finding more of them before the local bad guys--who happen to be looking for the Tokobots as well--do. There's not too much to the story, and most of the time it's just worth skipping through the protagonist/antagonist banter. But the gameplay is unique and entertaining, and it's exemplary of some of the best platforming, on any system, in quite some time. Given that the Tokobots are prehistoric, it's surprising that they take platforming to the next level. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tokobot Video Review The game mechanics are built upon the three Tokobot formations, which are used to navigate through the environment and fight enemies in different ways. Holding the right trigger is called ~jointing,~ and no matter which formation the Tokobots are in, they'll all join hands together, and with Bolt, to enable ~joint actions.~ There are a series of standard joint actions that can be made from the three formations, and throughout the game you'll find additional ones, as well as ~Karakuri combinations,~ which are alternate forms for the Tokobots to take. In ~U formation,~ the Tokobots line up in a horizontal line on either side of Bolt. Jointing while in U formation lets you spin the Tokobots around like a pinwheel, with Bolt as the axis. The spinning motion hits enemies on their sides, and it can be used later on to glide from one platform to another. In ~V formation,~ the Tokobots line up directly behind Bolt. Jointing while in V formation enables the Tokobots to be launched from behind Bolt, over his head, and then down on top of enemies in front of him. If the throw is done in front of specifically marked platforms in the environment, the Tokobots will grab the platform, and Bolt will be able to use the Tokobots like a ladder to climb up onto it. In ~circle formation~ the Tokobots will gather in a circle around Bolt and can be used to stomp on both ground triggers and enemies. These few actions make up most of the puzzle-solving in the game, as you must find ways to use and combine these actions to progress through each area. Though the majority of the gameplay consists of navigation, there's some basic combat and a number of boss battles. The standard enemies are quite simplistic, and you'll be able to tell immediately which attack will be effective against them (usually due to the placement of large spikes either on their heads or sides). What's more interesting are the boss battles, which require a couple of joint attacks in succession to win. Figuring out the correct combination of joint actions is as entertaining in the boss fights as it is in the level navigation, and it's the variety and skill required to execute these maneuvers that makes the gameplay so interesting. At the end of the boss fights, you'll uncover additional Tokobot slates, which reveal new Karakuri combinations. While some of the combinations give you additional jointing actions (such as the swinging form, which allows you to use the Tokobots to swing from one beam to another), others create entirely new forms for the Tokobots to take. To take on forms, you'll need to unlock them and have enough prehistoric parts to make them. Prehistoric parts are the game's standard pickup, and they can be found on dead enemies or in breakable objects like crates and vases. There are three different colors of prehistoric parts, and each Karakuri combination requires a different amount of each of them. As long as you continually pick them up along the way, you'll always have enough parts to make the Karakuri combinations you need. But the more you get, the more frequently you can use them. The combinations serve two purposes, one of which is for better methods of attack, like the mega-hammer or the supertank. Calling upon these forms will assemble the Tokobots together like Voltron, and for a limited amount of time you'll be able to fight without any risk to your health. Of course, the more damage you take, the more quickly you lose the form, so it's still wise to play carefully. The other purpose of the combinations is for them to be used for very specific activities, like the crane-o-matic, which is for crane-shaped icons to pick up items and move them. It's never unclear what you need to do to progress, so you can focus on the importance of execution over discovery, which is a tribute to the game's learning curve. Execution is sometimes the most challenging aspect of this otherwise simple game. There are a few different environments that you'll switch between, but all of them have the same archeological ruins theme. The appearance of these levels aren't terribly varied, but the graphics work very well, both to display the game's charm and in giving a fair amount of detail. You'll be treated to lighting effects in both the indoor and outdoor environments, and a high amount of detail on the backgrounds and characters. The Tokobots all look identical. Some of the enemies are fairly simple, but you'd think robots created in the prehistoric times would have to be at least somewhat simple. The soundtrack consists of music appropriate to the levels, getting more sinister during boss battles, but generally very light and catchy. However, at times it's a little too catchy and on a little too short of a loop. There are sound effects for nearly every activity, and these effects are the game's best audio achievement. When the characters interact, their avatars will pop up in the foreground of the screen. The drawback, though, is that there's no voice acting beyond Bolt's Link-esque grunts and yelps. Though the gameplay is entertaining, it's a little too linear. It doesn't work against the game that much, especially since it's important to not have too many choices when you're trying to figure out a puzzle (so you'll stay and figure it out, instead of looking for an alternate route), but it does remind you of its fairly narrow scope. The few things that the game attempts to do, like giving you a unique way of approaching and executing platforming, are done very well. But had it been longer or had there been alternate modes, the game would have been that much greater."}