{"ref": "https://www.gamespot.com/reviews/street-fighter-alpha-anthology-review/1900-6152658/", "date": "June 12, 2006", "game_name": "Street Fighter Alpha Anthology", "text": "To say that the success of Street Fighter II and its upgrades was a tough act to follow would be a gross understatement. Back in the early '90s, you couldn't walk into a convenience store or video arcade without hearing the telltale sounds of Capcom's legendary fighting game. Faced with the demand for new installments in the series, Capcom did something smart: The company created a prequel, 1995's Street Fighter Alpha (or Street Fighter Zero, as it was more intuitively named in Japan). The game featured its own anime-inspired look, new play mechanics, and a number of classic Capcom characters, including younger versions of some of Street Fighter II's favorites. While diehard SFII players scoffed at these changes and never grew to like the Alpha series as much as the SFII games, the Alpha series earned its own dedicated following. Now all three Street Fighter Alpha games are available in arcade-perfect form together on one disc. It's missing a few of the extras added to home versions of Alpha 3, and you can't play it online, but it's still a great package for fighting-game fans. After all, these games are still good looking and fun to play. The Street Fighter Alpha series is more than 10 years old, but these games are still good-looking and challenging today. Street Fighter Alpha Anthology features five games: Street Fighter Alpha (1995), Street Fighter Alpha 2 (1996), Street Fighter Alpha 2 Gold (1996), Street Fighter Alpha 3 (1998), and Super Gem Fighter MiniMix (1997). Chances are you're already familiar with most of these games, but a couple of them are relatively obscure. Super Gem Fighter MiniMix a cutesy fan-service project based on the superdeformed characters of the excellent Super Puzzle Fighter II Turbo, isn't a Street Fighter Alpha game but should be a welcome addition for just about anyone interested in this collection. It's deliberately easier to control than the Alpha games, requiring just three action buttons instead of six, but it's got its own unique twists and no shortage of sight gags and cameo appearances. As for Street Fighter Alpha 2 Gold, it's an upgrade to Alpha 2 that reintroduced Cammy to the roster and made some balance tweaks, but it's certainly not uniquely different from Alpha 2. Still, having at least three solid, fairly distinct fighting games in one set for a discounted price is a tempting deal. Street Fighter Alpha 2 is probably the highlight of the set. Back in the day, it added many new characters to Alpha's lineup (including some old SFII favorites), beautiful new background graphics, and lots more moves and variety. A couple of years later, Alpha 3 did some interesting things to the series, though certain gameplay changes (such as forcing players to push two buttons simultaneously for basic throws and recovery moves) never sat well with longtime Street Fighter fans. At any rate, all three of the core games in the Alpha series are sufficiently interesting and still fun to come back to, regardless of whether you play against the computer or a friend. Training, survival, and the two-on-one ~dramatic battle~ modes are also available to extend the lives of these games. But wait, there's more! Some hidden unlockable spin-offs for some of the Alpha games are thrown in here for good measure. Most notably among them is an updated version of Street Fighter Alpha 3, which added the few remaining Street Fighter II-era characters (Guile, T. Hawk, Fei Long, and Dee Jay) who hadn't already come back to the series as part of the original Alpha 3 roster. However, this update still is missing some of the extra features added to home versions of Alpha 3, such as the World Tour mode, which let you customize your fighter with new abilities as you won successive matches. Considering how comprehensive this package seems to be--it even lets you switch between different release versions of the games, which introduced balance changes that only hardcore players would notice--the absence of every Street Fighter Alpha 3-related variant is a little disappointing. The lack of online play also sticks out, not that online-enabled PlayStation 2 fighting games are a common sight. Three of these guys aren't actually in Street Fighter Alpha 2 Gold. Confusing, huh? At least they're in a hidden version of Alpha 3. Those caveats aside, Street Fighter Alpha Anthology delivers exactly what you'd expect: arcade-perfect conversions of some excellent 2D fighting games. Every last frame of animation seems to be in here, and you can tinker with a variety of display settings to get the game looking as sharp or smooth as you prefer. Loading times occur only when you boot up each game from the main menu (and they're brief even there). Once you get into a game, the action is as fast paced as ever. There are dozens and dozens of characters available across all of these games, including a lot of subtle variants to some of them, designed to play like classic Street Fighter II-era fighters, with no super moves or other fancy stuff. Visually, these games all still look surprisingly good, thanks to the care put into their hand-drawn frames of animation and colorful backgrounds, filled with cameo appearances. The original Alpha looks pretty bland compared to the later games, but considering Capcom went on to recycle Alpha's character graphics in seemingly dozens of subsequent games, it's still remarkable. Likewise, a lot of great-sounding speech clips, amusing textual dialogue for victory screens and endings, and other interesting details abound in these games. Your mind is probably already made up about the Street Fighter Alpha series, but even those fighting-game fans who aggressively disliked it for whatever reason would have a hard time denying its impact at this point. As for this new collection, it's a fine deal for Street Fighter fans, who'll probably find that these games still have that magic touch, whatever it was that made them so fun and addictive, even after all these years."}