{"ref": "https://www.gamespot.com/reviews/super-monkey-ball-banana-mania-review-fresh-and-a-peel-ing/1900-6417750/", "date": "September 29, 2021", "game_name": "Super Monkey Ball: Banana Mania", "text": "Super Monkey Ball Banana Mania is, at its core, a repackaging of the GameCube's Super Monkey Ball 1 and 2 (including a smattering of extra stages from the PS2/Xbox title Super Monkey Ball Deluxe) with a fresh coat of paint. The gameplay and stage layouts, with a few exceptions, remain the same as they were 20 years ago, but now in crisp and shiny high resolution. And, really, that would be fine on its own, as the engaging, pick-up-and-play charm of rolling a cartoon monkey around various imaginative challenges remains every bit as fun now as it was two decades prior.However, Sega has also seen fit to update elements of the gameplay to broaden Super Monkey Ball's already wide appeal. Gone are the lives and continues of previous Super Monkey Ball games, removing a source of pressure and frustration. Instead, you have infinite tries to work out each level, though you'll still need to restart from the beginning should your monkey roll out of bounds. You are also given the option of a Helper Mode system, which doubles your time, shows you an ideal path through the level, and enables a slow-motion feature should you choose to turn it on. It's a nice form of ~training wheels~ for getting a handle on some of the more difficult stages that doesn't go completely overboard in holding your hand--though the game pestering you about turning on Helper Mode on each stage you fall out of more than a few times grows old very fast.There's a catch to using the Helper Mode. In the older games, you'd need to complete a set of stages without using a continue to unlock the hidden EX levels. Since lives and continues are no more, Banana Mania instead rewards you with EX levels for completing a gauntlet of stages without the use of Helper Mode, encouraging you to finish those tough stages without additional assistance. Turning on Helper Mode also disqualifies you from the online leaderboard rankings and prevents the game from saving your score. It's a nice way to keep things from getting too frustrating while encouraging players to attempt a tougher challenge later.Besides Helper Mode, Banana Mania also provides players with other options to surmount some of Super Monkey Ball's more insidious challenges. An unlockable jump functionality gives you a precious bit of additional control over your character, though turning it on will also disqualify you from online rankings. An arrow cursor shows you which way you're tilting the analog stick, letting you know if that run you're doing isn't quite as straight as you think it is. Finally, if there's a level that is walling you from progress, regardless of how many helper functions you enable, you can choose to skip it and move on--though you'll forfeit rewards in the process. Harsh, but sometimes it's preferable to just move along and come back later when you're not on tilt.Besides the visual overhaul and the quality-of-life enhancements, Banana Mania also comes with a smattering of unlockable goodies. Collecting bananas and clearing both stages and challenges will earn points you can spend to unlock game modes, characters, cosmetic flourishes, and other add-ons. New modes include reverse-stage mode, where you must roll back to the stage's beginning from the goal point, a ~Dark Banana~ mode where you have to navigate stages while dodging rotten fruit, and a ~Golden Banana~ mode where you collect all of the bananas in a set of levels. The mix of unlockable characters includes more monkeys and the main simian cast in goofy costumes, but also offers a fun selection of Sega cameos like Sonic and Tails, Jet Set Radio's Beat, and even Yakuza's Kazuma Kiryu.Party minigames have also featured heavily in previous Super Monkey Ball titles, and all of the favorites from Super Monkey Ball 2 are here from the start, including Monkey Target, Monkey Billiards, Monkey Dogfight, and Monkey Tennis--among numerous others. These party games can be played with up to four people, and each one includes a variety of options and game modes to enjoy. They're not just fleeting diversions from the main game, either--many of the party games are surprisingly robust and replayable while still maintaining the simplistic, easy-to-learn charm of the main mode. They're all excellent crowd-pleasers that don't take long to set up or play and have very broad appeal--though, sadly, they can't be played online.Between the hundreds of stages, the minigames, and unlockable modes, there's a lot packed into Banana Mania. Unfortunately, it does feel like corners were cut in some places. The story mode from Super Monkey Ball 2, which was told through in-engine cutscenes in the original games, has been replaced with awful, cheap-looking animations of still character cut-outs. SMB2's story wasn't exactly a narrative triumph, but the Banana Mania approach sucks out all of the silly charm the story once held. The Sega character cameos are also a bit underwhelming; while it's cute that the bananas are re-skinned to match the characters (Sonic collects rings, Beat collects spray cans, Kiryu collects Staminan bottles), they don't affect the gameplay in a meaningful way, nor do they have much in the way of unique animation or voiceover. And once you've unlocked all of the extra game modes and characters--which you'll likely do fairly quickly--you're left with rather unexciting options like clothing colors and ball designs to spend your banana bucks on.Banana Mania doesn't reinvent the wheel (ball?), but it doesn't need to. Having the ability to play classic Super Monkey Ball levels and minigames without having to drag your old consoles and CRT TV out of storage would be enough of a selling point on its own, but the additional gameplay tweaks and charming extras sweeten the deal quite a bit. If you're a longtime roller who's missed AiAi and his jungle buddies--or if you're a newcomer looking for an easy-to-learn action/puzzle game that will keep you busy for a good while--you'll want to take Banana Mania for a spin."}