{"ref": "https://www.gamespot.com/reviews/titan-quest-immortal-throne-review/1900-6167503/", "date": "March 15, 2007", "game_name": "Titan Quest", "text": "THQ and Iron Lore embraced the violent side of Greek mythology with last year's Titan Quest, a hack-and-slash role-playing game that charged you, as an anonymous Greek hero, with the task of combating the treacherous elder gods who had escaped their Olympian prison. While it was rife with mythological creatures and locales, it took more than a few cues from Diablo, the mother of all hack-and-slash RPGs. There are far worse games you could choose to crib from, but despite the game's sharp presentation, there were certain aspects of Titan Quest that felt unnecessarily antiquated. Titan Quest: Immortal Throne is an expansion pack that features an all-new high-level campaign with plenty of fresh gear, and it's a no-brainer for fans of the original. It also addresses some of the more cumbersome aspects of the original Titan Quest, simultaneously making that game more appealing to newcomers. Greece is going to Hades in a handbasket in Immortal Throne. Immortal Throne doesn't skip a beat following your defeat of Typhon at the end of Titan Quest. As you descend from Olympus, you find that the world is still in chaos and infested by monsters. So, you continue on your quest to figure out just what in the hell is going on. Turns out, hell is exactly what's going on, as much of Immortal Throne has you hacking and slashing your way through the surprisingly diverse underworld of Hades. You might assume that spending 10 to 15 hours fighting your way through Hades would mean a nonstop barrage of dank, dark dungeons. There's definitely plenty of foreboding areas in Immortal Throne, but there's also a good variety to the environments you'll fight your way through, from the sterling white marble of Rhodes to the flowing golden fields of Elysium. The game isn't shy about appropriating bits and pieces of Greek mythology as it sees fit, pitting you against the three Stygian witches who share a single eye and the three-headed Cerberus that guards the banks of the river Styx, while also having you interact with the sorceress Medea, as well as Greek heroes like Agamemnon, Odysseus, and Achilles. The experience hasn't changed much from the original Titan Quest. You'll take on a linear series of quests, clicking your way through hordes of bizarre monsters and pillaging their corpses for gold and gear. One of the biggest areas that plagued the pacing of Titan Quest was the way it handled item inventory. Enemies would drop trinkets, weapons, potions, and pieces of armor at an almost alarming rate, and it seemed as though you would only take a few steps before your inventory was full, forcing you to constantly teleport back to a town where you could sell off the unneeded gear to a vendor. If there was any gear you wanted to hold on to, but perhaps couldn't yet use, it just sat as dead weight in your inventory, forcing you to teleport back to a vendor even more often. Immortal Throne makes manifold efforts to alleviate these problems. First off, there's now an autosort option for your bags, making it easier and faster to squeeze the last bit of space out of your inventory. There's also a caravan system where you can offload any gear you want to hang onto but have no immediate need for, freeing up your personal inventory for all that loot. You'll still find yourself making ample use of the portal system, but these changes unquestionably speed up the action. There's loads of new gear to deck your hero out with in Immortal Throne, as well as some new types of items. You'll find one-use scrolls that can unleash devastating attacks and are especially handy against some of the boss characters you'll encounter. You'll also find recipes that you can take, along with the necessary ingredients, to new non-player characters called enchanters to create powerful artifacts. Immortal Throne introduces a new skill set as well, called the Dream mastery, which can infer some dark and menacing abilities that suit the generally shadowy tone of Immortal Throne, allowing you to bend time and space to your advantage and generate psychic attacks to damage your enemies. Some small but thoughtful changes improve the overall Titan Quest experience. The game's presentation doesn't appear any more technically advanced than the original Titan Quest, but it would seem that Iron Lore has gotten better at what it does, as Immortal Throne is a subtly better-looking game. The way the world is constructed seems more natural, there's less inconsistency with the textures, and the new spell effects for the Dream mastery look sinister. The musical score suits the game's mythological tone nicely, and though the battle sounds are good, their inherent repetition can still wear on you. Also, there's no shortage of voice acting in Immortal Throne. Quest givers and random NPCs will spout lengthy soliloquies about their plights if you let them, though you'll be subjecting yourself to some overwrought melodramatics when you really just want to go fight more demons. You'll have to have played all the way through the original Titan Quest to get the most out of Immortal Throne. Smartly, though, Iron Lore has integrated many of the changes introduced here into the original, which makes Titan Quest itself an easier game to recommend. This is still a pretty straightforward hack-and-slash RPG, but it's also a really good one."}