{"ref": "https://www.gamespot.com/reviews/far-cry-review/1900-6092042/", "date": "March 23, 2004", "game_name": "Far Cry", "text": "For almost a year now, the gaming world has eagerly anticipated the arrival of the next-generation wave of first-person shooters. These new games would finally begin to take advantage of the powerful graphical features that hardware companies have been incorporating into their video cards to deliver unprecedented visuals. But while we're still waiting to see the fruits of the labors of storied developers like id Software and Valve, Crytek, a relatively obscure German developer, has managed to beat everyone to the punch with Far Cry. In fact, Crytek almost delivers a knockout blow. Far Cry isn't just a stunning technical accomplishment. It's quite possibly the best single-player first-person shooter experience for the PC since Half-Life. Welcome to the jungle. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Far Cry Video Review In Far Cry, you play as Jack Carver, a guy who's been hired to sail a mysterious woman around the Pacific. However, Jack's ship suddenly comes under attack. After washing ashore on a tropical island, sans the mysterious woman, Carver must investigate his surroundings so that he can find her and eventually rescue her from an army of heavily armed mercenaries. From this point, you'll delve into a story that combines the epic adventure of Half-Life with the bizarreness of The Island of Dr. Moreau, along with a good, healthy mix of Jurassic Park-style tropical island creepiness. You'll explore facilities worthy of Half-Life's Black Mesa, battle it out with brutally tough opponents, and assault a volcano stronghold in a James Bond-inspired finale that also offers a nightmarish vision of hell. Without a doubt, Far Cry has the most advanced graphics seen in any PC game to date. Everything in this game looks amazing, and the level of verisimilitude is unprecedented. Jungles actually feature dense foliage that consists of trees, plants, and tall grasses, and this foliage is filled with birds and insects. Beaches have blinding-white sand, and the surf slowly laps ashore. The character models are some of the best we've ever seen in such a game, and they're richly detailed and animated. The game also incorporates real-time lighting and shading effects to a degree rarely seen before, so when you walk in the jungle, you actually see the shadows of overhead leaves flickering on your rifle. In some of the larger indoor levels, the shadows of oncoming opponents are projected in larger-than-life form onto walls. Intense heat blur from lava streams distort the atmosphere. And a near miss from an enemy rocket will black out your vision--as if you got the wind knocked out of you. You can't help but be pulled in by the sheer immersiveness of the game. During the many firefights in Far Cry, you'll go up against cunning opponents, such as mercenaries who know how to use cover. They'll run between cover while shooting at you along the way. The lushness of the jungle usually means that these engagements turn into cat-and-mouse affairs, where you slowly stalk your prey. The jungle is so dense, however, that you often can't see your enemies until you're practically right on top of them. Sound plays an important part in the game at these moments, because you can track opponents by their sounds, and they can track you by yours. You can throw a rock to create a distraction, and you can crawl around the jungle to make as little noise as possible. Stealth can play a critical role in the game at times, and one of the few complaints we have about it is that the enemy artificial intelligence seems to have a very low detection threshold. If you make the slightest noise, all the bad guys in the vicinity go to full alert, rather than investigating further. Black Hawks will be the bane of your existence. The sound effects in the game contribute heavily to the creepy atmosphere. For instance, you'll be working your way through a dark indoor level and you'll hear disturbing noises up ahead. Then someone you didn't realize was there will suddenly say something, and you'll jump out of your seat. In the jungle, birds will chirp overhead, and insects will buzz in your ear. When a helicopter approaches, you'll hear the thrum of the rotors getting closer and closer. You can eavesdrop on conversations by using the combination binocular-sound microphone featured in the game. These conversations tend to be enlightening because you can find out what the mercenaries are worried about or what's up ahead. The voice acting is corny in a way that fits in with the over-the-top action movie feel of the game. You can also use a variety of vehicles, including jeeps, hang gliders, and boats. However, these aren't as tightly integrated into the game as they could have been. For instance, jeeps are pretty much restricted to moving along on roads, because there's very little open country on the islands. You can get into some wild chase scenes, but driving around exposes you to detection, so it's usually better to go on foot, if you can. And it's certainly unnerving to see mercenaries using vehicles against you. In particular, Black Hawk helicopters will swoop over the jungle to hunt for you, and there are plenty of wild moments where you'll have to try to fight them off. And in homage to Half-Life, an Osprey can fly over, and mercenaries will rappel to the ground. At night, you can see the headlights of approaching vehicles, which gives you time to either hide or set up a hasty ambush. The game limits you to four weapons at a time, so like in Halo, there's a tactical element present that makes you weigh the positives and negatives of each weapon. All the weapons are taken from the real world, including the M4 carbine and the G36 assault rifle. It takes a bit of time to familiarize yourself with each weapon, especially since each has different characteristics, such as recoil. The G36 is hard to aim while firing, and the P90 submachine gun has a high rate of fire but does less damage. Hit location is also important. Headshots usually result in kills, while mercenaries have body armor that makes them resistant to hits to the torso. There is a rudimentary physics engine in the game that lets you knock over objects and hurls bodies in the air, but it's not as fleshed-out as it could be. For instance, a wooden crate will float in the water, but it won't shatter, even if you fire a minigun at it. You can drive vehicles from a third-person perspective, which is easier. Far Cry features a loading technique that's similar to the one used in Half-Life and Halo. There's generally one long load at the beginning of each chapter. Then the entire level, no matter how large, plays seamlessly after that. The game only pauses for a fraction of a second every now and then to autosave your progress. Otherwise, there's nothing that takes you out of your suspension of disbelief, so you always feel as though you're actually exploring a tropical archipelago. The game uses a checkpoint-style save system, so you can't manually save your progress. If you die, you'll start back at the last checkpoint, which only takes a few moments to load. The inability to quick save the game isn't as annoying as it seems, since the checkpoints are generally spaced within reason. However, there are a few moments where it feels like the checkpoints are few and far between, which can be frustrating when you die and have to restart. At any rate, publisher Ubisoft reports that a quick-save feature will be added in a downloadable patch for the game. The single-player campaign packs more than 20 hours worth of gameplay, which is an impressive amount in this day and age--when most first-person shooters feature campaigns that are half this length. And the developers manage to do this without making it feel like they're recycling themselves through the campaign. As you slowly uncover the plot, there's always something that will awe you, stun you, or scare you. Just when you think you've seen it all or you've gotten to the point where most games would end, the designers keep on going and up the ante even more. The multiplayer portion of Far Cry is competent but not nearly as spectacular as the single-player game. There are only three game modes--free-for-all, team deathmatch, and assault--as well as a limited number of maps for each mode. Moreover, all the maps are quite large in size, which means that if you only have a handful of players, then you'll spend a lot of time looking for someone to kill. You'll also spend a lot of time just moving around the map because sandy surfaces restrict your movement speed. Additionally, movement speed is reduced by the specific weapon you're carrying. There are a few vehicles in multiplay, but they're not too useful during combat. The jeep, for example, has an open-air driver's compartment, which means there's no protection at all from bullets. And there are not a lot of places to drive because the thick foliage and rough terrain limit vehicle usage mainly to roads. Some of the weapons also feel horribly unbalanced. For instance, the rocket launcher does a tremendous amount of splash damage, and the sniper rifle can dominate a match over long ranges. There are also a handful of other oddities in multiplay. Most notably, if you pick up a weapon of a certain class that you already possess, the new weapon disappears as though you picked it up, but you won't actually have it in your inventory. The lighting and shadow effects in the game are incredibly impressive. As expected, you're going to need to have some serious hardware to run Far Cry as it's meant to be played. While the game will run on lower-end machines, you'll have to tone down detail settings. And with older video cards, you won't get much of the graphical eye candy in the game. From our experience, we recommend a 2GHz machine with a DirectX 8.1 or 9.0-compliant video card. However, Far Cry could very well be the killer app people have been looking for to justify upgrading, because it looks that good. And, frankly, running the game with a lower detail level means you lose a lot of the jungle foliage, which reduces your level of immersion in the game. It should be noted that Crytek's execution is superb. Aside from the multiplayer quirks, we experienced no stability issues and no bugs. This is an impressive accomplishment considering the complexity and ambitious scale of the game. The potential for this technology is exciting. Not only do we expect third-party developers to license Crytek's engine to power their own games, but Crytek also includes editing tools with Far Cry, so modmakers will get to develop their own ideas. Far Cry is a stunning game in so many ways. It certainly raises the bar for graphics to new heights. And yet, it's not just a technology demonstration. In Far Cry, the graphics are just one of the ingredients that submerge you into the experience. The developers exhibit a growing sense of maturity throughout the game. It's as if they themselves were learning how to use the graphics engine in conjunction with the AI, sound, and level design to create a superior gameplay experience--one that starts out impressively and, for the most part, just keeps getting better. The result is an awesome thing to behold, and it's an even better thing to experience. The game limits you to four weapons at a time, so like in Halo, there's a tactical element present that makes you weigh the positives and negatives of each weapon. All the weapons are taken from the real world, including the M4 carbine and the G36 assault rifle. It takes a bit of time to familiarize yourself with each weapon, especially since each has different characteristics, such as recoil. The G36 is hard to aim while firing, and the P90 submachine gun has a high rate of fire but does less damage. Hit location is also important. Headshots usually result in kills, while mercenaries have body armor that makes them resistant to hits to the torso. There is a rudimentary physics engine in the game that lets you knock over objects and hurls bodies in the air, but it's not as fleshed-out as it could be. For instance, a wooden crate will float in the water, but it won't shatter, even if you fire a minigun at it. You can drive vehicles from a third-person perspective, which is easier. Far Cry features a loading technique that's similar to the one used in Half-Life and Halo. There's generally one long load at the beginning of each chapter. Then the entire level, no matter how large, plays seamlessly after that. The game only pauses for a fraction of a second every now and then to autosave your progress. Otherwise, there's nothing that takes you out of your suspension of disbelief, so you always feel as though you're actually exploring a tropical archipelago. The game uses a checkpoint-style save system, so you can't manually save your progress. If you die, you'll start back at the last checkpoint, which only takes a few moments to load. The inability to quick save the game isn't as annoying as it seems, since the checkpoints are generally spaced within reason. However, there are a few moments where it feels like the checkpoints are few and far between, which can be frustrating when you die and have to restart. At any rate, publisher Ubisoft reports that a quick-save feature will be added in a downloadable patch for the game. The single-player campaign packs more than 20 hours worth of gameplay, which is an impressive amount in this day and age--when most first-person shooters feature campaigns that are half this length. And the developers manage to do this without making it feel like they're recycling themselves through the campaign. As you slowly uncover the plot, there's always something that will awe you, stun you, or scare you. Just when you think you've seen it all or you've gotten to the point where most games would end, the designers keep on going and up the ante even more. The multiplayer portion of Far Cry is competent but not nearly as spectacular as the single-player game. There are only three game modes--free-for-all, team deathmatch, and assault--as well as a limited number of maps for each mode. Moreover, all the maps are quite large in size, which means that if you only have a handful of players, then you'll spend a lot of time looking for someone to kill. You'll also spend a lot of time just moving around the map because sandy surfaces restrict your movement speed. Additionally, movement speed is reduced by the specific weapon you're carrying. There are a few vehicles in multiplay, but they're not too useful during combat. The jeep, for example, has an open-air driver's compartment, which means there's no protection at all from bullets. And there are not a lot of places to drive because the thick foliage and rough terrain limit vehicle usage mainly to roads. Some of the weapons also feel horribly unbalanced. For instance, the rocket launcher does a tremendous amount of splash damage, and the sniper rifle can dominate a match over long ranges. There are also a handful of other oddities in multiplay. Most notably, if you pick up a weapon of a certain class that you already possess, the new weapon disappears as though you picked it up, but you won't actually have it in your inventory. The lighting and shadow effects in the game are incredibly impressive. As expected, you're going to need to have some serious hardware to run Far Cry as it's meant to be played. While the game will run on lower-end machines, you'll have to tone down detail settings. And with older video cards, you won't get much of the graphical eye candy in the game. From our experience, we recommend a 2GHz machine with a DirectX 8.1 or 9.0-compliant video card. However, Far Cry could very well be the killer app people have been looking for to justify upgrading, because it looks that good. And, frankly, running the game with a lower detail level means you lose a lot of the jungle foliage, which reduces your level of immersion in the game. It should be noted that Crytek's execution is superb. Aside from the multiplayer quirks, we experienced no stability issues and no bugs. This is an impressive accomplishment considering the complexity and ambitious scale of the game. The potential for this technology is exciting. Not only do we expect third-party developers to license Crytek's engine to power their own games, but Crytek also includes editing tools with Far Cry, so modmakers will get to develop their own ideas. Far Cry is a stunning game in so many ways. It certainly raises the bar for graphics to new heights. And yet, it's not just a technology demonstration. In Far Cry, the graphics are just one of the ingredients that submerge you into the experience. The developers exhibit a growing sense of maturity throughout the game. It's as if they themselves were learning how to use the graphics engine in conjunction with the AI, sound, and level design to create a superior gameplay experience--one that starts out impressively and, for the most part, just keeps getting better. The result is an awesome thing to behold, and it's an even better thing to experience."}