{"ref": "https://www.gamespot.com/reviews/f1-career-challenge-review/1900-6070873/", "date": "July 2, 2003", "game_name": "F1 Career Challenge", "text": "With every successive release, Electronic Arts' popular Formula One franchise continues to build upon the same graphics and physics engine that was used to make the company's first F1 racing game for the PlayStation 2, F1 Championship Season 2000. Although the track environments have grown in realism over the years, the number of play modes available from the menu has steadily decreased. Last year's game, F1 2002, only gave you the option to participate in season, quick single-player, and quick multiplayer races--eliminating the domination and scenario modes that were once considered innovative additions to the standard array of play options. The latest installment in the franchise, F1 Career Challenge, is basically an enhanced version of F1 2002, giving you the opportunity to create your own driver and take him through all four of the previous F1A racing seasons that occurred between 1999 and 2002. The view above the cockpit is quite realistic, right down to the exhaust clouds thrown off by the cars in front of you. As the title implies, the career mode is the heart and soul of F1 Career Challenge. Your task in the career mode is to create a driver, join a team, and fulfill that team's goals throughout the following season. Initially, the team you sign up with is based on your performance in a series of nine different license tests, which are similar to those found in Sony's Gran Turismo series. During the season, your reputation will increase each time you meet or exceed your team's finishing goal for each track. Once your reputation reaches a certain level, you have the option to join a better-funded team. Ultimately, the goal is to become the top-ranked champion by the end of the 2002 season. All of the teams and drivers from the past four seasons of F1 are represented in the game. If you have played any of EA's F1 games in the past, you know what to expect. The controls are still as sensitive as ever--you'll need to learn how to lightly steer the car with the analog stick, since forceful directional inputs will yank your car completely off the track. Using the brakes requires some restraint as well. It's often impossible to steer through a corner if you're braking at the same time. If you haven't played previous installments in the franchise, you'll probably find the controls frustrating until you take the time to learn the light touch they demand. Car handling is on the realistic end of the spectrum. Accelerating too soon after letting up on the brakes can send the vehicle into a skid, and driving on the grass and sand sharply decreases your ability to steer. Throughout the course of a race, cars burn fuel and tires lose their grip, making the car lighter and more difficult to control. Each race is set at between six and eight laps, but you'll usually need to take a pit stop with at least two laps left in order to have enough fuel to finish the race. Although Electronic Arts already removed a fair number of features from its previous F1 game, the trend toward frugality has continued in F1 Career Challenge. You can modify the downforce, gear ratios, and brake response on your car in the career mode, but adjustments such as tire pressure, wing height, and transmission type are no longer available. Opponent difficulty, race length, weather, and damage settings can be modified in the quick race and multiplayer modes, but they're automatically chosen by the CPU in the career mode. Damage and CPU AI are forgiving during the 1999 season, but they increase to expert levels by the time you're midway through 2001. One aspect that's new in F1 Career Challenge is the ability to earn bonus points by overtaking other drivers and steering cleanly through turns. At the end of each race, you have the option to spend these points on goodies such as new helmets, engine and brake upgrades, nighttime races, and even pit babes. Pit stops are interactive. If you don't decrease the brakes, switch gears, and accelerate when prompted, you'll waste precious seconds. For the most part, the graphics and audio in F1 Career Challenge don't show much improvement over the other F1 games that EA has released within the past two years. The graphics engine has held up well over time, however, and a high amount of detail is visible on the cars and around the track. Whenever the cars in front of you peel out or veer off the tarmac, you'll drive right through clouds of exhaust or dirt. The reflection made by sunlight bouncing off the pavement or your car's nose cone is particularly impressive, since it waxes and wanes depending on your location on the course. The only significant problem with the game's graphics is the frame rate, which really stutters when there are too many cars visible at the same time. F1 Career Challenge slows down less often than F1 2002 did, but the problem is still evident during takeoffs and in turns involving more than four or five vehicles. The audio is quite clear and true to F1's subtle nature. There isn't any music to speak of. Instead, the soundtrack is composed entirely of the sounds of the engine, the squealing of the tires, and the radio chatter coming from the pit boss. All in all, F1 Career Challenge offers a realistic and satisfying representation of the sport of Formula One racing, but it isn't that much of an upgrade over any of EA's previous efforts. Nonetheless, it's worth picking up if you enjoy F1 and missed out on F1 2001 or F1 2002."}