{"ref": "https://www.gamespot.com/reviews/fantastic-4-review/1900-6128798/", "date": "July 8, 2005", "game_name": "Fantastic 4", "text": "Sadly, the days of the classic beat-'em-up are long gone. Every once in a while, however, a developer dares to take a stab at the genre made popular by games like Double Dragon, Final Fight, and Streets of Rage. Take Fantastic 4 for the Game Boy Advance, for example. While it may be just the latest in a never-ending litany of games intended to take advantage of the consumerism spawned by the release of a blockbuster movie, it also happens to be a solid entry in the ~beat up anything that moves~ genre. Alternate between all four members of the Fantastic 4 in this isometric beat-'em-up. The game's seven worlds (40 levels in all) are loosely patterned after situations from the film. Early on, the narrative focuses on the individual team members' struggles to come to grips with their newfound powers, which were given to them when a freak cosmic storm engulfed the space station where they were conducting scientific research. Ben Grimm becomes the rock monster known as ~The Thing.~ Reed Richards develops the ability to stretch his body like a rubber band and takes the nickname ~Mr. Fantastic.~ Sue Storm ends up with telekinetic powers and the ability to turn invisible, thus earning the moniker ~Invisible Girl.~ Last but certainly not least, Sue's brother, Johnny Storm, becomes the living fireball known as the ~Human Torch.~ Once all the introductions are done, later levels have the team assisting law enforcement with the thugs and various crime bosses that haunt the city before ultimately leading up to a confrontation with the group's archenemy, Doctor Doom. Players can switch between and control all four members of the Fantastic 4 throughout the game. Like the beat-'em-ups of old, Fantastic 4 is all about beating up wave after wave of recycled enemies and then taking on the boss waiting at the end of the level. Each member of the team has two basic attacks and three cosmic special moves, which are based on the characters' superpowers. The Human Torch can throw fireballs and breathe flames out of his mouth, for example. Each character also has a unique contextual ability that can be used in specially marked areas. Reed can hack into computers and stretch to bridge large gaps; Sue can move heavy objects with her telekinesis; Ben can reach up and tear down fire escapes and ledges; and Johnny can set objects on fire. Many of the objects in the environment can be smashed or picked up and thrown...by the good guys and the bad guys. One of the sweetest aspects of Fantastic 4 is that there's always at least one other member of the team fighting alongside you as a CPU-controlled partner. You can switch off and assume control of any of the other characters at any time by pushing the L button. Apart from the repetitive combat, the main thing wrong with the game is that it's too easy. The CPU-controlled opponents aren't very smart, even when they're tossing knives and grenades, and there are health refills and extra lives all over the place. Talk about ugly color schemes. At least the animation is smooth. Curiously, the graphics and audio, while they get the job done, aren't quite up to the level of quality you'd expect from a game based on a mega-million-dollar movie. The isometric levels are quite large, and they're packed full of objects to smash and throw. Unfortunately, the backgrounds don't show much in the way of detail, and many of the color schemes used to paint the backgrounds are downright ugly. A person can only take so much brown, light brown, yellow, and red. The character graphics are also not very colorful, particularly the enemies, which are often painted with two or three shades of the same color. The animation is extremely smooth, however, and the main characters are clearly recognizable. On the audio end, the inclusion of voice samples, such as Ben's ~It's clobberin' time,~ goes a long way toward making up for the utterly generic and forgettable nature of the music and sound effects. On the whole, Fantastic 4 for the GBA is a solid beat-'em-up and a respectable movie-to-game translation. Players that manage to forgive the relatively weak presentation will probably have a lot of fun with it."}