{"ref": "https://www.gamespot.com/reviews/kirby-64-the-crystal-shards-review/1900-2557948/", "date": "June 28, 2000", "game_name": "Kirby 64: The Crystal Shards", "text": "While much hoopla has been made about Nintendo's recent switch to providing games that span all age groups rather than just sticking to the younger set, Nintendo is still covering all the bases. Kirby 64: The Crystal Shards has that family-friendly gameplay that will make it a hit with kids and parents. But wait, that's not all - the gameplay is solid enough that just about anyone interested in platform gaming should come away satisfied. An evil force known as Dark Matter is attempting to steal a powerful crystal from the fairies of Ripple Star. The crystal is shattered into tiny pieces during the ensuing scuffle, and Kirby is enlisted by one of the fairies to help recover the shards of the crystal. The shards have conveniently been dispersed throughout the game's levels, and it's up to you to control Nintendo's smiling puffball in his quest to collect them all. The gameplay is your standard polygonal take on the 2D platformer - while you're merely walking to the left or right, the onscreen path will twist and turn, giving it an illusion of 3D. Kirby's flagship power - the ability to inhale any enemy in his path and copy its special powers - is, as usual, a major part of the gameplay. But rather than being limited to just one special power, you can now cough up your special power and throw it at another creature to create a power combo. Combining two special powers results in tons of different effects. Combining two like powers (such as a double dose of boomerang) generally heightens the effect of the singular power. But mixing two different powers is where the fun lies, resulting in powers such as turning Kirby into a lightning rod, giving him ice skates, letting him shoot volcanic rocks at enemies, and much more. Graphically, Kirby 64 has a nice, smooth look to it. The characters are well modeled, and the animation is extremely well done, lending the characters a very lifelike look. The entire game is extremely colorful, and it really jumps off the screen. The sound fits the colorful nature of the game perfectly, with lots of playful music and nice effects. The only real knock against Kirby 64 is that it isn't exactly a long game. Even if you're trying to collect every single shard, the game can be completed within a three-day rental period. A few extra options - such as collecting enemy cards throughout the game that can be used to view enemies in the gallery section, and a few Mario Party-esque minigames - have been thrown in for good measure. While some might be initially put off by the youthful nature of Kirby 64, the depth of the power combo system really brings a lot to what would otherwise be an average platformer. Nintendo 64 owners should definitely give this one a look."}