{"ref": "https://www.gamespot.com/reviews/praetorians-review/1900-6023333/", "date": "March 17, 2003", "game_name": "Praetorians", "text": "Some critics would say that real-time strategy games are formulaic; in most of these games, you gather resources, build up a base, create an army of military units as quickly as possible, and pummel your opponents before they can do the same to you. Over the years, developers have taken steps to simplify base building and resource gathering so you can spend more time fighting exciting battles. While it hasn't quite eliminated all aspects of building up an army, Praetorians does manage to put the focus of its gameplay squarely on battlefield tactics. The game is set in the glory years of the Roman Empire during Julius Caesar's time at the helm of the Roman army in Gaul. Developed by Pyro Studios, known for the Commandos tactical strategy series, Praetorians features plenty of strategic depth in its gameplay and is a great choice for real-time strategy fans who are looking for an unusual alternative to conventional strategy games. Pyro has equipped Praetorians with a 3D graphics engine that produces attractive results, even if it's somewhat limited. The maps include wooded regions of Europe, complete with areas of dense forest, tall grasses, streams, and rivers, and elevated plateaus. You'll even trudge through deserts, complete with dust storms. Flocks of birds and deer populate the battlefield, and you'll also see weather effects like snow flurries and rain from time to time. Unlike in most real-time strategy games, in Praetorians, you don't use or build individual units. Combat soldiers are organized into troops of up to 30; the disciplined armies of the Romans march in neat columns, while the more disorganized barbarians and Egyptians travel in unorganized groups. Praetorians lets you easily combine, divide, and even out the number of soldiers you have in each troop, so you can quickly fill out the numbers of a depleted battalion. If you look closely enough at your troops, you can see some minor graphical issues, such as the way mounted cavalry sometimes appear to be skating along the ground, but the unit animations do generally look impressive, especially when you see hundreds of legionnaires marching perfectly in step. Unfortunately, Praetorians' audio isn't quite as good; the in-game sound effects are adequate, but the between-mission cutscenes have rather poor voice acting. Praetorians also has a rather limited orchestral soundtrack, but at least it changes dynamically whenever you begin a battle. Controlling all these units is easy, thanks to Praetorians' simple interface. You select your troops by left-clicking on them, and you order them to move or attack by right-clicking on their destination, and the game even shows you the formation they'll take when they get there. You can also click and hold the right mouse button to set your troops' facing when they get to their destination (which is actually an important consideration in Praetorians). You can set nine control groups with your number keys, and you can also cycle through commanders, scouts, controlled towns, and special units using intuitively mapped function keys, though the game has an unfortunate tendency to place vulnerable physician and commander units at the front of marching columns, instead of in the middle or at the rear. About the biggest problem with Praetorians' graphics engine when it comes to controlling your armies is that it doesn't let you rotate the map. The game puts a great deal of emphasis on using terrain features, such as elevation differences and dense foliage, for tactical advantage, so not being able to rotate your view can be really inconvenient, especially when you're trying to see troops behind a small ridge. You can't easily zoom in either--Praetorians' camera lets you view the game only from four preset zoom levels, though since you'll usually play the game from the furthest zoom level, this isn't as much of an issue as the inability to rotate your view. Praetorians lets you play as one of three civilizations: the Romans, the Egyptians, and the barbarians (composed of German, Gallic, and Briton tribes). All three of the civilizations feature commander units. These commanders are used to occupy towns that you capture--the slowly regenerating populations of these towns are the game's only resource, which you draw upon to create new troops to add to your army. Commanders also have an ~aura~ around themselves that enhances the offensive and defensive capabilities of friendly units fighting nearby. This aura also lets commanders gain experience from any enemy units their troops defeat. The accrued experience increases the bonus given by the command aura. The game also has physician units, which can be brought onto the battlefield; they have a small healing aura that allows units to slowly regenerate lost hit points, even during a battle. The effects of a commander's and a physician's auras influencing troops during combat can turn an even fight into an overwhelming victory for your troops. Each side has standard troop types for this time period: archers, pikemen, regular infantry, and mounted cavalry, as well as a few special units to help differentiate them, such as the Romans' legionnaires, who are extremely effective in melee combat, and the Egyptians' Nubian archers, who have extremely long range. If you're a student of military tactics (or even if you're not), you'll find that Praetorians' battles are generally intuitive: Infantry are average in battle and move slowly; pikemen are effective against cavalry; cavalry are swift and can flank enemy troops (especially archers); while archers are good against anything, so long as they stay at range. However, Praetorians' strategic depth goes well beyond simple unit-to-unit countermeasures. Many of the units in the game have special abilities and formations that you can enable depending on the situation. For example, pikemen can be put into a stationary position that lets them dig their lances into the ground facing outward--this is an extremely effective tactic for holding off both infantry and cavalry charges. The legionnaires can go into a turtle formation, in which they use their huge shields to create a wall and ceiling over themselves, making them useful decoys for enemy archers. Though Praetorians features only 10 units per civilization (not counting the five siege engine types and two scout units shared by all three empires), the special abilities of the different units and the game's excellent use of terrain provide most of its strategic depth. As in most games, elevation gives advantages in the ability to see farther and, in the case of ranged units, to shoot farther, and it can also provide concealment from units who are approaching from lower elevations. Archers can hide in forests and shoot while hidden. Praetorians also makes use of forests and tall grassy areas. Units on the outside of a forest can't see into it, and infantry can lie down in grassy areas to hide. Both types of terrain make great places to set up an ambush or hide archers, although the grassy areas can be set ablaze by fire arrows to root out a possible ambush. With all the possible ways to get blindsided by a hidden enemy, you must make use of the special hawk and wolf scouts to safely explore higher ground and thick foliage ahead of your army. Since Praetorians has so many interesting tactical considerations, it's not an easy game to play, even in single-player matches against computer-controlled opponents. In fact, you'll find that computer-controlled opponents are quite good at exploiting holes in your defenses and formations. And Pyro Studios has combined this strong AI with a lengthy, well-designed 24-mission campaign, plus a skirmish mode for custom battles against one or more computer opponents on a large selection of custom maps. Even on the standard difficulty level, Praetorians is very challenging, and the AI tends to punish even small missteps in strategy, which makes successfully finishing each mission a satisfying experience. The campaign features a great array of mission types; the object isn't always to conquer every town on the map. For instance, one challenging mission requires you to defend a fort from a siege for 20 minutes. Fighting this battle with fire arrows against enemies with catapults and battering rams, all while using your spearmen to knock away assault ladders may remind you of the climactic battle scene from The Two Towers. In another mission, you'll race to the other side of the map to relieve an allied fort under attack. You can choose to veer off the path to pick up more allies to bring to the rescue, but you'll be taking the risk that the besieged fort will succumb if you waste too much time. Interesting strategic choices like these are common in the campaign. Archers automatically switch to fire arrows to try to set catapults and towers on fire. Praetorians is also playable online or on a LAN with a variety of multiplayer maps designed for two to eight players. However, you'll have to use a third-party application to find matches, and at this point, you may find that most Praetorians players are Spanish (Pyro Studios is itself based in Spain). Hopefully more players from other countries will help round out the multiplayer experience in the weeks to come. Praetorians would have been an even better game were it not for flaws like its limited camera options and its poor handling of multiplayer matchmaking, but thanks to its intelligent use of terrain and the strategic depth provided by its units' special abilities, Praetorians is an excellent choice for real-time strategy fans looking for a stiff and satisfying challenge. Resource management in the game is as minimal as it gets, so you can stay focused on combat. The challenging and lengthy single-player campaign and the tough AI will keep you busy for a long time, while custom skirmish modes and multiplayer capability add to the game's value. Though Praetorians features only 10 units per civilization (not counting the five siege engine types and two scout units shared by all three empires), the special abilities of the different units and the game's excellent use of terrain provide most of its strategic depth. As in most games, elevation gives advantages in the ability to see farther and, in the case of ranged units, to shoot farther, and it can also provide concealment from units who are approaching from lower elevations. Praetorians also makes use of forests and tall grassy areas. Units on the outside of a forest can't see into it, and infantry can lie down in grassy areas to hide. Both types of terrain make great places to set up an ambush or hide archers, although the grassy areas can be set ablaze by fire arrows to root out a possible ambush. With all the possible ways to get blindsided by a hidden enemy, you must make use of the special hawk and wolf scouts to safely explore higher ground and thick foliage ahead of your army. Since Praetorians has so many interesting tactical considerations, it's not an easy game to play, even in single-player matches against computer-controlled opponents. In fact, you'll find that computer-controlled opponents are quite good at exploiting holes in your defenses and formations. And Pyro Studios has combined this strong AI with a lengthy, well-designed 24-mission campaign, plus a skirmish mode for custom battles against one or more computer opponents on a large selection of custom maps. Even on the standard difficulty level, Praetorians is very challenging, and the AI tends to punish even small missteps in strategy, which makes successfully finishing each mission a satisfying experience. The campaign features a great array of mission types; the object isn't always to conquer every town on the map. For instance, one challenging mission requires you to defend a fort from a siege for 20 minutes. Fighting this battle with fire arrows against enemies with catapults and battering rams, all while using your spearmen to knock away assault ladders may remind you of the climactic battle scene from The Two Towers. In another mission, you'll race to the other side of the map to relieve an allied fort under attack. You can choose to veer off the path to pick up more allies to bring to the rescue, but you'll be taking the risk that the besieged fort will succumb if you waste too much time. Interesting strategic choices like these are common in the campaign. Praetorians is also playable online or on a LAN with a variety of multiplayer maps designed for two to eight players. However, you'll have to use a third-party application to find matches, and at this point, you may find that most Praetorians players are Spanish (Pyro Studios is itself based in Spain). Hopefully more players from other countries will help round out the multiplayer experience in the weeks to come. Praetorians would have been an even better game were it not for flaws like its limited camera options and its poor handling of multiplayer matchmaking, but thanks to its intelligent use of terrain and the strategic depth provided by its units' special abilities, Praetorians is an excellent choice for real-time strategy fans looking for a stiff and satisfying challenge. Resource management in the game is as minimal as it gets, so you can stay focused on combat. The challenging and lengthy single-player campaign and the tough AI will keep you busy for a long time, while custom skirmish modes and multiplayer capability add to the game's value."}