{"ref": "https://www.gamespot.com/reviews/valkyrie-profile-import-review/1900-2546102/", "date": "August 30, 2000", "game_name": "Valkyrie Profile", "text": "From Square's Final Fantasy to Enix's Dragon Warrior, RPG scenarios nearly always feature personal stories told against the backdrop of an unimaginable conflict. Tri-Ace's traditional RPG Valkyrie Profile, published by Enix, is no exception. But Valkyrie Profile raises the stakes, taking place against the backdrop of perhaps the largest conflict of them all: Ragnarok, the final confrontation between the Aesir gods and the Vanir gods. And you, Valkyrie Lenneth, are on the front lines. Norse mythology holds that Valkyries are female warriors responsible for ferrying the souls of the dead from this world to the next. In Valkyrie Profile, that's precisely what you do. The demigoddess Valkyrie travels around the world, entering the lives of heroes just before they die - or just after. The Valkyrie then takes their souls into her possession, where they fight alongside her in an attempt to find retribution. Each of the more than 20 characters that join your party is either deceased or immortal. With such heavy prerequisites for joining Club Valkyrie, it's not surprising that many of the game's engaging scenarios are filled with pathos, tragedy, and high drama. The story only loosely adheres to the original Norse myths: The one-eyed Odin is fully sighted and exceedingly youthful in this game, and Valkyrie Profile's Frey is definitely not a man. But considering how most Japanese RPGs ~respect~ other cultures' mythologies, this is mostly a nonissue. With a war going on in Valhalla, harvested souls can't hang around the lower world forever - Odin's army needs generals and foot soldiers. You'll distribute CP (character points) gained in battle to innate abilities such as tactics, leadership, attack power, and survival, as well as special skills such as first aid. Points can also be assigned to improve personality traits, making characters more heroic and thus more effective in battle. Once a character has been satisfactorily improved, Valkyrie can permanently transfer him or her up to the great battlefield in the sky. Rare artifacts found during your quest can either be kept or transferred to Valhalla. The quality of the characters and artifacts you choose to donate to the gods' cause determines the direction and conclusion of the game. Amassing an army for the coming war in heaven creates a feel similar to Konami's Suikoden. Unlike Suikoden, however, simply acquiring a character is not enough. Valkyrie Profile requires that you use and improve each character before sending them up. Moreover, Freya gives Valkyrie specific requests in each chapter; Valhalla may have need of a deft negotiator or a skillful archer. Satisfying these specific requests is critical to success. Balancing the Valkyrie's personal needs with those of the Aesir (once a character or artifact is sent up, he or she is lost to your party forever) makes for a unique and rewarding game structure. Yet, while the interplay between the Valkyrie and the Aesir is well handled, these elements are undermined by the game's peculiar handling of scenario choice and the passage of time. The game is divided into seven chapters, and each chapter contains 24 periods. New chapters mean the introduction of new characters, quests, and objectives. Nearly omnipotent, the Valkyrie has access to the entire world map at any time, and can challenge a chapter's quests in any order. Her ~soul concentration~ skill lets her hear the voices of those in need, giving direction as to where she should go next. There is usually enough time in a chapter for a focused player to complete all the possible objectives, but you still have the freedom to pick and choose which to complete. Periods pass whenever the Valkyrie enters or exits any location - not, as one might expect, when a task is completed. This odd design decision adversely affects the game in several ways. First, you're unable to learn anything substantial about a quest without entering the location where the quest begins. ~Refusing~ a quest is unlikely after the time penalty has already been incurred. Second, if you accidentally enter the wrong location, even for just a moment, periods still pass. Theoretically, the game's pace could be artificially accelerated to insane levels simply by repeatedly entering and exiting a single location. Third, you rarely have downtime in which to freely explore the towns or world. If you fall behind in levels or power, it is unlikely enough free periods will be available to catch up to where you need to be. If you hope to succeed, you must spend every available moment completing quests, fighting every possible battle, recruiting new characters, and improving current ones - Ragnarok waits for no woman. In short, Valkyrie Profile is a nonlinear RPG that discourages exploration or even freedom of choice. Even in the most linear of RPGs, you can take time to explore towns, backtrack over previously explored areas, or enter dungeons to power up your party. Not so Valkyrie Profile. With the clock always ticking and every move having an associated cost, you'll simply consult your ~soul concentration~ and do precisely what it suggests, no questions asked. You may be role-playing a nearly omnipotent demigoddess, but the game still manages to feel restrictive. Despite the game's implied freedom, the shackles of unstoppable time make it one of the most confining RPGs ever created. In a change from the normal style of traditional RPGs, the dungeon sequences are entirely side-scrolling and 2D. Valkyrie can run, jump, slide, climb, attack, and shoot ice crystals to freeze enemies and create temporary platforms against walls. Despite the inherent limitations of the XY-plane, dungeon designs are spruced up with movement along the Z-axis - doorways in and out of the screen connect parallel 2D planes. If it sounds confusing, that's because it is. Instead of a cohesive environment, locations feel like a series of paintings awkwardly connected by portals. A decent automap helps gamers visualize the links between a dungeon's planes, but the experience is still inelegant. Battles begin when the party intersects an enemy visible onscreen, and they unfold via one of Tri-Ace's customary ~active~ battle systems. Each of the four members of the party is assigned to one of the PlayStation's four buttons. Pressing a character's button directs them to attack, and some characters can attack multiple times per turn via multiple presses. The system gets far more interesting with the introduction of combos. Correctly timed button presses give simultaneous strikes, air juggles, and feints against defensive enemies. For example, a low-striking character could attack an enemy, who then guards low. However, a high-striking character simultaneously attacks the enemy, who is unable to simultaneously block high. Another character runs in for two more juggle hits, and the enemy is finished off by a powerful blast from a magic user. Combo-savvy players are rewarded with additional experience and items, providing strong incentive to progress beyond simple button-mashing. Visually, Valkyrie Profile offers much to enjoy. While the graphics are 2D, they feature vivid colors, strong design, and unmeasurable amounts of parallax scrolling. Characters are universally well animated, and battle effects have a sufficient ~wow~ factor. Character portraits deserve particular accolades; the artwork is both larger and more detailed than any game in recent memory, and the wide emotional range of portraits for each character helps to offset the limited pantomime of tiny sprites. The graphics are matched by an epic, orchestral soundtrack that genre fans are sure to love. Large amounts of voice acting are interspersed throughout the story; the localized English voices range from excellent to typical video game voice acting. The oft-heard in-battle voices are mostly spot-on and don't grate as much as they could. Sound effects are decent, if occasionally muddled. Enix of America's first major localization effort deserves accolades - the text flows naturally and does an excellent job of capturing the scenarios' inherent drama. Valkyrie Profile is a complex, ambitious, and gorgeous title that offers much to like: beautiful graphics, an entertaining battle system, engaging characters, and a creatively balanced dual scenario. Unfortunately, the game is structured so that you'll rarely have time to enjoy the surrounding splendor. If you're able to accept the awkward dungeon layouts and Draconian pacing, you'll be richly rewarded, but if you're unable to accept these quirks, you should approach with caution."}