{"ref": "https://www.gamespot.com/reviews/valkyrie-profile-2-silmeria-review/1900-6159103/", "date": "September 29, 2006", "game_name": "Valkyrie Profile", "text": "You might not remember the original Valkyrie Profile, a fairly obscure but well-liked role-playing game for the PlayStation, which was recently ported to the PSP as Valkyrie Profile: Lenneth. The game defied a lot of the conventions of Japanese RPGs, thanks to a nonlinear structure, an action-packed combat system, and a story inspired by Norse mythology. The new sequel to the game takes place chronologically before the original, so it expects no prior knowledge of the first game from you and instead comes across as a refreshingly different and very challenging example of a Japanese RPG. Odin, the lord of the gods, messed with the wrong valkyrie in Valkyrie Profile 2: Silmeria. In fairness, exacting revenge on a god seems like it ought to be pretty difficult. Valkyrie Profile 2 is the story of Silmeria, a valkyrie's soul trapped in the body of the princess Alicia. To onlookers, it appears as if Alicia has a split personality, or in other words, is crazy. So, without a friend in the world, Alicia sets off to aid Silmeria in her quest to get back at Odin, the lord of the gods, for exiling her. It's an interesting premise, though the story is slow to develop and relies rather heavily on some predictable archetypes. The game offers a distinctly Japanese take on Norse mythology and features a fairly conventional cast of characters, including a sarcastic archer (who looks like he's styled after Johnny Depp's Captain Jack Sparrow), a highfalutin but helpful sorcerer, a hulking warrior, and more. While there's a main cast, throughout the game you'll be freeing souls called ~einherjar,~ which become members of your party. There are dozens of different characters in all, though you'll bring only four into battle, so it's tempting to stick with the main cast since they're the ones in the story sequences. The story turns out to be interesting enough, but the actual gameplay of Valkyrie Profile 2 is probably the biggest attraction. Valkyrie Profile 2 is spread across a variety of towns, wilderness areas, dungeons, and other locations divided up by a sprawling map. You just pick one map location or another, so there's no sense that you're exploring some vast world, in spite of the epic nature of the game's plot. And unlike in the original game, which gave you a limited amount of time to prepare for the climactic battle of Ragnarok, there's no time pressure to go from one area to the next. In fact, you can revisit the game's dungeons and its battles as many times as you want. Furthermore, even though the game is all done up in impressive fully 3D graphics (in contrast with the 2D artwork of the original), it plays like an old side-scrolling 2D game when you're not in battle. This may come as a slight shock the first few times you visit one of the game's elaborate-looking towns and realize all you can do is run left or right, sometimes pressing ~up~ to walk into a house or go down a side street. However, this system works, and it gives the game's many dungeons a totally different feel, for better or for worse, from what you'd normally find in a Japanese RPG. Exploring the game's dungeons really is like something out of a 2D action adventure game. You can fire ~photons~ that temporarily freeze enemies (and some other objects), which lets you use them as platforms you can jump across. What's more, shooting a photon into an already-frozen object will cause you to switch places with that object, letting you reach faraway places. Your photons also reflect off walls like billiard balls, and sometimes you'll need to make some tricky shots to reach an out-of-the-way treasure chest. Best of all, the controls for these side-scrolling sequences are tight and responsive, and there's an excellent map system that clearly shows you the surprisingly elaborate layouts you'll explore, to help keep you from getting lost. Most of the game's dungeons aren't particularly long, but they can be tricky, and enemies respawn whenever you reenter one of the rooms. What's more, you'll often need to run out of a dungeon the same way you came in, even after you've defeated the boss monster waiting for you at the end. It's a little anticlimactic, but then again, you'll want--and need--to take most every opportunity to do battle in Valkyrie Profile 2. When you touch an enemy during the exploration mode, the game switches over to its intriguing fully 3D, quasi-real-time battle mode. It might take you quite a while to realize that, in fact, the battles aren't real-time at all: If you don't move, neither will your enemies, which gives you ample time to plan a strategy. There are a lot of interesting nuances to the game's battle system, and it's got a satisfyingly fast pace, for the most part. You can command any of your four characters to attack an enemy within range just by pressing the character's corresponding button, and by pressing buttons in different sequences, you'll naturally string together different combos. You can sort of get by just by mashing on all the buttons, but a more-methodical approach will let you make the most of your characters' complementary attacks. The combat has a good, satisfying feel to it, as enemies will frequently be launched into the air and juggled with successive hits, slammed down to the ground, and smashed apart piece by piece. You can smash your enemies' weapons and armor by concentrating your attacks there, or you can try to dash around to the side or back of foes to hit them where they're most vulnerable. The dungeons play out like levels from a 2D side-scrolling action game, but rest assured there is a deep, full-fledged RPG underneath it all. You can even split up your party into two teams so that one or more characters can distract the enemy while the others sneak around back. As you negotiate the battle, you'll need to pay close attention to your enemies' attack ranges, expressed on the battlefield with a red overlay. Your enemy can attack you only when you're caught within these ranges, so a well-placed dash can often take you clear through the enemy's attack zone and put you in the position to hit him hard. But watch out, because if your dash stops short, you'll get attacked. And the enemies in Valkyrie Profile 2 often hit very hard, too. Since combat can be risky business, it's often best to go straight for the enemy group's leader, who's always marked on your minimap. Take him out and you win automatically. And there's even more to Valkyrie Profile, though some of the game's additional complexities start to get rather obscure. In dungeons, you'll find objects called ~sealstones,~ which grant certain positive or negative effects, such as raising attack power or weakening elemental resistances (though the effects are a lot more varied than that). There are dozens of different sealstones in all. If you're carrying a sealstone, it will affect your party, but if the sealstone is placed on a dais, it will affect enemies in the area. With this in mind, you can gain significant advantages in battle, but must also watch out for areas that have powerful sealstones bolstering the enemies nearby. It's an unusual system that's somewhat difficult to figure out at first, but it adds more depth and variety to the game. Most battles are fun and fast-paced, though some of the larger, more dangerous foes can only be taken down methodically and carefully. Still more depth may be found in the game's equipment and skill system. Each character may be equipped with up to nine pieces of gear, including a weapon, armor, and various accessories that bolster the character's stats and abilities. And, by linking together certain types of equipment, you'll be able to learn special skills that strengthen your character even more, such as by increasing the potency of the character's critical hits or allowing him or her to recover some hit points after taking damage. All this is very interesting, but unfortunately the interface for buying, selling, and equipping gear, as well as for linking gear to form new skills, is convoluted. The game shows you which skills you've discovered, but you can't simply select those skills and automatically equip the corresponding equipment. You are instead forced to slog through long lists of items and form the equipment combinations yourself. Multiply this across 10, 20, or more characters, and you've got yourself a potentially major chore on your hands. However, since only the characters involved in battle gain experience from the battle, chances are you'll pick a starting lineup of characters and stick with it. If all this sounds pretty complicated, that's because it is. Valkyrie Profile 2 seems intended especially for longtime fans of Japanese role-playing games who are somewhat tired of the conventional formula but who are also prepared and eager for a serious challenge. It's not long before this game gets hard and throws you headlong into battles against foes that can easily wipe your whole party out. While good strategy will help you to a certain extent, you also need to put a lot of work into building up your characters, and there's really no good way to do this except to keep running through some areas over and over, fighting the same groups of monsters. On the one hand, the combat system is fun and exciting. On the other hand, the game is fairly shameless about forcing you to go out of your way to level up a lot. This further hampers the pacing of the storyline and pads out the length of the game, which could take you 40 or more hours on your first time through. Thankfully, Valkyrie Profile 2 also features a good number of optional dungeons that aren't central to the story but that contain valuable treasures that could really help you later on. Valkyrie Profile 2 makes a great change of pace from the typical Japanese RPG. The game looks great, which you'll especially appreciate if you wind up playing for hours on end. The background scenery is beautiful, featuring a wide variety of landscapes and weather effects. Even though these are essentially flat 2D stages, you still get a great sense of scale in many of the areas. The characters and monsters have a great look to them as well, and during cutscenes, the main characters are expressive and very detailed. Valkyrie Profile 2 also supports widescreen, progressive-scan displays, which bring out the best in the visuals. Solid voice acting and a good-if-typical synth-and-symphonic musical score round out the audio portion of the experience, and sound effects during battle are quite rousing as well. Valkyrie Profile 2 is different from the original, so those who loved the first game may have mixed feelings about this sequel. At the same time, even hardcore fans of Japanese RPGs, for whom this game seems intended, will likely find some aspects of the experience to be a bit too much. But the journey is still a rewarding one overall, requiring a fair amount of patience but delivering plenty of instant gratification along the way, thanks to a great combat system and action-packed dungeon levels. If you're looking for more from your next RPG than just another save-the-world storyline and really want to sink your teeth into some complex gameplay, this one's for you. In dungeons, you'll find objects called ~sealstones,~ which grant certain positive or negative effects, such as raising attack power or weakening elemental resistances (though the effects are a lot more varied than that). There are dozens of different sealstones in all. If you're carrying a sealstone, it will affect your party, but if the sealstone is placed on a dais, it will affect enemies in the area. With this in mind, you can gain significant advantages in battle, but must also watch out for areas that have powerful sealstones bolstering the enemies nearby. It's an unusual system that's somewhat difficult to figure out at first, but it adds more depth and variety to the game. Most battles are fun and fast-paced, though some of the larger, more dangerous foes can only be taken down methodically and carefully. Still more depth may be found in the game's equipment and skill system. Each character may be equipped with up to nine pieces of gear, including a weapon, armor, and various accessories that bolster the character's stats and abilities. And, by linking together certain types of equipment, you'll be able to learn special skills that strengthen your character even more, such as by increasing the potency of the character's critical hits or allowing him or her to recover some hit points after taking damage. All this is very interesting, but unfortunately the interface for buying, selling, and equipping gear, as well as for linking gear to form new skills, is convoluted. The game shows you which skills you've discovered, but you can't simply select those skills and automatically equip the corresponding equipment. You are instead forced to slog through long lists of items and form the equipment combinations yourself. Multiply this across 10, 20, or more characters, and you've got yourself a potentially major chore on your hands. However, since only the characters involved in battle gain experience from the battle, chances are you'll pick a starting lineup of characters and stick with it. If all this sounds pretty complicated, that's because it is. Valkyrie Profile 2 seems intended especially for longtime fans of Japanese role-playing games who are somewhat tired of the conventional formula but who are also prepared and eager for a serious challenge. It's not long before this game gets hard and throws you headlong into battles against foes that can easily wipe your whole party out. While good strategy will help you to a certain extent, you also need to put a lot of work into building up your characters, and there's really no good way to do this except to keep running through some areas over and over, fighting the same groups of monsters. On the one hand, the combat system is fun and exciting. On the other hand, the game is fairly shameless about forcing you to go out of your way to level up a lot. This further hampers the pacing of the storyline and pads out the length of the game, which could take you 40 or more hours on your first time through. Thankfully, Valkyrie Profile 2 also features a good number of optional dungeons that aren't central to the story but that contain valuable treasures that could really help you later on. Valkyrie Profile 2 makes a great change of pace from the typical Japanese RPG. The game looks great, which you'll especially appreciate if you wind up playing for hours on end. The background scenery is beautiful, featuring a wide variety of landscapes and weather effects. Even though these are essentially flat 2D stages, you still get a great sense of scale in many of the areas. The characters and monsters have a great look to them as well, and during cutscenes, the main characters are expressive and very detailed. Valkyrie Profile 2 also supports widescreen, progressive-scan displays, which bring out the best in the visuals. Solid voice acting and a good-if-typical synth-and-symphonic musical score round out the audio portion of the experience, and sound effects during battle are quite rousing as well. Valkyrie Profile 2 is different from the original, so those who loved the first game may have mixed feelings about this sequel. At the same time, even hardcore fans of Japanese RPGs, for whom this game seems intended, will likely find some aspects of the experience to be a bit too much. But the journey is still a rewarding one overall, requiring a fair amount of patience but delivering plenty of instant gratification along the way, thanks to a great combat system and action-packed dungeon levels. If you're looking for more from your next RPG than just another save-the-world storyline and really want to sink your teeth into some complex gameplay, this one's for you."}