{"ref": "https://www.gamespot.com/reviews/arc-the-lad-twilight-of-the-spirits-review/1900-6030535/", "date": "June 24, 2003", "game_name": "Arc the Lad: Twilight of the Spirits", "text": "Arc the Lad: Twilight of the Spirits is the latest installment in the long-running Arc the Lad series and the first to appear on the PlayStation 2. If you're up on your Sony history, you'll remember that the original Arc the Lad was one of the very first RPGs to appear on the PlayStation when it was released in Japan in 1995. Perhaps you'll also remember that even though Arc the Lad seemed like an ideal candidate for a prompt North American localization, the original game and its two sequels remained firmly rooted on the other side of the Pacific until 2001, when the series finally saw American release in the form of Arc the Lad Collection. Fortunately, Twilight of the Spirits has suffered no such delay--the Japanese version was released just three months ago, and its American counterpart is now available with fully localized text and voice acting. It's a solid RPG that doesn't take many chances, and while it may not set the role-playing world on fire, it's still a lot of fun. Mechanically, Twilight of the Spirits is put together like just about every other standard RPG. In narrative terms, this newest Arc the Lad game has only a tenuous connection to the series. It's set in the same world as the previous games but many centuries later, and the events of those games are referred to here merely as ancient lore. Despite a number of RPG clichs--the plucky youth with misunderstood powers and the big, bad evil empire are both prominently featured--Twilight of the Spirits' storyline is actually one of its strongest points. The game's world is inhabited by humans and deimos, which are intelligent but bellicose monsters. Humans and deimos share a hatred for one another that stretches back thousands of years, and of course this hatred manifests itself in constant conflicts between the two. What's worse, there are a number of human nations vying for dominance, and the deimos are divided into several different species, many of which don't like each other. With humans fighting humans, humans fighting deimos, and deimos fighting deimos, you've got a storyline that features enough intrigue to keep you guessing for quite some time. The plot is conveyed in an interesting manner from the viewpoints of two brothers who were separated at birth--you'll play as one character for a while, then switch to the other, then switch back again, and so on. One brother, Kharg, is the former prince of a small kingdom who is coming of age and coming into his own as a fighter. Kharg sports a strange birthmark and latent magical powers that he must struggle to understand. The other brother, Darc, is a half-human, half-deimos slave who shares Kharg's birthmark. Darc lives on another continent and starts out languishing in slavery, only to break free and become a powerful leader of the deimos. Of course, all the birthmarks, magical powers, and mixed heritages raise some questions about Kharg's and Darc's parentage, and the answers are slowly unveiled as the game progresses. As you might expect, the brothers become embroiled in a chain of events that threatens the survival of their world, and they'll both contribute to this conflict in their own ways. Having you switch back and forth between the two brothers and their attendant characters and environments is a welcome and well-implemented feature that keeps the storyline feeling fresh throughout. Mechanically, Twilight of the Spirits is put together like just about every other standard RPG. You move between towns and other areas on a world map, you visit shops to buy supplies, and you talk to townspeople to gather information. In short, the game is familiar RPG territory, and it's all done well enough that aficionados and newcomers alike can appreciate it. The biggest variation on the standard formula is the game's combat engine, which integrates an element of strategy into its turn-based format. You have to move your characters around the battlefield so they're physically within striking range of enemy targets, and you can get damage and evasion bonuses for attacking from behind, taking advantage of uneven terrain, and performing other tactical maneuvers. Adding to the strategy element, individual enemies drop gold and items on the ground when defeated, and you'll have to weigh the cost of expending a turn to pick them up. As you'd expect, your characters will gain levels and also learn character-specific magic and special abilities as they fight. The character-upgrade model in the game is item-specific and very accessible: You equip accessories on your characters to enhance their attributes, and you can also attach weapon parts to your weapons to increase their strength and give them special properties. It's easy and gratifying to see your characters powering up as you progress through the game, and while many RPGs' random encounters end up being a drag, the fighting in Twilight of the Spirits manages to stay engaging even when you're doing a lot of it. In narrative terms, this newest Arc the Lad game has only a tenuous connection to the series. The point of a video game is to provide an entertaining gameplay experience, and Arc the Lad: Twilight of the Spirits certainly delivers in that respect. Still, it's hard not to notice that the game is somewhat lacking in other areas, specifically in its visuals and sounds. Don't take that to mean the game looks and sounds horrible--it doesn't. But the graphics, voice acting, and music do vary pretty widely in quality. Some of the backgrounds are lovingly crafted, but some of the character models are surprisingly blocky and poorly textured. The visuals aren't jarringly bad, but at times you might mistake Arc the Lad for a first-generation PlayStation 2 game rather than one that's come out well into the system's life span. To its credit, the game's cutscenes feature some inspired, cinematic camera work and effects (such as depth of field), and these add to the overall level of visual polish. The game fares about the same in the audio category--like with the graphics, you have to take the bad with the good. Musically, this is one strange game. The soundtrack combines typical RPG-esque orchestral arrangements with such instruments as bagpipes, mariachi-style horns, and even electric guitars. Unfortunately, many of the more ambitious compositions just aren't very good, though we will give the game credit for its excessive use of guitar solos. Finally, the voice acting runs the gamut from pretty good to barely tolerable. Thankfully, most of the offense lies in the in-battle voices, which can be disabled. Arc the Lad: Twilight of the Spirits is a strictly by-the-numbers RPG, and that's not at all a bad thing. It features a lengthy, epic story with interesting characters and lots of locations. Its combat and character-customization systems are both accessible to inexperienced players and intricate enough for RPG diehards. It may falter a little in the audio-visual department, but certainly not enough that you should overlook this otherwise great game. If you can see and hear past these minor flaws, it's just downright fun to play, and isn't that what matters most?"}