{"ref": "https://www.gamespot.com/reviews/touch-detective-review/1900-6162262/", "date": "November 22, 2006", "game_name": "Touch Detective", "text": "One of the things the Nintendo DS has been heralded for is its ability to handle decidedly PC-oriented genres such as strategy and adventure games. Well, at least strategy games. With the exception of last year's delightfully crazy Phoenix Wright, most of the attempts to bring adventure games to the DS haven't quite panned out, either because of short length, inadequate story, or off-kilter mechanics. Atlus' Touch Detective is no different. It starts out promisingly enough, with some cute, bizarre characters and a series of strange mysteries to solve via the DS's touch screen; but more than any other adventure game on the DS to date, Touch Detective suffers from archaic adventure game puzzle-solving, forcing you to pixel hunt and combine items until you're completely and utterly bored with the whole thing. You ain't just whistlin' Dixie, sister. Touch Detective centers around a strange detective agency run by a young girl named Mackenzie. This bulging-eyed blonde lives in a house with a prim and proper butler type named Cromwell. You get the impression that Cromwell is sort of a parent type and Mackenzie is his ward, but this isn't one of those Inspector Gadget scenarios where the adult is a bumbling fool that everyone thinks is in charge, and the kid does all the work. Mackenzie is a detective, straight up, and Cromwell is effectively her manservant. These two are no stranger than the citizens of their town--if anything, they're normal in comparison. Mackenzie's main rival is a hot-headed, raven-haired chick named Chloe who always finds ways to interfere in her investigations; Funghi is Mackenzie's mushroom-man pet that follows her around wherever she goes and periodically takes part in puzzle-solving; and just about every case in the game seems to revolve around Mackenzie's dingbat friend Penelope. Oh, and there's a creepy fortune-teller, a chicken-lady condominium landlord, a reticent organ grinder, a giant shark-man who won't stop eating pastries, and a bunch of haunting skeleton people who look like something out of Edvard Munch's ~The Scream.~ As a detective, your job is to, of course, solve cases. But in a game this patently whimsical, it wouldn't make much sense to have you solving gritty murders or finding jade monkeys before the next full moon, or what have you. No, Mackenzie's cases take a decidedly oddball slant, tasking you with discovering why Penelope can't dream anymore, or how to save a snow fairy from certain doom in the middle of spring. Some of this stuff falls under the ~weird for the sake of weird~ anime trappings that a lot of these games tend to, but it's forgivable simply for the fact that the characters and dialogue are surprisingly endearing. The dialogue is filled with colorfully goofy moments and more uses of ~....~ than anything since Golgo 13, and the characters--while all decidedly cartoony--are likeable enough to want to stick with throughout the adventure. The game has a nice look to it as well, with characters and scenery that don't fall into the usual generic anime categories. It's original-looking art design that sets a nice mood for each case, and the soundtrack complements these scenes equally well. Solving mysteries mostly involves wandering around the town to the various searchable locations. You start out with only a few locations on the map unlocked, but as you complete more cases, eventually you'll visit every area, including a bustling shopping area, a picturesque park, a creepy planetarium, and the aforementioned condominium. Tapping the screen makes Mackenzie walk to that point, and likewise, whenever you see an item or an object that looks as if it might belong in your inventory, you simply tap it to pick it up. Once it's in your inventory, you just tap it again on the inventory screen to bring it up. Sometimes you need to do this to find hidden evidence or items on an object. This is about as specific a clue as you will ever find in this game. It's a mechanically sound gameplay system, but the way in which the game forces you into constant absurd leaps of logic to solve puzzles and situations just about ruins the fun. This is one of those dyed-in-the-wool pixel hunts that requires you to tap around every section of a screen until you find something you can pick up. Nine times out of 10, what you tap won't be anything. But every now and again, that air pump or that teddy bear sitting in your room will be the exact item you need for the next section. Not that any of these puzzles make a lick of logical sense, nor does the game hint to you what you might need at any time. Touch Detective subscribes wholeheartedly to the theory that adventure games should require players to pick up every item, run back and forth and talk to every single person over and over again, and try to use every item on every person or other object you find until something--anything--works. Just for one example of this, there's a point in one case where you pick up a broken air pump. For the longest time, your buddy Cromwell won't do anything with it, until at one point he'll agree to fix it out of the blue. You still have no idea what to do with it, mind you. Eventually, by no reason of sound logic, you realize that you have to use it to pump the chicken-lady landlord full of air so you can break in to her apartment and steal some keys. Believe it or not, it just gets more convoluted from there. Beyond tapping around randomly until you find items or make people say or do the right things inexplicably, there's very little to Touch Detective. It's just the same shallow progression of actions over and over again until you've completed each of the four main cases. There are a few bonus missions to bust through here and there, but they're no more interesting than what you do throughout the main cases. It will take a strong love of the story and characters to want to slog through the never-ending onslaught of arcane puzzles and screen tappery, and odds are that few people will be able to fall quite that far in love with the game to put up with such nonsense."}