{"ref": "https://www.gamespot.com/reviews/tsunami-2265-review/1900-2875959/", "date": "May 17, 2006", "game_name": "Tsunami 2265", "text": "Tsunami 2265 begins with a schmaltzy love theme filled with ludicrous but sincerely crooned lines such as, ~I see fighters coming for your heart.~ For an anime-inspired action game about giant robots and their human pilots, it's a promising start. Unfortunately, things go abruptly downhill from there. The designers obviously know their anime--apparently at the expense of ever having played a video game. Tsunami's one other strong point is a visual technique commonly called cel shading, which uses flat-colored textures to give a game's graphics a convincingly cartoonlike appearance. The visuals feature lots of clean lines and bright colors. It can be strikingly effective in games that use it creatively, but Tsunami's visual design is so relentlessly bland that the effect loses any impact. Roughly two-thirds of the game's 13 long levels take place in virtually identical mazelike canyon corridors. Most of the rest of the environments are a variation of either blocky, characterless industrial landscapes or nondescript caves. And that's basically Tsunami 2265--a nicely done giant robot ode to love and some potentially interesting graphics. It's hard to imagine how any other aspect of Tsunami could have seemed like a good idea, even in theory. The designers have apparently ignored many of the traditional principles of designing an interesting action game. But when you play the game, you won't get the sense that they deliberately chose not to use these principles. Instead, it almost seems like the game's designers were never aware of these simple rules in the first place. The levels are split into two types. In the ~shoot 'em up~ sections, you pilot a mech from a third-person perspective. These levels generally involve navigating a maze and looking for objects that, when destroyed, will open up the next section of the maze. You'll basically repeat this pattern until you can finally complete the level and call it a day. As noted, Tsunami 2265's environments are repetitive and bland. Even worse, they provide absolutely no sense of the massive scale of your mech. There are no signs that any location you visit was designed for or is inhabited by anything human-sized. Being a giant just isn't thrilling when nothing around you is tiny. The game's mazes are populated with a small variety of enemy mechs. Other than shooting at you and wiggling around a little, they display absolutely no tactics. In fact, their behavior can barely be called a simple pattern. You pilot one of three mechs, but all three are more or less identical other than relatively inconsequential differences in secondary weapons and movement speed. Good run-and-gun shooters--even most bad run-and-gun shooters--make combat a logistical puzzle. In addition to testing your reflexes, good shooters require you to balance weapon types, ammunition supplies, the weaknesses of your enemies, and the tactical opportunities provided by the environments. Tsunami 2265 doesn't do any of this. Your mech has two weapons: a gun and a missile launcher. No other weapons or weapon upgrades are available. Furthermore, both of the weapons have unlimited ammo and never need to pause for reloading. The game's ubiquitous canyon levels are all essentially flat tubes, so intelligent use of cover is pretty much out of the question. The lack of enemy intelligence, the simplicity of the landscape, and the choiceless, resource-free weapon system turn every fight into an exercise in strafing left and right while holding down both mouse buttons. In fact, since there's absolutely no reason not to fire both weapons at once, you can consider it a failure of interface design that they weren't both mapped to the same key. Four of the levels occur in what the designers call ~adventure~ mode. The primary difference between these and the ~shoot 'em up~ levels is that, rather than piloting a mech, you pilot a person. But for some reason, the scale remains about the same. Also, in addition to blowing things up to open the next section of the maze, you sometimes have to pick up objects and take them someplace in order to open up the next section of the maze. Maybe because a button had to be used for picking things up, you only get one weapon in adventure mode--a pistol. In fact, adventure mode has all the weaknesses of the shoot 'em up mode, with one notable addition. If you back into a wall, the camera often swings around to face you, and there's a good chance that it will get permanently stuck. When this happens, the controls become effectively reversed, which is confusing to say the least. Even worse, you still fire toward the aiming reticle, even though your character isn't actually facing it. The only way to correct the camera is to quit out and restart. Unfortunately, you get five lives to finish each level with no opportunity for saving. So if you quit out, you have to start over with no guarantee you won't spend a half an hour wandering around the maze just to accidentally back into a corner again. Another option is to suck it up and walk backward through the entire mission. But your best bet is to not play Tsunami 2265 at all. Don't worry, you're not missing anything."}