{"ref": "https://www.gamespot.com/reviews/mega-man-10-review/1900-6256972/", "date": "April 6, 2010", "game_name": "Mega Man 10", "text": "Mega Man has been saving the world from evil robots for more than 20 years. He has snatched weapons from dozens of fallen bosses, leaped theatrically through more locked doors than is worth keeping track of, and used his dog Rush as a stepstool countless times. In Mega Man 10, the second NES-inspired revision on current-generation consoles, the Blue Bomber once again sets off to defeat Dr. Wily and his army of nefarious robot masters. The formula hasn't changed in the slightest from past installments, but the latest iteration is still jam-packed with challenging obstacles and thrilling battles. Unfortunately, the 10th entry can't quite match the highs of the previous games. The bosses alternate from tired retreads to oddball head-scratchers and the music is forgettable. But the charming aesthetics and satisfying action make up for the missteps, creating another great entry in this venerable franchise. The structure of Mega Man 10 is a carbon copy of the previous games in the series. The initial eight stages can be tackled in any order, and if you defeat the robot master at the end, you earn a fancy new weapon. Making your way through the side-scrolling levels may not present any surprises for series veterans, but they are well designed nonetheless and chock-full of relentless enemies and life-stealing bottomless pits. It's as difficult as ever to navigate spike-laden rooms, leap across vanishing blocks, and dodge quick-flying enemies, but death is an expected occurrence in the Mega Man franchise. This is a punishing game cut from the cloth of its old-school forebearers, which means memorization, patience, and skill are paramount to success. There is an easy mode to alleviate the frustration of dying, but it is far too easy to provide a satisfying alternative to the normal mode. Not only do enemies do far less damage, but covers have also been placed on many pits, preventing almost any chance of death. Because of this, it's a lot more rewarding to play on normal, though be prepared to take a few lumps along the way. It's just a shame the bosses are so silly this time. Sheep Man not only raises the question of why someone would make a robot sheep in the first place, but he also comes with a baffling gun. Your ovine enemy releases clouds that rain lightning down on your metal frame. This may tie into the idea that a sheep kind of looks like a cloud if you squint, but it just comes off as strange. Pump Man has his own problems. He probably started out as a good-natured robot, but when your level takes place in a foul-smelling sewer, it's enough to turn even the nicest robots into homicidal killers. Those bosses are absurd, but at least they're original. Solar Man and Chill Man provide the requisite hot/cold dynamic, while Blade Man is just another crazy robot that likes to play with knives. Although the bosses are uninspired, they are at least a lot of fun to fight. These encounters are purely pattern based, but they are far from easy. They move so fast and strike with such deadly precision that you'll be hard-pressed to defeat them the first time, making it a thrill when you finally have the last laugh. At the end of each fight, you earn a new gun based on your defeated enemy's special power. These new weapons are instrumental in defeating subsequent bosses--for instance, Chill Man is susceptible to solar blaze--but come in handy against normal enemies as well. Weapons, such as the triple blade, which angles up to hit out-of-reach enemies, and the rebound striker, which bounces off walls with deadly results, are useful when you're hunkered down against ferocious foes. Not all of the weapons are quite so handy, though. Thunder wool requires enemies to be standing right underneath it to be hit, and the commando bomb, which can be controlled in midair, is too unwieldy to use during heated combat. Still, these weapons add a bit of variety to the game, and though none of them are versatile enough to replace your standard mega buster, they offer inventive players more options to rid the world of evil robots. Sorry Mega Man, but our princess is in another castle. When you finally take down all eight robot masters (twice!) and defeat Dr. Wily, there is still a bit more to play. Challenge mode gives you a set of small obstacles to overcome. The early challenges are built around basic platforming--dealing with lower gravity, avoiding spikes, making ultraprecise leaps--and serve as a tutorial for those who want to hone their jumping skills. From there, you're tested in standard combat, introduced to the different weapons, matched up against minibosses, and finally given a chance to take on the bosses. It's a fun gauntlet that adds a few more hours to the total experience. You can also play through the entire game as Proto Man. He is more versatile than Mega Man, but playing as him is a bit harder as well. You can charge up your shot and slide under projectiles, but he takes more damage, which forces you to play more defensively than normal. Mega Man 9 required players to pay more for the privilege of controlling Proto Man, so it's nice having another character added this time around at no extra charge. There is little to differentiate Mega Man 10 from previous games in the series, and this ties into the classic visuals as well. Mega Man 10 looks like a relic from the '80s, but the timeless art style and vibrant colors make it look good even in the modern era. Unfortunately, the score is not so enduring. The soundtrack evokes a similar style to its predecessors, but the songs are forgettable, falling far short of those in previous entries. Even with this small problem and the goofy bosses, Mega Man 10 is a lot of fun. The challenging levels have no problem repeatedly punishing players until they finally master the tricks, and it's still so satisfying to overcome the obstacles to lay waste to your robot masters. The Mega Man franchise is rooted firmly in the past, but instead of feeling stale with age, it only reinforces how incredible those original games were."}