{"ref": "https://www.gamespot.com/reviews/metal-gear-solid-portable-ops-review/1900-6162832/", "date": "December 6, 2006", "game_name": "Metal Gear Solid: Portable Ops", "text": "The story alone makes Metal Gear Solid: Portable Ops required playing material for fans of Kojima Productions' long-running, memorable stealth action series. This isn't called Metal Gear Solid 4, but this PlayStation Portable game is a direct continuation of the moving, thought-provoking storyline presented in 2004's MGS3: Snake Eater, and in turn, it sheds new light on some of the mysteries of the previous games in the series. That's the good news; the better news is that Metal Gear Solid: Portable Ops also takes the series in some interesting, new directions from a gameplay standpoint. This game has it all, featuring not only a great, open-ended solo campaign, but also some extensive multiplayer options and plenty of other surprises. Complicated controls and a storyline that doesn't waste much time on exposition mean Portable Ops will take a while for inexperienced players to get into, and even though it's amazing how much of the visual detail the series is known for got crammed into this game, fans will note that this isn't as lavish of a production as the games in the series proper. But this is still an all-around outstanding experience, especially since you can play it on the go. Snake is back, and this time, he's uncharacteristically going to have to make himself a lot of new friends. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Metal Gear Solid: Portable Ops Video Review Portable Ops takes place in 1970, some years after the profound events of Metal Gear Solid 3, and it chronicles another important chapter in the life of the legendary soldier called Snake, also known as Big Boss. A soldier through and through, Snake's latest assignment takes him to a secret Soviet base in South America, and at the beginning of the game, he's captured and detained there...by members of his own former FOX unit. He escapes with the help of a young Green Beret named Roy Campbell, and they decide to work together to put a stop to what's shaping up to be a very bad situation between American forces and rogue Soviet militants. Snake and Campbell soon agree that they can't succeed in this situation on their own, and they begin recruiting some of the enemy soldiers to their cause. As the story unravels, Snake will meet up with some faces from his blood-soaked past and discover the true nature of what's happening in that South American base. Snake is an already likable, complex character and winds up all the more so at the end of this game. Much like the story in MGS3, the story in Portable Ops sometimes grows dense with double-crossing and second-guessing and breaks into some philosophical discourse on the meaning of loyalty. It's heady stuff, but at the same time, it's presented in an over-the-top way that makes it exciting rather than ponderous. Of further note, the main villains of this story are much more compelling than those of MGS3; they're intriguing, memorable characters, some of the best bad guys this series has ever seen. Unlike previous games in the series, though, the major story sequences in Portable Ops are presented with animated comic book panels, rather than in full 3D. These cutscenes don't have quite the same cinematic flair as those of MGS3, and the mostly black-and-white ink artwork is stylistically much different from the way the rest of the game looks. However, this format really works, and it helps make the key story sequences of Portable Ops about as dramatic as those of MGS3 before it. There are plenty of major plot sequences in the game, but overall, there's a much better balance between gameplay and storyline here as compared with previous games in the series. It takes roughly 15 hours to finish the story the first time through, and while you'll be left with plenty of plot to think about, you'll have spent most of that time undertaking various sneaking missions. Outstanding visuals and a captivating story will entice you to press through this game's challenging campaign. When it comes down to controlling the action--doing things like shooting, sneaking, and fighting hand-to-hand--Portable Ops borrows heavily from MGS3 and MGS2 before it. Fans of the series can expect much of the same type of behavior from the enemy artificial intelligence, as well as many of the moves and abilities they've already seen before. You can still flatten your back against walls and peek around corners, execute a powerful forward dive, fire a bunch of authentic firearms either from a third-person or first-person viewpoint, and crawl through narrow passageways to escape enemy patrols. However, some gameplay tweaks are in here to help make this game more playable using the PSP's controls. Of particular note, Portable Ops uses the third-person camera perspective introduced in this year's MGS3: Subsistence, so you can move the camera angle around your character using the D pad, or quickly reset the perspective by tapping the left shoulder button. Also, there's a nice, new radar system that tracks nearby enemies based on how much sound they're making; it lets you know when foes are near without giving away their location. Thankfully, the ~survival~ gameplay elements of MGS3, which forced you to spend a bunch of time in menu screens rather than in action while curing deep wounds and eating weird food, have been cut from this game. The typical mission in Portable Ops is a short, instant-action affair. Though the underlying gameplay is familiar, the overarching structure of this game is very different from what's been done before in Metal Gear Solid. Early on, Snake and Campbell establish a mobile base, and at this point you're introduced to the game's strategic layer. You see a tactical map containing all of the known regions of the South American base, and from here, you're able to deploy to any of these regions in any order at any time. Meanwhile, a key new gameplay component has you recruiting more and more soldiers to your cause, whom you can then assign to spy on particular territories, serve in the medical ward to help heal your injured troops, or join your technical team that creates new items for you from time to time. Of course, you could also assign them to your sneaking team. Another big change in Portable Ops is that you can now play as many other characters besides Snake. Each character is rated differently using different weapons and skills, and some have unique special abilities. In practice, though, everybody pretty much plays alike, so it's a bit of a shame that you don't get to use a whole bunch of different moves depending on the character. This is still an interesting addition to the gameplay, though, as it lets you bring multiple characters into each mission, whom you then control one at a time--the others lie in wait in inconspicuous cardboard boxes (what else?). Also, certain uniformed soldiers can blend right in with their former friends, letting you mosey right into enemy territory. The new strategic layer dividing up all of the different missions takes some getting used to, but introduces a lot of interesting gameplay elements. The first time you capture an enemy soldier, the process is convincingly detailed in a cutscene, in which Snake, a famous and charismatic soldier, earns the loyalty and respect of the enemy combatant. From that point, what happens to your enemies to make them join you after capture is implied, but to capture enemies in the first place, you must knock them unconscious and dump them in the back of your truck. Simple! It's an oddly unsettling, surprisingly fun collection minigame of sorts, and it'll compel you to use nonlethal force most of the time, since you'll ideally need literally dozens of soldiers to join you. Your ranks will mostly consist of former enemy grunts, but it's possible to get stronger, special characters to join you through various means. Since the squads you amass during the single-player game are the very same characters you'll take online for multiplayer, there's plenty of good reason to go into different mission areas just to kidnap and convert some of the locals. The missions themselves tend to be simple and straightforward, often requiring little more than reaching a particular destination. While few of the missions stand out as being memorable, their brevity is mostly to the game's credit, since having a large number of bite-sized missions makes a great fit for a portable game. The story proceeds as your spies recover reports of key information or locations, so you'll gradually unlock more and more places to go. The routine stealth action missions, which commonly pit you against some rather intelligent but fairly predictable enemy guards, are sometimes interrupted by a key story mission of some sort, as well as the occasional boss fight. The boss fights in Portable Ops aren't quite as puzzle-driven in nature as those of some of the past Metal Gear Solid games, instead boiling down to some pure shoot-outs against some very tough foes. At the normal difficulty setting (an easy setting and an unlockable ~extreme~ setting are also available), some of these boss fights can be very, very tough, requiring patience and strategy. The story will compel you to figure out how to succeed. If you've played Metal Gear Solid 3, you'll be able to dive right into Portable Ops. The open-ended structure of Portable Ops is mostly well thought out and gives this game a different feel from past MGS installments. However, some aspects of it, such as how most soldiers look and play identically, aren't fully baked. There's a pretty high level of abstraction involved in assigning spies to territories and things like that, and your spies are never in any danger of being caught. In fact, the entire tactical map is highly abstract, so you never get a cohesive sense of being in a South American military base, nor do you get an impression that all of the enemies throughout the levels have anything to do besides walk back and forth, wondering when Snake's going to drop in. Nevertheless, there's so much interesting gameplay and depth to explore that suspending your disbelief around these types of issues shouldn't be difficult. There's also that whole multiplayer mode, remember that? From the main menu, you can jump into a six-player ad hoc versus game, and there's a game-sharing option if you'd like to start a quick deathmatch with some friends using just one copy of the game. You can also trade comrades with other Portable Ops players. The real meat of the multiplayer experience is somewhat buried within the tactical map interface, though. If you've played Metal Gear Online as part of MGS3: Subsistence, you'll know what to expect, but it's remarkable to play a fully featured online shooter such as this in a portable format. The control scheme translates quite well to a multiplayer mode, though again, this really isn't much of a pick-up-and-play game; so perhaps the reason the online mode is nestled within the campaign is because by the time you can get to it, you'll have already learned the controls to some extent. There are plenty of multiplayer options here to keep you busy for a long time. Not all of the multiplayer modes from Subsistence are in here, as multiplayer is limited to deathmatch, team deathmatch, and capture the flag. You have a basic auto-aim ability with your weapons, but by manually aiming from a first-person viewpoint, you can instantly kill opponents with a shot to the head. Besides a whole bunch of guns, you'll get to use grenades, mines, and even those incredibly distracting dirty magazines in battle, and online performance was mostly smooth and stable during our tests on live servers. Interestingly, you get to choose between either ~virtual~ online battles or ~real~ online battles, and in the latter, any of your characters that are killed will indeed be gone afterwards; but whoever killed them may then keep them, sort of like racing for pink slips. Except in a race for pink slips, you can't wave a white flag to give up and live to fight another day--you do have that option here. At any rate, since it's based on a tried-and-true concept, the online multiplayer portion of Portable Ops is quite impressive, though the fairly complex controls and quick, brutal rounds will naturally attract a hardcore subset of MGS players. So don't expect anything less than ruthless competition. Metal Gear Solid: Portable Ops gets even weirder by featuring a mode called cyber-survival, which is basically a simulated online strategy game. You can deploy squads of your comrades to go online and fight against other squads, and depending on your squad's statistics and how you've arranged and outfitted your four characters, they'll fare better or worse. You can earn new recruits through this process and through some other quirky means, such as scanning for nearby wireless access points, or even using the PSP's GPS device, which is sold in Japan. These types of extras give the game some of that unmistakable Metal Gear Solid personality. This ought to help make the wait for Metal Gear Solid 4 a whole lot more comfortable. Portable Ops looks and sounds fantastic, especially for a portable game. A lot of the environments are pretty basic, but the character models are really impressive, especially for Snake, with his shiny, new sneaking suit. Bloodthirsty MGS fans may be disappointed by the lack of blood in this game, which is noticeably absent after MGS3's somewhat gruesome throat-slashing moves. This game is still rated M for Mature, but apart from some stylized violence in some of the cinematic cutscenes, it's not clear why. The Metal Gear Solid series is renowned for the quality of its presentation, and Portable Ops lives up to this high standard. Likewise, the audio is excellent, particularly the cinematic musical score that sounds straight out of a spy thriller. The many original compositions are right on par with the excellent music from MGS3. David Hayter reprises his role as the voice actor for Snake and once again puts in a strong performance, with that affected low growl of his. The voices for some of the villains are even better, and help give these characters their distinct personalities. Ever since 2001's stupefying Metal Gear Solid 2, this series has strived to be more coherent in its storytelling without sacrificing the sheer detail and convoluted tone that MGS is known for. At the same time, the gameplay has continued to become more and more freeform, letting you choose how best to approach a tactical situation rather than forcing you to figure it out through trial and error. Metal Gear Solid: Portable Ops features some great new ideas along these lines, along with a story that will have fans of the series talking for months. Though clearly best suited for Metal Gear Solid fans, it's one of the best, most ambitious games to date for the PSP. The missions themselves tend to be simple and straightforward, often requiring little more than reaching a particular destination. While few of the missions stand out as being memorable, their brevity is mostly to the game's credit, since having a large number of bite-sized missions makes a great fit for a portable game. The story proceeds as your spies recover reports of key information or locations, so you'll gradually unlock more and more places to go. The routine stealth action missions, which commonly pit you against some rather intelligent but fairly predictable enemy guards, are sometimes interrupted by a key story mission of some sort, as well as the occasional boss fight. The boss fights in Portable Ops aren't quite as puzzle-driven in nature as those of some of the past Metal Gear Solid games, instead boiling down to some pure shoot-outs against some very tough foes. At the normal difficulty setting (an easy setting and an unlockable ~extreme~ setting are also available), some of these boss fights can be very, very tough, requiring patience and strategy. The story will compel you to figure out how to succeed. If you've played Metal Gear Solid 3, you'll be able to dive right into Portable Ops. The open-ended structure of Portable Ops is mostly well thought out and gives this game a different feel from past MGS installments. However, some aspects of it, such as how most soldiers look and play identically, aren't fully baked. There's a pretty high level of abstraction involved in assigning spies to territories and things like that, and your spies are never in any danger of being caught. In fact, the entire tactical map is highly abstract, so you never get a cohesive sense of being in a South American military base, nor do you get an impression that all of the enemies throughout the levels have anything to do besides walk back and forth, wondering when Snake's going to drop in. Nevertheless, there's so much interesting gameplay and depth to explore that suspending your disbelief around these types of issues shouldn't be difficult. There's also that whole multiplayer mode, remember that? From the main menu, you can jump into a six-player ad hoc versus game, and there's a game-sharing option if you'd like to start a quick deathmatch with some friends using just one copy of the game. You can also trade comrades with other Portable Ops players. The real meat of the multiplayer experience is somewhat buried within the tactical map interface, though. If you've played Metal Gear Online as part of MGS3: Subsistence, you'll know what to expect, but it's remarkable to play a fully featured online shooter such as this in a portable format. The control scheme translates quite well to a multiplayer mode, though again, this really isn't much of a pick-up-and-play game; so perhaps the reason the online mode is nestled within the campaign is because by the time you can get to it, you'll have already learned the controls to some extent. There are plenty of multiplayer options here to keep you busy for a long time. Not all of the multiplayer modes from Subsistence are in here, as multiplayer is limited to deathmatch, team deathmatch, and capture the flag. You have a basic auto-aim ability with your weapons, but by manually aiming from a first-person viewpoint, you can instantly kill opponents with a shot to the head. Besides a whole bunch of guns, you'll get to use grenades, mines, and even those incredibly distracting dirty magazines in battle, and online performance was mostly smooth and stable during our tests on live servers. Interestingly, you get to choose between either ~virtual~ online battles or ~real~ online battles, and in the latter, any of your characters that are killed will indeed be gone afterwards; but whoever killed them may then keep them, sort of like racing for pink slips. Except in a race for pink slips, you can't wave a white flag to give up and live to fight another day--you do have that option here. At any rate, since it's based on a tried-and-true concept, the online multiplayer portion of Portable Ops is quite impressive, though the fairly complex controls and quick, brutal rounds will naturally attract a hardcore subset of MGS players. So don't expect anything less than ruthless competition. Metal Gear Solid: Portable Ops gets even weirder by featuring a mode called cyber-survival, which is basically a simulated online strategy game. You can deploy squads of your comrades to go online and fight against other squads, and depending on your squad's statistics and how you've arranged and outfitted your four characters, they'll fare better or worse. You can earn new recruits through this process and through some other quirky means, such as scanning for nearby wireless access points, or even using the PSP's GPS device, which is sold in Japan. These types of extras give the game some of that unmistakable Metal Gear Solid personality. This ought to help make the wait for Metal Gear Solid 4 a whole lot more comfortable. Portable Ops looks and sounds fantastic, especially for a portable game. A lot of the environments are pretty basic, but the character models are really impressive, especially for Snake, with his shiny, new sneaking suit. Bloodthirsty MGS fans may be disappointed by the lack of blood in this game, which is noticeably absent after MGS3's somewhat gruesome throat-slashing moves. This game is still rated M for Mature, but apart from some stylized violence in some of the cinematic cutscenes, it's not clear why. The Metal Gear Solid series is renowned for the quality of its presentation, and Portable Ops lives up to this high standard. Likewise, the audio is excellent, particularly the cinematic musical score that sounds straight out of a spy thriller. The many original compositions are right on par with the excellent music from MGS3. David Hayter reprises his role as the voice actor for Snake and once again puts in a strong performance, with that affected low growl of his. The voices for some of the villains are even better, and help give these characters their distinct personalities. Ever since 2001's stupefying Metal Gear Solid 2, this series has strived to be more coherent in its storytelling without sacrificing the sheer detail and convoluted tone that MGS is known for. At the same time, the gameplay has continued to become more and more freeform, letting you choose how best to approach a tactical situation rather than forcing you to figure it out through trial and error. Metal Gear Solid: Portable Ops features some great new ideas along these lines, along with a story that will have fans of the series talking for months. Though clearly best suited for Metal Gear Solid fans, it's one of the best, most ambitious games to date for the PSP."}