{"ref": "https://www.gamespot.com/reviews/civilization-ii-multiplayer-gold-edition-review/1900-2538414/", "date": "May 1, 2000", "game_name": "Sid Meier's Civilization II", "text": "Civilization II multiplay has finally arrived. Too bad it's a year late. What's more, despite the inclusion of the two previously released scenario packs in the Multiplayer Civilization II: Gold Edition, I can't help but think this game is too little, too late. If this is the best MicroProse can muster at this time to compete with Alpha Centauri and the upcoming Call to Power, then I'm worried about MicroProse's Civ franchise.Multiplayer Civilization II's most obvious feature is multiplayer support. You can play Civ II games over a LAN, Internet, and hotseat. You can set various parameters to street games in any direction you want: huge worlds for long games, small worlds for quick ones. You can set the game to be open to dynamic joining, set respawn for a second chance at the game, and even double movement and production rates for a game. The last feature, doubling of movement and production, is a great feature as it can speed up games significantly.For the most part, this game is well executed. It's stable, and the options are plentiful and helpful. But the question still remains: Should Civilization even be played as a multiplayer game? I love Civilization, and actually played Multiplayer Civilization II for hours, but I did so alone. It's hard enough to get people together to play multiplayer games, let alone ask them to stay for six hours so you can get a good night of Civ II going. And forget about organizing a return trip. I'm not saying it's impossible, just very difficult. The double movement and production definitely helps, but simultaneous turns would have helped immensely as well. Another feature that Multiplayer Civilization II could have used was a matching service.Although the game plays well (it is Civilization after all), one feature of the multiplayer game was very annoying. During a hotseat game, the computer will take over for you if it's not your turn and start negotiating on your behalf! Let's say you end your turn and let your friend take the seat and start his. However, you left a unit near his territory. The minute he encounters this unit, the AI will ask for a meeting between your culture and his. You won't even be able to return to the game and start a negotiation. Instead, the computer will do it for you. When I played, it was shocking to suddenly see the AI trade away all my technology and then give typically stupid threats like ~We tire of this conversation. Pay us 100 gold in tribute or we will crush you.~ I would never negotiate like that, let alone give my rival all my goods. Whoever decided to let the AI take over negotiations in a hotseat game must have lost his mind. I'm standing right next to my friend. If there was a split screen on the computer with diplomacy options, we could simply negotiate in person and then finalize it by clicking the proper buttons on the screen.Aside from the dubious bonus of multiplayer support, the other features in Multiplayer Civilization II include the scenarios from the two Civilization II scenario packs: Conflicts in Civilization and Fantastic Worlds. These expansion packs offer a variety of engaging and clever scenarios, designed by MicroProse and by fans on the Internet. Some scenarios take historical conflicts, like the Mongol invasion or the Crusades, and turn them into fun, goal-oriented minigames, complete with new and unique units. Other scenarios, such as the fantasy and X-COM ones, are even more ambitious and completely overhaul the game with scores of new technologies and troops. For a Civilization II fan, the scenarios should provide great amounts of fun gameplay. However, something I had hoped MicroProse would fix in this game was the AI. Pathfinding is still a little sketchy, but I don't know why it couldn't have been improved. MicroProse spent nearly two years on this game, and it can't even patch the AI?As a Civilization fan, I am of two minds about Multiplayer Civilization II. I've always wanted to play Civilization with my friends, but it's hard to get enough people together and stay together to play a full game, and this edition doesn't go far enough to make multiplayer games quicker. I also already own Civilization II, so for me, there really is no benefit. However, if you don't already own Civilization II, I would recommend Multiplayer Civilization II because it not only has the original game, but also the two scenario packs. Just consider the multiplayer support a welcome bonus that will more than likely collect virtual dust on your hard drive."}