{"ref": "https://www.gamespot.com/reviews/team-fortress-2-launch-review/1900-6190347/", "date": "January 29, 2014", "game_name": "Team Fortress 2", "text": "As one of the first shooters to pioneer team- and class-based gameplay, the first Team Fortress quickly became a favorite among the online community, inspiring devotion and spawning innumerable user-created modifications that many still play today. Team Fortress 2 was announced almost a decade ago as a sequel to the original mod, and went through many transformations and design iterations before its release last October as part of The Orange Box. At heart, TF2 remains true to its roots, pitting two teams against each other in objective-based competition. Players on both teams select one of nine character classes, each with their own unique abilities, strengths, and weaknesses. TF2's cartoon aesthetic and stripped-down classes belie its complexity, and the dynamic interplay of abilities and strategies is nuanced, hectic, and challenging. The result is a fantastic multiplayer experience that proves itself a worthy successor to its seminal ancestor.As a purely multiplayer game, Team Fortress 2 has no need for a storyline. Instead, it has characters. Each class is a uniquely styled character with his own amusing personality (some of whom have been featured in hilarious ~Meet The...~ video features that are readily available online). These classes come equipped with three weapons, generally classifiable as a primary gun, a secondary weapon, and a melee weapon. For example, the soldier class comes armed with a rocket launcher, a shotgun secondary weapon, and a shovel for close quarters combat. Classes are grouped into offense, defense, and support, though their actual roles in combat are far more fluid. The offensive group includes the scout, the pyro, and the soldier. The scout is lean, fast, and nimble (he can double-jump), but light on health. He can capture points twice as fast as other classes and can quickly gun down less robust classes, but his relatively low health makes him highly susceptible to sentry guns and the Heavys minigun. The pyro wears a black flame-retardant suit to protect himself from his flamethrower, which can light opponents on fire. While deadly at close range and in enclosed spaces, the pyro is much less effective in open areas. The soldier wields a powerful rocket launcher that is effective at any range, though its small clip and slow reload rate can be a hindrance.In the defensive group you'll find the demoman, the heavy, and the engineer. Demomen have grenade launchers that can ricochet shots around corners, and remote-detonated sticky bombs that are great for setting traps. Heavies have the most health, but are also the slowest since they carry a giant minigun that can shred nearby opponents in seconds. Engineers have the unique ability to build structures, like sentry guns, ammo/health dispensers, and teleporters. Though they are armed with shotguns as well, their primary concern is building and maintaining their machines in strategic locations.Just as being part of a fluid, coordinated team is truly excellent, so too is being part of a fractured, dysfunctional team truly frustrating.Though different classes clearly lend themselves to different roles on the battlefield, the strategies each can employ are far from limited, and it can be difficult at first to decide which class to play. While certain classes seem more straightforward than others, they all have their nuances that can only be learned over time. Fortunately, you have the option to switch classes every time you respawn, or any time you run back into the spawn point. This gives both teams the flexibility to change strategies on the fly, and it's one of the key elements that make Team Fortress 2 so dynamic.This flexibility can also cause problems, especially for teams that aren't communicating properly. If half the team decides to switch it up while the other half decides to stay the course, the resulting disarray can scuttle your chances of victory. There are useful hotkeys that allow you to send quick messages, and many players use voice chat to stay on point. Still, many a team has fallen to defeat due to dissonant strategy, and as such Team Fortress 2's biggest strength is also its biggest liability. Your success is tied to your team's success and, in part, so is your enjoyment of the game. Just as being part of a fluid, coordinated team is truly excellent, so too is being part of a fractured, dysfunctional team truly frustrating. These are two extremes, to be sure, but such is the inconsistent nature of a game experience that depends so wholly on other players. Fortunately, most of the TF2 experience falls somewhere between those two extremes. Every game mode demands a cooperative strategy (there are no Deathmatch modes), but the basics aren't hard to grasp. In the Capture the Flag mode, players must grab a briefcase of intelligence from the opposing team's base and return it to their own. In the Control Point mode, teams fight to capture all the control points on the map. The Attack/Defend mode challenges one team to capture the control points while the other team defends, and teams switch roles between rounds. Each of the maps is designed for one or two specific game modes, and all are meticulously designed to create numerous strategic approaches for both teams.Since the game's release last October, Valve has released a few new maps and game modes, slowly expanding the somewhat sparse catalog. They have also recently released three new weapons for the medic that you unlock by completing achievements. These weapons feature slight stat tweaks and new abilities that add a new element of customization to the class, and no doubt herald future weapon deployments for the other classes. While this did cause a (hopefully) temporary imbalance in the number of people playing as medics and a rise in overtly self-interested tactics, it offers new challenges and goals for players. This new content helps extend the replay value of TF2, which makes the high price point a little easier to swallow.Valve has done a fantastic job creating and balancing the maps, classes, and other game elements that are within their control. Still, Team Fortress 2 is a purely multiplayer game and, as such, lives and dies by the team. Most of the time you'll find yourself well matched, but the inherent uncertainty of the game can make for some vexing sessions. Your best move is to seek out friends and servers that are least likely to yield such sessions, and then enjoy the fertile battlegrounds that Team Fortress 2 so expertly cultivates. You'd be remiss not to reap this harvest."}