{"ref": "https://www.gamespot.com/reviews/grand-theft-auto-liberty-city-stories-review/1900-6136849/", "date": "October 28, 2005", "game_name": "Grand Theft Auto: Liberty City Stories", "text": "Call it Grand Theft Auto Gaiden. While there have been handheld takes on the GTA series in the past, none of them have ever properly captured the things that made the modern installments in the series so popular. Things like the sprawling environments, its fast-action freestyle mayhem, and, of course, the series' great sense of humor just haven't come across on a handheld before. Grand Theft Auto: Liberty City Stories is not without its problems, either; but it gets enough of the series' signature features in there to do you right. Toni Cipriani is a no-nonsense kind of guy. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Grand Theft Auto: Liberty City Stories Video Review Liberty City Stories brings you back to Rockstar's fictional take on New York City, first seen this way in 2001's revolutionary GTA III. This time around, the year is 1998, and you play the role of a returning wise guy named Toni Cipriani, who works for Salvatore Leone. Upon your return to town, you get right back to work, because the Leone crime family is about to start getting it from all sides. As you ascend to become Salvatore's right-hand man, you'll start and finish gang wars with other mafia types, a few triads, the yakuza...pretty much all of the usual suspects are present. If you're familiar with the various mafia presences over the course of the past three GTA games, you'll recognize a few of the names and faces here. But the story stands alone and doesn't require you to remember the various cast members. That's a good thing, because the mafia characters in the other GTA games have been largely forgettable. The game's storyline really isn't up to par with the console installments in the series, because very little actually happens. Even potential plot points, like when Toni finally becomes a made man, are squandered by a bad cutscene that doesn't actually show the ceremony. The game's mission path doesn't deviate into crazy territory, and most of the characters are fairly lifeless. There are no enigmatic weirdos like Truth, the crazy hippie from San Andreas, or Steve Scott, the porno director from Vice City, to break up the heavier-handed mafia tasks. This dulls the game's personality, preventing its characters and events from becoming as memorable as we've come to expect from GTA games and their excellent storylines. If you stick to the missions and don't mess around too much, you can finish the game's story mode in 10 to 12 hours. But the deceptive game-progress counter will only report around 40-percent completion if you stick close to the missions and don't do much else. The game has some rampage side missions and the standard pizza delivery, vigilante, taxi service, and ambulance missions, too. You can seek out ringing pay phones to get into street races. You can report to car lots to sell cars or motorcycles by test-driving vehicles for prospective consumers. And, of course, there are 100 hidden packages to find. If you get into all this optional stuff, there's a lot more city to see, and plenty of different cars to see it in. The game's different outfits let you change your look from time to time. Over the years, the missions in Grand Theft Auto have gotten more complex, but the overall difficulty has lightened up. The missions in Liberty City Stories, however, are extremely simple for the most part. Most of your given tasks are one-dimensional, such as stealing a specific car and driving it back to a location without wrecking it, or taking out a series of gang members and blowing up their prized tank. A few missions get a little deeper, but at some point, the missions just start to all run together because they aren't very interesting. The combat-heavy missions tend to be a little tougher than the driving tasks, because the game's control scheme occasionally gets in the way. The lock-on targeting in GTA games has always been a little squirrelly, but when you add a less-than-optimal target-changing control to that mix (left and right on the D pad, by default), you end up with some frustrating moments. In missions where you're given a large number of targets to take down, you're better off doing it from a distance with a sniper rifle, if possible. The weapons in Liberty City Stories are what you'd expect from a Grand Theft Auto game. You'll start out finding basic pistols, submachine guns, and shotguns, but over time, your enemies will start to drop higher-powered weaponry. You can only carry one weapon of each type at a time, but ammo for one weapon in a class will work for another, so running over weapons is handy for collecting bullets, even if you don't decide to switch out for a lower-powered weapon. The system works roughly the same way that it worked in GTA: Vice City. In fact, the whole game feels like it's the world of Grand Theft Auto III, with some (but not all) of the Vice City enhancements thrown in. The game has motorcycles, for example. You'll also be able to change your clothes, but this works on an entire-outfit level, not on a piece-by-piece level like in San Andreas. You'll occasionally fight alongside other Leone-friendly gangsters, but they're completely controlled by rudimentary artificial intelligence. You can't issue commands to them like you could in San Andreas. Considering how dopey the AI can be in some spots--we witnessed more than one occasion where our allies decided that the best way to get closer to their target was to run in place up against a wall--a simple ~get over here~ command would have been handy. Liberty City Stories is, first and foremost, an impressive technical achievement. A big, big part of the Grand Theft Auto series has always been that sense of freedom...freedom to cause wanton destruction, that is. It's not a mission, and it's not something that helps your cause, but just loading up on weapons, walking into the street, and attempting to blow up and shoot as many things as possible is among the best, most thrilling aspects of the series. As is trying to escape from the scene of said crime in one of the game's various vehicles. Liberty City Stories allows you to do this much better than any of the other handheld games have, but it still does it on a slightly reduced scale. Police response definitely isn't as fierce as it is in other GTA games. You'll still see helicopters, but the game seems to know exactly when another police car onscreen would send the frame rate screeching down to single-digit territory; so it's possible to take care of all the lawmen in your immediate vicinity and not have more immediately pull up to join the fight. Also, there are a handful of other technical issues that tend to get in the way from time to time. Occasionally, getting into or out of a car causes the game to seize up for a second or so while it loads (or unloads) the radio-station audio. If you're in the middle of a rampage and attempt to dive out of one car and into another while surrounded by angry cops, that's one halt for getting out of the car, which flows into an action sequence with a somewhat choppy frame rate, followed by a total halt when you get into another car to make your escape. It certainly makes sense, given that the technical capabilities of the PSP are definitely below that of the PlayStation 2, but Liberty City Stories comes so close to matching the PS2 experience in so many different ways that these things do tend to stick out at you. That said, it's still fun to drive around the city and cause trouble, thanks in part to the game's variety of cars, each with their own different handling characteristics. One thing that sets Liberty City Stories apart from the recent console games is its inclusion of multiplayer support for up to six players. The game has a handful of basic modes, including takes on deathmatch, capture the flag, and king of the hill. You've got team games as well as free-for-all modes, and you'll unlock more characters and locations as you proceed through the single-player game. While you can play the game with two players, the big environments make playing with two players pretty boring. But in a larger group, the game's definitely got some multiplayer charm. Just don't expect it to steal the show. This Liberty City story has a fairly weak conclusion. Liberty City Stories looks great for the PSP, and it's doing some very ambitious stuff from a technical standpoint. However, some parts of it do look noticeably unsightly. While the frame rate is definitely less than stable, the game still manages to convey a good sense of speed when you're driving fast. The game's characters look about as good as you could hope for, and animate pretty well in the game's many cutscenes. There's a lot of pop-up--pretty much par for the course throughout the GTA series--though here, the horizon is just a bit closer, causing cars to magically materialize just ahead of you on the road. This can make fast driving a little tough at times. Even though it has its bouts with low frame rates, it's easy to be impressed by the way the game handles such large environments. Also, the load times throughout the game are very manageable and never get out of control, which makes the game's large areas even more impressive. The weapons in Liberty City Stories are what you'd expect from a Grand Theft Auto game. You'll start out finding basic pistols, submachine guns, and shotguns, but over time, your enemies will start to drop higher-powered weaponry. You can only carry one weapon of each type at a time, but ammo for one weapon in a class will work for another, so running over weapons is handy for collecting bullets, even if you don't decide to switch out for a lower-powered weapon. The system works roughly the same way that it worked in GTA: Vice City. In fact, the whole game feels like it's the world of Grand Theft Auto III, with some (but not all) of the Vice City enhancements thrown in. The game has motorcycles, for example. You'll also be able to change your clothes, but this works on an entire-outfit level, not on a piece-by-piece level like in San Andreas. You'll occasionally fight alongside other Leone-friendly gangsters, but they're completely controlled by rudimentary artificial intelligence. You can't issue commands to them like you could in San Andreas. Considering how dopey the AI can be in some spots--we witnessed more than one occasion where our allies decided that the best way to get closer to their target was to run in place up against a wall--a simple ~get over here~ command would have been handy. Liberty City Stories is, first and foremost, an impressive technical achievement. A big, big part of the Grand Theft Auto series has always been that sense of freedom...freedom to cause wanton destruction, that is. It's not a mission, and it's not something that helps your cause, but just loading up on weapons, walking into the street, and attempting to blow up and shoot as many things as possible is among the best, most thrilling aspects of the series. As is trying to escape from the scene of said crime in one of the game's various vehicles. Liberty City Stories allows you to do this much better than any of the other handheld games have, but it still does it on a slightly reduced scale. Police response definitely isn't as fierce as it is in other GTA games. You'll still see helicopters, but the game seems to know exactly when another police car onscreen would send the frame rate screeching down to single-digit territory; so it's possible to take care of all the lawmen in your immediate vicinity and not have more immediately pull up to join the fight. Also, there are a handful of other technical issues that tend to get in the way from time to time. Occasionally, getting into or out of a car causes the game to seize up for a second or so while it loads (or unloads) the radio-station audio. If you're in the middle of a rampage and attempt to dive out of one car and into another while surrounded by angry cops, that's one halt for getting out of the car, which flows into an action sequence with a somewhat choppy frame rate, followed by a total halt when you get into another car to make your escape. It certainly makes sense, given that the technical capabilities of the PSP are definitely below that of the PlayStation 2, but Liberty City Stories comes so close to matching the PS2 experience in so many different ways that these things do tend to stick out at you. That said, it's still fun to drive around the city and cause trouble, thanks in part to the game's variety of cars, each with their own different handling characteristics. One thing that sets Liberty City Stories apart from the recent console games is its inclusion of multiplayer support for up to six players. The game has a handful of basic modes, including takes on deathmatch, capture the flag, and king of the hill. You've got team games as well as free-for-all modes, and you'll unlock more characters and locations as you proceed through the single-player game. While you can play the game with two players, the big environments make playing with two players pretty boring. But in a larger group, the game's definitely got some multiplayer charm. Just don't expect it to steal the show. This Liberty City story has a fairly weak conclusion. Liberty City Stories looks great for the PSP, and it's doing some very ambitious stuff from a technical standpoint. However, some parts of it do look noticeably unsightly. While the frame rate is definitely less than stable, the game still manages to convey a good sense of speed when you're driving fast. The game's characters look about as good as you could hope for, and animate pretty well in the game's many cutscenes. There's a lot of pop-up--pretty much par for the course throughout the GTA series--though here, the horizon is just a bit closer, causing cars to magically materialize just ahead of you on the road. This can make fast driving a little tough at times. Even though it has its bouts with low frame rates, it's easy to be impressed by the way the game handles such large environments. Also, the load times throughout the game are very manageable and never get out of control, which makes the game's large areas even more impressive. The audio end of Liberty City Stories is structured identically to how it's done in the ~big~ games, but again, on a slightly smaller scale. The cutscenes are given full speech, and for the most part, the characters are well-portrayed and voiced, even if you don't recognize most of the names in the credits. Whenever you're in a car, you can listen to a handful of different radio stations; as you'd expect, it's here where the game gets its jokes in. From commercials telling you that the Internet is clearly a tool of the devil that ruins lives (which is true) to ads for generic mascot-driven kart-racing games, there's a lot of funny stuff here. However, the radio stations loop more frequently than you'd probably like, presumably due to storage limitations. If you've played previous Grand Theft Auto games, you might recognize some of the characters; but previous knowledge isn't required to understand the story. The music in the past two Grand Theft Auto games has been incredibly important in setting the game's tone. The '80s music in Vice City and the rap stations in San Andreas were key to both the tone and the pace of those two games. The PSP game's soundtrack doesn't really serve as the same type of pop-culture touchstone. The rap station, hosted by DJ Clue, depicts a pretty accurate take on late-'90s East Coast mix-tape and rap radio. A bunch of the music on the other stations, however, was custom-written for the game, with a focus on sounding sort of like various forms of pop music. While 1998 might be a little too recent to get nostalgic about, there's still a bunch of really awful boy-band pop music from 1997 and 1998 that would have made for perfect ~driving around and running over cops~ music, so it's disappointing that some higher-profile stuff didn't get licensed. The game has a custom soundtrack feature, as well, but it doesn't directly work with any of the audio already on your PSP memory stick. Instead you have to download a custom CD ripping application that Rockstar has developed and inject the audio into your saved game. Additionally, it's been built to only work with commercial CDs, so your sizable MP3 collection is apparently useless. Considering that the PSP already has MP3 file playback, it seems strange that you have to jump through so many hoops to get custom music. It's worth mentioning that this game makes absolutely no concessions when it comes to making it a little friendlier as a portable game. You still save at safehouses, still have to drive your way to each mission, and still have to start the entire mission over again if you fail. When you're busted or wasted on a mission, the game spawns a taxi that will take you back to the mission start point, if you desire. But that would put you at the beginning of the mission with no weapons, no armor, nothing. That's not much of a help, so you're left reloading your game every time something goes wrong and going out of your way to save as often as possible. Squeezing all of Liberty City onto a UMD is a neat trick. If you're the type of person that plays your PSP games sitting down, at home, in large chunks, this doesn't make any real difference. But if you're an on-the-go sort of person who tries to squeeze in a few minutes of GTA here and there, the time it takes to get into a mission and start making progress might be a bit too much. Some in-mission checkpoints or other options would have probably solved this problem. At least the PSP has sleep mode--you won't have to load the entire game up just to play for a few minutes. Also, it's worth mentioning that while the game seems to be spinning the disc almost constantly, there doesn't seem to be a noticeably heavy drain on the system's battery life. You'll get roughly the same amount of battery life out of GTA than you would out of most other PSP games. It's really pretty amazing that GTA: Liberty City Stories manages to cram in so much of the GTA experience that you're used to seeing on consoles. While the game is definitely a fine technical achievement and one of the best PSP games to date, the dull storyline and basic mission design do bring the whole thing down a bit. Maybe it's not entirely reasonable to expect for this game to live up to its console counterparts in every respect, but it retails for just as much as they did, and attempts to do many of the same exact things, so it really is a whole new GTA (just in a familiar setting). Yet for all it squeezes out of the PSP, it doesn't quite squeeze everything that makes the GTA series so special. But if what you're after is a game that looks and plays like a Grand Theft Auto game for your PSP, you'll definitely be satisfied. The audio end of Liberty City Stories is structured identically to how it's done in the ~big~ games, but again, on a slightly smaller scale. The cutscenes are given full speech, and for the most part, the characters are well-portrayed and voiced, even if you don't recognize most of the names in the credits. Whenever you're in a car, you can listen to a handful of different radio stations; as you'd expect, it's here where the game gets its jokes in. From commercials telling you that the Internet is clearly a tool of the devil that ruins lives (which is true) to ads for generic mascot-driven kart-racing games, there's a lot of funny stuff here. However, the radio stations loop more frequently than you'd probably like, presumably due to storage limitations. If you've played previous Grand Theft Auto games, you might recognize some of the characters; but previous knowledge isn't required to understand the story. The music in the past two Grand Theft Auto games has been incredibly important in setting the game's tone. The '80s music in Vice City and the rap stations in San Andreas were key to both the tone and the pace of those two games. The PSP game's soundtrack doesn't really serve as the same type of pop-culture touchstone. The rap station, hosted by DJ Clue, depicts a pretty accurate take on late-'90s East Coast mix-tape and rap radio. A bunch of the music on the other stations, however, was custom-written for the game, with a focus on sounding sort of like various forms of pop music. While 1998 might be a little too recent to get nostalgic about, there's still a bunch of really awful boy-band pop music from 1997 and 1998 that would have made for perfect ~driving around and running over cops~ music, so it's disappointing that some higher-profile stuff didn't get licensed. The game has a custom soundtrack feature, as well, but it doesn't directly work with any of the audio already on your PSP memory stick. Instead you have to download a custom CD ripping application that Rockstar has developed and inject the audio into your saved game. Additionally, it's been built to only work with commercial CDs, so your sizable MP3 collection is apparently useless. Considering that the PSP already has MP3 file playback, it seems strange that you have to jump through so many hoops to get custom music. It's worth mentioning that this game makes absolutely no concessions when it comes to making it a little friendlier as a portable game. You still save at safehouses, still have to drive your way to each mission, and still have to start the entire mission over again if you fail. When you're busted or wasted on a mission, the game spawns a taxi that will take you back to the mission start point, if you desire. But that would put you at the beginning of the mission with no weapons, no armor, nothing. That's not much of a help, so you're left reloading your game every time something goes wrong and going out of your way to save as often as possible. Squeezing all of Liberty City onto a UMD is a neat trick. If you're the type of person that plays your PSP games sitting down, at home, in large chunks, this doesn't make any real difference. But if you're an on-the-go sort of person who tries to squeeze in a few minutes of GTA here and there, the time it takes to get into a mission and start making progress might be a bit too much. Some in-mission checkpoints or other options would have probably solved this problem. At least the PSP has sleep mode--you won't have to load the entire game up just to play for a few minutes. Also, it's worth mentioning that while the game seems to be spinning the disc almost constantly, there doesn't seem to be a noticeably heavy drain on the system's battery life. You'll get roughly the same amount of battery life out of GTA than you would out of most other PSP games. It's really pretty amazing that GTA: Liberty City Stories manages to cram in so much of the GTA experience that you're used to seeing on consoles. While the game is definitely a fine technical achievement and one of the best PSP games to date, the dull storyline and basic mission design do bring the whole thing down a bit. Maybe it's not entirely reasonable to expect for this game to live up to its console counterparts in every respect, but it retails for just as much as they did, and attempts to do many of the same exact things, so it really is a whole new GTA (just in a familiar setting). Yet for all it squeezes out of the PSP, it doesn't quite squeeze everything that makes the GTA series so special. But if what you're after is a game that looks and plays like a Grand Theft Auto game for your PSP, you'll definitely be satisfied."}