{"ref": "https://www.gamespot.com/reviews/jetfighter-iv-fortress-america-review/1900-2654162/", "date": "November 15, 2000", "game_name": "JetFighter IV: Fortress America", "text": "The JetFighter series has long had a reputation for being light on realism but long on fun. Previous games bearing the title have been just realistic enough to resemble true flight simulations and have emphasized good graphics, fun mission objectives, and intense combat rather than exacting technical detail. With JetFighter IV: Fortress America, Mission Studios has returned to the formula that made JetFighter III a hit: to make the graphics good without compromising a fast frame rate and to wrap the whole thing in frantic action. The result is a fun air combat game that doesn't simulate much but should still provide the casual jet pilot with many hours of bandit hunting. The premise behind JetFighter IV is that an alliance between Russia, China, and North Korea (called ~The Coalition~) has been formed to challenge America's supremacy as the world's only superpower. These countries then set about to attack California. It's your mission to stop them - and stop them you can, in a large branching campaign and numerous individual scenarios. However, you can fly only for the US armed forces; there's no opportunity to fly any Russian aircraft. JetFighter IV lets you choose from three different flyable aircraft: the F/A-18 Hornet, the F-14 Tomcat, and the F-22 Raptor. While this may seem like a good variety of planes, the fact is that all three aircraft basically fly the same using JetFighter IV's flight model. There is almost no difference between the Tomcat, a large aircraft designed as a long-range antiaircraft missile platform for fleet defense, and the nimble Raptor. In fact, the entire flight model is generous to the point of not seeming very realistic at all. The aircraft seem to float rather than fly, and even when the realism options - such as redouts and blackouts - are turned on, JetFighter IV's flight experience seems even more artificial than those of its predecessors. The avionics in JetFighter IV are not much more detailed than the flight models, and they leave you free to concentrate on lining up your targets rather than worrying about your weapon mode. JetFighter IV boasts photo-realistic terrain of the entire San Francisco Bay Area, including all the familiar landmarks. There is an option to install a set of high-resolution textures from the second CD for even more impressive visuals, but using these bumps up the hardware requirements. Even without the high-res option, JetFighter IV looks very good, although it doesn't quite match the gorgeous terrain standard set by Jane's USAF. The familiar surroundings serve to give JetFighter IV a sense of context, which makes the missions that much more immersive and involving. Mission Studios has also done an excellent job of making the game run well on midrange systems - you won't have to turn down the graphical detail to get a good frame rate. Players with a wide variety of hardware should be able to enjoy JetFighter IV's graphics. The JetFighter series has always included a challenging campaign as well as plenty of furious dogfighting, and you'll find both of these features in JetFighter IV. The missions range from strikes against enemy task forces to hunting down stolen tanks, and while the enemy artificial intelligence isn't particularly adept, the mission objectives are tough enough to make the game interesting. The change of venue from airfield to carrier and ocean to desert also keeps the game sufficiently varied. As with many games these days, it appears JetFighter IV shipped with incomplete or nonfunctional features to meet a production deadline. Even though force feedback controllers are a menu option, the game actually doesn't support them at all, and the multiplayer capability is likewise absent even though there is a multiplayer setup screen. Both of these features were taken out at the last minute due to problematic code, and TalonSoft has promised that these will be fixed with a patch. For now, JetFighter IV is a solo game only and does not support force feedback. Despite these problems, JetFighter IV is a light and enjoyable sim for those who don't want to have to invest hundreds of hours learning a much more detailed, complex simulation. The campaign carries the game along well, and the single scenarios and random mission generator will provide a lot of replay value even when the campaign is over. Only the lack of multiplayer is a limiting factor. JetFighter IV is a good choice for those who favor action over realism and even for hard-core sim pilots who are looking for a change of pace."}