{"ref": "https://www.gamespot.com/reviews/xiaolin-showdown-review/1900-6164301/", "date": "January 17, 2007", "game_name": "Xiaolin Showdown", "text": "While there's something to be said for the accessibility of simple, straightforward games, it's the notion that kids can't handle or appreciate more sophisticated games, or media in general, that causes mindless trash like Xiaolin Showdown to come to bear. It's based on the unremarkable children's cartoon of the same name, which would be indistinguishable from the numerous other post-Powerpuff Girls action comedy cartoons out there were it not for the way it also clumsily cops a broadly Asian theme that ranges from old kung-fu movies to Dragon Ball Z. Uninspired source material aside, Xiaolin Showdown is still a crummy excuse for a four-player, arena-based brawler that's weighed down by a poorly realized lock-on system, crushingly monotonous enemy designs, and crude visuals. This is what happens when a publisher's licensing department gets to choose what games get made. You'll play Xiaolin Showdown as one of the four monks-in-training from the show--the diminutive Omi, the brash Raimundo, the fiery Kimiko, and the gentle giant Clay. Despite their divergent appearances, there's little functional difference. The game supports up to four players, though if you're playing on your own you'll be joined by three computer-controlled characters. The additional fighters make the scene a bit livelier, but it's also a major source of tedium, due to a lousy lock-on system, which makes it all too easy to target friendly characters. The game indicates whom you're locked onto by placing a column of light above the character, but the light flash is too brief, and it's oddly difficult to disengage the lock once you're already homed in. You have two basic attack buttons that you can mash into multihit combos, and you can also leap around and pick up barrels and jugs to throw at enemies. But because the lock-on system doesn't work particularly well, the easiest way to best your opponents is to jump in the air and repeatedly perform the basic homing attack. Your fighting style doesn't evolve much over the course of the adventure mode, but the effectiveness of this basic air attack makes many of your other attacks null and void. You'll travel to a series of arena-shaped environments and do battle with the minions of evil boy-genius Jack Spicer, of which there are three different types for you to fight over the course of the game. Before you go into a new level, you can equip your character with up to three different forms of Shen Gong Wu, which is basically a fancy, trademarkable name for ~special move.~ The Shen Gong Wu, which you have to charge up by collecting colored spheres that fall out of your enemies, can have varying effects. The most common effect is to stun and immobilize enemies within a small radius, making it easier to beat the snot out of them. As with the lock-on system, though, your comrades can get caught up in the effects of the Shen Gong Wu, and the stun effects can be surprisingly long-lasting. Or maybe it just seems that way when you find yourself stuck in a giant block of ice, thanks to one of your buddies, unable to do anything for a good five or 10 seconds. As irritating as the game is most of the time, there are some side games where the ability to take on the other monks makes some kind of sense. As you punch the same generic-looking robots over and over again, new forms of Shen Gong Wu will show up in the arena. A new form isn't simply granted to the person who grabs it first; everyone is forced to compete in a Xiaolin Showdown to see who gets it. The showdowns, which can also be played separately from the adventure mode, stick to familiar formats, such as king of the hill, keep-away, and a game of tag where you want to avoid being ~it~ for the longest amount of time. If you want to raise the stakes, you can put one of the Shen Gong Wu that you've already earned on the line, and if you win the showdown, you'll get to steal a Shen Gong Wu from one of the other players. It's a slight break from the game's usual tedium, but it's still plagued by the same crummy lock-on system as the rest of the adventure mode. Punching robots should be way more fun than this. For as totally bland and derivative as the gameplay in Xiaolin Showdown is, at least the presentation is colorful. The novelty of cel-shading may have worn off years ago, though it still helps reinforce Xiaolin Showdown's animated source material. That said, the environments are small, the characters are simple and repetitive, and the textures are pretty chunky looking. Several of the voice actors from the show put in time here, including industry vets Tom Kenny and Maurice LaMarche, though it's the character of Dojo, the friendly, wisecracking dragon, that got the most time on the microphone. He's not voiced by Wayne Knight (aka Newman) as he is in the show; instead, the duties fell to a stand-in whose voice grates on the nerves, an effect that's exacerbated by voice clips that repeat ad nauseam. The game appears on the PlayStation 2, Xbox, and PSP, but aside from the minor differences you can expect from the systems, the versions are functionally identical. There's something really condescending about Xiaolin Showdown. Whenever a new objective appears, the game comes to a screeching halt, and even if you've seen this type of objective a dozen times before, the game still explains what you're supposed to do, in painstaking detail, every single time. Additionally, it seems to be impossible to run out of health in Xiaolin Showdown, a suspicion that's backed up by the fact that there are no meters of any kind onscreen as you play. The game's disrespect for the intelligence of the player and its stale gameplay are sufficient reasons to avoid what is essentially a cynical marketing product."}