{"ref": "https://www.gamespot.com/reviews/total-war-rome-remastered-review-et-tu-total-war/1900-6417671/", "date": "May 5, 2021", "game_name": "Rome: Total War", "text": "The enemy outnumbers us two-to-one and reinforcements are still days away. The raucous Gaul army is at our gates, baying for blood; each enemy soldier is coated in white and blue war paint and a select few operate battering rams that'll plough through our modest wooden defenses in a matter of minutes. The scent of death is in the air and we've got no choice but to stand our ground and fight. ~One of you is worth any number of them,~ bellows our general, shattering the tense silence with an impassioned war cry. ~We face adversity, a band of brothers, dedicated to the warrior's code of strength and victory,~ he continues, rallying the troops. ~But we will never know defeat while we stand together! This day we add another triumph to the history of our people! We will be honored as men!~Whether you go on to achieve victory or succumb to overwhelming odds, moments like this are part of what made Rome: Total War such a beloved strategy game when it launched in 2004--and why its popularity still persists today. It put Total War on the map and laid the groundwork for what has since become a blockbuster series in the strategy genre. With Total War: Rome Remastered, developer Feral Interactive has updated Creative Assembly's seminal title by overhauling the visuals and adding a number of quality of life improvements that make it slightly more appealing for modern sensibilities. Under the hood, however, this is still very much the same game as it was back in 2004, for better or worse.The Imperial Campaign, for instance, still ingeniously divides the Roman empire into three powerful families: the Julii, Bruti, and Scipii. While there isn't a discernible difference between the three factions in terms of units and building types, each one is fighting wars on different fronts in a bid to conquer the region and expand Rome's power and influence. The Julii are entrenched in a battle with the aforementioned Gauls and Germania in the north, the Bruti clash with the Greek city-states in the southeast, while the Scipii are tasked with defeating Carthage in the southwest. Eventually, all of these disputes turn inward as the three factions descend into a bloody civil war with each other for sole control of Rome. This gradual collision course propels the campaign along and gives the late game a momentous shot in the arm that maintains the intensity until your final turn.Total War: Rome Remastered hasn't messed with this engaging setup, although you can now play as the other 15 factions without having to unlock them first--unless you'd prefer to do it the old-fashioned way by defeating each faction during the campaign as one of the Romans. When it comes to upgrades, the most obvious ones are visual, with improved lighting and more detailed terrain making both the battlefields and world map pop with added vibrancy. Environments are still overly sparse, which does make battles fairly lackluster to watch unless elephants are hurling soldiers 30 feet in the air, and the updated units aren't nearly as impressive either, falling some way short of the graphical fidelity we're used to seeing in modern Total War games. As a trade-off, however, Total War: Rome Remastered does feature an experimental ~Extreme~ setting for unit sizes, allowing you to partake in chaotic battles with an overwhelming number of forces, provided your hardware can handle it. Though loading times are still lengthy no matter which unit size you choose--even if you're running the game off an SSD--which can make the campaign fairly laborious at times.Most of the other changes revolve around the UI and improving its readability. A new faction summary gives you immediate access to basic information such as your allies and enemies, number of family members, and your rankings for military, population, and so on. Meanwhile, quick lists allow you to see a useful overview of all of your settlements, armies, agents, and fleets, with all of their relevant stats included. There are also a number of new screens for the world map that give you information on the current state of your campaign at a glance. This includes color-coded factions so you can quickly see who owns what, where specific resources are, and the location of fortifications such as chokepoints and watchtowers.All of these changes make it easier to engage with Total War: Rome Remastered's empire management. You'll spend most of your time choosing how to improve your settlements, whether that's opting to invest in your city's infrastructure to increase population growth and boost public order, upgrade trade to receive immediate income, or build military structures to amass an army and gain access to new units. You'll also need to micromanage the various agents at your disposal, such as spies that can infiltrate enemy cities to learn about their infrastructure and units, and potentially open up the gates if you decide to try and seize the settlement for yourself. Or the newly added agent type merchants, that can be placed in settlements to generate income or placed on resource nodes to monopolize whichever material is located there. You'll also have to contend with rioting, diplomacy, and bribes, appoint governors and generals, and so much more. Rome: Total War's strategic depth has remained intact, and there's now a modern tutorial that makes it easier to digest if you're a newcomer or revisiting the game again for the first time in 18 years.Unfortunately, the real-time tactical battles don't hold up quite as well as the empire management. These skirmishes are clunky, particularly in cities where the AI pathfinding struggles to navigate with any semblance of rhyme or reason, and they lack the dynamism of modern Total War battles. The main culprit for this is the enemy AI, which is easy to trick and defeat with adept use of your cavalry units and obvious feints. It's too passive to put up much of a fight, and its use of simplistic tactics turns most battles into a dull slog. All of this contributes to making the auto-resolve button more tempting than it should be.It's difficult to recommend Total War: Rome Remastered to anyone who didn't already play and love the original game as the series has significantly evolved for the better over the past 18 years. A new lick of paint and some quality of life improvements aren't enough to make this remaster an appealing option for newcomers when better Total War games already exist. That's not to say it doesn't deserve its place either. At this point, Rome: Total War is unaccommodating on modern hardware, so this remaster solves that issue with an improved and updated version of the original game. It might not stack up against its contemporaries, but Total War: Rome Remastered is the best way to play a series classic, warts and all."}